    <f7053>   DW_AT_type        : <0xf7057>
 <1><f7057>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7058>   DW_AT_byte_size   : 8
    <f7058>   DW_AT_type        : <0xf705c>
 <1><f705c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f705d>   DW_AT_prototyped  : 1
    <f705d>   DW_AT_type        : <0xf68c2>
    <f7061>   DW_AT_sibling     : <0xf706b>
 <2><f7065>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f7066>   DW_AT_type        : <0xf68c2>
 <2><f706a>: Abbrev Number: 0
 <1><f706b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f706c>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <f7070>   DW_AT_decl_file   : 10
    <f7071>   DW_AT_decl_line   : 68
    <f7072>   DW_AT_decl_column : 23
    <f7073>   DW_AT_type        : <0xf7077>
 <1><f7077>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7078>   DW_AT_byte_size   : 8
    <f7078>   DW_AT_type        : <0xf707c>
 <1><f707c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f707d>   DW_AT_prototyped  : 1
    <f707d>   DW_AT_type        : <0xf68c2>
    <f7081>   DW_AT_sibling     : <0xf709f>
 <2><f7085>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f7086>   DW_AT_type        : <0xf6f32>
 <2><f708a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f708b>   DW_AT_type        : <0xf6f32>
 <2><f708f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f7090>   DW_AT_type        : <0xf6f32>
 <2><f7094>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f7095>   DW_AT_type        : <0xf6f32>
 <2><f7099>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f709a>   DW_AT_type        : <0xf6f32>
 <2><f709e>: Abbrev Number: 0
 <1><f709f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f70a0>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <f70a4>   DW_AT_decl_file   : 10
    <f70a5>   DW_AT_decl_line   : 69
    <f70a6>   DW_AT_decl_column : 23
    <f70a7>   DW_AT_type        : <0xf70ab>
 <1><f70ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f70ac>   DW_AT_byte_size   : 8
    <f70ac>   DW_AT_type        : <0xf70b0>
 <1><f70b0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f70b1>   DW_AT_prototyped  : 1
    <f70b1>   DW_AT_type        : <0xf68c2>
    <f70b5>   DW_AT_sibling     : <0xf70ce>
 <2><f70b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f70ba>   DW_AT_type        : <0xf68c2>
 <2><f70be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f70bf>   DW_AT_type        : <0xf68c2>
 <2><f70c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f70c4>   DW_AT_type        : <0xf68c2>
 <2><f70c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f70c9>   DW_AT_type        : <0xf68c2>
 <2><f70cd>: Abbrev Number: 0
 <1><f70ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <f70cf>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <f70d3>   DW_AT_decl_file   : 10
    <f70d4>   DW_AT_decl_line   : 73
    <f70d5>   DW_AT_decl_column : 23
    <f70d6>   DW_AT_type        : <0xf70da>
 <1><f70da>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f70db>   DW_AT_byte_size   : 8
    <f70db>   DW_AT_type        : <0xf70df>
 <1><f70df>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f70e0>   DW_AT_prototyped  : 1
    <f70e0>   DW_AT_type        : <0xf68c2>
    <f70e4>   DW_AT_sibling     : <0xf70ee>
 <2><f70e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f70e9>   DW_AT_type        : <0xf689f>
 <2><f70ed>: Abbrev Number: 0
 <1><f70ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <f70ef>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <f70f3>   DW_AT_decl_file   : 10
    <f70f4>   DW_AT_decl_line   : 74
    <f70f5>   DW_AT_decl_column : 23
    <f70f6>   DW_AT_type        : <0xf70fa>
 <1><f70fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f70fb>   DW_AT_byte_size   : 8
    <f70fb>   DW_AT_type        : <0xf70ff>
 <1><f70ff>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f7100>   DW_AT_prototyped  : 1
    <f7100>   DW_AT_type        : <0xf68c2>
    <f7104>   DW_AT_sibling     : <0xf7113>
 <2><f7108>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f7109>   DW_AT_type        : <0xf689f>
 <2><f710d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f710e>   DW_AT_type        : <0xf6898>
 <2><f7112>: Abbrev Number: 0
 <1><f7113>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7114>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <f7118>   DW_AT_decl_file   : 10
    <f7119>   DW_AT_decl_line   : 80
    <f711a>   DW_AT_decl_column : 23
    <f711b>   DW_AT_type        : <0xf6e82>
 <1><f711f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7120>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <f7124>   DW_AT_decl_file   : 10
    <f7125>   DW_AT_decl_line   : 83
    <f7126>   DW_AT_decl_column : 23
    <f7127>   DW_AT_type        : <0xf7057>
 <1><f712b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f712c>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <f7130>   DW_AT_decl_file   : 10
    <f7131>   DW_AT_decl_line   : 86
    <f7132>   DW_AT_decl_column : 23
    <f7133>   DW_AT_type        : <0xf6ee0>
 <1><f7137>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7138>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <f713c>   DW_AT_decl_file   : 10
    <f713d>   DW_AT_decl_line   : 89
    <f713e>   DW_AT_decl_column : 23
    <f713f>   DW_AT_type        : <0xf6ee0>
 <1><f7143>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7144>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <f7148>   DW_AT_decl_file   : 10
    <f7149>   DW_AT_decl_line   : 91
    <f714a>   DW_AT_decl_column : 23
    <f714b>   DW_AT_type        : <0xf714f>
 <1><f714f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7150>   DW_AT_byte_size   : 8
    <f7150>   DW_AT_type        : <0xf7154>
 <1><f7154>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <f7155>   DW_AT_prototyped  : 1
    <f7155>   DW_AT_sibling     : <0xf715f>
 <2><f7159>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f715a>   DW_AT_type        : <0xf715f>
 <2><f715e>: Abbrev Number: 0
 <1><f715f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7160>   DW_AT_byte_size   : 8
    <f7160>   DW_AT_type        : <0xf6e32>
 <1><f7164>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f7165>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f7169>   DW_AT_byte_size   : 224
    <f716a>   DW_AT_decl_file   : 10
    <f716b>   DW_AT_decl_line   : 93
    <f716c>   DW_AT_decl_column : 16
    <f716d>   DW_AT_sibling     : <0xf72de>
 <2><f7171>: Abbrev Number: 2 (DW_TAG_member)
    <f7172>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <f7176>   DW_AT_decl_file   : 10
    <f7177>   DW_AT_decl_line   : 94
    <f7178>   DW_AT_decl_column : 23
    <f7179>   DW_AT_type        : <0xf6e3e>
    <f717d>   DW_AT_data_member_location: 0
 <2><f717e>: Abbrev Number: 2 (DW_TAG_member)
    <f717f>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <f7183>   DW_AT_decl_file   : 10
    <f7184>   DW_AT_decl_line   : 95
    <f7185>   DW_AT_decl_column : 23
    <f7186>   DW_AT_type        : <0xf6e54>
    <f718a>   DW_AT_data_member_location: 8
 <2><f718b>: Abbrev Number: 2 (DW_TAG_member)
    <f718c>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <f7190>   DW_AT_decl_file   : 10
    <f7191>   DW_AT_decl_line   : 96
    <f7192>   DW_AT_decl_column : 23
    <f7193>   DW_AT_type        : <0xf6e6a>
    <f7197>   DW_AT_data_member_location: 16
 <2><f7198>: Abbrev Number: 2 (DW_TAG_member)
    <f7199>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <f719d>   DW_AT_decl_file   : 10
    <f719e>   DW_AT_decl_line   : 97
    <f719f>   DW_AT_decl_column : 23
    <f71a0>   DW_AT_type        : <0xf6e76>
    <f71a4>   DW_AT_data_member_location: 24
 <2><f71a5>: Abbrev Number: 2 (DW_TAG_member)
    <f71a6>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <f71aa>   DW_AT_decl_file   : 10
    <f71ab>   DW_AT_decl_line   : 98
    <f71ac>   DW_AT_decl_column : 23
    <f71ad>   DW_AT_type        : <0xf6e92>
    <f71b1>   DW_AT_data_member_location: 32
 <2><f71b2>: Abbrev Number: 2 (DW_TAG_member)
    <f71b3>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <f71b7>   DW_AT_decl_file   : 10
    <f71b8>   DW_AT_decl_line   : 99
    <f71b9>   DW_AT_decl_column : 23
    <f71ba>   DW_AT_type        : <0xf6ebc>
    <f71be>   DW_AT_data_member_location: 40
 <2><f71bf>: Abbrev Number: 2 (DW_TAG_member)
    <f71c0>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <f71c4>   DW_AT_decl_file   : 10
    <f71c5>   DW_AT_decl_line   : 100
    <f71c6>   DW_AT_decl_column : 23
    <f71c7>   DW_AT_type        : <0xf6ed4>
    <f71cb>   DW_AT_data_member_location: 48
 <2><f71cc>: Abbrev Number: 2 (DW_TAG_member)
    <f71cd>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <f71d1>   DW_AT_decl_file   : 10
    <f71d2>   DW_AT_decl_line   : 101
    <f71d3>   DW_AT_decl_column : 23
    <f71d4>   DW_AT_type        : <0xf6ef9>
    <f71d8>   DW_AT_data_member_location: 56
 <2><f71d9>: Abbrev Number: 2 (DW_TAG_member)
    <f71da>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <f71de>   DW_AT_decl_file   : 10
    <f71df>   DW_AT_decl_line   : 102
    <f71e0>   DW_AT_decl_column : 23
    <f71e1>   DW_AT_type        : <0xf6f05>
    <f71e5>   DW_AT_data_member_location: 64
 <2><f71e6>: Abbrev Number: 2 (DW_TAG_member)
    <f71e7>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <f71eb>   DW_AT_decl_file   : 10
    <f71ec>   DW_AT_decl_line   : 103
    <f71ed>   DW_AT_decl_column : 23
    <f71ee>   DW_AT_type        : <0xf6f11>
    <f71f2>   DW_AT_data_member_location: 72
 <2><f71f3>: Abbrev Number: 2 (DW_TAG_member)
    <f71f4>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <f71f8>   DW_AT_decl_file   : 10
    <f71f9>   DW_AT_decl_line   : 104
    <f71fa>   DW_AT_decl_column : 23
    <f71fb>   DW_AT_type        : <0xf6f37>
    <f71ff>   DW_AT_data_member_location: 80
 <2><f7200>: Abbrev Number: 2 (DW_TAG_member)
    <f7201>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <f7205>   DW_AT_decl_file   : 10
    <f7206>   DW_AT_decl_line   : 105
    <f7207>   DW_AT_decl_column : 24
    <f7208>   DW_AT_type        : <0xf6f6d>
    <f720c>   DW_AT_data_member_location: 88
 <2><f720d>: Abbrev Number: 2 (DW_TAG_member)
    <f720e>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <f7212>   DW_AT_decl_file   : 10
    <f7213>   DW_AT_decl_line   : 106
    <f7214>   DW_AT_decl_column : 25
    <f7215>   DW_AT_type        : <0xf6f93>
    <f7219>   DW_AT_data_member_location: 96
 <2><f721a>: Abbrev Number: 2 (DW_TAG_member)
    <f721b>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <f721f>   DW_AT_decl_file   : 10
    <f7220>   DW_AT_decl_line   : 107
    <f7221>   DW_AT_decl_column : 23
    <f7222>   DW_AT_type        : <0xf6fb9>
    <f7226>   DW_AT_data_member_location: 104
 <2><f7227>: Abbrev Number: 2 (DW_TAG_member)
    <f7228>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <f722c>   DW_AT_decl_file   : 10
    <f722d>   DW_AT_decl_line   : 108
    <f722e>   DW_AT_decl_column : 23
    <f722f>   DW_AT_type        : <0xf704b>
    <f7233>   DW_AT_data_member_location: 112
 <2><f7234>: Abbrev Number: 2 (DW_TAG_member)
    <f7235>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <f7239>   DW_AT_decl_file   : 10
    <f723a>   DW_AT_decl_line   : 109
    <f723b>   DW_AT_decl_column : 23
    <f723c>   DW_AT_type        : <0xf706b>
    <f7240>   DW_AT_data_member_location: 120
 <2><f7241>: Abbrev Number: 2 (DW_TAG_member)
    <f7242>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <f7246>   DW_AT_decl_file   : 10
    <f7247>   DW_AT_decl_line   : 110
    <f7248>   DW_AT_decl_column : 23
    <f7249>   DW_AT_type        : <0xf709f>
    <f724d>   DW_AT_data_member_location: 128
 <2><f724e>: Abbrev Number: 2 (DW_TAG_member)
    <f724f>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <f7253>   DW_AT_decl_file   : 10
    <f7254>   DW_AT_decl_line   : 111
    <f7255>   DW_AT_decl_column : 23
    <f7256>   DW_AT_type        : <0xf70ce>
    <f725a>   DW_AT_data_member_location: 136
 <2><f725b>: Abbrev Number: 2 (DW_TAG_member)
    <f725c>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <f7260>   DW_AT_decl_file   : 10
    <f7261>   DW_AT_decl_line   : 112
    <f7262>   DW_AT_decl_column : 23
    <f7263>   DW_AT_type        : <0xf70ee>
    <f7267>   DW_AT_data_member_location: 144
 <2><f7268>: Abbrev Number: 2 (DW_TAG_member)
    <f7269>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <f726d>   DW_AT_decl_file   : 10
    <f726e>   DW_AT_decl_line   : 113
    <f726f>   DW_AT_decl_column : 25
    <f7270>   DW_AT_type        : <0xf6ec8>
    <f7274>   DW_AT_data_member_location: 152
 <2><f7275>: Abbrev Number: 2 (DW_TAG_member)
    <f7276>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <f727a>   DW_AT_decl_file   : 10
    <f727b>   DW_AT_decl_line   : 114
    <f727c>   DW_AT_decl_column : 24
    <f727d>   DW_AT_type        : <0xf6fde>
    <f7281>   DW_AT_data_member_location: 160
 <2><f7282>: Abbrev Number: 2 (DW_TAG_member)
    <f7283>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <f7287>   DW_AT_decl_file   : 10
    <f7288>   DW_AT_decl_line   : 115
    <f7289>   DW_AT_decl_column : 25
    <f728a>   DW_AT_type        : <0xf7017>
    <f728e>   DW_AT_data_member_location: 168
 <2><f728f>: Abbrev Number: 2 (DW_TAG_member)
    <f7290>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <f7294>   DW_AT_decl_file   : 10
    <f7295>   DW_AT_decl_line   : 116
    <f7296>   DW_AT_decl_column : 23
    <f7297>   DW_AT_type        : <0xf6f43>
    <f729b>   DW_AT_data_member_location: 176
 <2><f729c>: Abbrev Number: 2 (DW_TAG_member)
    <f729d>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <f72a1>   DW_AT_decl_file   : 10
    <f72a2>   DW_AT_decl_line   : 117
    <f72a3>   DW_AT_decl_column : 23
    <f72a4>   DW_AT_type        : <0xf7113>
    <f72a8>   DW_AT_data_member_location: 184
 <2><f72a9>: Abbrev Number: 2 (DW_TAG_member)
    <f72aa>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <f72ae>   DW_AT_decl_file   : 10
    <f72af>   DW_AT_decl_line   : 118
    <f72b0>   DW_AT_decl_column : 22
    <f72b1>   DW_AT_type        : <0xf711f>
    <f72b5>   DW_AT_data_member_location: 192
 <2><f72b6>: Abbrev Number: 2 (DW_TAG_member)
    <f72b7>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <f72bb>   DW_AT_decl_file   : 10
    <f72bc>   DW_AT_decl_line   : 119
    <f72bd>   DW_AT_decl_column : 23
    <f72be>   DW_AT_type        : <0xf712b>
    <f72c2>   DW_AT_data_member_location: 200
 <2><f72c3>: Abbrev Number: 2 (DW_TAG_member)
    <f72c4>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <f72c8>   DW_AT_decl_file   : 10
    <f72c9>   DW_AT_decl_line   : 120
    <f72ca>   DW_AT_decl_column : 22
    <f72cb>   DW_AT_type        : <0xf7137>
    <f72cf>   DW_AT_data_member_location: 208
 <2><f72d0>: Abbrev Number: 2 (DW_TAG_member)
    <f72d1>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <f72d5>   DW_AT_decl_file   : 10
    <f72d6>   DW_AT_decl_line   : 121
    <f72d7>   DW_AT_decl_column : 23
    <f72d8>   DW_AT_type        : <0xf7143>
    <f72dc>   DW_AT_data_member_location: 216
 <2><f72dd>: Abbrev Number: 0
 <1><f72de>: Abbrev Number: 3 (DW_TAG_typedef)
    <f72df>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f72e3>   DW_AT_decl_file   : 10
    <f72e4>   DW_AT_decl_line   : 122
    <f72e5>   DW_AT_decl_column : 3
    <f72e6>   DW_AT_type        : <0xf7164>
 <1><f72ea>: Abbrev Number: 37 (DW_TAG_structure_type)
    <f72eb>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <f72ef>   DW_AT_byte_size   : 20848
    <f72f1>   DW_AT_decl_file   : 11
    <f72f2>   DW_AT_decl_line   : 349
    <f72f4>   DW_AT_decl_column : 16
    <f72f5>   DW_AT_sibling     : <0xf736a>
 <2><f72f9>: Abbrev Number: 12 (DW_TAG_member)
    <f72fa>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <f72fe>   DW_AT_decl_file   : 11
    <f72fe>   DW_AT_decl_line   : 350
    <f7300>   DW_AT_decl_column : 18
    <f7300>   DW_AT_type        : <0xf68c2>
    <f7304>   DW_AT_data_member_location: 0
 <2><f7305>: Abbrev Number: 12 (DW_TAG_member)
    <f7306>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <f730a>   DW_AT_decl_file   : 11
    <f730a>   DW_AT_decl_line   : 351
    <f730c>   DW_AT_decl_column : 18
    <f730c>   DW_AT_type        : <0xf6950>
    <f7310>   DW_AT_data_member_location: 8
 <2><f7311>: Abbrev Number: 12 (DW_TAG_member)
    <f7312>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <f7316>   DW_AT_decl_file   : 11
    <f7316>   DW_AT_decl_line   : 352
    <f7318>   DW_AT_decl_column : 18
    <f7318>   DW_AT_type        : <0xf699c>
    <f731c>   DW_AT_data_member_location: 16
 <2><f731d>: Abbrev Number: 12 (DW_TAG_member)
    <f731e>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <f7322>   DW_AT_decl_file   : 11
    <f7322>   DW_AT_decl_line   : 353
    <f7324>   DW_AT_decl_column : 18
    <f7324>   DW_AT_type        : <0xf68ea>
    <f7328>   DW_AT_data_member_location: 40
 <2><f7329>: Abbrev Number: 12 (DW_TAG_member)
    <f732a>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f732e>   DW_AT_decl_file   : 11
    <f732e>   DW_AT_decl_line   : 354
    <f7330>   DW_AT_decl_column : 18
    <f7330>   DW_AT_type        : <0xf72de>
    <f7334>   DW_AT_data_member_location: 48
 <2><f7335>: Abbrev Number: 14 (DW_TAG_member)
    <f7336>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <f733a>   DW_AT_decl_file   : 11
    <f733a>   DW_AT_decl_line   : 355
    <f733c>   DW_AT_decl_column : 18
    <f733c>   DW_AT_type        : <0xf736a>
    <f7340>   DW_AT_data_member_location: 272
 <2><f7342>: Abbrev Number: 14 (DW_TAG_member)
    <f7343>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <f7347>   DW_AT_decl_file   : 11
    <f7347>   DW_AT_decl_line   : 356
    <f7349>   DW_AT_decl_column : 18
    <f7349>   DW_AT_type        : <0xf68c2>
    <f734d>   DW_AT_data_member_location: 20832
 <2><f734f>: Abbrev Number: 14 (DW_TAG_member)
    <f7350>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <f7354>   DW_AT_decl_file   : 11
    <f7354>   DW_AT_decl_line   : 357
    <f7356>   DW_AT_decl_column : 18
    <f7356>   DW_AT_type        : <0xf68c2>
    <f735a>   DW_AT_data_member_location: 20836
 <2><f735c>: Abbrev Number: 14 (DW_TAG_member)
    <f735d>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <f7361>   DW_AT_decl_file   : 11
    <f7361>   DW_AT_decl_line   : 358
    <f7363>   DW_AT_decl_column : 18
    <f7363>   DW_AT_type        : <0xf6961>
    <f7367>   DW_AT_data_member_location: 20840
 <2><f7369>: Abbrev Number: 0
 <1><f736a>: Abbrev Number: 16 (DW_TAG_array_type)
    <f736b>   DW_AT_type        : <0xf6d7d>
    <f736f>   DW_AT_sibling     : <0xf737b>
 <2><f7373>: Abbrev Number: 38 (DW_TAG_subrange_type)
    <f7374>   DW_AT_type        : <0xf68ad>
    <f7378>   DW_AT_upper_bound : 256
 <2><f737a>: Abbrev Number: 0
 <1><f737b>: Abbrev Number: 15 (DW_TAG_typedef)
    <f737c>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <f7380>   DW_AT_decl_file   : 11
    <f7381>   DW_AT_decl_line   : 359
    <f7383>   DW_AT_decl_column : 3
    <f7384>   DW_AT_type        : <0xf72ea>
 <1><f7388>: Abbrev Number: 39 (DW_TAG_variable)
    <f7389>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <f738d>   DW_AT_decl_file   : 11
    <f738e>   DW_AT_decl_line   : 361
    <f7390>   DW_AT_decl_column : 21
    <f7391>   DW_AT_type        : <0xf737b>
    <f7395>   DW_AT_external    : 1
    <f7395>   DW_AT_declaration : 1
 <1><f7395>: Abbrev Number: 40 (DW_TAG_subprogram)
    <f7396>   DW_AT_external    : 1
    <f7396>   DW_AT_name        : (indirect string, offset: 0x1ab06): wcslen
    <f739a>   DW_AT_decl_file   : 13
    <f739b>   DW_AT_decl_line   : 222
    <f739c>   DW_AT_decl_column : 15
    <f739d>   DW_AT_prototyped  : 1
    <f739d>   DW_AT_type        : <0xf68f6>
    <f73a1>   DW_AT_declaration : 1
    <f73a1>   DW_AT_sibling     : <0xf73ab>
 <2><f73a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f73a6>   DW_AT_type        : <0xf6c0d>
 <2><f73aa>: Abbrev Number: 0
 <1><f73ab>: Abbrev Number: 41 (DW_TAG_subprogram)
    <f73ac>   DW_AT_external    : 1
    <f73ac>   DW_AT_name        : (indirect string, offset: 0x1dc9e): fb_ConsolePrintBufferWstrEx
    <f73b0>   DW_AT_decl_file   : 12
    <f73b1>   DW_AT_decl_line   : 81
    <f73b2>   DW_AT_decl_column : 21
    <f73b3>   DW_AT_prototyped  : 1
    <f73b3>   DW_AT_declaration : 1
    <f73b3>   DW_AT_sibling     : <0xf73c7>
 <2><f73b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f73b8>   DW_AT_type        : <0xf6c0d>
 <2><f73bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f73bd>   DW_AT_type        : <0xf68f6>
 <2><f73c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f73c2>   DW_AT_type        : <0xf68c2>
 <2><f73c6>: Abbrev Number: 0
 <1><f73c7>: Abbrev Number: 42 (DW_TAG_subprogram)
    <f73c8>   DW_AT_external    : 1
    <f73c8>   DW_AT_name        : (indirect string, offset: 0x1dc8b): fb_PrintBufferWstr
    <f73cc>   DW_AT_decl_file   : 1
    <f73cd>   DW_AT_decl_line   : 20
    <f73ce>   DW_AT_decl_column : 13
    <f73cf>   DW_AT_prototyped  : 1
    <f73cf>   DW_AT_low_pc      : 0x47bb20
    <f73d7>   DW_AT_high_pc     : 0x3c
    <f73df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f73e1>   DW_AT_call_all_calls: 1
    <f73e1>   DW_AT_sibling     : <0xf74ab>
 <2><f73e5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <f73e6>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <f73ea>   DW_AT_decl_file   : 1
    <f73ea>   DW_AT_decl_line   : 20
    <f73ea>   DW_AT_decl_column : 49
    <f73eb>   DW_AT_type        : <0xf6c0d>
    <f73ef>   DW_AT_location    : 0x4514f (location list)
    <f73f3>   DW_AT_GNU_locviews: 0x45143
 <2><f73f7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <f73f8>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <f73fc>   DW_AT_decl_file   : 1
    <f73fc>   DW_AT_decl_line   : 20
    <f73fc>   DW_AT_decl_column : 61
    <f73fd>   DW_AT_type        : <0xf68c2>
    <f7401>   DW_AT_location    : 0x45180 (location list)
    <f7405>   DW_AT_GNU_locviews: 0x45174
 <2><f7409>: Abbrev Number: 43 (DW_TAG_inlined_subroutine)
    <f740a>   DW_AT_abstract_origin: <0xf74d9>
    <f740e>   DW_AT_entry_pc    : 0x47bb29
    <f7416>   DW_AT_GNU_entry_view: 0
    <f7417>   DW_AT_ranges      : 0x189d8
    <f741b>   DW_AT_call_file   : 1
    <f741c>   DW_AT_call_line   : 23
    <f741d>   DW_AT_call_column : 42
    <f741e>   DW_AT_sibling     : <0xf7444>
 <3><f7422>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f7423>   DW_AT_abstract_origin: <0xf74ea>
    <f7427>   DW_AT_location    : 0x451a9 (location list)
    <f742b>   DW_AT_GNU_locviews: 0x451a5
 <3><f742f>: Abbrev Number: 44 (DW_TAG_call_site)
    <f7430>   DW_AT_call_return_pc: 0x47bb32
    <f7438>   DW_AT_call_origin : <0xf7395>
 <4><f743c>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f743d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f743f>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><f7442>: Abbrev Number: 0
 <3><f7443>: Abbrev Number: 0
 <2><f7444>: Abbrev Number: 45 (DW_TAG_inlined_subroutine)
    <f7445>   DW_AT_abstract_origin: <0xf74ab>
    <f7449>   DW_AT_entry_pc    : 0x47bb3b
    <f7451>   DW_AT_GNU_entry_view: 1
    <f7452>   DW_AT_ranges      : 0x189e2
    <f7456>   DW_AT_call_file   : 1
    <f7457>   DW_AT_call_line   : 23
    <f7458>   DW_AT_call_column : 12
 <3><f7459>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f745a>   DW_AT_abstract_origin: <0xf74ce>
    <f745e>   DW_AT_location    : 0x451be (location list)
    <f7462>   DW_AT_GNU_locviews: 0x451b4
 <3><f7466>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f7467>   DW_AT_abstract_origin: <0xf74c2>
    <f746b>   DW_AT_location    : 0x451e4 (location list)
    <f746f>   DW_AT_GNU_locviews: 0x451de
 <3><f7473>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f7474>   DW_AT_abstract_origin: <0xf74b8>
    <f7478>   DW_AT_location    : 0x451fe (location list)
    <f747c>   DW_AT_GNU_locviews: 0x451f4
 <3><f7480>: Abbrev Number: 22 (DW_TAG_call_site)
    <f7481>   DW_AT_call_return_pc: 0x47bb50
    <f7489>   DW_AT_call_tail_call: 1
    <f7489>   DW_AT_sibling     : <0xf749c>
 <4><f748d>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f748e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f7490>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <4><f7494>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f7495>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f7497>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <4><f749b>: Abbrev Number: 0
 <3><f749c>: Abbrev Number: 23 (DW_TAG_call_site)
    <f749d>   DW_AT_call_return_pc: 0x47bb5c
    <f74a5>   DW_AT_call_tail_call: 1
    <f74a5>   DW_AT_call_origin : <0xf73ab>
 <3><f74a9>: Abbrev Number: 0
 <2><f74aa>: Abbrev Number: 0
 <1><f74ab>: Abbrev Number: 46 (DW_TAG_subprogram)
    <f74ac>   DW_AT_external    : 1
    <f74ac>   DW_AT_name        : (indirect string, offset: 0x1dc62): fb_PrintBufferWstrEx
    <f74b0>   DW_AT_decl_file   : 1
    <f74b1>   DW_AT_decl_line   : 6
    <f74b2>   DW_AT_decl_column : 13
    <f74b3>   DW_AT_prototyped  : 1
    <f74b3>   DW_AT_inline      : 1	(inlined)
    <f74b4>   DW_AT_sibling     : <0xf74d9>
 <2><f74b8>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <f74b9>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <f74bd>   DW_AT_decl_file   : 1
    <f74bd>   DW_AT_decl_line   : 6
    <f74bd>   DW_AT_decl_column : 51
    <f74be>   DW_AT_type        : <0xf6c0d>
 <2><f74c2>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <f74c3>   DW_AT_name        : len
    <f74c7>   DW_AT_decl_file   : 1
    <f74c8>   DW_AT_decl_line   : 6
    <f74c9>   DW_AT_decl_column : 66
    <f74ca>   DW_AT_type        : <0xf68f6>
 <2><f74ce>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <f74cf>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <f74d3>   DW_AT_decl_file   : 1
    <f74d3>   DW_AT_decl_line   : 6
    <f74d3>   DW_AT_decl_column : 75
    <f74d4>   DW_AT_type        : <0xf68c2>
 <2><f74d8>: Abbrev Number: 0
 <1><f74d9>: Abbrev Number: 47 (DW_TAG_subprogram)
    <f74da>   DW_AT_name        : (indirect string, offset: 0x1ab1d): fb_wstr_Len
    <f74de>   DW_AT_decl_file   : 2
    <f74df>   DW_AT_decl_line   : 144
    <f74e0>   DW_AT_decl_column : 27
    <f74e1>   DW_AT_prototyped  : 1
    <f74e1>   DW_AT_type        : <0xf6927>
    <f74e5>   DW_AT_inline      : 3	(declared as inline and inlined)
    <f74e6>   DW_AT_sibling     : <0xf74f5>
 <2><f74ea>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <f74eb>   DW_AT_name        : s
    <f74ed>   DW_AT_decl_file   : 2
    <f74ee>   DW_AT_decl_line   : 144
    <f74ef>   DW_AT_decl_column : 56
    <f74f0>   DW_AT_type        : <0xf6c0d>
 <2><f74f4>: Abbrev Number: 0
 <1><f74f5>: Abbrev Number: 48 (DW_TAG_subprogram)
    <f74f6>   DW_AT_abstract_origin: <0xf74ab>
    <f74fa>   DW_AT_low_pc      : 0x47bb00
    <f7502>   DW_AT_high_pc     : 0x15
    <f750a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f750c>   DW_AT_call_all_calls: 1
 <2><f750c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f750d>   DW_AT_abstract_origin: <0xf74b8>
    <f7511>   DW_AT_location    : 0x45226 (location list)
    <f7515>   DW_AT_GNU_locviews: 0x4521e
 <2><f7519>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f751a>   DW_AT_abstract_origin: <0xf74c2>
    <f751e>   DW_AT_location    : 0x45249 (location list)
    <f7522>   DW_AT_GNU_locviews: 0x45241
 <2><f7526>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f7527>   DW_AT_abstract_origin: <0xf74ce>
    <f752b>   DW_AT_location    : 0x4526c (location list)
    <f752f>   DW_AT_GNU_locviews: 0x45264
 <2><f7533>: Abbrev Number: 22 (DW_TAG_call_site)
    <f7534>   DW_AT_call_return_pc: 0x47bb0e
    <f753c>   DW_AT_call_tail_call: 1
    <f753c>   DW_AT_sibling     : <0xf7556>
 <3><f7540>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f7541>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f7543>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><f7547>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f7548>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f754a>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><f754e>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <f754f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f7551>   DW_AT_call_value  : 3 byte block: a3 1 51 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)))
 <3><f7555>: Abbrev Number: 0
 <2><f7556>: Abbrev Number: 23 (DW_TAG_call_site)
    <f7557>   DW_AT_call_return_pc: 0x47bb15
    <f755f>   DW_AT_call_tail_call: 1
    <f755f>   DW_AT_call_origin : <0xf73ab>
 <2><f7563>: Abbrev Number: 0
 <1><f7564>: Abbrev Number: 0
  Compilation Unit @ offset 0xf7565:
   Length:        0x97e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1b78d
   Pointer Size:  8
 <0><f7571>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <f7572>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <f7576>   DW_AT_language    : 29	(C11)
    <f7577>   DW_AT_name        : (indirect line string, offset: 0x1b1c): src/rtlib/unix/io_printbuff_wstr.c
    <f757b>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <f757f>   DW_AT_low_pc      : 0x47bb60
    <f7587>   DW_AT_high_pc     : 0x297
    <f758f>   DW_AT_stmt_list   : 0x71c8f
 <1><f7593>: Abbrev Number: 5 (DW_TAG_base_type)
    <f7594>   DW_AT_byte_size   : 1
    <f7595>   DW_AT_encoding    : 8	(unsigned char)
    <f7596>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f759a>: Abbrev Number: 5 (DW_TAG_base_type)
    <f759b>   DW_AT_byte_size   : 2
    <f759c>   DW_AT_encoding    : 7	(unsigned)
    <f759d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f75a1>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75a2>   DW_AT_byte_size   : 4
    <f75a3>   DW_AT_encoding    : 7	(unsigned)
    <f75a4>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f75a8>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75a9>   DW_AT_byte_size   : 8
    <f75aa>   DW_AT_encoding    : 7	(unsigned)
    <f75ab>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f75af>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75b0>   DW_AT_byte_size   : 1
    <f75b1>   DW_AT_encoding    : 6	(signed char)
    <f75b2>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f75b6>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75b7>   DW_AT_byte_size   : 2
    <f75b8>   DW_AT_encoding    : 5	(signed)
    <f75b9>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f75bd>: Abbrev Number: 27 (DW_TAG_base_type)
    <f75be>   DW_AT_byte_size   : 4
    <f75bf>   DW_AT_encoding    : 5	(signed)
    <f75c0>   DW_AT_name        : int
 <1><f75c4>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75c5>   DW_AT_byte_size   : 8
    <f75c6>   DW_AT_encoding    : 5	(signed)
    <f75c7>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f75cb>: Abbrev Number: 6 (DW_TAG_typedef)
    <f75cc>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <f75d0>   DW_AT_decl_file   : 3
    <f75d1>   DW_AT_decl_line   : 152
    <f75d2>   DW_AT_decl_column : 25
    <f75d3>   DW_AT_type        : <0xf75c4>
 <1><f75d7>: Abbrev Number: 6 (DW_TAG_typedef)
    <f75d8>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f75dc>   DW_AT_decl_file   : 3
    <f75dd>   DW_AT_decl_line   : 153
    <f75de>   DW_AT_decl_column : 27
    <f75df>   DW_AT_type        : <0xf75c4>
 <1><f75e3>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <f75e4>   DW_AT_byte_size   : 8
 <1><f75e5>: Abbrev Number: 6 (DW_TAG_typedef)
    <f75e6>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <f75ea>   DW_AT_decl_file   : 3
    <f75eb>   DW_AT_decl_line   : 194
    <f75ec>   DW_AT_decl_column : 27
    <f75ed>   DW_AT_type        : <0xf75c4>
 <1><f75f1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f75f2>   DW_AT_byte_size   : 8
    <f75f2>   DW_AT_type        : <0xf75f6>
 <1><f75f6>: Abbrev Number: 5 (DW_TAG_base_type)
    <f75f7>   DW_AT_byte_size   : 1
    <f75f8>   DW_AT_encoding    : 6	(signed char)
    <f75f9>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f75fd>: Abbrev Number: 19 (DW_TAG_const_type)
    <f75fe>   DW_AT_type        : <0xf75f6>
 <1><f7602>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7603>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f7607>   DW_AT_decl_file   : 4
    <f7608>   DW_AT_decl_line   : 209
    <f7609>   DW_AT_decl_column : 23
    <f760a>   DW_AT_type        : <0xf75a8>
 <1><f760e>: Abbrev Number: 29 (DW_TAG_typedef)
    <f760f>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <f7613>   DW_AT_decl_file   : 4
    <f7614>   DW_AT_decl_line   : 321
    <f7616>   DW_AT_decl_column : 24
    <f7617>   DW_AT_type        : <0xf75bd>
 <1><f761b>: Abbrev Number: 19 (DW_TAG_const_type)
    <f761c>   DW_AT_type        : <0xf760e>
 <1><f7620>: Abbrev Number: 5 (DW_TAG_base_type)
    <f7621>   DW_AT_byte_size   : 8
    <f7622>   DW_AT_encoding    : 5	(signed)
    <f7623>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f7627>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7628>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <f762c>   DW_AT_decl_file   : 5
    <f762d>   DW_AT_decl_line   : 108
    <f762e>   DW_AT_decl_column : 19
    <f762f>   DW_AT_type        : <0xf75e5>
 <1><f7633>: Abbrev Number: 5 (DW_TAG_base_type)
    <f7634>   DW_AT_byte_size   : 8
    <f7635>   DW_AT_encoding    : 7	(unsigned)
    <f7636>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f763a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f763b>   DW_AT_byte_size   : 8
    <f763b>   DW_AT_type        : <0xf7644>
 <1><f763f>: Abbrev Number: 15 (DW_TAG_restrict_type)
    <f7640>   DW_AT_type        : <0xf763a>
 <1><f7644>: Abbrev Number: 30 (DW_TAG_const_type)
 <1><f7645>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7646>   DW_AT_byte_size   : 8
    <f7646>   DW_AT_type        : <0xf75fd>
 <1><f764a>: Abbrev Number: 15 (DW_TAG_restrict_type)
    <f764b>   DW_AT_type        : <0xf7645>
 <1><f764f>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f7650>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <f7654>   DW_AT_byte_size   : 216
    <f7655>   DW_AT_decl_file   : 6
    <f7656>   DW_AT_decl_line   : 49
    <f7657>   DW_AT_decl_column : 8
    <f7657>   DW_AT_sibling     : <0xf77d5>
 <2><f765b>: Abbrev Number: 1 (DW_TAG_member)
    <f765c>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <f7660>   DW_AT_decl_file   : 6
    <f7661>   DW_AT_decl_line   : 51
    <f7662>   DW_AT_decl_column : 7
    <f7663>   DW_AT_type        : <0xf75bd>
    <f7667>   DW_AT_data_member_location: 0
 <2><f7668>: Abbrev Number: 1 (DW_TAG_member)
    <f7669>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <f766d>   DW_AT_decl_file   : 6
    <f766e>   DW_AT_decl_line   : 54
    <f766f>   DW_AT_decl_column : 9
    <f7670>   DW_AT_type        : <0xf75f1>
    <f7674>   DW_AT_data_member_location: 8
 <2><f7675>: Abbrev Number: 1 (DW_TAG_member)
    <f7676>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <f767a>   DW_AT_decl_file   : 6
    <f767b>   DW_AT_decl_line   : 55
    <f767c>   DW_AT_decl_column : 9
    <f767d>   DW_AT_type        : <0xf75f1>
    <f7681>   DW_AT_data_member_location: 16
 <2><f7682>: Abbrev Number: 1 (DW_TAG_member)
    <f7683>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <f7687>   DW_AT_decl_file   : 6
    <f7688>   DW_AT_decl_line   : 56
    <f7689>   DW_AT_decl_column : 9
    <f768a>   DW_AT_type        : <0xf75f1>
    <f768e>   DW_AT_data_member_location: 24
 <2><f768f>: Abbrev Number: 1 (DW_TAG_member)
    <f7690>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <f7694>   DW_AT_decl_file   : 6
    <f7695>   DW_AT_decl_line   : 57
    <f7696>   DW_AT_decl_column : 9
    <f7697>   DW_AT_type        : <0xf75f1>
    <f769b>   DW_AT_data_member_location: 32
 <2><f769c>: Abbrev Number: 1 (DW_TAG_member)
    <f769d>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <f76a1>   DW_AT_decl_file   : 6
    <f76a2>   DW_AT_decl_line   : 58
    <f76a3>   DW_AT_decl_column : 9
    <f76a4>   DW_AT_type        : <0xf75f1>
    <f76a8>   DW_AT_data_member_location: 40
 <2><f76a9>: Abbrev Number: 1 (DW_TAG_member)
    <f76aa>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <f76ae>   DW_AT_decl_file   : 6
    <f76af>   DW_AT_decl_line   : 59
    <f76b0>   DW_AT_decl_column : 9
    <f76b1>   DW_AT_type        : <0xf75f1>
    <f76b5>   DW_AT_data_member_location: 48
 <2><f76b6>: Abbrev Number: 1 (DW_TAG_member)
    <f76b7>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <f76bb>   DW_AT_decl_file   : 6
    <f76bc>   DW_AT_decl_line   : 60
    <f76bd>   DW_AT_decl_column : 9
    <f76be>   DW_AT_type        : <0xf75f1>
    <f76c2>   DW_AT_data_member_location: 56
 <2><f76c3>: Abbrev Number: 1 (DW_TAG_member)
    <f76c4>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <f76c8>   DW_AT_decl_file   : 6
    <f76c9>   DW_AT_decl_line   : 61
    <f76ca>   DW_AT_decl_column : 9
    <f76cb>   DW_AT_type        : <0xf75f1>
    <f76cf>   DW_AT_data_member_location: 64
 <2><f76d0>: Abbrev Number: 1 (DW_TAG_member)
    <f76d1>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <f76d5>   DW_AT_decl_file   : 6
    <f76d6>   DW_AT_decl_line   : 64
    <f76d7>   DW_AT_decl_column : 9
    <f76d8>   DW_AT_type        : <0xf75f1>
    <f76dc>   DW_AT_data_member_location: 72
 <2><f76dd>: Abbrev Number: 1 (DW_TAG_member)
    <f76de>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <f76e2>   DW_AT_decl_file   : 6
    <f76e3>   DW_AT_decl_line   : 65
    <f76e4>   DW_AT_decl_column : 9
    <f76e5>   DW_AT_type        : <0xf75f1>
    <f76e9>   DW_AT_data_member_location: 80
 <2><f76ea>: Abbrev Number: 1 (DW_TAG_member)
    <f76eb>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <f76ef>   DW_AT_decl_file   : 6
    <f76f0>   DW_AT_decl_line   : 66
    <f76f1>   DW_AT_decl_column : 9
    <f76f2>   DW_AT_type        : <0xf75f1>
    <f76f6>   DW_AT_data_member_location: 88
 <2><f76f7>: Abbrev Number: 1 (DW_TAG_member)
    <f76f8>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <f76fc>   DW_AT_decl_file   : 6
    <f76fd>   DW_AT_decl_line   : 68
    <f76fe>   DW_AT_decl_column : 22
    <f76ff>   DW_AT_type        : <0xf77ee>
    <f7703>   DW_AT_data_member_location: 96
 <2><f7704>: Abbrev Number: 1 (DW_TAG_member)
    <f7705>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <f7709>   DW_AT_decl_file   : 6
    <f770a>   DW_AT_decl_line   : 70
    <f770b>   DW_AT_decl_column : 20
    <f770c>   DW_AT_type        : <0xf77f3>
    <f7710>   DW_AT_data_member_location: 104
 <2><f7711>: Abbrev Number: 1 (DW_TAG_member)
    <f7712>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <f7716>   DW_AT_decl_file   : 6
    <f7717>   DW_AT_decl_line   : 72
    <f7718>   DW_AT_decl_column : 7
    <f7719>   DW_AT_type        : <0xf75bd>
    <f771d>   DW_AT_data_member_location: 112
 <2><f771e>: Abbrev Number: 1 (DW_TAG_member)
    <f771f>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <f7723>   DW_AT_decl_file   : 6
    <f7724>   DW_AT_decl_line   : 73
    <f7725>   DW_AT_decl_column : 7
    <f7726>   DW_AT_type        : <0xf75bd>
    <f772a>   DW_AT_data_member_location: 116
 <2><f772b>: Abbrev Number: 1 (DW_TAG_member)
    <f772c>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <f7730>   DW_AT_decl_file   : 6
    <f7731>   DW_AT_decl_line   : 74
    <f7732>   DW_AT_decl_column : 11
    <f7733>   DW_AT_type        : <0xf75cb>
    <f7737>   DW_AT_data_member_location: 120
 <2><f7738>: Abbrev Number: 1 (DW_TAG_member)
    <f7739>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <f773d>   DW_AT_decl_file   : 6
    <f773e>   DW_AT_decl_line   : 77
    <f773f>   DW_AT_decl_column : 18
    <f7740>   DW_AT_type        : <0xf759a>
    <f7744>   DW_AT_data_member_location: 128
 <2><f7745>: Abbrev Number: 1 (DW_TAG_member)
    <f7746>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <f774a>   DW_AT_decl_file   : 6
    <f774b>   DW_AT_decl_line   : 78
    <f774c>   DW_AT_decl_column : 15
    <f774d>   DW_AT_type        : <0xf75af>
    <f7751>   DW_AT_data_member_location: 130
 <2><f7752>: Abbrev Number: 1 (DW_TAG_member)
    <f7753>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <f7757>   DW_AT_decl_file   : 6
    <f7758>   DW_AT_decl_line   : 79
    <f7759>   DW_AT_decl_column : 8
    <f775a>   DW_AT_type        : <0xf77f8>
    <f775e>   DW_AT_data_member_location: 131
 <2><f775f>: Abbrev Number: 1 (DW_TAG_member)
    <f7760>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <f7764>   DW_AT_decl_file   : 6
    <f7765>   DW_AT_decl_line   : 81
    <f7766>   DW_AT_decl_column : 15
    <f7767>   DW_AT_type        : <0xf7808>
    <f776b>   DW_AT_data_member_location: 136
 <2><f776c>: Abbrev Number: 1 (DW_TAG_member)
    <f776d>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <f7771>   DW_AT_decl_file   : 6
    <f7772>   DW_AT_decl_line   : 89
    <f7773>   DW_AT_decl_column : 13
    <f7774>   DW_AT_type        : <0xf75d7>
    <f7778>   DW_AT_data_member_location: 144
 <2><f7779>: Abbrev Number: 1 (DW_TAG_member)
    <f777a>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <f777e>   DW_AT_decl_file   : 6
    <f777f>   DW_AT_decl_line   : 91
    <f7780>   DW_AT_decl_column : 23
    <f7781>   DW_AT_type        : <0xf7812>
    <f7785>   DW_AT_data_member_location: 152
 <2><f7786>: Abbrev Number: 1 (DW_TAG_member)
    <f7787>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <f778b>   DW_AT_decl_file   : 6
    <f778c>   DW_AT_decl_line   : 92
    <f778d>   DW_AT_decl_column : 25
    <f778e>   DW_AT_type        : <0xf781c>
    <f7792>   DW_AT_data_member_location: 160
 <2><f7793>: Abbrev Number: 1 (DW_TAG_member)
    <f7794>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <f7798>   DW_AT_decl_file   : 6
    <f7799>   DW_AT_decl_line   : 93
    <f779a>   DW_AT_decl_column : 20
    <f779b>   DW_AT_type        : <0xf77f3>
    <f779f>   DW_AT_data_member_location: 168
 <2><f77a0>: Abbrev Number: 1 (DW_TAG_member)
    <f77a1>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <f77a5>   DW_AT_decl_file   : 6
    <f77a6>   DW_AT_decl_line   : 94
    <f77a7>   DW_AT_decl_column : 9
    <f77a8>   DW_AT_type        : <0xf75e3>
    <f77ac>   DW_AT_data_member_location: 176
 <2><f77ad>: Abbrev Number: 1 (DW_TAG_member)
    <f77ae>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <f77b2>   DW_AT_decl_file   : 6
    <f77b3>   DW_AT_decl_line   : 95
    <f77b4>   DW_AT_decl_column : 10
    <f77b5>   DW_AT_type        : <0xf7602>
    <f77b9>   DW_AT_data_member_location: 184
 <2><f77ba>: Abbrev Number: 1 (DW_TAG_member)
    <f77bb>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <f77bf>   DW_AT_decl_file   : 6
    <f77c0>   DW_AT_decl_line   : 96
    <f77c1>   DW_AT_decl_column : 7
    <f77c2>   DW_AT_type        : <0xf75bd>
    <f77c6>   DW_AT_data_member_location: 192
 <2><f77c7>: Abbrev Number: 1 (DW_TAG_member)
    <f77c8>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <f77cc>   DW_AT_decl_file   : 6
    <f77cd>   DW_AT_decl_line   : 98
    <f77ce>   DW_AT_decl_column : 8
    <f77cf>   DW_AT_type        : <0xf7821>
    <f77d3>   DW_AT_data_member_location: 196
 <2><f77d4>: Abbrev Number: 0
 <1><f77d5>: Abbrev Number: 6 (DW_TAG_typedef)
    <f77d6>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <f77da>   DW_AT_decl_file   : 7
    <f77db>   DW_AT_decl_line   : 7
    <f77dc>   DW_AT_decl_column : 25
    <f77dd>   DW_AT_type        : <0xf764f>
 <1><f77e1>: Abbrev Number: 31 (DW_TAG_typedef)
    <f77e2>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <f77e6>   DW_AT_decl_file   : 6
    <f77e7>   DW_AT_decl_line   : 43
    <f77e8>   DW_AT_decl_column : 14
 <1><f77e9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f77ea>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <f77ee>   DW_AT_declaration : 1
 <1><f77ee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f77ef>   DW_AT_byte_size   : 8
    <f77ef>   DW_AT_type        : <0xf77e9>
 <1><f77f3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f77f4>   DW_AT_byte_size   : 8
    <f77f4>   DW_AT_type        : <0xf764f>
 <1><f77f8>: Abbrev Number: 12 (DW_TAG_array_type)
    <f77f9>   DW_AT_type        : <0xf75f6>
    <f77fd>   DW_AT_sibling     : <0xf7808>
 <2><f7801>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f7802>   DW_AT_type        : <0xf75a8>
    <f7806>   DW_AT_upper_bound : 0
 <2><f7807>: Abbrev Number: 0
 <1><f7808>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7809>   DW_AT_byte_size   : 8
    <f7809>   DW_AT_type        : <0xf77e1>
 <1><f780d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f780e>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <f7812>   DW_AT_declaration : 1
 <1><f7812>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7813>   DW_AT_byte_size   : 8
    <f7813>   DW_AT_type        : <0xf780d>
 <1><f7817>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f7818>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <f781c>   DW_AT_declaration : 1
 <1><f781c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f781d>   DW_AT_byte_size   : 8
    <f781d>   DW_AT_type        : <0xf7817>
 <1><f7821>: Abbrev Number: 12 (DW_TAG_array_type)
    <f7822>   DW_AT_type        : <0xf75f6>
    <f7826>   DW_AT_sibling     : <0xf7831>
 <2><f782a>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f782b>   DW_AT_type        : <0xf75a8>
    <f782f>   DW_AT_upper_bound : 19
 <2><f7830>: Abbrev Number: 0
 <1><f7831>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7832>   DW_AT_byte_size   : 8
    <f7832>   DW_AT_type        : <0xf77d5>
 <1><f7836>: Abbrev Number: 15 (DW_TAG_restrict_type)
    <f7837>   DW_AT_type        : <0xf7831>
 <1><f783b>: Abbrev Number: 21 (DW_TAG_variable)
    <f783c>   DW_AT_name        : (indirect string, offset: 0x1b9ba): stdout
    <f7840>   DW_AT_decl_file   : 12
    <f7841>   DW_AT_decl_line   : 138
    <f7842>   DW_AT_decl_column : 14
    <f7843>   DW_AT_type        : <0xf7831>
    <f7847>   DW_AT_external    : 1
    <f7847>   DW_AT_declaration : 1
 <1><f7847>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7848>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <f784c>   DW_AT_decl_file   : 8
    <f784d>   DW_AT_decl_line   : 23
    <f784e>   DW_AT_decl_column : 23
    <f784f>   DW_AT_type        : <0xf7593>
 <1><f7853>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7854>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <f7858>   DW_AT_decl_file   : 8
    <f7859>   DW_AT_decl_line   : 24
    <f785a>   DW_AT_decl_column : 22
    <f785b>   DW_AT_type        : <0xf75a1>
 <1><f785f>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7860>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <f7864>   DW_AT_decl_file   : 8
    <f7865>   DW_AT_decl_line   : 25
    <f7866>   DW_AT_decl_column : 22
    <f7867>   DW_AT_type        : <0xf75a1>
 <1><f786b>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f786c>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <f7870>   DW_AT_byte_size   : 60
    <f7871>   DW_AT_decl_file   : 9
    <f7872>   DW_AT_decl_line   : 24
    <f7873>   DW_AT_decl_column : 8
    <f7873>   DW_AT_sibling     : <0xf78e0>
 <2><f7877>: Abbrev Number: 1 (DW_TAG_member)
    <f7878>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <f787c>   DW_AT_decl_file   : 9
    <f787d>   DW_AT_decl_line   : 26
    <f787e>   DW_AT_decl_column : 14
    <f787f>   DW_AT_type        : <0xf785f>
    <f7883>   DW_AT_data_member_location: 0
 <2><f7884>: Abbrev Number: 1 (DW_TAG_member)
    <f7885>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <f7889>   DW_AT_decl_file   : 9
    <f788a>   DW_AT_decl_line   : 27
    <f788b>   DW_AT_decl_column : 14
    <f788c>   DW_AT_type        : <0xf785f>
    <f7890>   DW_AT_data_member_location: 4
 <2><f7891>: Abbrev Number: 1 (DW_TAG_member)
    <f7892>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <f7896>   DW_AT_decl_file   : 9
    <f7897>   DW_AT_decl_line   : 28
    <f7898>   DW_AT_decl_column : 14
    <f7899>   DW_AT_type        : <0xf785f>
    <f789d>   DW_AT_data_member_location: 8
 <2><f789e>: Abbrev Number: 1 (DW_TAG_member)
    <f789f>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <f78a3>   DW_AT_decl_file   : 9
    <f78a4>   DW_AT_decl_line   : 29
    <f78a5>   DW_AT_decl_column : 14
    <f78a6>   DW_AT_type        : <0xf785f>
    <f78aa>   DW_AT_data_member_location: 12
 <2><f78ab>: Abbrev Number: 1 (DW_TAG_member)
    <f78ac>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <f78b0>   DW_AT_decl_file   : 9
    <f78b1>   DW_AT_decl_line   : 30
    <f78b2>   DW_AT_decl_column : 10
    <f78b3>   DW_AT_type        : <0xf7847>
    <f78b7>   DW_AT_data_member_location: 16
 <2><f78b8>: Abbrev Number: 1 (DW_TAG_member)
    <f78b9>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <f78bd>   DW_AT_decl_file   : 9
    <f78be>   DW_AT_decl_line   : 31
    <f78bf>   DW_AT_decl_column : 10
    <f78c0>   DW_AT_type        : <0xf78e0>
    <f78c4>   DW_AT_data_member_location: 17
 <2><f78c5>: Abbrev Number: 1 (DW_TAG_member)
    <f78c6>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <f78ca>   DW_AT_decl_file   : 9
    <f78cb>   DW_AT_decl_line   : 32
    <f78cc>   DW_AT_decl_column : 13
    <f78cd>   DW_AT_type        : <0xf7853>
    <f78d1>   DW_AT_data_member_location: 52
 <2><f78d2>: Abbrev Number: 1 (DW_TAG_member)
    <f78d3>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <f78d7>   DW_AT_decl_file   : 9
    <f78d8>   DW_AT_decl_line   : 33
    <f78d9>   DW_AT_decl_column : 13
    <f78da>   DW_AT_type        : <0xf7853>
    <f78de>   DW_AT_data_member_location: 56
 <2><f78df>: Abbrev Number: 0
 <1><f78e0>: Abbrev Number: 12 (DW_TAG_array_type)
    <f78e1>   DW_AT_type        : <0xf7847>
    <f78e5>   DW_AT_sibling     : <0xf78f0>
 <2><f78e9>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f78ea>   DW_AT_type        : <0xf75a8>
    <f78ee>   DW_AT_upper_bound : 31
 <2><f78ef>: Abbrev Number: 0
 <1><f78f0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f78f1>   DW_AT_byte_size   : 8
    <f78f1>   DW_AT_type        : <0xf78f5>
 <1><f78f5>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <f78f6>   DW_AT_prototyped  : 1
 <1><f78f6>: Abbrev Number: 5 (DW_TAG_base_type)
    <f78f7>   DW_AT_byte_size   : 8
    <f78f8>   DW_AT_encoding    : 4	(float)
    <f78f9>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><f78fd>: Abbrev Number: 5 (DW_TAG_base_type)
    <f78fe>   DW_AT_byte_size   : 4
    <f78ff>   DW_AT_encoding    : 4	(float)
    <f7900>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><f7904>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <f7905>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <f7909>   DW_AT_encoding    : 7	(unsigned)
    <f790a>   DW_AT_byte_size   : 4
    <f790b>   DW_AT_type        : <0xf75a1>
    <f790f>   DW_AT_decl_file   : 10
    <f7910>   DW_AT_decl_line   : 25
    <f7911>   DW_AT_decl_column : 14
    <f7912>   DW_AT_sibling     : <0xf792f>
 <2><f7916>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f7917>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <f791b>   DW_AT_const_value : 0
 <2><f791c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f791d>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <f7921>   DW_AT_const_value : 1
 <2><f7922>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f7923>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <f7927>   DW_AT_const_value : 2
 <2><f7928>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f7929>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <f792d>   DW_AT_const_value : 3
 <2><f792e>: Abbrev Number: 0
 <1><f792f>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7930>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <f7934>   DW_AT_decl_file   : 10
    <f7935>   DW_AT_decl_line   : 30
    <f7936>   DW_AT_decl_column : 3
    <f7937>   DW_AT_type        : <0xf7904>
 <1><f793b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f793c>   DW_AT_byte_size   : 8
    <f793c>   DW_AT_type        : <0xf761b>
 <1><f7940>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7941>   DW_AT_byte_size   : 8
    <f7941>   DW_AT_type        : <0xf7945>
 <1><f7945>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <f7946>   DW_AT_prototyped  : 1
    <f7946>   DW_AT_type        : <0xf75bd>
 <1><f794a>: Abbrev Number: 35 (DW_TAG_structure_type)
    <f794b>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <f794f>   DW_AT_byte_size   : 408
    <f7951>   DW_AT_decl_file   : 11
    <f7952>   DW_AT_decl_line   : 38
    <f7953>   DW_AT_decl_column : 16
    <f7954>   DW_AT_sibling     : <0xf7ab1>
 <2><f7958>: Abbrev Number: 1 (DW_TAG_member)
    <f7959>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <f795d>   DW_AT_decl_file   : 11
    <f795e>   DW_AT_decl_line   : 40
    <f795f>   DW_AT_decl_column : 6
    <f7960>   DW_AT_type        : <0xf75bd>
    <f7964>   DW_AT_data_member_location: 0
 <2><f7965>: Abbrev Number: 1 (DW_TAG_member)
    <f7966>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <f796a>   DW_AT_decl_file   : 11
    <f796b>   DW_AT_decl_line   : 41
    <f796c>   DW_AT_decl_column : 6
    <f796d>   DW_AT_type        : <0xf75bd>
    <f7971>   DW_AT_data_member_location: 4
 <2><f7972>: Abbrev Number: 1 (DW_TAG_member)
    <f7973>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <f7977>   DW_AT_decl_file   : 11
    <f7978>   DW_AT_decl_line   : 42
    <f7979>   DW_AT_decl_column : 6
    <f797a>   DW_AT_type        : <0xf75bd>
    <f797e>   DW_AT_data_member_location: 8
 <2><f797f>: Abbrev Number: 1 (DW_TAG_member)
    <f7980>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <f7984>   DW_AT_decl_file   : 11
    <f7985>   DW_AT_decl_line   : 43
    <f7986>   DW_AT_decl_column : 8
    <f7987>   DW_AT_type        : <0xf7831>
    <f798b>   DW_AT_data_member_location: 16
 <2><f798c>: Abbrev Number: 1 (DW_TAG_member)
    <f798d>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <f7991>   DW_AT_decl_file   : 11
    <f7992>   DW_AT_decl_line   : 44
    <f7993>   DW_AT_decl_column : 17
    <f7994>   DW_AT_type        : <0xf786b>
    <f7998>   DW_AT_data_member_location: 24
 <2><f7999>: Abbrev Number: 1 (DW_TAG_member)
    <f799a>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <f799e>   DW_AT_decl_file   : 11
    <f799f>   DW_AT_decl_line   : 44
    <f79a0>   DW_AT_decl_column : 31
    <f79a1>   DW_AT_type        : <0xf786b>
    <f79a5>   DW_AT_data_member_location: 84
 <2><f79a6>: Abbrev Number: 1 (DW_TAG_member)
    <f79a7>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <f79ab>   DW_AT_decl_file   : 11
    <f79ac>   DW_AT_decl_line   : 45
    <f79ad>   DW_AT_decl_column : 6
    <f79ae>   DW_AT_type        : <0xf75bd>
    <f79b2>   DW_AT_data_member_location: 144
 <2><f79b3>: Abbrev Number: 1 (DW_TAG_member)
    <f79b4>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <f79b8>   DW_AT_decl_file   : 11
    <f79b9>   DW_AT_decl_line   : 46
    <f79ba>   DW_AT_decl_column : 6
    <f79bb>   DW_AT_type        : <0xf75bd>
    <f79bf>   DW_AT_data_member_location: 148
 <2><f79c0>: Abbrev Number: 1 (DW_TAG_member)
    <f79c1>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <f79c5>   DW_AT_decl_file   : 11
    <f79c6>   DW_AT_decl_line   : 46
    <f79c7>   DW_AT_decl_column : 16
    <f79c8>   DW_AT_type        : <0xf75bd>
    <f79cc>   DW_AT_data_member_location: 152
 <2><f79cd>: Abbrev Number: 1 (DW_TAG_member)
    <f79ce>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <f79d2>   DW_AT_decl_file   : 11
    <f79d3>   DW_AT_decl_line   : 47
    <f79d4>   DW_AT_decl_column : 6
    <f79d5>   DW_AT_type        : <0xf75bd>
    <f79d9>   DW_AT_data_member_location: 156
 <2><f79da>: Abbrev Number: 1 (DW_TAG_member)
    <f79db>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <f79df>   DW_AT_decl_file   : 11
    <f79e0>   DW_AT_decl_line   : 47
    <f79e1>   DW_AT_decl_column : 13
    <f79e2>   DW_AT_type        : <0xf75bd>
    <f79e6>   DW_AT_data_member_location: 160
 <2><f79e7>: Abbrev Number: 17 (DW_TAG_member)
    <f79e8>   DW_AT_name        : w
    <f79ea>   DW_AT_decl_file   : 11
    <f79ea>   DW_AT_decl_line   : 48
    <f79eb>   DW_AT_decl_column : 6
    <f79ec>   DW_AT_type        : <0xf75bd>
    <f79f0>   DW_AT_data_member_location: 164
 <2><f79f1>: Abbrev Number: 17 (DW_TAG_member)
    <f79f2>   DW_AT_name        : h
    <f79f4>   DW_AT_decl_file   : 11
    <f79f4>   DW_AT_decl_line   : 48
    <f79f5>   DW_AT_decl_column : 9
    <f79f6>   DW_AT_type        : <0xf75bd>
    <f79fa>   DW_AT_data_member_location: 168
 <2><f79fb>: Abbrev Number: 1 (DW_TAG_member)
    <f79fc>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <f7a00>   DW_AT_decl_file   : 11
    <f7a01>   DW_AT_decl_line   : 49
    <f7a02>   DW_AT_decl_column : 17
    <f7a03>   DW_AT_type        : <0xf7ab1>
    <f7a07>   DW_AT_data_member_location: 176
 <2><f7a08>: Abbrev Number: 1 (DW_TAG_member)
    <f7a09>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <f7a0d>   DW_AT_decl_file   : 11
    <f7a0e>   DW_AT_decl_line   : 49
    <f7a0f>   DW_AT_decl_column : 31
    <f7a10>   DW_AT_type        : <0xf7ab1>
    <f7a14>   DW_AT_data_member_location: 184
 <2><f7a15>: Abbrev Number: 1 (DW_TAG_member)
    <f7a16>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <f7a1a>   DW_AT_decl_file   : 11
    <f7a1b>   DW_AT_decl_line   : 51
    <f7a1c>   DW_AT_decl_column : 6
    <f7a1d>   DW_AT_type        : <0xf75bd>
    <f7a21>   DW_AT_data_member_location: 192
 <2><f7a22>: Abbrev Number: 1 (DW_TAG_member)
    <f7a23>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <f7a27>   DW_AT_decl_file   : 11
    <f7a28>   DW_AT_decl_line   : 53
    <f7a29>   DW_AT_decl_column : 6
    <f7a2a>   DW_AT_type        : <0xf75bd>
    <f7a2e>   DW_AT_data_member_location: 196
 <2><f7a2f>: Abbrev Number: 17 (DW_TAG_member)
    <f7a30>   DW_AT_name        : seq
    <f7a34>   DW_AT_decl_file   : 11
    <f7a34>   DW_AT_decl_line   : 54
    <f7a35>   DW_AT_decl_column : 8
    <f7a36>   DW_AT_type        : <0xf7ab6>
    <f7a3a>   DW_AT_data_member_location: 200
 <2><f7a3b>: Abbrev Number: 7 (DW_TAG_member)
    <f7a3c>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <f7a40>   DW_AT_decl_file   : 11
    <f7a40>   DW_AT_decl_line   : 55
    <f7a41>   DW_AT_decl_column : 8
    <f7a42>   DW_AT_type        : <0xf7940>
    <f7a46>   DW_AT_data_member_location: 336
 <2><f7a48>: Abbrev Number: 7 (DW_TAG_member)
    <f7a49>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <f7a4d>   DW_AT_decl_file   : 11
    <f7a4d>   DW_AT_decl_line   : 56
    <f7a4e>   DW_AT_decl_column : 8
    <f7a4f>   DW_AT_type        : <0xf7940>
    <f7a53>   DW_AT_data_member_location: 344
 <2><f7a55>: Abbrev Number: 7 (DW_TAG_member)
    <f7a56>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <f7a5a>   DW_AT_decl_file   : 11
    <f7a5a>   DW_AT_decl_line   : 57
    <f7a5b>   DW_AT_decl_column : 9
    <f7a5c>   DW_AT_type        : <0xf78f0>
    <f7a60>   DW_AT_data_member_location: 352
 <2><f7a62>: Abbrev Number: 7 (DW_TAG_member)
    <f7a63>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <f7a67>   DW_AT_decl_file   : 11
    <f7a67>   DW_AT_decl_line   : 58
    <f7a68>   DW_AT_decl_column : 9
    <f7a69>   DW_AT_type        : <0xf78f0>
    <f7a6d>   DW_AT_data_member_location: 360
 <2><f7a6f>: Abbrev Number: 7 (DW_TAG_member)
    <f7a70>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <f7a74>   DW_AT_decl_file   : 11
    <f7a74>   DW_AT_decl_line   : 59
    <f7a75>   DW_AT_decl_column : 8
    <f7a76>   DW_AT_type        : <0xf7940>
    <f7a7a>   DW_AT_data_member_location: 368
 <2><f7a7c>: Abbrev Number: 7 (DW_TAG_member)
    <f7a7d>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <f7a81>   DW_AT_decl_file   : 11
    <f7a81>   DW_AT_decl_line   : 60
    <f7a82>   DW_AT_decl_column : 9
    <f7a83>   DW_AT_type        : <0xf78f0>
    <f7a87>   DW_AT_data_member_location: 376
 <2><f7a89>: Abbrev Number: 7 (DW_TAG_member)
    <f7a8a>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <f7a8e>   DW_AT_decl_file   : 11
    <f7a8e>   DW_AT_decl_line   : 61
    <f7a8f>   DW_AT_decl_column : 9
    <f7a90>   DW_AT_type        : <0xf78f0>
    <f7a94>   DW_AT_data_member_location: 384
 <2><f7a96>: Abbrev Number: 7 (DW_TAG_member)
    <f7a97>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <f7a9b>   DW_AT_decl_file   : 11
    <f7a9b>   DW_AT_decl_line   : 62
    <f7a9c>   DW_AT_decl_column : 9
    <f7a9d>   DW_AT_type        : <0xf7adb>
    <f7aa1>   DW_AT_data_member_location: 392
 <2><f7aa3>: Abbrev Number: 7 (DW_TAG_member)
    <f7aa4>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <f7aa8>   DW_AT_decl_file   : 11
    <f7aa8>   DW_AT_decl_line   : 63
    <f7aa9>   DW_AT_decl_column : 9
    <f7aaa>   DW_AT_type        : <0xf78f0>
    <f7aae>   DW_AT_data_member_location: 400
 <2><f7ab0>: Abbrev Number: 0
 <1><f7ab1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7ab2>   DW_AT_byte_size   : 8
    <f7ab2>   DW_AT_type        : <0xf7593>
 <1><f7ab6>: Abbrev Number: 12 (DW_TAG_array_type)
    <f7ab7>   DW_AT_type        : <0xf75f1>
    <f7abb>   DW_AT_sibling     : <0xf7ac6>
 <2><f7abf>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f7ac0>   DW_AT_type        : <0xf75a8>
    <f7ac4>   DW_AT_upper_bound : 16
 <2><f7ac5>: Abbrev Number: 0
 <1><f7ac6>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <f7ac7>   DW_AT_prototyped  : 1
    <f7ac7>   DW_AT_sibling     : <0xf7adb>
 <2><f7acb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7acc>   DW_AT_type        : <0xf75bd>
 <2><f7ad0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7ad1>   DW_AT_type        : <0xf75bd>
 <2><f7ad5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7ad6>   DW_AT_type        : <0xf75bd>
 <2><f7ada>: Abbrev Number: 0
 <1><f7adb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f7adc>   DW_AT_byte_size   : 8
    <f7adc>   DW_AT_type        : <0xf7ac6>
 <1><f7ae0>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7ae1>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <f7ae5>   DW_AT_decl_file   : 11
    <f7ae6>   DW_AT_decl_line   : 64
    <f7ae7>   DW_AT_decl_column : 3
    <f7ae8>   DW_AT_type        : <0xf794a>
 <1><f7aec>: Abbrev Number: 21 (DW_TAG_variable)
    <f7aed>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <f7af1>   DW_AT_decl_file   : 11
    <f7af2>   DW_AT_decl_line   : 66
    <f7af3>   DW_AT_decl_column : 18
    <f7af4>   DW_AT_type        : <0xf7ae0>
    <f7af8>   DW_AT_external    : 1
    <f7af8>   DW_AT_declaration : 1
 <1><f7af8>: Abbrev Number: 9 (DW_TAG_subprogram)
    <f7af9>   DW_AT_external    : 1
    <f7af9>   DW_AT_name        : (indirect string, offset: 0x1ab06): wcslen
    <f7afd>   DW_AT_decl_file   : 13
    <f7afe>   DW_AT_decl_line   : 222
    <f7aff>   DW_AT_decl_column : 15
    <f7b00>   DW_AT_prototyped  : 1
    <f7b00>   DW_AT_type        : <0xf7602>
    <f7b04>   DW_AT_declaration : 1
    <f7b04>   DW_AT_sibling     : <0xf7b0e>
 <2><f7b08>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b09>   DW_AT_type        : <0xf793b>
 <2><f7b0d>: Abbrev Number: 0
 <1><f7b0e>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f7b0f>   DW_AT_external    : 1
    <f7b0f>   DW_AT_name        : (indirect string, offset: 0x1b766): fputs
    <f7b13>   DW_AT_decl_file   : 12
    <f7b14>   DW_AT_decl_line   : 631
    <f7b16>   DW_AT_decl_column : 12
    <f7b17>   DW_AT_prototyped  : 1
    <f7b17>   DW_AT_type        : <0xf75bd>
    <f7b1b>   DW_AT_declaration : 1
    <f7b1b>   DW_AT_sibling     : <0xf7b2a>
 <2><f7b1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b20>   DW_AT_type        : <0xf764a>
 <2><f7b24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b25>   DW_AT_type        : <0xf7836>
 <2><f7b29>: Abbrev Number: 0
 <1><f7b2a>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f7b2b>   DW_AT_external    : 1
    <f7b2b>   DW_AT_name        : (indirect string, offset: 0x1dcba): fb_WCharToUTF
    <f7b2f>   DW_AT_decl_file   : 10
    <f7b30>   DW_AT_decl_line   : 350
    <f7b32>   DW_AT_decl_column : 21
    <f7b33>   DW_AT_prototyped  : 1
    <f7b33>   DW_AT_type        : <0xf75f1>
    <f7b37>   DW_AT_declaration : 1
    <f7b37>   DW_AT_sibling     : <0xf7b55>
 <2><f7b3b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b3c>   DW_AT_type        : <0xf792f>
 <2><f7b40>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b41>   DW_AT_type        : <0xf793b>
 <2><f7b45>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b46>   DW_AT_type        : <0xf7627>
 <2><f7b4a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b4b>   DW_AT_type        : <0xf75f1>
 <2><f7b4f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7b50>   DW_AT_type        : <0xf7b55>
 <2><f7b54>: Abbrev Number: 0
 <1><f7b55>: Abbrev Number: 4 (DW_TAG_pointer_type)
