    <83d09>   DW_AT_decl_column : 8
    <83d0a>   DW_AT_type        : <0x83c7b>
    <83d0e>   DW_AT_data_member_location: 4
 <2><83d0f>: Abbrev Number: 0
 <1><83d10>: Abbrev Number: 14 (DW_TAG_structure_type)
    <83d11>   DW_AT_byte_size   : 16
    <83d12>   DW_AT_decl_file   : 4
    <83d13>   DW_AT_decl_line   : 8
    <83d14>   DW_AT_decl_column : 3
    <83d14>   DW_AT_sibling     : <0x83d47>
 <2><83d18>: Abbrev Number: 5 (DW_TAG_member)
    <83d19>   DW_AT_name        : x
    <83d1b>   DW_AT_decl_file   : 4
    <83d1c>   DW_AT_decl_line   : 9
    <83d1d>   DW_AT_decl_column : 8
    <83d1e>   DW_AT_type        : <0x83c7b>
    <83d22>   DW_AT_data_member_location: 0
 <2><83d23>: Abbrev Number: 5 (DW_TAG_member)
    <83d24>   DW_AT_name        : y
    <83d26>   DW_AT_decl_file   : 4
    <83d27>   DW_AT_decl_line   : 9
    <83d28>   DW_AT_decl_column : 11
    <83d29>   DW_AT_type        : <0x83c7b>
    <83d2d>   DW_AT_data_member_location: 4
 <2><83d2e>: Abbrev Number: 5 (DW_TAG_member)
    <83d2f>   DW_AT_name        : dx
    <83d32>   DW_AT_decl_file   : 4
    <83d33>   DW_AT_decl_line   : 10
    <83d34>   DW_AT_decl_column : 8
    <83d35>   DW_AT_type        : <0x83c7b>
    <83d39>   DW_AT_data_member_location: 8
 <2><83d3a>: Abbrev Number: 5 (DW_TAG_member)
    <83d3b>   DW_AT_name        : dy
    <83d3e>   DW_AT_decl_file   : 4
    <83d3f>   DW_AT_decl_line   : 10
    <83d40>   DW_AT_decl_column : 12
    <83d41>   DW_AT_type        : <0x83c7b>
    <83d45>   DW_AT_data_member_location: 12
 <2><83d46>: Abbrev Number: 0
 <1><83d47>: Abbrev Number: 18 (DW_TAG_union_type)
    <83d48>   DW_AT_byte_size   : 16
    <83d48>   DW_AT_decl_file   : 4
    <83d49>   DW_AT_decl_line   : 3
    <83d4a>   DW_AT_decl_column : 2
    <83d4a>   DW_AT_sibling     : <0x83d74>
 <2><83d4e>: Abbrev Number: 15 (DW_TAG_member)
    <83d4f>   DW_AT_type        : <0x83ced>
 <2><83d53>: Abbrev Number: 15 (DW_TAG_member)
    <83d54>   DW_AT_type        : <0x83d10>
 <2><83d58>: Abbrev Number: 19 (DW_TAG_member)
    <83d59>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <83d5d>   DW_AT_decl_file   : 4
    <83d5e>   DW_AT_decl_line   : 12
    <83d5f>   DW_AT_decl_column : 7
    <83d5f>   DW_AT_type        : <0x83c7b>
 <2><83d63>: Abbrev Number: 22 (DW_TAG_member)
    <83d64>   DW_AT_name        : z
    <83d66>   DW_AT_decl_file   : 4
    <83d66>   DW_AT_decl_line   : 13
    <83d67>   DW_AT_decl_column : 7
    <83d67>   DW_AT_type        : <0x83c7b>
 <2><83d6b>: Abbrev Number: 22 (DW_TAG_member)
    <83d6c>   DW_AT_name        : w
    <83d6e>   DW_AT_decl_file   : 4
    <83d6e>   DW_AT_decl_line   : 14
    <83d6f>   DW_AT_decl_column : 7
    <83d6f>   DW_AT_type        : <0x83c7b>
 <2><83d73>: Abbrev Number: 0
 <1><83d74>: Abbrev Number: 12 (DW_TAG_structure_type)
    <83d75>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <83d79>   DW_AT_byte_size   : 20
    <83d7a>   DW_AT_decl_file   : 4
    <83d7b>   DW_AT_decl_line   : 1
    <83d7c>   DW_AT_decl_column : 8
    <83d7d>   DW_AT_sibling     : <0x83d95>
 <2><83d81>: Abbrev Number: 1 (DW_TAG_member)
    <83d82>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <83d86>   DW_AT_decl_file   : 4
    <83d87>   DW_AT_decl_line   : 2
    <83d88>   DW_AT_decl_column : 6
    <83d89>   DW_AT_type        : <0x83c7b>
    <83d8d>   DW_AT_data_member_location: 0
 <2><83d8e>: Abbrev Number: 20 (DW_TAG_member)
    <83d8f>   DW_AT_type        : <0x83d47>
    <83d93>   DW_AT_data_member_location: 4
 <2><83d94>: Abbrev Number: 0
 <1><83d95>: Abbrev Number: 8 (DW_TAG_typedef)
    <83d96>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <83d9a>   DW_AT_decl_file   : 4
    <83d9b>   DW_AT_decl_line   : 18
    <83d9c>   DW_AT_decl_column : 23
    <83d9d>   DW_AT_type        : <0x83d74>
 <1><83da1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83da2>   DW_AT_byte_size   : 8
    <83da2>   DW_AT_type        : <0x83da6>
 <1><83da6>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <83da7>   DW_AT_prototyped  : 1
    <83da7>   DW_AT_type        : <0x83c7b>
    <83dab>   DW_AT_sibling     : <0x83dba>
 <2><83daf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83db0>   DW_AT_type        : <0x83c7b>
 <2><83db4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83db5>   DW_AT_type        : <0x83c7b>
 <2><83db9>: Abbrev Number: 0
 <1><83dba>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83dbb>   DW_AT_byte_size   : 8
    <83dbb>   DW_AT_type        : <0x83c7b>
 <1><83dbf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83dc0>   DW_AT_byte_size   : 8
    <83dc0>   DW_AT_type        : <0x83dc4>
 <1><83dc4>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <83dc5>   DW_AT_prototyped  : 1
    <83dc5>   DW_AT_type        : <0x83c7b>
    <83dc9>   DW_AT_sibling     : <0x83de7>
 <2><83dcd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83dce>   DW_AT_type        : <0x83dba>
 <2><83dd2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83dd3>   DW_AT_type        : <0x83dba>
 <2><83dd7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83dd8>   DW_AT_type        : <0x83dba>
 <2><83ddc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83ddd>   DW_AT_type        : <0x83dba>
 <2><83de1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83de2>   DW_AT_type        : <0x83dba>
 <2><83de6>: Abbrev Number: 0
 <1><83de7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83de8>   DW_AT_byte_size   : 8
    <83de8>   DW_AT_type        : <0x83d95>
 <1><83dec>: Abbrev Number: 8 (DW_TAG_typedef)
    <83ded>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <83df1>   DW_AT_decl_file   : 5
    <83df2>   DW_AT_decl_line   : 13
    <83df3>   DW_AT_decl_column : 30
    <83df4>   DW_AT_type        : <0x83df8>
 <1><83df8>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <83df9>   DW_AT_prototyped  : 1
    <83df9>   DW_AT_type        : <0x83c5f>
    <83dfd>   DW_AT_sibling     : <0x83e11>
 <2><83e01>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e02>   DW_AT_type        : <0x83c5f>
 <2><83e06>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e07>   DW_AT_type        : <0x83c5f>
 <2><83e0b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e0c>   DW_AT_type        : <0x83c93>
 <2><83e10>: Abbrev Number: 0
 <1><83e11>: Abbrev Number: 8 (DW_TAG_typedef)
    <83e12>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <83e16>   DW_AT_decl_file   : 5
    <83e17>   DW_AT_decl_line   : 14
    <83e18>   DW_AT_decl_column : 15
    <83e19>   DW_AT_type        : <0x83e1d>
 <1><83e1d>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <83e1e>   DW_AT_prototyped  : 1
    <83e1e>   DW_AT_sibling     : <0x83e50>
 <2><83e22>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e23>   DW_AT_type        : <0x83e50>
 <2><83e27>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e28>   DW_AT_type        : <0x83e50>
 <2><83e2c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e2d>   DW_AT_type        : <0x83c7b>
 <2><83e31>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e32>   DW_AT_type        : <0x83c7b>
 <2><83e36>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e37>   DW_AT_type        : <0x83c7b>
 <2><83e3b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e3c>   DW_AT_type        : <0x83c7b>
 <2><83e40>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e41>   DW_AT_type        : <0x83c7b>
 <2><83e45>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e46>   DW_AT_type        : <0x83e55>
 <2><83e4a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83e4b>   DW_AT_type        : <0x83c93>
 <2><83e4f>: Abbrev Number: 0
 <1><83e50>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83e51>   DW_AT_byte_size   : 8
    <83e51>   DW_AT_type        : <0x83c4c>
 <1><83e55>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <83e56>   DW_AT_byte_size   : 8
    <83e56>   DW_AT_type        : <0x83dec>
 <1><83e5a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <83e5b>   DW_AT_byte_size   : 16
    <83e5c>   DW_AT_decl_file   : 5
    <83e5d>   DW_AT_decl_line   : 26
    <83e5e>   DW_AT_decl_column : 3
    <83e5e>   DW_AT_sibling     : <0x83e97>
 <2><83e62>: Abbrev Number: 1 (DW_TAG_member)
    <83e63>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <83e67>   DW_AT_decl_file   : 5
    <83e68>   DW_AT_decl_line   : 27
    <83e69>   DW_AT_decl_column : 8
    <83e6a>   DW_AT_type        : <0x83c7b>
    <83e6e>   DW_AT_data_member_location: 0
 <2><83e6f>: Abbrev Number: 1 (DW_TAG_member)
    <83e70>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <83e74>   DW_AT_decl_file   : 5
    <83e75>   DW_AT_decl_line   : 27
    <83e76>   DW_AT_decl_column : 16
    <83e77>   DW_AT_type        : <0x83c7b>
    <83e7b>   DW_AT_data_member_location: 4
 <2><83e7c>: Abbrev Number: 1 (DW_TAG_member)
    <83e7d>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <83e81>   DW_AT_decl_file   : 5
    <83e82>   DW_AT_decl_line   : 27
    <83e83>   DW_AT_decl_column : 24
    <83e84>   DW_AT_type        : <0x83c7b>
    <83e88>   DW_AT_data_member_location: 8
 <2><83e89>: Abbrev Number: 1 (DW_TAG_member)
    <83e8a>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <83e8e>   DW_AT_decl_file   : 5
    <83e8f>   DW_AT_decl_line   : 27
    <83e90>   DW_AT_decl_column : 32
    <83e91>   DW_AT_type        : <0x83c7b>
    <83e95>   DW_AT_data_member_location: 12
 <2><83e96>: Abbrev Number: 0
 <1><83e97>: Abbrev Number: 18 (DW_TAG_union_type)
    <83e98>   DW_AT_byte_size   : 16
    <83e98>   DW_AT_decl_file   : 5
    <83e99>   DW_AT_decl_line   : 25
    <83e9a>   DW_AT_decl_column : 2
    <83e9a>   DW_AT_sibling     : <0x83eaf>
 <2><83e9e>: Abbrev Number: 15 (DW_TAG_member)
    <83e9f>   DW_AT_type        : <0x83e5a>
 <2><83ea3>: Abbrev Number: 19 (DW_TAG_member)
    <83ea4>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <83ea8>   DW_AT_decl_file   : 5
    <83ea9>   DW_AT_decl_line   : 29
    <83eaa>   DW_AT_decl_column : 7
    <83eaa>   DW_AT_type        : <0x83eaf>
 <2><83eae>: Abbrev Number: 0
 <1><83eaf>: Abbrev Number: 23 (DW_TAG_array_type)
    <83eb0>   DW_AT_type        : <0x83c7b>
    <83eb4>   DW_AT_sibling     : <0x83ebf>
 <2><83eb8>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <83eb9>   DW_AT_type        : <0x83c66>
    <83ebd>   DW_AT_upper_bound : 3
 <2><83ebe>: Abbrev Number: 0
 <1><83ebf>: Abbrev Number: 14 (DW_TAG_structure_type)
    <83ec0>   DW_AT_byte_size   : 16
    <83ec1>   DW_AT_decl_file   : 5
    <83ec2>   DW_AT_decl_line   : 32
    <83ec3>   DW_AT_decl_column : 3
    <83ec3>   DW_AT_sibling     : <0x83efc>
 <2><83ec7>: Abbrev Number: 1 (DW_TAG_member)
    <83ec8>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <83ecc>   DW_AT_decl_file   : 5
    <83ecd>   DW_AT_decl_line   : 33
    <83ece>   DW_AT_decl_column : 8
    <83ecf>   DW_AT_type        : <0x83c7b>
    <83ed3>   DW_AT_data_member_location: 0
 <2><83ed4>: Abbrev Number: 1 (DW_TAG_member)
    <83ed5>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <83ed9>   DW_AT_decl_file   : 5
    <83eda>   DW_AT_decl_line   : 33
    <83edb>   DW_AT_decl_column : 20
    <83edc>   DW_AT_type        : <0x83c7b>
    <83ee0>   DW_AT_data_member_location: 4
 <2><83ee1>: Abbrev Number: 1 (DW_TAG_member)
    <83ee2>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <83ee6>   DW_AT_decl_file   : 5
    <83ee7>   DW_AT_decl_line   : 33
    <83ee8>   DW_AT_decl_column : 32
    <83ee9>   DW_AT_type        : <0x83c7b>
    <83eed>   DW_AT_data_member_location: 8
 <2><83eee>: Abbrev Number: 1 (DW_TAG_member)
    <83eef>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <83ef3>   DW_AT_decl_file   : 5
    <83ef4>   DW_AT_decl_line   : 33
    <83ef5>   DW_AT_decl_column : 44
    <83ef6>   DW_AT_type        : <0x83c7b>
    <83efa>   DW_AT_data_member_location: 12
 <2><83efb>: Abbrev Number: 0
 <1><83efc>: Abbrev Number: 18 (DW_TAG_union_type)
    <83efd>   DW_AT_byte_size   : 16
    <83efd>   DW_AT_decl_file   : 5
    <83efe>   DW_AT_decl_line   : 31
    <83eff>   DW_AT_decl_column : 2
    <83eff>   DW_AT_sibling     : <0x83f14>
 <2><83f03>: Abbrev Number: 15 (DW_TAG_member)
    <83f04>   DW_AT_type        : <0x83ebf>
 <2><83f08>: Abbrev Number: 19 (DW_TAG_member)
    <83f09>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <83f0d>   DW_AT_decl_file   : 5
    <83f0e>   DW_AT_decl_line   : 35
    <83f0f>   DW_AT_decl_column : 7
    <83f0f>   DW_AT_type        : <0x83eaf>
 <2><83f13>: Abbrev Number: 0
 <1><83f14>: Abbrev Number: 12 (DW_TAG_structure_type)
    <83f15>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <83f19>   DW_AT_byte_size   : 216
    <83f1a>   DW_AT_decl_file   : 5
    <83f1b>   DW_AT_decl_line   : 16
    <83f1c>   DW_AT_decl_column : 16
    <83f1d>   DW_AT_sibling     : <0x84031>
 <2><83f21>: Abbrev Number: 5 (DW_TAG_member)
    <83f22>   DW_AT_name        : id
    <83f25>   DW_AT_decl_file   : 5
    <83f26>   DW_AT_decl_line   : 17
    <83f27>   DW_AT_decl_column : 6
    <83f28>   DW_AT_type        : <0x83c7b>
    <83f2c>   DW_AT_data_member_location: 0
 <2><83f2d>: Abbrev Number: 1 (DW_TAG_member)
    <83f2e>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <83f32>   DW_AT_decl_file   : 5
    <83f33>   DW_AT_decl_line   : 18
    <83f34>   DW_AT_decl_column : 6
    <83f35>   DW_AT_type        : <0x83c7b>
    <83f39>   DW_AT_data_member_location: 4
 <2><83f3a>: Abbrev Number: 1 (DW_TAG_member)
    <83f3b>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <83f3f>   DW_AT_decl_file   : 5
    <83f40>   DW_AT_decl_line   : 19
    <83f41>   DW_AT_decl_column : 18
    <83f42>   DW_AT_type        : <0x84031>
    <83f46>   DW_AT_data_member_location: 8
 <2><83f47>: Abbrev Number: 1 (DW_TAG_member)
    <83f48>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <83f4c>   DW_AT_decl_file   : 5
    <83f4d>   DW_AT_decl_line   : 20
    <83f4e>   DW_AT_decl_column : 6
    <83f4f>   DW_AT_type        : <0x83c7b>
    <83f53>   DW_AT_data_member_location: 16
 <2><83f54>: Abbrev Number: 1 (DW_TAG_member)
    <83f55>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <83f59>   DW_AT_decl_file   : 5
    <83f5a>   DW_AT_decl_line   : 21
    <83f5b>   DW_AT_decl_column : 6
    <83f5c>   DW_AT_type        : <0x83c7b>
    <83f60>   DW_AT_data_member_location: 20
 <2><83f61>: Abbrev Number: 1 (DW_TAG_member)
    <83f62>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <83f66>   DW_AT_decl_file   : 5
    <83f67>   DW_AT_decl_line   : 22
    <83f68>   DW_AT_decl_column : 6
    <83f69>   DW_AT_type        : <0x83c7b>
    <83f6d>   DW_AT_data_member_location: 24
 <2><83f6e>: Abbrev Number: 1 (DW_TAG_member)
    <83f6f>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <83f73>   DW_AT_decl_file   : 5
    <83f74>   DW_AT_decl_line   : 23
    <83f75>   DW_AT_decl_column : 8
    <83f76>   DW_AT_type        : <0x83c93>
    <83f7a>   DW_AT_data_member_location: 32
 <2><83f7b>: Abbrev Number: 1 (DW_TAG_member)
    <83f7c>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <83f80>   DW_AT_decl_file   : 5
    <83f81>   DW_AT_decl_line   : 24
    <83f82>   DW_AT_decl_column : 8
    <83f83>   DW_AT_type        : <0x83cd5>
    <83f87>   DW_AT_data_member_location: 40
 <2><83f88>: Abbrev Number: 1 (DW_TAG_member)
    <83f89>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <83f8d>   DW_AT_decl_file   : 5
    <83f8e>   DW_AT_decl_line   : 24
    <83f8f>   DW_AT_decl_column : 16
    <83f90>   DW_AT_type        : <0x83cd5>
    <83f94>   DW_AT_data_member_location: 44
 <2><83f95>: Abbrev Number: 20 (DW_TAG_member)
    <83f96>   DW_AT_type        : <0x83e97>
    <83f9a>   DW_AT_data_member_location: 48
 <2><83f9b>: Abbrev Number: 20 (DW_TAG_member)
    <83f9c>   DW_AT_type        : <0x83efc>
    <83fa0>   DW_AT_data_member_location: 64
 <2><83fa1>: Abbrev Number: 1 (DW_TAG_member)
    <83fa2>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <83fa6>   DW_AT_decl_file   : 5
    <83fa7>   DW_AT_decl_line   : 37
    <83fa8>   DW_AT_decl_column : 8
    <83fa9>   DW_AT_type        : <0x83cd5>
    <83fad>   DW_AT_data_member_location: 80
 <2><83fae>: Abbrev Number: 1 (DW_TAG_member)
    <83faf>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <83fb3>   DW_AT_decl_file   : 5
    <83fb4>   DW_AT_decl_line   : 37
    <83fb5>   DW_AT_decl_column : 15
    <83fb6>   DW_AT_type        : <0x83cd5>
    <83fba>   DW_AT_data_member_location: 84
 <2><83fbb>: Abbrev Number: 1 (DW_TAG_member)
    <83fbc>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <83fc0>   DW_AT_decl_file   : 5
    <83fc1>   DW_AT_decl_line   : 37
    <83fc2>   DW_AT_decl_column : 22
    <83fc3>   DW_AT_type        : <0x83cd5>
    <83fc7>   DW_AT_data_member_location: 88
 <2><83fc8>: Abbrev Number: 1 (DW_TAG_member)
    <83fc9>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <83fcd>   DW_AT_decl_file   : 5
    <83fce>   DW_AT_decl_line   : 37
    <83fcf>   DW_AT_decl_column : 29
    <83fd0>   DW_AT_type        : <0x83cd5>
    <83fd4>   DW_AT_data_member_location: 92
 <2><83fd5>: Abbrev Number: 1 (DW_TAG_member)
    <83fd6>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <83fda>   DW_AT_decl_file   : 5
    <83fdb>   DW_AT_decl_line   : 38
    <83fdc>   DW_AT_decl_column : 15
    <83fdd>   DW_AT_type        : <0x83c5f>
    <83fe1>   DW_AT_data_member_location: 96
 <2><83fe2>: Abbrev Number: 1 (DW_TAG_member)
    <83fe3>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <83fe7>   DW_AT_decl_file   : 5
    <83fe8>   DW_AT_decl_line   : 38
    <83fe9>   DW_AT_decl_column : 25
    <83fea>   DW_AT_type        : <0x83c5f>
    <83fee>   DW_AT_data_member_location: 100
 <2><83fef>: Abbrev Number: 1 (DW_TAG_member)
    <83ff0>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <83ff4>   DW_AT_decl_file   : 5
    <83ff5>   DW_AT_decl_line   : 39
    <83ff6>   DW_AT_decl_column : 9
    <83ff7>   DW_AT_type        : <0x84055>
    <83ffb>   DW_AT_data_member_location: 104
 <2><83ffc>: Abbrev Number: 1 (DW_TAG_member)
    <83ffd>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <84001>   DW_AT_decl_file   : 5
    <84002>   DW_AT_decl_line   : 40
    <84003>   DW_AT_decl_column : 17
    <84004>   DW_AT_type        : <0x84073>
    <84008>   DW_AT_data_member_location: 112
 <2><84009>: Abbrev Number: 1 (DW_TAG_member)
    <8400a>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <8400e>   DW_AT_decl_file   : 5
    <8400f>   DW_AT_decl_line   : 41
    <84010>   DW_AT_decl_column : 10
    <84011>   DW_AT_type        : <0x84091>
    <84015>   DW_AT_data_member_location: 120
 <2><84016>: Abbrev Number: 1 (DW_TAG_member)
    <84017>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <8401b>   DW_AT_decl_file   : 5
    <8401c>   DW_AT_decl_line   : 42
    <8401d>   DW_AT_decl_column : 11
    <8401e>   DW_AT_type        : <0x84096>
    <84022>   DW_AT_data_member_location: 128
 <2><84023>: Abbrev Number: 1 (DW_TAG_member)
    <84024>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <84028>   DW_AT_decl_file   : 5
    <84029>   DW_AT_decl_line   : 43
    <8402a>   DW_AT_decl_column : 6
    <8402b>   DW_AT_type        : <0x83c7b>
    <8402f>   DW_AT_data_member_location: 208
 <2><84030>: Abbrev Number: 0
 <1><84031>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84032>   DW_AT_byte_size   : 8
    <84032>   DW_AT_type        : <0x83e50>
 <1><84036>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <84037>   DW_AT_prototyped  : 1
    <84037>   DW_AT_sibling     : <0x84050>
 <2><8403b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8403c>   DW_AT_type        : <0x84050>
 <2><84040>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84041>   DW_AT_type        : <0x83c7b>
 <2><84045>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84046>   DW_AT_type        : <0x83c7b>
 <2><8404a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8404b>   DW_AT_type        : <0x83c5f>
 <2><8404f>: Abbrev Number: 0
 <1><84050>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84051>   DW_AT_byte_size   : 8
    <84051>   DW_AT_type        : <0x83f14>
 <1><84055>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84056>   DW_AT_byte_size   : 8
    <84056>   DW_AT_type        : <0x84036>
 <1><8405a>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <8405b>   DW_AT_prototyped  : 1
    <8405b>   DW_AT_type        : <0x83c5f>
    <8405f>   DW_AT_sibling     : <0x84073>
 <2><84063>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84064>   DW_AT_type        : <0x84050>
 <2><84068>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84069>   DW_AT_type        : <0x83c7b>
 <2><8406d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8406e>   DW_AT_type        : <0x83c7b>
 <2><84072>: Abbrev Number: 0
 <1><84073>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84074>   DW_AT_byte_size   : 8
    <84074>   DW_AT_type        : <0x8405a>
 <1><84078>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <84079>   DW_AT_prototyped  : 1
    <84079>   DW_AT_type        : <0x83c93>
    <8407d>   DW_AT_sibling     : <0x84091>
 <2><84081>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84082>   DW_AT_type        : <0x83c93>
 <2><84086>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84087>   DW_AT_type        : <0x83c7b>
 <2><8408b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8408c>   DW_AT_type        : <0x83ca1>
 <2><84090>: Abbrev Number: 0
 <1><84091>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84092>   DW_AT_byte_size   : 8
    <84092>   DW_AT_type        : <0x84078>
 <1><84096>: Abbrev Number: 23 (DW_TAG_array_type)
    <84097>   DW_AT_type        : <0x840a6>
    <8409b>   DW_AT_sibling     : <0x840a6>
 <2><8409f>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <840a0>   DW_AT_type        : <0x83c66>
    <840a4>   DW_AT_upper_bound : 9
 <2><840a5>: Abbrev Number: 0
 <1><840a6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <840a7>   DW_AT_byte_size   : 8
    <840a7>   DW_AT_type        : <0x840ab>
 <1><840ab>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <840ac>   DW_AT_byte_size   : 8
    <840ac>   DW_AT_type        : <0x83e11>
 <1><840b0>: Abbrev Number: 8 (DW_TAG_typedef)
    <840b1>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <840b5>   DW_AT_decl_file   : 5
    <840b6>   DW_AT_decl_line   : 44
    <840b7>   DW_AT_decl_column : 3
    <840b8>   DW_AT_type        : <0x83f14>
 <1><840bc>: Abbrev Number: 12 (DW_TAG_structure_type)
    <840bd>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <840c1>   DW_AT_byte_size   : 12
    <840c2>   DW_AT_decl_file   : 6
    <840c3>   DW_AT_decl_line   : 139
    <840c4>   DW_AT_decl_column : 16
    <840c5>   DW_AT_sibling     : <0x840ee>
 <2><840c9>: Abbrev Number: 5 (DW_TAG_member)
    <840ca>   DW_AT_name        : ch
    <840cd>   DW_AT_decl_file   : 6
    <840ce>   DW_AT_decl_line   : 140
    <840cf>   DW_AT_decl_column : 14
    <840d0>   DW_AT_type        : <0x83cad>
    <840d4>   DW_AT_data_member_location: 0
 <2><840d5>: Abbrev Number: 5 (DW_TAG_member)
    <840d6>   DW_AT_name        : fg
    <840d9>   DW_AT_decl_file   : 6
    <840da>   DW_AT_decl_line   : 141
    <840db>   DW_AT_decl_column : 14
    <840dc>   DW_AT_type        : <0x83c5f>
    <840e0>   DW_AT_data_member_location: 4
 <2><840e1>: Abbrev Number: 5 (DW_TAG_member)
    <840e2>   DW_AT_name        : bg
    <840e5>   DW_AT_decl_file   : 6
    <840e6>   DW_AT_decl_line   : 141
    <840e7>   DW_AT_decl_column : 18
    <840e8>   DW_AT_type        : <0x83c5f>
    <840ec>   DW_AT_data_member_location: 8
 <2><840ed>: Abbrev Number: 0
 <1><840ee>: Abbrev Number: 8 (DW_TAG_typedef)
    <840ef>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <840f3>   DW_AT_decl_file   : 6
    <840f4>   DW_AT_decl_line   : 142
    <840f5>   DW_AT_decl_column : 3
    <840f6>   DW_AT_type        : <0x840bc>
 <1><840fa>: Abbrev Number: 12 (DW_TAG_structure_type)
    <840fb>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <840ff>   DW_AT_byte_size   : 208
    <84100>   DW_AT_decl_file   : 6
    <84101>   DW_AT_decl_line   : 144
    <84102>   DW_AT_decl_column : 16
    <84103>   DW_AT_sibling     : <0x842bd>
 <2><84107>: Abbrev Number: 5 (DW_TAG_member)
    <84108>   DW_AT_name        : id
    <8410b>   DW_AT_decl_file   : 6
    <8410c>   DW_AT_decl_line   : 146
    <8410d>   DW_AT_decl_column : 6
    <8410e>   DW_AT_type        : <0x83c7b>
    <84112>   DW_AT_data_member_location: 0
 <2><84113>: Abbrev Number: 1 (DW_TAG_member)
    <84114>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <84118>   DW_AT_decl_file   : 6
    <84119>   DW_AT_decl_line   : 147
    <8411a>   DW_AT_decl_column : 9
    <8411b>   DW_AT_type        : <0x83c7b>
    <8411f>   DW_AT_data_member_location: 4
 <2><84120>: Abbrev Number: 1 (DW_TAG_member)
    <84121>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <84125>   DW_AT_decl_file   : 6
    <84126>   DW_AT_decl_line   : 148
    <84127>   DW_AT_decl_column : 21
    <84128>   DW_AT_type        : <0x84031>
    <8412c>   DW_AT_data_member_location: 8
 <2><8412d>: Abbrev Number: 1 (DW_TAG_member)
    <8412e>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <84132>   DW_AT_decl_file   : 6
    <84133>   DW_AT_decl_line   : 149
    <84134>   DW_AT_decl_column : 9
    <84135>   DW_AT_type        : <0x83c7b>
    <84139>   DW_AT_data_member_location: 16
 <2><8413a>: Abbrev Number: 1 (DW_TAG_member)
    <8413b>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <8413f>   DW_AT_decl_file   : 6
    <84140>   DW_AT_decl_line   : 150
    <84141>   DW_AT_decl_column : 9
    <84142>   DW_AT_type        : <0x83c7b>
    <84146>   DW_AT_data_member_location: 20
 <2><84147>: Abbrev Number: 1 (DW_TAG_member)
    <84148>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <8414c>   DW_AT_decl_file   : 6
    <8414d>   DW_AT_decl_line   : 151
    <8414e>   DW_AT_decl_column : 20
    <8414f>   DW_AT_type        : <0x83e50>
    <84153>   DW_AT_data_member_location: 24
 <2><84154>: Abbrev Number: 5 (DW_TAG_member)
    <84155>   DW_AT_name        : w
    <84157>   DW_AT_decl_file   : 6
    <84158>   DW_AT_decl_line   : 152
    <84159>   DW_AT_decl_column : 9
    <8415a>   DW_AT_type        : <0x83c7b>
    <8415e>   DW_AT_data_member_location: 32
 <2><8415f>: Abbrev Number: 5 (DW_TAG_member)
    <84160>   DW_AT_name        : h
    <84162>   DW_AT_decl_file   : 6
    <84163>   DW_AT_decl_line   : 152
    <84164>   DW_AT_decl_column : 12
    <84165>   DW_AT_type        : <0x83c7b>
    <84169>   DW_AT_data_member_location: 36
 <2><8416a>: Abbrev Number: 1 (DW_TAG_member)
    <8416b>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <8416f>   DW_AT_decl_file   : 6
    <84170>   DW_AT_decl_line   : 153
    <84171>   DW_AT_decl_column : 9
    <84172>   DW_AT_type        : <0x83c7b>
    <84176>   DW_AT_data_member_location: 40
 <2><84177>: Abbrev Number: 5 (DW_TAG_member)
    <84178>   DW_AT_name        : bpp
    <8417c>   DW_AT_decl_file   : 6
    <8417d>   DW_AT_decl_line   : 154
    <8417e>   DW_AT_decl_column : 9
    <8417f>   DW_AT_type        : <0x83c7b>
    <84183>   DW_AT_data_member_location: 44
 <2><84184>: Abbrev Number: 1 (DW_TAG_member)
    <84185>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <84189>   DW_AT_decl_file   : 6
    <8418a>   DW_AT_decl_line   : 155
    <8418b>   DW_AT_decl_column : 9
    <8418c>   DW_AT_type        : <0x83c7b>
    <84190>   DW_AT_data_member_location: 48
 <2><84191>: Abbrev Number: 1 (DW_TAG_member)
    <84192>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <84196>   DW_AT_decl_file   : 6
    <84197>   DW_AT_decl_line   : 156
    <84198>   DW_AT_decl_column : 19
    <84199>   DW_AT_type        : <0x842bd>
    <8419d>   DW_AT_data_member_location: 56
 <2><8419e>: Abbrev Number: 1 (DW_TAG_member)
    <8419f>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <841a3>   DW_AT_decl_file   : 6
    <841a4>   DW_AT_decl_line   : 157
    <841a5>   DW_AT_decl_column : 19
    <841a6>   DW_AT_type        : <0x842bd>
    <841aa>   DW_AT_data_member_location: 64
 <2><841ab>: Abbrev Number: 1 (DW_TAG_member)
    <841ac>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <841b0>   DW_AT_decl_file   : 6
    <841b1>   DW_AT_decl_line   : 158
    <841b2>   DW_AT_decl_column : 20
    <841b3>   DW_AT_type        : <0x83e50>
    <841b7>   DW_AT_data_member_location: 72
 <2><841b8>: Abbrev Number: 1 (DW_TAG_member)
    <841b9>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <841bd>   DW_AT_decl_file   : 6
    <841be>   DW_AT_decl_line   : 159
    <841bf>   DW_AT_decl_column : 11
    <841c0>   DW_AT_type        : <0x83c95>
    <841c4>   DW_AT_data_member_location: 80
 <2><841c5>: Abbrev Number: 1 (DW_TAG_member)
    <841c6>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <841ca>   DW_AT_decl_file   : 6
    <841cb>   DW_AT_decl_line   : 160
    <841cc>   DW_AT_decl_column : 29
    <841cd>   DW_AT_type        : <0x8438b>
    <841d1>   DW_AT_data_member_location: 88
 <2><841d2>: Abbrev Number: 1 (DW_TAG_member)
    <841d3>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <841d7>   DW_AT_decl_file   : 6
    <841d8>   DW_AT_decl_line   : 161
    <841d9>   DW_AT_decl_column : 9
    <841da>   DW_AT_type        : <0x83c7b>
    <841de>   DW_AT_data_member_location: 96
 <2><841df>: Abbrev Number: 1 (DW_TAG_member)
    <841e0>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <841e4>   DW_AT_decl_file   : 6
    <841e5>   DW_AT_decl_line   : 162
    <841e6>   DW_AT_decl_column : 27
    <841e7>   DW_AT_type        : <0x843bb>
    <841eb>   DW_AT_data_member_location: 104
 <2><841ec>: Abbrev Number: 1 (DW_TAG_member)
    <841ed>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <841f1>   DW_AT_decl_file   : 6
    <841f2>   DW_AT_decl_line   : 163
    <841f3>   DW_AT_decl_column : 9
    <841f4>   DW_AT_type        : <0x83c7b>
    <841f8>   DW_AT_data_member_location: 112
 <2><841f9>: Abbrev Number: 1 (DW_TAG_member)
    <841fa>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <841fe>   DW_AT_decl_file   : 6
    <841ff>   DW_AT_decl_line   : 164
    <84200>   DW_AT_decl_column : 9
    <84201>   DW_AT_type        : <0x83c7b>
    <84205>   DW_AT_data_member_location: 116
 <2><84206>: Abbrev Number: 1 (DW_TAG_member)
    <84207>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <8420b>   DW_AT_decl_file   : 6
    <8420c>   DW_AT_decl_line   : 164
    <8420d>   DW_AT_decl_column : 19
    <8420e>   DW_AT_type        : <0x83c7b>
    <84212>   DW_AT_data_member_location: 120
 <2><84213>: Abbrev Number: 1 (DW_TAG_member)
    <84214>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <84218>   DW_AT_decl_file   : 6
    <84219>   DW_AT_decl_line   : 165
    <8421a>   DW_AT_decl_column : 24
    <8421b>   DW_AT_type        : <0x843f2>
    <8421f>   DW_AT_data_member_location: 128
 <2><84220>: Abbrev Number: 1 (DW_TAG_member)
    <84221>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <84225>   DW_AT_decl_file   : 6
    <84226>   DW_AT_decl_line   : 166
    <84227>   DW_AT_decl_column : 9
    <84228>   DW_AT_type        : <0x83c7b>
    <8422c>   DW_AT_data_member_location: 136
 <2><8422d>: Abbrev Number: 1 (DW_TAG_member)
    <8422e>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <84232>   DW_AT_decl_file   : 6
    <84233>   DW_AT_decl_line   : 166
    <84234>   DW_AT_decl_column : 17
    <84235>   DW_AT_type        : <0x83c7b>
    <84239>   DW_AT_data_member_location: 140
 <2><8423a>: Abbrev Number: 1 (DW_TAG_member)
    <8423b>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <8423f>   DW_AT_decl_file   : 6
    <84240>   DW_AT_decl_line   : 167
    <84241>   DW_AT_decl_column : 11
    <84242>   DW_AT_type        : <0x83cd5>
    <84246>   DW_AT_data_member_location: 144
 <2><84247>: Abbrev Number: 5 (DW_TAG_member)
    <84248>   DW_AT_name        : key
    <8424c>   DW_AT_decl_file   : 6
    <8424d>   DW_AT_decl_line   : 168
    <8424e>   DW_AT_decl_column : 11
    <8424f>   DW_AT_type        : <0x83c95>
    <84253>   DW_AT_data_member_location: 152
 <2><84254>: Abbrev Number: 1 (DW_TAG_member)
    <84255>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <84259>   DW_AT_decl_file   : 6
    <8425a>   DW_AT_decl_line   : 169
    <8425b>   DW_AT_decl_column : 6
    <8425c>   DW_AT_type        : <0x83c7b>
    <84260>   DW_AT_data_member_location: 160
 <2><84261>: Abbrev Number: 1 (DW_TAG_member)
    <84262>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <84266>   DW_AT_decl_file   : 6
    <84267>   DW_AT_decl_line   : 170
    <84268>   DW_AT_decl_column : 18
    <84269>   DW_AT_type        : <0x843f7>
    <8426d>   DW_AT_data_member_location: 168
 <2><8426e>: Abbrev Number: 1 (DW_TAG_member)
    <8426f>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <84273>   DW_AT_decl_file   : 6
    <84274>   DW_AT_decl_line   : 171
    <84275>   DW_AT_decl_column : 12
    <84276>   DW_AT_type        : <0x83de7>
    <8427a>   DW_AT_data_member_location: 176
 <2><8427b>: Abbrev Number: 1 (DW_TAG_member)
    <8427c>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <84280>   DW_AT_decl_file   : 6
    <84281>   DW_AT_decl_line   : 172
    <84282>   DW_AT_decl_column : 9
    <84283>   DW_AT_type        : <0x83c7b>
    <84287>   DW_AT_data_member_location: 184
 <2><84288>: Abbrev Number: 1 (DW_TAG_member)
    <84289>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <8428d>   DW_AT_decl_file   : 6
    <8428e>   DW_AT_decl_line   : 172
    <8428f>   DW_AT_decl_column : 21
    <84290>   DW_AT_type        : <0x83c7b>
    <84294>   DW_AT_data_member_location: 188
 <2><84295>: Abbrev Number: 1 (DW_TAG_member)
    <84296>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <8429a>   DW_AT_decl_file   : 6
    <8429b>   DW_AT_decl_line   : 173
    <8429c>   DW_AT_decl_column : 11
    <8429d>   DW_AT_type        : <0x84401>
    <842a1>   DW_AT_data_member_location: 192
 <2><842a2>: Abbrev Number: 1 (DW_TAG_member)
    <842a3>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <842a7>   DW_AT_decl_file   : 6
    <842a8>   DW_AT_decl_line   : 174
    <842a9>   DW_AT_decl_column : 15
    <842aa>   DW_AT_type        : <0x83c82>
    <842ae>   DW_AT_data_member_location: 200
 <2><842af>: Abbrev Number: 1 (DW_TAG_member)
    <842b0>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <842b4>   DW_AT_decl_file   : 6
    <842b5>   DW_AT_decl_line   : 175
    <842b6>   DW_AT_decl_column : 6
    <842b7>   DW_AT_type        : <0x83c7b>
    <842bb>   DW_AT_data_member_location: 204
 <2><842bc>: Abbrev Number: 0
 <1><842bd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <842be>   DW_AT_byte_size   : 8
    <842be>   DW_AT_type        : <0x83c5f>
 <1><842c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <842c3>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <842c7>   DW_AT_byte_size   : 112
    <842c8>   DW_AT_decl_file   : 6
    <842c9>   DW_AT_decl_line   : 178
    <842ca>   DW_AT_decl_column : 16
    <842cb>   DW_AT_sibling     : <0x84386>
 <2><842cf>: Abbrev Number: 1 (DW_TAG_member)
    <842d0>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <842d4>   DW_AT_decl_file   : 6
    <842d5>   DW_AT_decl_line   : 188
    <842d6>   DW_AT_decl_column : 8
    <842d7>   DW_AT_type        : <0x83c95>
    <842db>   DW_AT_data_member_location: 0
 <2><842dc>: Abbrev Number: 1 (DW_TAG_member)
    <842dd>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <842e1>   DW_AT_decl_file   : 6
    <842e2>   DW_AT_decl_line   : 208
    <842e3>   DW_AT_decl_column : 8
    <842e4>   DW_AT_type        : <0x8443a>
    <842e8>   DW_AT_data_member_location: 8
 <2><842e9>: Abbrev Number: 1 (DW_TAG_member)
    <842ea>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <842ee>   DW_AT_decl_file   : 6
    <842ef>   DW_AT_decl_line   : 222
    <842f0>   DW_AT_decl_column : 9
    <842f1>   DW_AT_type        : <0x83cc8>
    <842f5>   DW_AT_data_member_location: 16
 <2><842f6>: Abbrev Number: 1 (DW_TAG_member)
    <842f7>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <842fb>   DW_AT_decl_file   : 6
    <842fc>   DW_AT_decl_line   : 231
    <842fd>   DW_AT_decl_column : 9
    <842fe>   DW_AT_type        : <0x83cc8>
    <84302>   DW_AT_data_member_location: 24
 <2><84303>: Abbrev Number: 1 (DW_TAG_member)
    <84304>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <84308>   DW_AT_decl_file   : 6
    <84309>   DW_AT_decl_line   : 239
    <8430a>   DW_AT_decl_column : 9
    <8430b>   DW_AT_type        : <0x83cc8>
    <8430f>   DW_AT_data_member_location: 32
 <2><84310>: Abbrev Number: 1 (DW_TAG_member)
    <84311>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <84315>   DW_AT_decl_file   : 6
    <84316>   DW_AT_decl_line   : 248
    <84317>   DW_AT_decl_column : 9
    <84318>   DW_AT_type        : <0x84459>
    <8431c>   DW_AT_data_member_location: 40
 <2><8431d>: Abbrev Number: 7 (DW_TAG_member)
    <8431e>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <84322>   DW_AT_decl_file   : 6
    <84322>   DW_AT_decl_line   : 258
    <84324>   DW_AT_decl_column : 9
    <84325>   DW_AT_type        : <0x83cc8>
    <84329>   DW_AT_data_member_location: 48
 <2><8432a>: Abbrev Number: 7 (DW_TAG_member)
    <8432b>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <8432f>   DW_AT_decl_file   : 6
    <8432f>   DW_AT_decl_line   : 274
    <84331>   DW_AT_decl_column : 8
    <84332>   DW_AT_type        : <0x83dbf>
    <84336>   DW_AT_data_member_location: 56
 <2><84337>: Abbrev Number: 7 (DW_TAG_member)
    <84338>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <8433c>   DW_AT_decl_file   : 6
    <8433c>   DW_AT_decl_line   : 285
    <8433e>   DW_AT_decl_column : 9
    <8433f>   DW_AT_type        : <0x84459>
    <84343>   DW_AT_data_member_location: 64
 <2><84344>: Abbrev Number: 7 (DW_TAG_member)
    <84345>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <84349>   DW_AT_decl_file   : 6
    <84349>   DW_AT_decl_line   : 293
    <8434b>   DW_AT_decl_column : 9
    <8434c>   DW_AT_type        : <0x84469>
    <84350>   DW_AT_data_member_location: 72
 <2><84351>: Abbrev Number: 7 (DW_TAG_member)
    <84352>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <84356>   DW_AT_decl_file   : 6
    <84356>   DW_AT_decl_line   : 301
    <84358>   DW_AT_decl_column : 8
    <84359>   DW_AT_type        : <0x83da1>
    <8435d>   DW_AT_data_member_location: 80
 <2><8435e>: Abbrev Number: 7 (DW_TAG_member)
    <8435f>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <84363>   DW_AT_decl_file   : 6
    <84363>   DW_AT_decl_line   : 314
    <84365>   DW_AT_decl_column : 9
    <84366>   DW_AT_type        : <0x84482>
    <8436a>   DW_AT_data_member_location: 88
 <2><8436b>: Abbrev Number: 7 (DW_TAG_member)
    <8436c>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <84370>   DW_AT_decl_file   : 6
    <84370>   DW_AT_decl_line   : 321
    <84372>   DW_AT_decl_column : 9
    <84373>   DW_AT_type        : <0x83cc8>
    <84377>   DW_AT_data_member_location: 96
 <2><84378>: Abbrev Number: 7 (DW_TAG_member)
    <84379>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <8437d>   DW_AT_decl_file   : 6
    <8437d>   DW_AT_decl_line   : 328
    <8437f>   DW_AT_decl_column : 9
    <84380>   DW_AT_type        : <0x83cc8>
    <84384>   DW_AT_data_member_location: 104
 <2><84385>: Abbrev Number: 0
 <1><84386>: Abbrev Number: 11 (DW_TAG_const_type)
    <84387>   DW_AT_type        : <0x842c2>
 <1><8438b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8438c>   DW_AT_byte_size   : 8
    <8438c>   DW_AT_type        : <0x84386>
 <1><84390>: Abbrev Number: 25 (DW_TAG_structure_type)
    <84391>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <84395>   DW_AT_byte_size   : 16
    <84395>   DW_AT_decl_file   : 6
    <84395>   DW_AT_decl_line   : 331
    <84397>   DW_AT_decl_column : 16
    <84397>   DW_AT_sibling     : <0x843b6>
 <2><8439b>: Abbrev Number: 7 (DW_TAG_member)
    <8439c>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <843a0>   DW_AT_decl_file   : 6
    <843a0>   DW_AT_decl_line   : 333
    <843a2>   DW_AT_decl_column : 12
    <843a3>   DW_AT_type        : <0x83c87>
    <843a7>   DW_AT_data_member_location: 0
 <2><843a8>: Abbrev Number: 7 (DW_TAG_member)
    <843a9>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <843ad>   DW_AT_decl_file   : 6
    <843ad>   DW_AT_decl_line   : 334
    <843af>   DW_AT_decl_column : 23
    <843b0>   DW_AT_type        : <0x84487>
    <843b4>   DW_AT_data_member_location: 8
 <2><843b5>: Abbrev Number: 0
 <1><843b6>: Abbrev Number: 11 (DW_TAG_const_type)
    <843b7>   DW_AT_type        : <0x84390>
 <1><843bb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <843bc>   DW_AT_byte_size   : 8
    <843bc>   DW_AT_type        : <0x843b6>
 <1><843c0>: Abbrev Number: 25 (DW_TAG_structure_type)
    <843c1>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <843c5>   DW_AT_byte_size   : 16
    <843c5>   DW_AT_decl_file   : 6
    <843c5>   DW_AT_decl_line   : 337
    <843c7>   DW_AT_decl_column : 16
    <843c7>   DW_AT_sibling     : <0x843ed>
 <2><843cb>: Abbrev Number: 26 (DW_TAG_member)
    <843cc>   DW_AT_name        : w
    <843ce>   DW_AT_decl_file   : 6
    <843ce>   DW_AT_decl_line   : 339
    <843d0>   DW_AT_decl_column : 15
    <843d0>   DW_AT_type        : <0x83c87>
    <843d4>   DW_AT_data_member_location: 0
 <2><843d5>: Abbrev Number: 26 (DW_TAG_member)
    <843d6>   DW_AT_name        : h
    <843d8>   DW_AT_decl_file   : 6
    <843d8>   DW_AT_decl_line   : 340
    <843da>   DW_AT_decl_column : 15
    <843da>   DW_AT_type        : <0x83c87>
    <843de>   DW_AT_data_member_location: 4
 <2><843df>: Abbrev Number: 7 (DW_TAG_member)
    <843e0>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <843e4>   DW_AT_decl_file   : 6
    <843e4>   DW_AT_decl_line   : 341
    <843e6>   DW_AT_decl_column : 23
    <843e7>   DW_AT_type        : <0x84487>
    <843eb>   DW_AT_data_member_location: 8
 <2><843ec>: Abbrev Number: 0
 <1><843ed>: Abbrev Number: 11 (DW_TAG_const_type)
    <843ee>   DW_AT_type        : <0x843c0>
 <1><843f2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <843f3>   DW_AT_byte_size   : 8
    <843f3>   DW_AT_type        : <0x843ed>
 <1><843f7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <843f8>   DW_AT_byte_size   : 8
    <843f8>   DW_AT_type        : <0x843fc>
 <1><843fc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <843fd>   DW_AT_byte_size   : 8
    <843fd>   DW_AT_type        : <0x840ee>
 <1><84401>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84402>   DW_AT_byte_size   : 8
    <84402>   DW_AT_type        : <0x83cdc>
 <1><84406>: Abbrev Number: 8 (DW_TAG_typedef)
    <84407>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <8440b>   DW_AT_decl_file   : 6
    <8440c>   DW_AT_decl_line   : 176
    <8440d>   DW_AT_decl_column : 3
    <8440e>   DW_AT_type        : <0x840fa>
 <1><84412>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <84413>   DW_AT_prototyped  : 1
    <84413>   DW_AT_type        : <0x83c7b>
    <84417>   DW_AT_sibling     : <0x8443a>
 <2><8441b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8441c>   DW_AT_type        : <0x83c95>
 <2><84420>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84421>   DW_AT_type        : <0x83c7b>
 <2><84425>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84426>   DW_AT_type        : <0x83c7b>
 <2><8442a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8442b>   DW_AT_type        : <0x83c7b>
 <2><8442f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84430>   DW_AT_type        : <0x83c7b>
 <2><84434>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84435>   DW_AT_type        : <0x83c7b>
 <2><84439>: Abbrev Number: 0
 <1><8443a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8443b>   DW_AT_byte_size   : 8
    <8443b>   DW_AT_type        : <0x84412>
 <1><8443f>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <84440>   DW_AT_prototyped  : 1
    <84440>   DW_AT_sibling     : <0x84459>
 <2><84444>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84445>   DW_AT_type        : <0x83c7b>
 <2><84449>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8444a>   DW_AT_type        : <0x83c7b>
 <2><8444e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8444f>   DW_AT_type        : <0x83c7b>
 <2><84453>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84454>   DW_AT_type        : <0x83c7b>
 <2><84458>: Abbrev Number: 0
 <1><84459>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8445a>   DW_AT_byte_size   : 8
    <8445a>   DW_AT_type        : <0x8443f>
 <1><8445e>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <8445f>   DW_AT_prototyped  : 1
    <8445f>   DW_AT_sibling     : <0x84469>
 <2><84463>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84464>   DW_AT_type        : <0x83c95>
 <2><84468>: Abbrev Number: 0
 <1><84469>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8446a>   DW_AT_byte_size   : 8
    <8446a>   DW_AT_type        : <0x8445e>
 <1><8446e>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <8446f>   DW_AT_prototyped  : 1
    <8446f>   DW_AT_type        : <0x83dba>
    <84473>   DW_AT_sibling     : <0x84482>
 <2><84477>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84478>   DW_AT_type        : <0x83c7b>
 <2><8447c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8447d>   DW_AT_type        : <0x83dba>
 <2><84481>: Abbrev Number: 0
 <1><84482>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84483>   DW_AT_byte_size   : 8
    <84483>   DW_AT_type        : <0x8446e>
 <1><84487>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84488>   DW_AT_byte_size   : 8
    <84488>   DW_AT_type        : <0x83c53>
 <1><8448c>: Abbrev Number: 36 (DW_TAG_variable)
    <8448d>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <84491>   DW_AT_decl_file   : 6
    <84492>   DW_AT_decl_line   : 364
    <84494>   DW_AT_decl_column : 15
    <84495>   DW_AT_type        : <0x84499>
    <84499>   DW_AT_external    : 1
    <84499>   DW_AT_declaration : 1
 <1><84499>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8449a>   DW_AT_byte_size   : 8
    <8449a>   DW_AT_type        : <0x84406>
 <1><8449e>: Abbrev Number: 13 (DW_TAG_subprogram)
    <8449f>   DW_AT_external    : 1
    <8449f>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <844a3>   DW_AT_decl_file   : 6
    <844a3>   DW_AT_decl_line   : 470
    <844a5>   DW_AT_decl_column : 20
    <844a6>   DW_AT_prototyped  : 1
    <844a6>   DW_AT_declaration : 1
    <844a6>   DW_AT_sibling     : <0x844b5>
 <2><844aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844ab>   DW_AT_type        : <0x83c7b>
 <2><844af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844b0>   DW_AT_type        : <0x83c7b>
 <2><844b4>: Abbrev Number: 0
 <1><844b5>: Abbrev Number: 37 (DW_TAG_subprogram)
    <844b6>   DW_AT_external    : 1
    <844b6>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <844ba>   DW_AT_decl_file   : 6
    <844bb>   DW_AT_decl_line   : 469
    <844bd>   DW_AT_decl_column : 20
    <844be>   DW_AT_prototyped  : 1
    <844be>   DW_AT_declaration : 1
 <1><844be>: Abbrev Number: 13 (DW_TAG_subprogram)
    <844bf>   DW_AT_external    : 1
    <844bf>   DW_AT_name        : (indirect string, offset: 0x16de3): fb_hTranslateCoord
    <844c3>   DW_AT_decl_file   : 6
    <844c3>   DW_AT_decl_line   : 411
    <844c5>   DW_AT_decl_column : 13
    <844c6>   DW_AT_prototyped  : 1
    <844c6>   DW_AT_declaration : 1
    <844c6>   DW_AT_sibling     : <0x844e4>
 <2><844ca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844cb>   DW_AT_type        : <0x844e4>
 <2><844cf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844d0>   DW_AT_type        : <0x83cd5>
 <2><844d4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844d5>   DW_AT_type        : <0x83cd5>
 <2><844d9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844da>   DW_AT_type        : <0x83dba>
 <2><844de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844df>   DW_AT_type        : <0x83dba>
 <2><844e3>: Abbrev Number: 0
 <1><844e4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <844e5>   DW_AT_byte_size   : 8
    <844e5>   DW_AT_type        : <0x840b0>
 <1><844e9>: Abbrev Number: 13 (DW_TAG_subprogram)
    <844ea>   DW_AT_external    : 1
    <844ea>   DW_AT_name        : (indirect string, offset: 0x16e2a): fb_hFixRelative
    <844ee>   DW_AT_decl_file   : 6
    <844ee>   DW_AT_decl_line   : 412
    <844f0>   DW_AT_decl_column : 13
    <844f1>   DW_AT_prototyped  : 1
    <844f1>   DW_AT_declaration : 1
    <844f1>   DW_AT_sibling     : <0x84514>
 <2><844f5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844f6>   DW_AT_type        : <0x844e4>
 <2><844fa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <844fb>   DW_AT_type        : <0x83c7b>
 <2><844ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84500>   DW_AT_type        : <0x84514>
 <2><84504>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84505>   DW_AT_type        : <0x84514>
 <2><84509>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8450a>   DW_AT_type        : <0x84514>
 <2><8450e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8450f>   DW_AT_type        : <0x84514>
 <2><84513>: Abbrev Number: 0
 <1><84514>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84515>   DW_AT_byte_size   : 8
    <84515>   DW_AT_type        : <0x83cd5>
 <1><84519>: Abbrev Number: 13 (DW_TAG_subprogram)
    <8451a>   DW_AT_external    : 1
    <8451a>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <8451e>   DW_AT_decl_file   : 6
    <8451e>   DW_AT_decl_line   : 410
    <84520>   DW_AT_decl_column : 13
    <84521>   DW_AT_prototyped  : 1
    <84521>   DW_AT_declaration : 1
    <84521>   DW_AT_sibling     : <0x84530>
 <2><84525>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84526>   DW_AT_type        : <0x844e4>
 <2><8452a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8452b>   DW_AT_type        : <0x83c5f>
 <2><8452f>: Abbrev Number: 0
 <1><84530>: Abbrev Number: 38 (DW_TAG_subprogram)
    <84531>   DW_AT_external    : 1
    <84531>   DW_AT_name        : (indirect string, offset: 0x16da4): fb_hFixColor
    <84535>   DW_AT_decl_file   : 6
    <84536>   DW_AT_decl_line   : 405
    <84538>   DW_AT_decl_column : 21
    <84539>   DW_AT_prototyped  : 1
    <84539>   DW_AT_type        : <0x83c5f>
    <8453d>   DW_AT_declaration : 1
    <8453d>   DW_AT_sibling     : <0x8454c>
 <2><84541>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84542>   DW_AT_type        : <0x83c7b>
 <2><84546>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84547>   DW_AT_type        : <0x83c5f>
 <2><8454b>: Abbrev Number: 0
 <1><8454c>: Abbrev Number: 13 (DW_TAG_subprogram)
    <8454d>   DW_AT_external    : 1
    <8454d>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <84551>   DW_AT_decl_file   : 6
    <84551>   DW_AT_decl_line   : 409
    <84553>   DW_AT_decl_column : 13
    <84554>   DW_AT_prototyped  : 1
    <84554>   DW_AT_declaration : 1
    <84554>   DW_AT_sibling     : <0x84563>
 <2><84558>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84559>   DW_AT_type        : <0x844e4>
 <2><8455d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8455e>   DW_AT_type        : <0x83c93>
 <2><84562>: Abbrev Number: 0
 <1><84563>: Abbrev Number: 39 (DW_TAG_subprogram)
    <84564>   DW_AT_external    : 1
    <84564>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <84568>   DW_AT_decl_file   : 6
    <84569>   DW_AT_decl_line   : 396
    <8456b>   DW_AT_decl_column : 19
    <8456c>   DW_AT_prototyped  : 1
    <8456c>   DW_AT_type        : <0x844e4>
    <84570>   DW_AT_declaration : 1
 <1><84570>: Abbrev Number: 40 (DW_TAG_subprogram)
    <84571>   DW_AT_external    : 1
    <84571>   DW_AT_name        : (indirect string, offset: 0x820a): fb_GfxPset
    <84575>   DW_AT_decl_file   : 1
    <84576>   DW_AT_decl_line   : 5
    <84577>   DW_AT_decl_column : 13
    <84578>   DW_AT_prototyped  : 1
    <84578>   DW_AT_low_pc      : 0x45f0c0
    <84580>   DW_AT_high_pc     : 0x16c
    <84588>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8458a>   DW_AT_call_all_calls: 1
    <8458a>   DW_AT_sibling     : <0x8472e>
 <2><8458e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <8458f>   DW_AT_name        : (indirect string, offset: 0x167a7): target
    <84593>   DW_AT_decl_file   : 1
    <84593>   DW_AT_decl_line   : 5
    <84593>   DW_AT_decl_column : 30
    <84594>   DW_AT_type        : <0x83c93>
    <84598>   DW_AT_location    : 0x2807f (location list)
    <8459c>   DW_AT_GNU_locviews: 0x28071
 <2><845a0>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <845a1>   DW_AT_name        : fx
    <845a4>   DW_AT_decl_file   : 1
    <845a4>   DW_AT_decl_line   : 5
    <845a4>   DW_AT_decl_column : 44
    <845a5>   DW_AT_type        : <0x83cd5>
    <845a9>   DW_AT_location    : 0x280b7 (location list)
    <845ad>   DW_AT_GNU_locviews: 0x280b5
 <2><845b1>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <845b2>   DW_AT_name        : fy
    <845b5>   DW_AT_decl_file   : 1
    <845b5>   DW_AT_decl_line   : 5
    <845b5>   DW_AT_decl_column : 54
    <845b6>   DW_AT_type        : <0x83cd5>
    <845ba>   DW_AT_location    : 0x280bf (location list)
    <845be>   DW_AT_GNU_locviews: 0x280bd
 <2><845c2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <845c3>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <845c7>   DW_AT_decl_file   : 1
    <845c7>   DW_AT_decl_line   : 5
    <845c7>   DW_AT_decl_column : 71
    <845c8>   DW_AT_type        : <0x83c5f>
    <845cc>   DW_AT_location    : 0x280d3 (location list)
    <845d0>   DW_AT_GNU_locviews: 0x280c5
 <2><845d4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <845d5>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <845d9>   DW_AT_decl_file   : 1
    <845d9>   DW_AT_decl_line   : 5
    <845d9>   DW_AT_decl_column : 82
    <845da>   DW_AT_type        : <0x83c7b>
    <845de>   DW_AT_location    : 0x2810a (location list)
    <845e2>   DW_AT_GNU_locviews: 0x28100
 <2><845e6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <845e7>   DW_AT_name        : (indirect string, offset: 0x1808a): ispreset
    <845eb>   DW_AT_decl_file   : 1
    <845eb>   DW_AT_decl_line   : 5
    <845eb>   DW_AT_decl_column : 93
    <845ec>   DW_AT_type        : <0x83c7b>
    <845f0>   DW_AT_location    : 0x2813b (location list)
    <845f4>   DW_AT_GNU_locviews: 0x28131
 <2><845f8>: Abbrev Number: 41 (DW_TAG_variable)
    <845f9>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <845fd>   DW_AT_decl_file   : 1
    <845fe>   DW_AT_decl_line   : 7
    <845ff>   DW_AT_decl_column : 13
    <84600>   DW_AT_type        : <0x844e4>
    <84604>   DW_AT_location    : 0x28168 (location list)
    <84608>   DW_AT_GNU_locviews: 0x28162
 <2><8460c>: Abbrev Number: 28 (DW_TAG_variable)
    <8460d>   DW_AT_name        : x
    <8460f>   DW_AT_decl_file   : 1
    <8460f>   DW_AT_decl_line   : 8
    <8460f>   DW_AT_decl_column : 6
    <84610>   DW_AT_type        : <0x83c7b>
    <84614>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><84617>: Abbrev Number: 28 (DW_TAG_variable)
    <84618>   DW_AT_name        : y
    <8461a>   DW_AT_decl_file   : 1
    <8461a>   DW_AT_decl_line   : 8
    <8461a>   DW_AT_decl_column : 9
    <8461b>   DW_AT_type        : <0x83c7b>
    <8461f>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><84622>: Abbrev Number: 21 (DW_TAG_call_site)
    <84623>   DW_AT_call_return_pc: 0x45f106
    <8462b>   DW_AT_call_origin : <0x84563>
 <2><8462f>: Abbrev Number: 10 (DW_TAG_call_site)
    <84630>   DW_AT_call_return_pc: 0x45f114
    <84638>   DW_AT_call_origin : <0x8454c>
    <8463c>   DW_AT_sibling     : <0x8464d>
 <3><84640>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84641>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <84643>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><84646>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84647>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <84649>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><8464c>: Abbrev Number: 0
 <2><8464d>: Abbrev Number: 10 (DW_TAG_call_site)
    <8464e>   DW_AT_call_return_pc: 0x45f134
    <84656>   DW_AT_call_origin : <0x84519>
    <8465a>   DW_AT_sibling     : <0x8466b>
 <3><8465e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8465f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <84661>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><84664>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84665>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <84667>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><8466a>: Abbrev Number: 0
 <2><8466b>: Abbrev Number: 10 (DW_TAG_call_site)
    <8466c>   DW_AT_call_return_pc: 0x45f14e
    <84674>   DW_AT_call_origin : <0x844e9>
    <84678>   DW_AT_sibling     : <0x846a1>
 <3><8467c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8467d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8467f>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><84682>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84683>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <84685>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><84688>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84689>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <8468b>   DW_AT_call_value  : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <3><8468f>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84690>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <84692>   DW_AT_call_value  : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><84696>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84697>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <84699>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8469b>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8469c>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <8469e>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><846a0>: Abbrev Number: 0
 <2><846a1>: Abbrev Number: 10 (DW_TAG_call_site)
    <846a2>   DW_AT_call_return_pc: 0x45f16c
    <846aa>   DW_AT_call_origin : <0x844be>
    <846ae>   DW_AT_sibling     : <0x846c5>
 <3><846b2>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846b3>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <846b5>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><846b8>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846b9>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <846bb>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><846be>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846bf>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <846c1>   DW_AT_call_value  : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <3><846c4>: Abbrev Number: 0
 <2><846c5>: Abbrev Number: 21 (DW_TAG_call_site)
    <846c6>   DW_AT_call_return_pc: 0x45f195
    <846ce>   DW_AT_call_origin : <0x844b5>
 <2><846d2>: Abbrev Number: 42 (DW_TAG_call_site)
    <846d3>   DW_AT_call_return_pc: 0x45f1a6
    <846db>   DW_AT_sibling     : <0x846ec>
 <3><846df>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846e0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <846e2>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><846e5>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846e6>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <846e8>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><846eb>: Abbrev Number: 0
 <2><846ec>: Abbrev Number: 10 (DW_TAG_call_site)
    <846ed>   DW_AT_call_return_pc: 0x45f1c6
    <846f5>   DW_AT_call_origin : <0x8449e>
    <846f9>   DW_AT_sibling     : <0x84708>
 <3><846fd>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <846fe>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <84700>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><84702>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <84703>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <84705>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><84707>: Abbrev Number: 0
 <2><84708>: Abbrev Number: 10 (DW_TAG_call_site)
    <84709>   DW_AT_call_return_pc: 0x45f1fb
    <84711>   DW_AT_call_origin : <0x84530>
    <84715>   DW_AT_sibling     : <0x84720>
 <3><84719>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8471a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8471c>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><8471f>: Abbrev Number: 0
 <2><84720>: Abbrev Number: 21 (DW_TAG_call_site)
    <84721>   DW_AT_call_return_pc: 0x45f22c
    <84729>   DW_AT_call_origin : <0x8472e>
 <2><8472d>: Abbrev Number: 0
 <1><8472e>: Abbrev Number: 43 (DW_TAG_subprogram)
    <8472f>   DW_AT_external    : 1
    <8472f>   DW_AT_declaration : 1
    <8472f>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <84733>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><84737>: Abbrev Number: 0
  Compilation Unit @ offset 0x84738:
   Length:        0xf6a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3aa6
   Pointer Size:  8
 <0><84744>: Abbrev Number: 36 (DW_TAG_compile_unit)
    <84745>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <84749>   DW_AT_language    : 29	(C11)
    <8474a>   DW_AT_name        : (indirect line string, offset: 0x411): src/gfxlib2/gfx_put.c
    <8474e>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <84752>   DW_AT_low_pc      : 0x45f230
    <8475a>   DW_AT_high_pc     : 0x689
    <84762>   DW_AT_stmt_list   : 0x55f54
 <1><84766>: Abbrev Number: 8 (DW_TAG_base_type)
    <84767>   DW_AT_byte_size   : 1
    <84768>   DW_AT_encoding    : 8	(unsigned char)
    <84769>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><8476d>: Abbrev Number: 16 (DW_TAG_const_type)
    <8476e>   DW_AT_type        : <0x84766>
 <1><84772>: Abbrev Number: 8 (DW_TAG_base_type)
    <84773>   DW_AT_byte_size   : 2
    <84774>   DW_AT_encoding    : 7	(unsigned)
    <84775>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><84779>: Abbrev Number: 8 (DW_TAG_base_type)
    <8477a>   DW_AT_byte_size   : 4
    <8477b>   DW_AT_encoding    : 7	(unsigned)
    <8477c>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><84780>: Abbrev Number: 8 (DW_TAG_base_type)
    <84781>   DW_AT_byte_size   : 8
    <84782>   DW_AT_encoding    : 7	(unsigned)
    <84783>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><84787>: Abbrev Number: 8 (DW_TAG_base_type)
    <84788>   DW_AT_byte_size   : 1
    <84789>   DW_AT_encoding    : 6	(signed char)
    <8478a>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><8478e>: Abbrev Number: 8 (DW_TAG_base_type)
    <8478f>   DW_AT_byte_size   : 2
    <84790>   DW_AT_encoding    : 5	(signed)
    <84791>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><84795>: Abbrev Number: 37 (DW_TAG_base_type)
    <84796>   DW_AT_byte_size   : 4
    <84797>   DW_AT_encoding    : 5	(signed)
    <84798>   DW_AT_name        : int
 <1><8479c>: Abbrev Number: 38 (DW_TAG_volatile_type)
    <8479d>   DW_AT_type        : <0x84795>
 <1><847a1>: Abbrev Number: 16 (DW_TAG_const_type)
    <847a2>   DW_AT_type        : <0x84795>
 <1><847a6>: Abbrev Number: 8 (DW_TAG_base_type)
    <847a7>   DW_AT_byte_size   : 8
    <847a8>   DW_AT_encoding    : 5	(signed)
    <847a9>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><847ad>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <847ae>   DW_AT_byte_size   : 8
 <1><847af>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <847b0>   DW_AT_byte_size   : 8
    <847b0>   DW_AT_type        : <0x847b4>
 <1><847b4>: Abbrev Number: 8 (DW_TAG_base_type)
    <847b5>   DW_AT_byte_size   : 1
    <847b6>   DW_AT_encoding    : 6	(signed char)
    <847b7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><847bb>: Abbrev Number: 11 (DW_TAG_typedef)
    <847bc>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <847c0>   DW_AT_decl_file   : 2
    <847c1>   DW_AT_decl_line   : 209
    <847c2>   DW_AT_decl_column : 23
    <847c3>   DW_AT_type        : <0x84780>
 <1><847c7>: Abbrev Number: 31 (DW_TAG_typedef)
    <847c8>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <847cc>   DW_AT_decl_file   : 2
    <847cd>   DW_AT_decl_line   : 321
    <847cf>   DW_AT_decl_column : 24
    <847d0>   DW_AT_type        : <0x84795>
 <1><847d4>: Abbrev Number: 8 (DW_TAG_base_type)
    <847d5>   DW_AT_byte_size   : 8
    <847d6>   DW_AT_encoding    : 5	(signed)
    <847d7>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><847db>: Abbrev Number: 8 (DW_TAG_base_type)
    <847dc>   DW_AT_byte_size   : 8
    <847dd>   DW_AT_encoding    : 7	(unsigned)
    <847de>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><847e2>: Abbrev Number: 19 (DW_TAG_array_type)
    <847e3>   DW_AT_type        : <0x847b4>
    <847e7>   DW_AT_sibling     : <0x847f2>
 <2><847eb>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <847ec>   DW_AT_type        : <0x84780>
    <847f0>   DW_AT_upper_bound : 7
 <2><847f1>: Abbrev Number: 0
 <1><847f2>: Abbrev Number: 40 (DW_TAG_enumeration_type)
    <847f3>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <847f7>   DW_AT_encoding    : 7	(unsigned)
    <847f8>   DW_AT_byte_size   : 4
    <847f9>   DW_AT_type        : <0x84779>
    <847fd>   DW_AT_decl_file   : 7
    <847fe>   DW_AT_decl_line   : 1
    <847ff>   DW_AT_decl_column : 14
    <84800>   DW_AT_sibling     : <0x84877>
 <2><84804>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84805>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <84809>   DW_AT_const_value : 0
 <2><8480a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8480b>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <8480f>   DW_AT_const_value : 1
 <2><84810>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84811>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <84815>   DW_AT_const_value : 2
 <2><84816>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84817>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <8481b>   DW_AT_const_value : 3
 <2><8481c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8481d>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <84821>   DW_AT_const_value : 4
 <2><84822>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84823>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <84827>   DW_AT_const_value : 5
 <2><84828>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84829>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <8482d>   DW_AT_const_value : 6
 <2><8482e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8482f>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <84833>   DW_AT_const_value : 7
 <2><84834>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84835>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <84839>   DW_AT_const_value : 8
 <2><8483a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8483b>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <8483f>   DW_AT_const_value : 9
 <2><84840>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84841>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <84845>   DW_AT_const_value : 10
 <2><84846>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84847>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <8484b>   DW_AT_const_value : 11
 <2><8484c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8484d>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <84851>   DW_AT_const_value : 12
 <2><84852>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84853>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <84857>   DW_AT_const_value : 13
 <2><84858>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84859>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <8485d>   DW_AT_const_value : 14
 <2><8485e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8485f>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <84863>   DW_AT_const_value : 15
 <2><84864>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84865>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <84869>   DW_AT_const_value : 16
 <2><8486a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8486b>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <8486f>   DW_AT_const_value : 17
 <2><84870>: Abbrev Number: 5 (DW_TAG_enumerator)
    <84871>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <84875>   DW_AT_const_value : 18
 <2><84876>: Abbrev Number: 0
 <1><84877>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84878>   DW_AT_byte_size   : 8
    <84878>   DW_AT_type        : <0x8487c>
 <1><8487c>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <8487d>   DW_AT_prototyped  : 1
 <1><8487d>: Abbrev Number: 8 (DW_TAG_base_type)
    <8487e>   DW_AT_byte_size   : 8
    <8487f>   DW_AT_encoding    : 4	(float)
    <84880>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><84884>: Abbrev Number: 8 (DW_TAG_base_type)
    <84885>   DW_AT_byte_size   : 4
    <84886>   DW_AT_encoding    : 4	(float)
    <84887>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><8488b>: Abbrev Number: 11 (DW_TAG_typedef)
    <8488c>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <84890>   DW_AT_decl_file   : 3
    <84891>   DW_AT_decl_line   : 7
    <84892>   DW_AT_decl_column : 25
    <84893>   DW_AT_type        : <0x84897>
 <1><84897>: Abbrev Number: 42 (DW_TAG_structure_type)
    <84898>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <8489c>   DW_AT_declaration : 1
 <1><8489c>: Abbrev Number: 20 (DW_TAG_structure_type)
    <8489d>   DW_AT_byte_size   : 8
    <8489e>   DW_AT_decl_file   : 4
    <8489f>   DW_AT_decl_line   : 4
    <848a0>   DW_AT_decl_column : 3
    <848a0>   DW_AT_sibling     : <0x848bf>
 <2><848a4>: Abbrev Number: 1 (DW_TAG_member)
    <848a5>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <848a9>   DW_AT_decl_file   : 4
    <848aa>   DW_AT_decl_line   : 5
    <848ab>   DW_AT_decl_column : 8
    <848ac>   DW_AT_type        : <0x84795>
    <848b0>   DW_AT_data_member_location: 0
 <2><848b1>: Abbrev Number: 1 (DW_TAG_member)
    <848b2>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <848b6>   DW_AT_decl_file   : 4
    <848b7>   DW_AT_decl_line   : 6
    <848b8>   DW_AT_decl_column : 8
    <848b9>   DW_AT_type        : <0x84795>
    <848bd>   DW_AT_data_member_location: 4
 <2><848be>: Abbrev Number: 0
 <1><848bf>: Abbrev Number: 20 (DW_TAG_structure_type)
    <848c0>   DW_AT_byte_size   : 16
    <848c1>   DW_AT_decl_file   : 4
    <848c2>   DW_AT_decl_line   : 8
    <848c3>   DW_AT_decl_column : 3
    <848c3>   DW_AT_sibling     : <0x848f6>
 <2><848c7>: Abbrev Number: 7 (DW_TAG_member)
    <848c8>   DW_AT_name        : x
    <848ca>   DW_AT_decl_file   : 4
    <848cb>   DW_AT_decl_line   : 9
    <848cc>   DW_AT_decl_column : 8
    <848cd>   DW_AT_type        : <0x84795>
    <848d1>   DW_AT_data_member_location: 0
 <2><848d2>: Abbrev Number: 7 (DW_TAG_member)
    <848d3>   DW_AT_name        : y
    <848d5>   DW_AT_decl_file   : 4
    <848d6>   DW_AT_decl_line   : 9
    <848d7>   DW_AT_decl_column : 11
    <848d8>   DW_AT_type        : <0x84795>
    <848dc>   DW_AT_data_member_location: 4
 <2><848dd>: Abbrev Number: 7 (DW_TAG_member)
    <848de>   DW_AT_name        : dx
    <848e1>   DW_AT_decl_file   : 4
    <848e2>   DW_AT_decl_line   : 10
    <848e3>   DW_AT_decl_column : 8
    <848e4>   DW_AT_type        : <0x84795>
    <848e8>   DW_AT_data_member_location: 8
 <2><848e9>: Abbrev Number: 7 (DW_TAG_member)
    <848ea>   DW_AT_name        : dy
    <848ed>   DW_AT_decl_file   : 4
    <848ee>   DW_AT_decl_line   : 10
    <848ef>   DW_AT_decl_column : 12
    <848f0>   DW_AT_type        : <0x84795>
    <848f4>   DW_AT_data_member_location: 12
 <2><848f5>: Abbrev Number: 0
 <1><848f6>: Abbrev Number: 26 (DW_TAG_union_type)
    <848f7>   DW_AT_byte_size   : 16
    <848f7>   DW_AT_decl_file   : 4
    <848f8>   DW_AT_decl_line   : 3
    <848f9>   DW_AT_decl_column : 2
    <848f9>   DW_AT_sibling     : <0x84923>
 <2><848fd>: Abbrev Number: 21 (DW_TAG_member)
    <848fe>   DW_AT_type        : <0x8489c>
 <2><84902>: Abbrev Number: 21 (DW_TAG_member)
    <84903>   DW_AT_type        : <0x848bf>
 <2><84907>: Abbrev Number: 27 (DW_TAG_member)
    <84908>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <8490c>   DW_AT_decl_file   : 4
    <8490d>   DW_AT_decl_line   : 12
    <8490e>   DW_AT_decl_column : 7
    <8490e>   DW_AT_type        : <0x84795>
 <2><84912>: Abbrev Number: 32 (DW_TAG_member)
    <84913>   DW_AT_name        : z
    <84915>   DW_AT_decl_file   : 4
    <84915>   DW_AT_decl_line   : 13
    <84916>   DW_AT_decl_column : 7
    <84916>   DW_AT_type        : <0x84795>
 <2><8491a>: Abbrev Number: 32 (DW_TAG_member)
    <8491b>   DW_AT_name        : w
    <8491d>   DW_AT_decl_file   : 4
    <8491d>   DW_AT_decl_line   : 14
    <8491e>   DW_AT_decl_column : 7
    <8491e>   DW_AT_type        : <0x84795>
 <2><84922>: Abbrev Number: 0
 <1><84923>: Abbrev Number: 17 (DW_TAG_structure_type)
    <84924>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <84928>   DW_AT_byte_size   : 20
    <84929>   DW_AT_decl_file   : 4
    <8492a>   DW_AT_decl_line   : 1
    <8492b>   DW_AT_decl_column : 8
    <8492c>   DW_AT_sibling     : <0x84944>
 <2><84930>: Abbrev Number: 1 (DW_TAG_member)
    <84931>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <84935>   DW_AT_decl_file   : 4
    <84936>   DW_AT_decl_line   : 2
    <84937>   DW_AT_decl_column : 6
    <84938>   DW_AT_type        : <0x84795>
    <8493c>   DW_AT_data_member_location: 0
 <2><8493d>: Abbrev Number: 22 (DW_TAG_member)
    <8493e>   DW_AT_type        : <0x848f6>
    <84942>   DW_AT_data_member_location: 4
 <2><84943>: Abbrev Number: 0
 <1><84944>: Abbrev Number: 11 (DW_TAG_typedef)
    <84945>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <84949>   DW_AT_decl_file   : 4
    <8494a>   DW_AT_decl_line   : 18
    <8494b>   DW_AT_decl_column : 23
    <8494c>   DW_AT_type        : <0x84923>
 <1><84950>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84951>   DW_AT_byte_size   : 8
    <84951>   DW_AT_type        : <0x84955>
 <1><84955>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <84956>   DW_AT_prototyped  : 1
    <84956>   DW_AT_type        : <0x84795>
    <8495a>   DW_AT_sibling     : <0x84969>
 <2><8495e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8495f>   DW_AT_type        : <0x84795>
 <2><84963>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84964>   DW_AT_type        : <0x84795>
 <2><84968>: Abbrev Number: 0
 <1><84969>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8496a>   DW_AT_byte_size   : 8
    <8496a>   DW_AT_type        : <0x84795>
 <1><8496e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8496f>   DW_AT_byte_size   : 8
    <8496f>   DW_AT_type        : <0x84973>
 <1><84973>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <84974>   DW_AT_prototyped  : 1
    <84974>   DW_AT_type        : <0x84795>
    <84978>   DW_AT_sibling     : <0x84996>
 <2><8497c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8497d>   DW_AT_type        : <0x84969>
 <2><84981>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84982>   DW_AT_type        : <0x84969>
 <2><84986>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84987>   DW_AT_type        : <0x84969>
 <2><8498b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8498c>   DW_AT_type        : <0x84969>
 <2><84990>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84991>   DW_AT_type        : <0x84969>
 <2><84995>: Abbrev Number: 0
 <1><84996>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84997>   DW_AT_byte_size   : 8
    <84997>   DW_AT_type        : <0x84944>
 <1><8499b>: Abbrev Number: 11 (DW_TAG_typedef)
    <8499c>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <849a0>   DW_AT_decl_file   : 5
    <849a1>   DW_AT_decl_line   : 13
    <849a2>   DW_AT_decl_column : 30
    <849a3>   DW_AT_type        : <0x849a7>
 <1><849a7>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <849a8>   DW_AT_prototyped  : 1
    <849a8>   DW_AT_type        : <0x84779>
    <849ac>   DW_AT_sibling     : <0x849c0>
 <2><849b0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849b1>   DW_AT_type        : <0x84779>
 <2><849b5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849b6>   DW_AT_type        : <0x84779>
 <2><849ba>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849bb>   DW_AT_type        : <0x847ad>
 <2><849bf>: Abbrev Number: 0
 <1><849c0>: Abbrev Number: 11 (DW_TAG_typedef)
    <849c1>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <849c5>   DW_AT_decl_file   : 5
    <849c6>   DW_AT_decl_line   : 14
    <849c7>   DW_AT_decl_column : 15
    <849c8>   DW_AT_type        : <0x849cc>
 <1><849cc>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <849cd>   DW_AT_prototyped  : 1
    <849cd>   DW_AT_sibling     : <0x849ff>
 <2><849d1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849d2>   DW_AT_type        : <0x849ff>
 <2><849d6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849d7>   DW_AT_type        : <0x849ff>
 <2><849db>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849dc>   DW_AT_type        : <0x84795>
 <2><849e0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849e1>   DW_AT_type        : <0x84795>
 <2><849e5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849e6>   DW_AT_type        : <0x84795>
 <2><849ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849eb>   DW_AT_type        : <0x84795>
 <2><849ef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849f0>   DW_AT_type        : <0x84795>
 <2><849f4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849f5>   DW_AT_type        : <0x84a04>
 <2><849f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <849fa>   DW_AT_type        : <0x847ad>
 <2><849fe>: Abbrev Number: 0
 <1><849ff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84a00>   DW_AT_byte_size   : 8
    <84a00>   DW_AT_type        : <0x84766>
 <1><84a04>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84a05>   DW_AT_byte_size   : 8
    <84a05>   DW_AT_type        : <0x8499b>
 <1><84a09>: Abbrev Number: 20 (DW_TAG_structure_type)
    <84a0a>   DW_AT_byte_size   : 16
    <84a0b>   DW_AT_decl_file   : 5
    <84a0c>   DW_AT_decl_line   : 26
    <84a0d>   DW_AT_decl_column : 3
    <84a0d>   DW_AT_sibling     : <0x84a46>
 <2><84a11>: Abbrev Number: 1 (DW_TAG_member)
    <84a12>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <84a16>   DW_AT_decl_file   : 5
    <84a17>   DW_AT_decl_line   : 27
    <84a18>   DW_AT_decl_column : 8
    <84a19>   DW_AT_type        : <0x84795>
    <84a1d>   DW_AT_data_member_location: 0
 <2><84a1e>: Abbrev Number: 1 (DW_TAG_member)
    <84a1f>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <84a23>   DW_AT_decl_file   : 5
    <84a24>   DW_AT_decl_line   : 27
    <84a25>   DW_AT_decl_column : 16
    <84a26>   DW_AT_type        : <0x84795>
    <84a2a>   DW_AT_data_member_location: 4
 <2><84a2b>: Abbrev Number: 1 (DW_TAG_member)
    <84a2c>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <84a30>   DW_AT_decl_file   : 5
    <84a31>   DW_AT_decl_line   : 27
    <84a32>   DW_AT_decl_column : 24
    <84a33>   DW_AT_type        : <0x84795>
    <84a37>   DW_AT_data_member_location: 8
 <2><84a38>: Abbrev Number: 1 (DW_TAG_member)
    <84a39>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <84a3d>   DW_AT_decl_file   : 5
    <84a3e>   DW_AT_decl_line   : 27
    <84a3f>   DW_AT_decl_column : 32
    <84a40>   DW_AT_type        : <0x84795>
    <84a44>   DW_AT_data_member_location: 12
 <2><84a45>: Abbrev Number: 0
 <1><84a46>: Abbrev Number: 26 (DW_TAG_union_type)
    <84a47>   DW_AT_byte_size   : 16
    <84a47>   DW_AT_decl_file   : 5
    <84a48>   DW_AT_decl_line   : 25
    <84a49>   DW_AT_decl_column : 2
    <84a49>   DW_AT_sibling     : <0x84a5e>
 <2><84a4d>: Abbrev Number: 21 (DW_TAG_member)
    <84a4e>   DW_AT_type        : <0x84a09>
 <2><84a52>: Abbrev Number: 27 (DW_TAG_member)
    <84a53>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <84a57>   DW_AT_decl_file   : 5
    <84a58>   DW_AT_decl_line   : 29
    <84a59>   DW_AT_decl_column : 7
    <84a59>   DW_AT_type        : <0x84a5e>
 <2><84a5d>: Abbrev Number: 0
 <1><84a5e>: Abbrev Number: 19 (DW_TAG_array_type)
    <84a5f>   DW_AT_type        : <0x84795>
    <84a63>   DW_AT_sibling     : <0x84a6e>
 <2><84a67>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <84a68>   DW_AT_type        : <0x84780>
    <84a6c>   DW_AT_upper_bound : 3
 <2><84a6d>: Abbrev Number: 0
 <1><84a6e>: Abbrev Number: 20 (DW_TAG_structure_type)
    <84a6f>   DW_AT_byte_size   : 16
    <84a70>   DW_AT_decl_file   : 5
    <84a71>   DW_AT_decl_line   : 32
    <84a72>   DW_AT_decl_column : 3
    <84a72>   DW_AT_sibling     : <0x84aab>
 <2><84a76>: Abbrev Number: 1 (DW_TAG_member)
    <84a77>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <84a7b>   DW_AT_decl_file   : 5
    <84a7c>   DW_AT_decl_line   : 33
    <84a7d>   DW_AT_decl_column : 8
    <84a7e>   DW_AT_type        : <0x84795>
    <84a82>   DW_AT_data_member_location: 0
 <2><84a83>: Abbrev Number: 1 (DW_TAG_member)
    <84a84>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <84a88>   DW_AT_decl_file   : 5
    <84a89>   DW_AT_decl_line   : 33
    <84a8a>   DW_AT_decl_column : 20
    <84a8b>   DW_AT_type        : <0x84795>
    <84a8f>   DW_AT_data_member_location: 4
 <2><84a90>: Abbrev Number: 1 (DW_TAG_member)
    <84a91>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <84a95>   DW_AT_decl_file   : 5
    <84a96>   DW_AT_decl_line   : 33
    <84a97>   DW_AT_decl_column : 32
    <84a98>   DW_AT_type        : <0x84795>
    <84a9c>   DW_AT_data_member_location: 8
 <2><84a9d>: Abbrev Number: 1 (DW_TAG_member)
    <84a9e>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <84aa2>   DW_AT_decl_file   : 5
    <84aa3>   DW_AT_decl_line   : 33
    <84aa4>   DW_AT_decl_column : 44
    <84aa5>   DW_AT_type        : <0x84795>
    <84aa9>   DW_AT_data_member_location: 12
 <2><84aaa>: Abbrev Number: 0
 <1><84aab>: Abbrev Number: 26 (DW_TAG_union_type)
    <84aac>   DW_AT_byte_size   : 16
    <84aac>   DW_AT_decl_file   : 5
    <84aad>   DW_AT_decl_line   : 31
    <84aae>   DW_AT_decl_column : 2
    <84aae>   DW_AT_sibling     : <0x84ac3>
 <2><84ab2>: Abbrev Number: 21 (DW_TAG_member)
    <84ab3>   DW_AT_type        : <0x84a6e>
 <2><84ab7>: Abbrev Number: 27 (DW_TAG_member)
    <84ab8>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <84abc>   DW_AT_decl_file   : 5
    <84abd>   DW_AT_decl_line   : 35
    <84abe>   DW_AT_decl_column : 7
    <84abe>   DW_AT_type        : <0x84a5e>
 <2><84ac2>: Abbrev Number: 0
 <1><84ac3>: Abbrev Number: 17 (DW_TAG_structure_type)
    <84ac4>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <84ac8>   DW_AT_byte_size   : 216
    <84ac9>   DW_AT_decl_file   : 5
    <84aca>   DW_AT_decl_line   : 16
    <84acb>   DW_AT_decl_column : 16
    <84acc>   DW_AT_sibling     : <0x84be0>
 <2><84ad0>: Abbrev Number: 7 (DW_TAG_member)
    <84ad1>   DW_AT_name        : id
    <84ad4>   DW_AT_decl_file   : 5
    <84ad5>   DW_AT_decl_line   : 17
    <84ad6>   DW_AT_decl_column : 6
    <84ad7>   DW_AT_type        : <0x84795>
    <84adb>   DW_AT_data_member_location: 0
 <2><84adc>: Abbrev Number: 1 (DW_TAG_member)
    <84add>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <84ae1>   DW_AT_decl_file   : 5
    <84ae2>   DW_AT_decl_line   : 18
    <84ae3>   DW_AT_decl_column : 6
    <84ae4>   DW_AT_type        : <0x84795>
    <84ae8>   DW_AT_data_member_location: 4
 <2><84ae9>: Abbrev Number: 1 (DW_TAG_member)
    <84aea>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <84aee>   DW_AT_decl_file   : 5
    <84aef>   DW_AT_decl_line   : 19
    <84af0>   DW_AT_decl_column : 18
    <84af1>   DW_AT_type        : <0x84be0>
    <84af5>   DW_AT_data_member_location: 8
 <2><84af6>: Abbrev Number: 1 (DW_TAG_member)
    <84af7>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <84afb>   DW_AT_decl_file   : 5
    <84afc>   DW_AT_decl_line   : 20
    <84afd>   DW_AT_decl_column : 6
    <84afe>   DW_AT_type        : <0x84795>
    <84b02>   DW_AT_data_member_location: 16
 <2><84b03>: Abbrev Number: 1 (DW_TAG_member)
    <84b04>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <84b08>   DW_AT_decl_file   : 5
    <84b09>   DW_AT_decl_line   : 21
    <84b0a>   DW_AT_decl_column : 6
    <84b0b>   DW_AT_type        : <0x84795>
    <84b0f>   DW_AT_data_member_location: 20
 <2><84b10>: Abbrev Number: 1 (DW_TAG_member)
    <84b11>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <84b15>   DW_AT_decl_file   : 5
    <84b16>   DW_AT_decl_line   : 22
    <84b17>   DW_AT_decl_column : 6
    <84b18>   DW_AT_type        : <0x84795>
    <84b1c>   DW_AT_data_member_location: 24
 <2><84b1d>: Abbrev Number: 1 (DW_TAG_member)
    <84b1e>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <84b22>   DW_AT_decl_file   : 5
    <84b23>   DW_AT_decl_line   : 23
    <84b24>   DW_AT_decl_column : 8
    <84b25>   DW_AT_type        : <0x847ad>
    <84b29>   DW_AT_data_member_location: 32
 <2><84b2a>: Abbrev Number: 1 (DW_TAG_member)
    <84b2b>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <84b2f>   DW_AT_decl_file   : 5
    <84b30>   DW_AT_decl_line   : 24
    <84b31>   DW_AT_decl_column : 8
    <84b32>   DW_AT_type        : <0x84884>
    <84b36>   DW_AT_data_member_location: 40
 <2><84b37>: Abbrev Number: 1 (DW_TAG_member)
    <84b38>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <84b3c>   DW_AT_decl_file   : 5
    <84b3d>   DW_AT_decl_line   : 24
    <84b3e>   DW_AT_decl_column : 16
    <84b3f>   DW_AT_type        : <0x84884>
    <84b43>   DW_AT_data_member_location: 44
 <2><84b44>: Abbrev Number: 22 (DW_TAG_member)
    <84b45>   DW_AT_type        : <0x84a46>
    <84b49>   DW_AT_data_member_location: 48
 <2><84b4a>: Abbrev Number: 22 (DW_TAG_member)
    <84b4b>   DW_AT_type        : <0x84aab>
    <84b4f>   DW_AT_data_member_location: 64
 <2><84b50>: Abbrev Number: 1 (DW_TAG_member)
    <84b51>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <84b55>   DW_AT_decl_file   : 5
    <84b56>   DW_AT_decl_line   : 37
    <84b57>   DW_AT_decl_column : 8
    <84b58>   DW_AT_type        : <0x84884>
    <84b5c>   DW_AT_data_member_location: 80
 <2><84b5d>: Abbrev Number: 1 (DW_TAG_member)
    <84b5e>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <84b62>   DW_AT_decl_file   : 5
    <84b63>   DW_AT_decl_line   : 37
    <84b64>   DW_AT_decl_column : 15
    <84b65>   DW_AT_type        : <0x84884>
    <84b69>   DW_AT_data_member_location: 84
 <2><84b6a>: Abbrev Number: 1 (DW_TAG_member)
    <84b6b>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <84b6f>   DW_AT_decl_file   : 5
    <84b70>   DW_AT_decl_line   : 37
    <84b71>   DW_AT_decl_column : 22
    <84b72>   DW_AT_type        : <0x84884>
    <84b76>   DW_AT_data_member_location: 88
 <2><84b77>: Abbrev Number: 1 (DW_TAG_member)
    <84b78>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <84b7c>   DW_AT_decl_file   : 5
    <84b7d>   DW_AT_decl_line   : 37
    <84b7e>   DW_AT_decl_column : 29
    <84b7f>   DW_AT_type        : <0x84884>
    <84b83>   DW_AT_data_member_location: 92
 <2><84b84>: Abbrev Number: 1 (DW_TAG_member)
    <84b85>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <84b89>   DW_AT_decl_file   : 5
    <84b8a>   DW_AT_decl_line   : 38
    <84b8b>   DW_AT_decl_column : 15
    <84b8c>   DW_AT_type        : <0x84779>
    <84b90>   DW_AT_data_member_location: 96
 <2><84b91>: Abbrev Number: 1 (DW_TAG_member)
    <84b92>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <84b96>   DW_AT_decl_file   : 5
    <84b97>   DW_AT_decl_line   : 38
    <84b98>   DW_AT_decl_column : 25
    <84b99>   DW_AT_type        : <0x84779>
    <84b9d>   DW_AT_data_member_location: 100
 <2><84b9e>: Abbrev Number: 1 (DW_TAG_member)
    <84b9f>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <84ba3>   DW_AT_decl_file   : 5
    <84ba4>   DW_AT_decl_line   : 39
    <84ba5>   DW_AT_decl_column : 9
    <84ba6>   DW_AT_type        : <0x84c04>
    <84baa>   DW_AT_data_member_location: 104
 <2><84bab>: Abbrev Number: 1 (DW_TAG_member)
    <84bac>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <84bb0>   DW_AT_decl_file   : 5
    <84bb1>   DW_AT_decl_line   : 40
    <84bb2>   DW_AT_decl_column : 17
    <84bb3>   DW_AT_type        : <0x84c22>
    <84bb7>   DW_AT_data_member_location: 112
 <2><84bb8>: Abbrev Number: 1 (DW_TAG_member)
    <84bb9>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <84bbd>   DW_AT_decl_file   : 5
    <84bbe>   DW_AT_decl_line   : 41
    <84bbf>   DW_AT_decl_column : 10
    <84bc0>   DW_AT_type        : <0x84c40>
    <84bc4>   DW_AT_data_member_location: 120
 <2><84bc5>: Abbrev Number: 1 (DW_TAG_member)
    <84bc6>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <84bca>   DW_AT_decl_file   : 5
    <84bcb>   DW_AT_decl_line   : 42
    <84bcc>   DW_AT_decl_column : 11
    <84bcd>   DW_AT_type        : <0x84c45>
    <84bd1>   DW_AT_data_member_location: 128
 <2><84bd2>: Abbrev Number: 1 (DW_TAG_member)
    <84bd3>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <84bd7>   DW_AT_decl_file   : 5
    <84bd8>   DW_AT_decl_line   : 43
    <84bd9>   DW_AT_decl_column : 6
    <84bda>   DW_AT_type        : <0x84795>
    <84bde>   DW_AT_data_member_location: 208
 <2><84bdf>: Abbrev Number: 0
 <1><84be0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84be1>   DW_AT_byte_size   : 8
    <84be1>   DW_AT_type        : <0x849ff>
 <1><84be5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <84be6>   DW_AT_prototyped  : 1
    <84be6>   DW_AT_sibling     : <0x84bff>
 <2><84bea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84beb>   DW_AT_type        : <0x84bff>
 <2><84bef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84bf0>   DW_AT_type        : <0x84795>
 <2><84bf4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84bf5>   DW_AT_type        : <0x84795>
 <2><84bf9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84bfa>   DW_AT_type        : <0x84779>
 <2><84bfe>: Abbrev Number: 0
 <1><84bff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c00>   DW_AT_byte_size   : 8
    <84c00>   DW_AT_type        : <0x84ac3>
 <1><84c04>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c05>   DW_AT_byte_size   : 8
    <84c05>   DW_AT_type        : <0x84be5>
 <1><84c09>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <84c0a>   DW_AT_prototyped  : 1
    <84c0a>   DW_AT_type        : <0x84779>
    <84c0e>   DW_AT_sibling     : <0x84c22>
 <2><84c12>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c13>   DW_AT_type        : <0x84bff>
 <2><84c17>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c18>   DW_AT_type        : <0x84795>
 <2><84c1c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c1d>   DW_AT_type        : <0x84795>
 <2><84c21>: Abbrev Number: 0
 <1><84c22>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c23>   DW_AT_byte_size   : 8
    <84c23>   DW_AT_type        : <0x84c09>
 <1><84c27>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <84c28>   DW_AT_prototyped  : 1
    <84c28>   DW_AT_type        : <0x847ad>
    <84c2c>   DW_AT_sibling     : <0x84c40>
 <2><84c30>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c31>   DW_AT_type        : <0x847ad>
 <2><84c35>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c36>   DW_AT_type        : <0x84795>
 <2><84c3a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c3b>   DW_AT_type        : <0x847bb>
 <2><84c3f>: Abbrev Number: 0
 <1><84c40>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c41>   DW_AT_byte_size   : 8
    <84c41>   DW_AT_type        : <0x84c27>
 <1><84c45>: Abbrev Number: 19 (DW_TAG_array_type)
    <84c46>   DW_AT_type        : <0x84c55>
    <84c4a>   DW_AT_sibling     : <0x84c55>
 <2><84c4e>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <84c4f>   DW_AT_type        : <0x84780>
    <84c53>   DW_AT_upper_bound : 9
 <2><84c54>: Abbrev Number: 0
 <1><84c55>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c56>   DW_AT_byte_size   : 8
    <84c56>   DW_AT_type        : <0x84c5a>
 <1><84c5a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <84c5b>   DW_AT_byte_size   : 8
    <84c5b>   DW_AT_type        : <0x849c0>
 <1><84c5f>: Abbrev Number: 11 (DW_TAG_typedef)
    <84c60>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <84c64>   DW_AT_decl_file   : 5
    <84c65>   DW_AT_decl_line   : 44
    <84c66>   DW_AT_decl_column : 3
    <84c67>   DW_AT_type        : <0x84ac3>
 <1><84c6b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <84c6c>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <84c70>   DW_AT_byte_size   : 12
    <84c71>   DW_AT_decl_file   : 6
    <84c72>   DW_AT_decl_line   : 139
    <84c73>   DW_AT_decl_column : 16
    <84c74>   DW_AT_sibling     : <0x84c9d>
 <2><84c78>: Abbrev Number: 7 (DW_TAG_member)
    <84c79>   DW_AT_name        : ch
    <84c7c>   DW_AT_decl_file   : 6
    <84c7d>   DW_AT_decl_line   : 140
    <84c7e>   DW_AT_decl_column : 14
    <84c7f>   DW_AT_type        : <0x847c7>
    <84c83>   DW_AT_data_member_location: 0
 <2><84c84>: Abbrev Number: 7 (DW_TAG_member)
    <84c85>   DW_AT_name        : fg
    <84c88>   DW_AT_decl_file   : 6
    <84c89>   DW_AT_decl_line   : 141
    <84c8a>   DW_AT_decl_column : 14
    <84c8b>   DW_AT_type        : <0x84779>
    <84c8f>   DW_AT_data_member_location: 4
 <2><84c90>: Abbrev Number: 7 (DW_TAG_member)
    <84c91>   DW_AT_name        : bg
    <84c94>   DW_AT_decl_file   : 6
    <84c95>   DW_AT_decl_line   : 141
    <84c96>   DW_AT_decl_column : 18
    <84c97>   DW_AT_type        : <0x84779>
    <84c9b>   DW_AT_data_member_location: 8
 <2><84c9c>: Abbrev Number: 0
 <1><84c9d>: Abbrev Number: 11 (DW_TAG_typedef)
    <84c9e>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <84ca2>   DW_AT_decl_file   : 6
    <84ca3>   DW_AT_decl_line   : 142
    <84ca4>   DW_AT_decl_column : 3
    <84ca5>   DW_AT_type        : <0x84c6b>
 <1><84ca9>: Abbrev Number: 17 (DW_TAG_structure_type)
    <84caa>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <84cae>   DW_AT_byte_size   : 208
    <84caf>   DW_AT_decl_file   : 6
    <84cb0>   DW_AT_decl_line   : 144
    <84cb1>   DW_AT_decl_column : 16
    <84cb2>   DW_AT_sibling     : <0x84e6c>
 <2><84cb6>: Abbrev Number: 7 (DW_TAG_member)
    <84cb7>   DW_AT_name        : id
    <84cba>   DW_AT_decl_file   : 6
    <84cbb>   DW_AT_decl_line   : 146
    <84cbc>   DW_AT_decl_column : 6
    <84cbd>   DW_AT_type        : <0x84795>
    <84cc1>   DW_AT_data_member_location: 0
 <2><84cc2>: Abbrev Number: 1 (DW_TAG_member)
    <84cc3>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <84cc7>   DW_AT_decl_file   : 6
    <84cc8>   DW_AT_decl_line   : 147
    <84cc9>   DW_AT_decl_column : 9
    <84cca>   DW_AT_type        : <0x84795>
    <84cce>   DW_AT_data_member_location: 4
 <2><84ccf>: Abbrev Number: 1 (DW_TAG_member)
    <84cd0>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <84cd4>   DW_AT_decl_file   : 6
    <84cd5>   DW_AT_decl_line   : 148
    <84cd6>   DW_AT_decl_column : 21
    <84cd7>   DW_AT_type        : <0x84be0>
    <84cdb>   DW_AT_data_member_location: 8
 <2><84cdc>: Abbrev Number: 1 (DW_TAG_member)
    <84cdd>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <84ce1>   DW_AT_decl_file   : 6
    <84ce2>   DW_AT_decl_line   : 149
    <84ce3>   DW_AT_decl_column : 9
    <84ce4>   DW_AT_type        : <0x84795>
    <84ce8>   DW_AT_data_member_location: 16
 <2><84ce9>: Abbrev Number: 1 (DW_TAG_member)
    <84cea>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <84cee>   DW_AT_decl_file   : 6
    <84cef>   DW_AT_decl_line   : 150
    <84cf0>   DW_AT_decl_column : 9
    <84cf1>   DW_AT_type        : <0x84795>
    <84cf5>   DW_AT_data_member_location: 20
 <2><84cf6>: Abbrev Number: 1 (DW_TAG_member)
    <84cf7>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <84cfb>   DW_AT_decl_file   : 6
    <84cfc>   DW_AT_decl_line   : 151
    <84cfd>   DW_AT_decl_column : 20
    <84cfe>   DW_AT_type        : <0x849ff>
    <84d02>   DW_AT_data_member_location: 24
 <2><84d03>: Abbrev Number: 7 (DW_TAG_member)
    <84d04>   DW_AT_name        : w
    <84d06>   DW_AT_decl_file   : 6
    <84d07>   DW_AT_decl_line   : 152
    <84d08>   DW_AT_decl_column : 9
    <84d09>   DW_AT_type        : <0x84795>
    <84d0d>   DW_AT_data_member_location: 32
 <2><84d0e>: Abbrev Number: 7 (DW_TAG_member)
    <84d0f>   DW_AT_name        : h
    <84d11>   DW_AT_decl_file   : 6
    <84d12>   DW_AT_decl_line   : 152
    <84d13>   DW_AT_decl_column : 12
    <84d14>   DW_AT_type        : <0x84795>
    <84d18>   DW_AT_data_member_location: 36
 <2><84d19>: Abbrev Number: 1 (DW_TAG_member)
    <84d1a>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <84d1e>   DW_AT_decl_file   : 6
    <84d1f>   DW_AT_decl_line   : 153
    <84d20>   DW_AT_decl_column : 9
    <84d21>   DW_AT_type        : <0x84795>
    <84d25>   DW_AT_data_member_location: 40
 <2><84d26>: Abbrev Number: 7 (DW_TAG_member)
    <84d27>   DW_AT_name        : bpp
