    <98fdd>   DW_AT_type        : <0x98fd7>
 <1><98fe1>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <98fe2>   DW_AT_prototyped  : 1
    <98fe2>   DW_AT_type        : <0x98e27>
    <98fe6>   DW_AT_sibling     : <0x98ffa>
 <2><98fea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <98feb>   DW_AT_type        : <0x98e27>
 <2><98fef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <98ff0>   DW_AT_type        : <0x98dc7>
 <2><98ff4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <98ff5>   DW_AT_type        : <0x98e46>
 <2><98ff9>: Abbrev Number: 0
 <1><98ffa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <98ffb>   DW_AT_byte_size   : 8
    <98ffb>   DW_AT_type        : <0x98fe1>
 <1><98fff>: Abbrev Number: 9 (DW_TAG_typedef)
    <99000>   DW_AT_name        : (indirect string, offset: 0x19e73): BLITTER
    <99004>   DW_AT_decl_file   : 7
    <99005>   DW_AT_decl_line   : 137
    <99006>   DW_AT_decl_column : 15
    <99007>   DW_AT_type        : <0x9900b>
 <1><9900b>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <9900c>   DW_AT_prototyped  : 1
    <9900c>   DW_AT_sibling     : <0x9901b>
 <2><99010>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99011>   DW_AT_type        : <0x98fd7>
 <2><99015>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99016>   DW_AT_type        : <0x98dc7>
 <2><9901a>: Abbrev Number: 0
 <1><9901b>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9901c>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <99020>   DW_AT_byte_size   : 12
    <99021>   DW_AT_decl_file   : 7
    <99022>   DW_AT_decl_line   : 139
    <99023>   DW_AT_decl_column : 16
    <99024>   DW_AT_sibling     : <0x9904d>
 <2><99028>: Abbrev Number: 13 (DW_TAG_member)
    <99029>   DW_AT_name        : ch
    <9902c>   DW_AT_decl_file   : 7
    <9902d>   DW_AT_decl_line   : 140
    <9902e>   DW_AT_decl_column : 14
    <9902f>   DW_AT_type        : <0x98e52>
    <99033>   DW_AT_data_member_location: 0
 <2><99034>: Abbrev Number: 13 (DW_TAG_member)
    <99035>   DW_AT_name        : fg
    <99038>   DW_AT_decl_file   : 7
    <99039>   DW_AT_decl_line   : 141
    <9903a>   DW_AT_decl_column : 14
    <9903b>   DW_AT_type        : <0x98dab>
    <9903f>   DW_AT_data_member_location: 4
 <2><99040>: Abbrev Number: 13 (DW_TAG_member)
    <99041>   DW_AT_name        : bg
    <99044>   DW_AT_decl_file   : 7
    <99045>   DW_AT_decl_line   : 141
    <99046>   DW_AT_decl_column : 18
    <99047>   DW_AT_type        : <0x98dab>
    <9904b>   DW_AT_data_member_location: 8
 <2><9904c>: Abbrev Number: 0
 <1><9904d>: Abbrev Number: 9 (DW_TAG_typedef)
    <9904e>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <99052>   DW_AT_decl_file   : 7
    <99053>   DW_AT_decl_line   : 142
    <99054>   DW_AT_decl_column : 3
    <99055>   DW_AT_type        : <0x9901b>
 <1><99059>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9905a>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9905e>   DW_AT_byte_size   : 208
    <9905f>   DW_AT_decl_file   : 7
    <99060>   DW_AT_decl_line   : 144
    <99061>   DW_AT_decl_column : 16
    <99062>   DW_AT_sibling     : <0x9921c>
 <2><99066>: Abbrev Number: 13 (DW_TAG_member)
    <99067>   DW_AT_name        : id
    <9906a>   DW_AT_decl_file   : 7
    <9906b>   DW_AT_decl_line   : 146
    <9906c>   DW_AT_decl_column : 6
    <9906d>   DW_AT_type        : <0x98dc7>
    <99071>   DW_AT_data_member_location: 0
 <2><99072>: Abbrev Number: 3 (DW_TAG_member)
    <99073>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <99077>   DW_AT_decl_file   : 7
    <99078>   DW_AT_decl_line   : 147
    <99079>   DW_AT_decl_column : 9
    <9907a>   DW_AT_type        : <0x98dc7>
    <9907e>   DW_AT_data_member_location: 4
 <2><9907f>: Abbrev Number: 3 (DW_TAG_member)
    <99080>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <99084>   DW_AT_decl_file   : 7
    <99085>   DW_AT_decl_line   : 148
    <99086>   DW_AT_decl_column : 21
    <99087>   DW_AT_type        : <0x98fdc>
    <9908b>   DW_AT_data_member_location: 8
 <2><9908c>: Abbrev Number: 3 (DW_TAG_member)
    <9908d>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <99091>   DW_AT_decl_file   : 7
    <99092>   DW_AT_decl_line   : 149
    <99093>   DW_AT_decl_column : 9
    <99094>   DW_AT_type        : <0x98dc7>
    <99098>   DW_AT_data_member_location: 16
 <2><99099>: Abbrev Number: 3 (DW_TAG_member)
    <9909a>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <9909e>   DW_AT_decl_file   : 7
    <9909f>   DW_AT_decl_line   : 150
    <990a0>   DW_AT_decl_column : 9
    <990a1>   DW_AT_type        : <0x98dc7>
    <990a5>   DW_AT_data_member_location: 20
 <2><990a6>: Abbrev Number: 3 (DW_TAG_member)
    <990a7>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <990ab>   DW_AT_decl_file   : 7
    <990ac>   DW_AT_decl_line   : 151
    <990ad>   DW_AT_decl_column : 20
    <990ae>   DW_AT_type        : <0x98fd7>
    <990b2>   DW_AT_data_member_location: 24
 <2><990b3>: Abbrev Number: 13 (DW_TAG_member)
    <990b4>   DW_AT_name        : w
    <990b6>   DW_AT_decl_file   : 7
    <990b7>   DW_AT_decl_line   : 152
    <990b8>   DW_AT_decl_column : 9
    <990b9>   DW_AT_type        : <0x98dc7>
    <990bd>   DW_AT_data_member_location: 32
 <2><990be>: Abbrev Number: 13 (DW_TAG_member)
    <990bf>   DW_AT_name        : h
    <990c1>   DW_AT_decl_file   : 7
    <990c2>   DW_AT_decl_line   : 152
    <990c3>   DW_AT_decl_column : 12
    <990c4>   DW_AT_type        : <0x98dc7>
    <990c8>   DW_AT_data_member_location: 36
 <2><990c9>: Abbrev Number: 3 (DW_TAG_member)
    <990ca>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <990ce>   DW_AT_decl_file   : 7
    <990cf>   DW_AT_decl_line   : 153
    <990d0>   DW_AT_decl_column : 9
    <990d1>   DW_AT_type        : <0x98dc7>
    <990d5>   DW_AT_data_member_location: 40
 <2><990d6>: Abbrev Number: 13 (DW_TAG_member)
    <990d7>   DW_AT_name        : bpp
    <990db>   DW_AT_decl_file   : 7
    <990dc>   DW_AT_decl_line   : 154
    <990dd>   DW_AT_decl_column : 9
    <990de>   DW_AT_type        : <0x98dc7>
    <990e2>   DW_AT_data_member_location: 44
 <2><990e3>: Abbrev Number: 3 (DW_TAG_member)
    <990e4>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <990e8>   DW_AT_decl_file   : 7
    <990e9>   DW_AT_decl_line   : 155
    <990ea>   DW_AT_decl_column : 9
    <990eb>   DW_AT_type        : <0x98dc7>
    <990ef>   DW_AT_data_member_location: 48
 <2><990f0>: Abbrev Number: 3 (DW_TAG_member)
    <990f1>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <990f5>   DW_AT_decl_file   : 7
    <990f6>   DW_AT_decl_line   : 156
    <990f7>   DW_AT_decl_column : 19
    <990f8>   DW_AT_type        : <0x9921c>
    <990fc>   DW_AT_data_member_location: 56
 <2><990fd>: Abbrev Number: 3 (DW_TAG_member)
    <990fe>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <99102>   DW_AT_decl_file   : 7
    <99103>   DW_AT_decl_line   : 157
    <99104>   DW_AT_decl_column : 19
    <99105>   DW_AT_type        : <0x9921c>
    <99109>   DW_AT_data_member_location: 64
 <2><9910a>: Abbrev Number: 3 (DW_TAG_member)
    <9910b>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <9910f>   DW_AT_decl_file   : 7
    <99110>   DW_AT_decl_line   : 158
    <99111>   DW_AT_decl_column : 20
    <99112>   DW_AT_type        : <0x98fd7>
    <99116>   DW_AT_data_member_location: 72
 <2><99117>: Abbrev Number: 3 (DW_TAG_member)
    <99118>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <9911c>   DW_AT_decl_file   : 7
    <9911d>   DW_AT_decl_line   : 159
    <9911e>   DW_AT_decl_column : 11
    <9911f>   DW_AT_type        : <0x98e35>
    <99123>   DW_AT_data_member_location: 80
 <2><99124>: Abbrev Number: 3 (DW_TAG_member)
    <99125>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <99129>   DW_AT_decl_file   : 7
    <9912a>   DW_AT_decl_line   : 160
    <9912b>   DW_AT_decl_column : 29
    <9912c>   DW_AT_type        : <0x992f2>
    <99130>   DW_AT_data_member_location: 88
 <2><99131>: Abbrev Number: 3 (DW_TAG_member)
    <99132>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <99136>   DW_AT_decl_file   : 7
    <99137>   DW_AT_decl_line   : 161
    <99138>   DW_AT_decl_column : 9
    <99139>   DW_AT_type        : <0x98dc7>
    <9913d>   DW_AT_data_member_location: 96
 <2><9913e>: Abbrev Number: 3 (DW_TAG_member)
    <9913f>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <99143>   DW_AT_decl_file   : 7
    <99144>   DW_AT_decl_line   : 162
    <99145>   DW_AT_decl_column : 27
    <99146>   DW_AT_type        : <0x99327>
    <9914a>   DW_AT_data_member_location: 104
 <2><9914b>: Abbrev Number: 3 (DW_TAG_member)
    <9914c>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <99150>   DW_AT_decl_file   : 7
    <99151>   DW_AT_decl_line   : 163
    <99152>   DW_AT_decl_column : 9
    <99153>   DW_AT_type        : <0x98dc7>
    <99157>   DW_AT_data_member_location: 112
 <2><99158>: Abbrev Number: 3 (DW_TAG_member)
    <99159>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <9915d>   DW_AT_decl_file   : 7
    <9915e>   DW_AT_decl_line   : 164
    <9915f>   DW_AT_decl_column : 9
    <99160>   DW_AT_type        : <0x98dc7>
    <99164>   DW_AT_data_member_location: 116
 <2><99165>: Abbrev Number: 3 (DW_TAG_member)
    <99166>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <9916a>   DW_AT_decl_file   : 7
    <9916b>   DW_AT_decl_line   : 164
    <9916c>   DW_AT_decl_column : 19
    <9916d>   DW_AT_type        : <0x98dc7>
    <99171>   DW_AT_data_member_location: 120
 <2><99172>: Abbrev Number: 3 (DW_TAG_member)
    <99173>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <99177>   DW_AT_decl_file   : 7
    <99178>   DW_AT_decl_line   : 165
    <99179>   DW_AT_decl_column : 24
    <9917a>   DW_AT_type        : <0x99366>
    <9917e>   DW_AT_data_member_location: 128
 <2><9917f>: Abbrev Number: 3 (DW_TAG_member)
    <99180>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <99184>   DW_AT_decl_file   : 7
    <99185>   DW_AT_decl_line   : 166
    <99186>   DW_AT_decl_column : 9
    <99187>   DW_AT_type        : <0x98dc7>
    <9918b>   DW_AT_data_member_location: 136
 <2><9918c>: Abbrev Number: 3 (DW_TAG_member)
    <9918d>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <99191>   DW_AT_decl_file   : 7
    <99192>   DW_AT_decl_line   : 166
    <99193>   DW_AT_decl_column : 17
    <99194>   DW_AT_type        : <0x98dc7>
    <99198>   DW_AT_data_member_location: 140
 <2><99199>: Abbrev Number: 3 (DW_TAG_member)
    <9919a>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <9919e>   DW_AT_decl_file   : 7
    <9919f>   DW_AT_decl_line   : 167
    <991a0>   DW_AT_decl_column : 11
    <991a1>   DW_AT_type        : <0x98eb1>
    <991a5>   DW_AT_data_member_location: 144
 <2><991a6>: Abbrev Number: 13 (DW_TAG_member)
    <991a7>   DW_AT_name        : key
    <991ab>   DW_AT_decl_file   : 7
    <991ac>   DW_AT_decl_line   : 168
    <991ad>   DW_AT_decl_column : 11
    <991ae>   DW_AT_type        : <0x98e35>
    <991b2>   DW_AT_data_member_location: 152
 <2><991b3>: Abbrev Number: 3 (DW_TAG_member)
    <991b4>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <991b8>   DW_AT_decl_file   : 7
    <991b9>   DW_AT_decl_line   : 169
    <991ba>   DW_AT_decl_column : 6
    <991bb>   DW_AT_type        : <0x98dc7>
    <991bf>   DW_AT_data_member_location: 160
 <2><991c0>: Abbrev Number: 3 (DW_TAG_member)
    <991c1>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <991c5>   DW_AT_decl_file   : 7
    <991c6>   DW_AT_decl_line   : 170
    <991c7>   DW_AT_decl_column : 18
    <991c8>   DW_AT_type        : <0x9936b>
    <991cc>   DW_AT_data_member_location: 168
 <2><991cd>: Abbrev Number: 3 (DW_TAG_member)
    <991ce>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <991d2>   DW_AT_decl_file   : 7
    <991d3>   DW_AT_decl_line   : 171
    <991d4>   DW_AT_decl_column : 12
    <991d5>   DW_AT_type        : <0x98fd2>
    <991d9>   DW_AT_data_member_location: 176
 <2><991da>: Abbrev Number: 3 (DW_TAG_member)
    <991db>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <991df>   DW_AT_decl_file   : 7
    <991e0>   DW_AT_decl_line   : 172
    <991e1>   DW_AT_decl_column : 9
    <991e2>   DW_AT_type        : <0x98dc7>
    <991e6>   DW_AT_data_member_location: 184
 <2><991e7>: Abbrev Number: 3 (DW_TAG_member)
    <991e8>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <991ec>   DW_AT_decl_file   : 7
    <991ed>   DW_AT_decl_line   : 172
    <991ee>   DW_AT_decl_column : 21
    <991ef>   DW_AT_type        : <0x98dc7>
    <991f3>   DW_AT_data_member_location: 188
 <2><991f4>: Abbrev Number: 3 (DW_TAG_member)
    <991f5>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <991f9>   DW_AT_decl_file   : 7
    <991fa>   DW_AT_decl_line   : 173
    <991fb>   DW_AT_decl_column : 11
    <991fc>   DW_AT_type        : <0x99375>
    <99200>   DW_AT_data_member_location: 192
 <2><99201>: Abbrev Number: 3 (DW_TAG_member)
    <99202>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <99206>   DW_AT_decl_file   : 7
    <99207>   DW_AT_decl_line   : 174
    <99208>   DW_AT_decl_column : 15
    <99209>   DW_AT_type        : <0x98dce>
    <9920d>   DW_AT_data_member_location: 200
 <2><9920e>: Abbrev Number: 3 (DW_TAG_member)
    <9920f>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <99213>   DW_AT_decl_file   : 7
    <99214>   DW_AT_decl_line   : 175
    <99215>   DW_AT_decl_column : 6
    <99216>   DW_AT_type        : <0x98dc7>
    <9921a>   DW_AT_data_member_location: 204
 <2><9921b>: Abbrev Number: 0
 <1><9921c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9921d>   DW_AT_byte_size   : 8
    <9921d>   DW_AT_type        : <0x98dab>
 <1><99221>: Abbrev Number: 22 (DW_TAG_structure_type)
    <99222>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <99226>   DW_AT_byte_size   : 112
    <99227>   DW_AT_decl_file   : 7
    <99228>   DW_AT_decl_line   : 178
    <99229>   DW_AT_decl_column : 16
    <9922a>   DW_AT_sibling     : <0x992ed>
 <2><9922e>: Abbrev Number: 3 (DW_TAG_member)
    <9922f>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <99233>   DW_AT_decl_file   : 7
    <99234>   DW_AT_decl_line   : 188
    <99235>   DW_AT_decl_column : 8
    <99236>   DW_AT_type        : <0x98e35>
    <9923a>   DW_AT_data_member_location: 0
 <2><9923b>: Abbrev Number: 3 (DW_TAG_member)
    <9923c>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <99240>   DW_AT_decl_file   : 7
    <99241>   DW_AT_decl_line   : 208
    <99242>   DW_AT_decl_column : 8
    <99243>   DW_AT_type        : <0x993ae>
    <99247>   DW_AT_data_member_location: 8
 <2><99248>: Abbrev Number: 3 (DW_TAG_member)
    <99249>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <9924d>   DW_AT_decl_file   : 7
    <9924e>   DW_AT_decl_line   : 222
    <9924f>   DW_AT_decl_column : 9
    <99250>   DW_AT_type        : <0x98ea4>
    <99254>   DW_AT_data_member_location: 16
 <2><99255>: Abbrev Number: 3 (DW_TAG_member)
    <99256>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <9925a>   DW_AT_decl_file   : 7
    <9925b>   DW_AT_decl_line   : 231
    <9925c>   DW_AT_decl_column : 9
    <9925d>   DW_AT_type        : <0x98ea4>
    <99261>   DW_AT_data_member_location: 24
 <2><99262>: Abbrev Number: 3 (DW_TAG_member)
    <99263>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <99267>   DW_AT_decl_file   : 7
    <99268>   DW_AT_decl_line   : 239
    <99269>   DW_AT_decl_column : 9
    <9926a>   DW_AT_type        : <0x98ea4>
    <9926e>   DW_AT_data_member_location: 32
 <2><9926f>: Abbrev Number: 3 (DW_TAG_member)
    <99270>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <99274>   DW_AT_decl_file   : 7
    <99275>   DW_AT_decl_line   : 248
    <99276>   DW_AT_decl_column : 9
    <99277>   DW_AT_type        : <0x993cd>
    <9927b>   DW_AT_data_member_location: 40
 <2><9927c>: Abbrev Number: 1 (DW_TAG_member)
    <9927d>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <99281>   DW_AT_decl_file   : 7
    <99282>   DW_AT_decl_line   : 258
    <99284>   DW_AT_decl_column : 9
    <99285>   DW_AT_type        : <0x98ea4>
    <99289>   DW_AT_data_member_location: 48
 <2><9928a>: Abbrev Number: 1 (DW_TAG_member)
    <9928b>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <9928f>   DW_AT_decl_file   : 7
    <99290>   DW_AT_decl_line   : 274
    <99292>   DW_AT_decl_column : 8
    <99293>   DW_AT_type        : <0x98faa>
    <99297>   DW_AT_data_member_location: 56
 <2><99298>: Abbrev Number: 1 (DW_TAG_member)
    <99299>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <9929d>   DW_AT_decl_file   : 7
    <9929e>   DW_AT_decl_line   : 285
    <992a0>   DW_AT_decl_column : 9
    <992a1>   DW_AT_type        : <0x993cd>
    <992a5>   DW_AT_data_member_location: 64
 <2><992a6>: Abbrev Number: 1 (DW_TAG_member)
    <992a7>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <992ab>   DW_AT_decl_file   : 7
    <992ac>   DW_AT_decl_line   : 293
    <992ae>   DW_AT_decl_column : 9
    <992af>   DW_AT_type        : <0x993dd>
    <992b3>   DW_AT_data_member_location: 72
 <2><992b4>: Abbrev Number: 1 (DW_TAG_member)
    <992b5>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <992b9>   DW_AT_decl_file   : 7
    <992ba>   DW_AT_decl_line   : 301
    <992bc>   DW_AT_decl_column : 8
    <992bd>   DW_AT_type        : <0x98f8c>
    <992c1>   DW_AT_data_member_location: 80
 <2><992c2>: Abbrev Number: 1 (DW_TAG_member)
    <992c3>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <992c7>   DW_AT_decl_file   : 7
    <992c8>   DW_AT_decl_line   : 314
    <992ca>   DW_AT_decl_column : 9
    <992cb>   DW_AT_type        : <0x993f6>
    <992cf>   DW_AT_data_member_location: 88
 <2><992d0>: Abbrev Number: 1 (DW_TAG_member)
    <992d1>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <992d5>   DW_AT_decl_file   : 7
    <992d6>   DW_AT_decl_line   : 321
    <992d8>   DW_AT_decl_column : 9
    <992d9>   DW_AT_type        : <0x98ea4>
    <992dd>   DW_AT_data_member_location: 96
 <2><992de>: Abbrev Number: 1 (DW_TAG_member)
    <992df>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <992e3>   DW_AT_decl_file   : 7
    <992e4>   DW_AT_decl_line   : 328
    <992e6>   DW_AT_decl_column : 9
    <992e7>   DW_AT_type        : <0x98ea4>
    <992eb>   DW_AT_data_member_location: 104
 <2><992ec>: Abbrev Number: 0
 <1><992ed>: Abbrev Number: 24 (DW_TAG_const_type)
    <992ee>   DW_AT_type        : <0x99221>
 <1><992f2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <992f3>   DW_AT_byte_size   : 8
    <992f3>   DW_AT_type        : <0x992ed>
 <1><992f7>: Abbrev Number: 32 (DW_TAG_structure_type)
    <992f8>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <992fc>   DW_AT_byte_size   : 16
    <992fd>   DW_AT_decl_file   : 7
    <992fe>   DW_AT_decl_line   : 331
    <99300>   DW_AT_decl_column : 16
    <99301>   DW_AT_sibling     : <0x99322>
 <2><99305>: Abbrev Number: 1 (DW_TAG_member)
    <99306>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <9930a>   DW_AT_decl_file   : 7
    <9930b>   DW_AT_decl_line   : 333
    <9930d>   DW_AT_decl_column : 12
    <9930e>   DW_AT_type        : <0x98dd3>
    <99312>   DW_AT_data_member_location: 0
 <2><99313>: Abbrev Number: 1 (DW_TAG_member)
    <99314>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <99318>   DW_AT_decl_file   : 7
    <99319>   DW_AT_decl_line   : 334
    <9931b>   DW_AT_decl_column : 23
    <9931c>   DW_AT_type        : <0x99408>
    <99320>   DW_AT_data_member_location: 8
 <2><99321>: Abbrev Number: 0
 <1><99322>: Abbrev Number: 24 (DW_TAG_const_type)
    <99323>   DW_AT_type        : <0x992f7>
 <1><99327>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99328>   DW_AT_byte_size   : 8
    <99328>   DW_AT_type        : <0x99322>
 <1><9932c>: Abbrev Number: 32 (DW_TAG_structure_type)
    <9932d>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <99331>   DW_AT_byte_size   : 16
    <99332>   DW_AT_decl_file   : 7
    <99333>   DW_AT_decl_line   : 337
    <99335>   DW_AT_decl_column : 16
    <99336>   DW_AT_sibling     : <0x99361>
 <2><9933a>: Abbrev Number: 10 (DW_TAG_member)
    <9933b>   DW_AT_name        : w
    <9933d>   DW_AT_decl_file   : 7
    <9933e>   DW_AT_decl_line   : 339
    <99340>   DW_AT_decl_column : 15
    <99341>   DW_AT_type        : <0x98dd3>
    <99345>   DW_AT_data_member_location: 0
 <2><99346>: Abbrev Number: 10 (DW_TAG_member)
    <99347>   DW_AT_name        : h
    <99349>   DW_AT_decl_file   : 7
    <9934a>   DW_AT_decl_line   : 340
    <9934c>   DW_AT_decl_column : 15
    <9934d>   DW_AT_type        : <0x98dd3>
    <99351>   DW_AT_data_member_location: 4
 <2><99352>: Abbrev Number: 1 (DW_TAG_member)
    <99353>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <99357>   DW_AT_decl_file   : 7
    <99358>   DW_AT_decl_line   : 341
    <9935a>   DW_AT_decl_column : 23
    <9935b>   DW_AT_type        : <0x99408>
    <9935f>   DW_AT_data_member_location: 8
 <2><99360>: Abbrev Number: 0
 <1><99361>: Abbrev Number: 24 (DW_TAG_const_type)
    <99362>   DW_AT_type        : <0x9932c>
 <1><99366>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99367>   DW_AT_byte_size   : 8
    <99367>   DW_AT_type        : <0x99361>
 <1><9936b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9936c>   DW_AT_byte_size   : 8
    <9936c>   DW_AT_type        : <0x99370>
 <1><99370>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99371>   DW_AT_byte_size   : 8
    <99371>   DW_AT_type        : <0x9904d>
 <1><99375>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99376>   DW_AT_byte_size   : 8
    <99376>   DW_AT_type        : <0x98eb8>
 <1><9937a>: Abbrev Number: 9 (DW_TAG_typedef)
    <9937b>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9937f>   DW_AT_decl_file   : 7
    <99380>   DW_AT_decl_line   : 176
    <99381>   DW_AT_decl_column : 3
    <99382>   DW_AT_type        : <0x99059>
 <1><99386>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <99387>   DW_AT_prototyped  : 1
    <99387>   DW_AT_type        : <0x98dc7>
    <9938b>   DW_AT_sibling     : <0x993ae>
 <2><9938f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99390>   DW_AT_type        : <0x98e35>
 <2><99394>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99395>   DW_AT_type        : <0x98dc7>
 <2><99399>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9939a>   DW_AT_type        : <0x98dc7>
 <2><9939e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9939f>   DW_AT_type        : <0x98dc7>
 <2><993a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993a4>   DW_AT_type        : <0x98dc7>
 <2><993a8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993a9>   DW_AT_type        : <0x98dc7>
 <2><993ad>: Abbrev Number: 0
 <1><993ae>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <993af>   DW_AT_byte_size   : 8
    <993af>   DW_AT_type        : <0x99386>
 <1><993b3>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <993b4>   DW_AT_prototyped  : 1
    <993b4>   DW_AT_sibling     : <0x993cd>
 <2><993b8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993b9>   DW_AT_type        : <0x98dc7>
 <2><993bd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993be>   DW_AT_type        : <0x98dc7>
 <2><993c2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993c3>   DW_AT_type        : <0x98dc7>
 <2><993c7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993c8>   DW_AT_type        : <0x98dc7>
 <2><993cc>: Abbrev Number: 0
 <1><993cd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <993ce>   DW_AT_byte_size   : 8
    <993ce>   DW_AT_type        : <0x993b3>
 <1><993d2>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <993d3>   DW_AT_prototyped  : 1
    <993d3>   DW_AT_sibling     : <0x993dd>
 <2><993d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993d8>   DW_AT_type        : <0x98e35>
 <2><993dc>: Abbrev Number: 0
 <1><993dd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <993de>   DW_AT_byte_size   : 8
    <993de>   DW_AT_type        : <0x993d2>
 <1><993e2>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <993e3>   DW_AT_prototyped  : 1
    <993e3>   DW_AT_type        : <0x98fa5>
    <993e7>   DW_AT_sibling     : <0x993f6>
 <2><993eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993ec>   DW_AT_type        : <0x98dc7>
 <2><993f0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <993f1>   DW_AT_type        : <0x98fa5>
 <2><993f5>: Abbrev Number: 0
 <1><993f6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <993f7>   DW_AT_byte_size   : 8
    <993f7>   DW_AT_type        : <0x993e2>
 <1><993fb>: Abbrev Number: 6 (DW_TAG_typedef)
    <993fc>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <99400>   DW_AT_decl_file   : 7
    <99401>   DW_AT_decl_line   : 329
    <99403>   DW_AT_decl_column : 3
    <99404>   DW_AT_type        : <0x99221>
 <1><99408>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99409>   DW_AT_byte_size   : 8
    <99409>   DW_AT_type        : <0x98d9f>
 <1><9940d>: Abbrev Number: 42 (DW_TAG_variable)
    <9940e>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <99412>   DW_AT_decl_file   : 7
    <99412>   DW_AT_decl_line   : 364
    <99414>   DW_AT_decl_column : 15
    <99415>   DW_AT_type        : <0x99419>
    <99419>   DW_AT_external    : 1
    <99419>   DW_AT_declaration : 1
 <1><99419>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9941a>   DW_AT_byte_size   : 8
    <9941a>   DW_AT_type        : <0x9937a>
 <1><9941e>: Abbrev Number: 42 (DW_TAG_variable)
    <9941f>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <99423>   DW_AT_decl_file   : 7
    <99423>   DW_AT_decl_line   : 369
    <99425>   DW_AT_decl_column : 16
    <99426>   DW_AT_type        : <0x98ffa>
    <9942a>   DW_AT_external    : 1
    <9942a>   DW_AT_declaration : 1
 <1><9942a>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <9942b>   DW_AT_encoding    : 7	(void)
    <9942b>   DW_AT_byte_size   : 4
    <9942b>   DW_AT_type        : <0x98dab>
    <9942f>   DW_AT_decl_file   : 7
    <9942f>   DW_AT_decl_line   : 376
    <99431>   DW_AT_decl_column : 6
    <99431>   DW_AT_sibling     : <0x9944e>
 <2><99435>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99436>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <9943a>   DW_AT_const_value : 0
 <2><9943b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9943c>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <99440>   DW_AT_const_value : 1
 <2><99441>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99442>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <99446>   DW_AT_const_value : 2
 <2><99447>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99448>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <9944c>   DW_AT_const_value : 3
 <2><9944d>: Abbrev Number: 0
 <1><9944e>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <9944f>   DW_AT_encoding    : 7	(void)
    <9944f>   DW_AT_byte_size   : 4
    <9944f>   DW_AT_type        : <0x98dab>
    <99453>   DW_AT_decl_file   : 7
    <99453>   DW_AT_decl_line   : 384
    <99455>   DW_AT_decl_column : 6
    <99455>   DW_AT_sibling     : <0x99478>
 <2><99459>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9945a>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <9945e>   DW_AT_const_value : 0
 <2><9945f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99460>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <99464>   DW_AT_const_value : 1
 <2><99465>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99466>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <9946a>   DW_AT_const_value : 2
 <2><9946b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <9946c>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <99470>   DW_AT_const_value : 3
 <2><99471>: Abbrev Number: 20 (DW_TAG_enumerator)
    <99472>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <99476>   DW_AT_const_value : 4
 <2><99477>: Abbrev Number: 0
 <1><99478>: Abbrev Number: 44 (DW_TAG_typedef)
    <99479>   DW_AT_name        : XID
    <9947d>   DW_AT_decl_file   : 8
    <9947e>   DW_AT_decl_line   : 66
    <9947f>   DW_AT_decl_column : 23
    <99480>   DW_AT_type        : <0x98db2>
 <1><99484>: Abbrev Number: 9 (DW_TAG_typedef)
    <99485>   DW_AT_name        : (indirect string, offset: 0x18a40): Atom
    <99489>   DW_AT_decl_file   : 8
    <9948a>   DW_AT_decl_line   : 74
    <9948b>   DW_AT_decl_column : 23
    <9948c>   DW_AT_type        : <0x98db2>
 <1><99490>: Abbrev Number: 9 (DW_TAG_typedef)
    <99491>   DW_AT_name        : (indirect string, offset: 0x18bdd): VisualID
    <99495>   DW_AT_decl_file   : 8
    <99496>   DW_AT_decl_line   : 76
    <99497>   DW_AT_decl_column : 23
    <99498>   DW_AT_type        : <0x98db2>
 <1><9949c>: Abbrev Number: 9 (DW_TAG_typedef)
    <9949d>   DW_AT_name        : (indirect string, offset: 0x1964d): Time
    <994a1>   DW_AT_decl_file   : 8
    <994a2>   DW_AT_decl_line   : 77
    <994a3>   DW_AT_decl_column : 23
    <994a4>   DW_AT_type        : <0x98db2>
 <1><994a8>: Abbrev Number: 9 (DW_TAG_typedef)
    <994a9>   DW_AT_name        : (indirect string, offset: 0x18e45): Window
    <994ad>   DW_AT_decl_file   : 8
    <994ae>   DW_AT_decl_line   : 96
    <994af>   DW_AT_decl_column : 13
    <994b0>   DW_AT_type        : <0x99478>
 <1><994b4>: Abbrev Number: 9 (DW_TAG_typedef)
    <994b5>   DW_AT_name        : (indirect string, offset: 0x1a300): Drawable
    <994b9>   DW_AT_decl_file   : 8
    <994ba>   DW_AT_decl_line   : 97
    <994bb>   DW_AT_decl_column : 13
    <994bc>   DW_AT_type        : <0x99478>
 <1><994c0>: Abbrev Number: 9 (DW_TAG_typedef)
    <994c1>   DW_AT_name        : (indirect string, offset: 0x19278): Font
    <994c5>   DW_AT_decl_file   : 8
    <994c6>   DW_AT_decl_line   : 100
    <994c7>   DW_AT_decl_column : 13
    <994c8>   DW_AT_type        : <0x99478>
 <1><994cc>: Abbrev Number: 9 (DW_TAG_typedef)
    <994cd>   DW_AT_name        : (indirect string, offset: 0x19478): Pixmap
    <994d1>   DW_AT_decl_file   : 8
    <994d2>   DW_AT_decl_line   : 102
    <994d3>   DW_AT_decl_column : 13
    <994d4>   DW_AT_type        : <0x99478>
 <1><994d8>: Abbrev Number: 9 (DW_TAG_typedef)
    <994d9>   DW_AT_name        : (indirect string, offset: 0x18f01): Colormap
    <994dd>   DW_AT_decl_file   : 8
    <994de>   DW_AT_decl_line   : 104
    <994df>   DW_AT_decl_column : 13
    <994e0>   DW_AT_type        : <0x99478>
 <1><994e4>: Abbrev Number: 16 (DW_TAG_base_type)
    <994e5>   DW_AT_byte_size   : 16
    <994e6>   DW_AT_encoding    : 4	(float)
    <994e7>   DW_AT_name        : (indirect string, offset: 0x184ef): long double
 <1><994eb>: Abbrev Number: 9 (DW_TAG_typedef)
    <994ec>   DW_AT_name        : (indirect string, offset: 0x19ba7): XPointer
    <994f0>   DW_AT_decl_file   : 9
    <994f1>   DW_AT_decl_line   : 80
    <994f2>   DW_AT_decl_column : 15
    <994f3>   DW_AT_type        : <0x98e35>
 <1><994f7>: Abbrev Number: 22 (DW_TAG_structure_type)
    <994f8>   DW_AT_name        : (indirect string, offset: 0x19a2b): _XExtData
    <994fc>   DW_AT_byte_size   : 32
    <994fd>   DW_AT_decl_file   : 9
    <994fe>   DW_AT_decl_line   : 148
    <994ff>   DW_AT_decl_column : 16
    <99500>   DW_AT_sibling     : <0x99539>
 <2><99504>: Abbrev Number: 3 (DW_TAG_member)
    <99505>   DW_AT_name        : (indirect string, offset: 0x18b66): number
    <99509>   DW_AT_decl_file   : 9
    <9950a>   DW_AT_decl_line   : 149
    <9950b>   DW_AT_decl_column : 6
    <9950c>   DW_AT_type        : <0x98dc7>
    <99510>   DW_AT_data_member_location: 0
 <2><99511>: Abbrev Number: 3 (DW_TAG_member)
    <99512>   DW_AT_name        : (indirect string, offset: 0x190a5): next
    <99516>   DW_AT_decl_file   : 9
    <99517>   DW_AT_decl_line   : 150
    <99518>   DW_AT_decl_column : 20
    <99519>   DW_AT_type        : <0x99539>
    <9951d>   DW_AT_data_member_location: 8
 <2><9951e>: Abbrev Number: 3 (DW_TAG_member)
    <9951f>   DW_AT_name        : (indirect string, offset: 0x19b3f): free_private
    <99523>   DW_AT_decl_file   : 9
    <99524>   DW_AT_decl_line   : 151
    <99525>   DW_AT_decl_column : 8
    <99526>   DW_AT_type        : <0x9954d>
    <9952a>   DW_AT_data_member_location: 16
 <2><9952b>: Abbrev Number: 3 (DW_TAG_member)
    <9952c>   DW_AT_name        : (indirect string, offset: 0x1873c): private_data
    <99530>   DW_AT_decl_file   : 9
    <99531>   DW_AT_decl_line   : 154
    <99532>   DW_AT_decl_column : 11
    <99533>   DW_AT_type        : <0x994eb>
    <99537>   DW_AT_data_member_location: 24
 <2><99538>: Abbrev Number: 0
 <1><99539>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9953a>   DW_AT_byte_size   : 8
    <9953a>   DW_AT_type        : <0x994f7>
 <1><9953e>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <9953f>   DW_AT_prototyped  : 1
    <9953f>   DW_AT_type        : <0x98dc7>
    <99543>   DW_AT_sibling     : <0x9954d>
 <2><99547>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99548>   DW_AT_type        : <0x99539>
 <2><9954c>: Abbrev Number: 0
 <1><9954d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9954e>   DW_AT_byte_size   : 8
    <9954e>   DW_AT_type        : <0x9953e>
 <1><99552>: Abbrev Number: 9 (DW_TAG_typedef)
    <99553>   DW_AT_name        : (indirect string, offset: 0x19a2c): XExtData
    <99557>   DW_AT_decl_file   : 9
    <99558>   DW_AT_decl_line   : 155
    <99559>   DW_AT_decl_column : 3
    <9955a>   DW_AT_type        : <0x994f7>
 <1><9955e>: Abbrev Number: 27 (DW_TAG_structure_type)
    <9955f>   DW_AT_byte_size   : 128
    <99560>   DW_AT_decl_file   : 9
    <99561>   DW_AT_decl_line   : 181
    <99562>   DW_AT_decl_column : 9
    <99563>   DW_AT_sibling     : <0x99693>
 <2><99567>: Abbrev Number: 3 (DW_TAG_member)
    <99568>   DW_AT_name        : (indirect string, offset: 0x192b7): function
    <9956c>   DW_AT_decl_file   : 9
    <9956d>   DW_AT_decl_line   : 182
    <9956e>   DW_AT_decl_column : 6
    <9956f>   DW_AT_type        : <0x98dc7>
    <99573>   DW_AT_data_member_location: 0
 <2><99574>: Abbrev Number: 3 (DW_TAG_member)
    <99575>   DW_AT_name        : (indirect string, offset: 0x18b3c): plane_mask
    <99579>   DW_AT_decl_file   : 9
    <9957a>   DW_AT_decl_line   : 183
    <9957b>   DW_AT_decl_column : 16
    <9957c>   DW_AT_type        : <0x98db2>
    <99580>   DW_AT_data_member_location: 8
 <2><99581>: Abbrev Number: 3 (DW_TAG_member)
    <99582>   DW_AT_name        : (indirect string, offset: 0x19c5b): foreground
    <99586>   DW_AT_decl_file   : 9
    <99587>   DW_AT_decl_line   : 184
    <99588>   DW_AT_decl_column : 16
    <99589>   DW_AT_type        : <0x98db2>
    <9958d>   DW_AT_data_member_location: 16
 <2><9958e>: Abbrev Number: 3 (DW_TAG_member)
    <9958f>   DW_AT_name        : (indirect string, offset: 0x19665): background
    <99593>   DW_AT_decl_file   : 9
    <99594>   DW_AT_decl_line   : 185
    <99595>   DW_AT_decl_column : 16
    <99596>   DW_AT_type        : <0x98db2>
    <9959a>   DW_AT_data_member_location: 24
 <2><9959b>: Abbrev Number: 3 (DW_TAG_member)
    <9959c>   DW_AT_name        : (indirect string, offset: 0x1a895): line_width
    <995a0>   DW_AT_decl_file   : 9
    <995a1>   DW_AT_decl_line   : 186
    <995a2>   DW_AT_decl_column : 6
    <995a3>   DW_AT_type        : <0x98dc7>
    <995a7>   DW_AT_data_member_location: 32
 <2><995a8>: Abbrev Number: 3 (DW_TAG_member)
    <995a9>   DW_AT_name        : (indirect string, offset: 0x18eb2): line_style
    <995ad>   DW_AT_decl_file   : 9
    <995ae>   DW_AT_decl_line   : 187
    <995af>   DW_AT_decl_column : 6
    <995b0>   DW_AT_type        : <0x98dc7>
    <995b4>   DW_AT_data_member_location: 36
 <2><995b5>: Abbrev Number: 3 (DW_TAG_member)
    <995b6>   DW_AT_name        : (indirect string, offset: 0x19a8b): cap_style
    <995ba>   DW_AT_decl_file   : 9
    <995bb>   DW_AT_decl_line   : 188
    <995bc>   DW_AT_decl_column : 6
    <995bd>   DW_AT_type        : <0x98dc7>
    <995c1>   DW_AT_data_member_location: 40
 <2><995c2>: Abbrev Number: 3 (DW_TAG_member)
    <995c3>   DW_AT_name        : (indirect string, offset: 0x1991c): join_style
    <995c7>   DW_AT_decl_file   : 9
    <995c8>   DW_AT_decl_line   : 190
    <995c9>   DW_AT_decl_column : 6
    <995ca>   DW_AT_type        : <0x98dc7>
    <995ce>   DW_AT_data_member_location: 44
 <2><995cf>: Abbrev Number: 3 (DW_TAG_member)
    <995d0>   DW_AT_name        : (indirect string, offset: 0x18a14): fill_style
    <995d4>   DW_AT_decl_file   : 9
    <995d5>   DW_AT_decl_line   : 191
    <995d6>   DW_AT_decl_column : 6
    <995d7>   DW_AT_type        : <0x98dc7>
    <995db>   DW_AT_data_member_location: 48
 <2><995dc>: Abbrev Number: 3 (DW_TAG_member)
    <995dd>   DW_AT_name        : (indirect string, offset: 0x193ad): fill_rule
    <995e1>   DW_AT_decl_file   : 9
    <995e2>   DW_AT_decl_line   : 193
    <995e3>   DW_AT_decl_column : 6
    <995e4>   DW_AT_type        : <0x98dc7>
    <995e8>   DW_AT_data_member_location: 52
 <2><995e9>: Abbrev Number: 3 (DW_TAG_member)
    <995ea>   DW_AT_name        : (indirect string, offset: 0x185c8): arc_mode
    <995ee>   DW_AT_decl_file   : 9
    <995ef>   DW_AT_decl_line   : 194
    <995f0>   DW_AT_decl_column : 6
    <995f1>   DW_AT_type        : <0x98dc7>
    <995f5>   DW_AT_data_member_location: 56
 <2><995f6>: Abbrev Number: 3 (DW_TAG_member)
    <995f7>   DW_AT_name        : (indirect string, offset: 0x192a4): tile
    <995fb>   DW_AT_decl_file   : 9
    <995fc>   DW_AT_decl_line   : 195
    <995fd>   DW_AT_decl_column : 9
    <995fe>   DW_AT_type        : <0x994cc>
    <99602>   DW_AT_data_member_location: 64
 <2><99603>: Abbrev Number: 3 (DW_TAG_member)
    <99604>   DW_AT_name        : (indirect string, offset: 0x1944d): stipple
    <99608>   DW_AT_decl_file   : 9
    <99609>   DW_AT_decl_line   : 196
    <9960a>   DW_AT_decl_column : 9
    <9960b>   DW_AT_type        : <0x994cc>
    <9960f>   DW_AT_data_member_location: 72
 <2><99610>: Abbrev Number: 3 (DW_TAG_member)
    <99611>   DW_AT_name        : (indirect string, offset: 0x19a5d): ts_x_origin
    <99615>   DW_AT_decl_file   : 9
    <99616>   DW_AT_decl_line   : 197
    <99617>   DW_AT_decl_column : 6
    <99618>   DW_AT_type        : <0x98dc7>
    <9961c>   DW_AT_data_member_location: 80
 <2><9961d>: Abbrev Number: 3 (DW_TAG_member)
    <9961e>   DW_AT_name        : (indirect string, offset: 0x18d6d): ts_y_origin
    <99622>   DW_AT_decl_file   : 9
    <99623>   DW_AT_decl_line   : 198
    <99624>   DW_AT_decl_column : 6
    <99625>   DW_AT_type        : <0x98dc7>
    <99629>   DW_AT_data_member_location: 84
 <2><9962a>: Abbrev Number: 3 (DW_TAG_member)
    <9962b>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <9962f>   DW_AT_decl_file   : 9
    <99630>   DW_AT_decl_line   : 199
    <99631>   DW_AT_decl_column : 14
    <99632>   DW_AT_type        : <0x994c0>
    <99636>   DW_AT_data_member_location: 88
 <2><99637>: Abbrev Number: 3 (DW_TAG_member)
    <99638>   DW_AT_name        : (indirect string, offset: 0x188f6): subwindow_mode
    <9963c>   DW_AT_decl_file   : 9
    <9963d>   DW_AT_decl_line   : 200
    <9963e>   DW_AT_decl_column : 6
    <9963f>   DW_AT_type        : <0x98dc7>
    <99643>   DW_AT_data_member_location: 96
 <2><99644>: Abbrev Number: 3 (DW_TAG_member)
    <99645>   DW_AT_name        : (indirect string, offset: 0x18d25): graphics_exposures
    <99649>   DW_AT_decl_file   : 9
    <9964a>   DW_AT_decl_line   : 201
    <9964b>   DW_AT_decl_column : 7
    <9964c>   DW_AT_type        : <0x98dc7>
    <99650>   DW_AT_data_member_location: 100
 <2><99651>: Abbrev Number: 3 (DW_TAG_member)
    <99652>   DW_AT_name        : (indirect string, offset: 0x1916a): clip_x_origin
    <99656>   DW_AT_decl_file   : 9
    <99657>   DW_AT_decl_line   : 202
    <99658>   DW_AT_decl_column : 6
    <99659>   DW_AT_type        : <0x98dc7>
    <9965d>   DW_AT_data_member_location: 104
 <2><9965e>: Abbrev Number: 3 (DW_TAG_member)
    <9965f>   DW_AT_name        : (indirect string, offset: 0x19208): clip_y_origin
    <99663>   DW_AT_decl_file   : 9
    <99664>   DW_AT_decl_line   : 203
    <99665>   DW_AT_decl_column : 6
    <99666>   DW_AT_type        : <0x98dc7>
    <9966a>   DW_AT_data_member_location: 108
 <2><9966b>: Abbrev Number: 3 (DW_TAG_member)
    <9966c>   DW_AT_name        : (indirect string, offset: 0x189c6): clip_mask
    <99670>   DW_AT_decl_file   : 9
    <99671>   DW_AT_decl_line   : 204
    <99672>   DW_AT_decl_column : 9
    <99673>   DW_AT_type        : <0x994cc>
    <99677>   DW_AT_data_member_location: 112
 <2><99678>: Abbrev Number: 3 (DW_TAG_member)
    <99679>   DW_AT_name        : (indirect string, offset: 0x19c6e): dash_offset
    <9967d>   DW_AT_decl_file   : 9
    <9967e>   DW_AT_decl_line   : 205
    <9967f>   DW_AT_decl_column : 6
    <99680>   DW_AT_type        : <0x98dc7>
    <99684>   DW_AT_data_member_location: 120
 <2><99685>: Abbrev Number: 3 (DW_TAG_member)
    <99686>   DW_AT_name        : (indirect string, offset: 0x1997a): dashes
    <9968a>   DW_AT_decl_file   : 9
    <9968b>   DW_AT_decl_line   : 206
    <9968c>   DW_AT_decl_column : 7
    <9968d>   DW_AT_type        : <0x98e3a>
    <99691>   DW_AT_data_member_location: 124
 <2><99692>: Abbrev Number: 0
 <1><99693>: Abbrev Number: 9 (DW_TAG_typedef)
    <99694>   DW_AT_name        : (indirect string, offset: 0x19a95): XGCValues
    <99698>   DW_AT_decl_file   : 9
    <99699>   DW_AT_decl_line   : 207
    <9969a>   DW_AT_decl_column : 3
    <9969b>   DW_AT_type        : <0x9955e>
 <1><9969f>: Abbrev Number: 44 (DW_TAG_typedef)
    <996a0>   DW_AT_name        : GC
    <996a3>   DW_AT_decl_file   : 9
    <996a4>   DW_AT_decl_line   : 222
    <996a5>   DW_AT_decl_column : 2
    <996a6>   DW_AT_type        : <0x996aa>
 <1><996aa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <996ab>   DW_AT_byte_size   : 8
    <996ab>   DW_AT_type        : <0x996af>
 <1><996af>: Abbrev Number: 30 (DW_TAG_structure_type)
    <996b0>   DW_AT_name        : (indirect string, offset: 0x196cf): _XGC
    <996b4>   DW_AT_declaration : 1
 <1><996b4>: Abbrev Number: 27 (DW_TAG_structure_type)
    <996b5>   DW_AT_byte_size   : 56
    <996b6>   DW_AT_decl_file   : 9
    <996b7>   DW_AT_decl_line   : 227
    <996b8>   DW_AT_decl_column : 9
    <996b9>   DW_AT_sibling     : <0x99726>
 <2><996bd>: Abbrev Number: 3 (DW_TAG_member)
    <996be>   DW_AT_name        : (indirect string, offset: 0x18c93): ext_data
    <996c2>   DW_AT_decl_file   : 9
    <996c3>   DW_AT_decl_line   : 228
    <996c4>   DW_AT_decl_column : 12
    <996c5>   DW_AT_type        : <0x99726>
    <996c9>   DW_AT_data_member_location: 0
 <2><996ca>: Abbrev Number: 3 (DW_TAG_member)
    <996cb>   DW_AT_name        : (indirect string, offset: 0x18bd4): visualid
    <996cf>   DW_AT_decl_file   : 9
    <996d0>   DW_AT_decl_line   : 229
    <996d1>   DW_AT_decl_column : 11
    <996d2>   DW_AT_type        : <0x99490>
    <996d6>   DW_AT_data_member_location: 8
 <2><996d7>: Abbrev Number: 3 (DW_TAG_member)
    <996d8>   DW_AT_name        : (indirect string, offset: 0x18ab7): class
    <996dc>   DW_AT_decl_file   : 9
    <996dd>   DW_AT_decl_line   : 233
    <996de>   DW_AT_decl_column : 6
    <996df>   DW_AT_type        : <0x98dc7>
    <996e3>   DW_AT_data_member_location: 16
 <2><996e4>: Abbrev Number: 3 (DW_TAG_member)
    <996e5>   DW_AT_name        : (indirect string, offset: 0x18d79): red_mask
    <996e9>   DW_AT_decl_file   : 9
    <996ea>   DW_AT_decl_line   : 235
    <996eb>   DW_AT_decl_column : 16
    <996ec>   DW_AT_type        : <0x98db2>
    <996f0>   DW_AT_data_member_location: 24
 <2><996f1>: Abbrev Number: 3 (DW_TAG_member)
    <996f2>   DW_AT_name        : (indirect string, offset: 0x185d1): green_mask
    <996f6>   DW_AT_decl_file   : 9
    <996f7>   DW_AT_decl_line   : 235
    <996f8>   DW_AT_decl_column : 26
    <996f9>   DW_AT_type        : <0x98db2>
    <996fd>   DW_AT_data_member_location: 32
 <2><996fe>: Abbrev Number: 3 (DW_TAG_member)
    <996ff>   DW_AT_name        : (indirect string, offset: 0x19307): blue_mask
    <99703>   DW_AT_decl_file   : 9
    <99704>   DW_AT_decl_line   : 235
    <99705>   DW_AT_decl_column : 38
    <99706>   DW_AT_type        : <0x98db2>
    <9970a>   DW_AT_data_member_location: 40
 <2><9970b>: Abbrev Number: 3 (DW_TAG_member)
    <9970c>   DW_AT_name        : (indirect string, offset: 0x1994e): bits_per_rgb
    <99710>   DW_AT_decl_file   : 9
    <99711>   DW_AT_decl_line   : 236
    <99712>   DW_AT_decl_column : 6
    <99713>   DW_AT_type        : <0x98dc7>
    <99717>   DW_AT_data_member_location: 48
 <2><99718>: Abbrev Number: 3 (DW_TAG_member)
    <99719>   DW_AT_name        : (indirect string, offset: 0x1883a): map_entries
    <9971d>   DW_AT_decl_file   : 9
    <9971e>   DW_AT_decl_line   : 237
    <9971f>   DW_AT_decl_column : 6
    <99720>   DW_AT_type        : <0x98dc7>
    <99724>   DW_AT_data_member_location: 52
 <2><99725>: Abbrev Number: 0
 <1><99726>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99727>   DW_AT_byte_size   : 8
    <99727>   DW_AT_type        : <0x99552>
 <1><9972b>: Abbrev Number: 9 (DW_TAG_typedef)
    <9972c>   DW_AT_name        : (indirect string, offset: 0x1a37a): Visual
    <99730>   DW_AT_decl_file   : 9
    <99731>   DW_AT_decl_line   : 238
    <99732>   DW_AT_decl_column : 3
    <99733>   DW_AT_type        : <0x996b4>
 <1><99737>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99738>   DW_AT_byte_size   : 8
    <99738>   DW_AT_type        : <0x9972b>
 <1><9973c>: Abbrev Number: 30 (DW_TAG_structure_type)
    <9973d>   DW_AT_name        : (indirect string, offset: 0x18d82): _XDisplay
    <99741>   DW_AT_declaration : 1
 <1><99741>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99742>   DW_AT_byte_size   : 8
    <99742>   DW_AT_type        : <0x9973c>
 <1><99746>: Abbrev Number: 32 (DW_TAG_structure_type)
    <99747>   DW_AT_name        : (indirect string, offset: 0x17f25): funcs
    <9974b>   DW_AT_byte_size   : 48
    <9974c>   DW_AT_decl_file   : 9
    <9974d>   DW_AT_decl_line   : 376
    <9974f>   DW_AT_decl_column : 12
    <99750>   DW_AT_sibling     : <0x997a9>
 <2><99754>: Abbrev Number: 1 (DW_TAG_member)
    <99755>   DW_AT_name        : (indirect string, offset: 0x1a598): create_image
    <99759>   DW_AT_decl_file   : 9
    <9975a>   DW_AT_decl_line   : 377
    <9975c>   DW_AT_decl_column : 20
    <9975d>   DW_AT_type        : <0x998e5>
    <99761>   DW_AT_data_member_location: 0
 <2><99762>: Abbrev Number: 1 (DW_TAG_member)
    <99763>   DW_AT_name        : (indirect string, offset: 0x1a575): destroy_image
    <99767>   DW_AT_decl_file   : 9
    <99768>   DW_AT_decl_line   : 388
    <9976a>   DW_AT_decl_column : 8
    <9976b>   DW_AT_type        : <0x998f9>
    <9976f>   DW_AT_data_member_location: 8
 <2><99770>: Abbrev Number: 1 (DW_TAG_member)
    <99771>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <99775>   DW_AT_decl_file   : 9
    <99776>   DW_AT_decl_line   : 389
    <99778>   DW_AT_decl_column : 18
    <99779>   DW_AT_type        : <0x99917>
    <9977d>   DW_AT_data_member_location: 16
 <2><9977e>: Abbrev Number: 1 (DW_TAG_member)
    <9977f>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <99783>   DW_AT_decl_file   : 9
    <99784>   DW_AT_decl_line   : 390
    <99786>   DW_AT_decl_column : 8
    <99787>   DW_AT_type        : <0x9993a>
    <9978b>   DW_AT_data_member_location: 24
 <2><9978c>: Abbrev Number: 1 (DW_TAG_member)
    <9978d>   DW_AT_name        : (indirect string, offset: 0x1a6e8): sub_image
    <99791>   DW_AT_decl_file   : 9
    <99792>   DW_AT_decl_line   : 391
    <99794>   DW_AT_decl_column : 20
    <99795>   DW_AT_type        : <0x99962>
    <99799>   DW_AT_data_member_location: 32
 <2><9979a>: Abbrev Number: 1 (DW_TAG_member)
    <9979b>   DW_AT_name        : (indirect string, offset: 0x1a4d4): add_pixel
    <9979f>   DW_AT_decl_file   : 9
    <997a0>   DW_AT_decl_line   : 392
    <997a2>   DW_AT_decl_column : 8
    <997a3>   DW_AT_type        : <0x9997b>
    <997a7>   DW_AT_data_member_location: 40
 <2><997a8>: Abbrev Number: 0
 <1><997a9>: Abbrev Number: 32 (DW_TAG_structure_type)
    <997aa>   DW_AT_name        : (indirect string, offset: 0x1a6c8): _XImage
    <997ae>   DW_AT_byte_size   : 136
    <997af>   DW_AT_decl_file   : 9
    <997b0>   DW_AT_decl_line   : 360
    <997b2>   DW_AT_decl_column : 16
    <997b3>   DW_AT_sibling     : <0x998a4>
 <2><997b7>: Abbrev Number: 1 (DW_TAG_member)
    <997b8>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <997bc>   DW_AT_decl_file   : 9
    <997bd>   DW_AT_decl_line   : 361
    <997bf>   DW_AT_decl_column : 9
    <997c0>   DW_AT_type        : <0x98dc7>
    <997c4>   DW_AT_data_member_location: 0
 <2><997c5>: Abbrev Number: 1 (DW_TAG_member)
    <997c6>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <997ca>   DW_AT_decl_file   : 9
    <997cb>   DW_AT_decl_line   : 361
    <997cd>   DW_AT_decl_column : 16
    <997ce>   DW_AT_type        : <0x98dc7>
    <997d2>   DW_AT_data_member_location: 4
 <2><997d3>: Abbrev Number: 1 (DW_TAG_member)
    <997d4>   DW_AT_name        : (indirect string, offset: 0x1a227): xoffset
    <997d8>   DW_AT_decl_file   : 9
    <997d9>   DW_AT_decl_line   : 362
    <997db>   DW_AT_decl_column : 9
    <997dc>   DW_AT_type        : <0x98dc7>
    <997e0>   DW_AT_data_member_location: 8
 <2><997e1>: Abbrev Number: 1 (DW_TAG_member)
    <997e2>   DW_AT_name        : (indirect string, offset: 0x191a9): format
    <997e6>   DW_AT_decl_file   : 9
    <997e7>   DW_AT_decl_line   : 363
    <997e9>   DW_AT_decl_column : 9
    <997ea>   DW_AT_type        : <0x98dc7>
    <997ee>   DW_AT_data_member_location: 12
 <2><997ef>: Abbrev Number: 1 (DW_TAG_member)
    <997f0>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <997f4>   DW_AT_decl_file   : 9
    <997f5>   DW_AT_decl_line   : 364
    <997f7>   DW_AT_decl_column : 11
    <997f8>   DW_AT_type        : <0x98e35>
    <997fc>   DW_AT_data_member_location: 16
 <2><997fd>: Abbrev Number: 1 (DW_TAG_member)
    <997fe>   DW_AT_name        : (indirect string, offset: 0x18c25): byte_order
    <99802>   DW_AT_decl_file   : 9
    <99803>   DW_AT_decl_line   : 365
    <99805>   DW_AT_decl_column : 9
    <99806>   DW_AT_type        : <0x98dc7>
    <9980a>   DW_AT_data_member_location: 24
 <2><9980b>: Abbrev Number: 1 (DW_TAG_member)
    <9980c>   DW_AT_name        : (indirect string, offset: 0x195aa): bitmap_unit
    <99810>   DW_AT_decl_file   : 9
    <99811>   DW_AT_decl_line   : 366
    <99813>   DW_AT_decl_column : 9
    <99814>   DW_AT_type        : <0x98dc7>
    <99818>   DW_AT_data_member_location: 28
 <2><99819>: Abbrev Number: 1 (DW_TAG_member)
    <9981a>   DW_AT_name        : (indirect string, offset: 0x18a45): bitmap_bit_order
    <9981e>   DW_AT_decl_file   : 9
    <9981f>   DW_AT_decl_line   : 367
    <99821>   DW_AT_decl_column : 9
    <99822>   DW_AT_type        : <0x98dc7>
    <99826>   DW_AT_data_member_location: 32
 <2><99827>: Abbrev Number: 1 (DW_TAG_member)
    <99828>   DW_AT_name        : (indirect string, offset: 0x1934d): bitmap_pad
    <9982c>   DW_AT_decl_file   : 9
    <9982d>   DW_AT_decl_line   : 368
    <9982f>   DW_AT_decl_column : 9
    <99830>   DW_AT_type        : <0x98dc7>
    <99834>   DW_AT_data_member_location: 36
 <2><99835>: Abbrev Number: 1 (DW_TAG_member)
    <99836>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <9983a>   DW_AT_decl_file   : 9
    <9983b>   DW_AT_decl_line   : 369
    <9983d>   DW_AT_decl_column : 9
    <9983e>   DW_AT_type        : <0x98dc7>
    <99842>   DW_AT_data_member_location: 40
 <2><99843>: Abbrev Number: 1 (DW_TAG_member)
    <99844>   DW_AT_name        : (indirect string, offset: 0x1a4de): bytes_per_line
    <99848>   DW_AT_decl_file   : 9
    <99849>   DW_AT_decl_line   : 370
    <9984b>   DW_AT_decl_column : 9
    <9984c>   DW_AT_type        : <0x98dc7>
    <99850>   DW_AT_data_member_location: 44
 <2><99851>: Abbrev Number: 1 (DW_TAG_member)
    <99852>   DW_AT_name        : (indirect string, offset: 0x186ed): bits_per_pixel
    <99856>   DW_AT_decl_file   : 9
    <99857>   DW_AT_decl_line   : 371
    <99859>   DW_AT_decl_column : 9
    <9985a>   DW_AT_type        : <0x98dc7>
    <9985e>   DW_AT_data_member_location: 48
 <2><9985f>: Abbrev Number: 1 (DW_TAG_member)
    <99860>   DW_AT_name        : (indirect string, offset: 0x18d79): red_mask
    <99864>   DW_AT_decl_file   : 9
    <99865>   DW_AT_decl_line   : 372
    <99867>   DW_AT_decl_column : 19
    <99868>   DW_AT_type        : <0x98db2>
    <9986c>   DW_AT_data_member_location: 56
 <2><9986d>: Abbrev Number: 1 (DW_TAG_member)
    <9986e>   DW_AT_name        : (indirect string, offset: 0x185d1): green_mask
    <99872>   DW_AT_decl_file   : 9
    <99873>   DW_AT_decl_line   : 373
    <99875>   DW_AT_decl_column : 19
    <99876>   DW_AT_type        : <0x98db2>
    <9987a>   DW_AT_data_member_location: 64
 <2><9987b>: Abbrev Number: 1 (DW_TAG_member)
    <9987c>   DW_AT_name        : (indirect string, offset: 0x19307): blue_mask
    <99880>   DW_AT_decl_file   : 9
    <99881>   DW_AT_decl_line   : 374
    <99883>   DW_AT_decl_column : 19
    <99884>   DW_AT_type        : <0x98db2>
    <99888>   DW_AT_data_member_location: 72
 <2><99889>: Abbrev Number: 1 (DW_TAG_member)
    <9988a>   DW_AT_name        : (indirect string, offset: 0x1a548): obdata
    <9988e>   DW_AT_decl_file   : 9
    <9988f>   DW_AT_decl_line   : 375
    <99891>   DW_AT_decl_column : 14
    <99892>   DW_AT_type        : <0x994eb>
    <99896>   DW_AT_data_member_location: 80
 <2><99897>: Abbrev Number: 10 (DW_TAG_member)
    <99898>   DW_AT_name        : f
    <9989a>   DW_AT_decl_file   : 9
    <9989b>   DW_AT_decl_line   : 393
    <9989d>   DW_AT_decl_column : 4
    <9989e>   DW_AT_type        : <0x99746>
    <998a2>   DW_AT_data_member_location: 88
 <2><998a3>: Abbrev Number: 0
 <1><998a4>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <998a5>   DW_AT_prototyped  : 1
    <998a5>   DW_AT_type        : <0x998e0>
    <998a9>   DW_AT_sibling     : <0x998e0>
 <2><998ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998ae>   DW_AT_type        : <0x99741>
 <2><998b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998b3>   DW_AT_type        : <0x99737>
 <2><998b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998b8>   DW_AT_type        : <0x98dab>
 <2><998bc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998bd>   DW_AT_type        : <0x98dc7>
 <2><998c1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998c2>   DW_AT_type        : <0x98dc7>
 <2><998c6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998c7>   DW_AT_type        : <0x98e35>
 <2><998cb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998cc>   DW_AT_type        : <0x98dab>
 <2><998d0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998d1>   DW_AT_type        : <0x98dab>
 <2><998d5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998d6>   DW_AT_type        : <0x98dc7>
 <2><998da>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998db>   DW_AT_type        : <0x98dc7>
 <2><998df>: Abbrev Number: 0
 <1><998e0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <998e1>   DW_AT_byte_size   : 8
    <998e1>   DW_AT_type        : <0x997a9>
 <1><998e5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <998e6>   DW_AT_byte_size   : 8
    <998e6>   DW_AT_type        : <0x998a4>
 <1><998ea>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <998eb>   DW_AT_prototyped  : 1
    <998eb>   DW_AT_type        : <0x98dc7>
    <998ef>   DW_AT_sibling     : <0x998f9>
 <2><998f3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <998f4>   DW_AT_type        : <0x998e0>
 <2><998f8>: Abbrev Number: 0
 <1><998f9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <998fa>   DW_AT_byte_size   : 8
    <998fa>   DW_AT_type        : <0x998ea>
 <1><998fe>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <998ff>   DW_AT_prototyped  : 1
    <998ff>   DW_AT_type        : <0x98db2>
    <99903>   DW_AT_sibling     : <0x99917>
 <2><99907>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99908>   DW_AT_type        : <0x998e0>
 <2><9990c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9990d>   DW_AT_type        : <0x98dc7>
 <2><99911>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99912>   DW_AT_type        : <0x98dc7>
 <2><99916>: Abbrev Number: 0
 <1><99917>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99918>   DW_AT_byte_size   : 8
    <99918>   DW_AT_type        : <0x998fe>
 <1><9991c>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <9991d>   DW_AT_prototyped  : 1
    <9991d>   DW_AT_type        : <0x98dc7>
    <99921>   DW_AT_sibling     : <0x9993a>
 <2><99925>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99926>   DW_AT_type        : <0x998e0>
 <2><9992a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9992b>   DW_AT_type        : <0x98dc7>
 <2><9992f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99930>   DW_AT_type        : <0x98dc7>
 <2><99934>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99935>   DW_AT_type        : <0x98db2>
 <2><99939>: Abbrev Number: 0
 <1><9993a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9993b>   DW_AT_byte_size   : 8
    <9993b>   DW_AT_type        : <0x9991c>
 <1><9993f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <99940>   DW_AT_prototyped  : 1
    <99940>   DW_AT_type        : <0x998e0>
    <99944>   DW_AT_sibling     : <0x99962>
 <2><99948>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99949>   DW_AT_type        : <0x998e0>
 <2><9994d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9994e>   DW_AT_type        : <0x98dc7>
 <2><99952>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99953>   DW_AT_type        : <0x98dc7>
 <2><99957>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99958>   DW_AT_type        : <0x98dab>
 <2><9995c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9995d>   DW_AT_type        : <0x98dab>
 <2><99961>: Abbrev Number: 0
 <1><99962>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99963>   DW_AT_byte_size   : 8
    <99963>   DW_AT_type        : <0x9993f>
 <1><99967>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <99968>   DW_AT_prototyped  : 1
    <99968>   DW_AT_type        : <0x98dc7>
    <9996c>   DW_AT_sibling     : <0x9997b>
 <2><99970>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99971>   DW_AT_type        : <0x998e0>
 <2><99975>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99976>   DW_AT_type        : <0x98dd8>
 <2><9997a>: Abbrev Number: 0
 <1><9997b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9997c>   DW_AT_byte_size   : 8
    <9997c>   DW_AT_type        : <0x99967>
 <1><99980>: Abbrev Number: 6 (DW_TAG_typedef)
    <99981>   DW_AT_name        : (indirect string, offset: 0x1a6c9): XImage
    <99985>   DW_AT_decl_file   : 9
    <99986>   DW_AT_decl_line   : 394
    <99988>   DW_AT_decl_column : 3
    <99989>   DW_AT_type        : <0x997a9>
 <1><9998d>: Abbrev Number: 6 (DW_TAG_typedef)
    <9998e>   DW_AT_name        : (indirect string, offset: 0x18d84): Display
    <99992>   DW_AT_decl_file   : 9
    <99993>   DW_AT_decl_line   : 487
    <99995>   DW_AT_decl_column : 26
    <99996>   DW_AT_type        : <0x9973c>
 <1><9999a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <9999b>   DW_AT_byte_size   : 96
    <9999c>   DW_AT_decl_file   : 9
    <9999c>   DW_AT_decl_line   : 557
    <9999e>   DW_AT_decl_column : 9
    <9999e>   DW_AT_sibling     : <0x99a71>
 <2><999a2>: Abbrev Number: 1 (DW_TAG_member)
    <999a3>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <999a7>   DW_AT_decl_file   : 9
    <999a8>   DW_AT_decl_line   : 558
    <999aa>   DW_AT_decl_column : 6
    <999ab>   DW_AT_type        : <0x98dc7>
    <999af>   DW_AT_data_member_location: 0
 <2><999b0>: Abbrev Number: 1 (DW_TAG_member)
    <999b1>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <999b5>   DW_AT_decl_file   : 9
    <999b6>   DW_AT_decl_line   : 559
    <999b8>   DW_AT_decl_column : 16
    <999b9>   DW_AT_type        : <0x98db2>
    <999bd>   DW_AT_data_member_location: 8
 <2><999be>: Abbrev Number: 1 (DW_TAG_member)
    <999bf>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <999c3>   DW_AT_decl_file   : 9
    <999c4>   DW_AT_decl_line   : 560
    <999c6>   DW_AT_decl_column : 7
    <999c7>   DW_AT_type        : <0x98dc7>
    <999cb>   DW_AT_data_member_location: 16
 <2><999cc>: Abbrev Number: 1 (DW_TAG_member)
    <999cd>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <999d1>   DW_AT_decl_file   : 9
    <999d2>   DW_AT_decl_line   : 561
    <999d4>   DW_AT_decl_column : 11
    <999d5>   DW_AT_type        : <0x99a71>
    <999d9>   DW_AT_data_member_location: 24
 <2><999da>: Abbrev Number: 1 (DW_TAG_member)
    <999db>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <999df>   DW_AT_decl_file   : 9
    <999e0>   DW_AT_decl_line   : 562
    <999e2>   DW_AT_decl_column : 9
    <999e3>   DW_AT_type        : <0x994a8>
    <999e7>   DW_AT_data_member_location: 32
 <2><999e8>: Abbrev Number: 1 (DW_TAG_member)
    <999e9>   DW_AT_name        : (indirect string, offset: 0x195ef): root
    <999ed>   DW_AT_decl_file   : 9
    <999ee>   DW_AT_decl_line   : 563
    <999f0>   DW_AT_decl_column : 9
    <999f1>   DW_AT_type        : <0x994a8>
    <999f5>   DW_AT_data_member_location: 40
 <2><999f6>: Abbrev Number: 1 (DW_TAG_member)
    <999f7>   DW_AT_name        : (indirect string, offset: 0x1857c): subwindow
    <999fb>   DW_AT_decl_file   : 9
    <999fc>   DW_AT_decl_line   : 564
    <999fe>   DW_AT_decl_column : 9
    <999ff>   DW_AT_type        : <0x994a8>
    <99a03>   DW_AT_data_member_location: 48
 <2><99a04>: Abbrev Number: 1 (DW_TAG_member)
    <99a05>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <99a09>   DW_AT_decl_file   : 9
    <99a0a>   DW_AT_decl_line   : 565
    <99a0c>   DW_AT_decl_column : 7
    <99a0d>   DW_AT_type        : <0x9949c>
    <99a11>   DW_AT_data_member_location: 56
 <2><99a12>: Abbrev Number: 10 (DW_TAG_member)
    <99a13>   DW_AT_name        : x
    <99a15>   DW_AT_decl_file   : 9
    <99a16>   DW_AT_decl_line   : 566
    <99a18>   DW_AT_decl_column : 6
    <99a19>   DW_AT_type        : <0x98dc7>
    <99a1d>   DW_AT_data_member_location: 64
 <2><99a1e>: Abbrev Number: 10 (DW_TAG_member)
    <99a1f>   DW_AT_name        : y
    <99a21>   DW_AT_decl_file   : 9
    <99a22>   DW_AT_decl_line   : 566
    <99a24>   DW_AT_decl_column : 9
    <99a25>   DW_AT_type        : <0x98dc7>
    <99a29>   DW_AT_data_member_location: 68
 <2><99a2a>: Abbrev Number: 1 (DW_TAG_member)
    <99a2b>   DW_AT_name        : (indirect string, offset: 0x195ed): x_root
    <99a2f>   DW_AT_decl_file   : 9
    <99a30>   DW_AT_decl_line   : 567
    <99a32>   DW_AT_decl_column : 6
    <99a33>   DW_AT_type        : <0x98dc7>
    <99a37>   DW_AT_data_member_location: 72
 <2><99a38>: Abbrev Number: 1 (DW_TAG_member)
    <99a39>   DW_AT_name        : (indirect string, offset: 0x195a3): y_root
    <99a3d>   DW_AT_decl_file   : 9
    <99a3e>   DW_AT_decl_line   : 567
    <99a40>   DW_AT_decl_column : 14
    <99a41>   DW_AT_type        : <0x98dc7>
    <99a45>   DW_AT_data_member_location: 76
 <2><99a46>: Abbrev Number: 1 (DW_TAG_member)
    <99a47>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <99a4b>   DW_AT_decl_file   : 9
    <99a4c>   DW_AT_decl_line   : 568
    <99a4e>   DW_AT_decl_column : 15
    <99a4f>   DW_AT_type        : <0x98dab>
    <99a53>   DW_AT_data_member_location: 80
 <2><99a54>: Abbrev Number: 1 (DW_TAG_member)
    <99a55>   DW_AT_name        : (indirect string, offset: 0x191f9): keycode
    <99a59>   DW_AT_decl_file   : 9
    <99a5a>   DW_AT_decl_line   : 569
    <99a5c>   DW_AT_decl_column : 15
    <99a5d>   DW_AT_type        : <0x98dab>
    <99a61>   DW_AT_data_member_location: 84
 <2><99a62>: Abbrev Number: 1 (DW_TAG_member)
    <99a63>   DW_AT_name        : (indirect string, offset: 0x192f6): same_screen
    <99a67>   DW_AT_decl_file   : 9
    <99a68>   DW_AT_decl_line   : 570
    <99a6a>   DW_AT_decl_column : 7
    <99a6b>   DW_AT_type        : <0x98dc7>
    <99a6f>   DW_AT_data_member_location: 88
 <2><99a70>: Abbrev Number: 0
 <1><99a71>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <99a72>   DW_AT_byte_size   : 8
    <99a72>   DW_AT_type        : <0x9998d>
 <1><99a76>: Abbrev Number: 6 (DW_TAG_typedef)
    <99a77>   DW_AT_name        : (indirect string, offset: 0x190ec): XKeyEvent
    <99a7b>   DW_AT_decl_file   : 9
    <99a7c>   DW_AT_decl_line   : 571
    <99a7e>   DW_AT_decl_column : 3
    <99a7f>   DW_AT_type        : <0x9999a>
 <1><99a83>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99a84>   DW_AT_byte_size   : 96
    <99a85>   DW_AT_decl_file   : 9
    <99a85>   DW_AT_decl_line   : 575
    <99a87>   DW_AT_decl_column : 9
    <99a87>   DW_AT_sibling     : <0x99b5a>
 <2><99a8b>: Abbrev Number: 1 (DW_TAG_member)
    <99a8c>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99a90>   DW_AT_decl_file   : 9
    <99a91>   DW_AT_decl_line   : 576
    <99a93>   DW_AT_decl_column : 6
    <99a94>   DW_AT_type        : <0x98dc7>
    <99a98>   DW_AT_data_member_location: 0
 <2><99a99>: Abbrev Number: 1 (DW_TAG_member)
    <99a9a>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99a9e>   DW_AT_decl_file   : 9
    <99a9f>   DW_AT_decl_line   : 577
    <99aa1>   DW_AT_decl_column : 16
    <99aa2>   DW_AT_type        : <0x98db2>
    <99aa6>   DW_AT_data_member_location: 8
 <2><99aa7>: Abbrev Number: 1 (DW_TAG_member)
    <99aa8>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99aac>   DW_AT_decl_file   : 9
    <99aad>   DW_AT_decl_line   : 578
    <99aaf>   DW_AT_decl_column : 7
    <99ab0>   DW_AT_type        : <0x98dc7>
    <99ab4>   DW_AT_data_member_location: 16
 <2><99ab5>: Abbrev Number: 1 (DW_TAG_member)
    <99ab6>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99aba>   DW_AT_decl_file   : 9
    <99abb>   DW_AT_decl_line   : 579
    <99abd>   DW_AT_decl_column : 11
    <99abe>   DW_AT_type        : <0x99a71>
    <99ac2>   DW_AT_data_member_location: 24
 <2><99ac3>: Abbrev Number: 1 (DW_TAG_member)
    <99ac4>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99ac8>   DW_AT_decl_file   : 9
    <99ac9>   DW_AT_decl_line   : 580
    <99acb>   DW_AT_decl_column : 9
    <99acc>   DW_AT_type        : <0x994a8>
    <99ad0>   DW_AT_data_member_location: 32
 <2><99ad1>: Abbrev Number: 1 (DW_TAG_member)
    <99ad2>   DW_AT_name        : (indirect string, offset: 0x195ef): root
    <99ad6>   DW_AT_decl_file   : 9
    <99ad7>   DW_AT_decl_line   : 581
    <99ad9>   DW_AT_decl_column : 9
    <99ada>   DW_AT_type        : <0x994a8>
    <99ade>   DW_AT_data_member_location: 40
 <2><99adf>: Abbrev Number: 1 (DW_TAG_member)
    <99ae0>   DW_AT_name        : (indirect string, offset: 0x1857c): subwindow
    <99ae4>   DW_AT_decl_file   : 9
    <99ae5>   DW_AT_decl_line   : 582
    <99ae7>   DW_AT_decl_column : 9
    <99ae8>   DW_AT_type        : <0x994a8>
    <99aec>   DW_AT_data_member_location: 48
 <2><99aed>: Abbrev Number: 1 (DW_TAG_member)
    <99aee>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <99af2>   DW_AT_decl_file   : 9
    <99af3>   DW_AT_decl_line   : 583
    <99af5>   DW_AT_decl_column : 7
    <99af6>   DW_AT_type        : <0x9949c>
    <99afa>   DW_AT_data_member_location: 56
 <2><99afb>: Abbrev Number: 10 (DW_TAG_member)
    <99afc>   DW_AT_name        : x
    <99afe>   DW_AT_decl_file   : 9
    <99aff>   DW_AT_decl_line   : 584
    <99b01>   DW_AT_decl_column : 6
    <99b02>   DW_AT_type        : <0x98dc7>
    <99b06>   DW_AT_data_member_location: 64
 <2><99b07>: Abbrev Number: 10 (DW_TAG_member)
    <99b08>   DW_AT_name        : y
    <99b0a>   DW_AT_decl_file   : 9
    <99b0b>   DW_AT_decl_line   : 584
    <99b0d>   DW_AT_decl_column : 9
    <99b0e>   DW_AT_type        : <0x98dc7>
    <99b12>   DW_AT_data_member_location: 68
 <2><99b13>: Abbrev Number: 1 (DW_TAG_member)
    <99b14>   DW_AT_name        : (indirect string, offset: 0x195ed): x_root
    <99b18>   DW_AT_decl_file   : 9
    <99b19>   DW_AT_decl_line   : 585
    <99b1b>   DW_AT_decl_column : 6
    <99b1c>   DW_AT_type        : <0x98dc7>
    <99b20>   DW_AT_data_member_location: 72
 <2><99b21>: Abbrev Number: 1 (DW_TAG_member)
    <99b22>   DW_AT_name        : (indirect string, offset: 0x195a3): y_root
    <99b26>   DW_AT_decl_file   : 9
    <99b27>   DW_AT_decl_line   : 585
    <99b29>   DW_AT_decl_column : 14
    <99b2a>   DW_AT_type        : <0x98dc7>
    <99b2e>   DW_AT_data_member_location: 76
 <2><99b2f>: Abbrev Number: 1 (DW_TAG_member)
    <99b30>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <99b34>   DW_AT_decl_file   : 9
    <99b35>   DW_AT_decl_line   : 586
    <99b37>   DW_AT_decl_column : 15
    <99b38>   DW_AT_type        : <0x98dab>
    <99b3c>   DW_AT_data_member_location: 80
 <2><99b3d>: Abbrev Number: 1 (DW_TAG_member)
    <99b3e>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <99b42>   DW_AT_decl_file   : 9
    <99b43>   DW_AT_decl_line   : 587
    <99b45>   DW_AT_decl_column : 15
    <99b46>   DW_AT_type        : <0x98dab>
    <99b4a>   DW_AT_data_member_location: 84
 <2><99b4b>: Abbrev Number: 1 (DW_TAG_member)
    <99b4c>   DW_AT_name        : (indirect string, offset: 0x192f6): same_screen
    <99b50>   DW_AT_decl_file   : 9
    <99b51>   DW_AT_decl_line   : 588
    <99b53>   DW_AT_decl_column : 7
    <99b54>   DW_AT_type        : <0x98dc7>
    <99b58>   DW_AT_data_member_location: 88
 <2><99b59>: Abbrev Number: 0
 <1><99b5a>: Abbrev Number: 6 (DW_TAG_typedef)
    <99b5b>   DW_AT_name        : (indirect string, offset: 0x199fa): XButtonEvent
    <99b5f>   DW_AT_decl_file   : 9
    <99b60>   DW_AT_decl_line   : 589
    <99b62>   DW_AT_decl_column : 3
    <99b63>   DW_AT_type        : <0x99a83>
 <1><99b67>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99b68>   DW_AT_byte_size   : 96
    <99b69>   DW_AT_decl_file   : 9
    <99b69>   DW_AT_decl_line   : 593
    <99b6b>   DW_AT_decl_column : 9
    <99b6b>   DW_AT_sibling     : <0x99c3e>
 <2><99b6f>: Abbrev Number: 1 (DW_TAG_member)
    <99b70>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99b74>   DW_AT_decl_file   : 9
    <99b75>   DW_AT_decl_line   : 594
    <99b77>   DW_AT_decl_column : 6
    <99b78>   DW_AT_type        : <0x98dc7>
    <99b7c>   DW_AT_data_member_location: 0
 <2><99b7d>: Abbrev Number: 1 (DW_TAG_member)
    <99b7e>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99b82>   DW_AT_decl_file   : 9
    <99b83>   DW_AT_decl_line   : 595
    <99b85>   DW_AT_decl_column : 16
    <99b86>   DW_AT_type        : <0x98db2>
    <99b8a>   DW_AT_data_member_location: 8
 <2><99b8b>: Abbrev Number: 1 (DW_TAG_member)
    <99b8c>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99b90>   DW_AT_decl_file   : 9
    <99b91>   DW_AT_decl_line   : 596
    <99b93>   DW_AT_decl_column : 7
    <99b94>   DW_AT_type        : <0x98dc7>
    <99b98>   DW_AT_data_member_location: 16
 <2><99b99>: Abbrev Number: 1 (DW_TAG_member)
    <99b9a>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99b9e>   DW_AT_decl_file   : 9
    <99b9f>   DW_AT_decl_line   : 597
    <99ba1>   DW_AT_decl_column : 11
    <99ba2>   DW_AT_type        : <0x99a71>
    <99ba6>   DW_AT_data_member_location: 24
 <2><99ba7>: Abbrev Number: 1 (DW_TAG_member)
    <99ba8>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99bac>   DW_AT_decl_file   : 9
    <99bad>   DW_AT_decl_line   : 598
    <99baf>   DW_AT_decl_column : 9
    <99bb0>   DW_AT_type        : <0x994a8>
    <99bb4>   DW_AT_data_member_location: 32
 <2><99bb5>: Abbrev Number: 1 (DW_TAG_member)
    <99bb6>   DW_AT_name        : (indirect string, offset: 0x195ef): root
    <99bba>   DW_AT_decl_file   : 9
    <99bbb>   DW_AT_decl_line   : 599
    <99bbd>   DW_AT_decl_column : 9
    <99bbe>   DW_AT_type        : <0x994a8>
    <99bc2>   DW_AT_data_member_location: 40
 <2><99bc3>: Abbrev Number: 1 (DW_TAG_member)
    <99bc4>   DW_AT_name        : (indirect string, offset: 0x1857c): subwindow
    <99bc8>   DW_AT_decl_file   : 9
    <99bc9>   DW_AT_decl_line   : 600
    <99bcb>   DW_AT_decl_column : 9
    <99bcc>   DW_AT_type        : <0x994a8>
    <99bd0>   DW_AT_data_member_location: 48
 <2><99bd1>: Abbrev Number: 1 (DW_TAG_member)
    <99bd2>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <99bd6>   DW_AT_decl_file   : 9
    <99bd7>   DW_AT_decl_line   : 601
    <99bd9>   DW_AT_decl_column : 7
    <99bda>   DW_AT_type        : <0x9949c>
    <99bde>   DW_AT_data_member_location: 56
 <2><99bdf>: Abbrev Number: 10 (DW_TAG_member)
    <99be0>   DW_AT_name        : x
    <99be2>   DW_AT_decl_file   : 9
    <99be3>   DW_AT_decl_line   : 602
    <99be5>   DW_AT_decl_column : 6
    <99be6>   DW_AT_type        : <0x98dc7>
    <99bea>   DW_AT_data_member_location: 64
 <2><99beb>: Abbrev Number: 10 (DW_TAG_member)
    <99bec>   DW_AT_name        : y
    <99bee>   DW_AT_decl_file   : 9
    <99bef>   DW_AT_decl_line   : 602
    <99bf1>   DW_AT_decl_column : 9
    <99bf2>   DW_AT_type        : <0x98dc7>
    <99bf6>   DW_AT_data_member_location: 68
 <2><99bf7>: Abbrev Number: 1 (DW_TAG_member)
    <99bf8>   DW_AT_name        : (indirect string, offset: 0x195ed): x_root
    <99bfc>   DW_AT_decl_file   : 9
    <99bfd>   DW_AT_decl_line   : 603
    <99bff>   DW_AT_decl_column : 6
    <99c00>   DW_AT_type        : <0x98dc7>
    <99c04>   DW_AT_data_member_location: 72
 <2><99c05>: Abbrev Number: 1 (DW_TAG_member)
    <99c06>   DW_AT_name        : (indirect string, offset: 0x195a3): y_root
    <99c0a>   DW_AT_decl_file   : 9
    <99c0b>   DW_AT_decl_line   : 603
    <99c0d>   DW_AT_decl_column : 14
    <99c0e>   DW_AT_type        : <0x98dc7>
    <99c12>   DW_AT_data_member_location: 76
 <2><99c13>: Abbrev Number: 1 (DW_TAG_member)
    <99c14>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <99c18>   DW_AT_decl_file   : 9
    <99c19>   DW_AT_decl_line   : 604
    <99c1b>   DW_AT_decl_column : 15
    <99c1c>   DW_AT_type        : <0x98dab>
    <99c20>   DW_AT_data_member_location: 80
 <2><99c21>: Abbrev Number: 1 (DW_TAG_member)
    <99c22>   DW_AT_name        : (indirect string, offset: 0x18fcb): is_hint
    <99c26>   DW_AT_decl_file   : 9
    <99c27>   DW_AT_decl_line   : 605
    <99c29>   DW_AT_decl_column : 7
    <99c2a>   DW_AT_type        : <0x98e3a>
    <99c2e>   DW_AT_data_member_location: 84
 <2><99c2f>: Abbrev Number: 1 (DW_TAG_member)
    <99c30>   DW_AT_name        : (indirect string, offset: 0x192f6): same_screen
    <99c34>   DW_AT_decl_file   : 9
    <99c35>   DW_AT_decl_line   : 606
    <99c37>   DW_AT_decl_column : 7
    <99c38>   DW_AT_type        : <0x98dc7>
    <99c3c>   DW_AT_data_member_location: 88
 <2><99c3d>: Abbrev Number: 0
 <1><99c3e>: Abbrev Number: 6 (DW_TAG_typedef)
    <99c3f>   DW_AT_name        : (indirect string, offset: 0x18bfa): XMotionEvent
    <99c43>   DW_AT_decl_file   : 9
    <99c44>   DW_AT_decl_line   : 607
    <99c46>   DW_AT_decl_column : 3
    <99c47>   DW_AT_type        : <0x99b67>
 <1><99c4b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99c4c>   DW_AT_byte_size   : 104
    <99c4d>   DW_AT_decl_file   : 9
    <99c4d>   DW_AT_decl_line   : 610
    <99c4f>   DW_AT_decl_column : 9
    <99c4f>   DW_AT_sibling     : <0x99d3e>
 <2><99c53>: Abbrev Number: 1 (DW_TAG_member)
    <99c54>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99c58>   DW_AT_decl_file   : 9
    <99c59>   DW_AT_decl_line   : 611
    <99c5b>   DW_AT_decl_column : 6
    <99c5c>   DW_AT_type        : <0x98dc7>
    <99c60>   DW_AT_data_member_location: 0
 <2><99c61>: Abbrev Number: 1 (DW_TAG_member)
    <99c62>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99c66>   DW_AT_decl_file   : 9
    <99c67>   DW_AT_decl_line   : 612
    <99c69>   DW_AT_decl_column : 16
    <99c6a>   DW_AT_type        : <0x98db2>
    <99c6e>   DW_AT_data_member_location: 8
 <2><99c6f>: Abbrev Number: 1 (DW_TAG_member)
    <99c70>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99c74>   DW_AT_decl_file   : 9
    <99c75>   DW_AT_decl_line   : 613
    <99c77>   DW_AT_decl_column : 7
    <99c78>   DW_AT_type        : <0x98dc7>
    <99c7c>   DW_AT_data_member_location: 16
 <2><99c7d>: Abbrev Number: 1 (DW_TAG_member)
    <99c7e>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99c82>   DW_AT_decl_file   : 9
    <99c83>   DW_AT_decl_line   : 614
    <99c85>   DW_AT_decl_column : 11
    <99c86>   DW_AT_type        : <0x99a71>
    <99c8a>   DW_AT_data_member_location: 24
 <2><99c8b>: Abbrev Number: 1 (DW_TAG_member)
    <99c8c>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99c90>   DW_AT_decl_file   : 9
    <99c91>   DW_AT_decl_line   : 615
    <99c93>   DW_AT_decl_column : 9
    <99c94>   DW_AT_type        : <0x994a8>
    <99c98>   DW_AT_data_member_location: 32
 <2><99c99>: Abbrev Number: 1 (DW_TAG_member)
    <99c9a>   DW_AT_name        : (indirect string, offset: 0x195ef): root
    <99c9e>   DW_AT_decl_file   : 9
    <99c9f>   DW_AT_decl_line   : 616
    <99ca1>   DW_AT_decl_column : 9
    <99ca2>   DW_AT_type        : <0x994a8>
    <99ca6>   DW_AT_data_member_location: 40
 <2><99ca7>: Abbrev Number: 1 (DW_TAG_member)
    <99ca8>   DW_AT_name        : (indirect string, offset: 0x1857c): subwindow
    <99cac>   DW_AT_decl_file   : 9
    <99cad>   DW_AT_decl_line   : 617
    <99caf>   DW_AT_decl_column : 9
    <99cb0>   DW_AT_type        : <0x994a8>
    <99cb4>   DW_AT_data_member_location: 48
 <2><99cb5>: Abbrev Number: 1 (DW_TAG_member)
    <99cb6>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <99cba>   DW_AT_decl_file   : 9
    <99cbb>   DW_AT_decl_line   : 618
    <99cbd>   DW_AT_decl_column : 7
    <99cbe>   DW_AT_type        : <0x9949c>
    <99cc2>   DW_AT_data_member_location: 56
 <2><99cc3>: Abbrev Number: 10 (DW_TAG_member)
    <99cc4>   DW_AT_name        : x
    <99cc6>   DW_AT_decl_file   : 9
    <99cc7>   DW_AT_decl_line   : 619
    <99cc9>   DW_AT_decl_column : 6
    <99cca>   DW_AT_type        : <0x98dc7>
    <99cce>   DW_AT_data_member_location: 64
 <2><99ccf>: Abbrev Number: 10 (DW_TAG_member)
    <99cd0>   DW_AT_name        : y
    <99cd2>   DW_AT_decl_file   : 9
    <99cd3>   DW_AT_decl_line   : 619
    <99cd5>   DW_AT_decl_column : 9
    <99cd6>   DW_AT_type        : <0x98dc7>
    <99cda>   DW_AT_data_member_location: 68
 <2><99cdb>: Abbrev Number: 1 (DW_TAG_member)
    <99cdc>   DW_AT_name        : (indirect string, offset: 0x195ed): x_root
    <99ce0>   DW_AT_decl_file   : 9
    <99ce1>   DW_AT_decl_line   : 620
    <99ce3>   DW_AT_decl_column : 6
    <99ce4>   DW_AT_type        : <0x98dc7>
    <99ce8>   DW_AT_data_member_location: 72
 <2><99ce9>: Abbrev Number: 1 (DW_TAG_member)
    <99cea>   DW_AT_name        : (indirect string, offset: 0x195a3): y_root
    <99cee>   DW_AT_decl_file   : 9
    <99cef>   DW_AT_decl_line   : 620
    <99cf1>   DW_AT_decl_column : 14
    <99cf2>   DW_AT_type        : <0x98dc7>
    <99cf6>   DW_AT_data_member_location: 76
 <2><99cf7>: Abbrev Number: 1 (DW_TAG_member)
    <99cf8>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <99cfc>   DW_AT_decl_file   : 9
    <99cfd>   DW_AT_decl_line   : 621
    <99cff>   DW_AT_decl_column : 6
    <99d00>   DW_AT_type        : <0x98dc7>
    <99d04>   DW_AT_data_member_location: 80
 <2><99d05>: Abbrev Number: 1 (DW_TAG_member)
    <99d06>   DW_AT_name        : (indirect string, offset: 0x18592): detail
    <99d0a>   DW_AT_decl_file   : 9
    <99d0b>   DW_AT_decl_line   : 622
    <99d0d>   DW_AT_decl_column : 6
    <99d0e>   DW_AT_type        : <0x98dc7>
    <99d12>   DW_AT_data_member_location: 84
 <2><99d13>: Abbrev Number: 1 (DW_TAG_member)
    <99d14>   DW_AT_name        : (indirect string, offset: 0x192f6): same_screen
    <99d18>   DW_AT_decl_file   : 9
    <99d19>   DW_AT_decl_line   : 627
    <99d1b>   DW_AT_decl_column : 7
    <99d1c>   DW_AT_type        : <0x98dc7>
    <99d20>   DW_AT_data_member_location: 88
 <2><99d21>: Abbrev Number: 1 (DW_TAG_member)
    <99d22>   DW_AT_name        : (indirect string, offset: 0x18794): focus
    <99d26>   DW_AT_decl_file   : 9
    <99d27>   DW_AT_decl_line   : 628
    <99d29>   DW_AT_decl_column : 7
    <99d2a>   DW_AT_type        : <0x98dc7>
    <99d2e>   DW_AT_data_member_location: 92
 <2><99d2f>: Abbrev Number: 1 (DW_TAG_member)
    <99d30>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <99d34>   DW_AT_decl_file   : 9
    <99d35>   DW_AT_decl_line   : 629
    <99d37>   DW_AT_decl_column : 15
    <99d38>   DW_AT_type        : <0x98dab>
    <99d3c>   DW_AT_data_member_location: 96
 <2><99d3d>: Abbrev Number: 0
 <1><99d3e>: Abbrev Number: 6 (DW_TAG_typedef)
    <99d3f>   DW_AT_name        : (indirect string, offset: 0x198e0): XCrossingEvent
    <99d43>   DW_AT_decl_file   : 9
    <99d44>   DW_AT_decl_line   : 630
    <99d46>   DW_AT_decl_column : 3
    <99d47>   DW_AT_type        : <0x99c4b>
 <1><99d4b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99d4c>   DW_AT_byte_size   : 48
    <99d4d>   DW_AT_decl_file   : 9
    <99d4d>   DW_AT_decl_line   : 634
    <99d4f>   DW_AT_decl_column : 9
    <99d4f>   DW_AT_sibling     : <0x99db6>
 <2><99d53>: Abbrev Number: 1 (DW_TAG_member)
    <99d54>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99d58>   DW_AT_decl_file   : 9
    <99d59>   DW_AT_decl_line   : 635
    <99d5b>   DW_AT_decl_column : 6
    <99d5c>   DW_AT_type        : <0x98dc7>
    <99d60>   DW_AT_data_member_location: 0
 <2><99d61>: Abbrev Number: 1 (DW_TAG_member)
    <99d62>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99d66>   DW_AT_decl_file   : 9
    <99d67>   DW_AT_decl_line   : 636
    <99d69>   DW_AT_decl_column : 16
    <99d6a>   DW_AT_type        : <0x98db2>
    <99d6e>   DW_AT_data_member_location: 8
 <2><99d6f>: Abbrev Number: 1 (DW_TAG_member)
    <99d70>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99d74>   DW_AT_decl_file   : 9
    <99d75>   DW_AT_decl_line   : 637
    <99d77>   DW_AT_decl_column : 7
    <99d78>   DW_AT_type        : <0x98dc7>
    <99d7c>   DW_AT_data_member_location: 16
 <2><99d7d>: Abbrev Number: 1 (DW_TAG_member)
    <99d7e>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99d82>   DW_AT_decl_file   : 9
    <99d83>   DW_AT_decl_line   : 638
    <99d85>   DW_AT_decl_column : 11
    <99d86>   DW_AT_type        : <0x99a71>
    <99d8a>   DW_AT_data_member_location: 24
 <2><99d8b>: Abbrev Number: 1 (DW_TAG_member)
    <99d8c>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99d90>   DW_AT_decl_file   : 9
    <99d91>   DW_AT_decl_line   : 639
    <99d93>   DW_AT_decl_column : 9
    <99d94>   DW_AT_type        : <0x994a8>
    <99d98>   DW_AT_data_member_location: 32
 <2><99d99>: Abbrev Number: 1 (DW_TAG_member)
    <99d9a>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <99d9e>   DW_AT_decl_file   : 9
    <99d9f>   DW_AT_decl_line   : 640
    <99da1>   DW_AT_decl_column : 6
    <99da2>   DW_AT_type        : <0x98dc7>
    <99da6>   DW_AT_data_member_location: 40
 <2><99da7>: Abbrev Number: 1 (DW_TAG_member)
    <99da8>   DW_AT_name        : (indirect string, offset: 0x18592): detail
    <99dac>   DW_AT_decl_file   : 9
    <99dad>   DW_AT_decl_line   : 642
    <99daf>   DW_AT_decl_column : 6
    <99db0>   DW_AT_type        : <0x98dc7>
    <99db4>   DW_AT_data_member_location: 44
 <2><99db5>: Abbrev Number: 0
 <1><99db6>: Abbrev Number: 6 (DW_TAG_typedef)
    <99db7>   DW_AT_name        : (indirect string, offset: 0x189d6): XFocusChangeEvent
    <99dbb>   DW_AT_decl_file   : 9
    <99dbc>   DW_AT_decl_line   : 648
    <99dbe>   DW_AT_decl_column : 3
    <99dbf>   DW_AT_type        : <0x99d4b>
 <1><99dc3>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99dc4>   DW_AT_byte_size   : 72
    <99dc5>   DW_AT_decl_file   : 9
    <99dc5>   DW_AT_decl_line   : 653
    <99dc7>   DW_AT_decl_column : 9
    <99dc7>   DW_AT_sibling     : <0x99e20>
 <2><99dcb>: Abbrev Number: 1 (DW_TAG_member)
    <99dcc>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99dd0>   DW_AT_decl_file   : 9
    <99dd1>   DW_AT_decl_line   : 654
    <99dd3>   DW_AT_decl_column : 6
    <99dd4>   DW_AT_type        : <0x98dc7>
    <99dd8>   DW_AT_data_member_location: 0
 <2><99dd9>: Abbrev Number: 1 (DW_TAG_member)
    <99dda>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99dde>   DW_AT_decl_file   : 9
    <99ddf>   DW_AT_decl_line   : 655
    <99de1>   DW_AT_decl_column : 16
    <99de2>   DW_AT_type        : <0x98db2>
    <99de6>   DW_AT_data_member_location: 8
 <2><99de7>: Abbrev Number: 1 (DW_TAG_member)
    <99de8>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99dec>   DW_AT_decl_file   : 9
    <99ded>   DW_AT_decl_line   : 656
    <99def>   DW_AT_decl_column : 7
    <99df0>   DW_AT_type        : <0x98dc7>
    <99df4>   DW_AT_data_member_location: 16
 <2><99df5>: Abbrev Number: 1 (DW_TAG_member)
    <99df6>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99dfa>   DW_AT_decl_file   : 9
    <99dfb>   DW_AT_decl_line   : 657
    <99dfd>   DW_AT_decl_column : 11
    <99dfe>   DW_AT_type        : <0x99a71>
    <99e02>   DW_AT_data_member_location: 24
 <2><99e03>: Abbrev Number: 1 (DW_TAG_member)
    <99e04>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99e08>   DW_AT_decl_file   : 9
    <99e09>   DW_AT_decl_line   : 658
    <99e0b>   DW_AT_decl_column : 9
    <99e0c>   DW_AT_type        : <0x994a8>
    <99e10>   DW_AT_data_member_location: 32
 <2><99e11>: Abbrev Number: 1 (DW_TAG_member)
    <99e12>   DW_AT_name        : (indirect string, offset: 0x18ce2): key_vector
    <99e16>   DW_AT_decl_file   : 9
    <99e17>   DW_AT_decl_line   : 659
    <99e19>   DW_AT_decl_column : 7
    <99e1a>   DW_AT_type        : <0x98e79>
    <99e1e>   DW_AT_data_member_location: 40
 <2><99e1f>: Abbrev Number: 0
 <1><99e20>: Abbrev Number: 6 (DW_TAG_typedef)
    <99e21>   DW_AT_name        : (indirect string, offset: 0x18866): XKeymapEvent
    <99e25>   DW_AT_decl_file   : 9
    <99e26>   DW_AT_decl_line   : 660
    <99e28>   DW_AT_decl_column : 3
    <99e29>   DW_AT_type        : <0x99dc3>
 <1><99e2d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99e2e>   DW_AT_byte_size   : 64
    <99e2f>   DW_AT_decl_file   : 9
    <99e2f>   DW_AT_decl_line   : 662
    <99e31>   DW_AT_decl_column : 9
    <99e31>   DW_AT_sibling     : <0x99ebe>
 <2><99e35>: Abbrev Number: 1 (DW_TAG_member)
    <99e36>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99e3a>   DW_AT_decl_file   : 9
    <99e3b>   DW_AT_decl_line   : 663
    <99e3d>   DW_AT_decl_column : 6
    <99e3e>   DW_AT_type        : <0x98dc7>
    <99e42>   DW_AT_data_member_location: 0
 <2><99e43>: Abbrev Number: 1 (DW_TAG_member)
    <99e44>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99e48>   DW_AT_decl_file   : 9
    <99e49>   DW_AT_decl_line   : 664
    <99e4b>   DW_AT_decl_column : 16
    <99e4c>   DW_AT_type        : <0x98db2>
    <99e50>   DW_AT_data_member_location: 8
 <2><99e51>: Abbrev Number: 1 (DW_TAG_member)
    <99e52>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99e56>   DW_AT_decl_file   : 9
    <99e57>   DW_AT_decl_line   : 665
    <99e59>   DW_AT_decl_column : 7
    <99e5a>   DW_AT_type        : <0x98dc7>
    <99e5e>   DW_AT_data_member_location: 16
 <2><99e5f>: Abbrev Number: 1 (DW_TAG_member)
    <99e60>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99e64>   DW_AT_decl_file   : 9
    <99e65>   DW_AT_decl_line   : 666
    <99e67>   DW_AT_decl_column : 11
    <99e68>   DW_AT_type        : <0x99a71>
    <99e6c>   DW_AT_data_member_location: 24
 <2><99e6d>: Abbrev Number: 1 (DW_TAG_member)
    <99e6e>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <99e72>   DW_AT_decl_file   : 9
    <99e73>   DW_AT_decl_line   : 667
    <99e75>   DW_AT_decl_column : 9
    <99e76>   DW_AT_type        : <0x994a8>
    <99e7a>   DW_AT_data_member_location: 32
 <2><99e7b>: Abbrev Number: 10 (DW_TAG_member)
    <99e7c>   DW_AT_name        : x
    <99e7e>   DW_AT_decl_file   : 9
    <99e7f>   DW_AT_decl_line   : 668
    <99e81>   DW_AT_decl_column : 6
    <99e82>   DW_AT_type        : <0x98dc7>
    <99e86>   DW_AT_data_member_location: 40
 <2><99e87>: Abbrev Number: 10 (DW_TAG_member)
    <99e88>   DW_AT_name        : y
    <99e8a>   DW_AT_decl_file   : 9
    <99e8b>   DW_AT_decl_line   : 668
    <99e8d>   DW_AT_decl_column : 9
    <99e8e>   DW_AT_type        : <0x98dc7>
    <99e92>   DW_AT_data_member_location: 44
 <2><99e93>: Abbrev Number: 1 (DW_TAG_member)
    <99e94>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <99e98>   DW_AT_decl_file   : 9
    <99e99>   DW_AT_decl_line   : 669
    <99e9b>   DW_AT_decl_column : 6
    <99e9c>   DW_AT_type        : <0x98dc7>
    <99ea0>   DW_AT_data_member_location: 48
 <2><99ea1>: Abbrev Number: 1 (DW_TAG_member)
    <99ea2>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <99ea6>   DW_AT_decl_file   : 9
    <99ea7>   DW_AT_decl_line   : 669
    <99ea9>   DW_AT_decl_column : 13
    <99eaa>   DW_AT_type        : <0x98dc7>
    <99eae>   DW_AT_data_member_location: 52
 <2><99eaf>: Abbrev Number: 1 (DW_TAG_member)
    <99eb0>   DW_AT_name        : (indirect string, offset: 0x18d05): count
    <99eb4>   DW_AT_decl_file   : 9
    <99eb5>   DW_AT_decl_line   : 670
    <99eb7>   DW_AT_decl_column : 6
    <99eb8>   DW_AT_type        : <0x98dc7>
    <99ebc>   DW_AT_data_member_location: 56
 <2><99ebd>: Abbrev Number: 0
 <1><99ebe>: Abbrev Number: 6 (DW_TAG_typedef)
    <99ebf>   DW_AT_name        : (indirect string, offset: 0x18c42): XExposeEvent
    <99ec3>   DW_AT_decl_file   : 9
    <99ec4>   DW_AT_decl_line   : 671
    <99ec6>   DW_AT_decl_column : 3
    <99ec7>   DW_AT_type        : <0x99e2d>
 <1><99ecb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99ecc>   DW_AT_byte_size   : 72
    <99ecd>   DW_AT_decl_file   : 9
    <99ecd>   DW_AT_decl_line   : 673
    <99ecf>   DW_AT_decl_column : 9
    <99ecf>   DW_AT_sibling     : <0x99f78>
 <2><99ed3>: Abbrev Number: 1 (DW_TAG_member)
    <99ed4>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99ed8>   DW_AT_decl_file   : 9
    <99ed9>   DW_AT_decl_line   : 674
    <99edb>   DW_AT_decl_column : 6
    <99edc>   DW_AT_type        : <0x98dc7>
    <99ee0>   DW_AT_data_member_location: 0
 <2><99ee1>: Abbrev Number: 1 (DW_TAG_member)
    <99ee2>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99ee6>   DW_AT_decl_file   : 9
    <99ee7>   DW_AT_decl_line   : 675
    <99ee9>   DW_AT_decl_column : 16
    <99eea>   DW_AT_type        : <0x98db2>
    <99eee>   DW_AT_data_member_location: 8
 <2><99eef>: Abbrev Number: 1 (DW_TAG_member)
    <99ef0>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99ef4>   DW_AT_decl_file   : 9
    <99ef5>   DW_AT_decl_line   : 676
    <99ef7>   DW_AT_decl_column : 7
    <99ef8>   DW_AT_type        : <0x98dc7>
    <99efc>   DW_AT_data_member_location: 16
 <2><99efd>: Abbrev Number: 1 (DW_TAG_member)
    <99efe>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99f02>   DW_AT_decl_file   : 9
    <99f03>   DW_AT_decl_line   : 677
    <99f05>   DW_AT_decl_column : 11
    <99f06>   DW_AT_type        : <0x99a71>
    <99f0a>   DW_AT_data_member_location: 24
 <2><99f0b>: Abbrev Number: 1 (DW_TAG_member)
    <99f0c>   DW_AT_name        : (indirect string, offset: 0x19025): drawable
    <99f10>   DW_AT_decl_file   : 9
    <99f11>   DW_AT_decl_line   : 678
    <99f13>   DW_AT_decl_column : 11
    <99f14>   DW_AT_type        : <0x994b4>
    <99f18>   DW_AT_data_member_location: 32
 <2><99f19>: Abbrev Number: 10 (DW_TAG_member)
    <99f1a>   DW_AT_name        : x
    <99f1c>   DW_AT_decl_file   : 9
    <99f1d>   DW_AT_decl_line   : 679
    <99f1f>   DW_AT_decl_column : 6
    <99f20>   DW_AT_type        : <0x98dc7>
    <99f24>   DW_AT_data_member_location: 40
 <2><99f25>: Abbrev Number: 10 (DW_TAG_member)
    <99f26>   DW_AT_name        : y
    <99f28>   DW_AT_decl_file   : 9
    <99f29>   DW_AT_decl_line   : 679
    <99f2b>   DW_AT_decl_column : 9
    <99f2c>   DW_AT_type        : <0x98dc7>
    <99f30>   DW_AT_data_member_location: 44
 <2><99f31>: Abbrev Number: 1 (DW_TAG_member)
    <99f32>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <99f36>   DW_AT_decl_file   : 9
    <99f37>   DW_AT_decl_line   : 680
    <99f39>   DW_AT_decl_column : 6
    <99f3a>   DW_AT_type        : <0x98dc7>
    <99f3e>   DW_AT_data_member_location: 48
 <2><99f3f>: Abbrev Number: 1 (DW_TAG_member)
    <99f40>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <99f44>   DW_AT_decl_file   : 9
    <99f45>   DW_AT_decl_line   : 680
    <99f47>   DW_AT_decl_column : 13
    <99f48>   DW_AT_type        : <0x98dc7>
    <99f4c>   DW_AT_data_member_location: 52
 <2><99f4d>: Abbrev Number: 1 (DW_TAG_member)
    <99f4e>   DW_AT_name        : (indirect string, offset: 0x18d05): count
    <99f52>   DW_AT_decl_file   : 9
    <99f53>   DW_AT_decl_line   : 681
    <99f55>   DW_AT_decl_column : 6
    <99f56>   DW_AT_type        : <0x98dc7>
    <99f5a>   DW_AT_data_member_location: 56
 <2><99f5b>: Abbrev Number: 1 (DW_TAG_member)
    <99f5c>   DW_AT_name        : (indirect string, offset: 0x18e24): major_code
    <99f60>   DW_AT_decl_file   : 9
    <99f61>   DW_AT_decl_line   : 682
    <99f63>   DW_AT_decl_column : 6
    <99f64>   DW_AT_type        : <0x98dc7>
    <99f68>   DW_AT_data_member_location: 60
 <2><99f69>: Abbrev Number: 1 (DW_TAG_member)
    <99f6a>   DW_AT_name        : (indirect string, offset: 0x19b9c): minor_code
    <99f6e>   DW_AT_decl_file   : 9
    <99f6f>   DW_AT_decl_line   : 683
    <99f71>   DW_AT_decl_column : 6
    <99f72>   DW_AT_type        : <0x98dc7>
    <99f76>   DW_AT_data_member_location: 64
 <2><99f77>: Abbrev Number: 0
 <1><99f78>: Abbrev Number: 6 (DW_TAG_typedef)
    <99f79>   DW_AT_name        : (indirect string, offset: 0x193c5): XGraphicsExposeEvent
    <99f7d>   DW_AT_decl_file   : 9
    <99f7e>   DW_AT_decl_line   : 684
    <99f80>   DW_AT_decl_column : 3
    <99f81>   DW_AT_type        : <0x99ecb>
 <1><99f85>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99f86>   DW_AT_byte_size   : 48
    <99f87>   DW_AT_decl_file   : 9
    <99f87>   DW_AT_decl_line   : 686
    <99f89>   DW_AT_decl_column : 9
    <99f89>   DW_AT_sibling     : <0x99ff0>
 <2><99f8d>: Abbrev Number: 1 (DW_TAG_member)
    <99f8e>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <99f92>   DW_AT_decl_file   : 9
    <99f93>   DW_AT_decl_line   : 687
    <99f95>   DW_AT_decl_column : 6
    <99f96>   DW_AT_type        : <0x98dc7>
    <99f9a>   DW_AT_data_member_location: 0
 <2><99f9b>: Abbrev Number: 1 (DW_TAG_member)
    <99f9c>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <99fa0>   DW_AT_decl_file   : 9
    <99fa1>   DW_AT_decl_line   : 688
    <99fa3>   DW_AT_decl_column : 16
    <99fa4>   DW_AT_type        : <0x98db2>
    <99fa8>   DW_AT_data_member_location: 8
 <2><99fa9>: Abbrev Number: 1 (DW_TAG_member)
    <99faa>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <99fae>   DW_AT_decl_file   : 9
    <99faf>   DW_AT_decl_line   : 689
    <99fb1>   DW_AT_decl_column : 7
    <99fb2>   DW_AT_type        : <0x98dc7>
    <99fb6>   DW_AT_data_member_location: 16
 <2><99fb7>: Abbrev Number: 1 (DW_TAG_member)
    <99fb8>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <99fbc>   DW_AT_decl_file   : 9
    <99fbd>   DW_AT_decl_line   : 690
    <99fbf>   DW_AT_decl_column : 11
    <99fc0>   DW_AT_type        : <0x99a71>
    <99fc4>   DW_AT_data_member_location: 24
 <2><99fc5>: Abbrev Number: 1 (DW_TAG_member)
    <99fc6>   DW_AT_name        : (indirect string, offset: 0x19025): drawable
    <99fca>   DW_AT_decl_file   : 9
    <99fcb>   DW_AT_decl_line   : 691
    <99fcd>   DW_AT_decl_column : 11
    <99fce>   DW_AT_type        : <0x994b4>
    <99fd2>   DW_AT_data_member_location: 32
 <2><99fd3>: Abbrev Number: 1 (DW_TAG_member)
    <99fd4>   DW_AT_name        : (indirect string, offset: 0x18e24): major_code
    <99fd8>   DW_AT_decl_file   : 9
    <99fd9>   DW_AT_decl_line   : 692
    <99fdb>   DW_AT_decl_column : 6
    <99fdc>   DW_AT_type        : <0x98dc7>
    <99fe0>   DW_AT_data_member_location: 40
 <2><99fe1>: Abbrev Number: 1 (DW_TAG_member)
    <99fe2>   DW_AT_name        : (indirect string, offset: 0x19b9c): minor_code
    <99fe6>   DW_AT_decl_file   : 9
    <99fe7>   DW_AT_decl_line   : 693
    <99fe9>   DW_AT_decl_column : 6
    <99fea>   DW_AT_type        : <0x98dc7>
    <99fee>   DW_AT_data_member_location: 44
 <2><99fef>: Abbrev Number: 0
 <1><99ff0>: Abbrev Number: 6 (DW_TAG_typedef)
    <99ff1>   DW_AT_name        : (indirect string, offset: 0x19887): XNoExposeEvent
    <99ff5>   DW_AT_decl_file   : 9
    <99ff6>   DW_AT_decl_line   : 694
    <99ff8>   DW_AT_decl_column : 3
    <99ff9>   DW_AT_type        : <0x99f85>
 <1><99ffd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <99ffe>   DW_AT_byte_size   : 48
    <99fff>   DW_AT_decl_file   : 9
    <99fff>   DW_AT_decl_line   : 696
    <9a001>   DW_AT_decl_column : 9
    <9a001>   DW_AT_sibling     : <0x9a05a>
 <2><9a005>: Abbrev Number: 1 (DW_TAG_member)
    <9a006>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9a00a>   DW_AT_decl_file   : 9
    <9a00b>   DW_AT_decl_line   : 697
    <9a00d>   DW_AT_decl_column : 6
    <9a00e>   DW_AT_type        : <0x98dc7>
    <9a012>   DW_AT_data_member_location: 0
 <2><9a013>: Abbrev Number: 1 (DW_TAG_member)
    <9a014>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <9a018>   DW_AT_decl_file   : 9
    <9a019>   DW_AT_decl_line   : 698
    <9a01b>   DW_AT_decl_column : 16
    <9a01c>   DW_AT_type        : <0x98db2>
    <9a020>   DW_AT_data_member_location: 8
 <2><9a021>: Abbrev Number: 1 (DW_TAG_member)
    <9a022>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <9a026>   DW_AT_decl_file   : 9
    <9a027>   DW_AT_decl_line   : 699
    <9a029>   DW_AT_decl_column : 7
    <9a02a>   DW_AT_type        : <0x98dc7>
    <9a02e>   DW_AT_data_member_location: 16
 <2><9a02f>: Abbrev Number: 1 (DW_TAG_member)
    <9a030>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <9a034>   DW_AT_decl_file   : 9
    <9a035>   DW_AT_decl_line   : 700
    <9a037>   DW_AT_decl_column : 11
    <9a038>   DW_AT_type        : <0x99a71>
    <9a03c>   DW_AT_data_member_location: 24
 <2><9a03d>: Abbrev Number: 1 (DW_TAG_member)
    <9a03e>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <9a042>   DW_AT_decl_file   : 9
    <9a043>   DW_AT_decl_line   : 701
    <9a045>   DW_AT_decl_column : 9
