 <2><a35ae>: Abbrev Number: 1 (DW_TAG_member)
    <a35af>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <a35b3>   DW_AT_decl_file   : 5
    <a35b4>   DW_AT_decl_line   : 33
    <a35b5>   DW_AT_decl_column : 20
    <a35b6>   DW_AT_type        : <0xa3355>
    <a35ba>   DW_AT_data_member_location: 4
 <2><a35bb>: Abbrev Number: 1 (DW_TAG_member)
    <a35bc>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <a35c0>   DW_AT_decl_file   : 5
    <a35c1>   DW_AT_decl_line   : 33
    <a35c2>   DW_AT_decl_column : 32
    <a35c3>   DW_AT_type        : <0xa3355>
    <a35c7>   DW_AT_data_member_location: 8
 <2><a35c8>: Abbrev Number: 1 (DW_TAG_member)
    <a35c9>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <a35cd>   DW_AT_decl_file   : 5
    <a35ce>   DW_AT_decl_line   : 33
    <a35cf>   DW_AT_decl_column : 44
    <a35d0>   DW_AT_type        : <0xa3355>
    <a35d4>   DW_AT_data_member_location: 12
 <2><a35d5>: Abbrev Number: 0
 <1><a35d6>: Abbrev Number: 18 (DW_TAG_union_type)
    <a35d7>   DW_AT_byte_size   : 16
    <a35d7>   DW_AT_decl_file   : 5
    <a35d8>   DW_AT_decl_line   : 31
    <a35d9>   DW_AT_decl_column : 2
    <a35d9>   DW_AT_sibling     : <0xa35ee>
 <2><a35dd>: Abbrev Number: 15 (DW_TAG_member)
    <a35de>   DW_AT_type        : <0xa3599>
 <2><a35e2>: Abbrev Number: 19 (DW_TAG_member)
    <a35e3>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <a35e7>   DW_AT_decl_file   : 5
    <a35e8>   DW_AT_decl_line   : 35
    <a35e9>   DW_AT_decl_column : 7
    <a35e9>   DW_AT_type        : <0xa3589>
 <2><a35ed>: Abbrev Number: 0
 <1><a35ee>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a35ef>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <a35f3>   DW_AT_byte_size   : 216
    <a35f4>   DW_AT_decl_file   : 5
    <a35f5>   DW_AT_decl_line   : 16
    <a35f6>   DW_AT_decl_column : 16
    <a35f7>   DW_AT_sibling     : <0xa370b>
 <2><a35fb>: Abbrev Number: 4 (DW_TAG_member)
    <a35fc>   DW_AT_name        : id
    <a35ff>   DW_AT_decl_file   : 5
    <a3600>   DW_AT_decl_line   : 17
    <a3601>   DW_AT_decl_column : 6
    <a3602>   DW_AT_type        : <0xa3355>
    <a3606>   DW_AT_data_member_location: 0
 <2><a3607>: Abbrev Number: 1 (DW_TAG_member)
    <a3608>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <a360c>   DW_AT_decl_file   : 5
    <a360d>   DW_AT_decl_line   : 18
    <a360e>   DW_AT_decl_column : 6
    <a360f>   DW_AT_type        : <0xa3355>
    <a3613>   DW_AT_data_member_location: 4
 <2><a3614>: Abbrev Number: 1 (DW_TAG_member)
    <a3615>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <a3619>   DW_AT_decl_file   : 5
    <a361a>   DW_AT_decl_line   : 19
    <a361b>   DW_AT_decl_column : 18
    <a361c>   DW_AT_type        : <0xa370b>
    <a3620>   DW_AT_data_member_location: 8
 <2><a3621>: Abbrev Number: 1 (DW_TAG_member)
    <a3622>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <a3626>   DW_AT_decl_file   : 5
    <a3627>   DW_AT_decl_line   : 20
    <a3628>   DW_AT_decl_column : 6
    <a3629>   DW_AT_type        : <0xa3355>
    <a362d>   DW_AT_data_member_location: 16
 <2><a362e>: Abbrev Number: 1 (DW_TAG_member)
    <a362f>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <a3633>   DW_AT_decl_file   : 5
    <a3634>   DW_AT_decl_line   : 21
    <a3635>   DW_AT_decl_column : 6
    <a3636>   DW_AT_type        : <0xa3355>
    <a363a>   DW_AT_data_member_location: 20
 <2><a363b>: Abbrev Number: 1 (DW_TAG_member)
    <a363c>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <a3640>   DW_AT_decl_file   : 5
    <a3641>   DW_AT_decl_line   : 22
    <a3642>   DW_AT_decl_column : 6
    <a3643>   DW_AT_type        : <0xa3355>
    <a3647>   DW_AT_data_member_location: 24
 <2><a3648>: Abbrev Number: 1 (DW_TAG_member)
    <a3649>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <a364d>   DW_AT_decl_file   : 5
    <a364e>   DW_AT_decl_line   : 23
    <a364f>   DW_AT_decl_column : 8
    <a3650>   DW_AT_type        : <0xa336d>
    <a3654>   DW_AT_data_member_location: 32
 <2><a3655>: Abbrev Number: 1 (DW_TAG_member)
    <a3656>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <a365a>   DW_AT_decl_file   : 5
    <a365b>   DW_AT_decl_line   : 24
    <a365c>   DW_AT_decl_column : 8
    <a365d>   DW_AT_type        : <0xa33af>
    <a3661>   DW_AT_data_member_location: 40
 <2><a3662>: Abbrev Number: 1 (DW_TAG_member)
    <a3663>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <a3667>   DW_AT_decl_file   : 5
    <a3668>   DW_AT_decl_line   : 24
    <a3669>   DW_AT_decl_column : 16
    <a366a>   DW_AT_type        : <0xa33af>
    <a366e>   DW_AT_data_member_location: 44
 <2><a366f>: Abbrev Number: 20 (DW_TAG_member)
    <a3670>   DW_AT_type        : <0xa3571>
    <a3674>   DW_AT_data_member_location: 48
 <2><a3675>: Abbrev Number: 20 (DW_TAG_member)
    <a3676>   DW_AT_type        : <0xa35d6>
    <a367a>   DW_AT_data_member_location: 64
 <2><a367b>: Abbrev Number: 1 (DW_TAG_member)
    <a367c>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <a3680>   DW_AT_decl_file   : 5
    <a3681>   DW_AT_decl_line   : 37
    <a3682>   DW_AT_decl_column : 8
    <a3683>   DW_AT_type        : <0xa33af>
    <a3687>   DW_AT_data_member_location: 80
 <2><a3688>: Abbrev Number: 1 (DW_TAG_member)
    <a3689>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <a368d>   DW_AT_decl_file   : 5
    <a368e>   DW_AT_decl_line   : 37
    <a368f>   DW_AT_decl_column : 15
    <a3690>   DW_AT_type        : <0xa33af>
    <a3694>   DW_AT_data_member_location: 84
 <2><a3695>: Abbrev Number: 1 (DW_TAG_member)
    <a3696>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <a369a>   DW_AT_decl_file   : 5
    <a369b>   DW_AT_decl_line   : 37
    <a369c>   DW_AT_decl_column : 22
    <a369d>   DW_AT_type        : <0xa33af>
    <a36a1>   DW_AT_data_member_location: 88
 <2><a36a2>: Abbrev Number: 1 (DW_TAG_member)
    <a36a3>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <a36a7>   DW_AT_decl_file   : 5
    <a36a8>   DW_AT_decl_line   : 37
    <a36a9>   DW_AT_decl_column : 29
    <a36aa>   DW_AT_type        : <0xa33af>
    <a36ae>   DW_AT_data_member_location: 92
 <2><a36af>: Abbrev Number: 1 (DW_TAG_member)
    <a36b0>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <a36b4>   DW_AT_decl_file   : 5
    <a36b5>   DW_AT_decl_line   : 38
    <a36b6>   DW_AT_decl_column : 15
    <a36b7>   DW_AT_type        : <0xa3339>
    <a36bb>   DW_AT_data_member_location: 96
 <2><a36bc>: Abbrev Number: 1 (DW_TAG_member)
    <a36bd>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <a36c1>   DW_AT_decl_file   : 5
    <a36c2>   DW_AT_decl_line   : 38
    <a36c3>   DW_AT_decl_column : 25
    <a36c4>   DW_AT_type        : <0xa3339>
    <a36c8>   DW_AT_data_member_location: 100
 <2><a36c9>: Abbrev Number: 1 (DW_TAG_member)
    <a36ca>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <a36ce>   DW_AT_decl_file   : 5
    <a36cf>   DW_AT_decl_line   : 39
    <a36d0>   DW_AT_decl_column : 9
    <a36d1>   DW_AT_type        : <0xa372f>
    <a36d5>   DW_AT_data_member_location: 104
 <2><a36d6>: Abbrev Number: 1 (DW_TAG_member)
    <a36d7>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <a36db>   DW_AT_decl_file   : 5
    <a36dc>   DW_AT_decl_line   : 40
    <a36dd>   DW_AT_decl_column : 17
    <a36de>   DW_AT_type        : <0xa374d>
    <a36e2>   DW_AT_data_member_location: 112
 <2><a36e3>: Abbrev Number: 1 (DW_TAG_member)
    <a36e4>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <a36e8>   DW_AT_decl_file   : 5
    <a36e9>   DW_AT_decl_line   : 41
    <a36ea>   DW_AT_decl_column : 10
    <a36eb>   DW_AT_type        : <0xa376b>
    <a36ef>   DW_AT_data_member_location: 120
 <2><a36f0>: Abbrev Number: 1 (DW_TAG_member)
    <a36f1>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <a36f5>   DW_AT_decl_file   : 5
    <a36f6>   DW_AT_decl_line   : 42
    <a36f7>   DW_AT_decl_column : 11
    <a36f8>   DW_AT_type        : <0xa3770>
    <a36fc>   DW_AT_data_member_location: 128
 <2><a36fd>: Abbrev Number: 1 (DW_TAG_member)
    <a36fe>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a3702>   DW_AT_decl_file   : 5
    <a3703>   DW_AT_decl_line   : 43
    <a3704>   DW_AT_decl_column : 6
    <a3705>   DW_AT_type        : <0xa3355>
    <a3709>   DW_AT_data_member_location: 208
 <2><a370a>: Abbrev Number: 0
 <1><a370b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a370c>   DW_AT_byte_size   : 8
    <a370c>   DW_AT_type        : <0xa352a>
 <1><a3710>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <a3711>   DW_AT_prototyped  : 1
    <a3711>   DW_AT_sibling     : <0xa372a>
 <2><a3715>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3716>   DW_AT_type        : <0xa372a>
 <2><a371a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a371b>   DW_AT_type        : <0xa3355>
 <2><a371f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3720>   DW_AT_type        : <0xa3355>
 <2><a3724>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3725>   DW_AT_type        : <0xa3339>
 <2><a3729>: Abbrev Number: 0
 <1><a372a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a372b>   DW_AT_byte_size   : 8
    <a372b>   DW_AT_type        : <0xa35ee>
 <1><a372f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3730>   DW_AT_byte_size   : 8
    <a3730>   DW_AT_type        : <0xa3710>
 <1><a3734>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <a3735>   DW_AT_prototyped  : 1
    <a3735>   DW_AT_type        : <0xa3339>
    <a3739>   DW_AT_sibling     : <0xa374d>
 <2><a373d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a373e>   DW_AT_type        : <0xa372a>
 <2><a3742>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3743>   DW_AT_type        : <0xa3355>
 <2><a3747>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3748>   DW_AT_type        : <0xa3355>
 <2><a374c>: Abbrev Number: 0
 <1><a374d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a374e>   DW_AT_byte_size   : 8
    <a374e>   DW_AT_type        : <0xa3734>
 <1><a3752>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <a3753>   DW_AT_prototyped  : 1
    <a3753>   DW_AT_type        : <0xa336d>
    <a3757>   DW_AT_sibling     : <0xa376b>
 <2><a375b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a375c>   DW_AT_type        : <0xa336d>
 <2><a3760>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3761>   DW_AT_type        : <0xa3355>
 <2><a3765>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3766>   DW_AT_type        : <0xa337b>
 <2><a376a>: Abbrev Number: 0
 <1><a376b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a376c>   DW_AT_byte_size   : 8
    <a376c>   DW_AT_type        : <0xa3752>
 <1><a3770>: Abbrev Number: 22 (DW_TAG_array_type)
    <a3771>   DW_AT_type        : <0xa3780>
    <a3775>   DW_AT_sibling     : <0xa3780>
 <2><a3779>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <a377a>   DW_AT_type        : <0xa3340>
    <a377e>   DW_AT_upper_bound : 9
 <2><a377f>: Abbrev Number: 0
 <1><a3780>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3781>   DW_AT_byte_size   : 8
    <a3781>   DW_AT_type        : <0xa3785>
 <1><a3785>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3786>   DW_AT_byte_size   : 8
    <a3786>   DW_AT_type        : <0xa34eb>
 <1><a378a>: Abbrev Number: 8 (DW_TAG_typedef)
    <a378b>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <a378f>   DW_AT_decl_file   : 5
    <a3790>   DW_AT_decl_line   : 44
    <a3791>   DW_AT_decl_column : 3
    <a3792>   DW_AT_type        : <0xa35ee>
 <1><a3796>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a3797>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <a379b>   DW_AT_byte_size   : 12
    <a379c>   DW_AT_decl_file   : 6
    <a379d>   DW_AT_decl_line   : 139
    <a379e>   DW_AT_decl_column : 16
    <a379f>   DW_AT_sibling     : <0xa37c8>
 <2><a37a3>: Abbrev Number: 4 (DW_TAG_member)
    <a37a4>   DW_AT_name        : ch
    <a37a7>   DW_AT_decl_file   : 6
    <a37a8>   DW_AT_decl_line   : 140
    <a37a9>   DW_AT_decl_column : 14
    <a37aa>   DW_AT_type        : <0xa3387>
    <a37ae>   DW_AT_data_member_location: 0
 <2><a37af>: Abbrev Number: 4 (DW_TAG_member)
    <a37b0>   DW_AT_name        : fg
    <a37b3>   DW_AT_decl_file   : 6
    <a37b4>   DW_AT_decl_line   : 141
    <a37b5>   DW_AT_decl_column : 14
    <a37b6>   DW_AT_type        : <0xa3339>
    <a37ba>   DW_AT_data_member_location: 4
 <2><a37bb>: Abbrev Number: 4 (DW_TAG_member)
    <a37bc>   DW_AT_name        : bg
    <a37bf>   DW_AT_decl_file   : 6
    <a37c0>   DW_AT_decl_line   : 141
    <a37c1>   DW_AT_decl_column : 18
    <a37c2>   DW_AT_type        : <0xa3339>
    <a37c6>   DW_AT_data_member_location: 8
 <2><a37c7>: Abbrev Number: 0
 <1><a37c8>: Abbrev Number: 8 (DW_TAG_typedef)
    <a37c9>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <a37cd>   DW_AT_decl_file   : 6
    <a37ce>   DW_AT_decl_line   : 142
    <a37cf>   DW_AT_decl_column : 3
    <a37d0>   DW_AT_type        : <0xa3796>
 <1><a37d4>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a37d5>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a37d9>   DW_AT_byte_size   : 208
    <a37da>   DW_AT_decl_file   : 6
    <a37db>   DW_AT_decl_line   : 144
    <a37dc>   DW_AT_decl_column : 16
    <a37dd>   DW_AT_sibling     : <0xa3997>
 <2><a37e1>: Abbrev Number: 4 (DW_TAG_member)
    <a37e2>   DW_AT_name        : id
    <a37e5>   DW_AT_decl_file   : 6
    <a37e6>   DW_AT_decl_line   : 146
    <a37e7>   DW_AT_decl_column : 6
    <a37e8>   DW_AT_type        : <0xa3355>
    <a37ec>   DW_AT_data_member_location: 0
 <2><a37ed>: Abbrev Number: 1 (DW_TAG_member)
    <a37ee>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <a37f2>   DW_AT_decl_file   : 6
    <a37f3>   DW_AT_decl_line   : 147
    <a37f4>   DW_AT_decl_column : 9
    <a37f5>   DW_AT_type        : <0xa3355>
    <a37f9>   DW_AT_data_member_location: 4
 <2><a37fa>: Abbrev Number: 1 (DW_TAG_member)
    <a37fb>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <a37ff>   DW_AT_decl_file   : 6
    <a3800>   DW_AT_decl_line   : 148
    <a3801>   DW_AT_decl_column : 21
    <a3802>   DW_AT_type        : <0xa370b>
    <a3806>   DW_AT_data_member_location: 8
 <2><a3807>: Abbrev Number: 1 (DW_TAG_member)
    <a3808>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <a380c>   DW_AT_decl_file   : 6
    <a380d>   DW_AT_decl_line   : 149
    <a380e>   DW_AT_decl_column : 9
    <a380f>   DW_AT_type        : <0xa3355>
    <a3813>   DW_AT_data_member_location: 16
 <2><a3814>: Abbrev Number: 1 (DW_TAG_member)
    <a3815>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <a3819>   DW_AT_decl_file   : 6
    <a381a>   DW_AT_decl_line   : 150
    <a381b>   DW_AT_decl_column : 9
    <a381c>   DW_AT_type        : <0xa3355>
    <a3820>   DW_AT_data_member_location: 20
 <2><a3821>: Abbrev Number: 1 (DW_TAG_member)
    <a3822>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <a3826>   DW_AT_decl_file   : 6
    <a3827>   DW_AT_decl_line   : 151
    <a3828>   DW_AT_decl_column : 20
    <a3829>   DW_AT_type        : <0xa352a>
    <a382d>   DW_AT_data_member_location: 24
 <2><a382e>: Abbrev Number: 4 (DW_TAG_member)
    <a382f>   DW_AT_name        : w
    <a3831>   DW_AT_decl_file   : 6
    <a3832>   DW_AT_decl_line   : 152
    <a3833>   DW_AT_decl_column : 9
    <a3834>   DW_AT_type        : <0xa3355>
    <a3838>   DW_AT_data_member_location: 32
 <2><a3839>: Abbrev Number: 4 (DW_TAG_member)
    <a383a>   DW_AT_name        : h
    <a383c>   DW_AT_decl_file   : 6
    <a383d>   DW_AT_decl_line   : 152
    <a383e>   DW_AT_decl_column : 12
    <a383f>   DW_AT_type        : <0xa3355>
    <a3843>   DW_AT_data_member_location: 36
 <2><a3844>: Abbrev Number: 1 (DW_TAG_member)
    <a3845>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <a3849>   DW_AT_decl_file   : 6
    <a384a>   DW_AT_decl_line   : 153
    <a384b>   DW_AT_decl_column : 9
    <a384c>   DW_AT_type        : <0xa3355>
    <a3850>   DW_AT_data_member_location: 40
 <2><a3851>: Abbrev Number: 4 (DW_TAG_member)
    <a3852>   DW_AT_name        : bpp
    <a3856>   DW_AT_decl_file   : 6
    <a3857>   DW_AT_decl_line   : 154
    <a3858>   DW_AT_decl_column : 9
    <a3859>   DW_AT_type        : <0xa3355>
    <a385d>   DW_AT_data_member_location: 44
 <2><a385e>: Abbrev Number: 1 (DW_TAG_member)
    <a385f>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a3863>   DW_AT_decl_file   : 6
    <a3864>   DW_AT_decl_line   : 155
    <a3865>   DW_AT_decl_column : 9
    <a3866>   DW_AT_type        : <0xa3355>
    <a386a>   DW_AT_data_member_location: 48
 <2><a386b>: Abbrev Number: 1 (DW_TAG_member)
    <a386c>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <a3870>   DW_AT_decl_file   : 6
    <a3871>   DW_AT_decl_line   : 156
    <a3872>   DW_AT_decl_column : 19
    <a3873>   DW_AT_type        : <0xa3997>
    <a3877>   DW_AT_data_member_location: 56
 <2><a3878>: Abbrev Number: 1 (DW_TAG_member)
    <a3879>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <a387d>   DW_AT_decl_file   : 6
    <a387e>   DW_AT_decl_line   : 157
    <a387f>   DW_AT_decl_column : 19
    <a3880>   DW_AT_type        : <0xa3997>
    <a3884>   DW_AT_data_member_location: 64
 <2><a3885>: Abbrev Number: 1 (DW_TAG_member)
    <a3886>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <a388a>   DW_AT_decl_file   : 6
    <a388b>   DW_AT_decl_line   : 158
    <a388c>   DW_AT_decl_column : 20
    <a388d>   DW_AT_type        : <0xa352a>
    <a3891>   DW_AT_data_member_location: 72
 <2><a3892>: Abbrev Number: 1 (DW_TAG_member)
    <a3893>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a3897>   DW_AT_decl_file   : 6
    <a3898>   DW_AT_decl_line   : 159
    <a3899>   DW_AT_decl_column : 11
    <a389a>   DW_AT_type        : <0xa336f>
    <a389e>   DW_AT_data_member_location: 80
 <2><a389f>: Abbrev Number: 1 (DW_TAG_member)
    <a38a0>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <a38a4>   DW_AT_decl_file   : 6
    <a38a5>   DW_AT_decl_line   : 160
    <a38a6>   DW_AT_decl_column : 29
    <a38a7>   DW_AT_type        : <0xa3a65>
    <a38ab>   DW_AT_data_member_location: 88
 <2><a38ac>: Abbrev Number: 1 (DW_TAG_member)
    <a38ad>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <a38b1>   DW_AT_decl_file   : 6
    <a38b2>   DW_AT_decl_line   : 161
    <a38b3>   DW_AT_decl_column : 9
    <a38b4>   DW_AT_type        : <0xa3355>
    <a38b8>   DW_AT_data_member_location: 96
 <2><a38b9>: Abbrev Number: 1 (DW_TAG_member)
    <a38ba>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <a38be>   DW_AT_decl_file   : 6
    <a38bf>   DW_AT_decl_line   : 162
    <a38c0>   DW_AT_decl_column : 27
    <a38c1>   DW_AT_type        : <0xa3a95>
    <a38c5>   DW_AT_data_member_location: 104
 <2><a38c6>: Abbrev Number: 1 (DW_TAG_member)
    <a38c7>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <a38cb>   DW_AT_decl_file   : 6
    <a38cc>   DW_AT_decl_line   : 163
    <a38cd>   DW_AT_decl_column : 9
    <a38ce>   DW_AT_type        : <0xa3355>
    <a38d2>   DW_AT_data_member_location: 112
 <2><a38d3>: Abbrev Number: 1 (DW_TAG_member)
    <a38d4>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <a38d8>   DW_AT_decl_file   : 6
    <a38d9>   DW_AT_decl_line   : 164
    <a38da>   DW_AT_decl_column : 9
    <a38db>   DW_AT_type        : <0xa3355>
    <a38df>   DW_AT_data_member_location: 116
 <2><a38e0>: Abbrev Number: 1 (DW_TAG_member)
    <a38e1>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <a38e5>   DW_AT_decl_file   : 6
    <a38e6>   DW_AT_decl_line   : 164
    <a38e7>   DW_AT_decl_column : 19
    <a38e8>   DW_AT_type        : <0xa3355>
    <a38ec>   DW_AT_data_member_location: 120
 <2><a38ed>: Abbrev Number: 1 (DW_TAG_member)
    <a38ee>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <a38f2>   DW_AT_decl_file   : 6
    <a38f3>   DW_AT_decl_line   : 165
    <a38f4>   DW_AT_decl_column : 24
    <a38f5>   DW_AT_type        : <0xa3acc>
    <a38f9>   DW_AT_data_member_location: 128
 <2><a38fa>: Abbrev Number: 1 (DW_TAG_member)
    <a38fb>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <a38ff>   DW_AT_decl_file   : 6
    <a3900>   DW_AT_decl_line   : 166
    <a3901>   DW_AT_decl_column : 9
    <a3902>   DW_AT_type        : <0xa3355>
    <a3906>   DW_AT_data_member_location: 136
 <2><a3907>: Abbrev Number: 1 (DW_TAG_member)
    <a3908>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <a390c>   DW_AT_decl_file   : 6
    <a390d>   DW_AT_decl_line   : 166
    <a390e>   DW_AT_decl_column : 17
    <a390f>   DW_AT_type        : <0xa3355>
    <a3913>   DW_AT_data_member_location: 140
 <2><a3914>: Abbrev Number: 1 (DW_TAG_member)
    <a3915>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <a3919>   DW_AT_decl_file   : 6
    <a391a>   DW_AT_decl_line   : 167
    <a391b>   DW_AT_decl_column : 11
    <a391c>   DW_AT_type        : <0xa33af>
    <a3920>   DW_AT_data_member_location: 144
 <2><a3921>: Abbrev Number: 4 (DW_TAG_member)
    <a3922>   DW_AT_name        : key
    <a3926>   DW_AT_decl_file   : 6
    <a3927>   DW_AT_decl_line   : 168
    <a3928>   DW_AT_decl_column : 11
    <a3929>   DW_AT_type        : <0xa336f>
    <a392d>   DW_AT_data_member_location: 152
 <2><a392e>: Abbrev Number: 1 (DW_TAG_member)
    <a392f>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <a3933>   DW_AT_decl_file   : 6
    <a3934>   DW_AT_decl_line   : 169
    <a3935>   DW_AT_decl_column : 6
    <a3936>   DW_AT_type        : <0xa3355>
    <a393a>   DW_AT_data_member_location: 160
 <2><a393b>: Abbrev Number: 1 (DW_TAG_member)
    <a393c>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <a3940>   DW_AT_decl_file   : 6
    <a3941>   DW_AT_decl_line   : 170
    <a3942>   DW_AT_decl_column : 18
    <a3943>   DW_AT_type        : <0xa3ad1>
    <a3947>   DW_AT_data_member_location: 168
 <2><a3948>: Abbrev Number: 1 (DW_TAG_member)
    <a3949>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <a394d>   DW_AT_decl_file   : 6
    <a394e>   DW_AT_decl_line   : 171
    <a394f>   DW_AT_decl_column : 12
    <a3950>   DW_AT_type        : <0xa34c1>
    <a3954>   DW_AT_data_member_location: 176
 <2><a3955>: Abbrev Number: 1 (DW_TAG_member)
    <a3956>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <a395a>   DW_AT_decl_file   : 6
    <a395b>   DW_AT_decl_line   : 172
    <a395c>   DW_AT_decl_column : 9
    <a395d>   DW_AT_type        : <0xa3355>
    <a3961>   DW_AT_data_member_location: 184
 <2><a3962>: Abbrev Number: 1 (DW_TAG_member)
    <a3963>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <a3967>   DW_AT_decl_file   : 6
    <a3968>   DW_AT_decl_line   : 172
    <a3969>   DW_AT_decl_column : 21
    <a396a>   DW_AT_type        : <0xa3355>
    <a396e>   DW_AT_data_member_location: 188
 <2><a396f>: Abbrev Number: 1 (DW_TAG_member)
    <a3970>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <a3974>   DW_AT_decl_file   : 6
    <a3975>   DW_AT_decl_line   : 173
    <a3976>   DW_AT_decl_column : 11
    <a3977>   DW_AT_type        : <0xa3adb>
    <a397b>   DW_AT_data_member_location: 192
 <2><a397c>: Abbrev Number: 1 (DW_TAG_member)
    <a397d>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a3981>   DW_AT_decl_file   : 6
    <a3982>   DW_AT_decl_line   : 174
    <a3983>   DW_AT_decl_column : 15
    <a3984>   DW_AT_type        : <0xa335c>
    <a3988>   DW_AT_data_member_location: 200
 <2><a3989>: Abbrev Number: 1 (DW_TAG_member)
    <a398a>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <a398e>   DW_AT_decl_file   : 6
    <a398f>   DW_AT_decl_line   : 175
    <a3990>   DW_AT_decl_column : 6
    <a3991>   DW_AT_type        : <0xa3355>
    <a3995>   DW_AT_data_member_location: 204
 <2><a3996>: Abbrev Number: 0
 <1><a3997>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3998>   DW_AT_byte_size   : 8
    <a3998>   DW_AT_type        : <0xa3339>
 <1><a399c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a399d>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <a39a1>   DW_AT_byte_size   : 112
    <a39a2>   DW_AT_decl_file   : 6
    <a39a3>   DW_AT_decl_line   : 178
    <a39a4>   DW_AT_decl_column : 16
    <a39a5>   DW_AT_sibling     : <0xa3a60>
 <2><a39a9>: Abbrev Number: 1 (DW_TAG_member)
    <a39aa>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <a39ae>   DW_AT_decl_file   : 6
    <a39af>   DW_AT_decl_line   : 188
    <a39b0>   DW_AT_decl_column : 8
    <a39b1>   DW_AT_type        : <0xa336f>
    <a39b5>   DW_AT_data_member_location: 0
 <2><a39b6>: Abbrev Number: 1 (DW_TAG_member)
    <a39b7>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <a39bb>   DW_AT_decl_file   : 6
    <a39bc>   DW_AT_decl_line   : 208
    <a39bd>   DW_AT_decl_column : 8
    <a39be>   DW_AT_type        : <0xa3b14>
    <a39c2>   DW_AT_data_member_location: 8
 <2><a39c3>: Abbrev Number: 1 (DW_TAG_member)
    <a39c4>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <a39c8>   DW_AT_decl_file   : 6
    <a39c9>   DW_AT_decl_line   : 222
    <a39ca>   DW_AT_decl_column : 9
    <a39cb>   DW_AT_type        : <0xa33a2>
    <a39cf>   DW_AT_data_member_location: 16
 <2><a39d0>: Abbrev Number: 1 (DW_TAG_member)
    <a39d1>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <a39d5>   DW_AT_decl_file   : 6
    <a39d6>   DW_AT_decl_line   : 231
    <a39d7>   DW_AT_decl_column : 9
    <a39d8>   DW_AT_type        : <0xa33a2>
    <a39dc>   DW_AT_data_member_location: 24
 <2><a39dd>: Abbrev Number: 1 (DW_TAG_member)
    <a39de>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <a39e2>   DW_AT_decl_file   : 6
    <a39e3>   DW_AT_decl_line   : 239
    <a39e4>   DW_AT_decl_column : 9
    <a39e5>   DW_AT_type        : <0xa33a2>
    <a39e9>   DW_AT_data_member_location: 32
 <2><a39ea>: Abbrev Number: 1 (DW_TAG_member)
    <a39eb>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <a39ef>   DW_AT_decl_file   : 6
    <a39f0>   DW_AT_decl_line   : 248
    <a39f1>   DW_AT_decl_column : 9
    <a39f2>   DW_AT_type        : <0xa3b33>
    <a39f6>   DW_AT_data_member_location: 40
 <2><a39f7>: Abbrev Number: 7 (DW_TAG_member)
    <a39f8>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <a39fc>   DW_AT_decl_file   : 6
    <a39fc>   DW_AT_decl_line   : 258
    <a39fe>   DW_AT_decl_column : 9
    <a39ff>   DW_AT_type        : <0xa33a2>
    <a3a03>   DW_AT_data_member_location: 48
 <2><a3a04>: Abbrev Number: 7 (DW_TAG_member)
    <a3a05>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <a3a09>   DW_AT_decl_file   : 6
    <a3a09>   DW_AT_decl_line   : 274
    <a3a0b>   DW_AT_decl_column : 8
    <a3a0c>   DW_AT_type        : <0xa3499>
    <a3a10>   DW_AT_data_member_location: 56
 <2><a3a11>: Abbrev Number: 7 (DW_TAG_member)
    <a3a12>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <a3a16>   DW_AT_decl_file   : 6
    <a3a16>   DW_AT_decl_line   : 285
    <a3a18>   DW_AT_decl_column : 9
    <a3a19>   DW_AT_type        : <0xa3b33>
    <a3a1d>   DW_AT_data_member_location: 64
 <2><a3a1e>: Abbrev Number: 7 (DW_TAG_member)
    <a3a1f>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <a3a23>   DW_AT_decl_file   : 6
    <a3a23>   DW_AT_decl_line   : 293
    <a3a25>   DW_AT_decl_column : 9
    <a3a26>   DW_AT_type        : <0xa3b43>
    <a3a2a>   DW_AT_data_member_location: 72
 <2><a3a2b>: Abbrev Number: 7 (DW_TAG_member)
    <a3a2c>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <a3a30>   DW_AT_decl_file   : 6
    <a3a30>   DW_AT_decl_line   : 301
    <a3a32>   DW_AT_decl_column : 8
    <a3a33>   DW_AT_type        : <0xa347b>
    <a3a37>   DW_AT_data_member_location: 80
 <2><a3a38>: Abbrev Number: 7 (DW_TAG_member)
    <a3a39>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <a3a3d>   DW_AT_decl_file   : 6
    <a3a3d>   DW_AT_decl_line   : 314
    <a3a3f>   DW_AT_decl_column : 9
    <a3a40>   DW_AT_type        : <0xa3b5c>
    <a3a44>   DW_AT_data_member_location: 88
 <2><a3a45>: Abbrev Number: 7 (DW_TAG_member)
    <a3a46>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <a3a4a>   DW_AT_decl_file   : 6
    <a3a4a>   DW_AT_decl_line   : 321
    <a3a4c>   DW_AT_decl_column : 9
    <a3a4d>   DW_AT_type        : <0xa33a2>
    <a3a51>   DW_AT_data_member_location: 96
 <2><a3a52>: Abbrev Number: 7 (DW_TAG_member)
    <a3a53>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <a3a57>   DW_AT_decl_file   : 6
    <a3a57>   DW_AT_decl_line   : 328
    <a3a59>   DW_AT_decl_column : 9
    <a3a5a>   DW_AT_type        : <0xa33a2>
    <a3a5e>   DW_AT_data_member_location: 104
 <2><a3a5f>: Abbrev Number: 0
 <1><a3a60>: Abbrev Number: 11 (DW_TAG_const_type)
    <a3a61>   DW_AT_type        : <0xa399c>
 <1><a3a65>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3a66>   DW_AT_byte_size   : 8
    <a3a66>   DW_AT_type        : <0xa3a60>
 <1><a3a6a>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a3a6b>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <a3a6f>   DW_AT_byte_size   : 16
    <a3a6f>   DW_AT_decl_file   : 6
    <a3a6f>   DW_AT_decl_line   : 331
    <a3a71>   DW_AT_decl_column : 16
    <a3a71>   DW_AT_sibling     : <0xa3a90>
 <2><a3a75>: Abbrev Number: 7 (DW_TAG_member)
    <a3a76>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <a3a7a>   DW_AT_decl_file   : 6
    <a3a7a>   DW_AT_decl_line   : 333
    <a3a7c>   DW_AT_decl_column : 12
    <a3a7d>   DW_AT_type        : <0xa3361>
    <a3a81>   DW_AT_data_member_location: 0
 <2><a3a82>: Abbrev Number: 7 (DW_TAG_member)
    <a3a83>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a3a87>   DW_AT_decl_file   : 6
    <a3a87>   DW_AT_decl_line   : 334
    <a3a89>   DW_AT_decl_column : 23
    <a3a8a>   DW_AT_type        : <0xa3b61>
    <a3a8e>   DW_AT_data_member_location: 8
 <2><a3a8f>: Abbrev Number: 0
 <1><a3a90>: Abbrev Number: 11 (DW_TAG_const_type)
    <a3a91>   DW_AT_type        : <0xa3a6a>
 <1><a3a95>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3a96>   DW_AT_byte_size   : 8
    <a3a96>   DW_AT_type        : <0xa3a90>
 <1><a3a9a>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a3a9b>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <a3a9f>   DW_AT_byte_size   : 16
    <a3a9f>   DW_AT_decl_file   : 6
    <a3a9f>   DW_AT_decl_line   : 337
    <a3aa1>   DW_AT_decl_column : 16
    <a3aa1>   DW_AT_sibling     : <0xa3ac7>
 <2><a3aa5>: Abbrev Number: 25 (DW_TAG_member)
    <a3aa6>   DW_AT_name        : w
    <a3aa8>   DW_AT_decl_file   : 6
    <a3aa8>   DW_AT_decl_line   : 339
    <a3aaa>   DW_AT_decl_column : 15
    <a3aaa>   DW_AT_type        : <0xa3361>
    <a3aae>   DW_AT_data_member_location: 0
 <2><a3aaf>: Abbrev Number: 25 (DW_TAG_member)
    <a3ab0>   DW_AT_name        : h
    <a3ab2>   DW_AT_decl_file   : 6
    <a3ab2>   DW_AT_decl_line   : 340
    <a3ab4>   DW_AT_decl_column : 15
    <a3ab4>   DW_AT_type        : <0xa3361>
    <a3ab8>   DW_AT_data_member_location: 4
 <2><a3ab9>: Abbrev Number: 7 (DW_TAG_member)
    <a3aba>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a3abe>   DW_AT_decl_file   : 6
    <a3abe>   DW_AT_decl_line   : 341
    <a3ac0>   DW_AT_decl_column : 23
    <a3ac1>   DW_AT_type        : <0xa3b61>
    <a3ac5>   DW_AT_data_member_location: 8
 <2><a3ac6>: Abbrev Number: 0
 <1><a3ac7>: Abbrev Number: 11 (DW_TAG_const_type)
    <a3ac8>   DW_AT_type        : <0xa3a9a>
 <1><a3acc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3acd>   DW_AT_byte_size   : 8
    <a3acd>   DW_AT_type        : <0xa3ac7>
 <1><a3ad1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3ad2>   DW_AT_byte_size   : 8
    <a3ad2>   DW_AT_type        : <0xa3ad6>
 <1><a3ad6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3ad7>   DW_AT_byte_size   : 8
    <a3ad7>   DW_AT_type        : <0xa37c8>
 <1><a3adb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3adc>   DW_AT_byte_size   : 8
    <a3adc>   DW_AT_type        : <0xa33b6>
 <1><a3ae0>: Abbrev Number: 8 (DW_TAG_typedef)
    <a3ae1>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a3ae5>   DW_AT_decl_file   : 6
    <a3ae6>   DW_AT_decl_line   : 176
    <a3ae7>   DW_AT_decl_column : 3
    <a3ae8>   DW_AT_type        : <0xa37d4>
 <1><a3aec>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <a3aed>   DW_AT_prototyped  : 1
    <a3aed>   DW_AT_type        : <0xa3355>
    <a3af1>   DW_AT_sibling     : <0xa3b14>
 <2><a3af5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3af6>   DW_AT_type        : <0xa336f>
 <2><a3afa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3afb>   DW_AT_type        : <0xa3355>
 <2><a3aff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b00>   DW_AT_type        : <0xa3355>
 <2><a3b04>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b05>   DW_AT_type        : <0xa3355>
 <2><a3b09>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b0a>   DW_AT_type        : <0xa3355>
 <2><a3b0e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b0f>   DW_AT_type        : <0xa3355>
 <2><a3b13>: Abbrev Number: 0
 <1><a3b14>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b15>   DW_AT_byte_size   : 8
    <a3b15>   DW_AT_type        : <0xa3aec>
 <1><a3b19>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <a3b1a>   DW_AT_prototyped  : 1
    <a3b1a>   DW_AT_sibling     : <0xa3b33>
 <2><a3b1e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b1f>   DW_AT_type        : <0xa3355>
 <2><a3b23>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b24>   DW_AT_type        : <0xa3355>
 <2><a3b28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b29>   DW_AT_type        : <0xa3355>
 <2><a3b2d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b2e>   DW_AT_type        : <0xa3355>
 <2><a3b32>: Abbrev Number: 0
 <1><a3b33>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b34>   DW_AT_byte_size   : 8
    <a3b34>   DW_AT_type        : <0xa3b19>
 <1><a3b38>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <a3b39>   DW_AT_prototyped  : 1
    <a3b39>   DW_AT_sibling     : <0xa3b43>
 <2><a3b3d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b3e>   DW_AT_type        : <0xa336f>
 <2><a3b42>: Abbrev Number: 0
 <1><a3b43>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b44>   DW_AT_byte_size   : 8
    <a3b44>   DW_AT_type        : <0xa3b38>
 <1><a3b48>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <a3b49>   DW_AT_prototyped  : 1
    <a3b49>   DW_AT_type        : <0xa3494>
    <a3b4d>   DW_AT_sibling     : <0xa3b5c>
 <2><a3b51>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b52>   DW_AT_type        : <0xa3355>
 <2><a3b56>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b57>   DW_AT_type        : <0xa3494>
 <2><a3b5b>: Abbrev Number: 0
 <1><a3b5c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b5d>   DW_AT_byte_size   : 8
    <a3b5d>   DW_AT_type        : <0xa3b48>
 <1><a3b61>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b62>   DW_AT_byte_size   : 8
    <a3b62>   DW_AT_type        : <0xa332d>
 <1><a3b66>: Abbrev Number: 35 (DW_TAG_variable)
    <a3b67>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <a3b6b>   DW_AT_decl_file   : 6
    <a3b6c>   DW_AT_decl_line   : 364
    <a3b6e>   DW_AT_decl_column : 15
    <a3b6f>   DW_AT_type        : <0xa3b73>
    <a3b73>   DW_AT_external    : 1
    <a3b73>   DW_AT_declaration : 1
 <1><a3b73>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3b74>   DW_AT_byte_size   : 8
    <a3b74>   DW_AT_type        : <0xa3ae0>
 <1><a3b78>: Abbrev Number: 13 (DW_TAG_subprogram)
    <a3b79>   DW_AT_external    : 1
    <a3b79>   DW_AT_name        : (indirect string, offset: 0x182e6): fb_GfxClear
    <a3b7d>   DW_AT_decl_file   : 6
    <a3b7d>   DW_AT_decl_line   : 495
    <a3b7f>   DW_AT_decl_column : 6
    <a3b80>   DW_AT_prototyped  : 1
    <a3b80>   DW_AT_declaration : 1
    <a3b80>   DW_AT_sibling     : <0xa3b8a>
 <2><a3b84>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b85>   DW_AT_type        : <0xa3355>
 <2><a3b89>: Abbrev Number: 0
 <1><a3b8a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <a3b8b>   DW_AT_external    : 1
    <a3b8b>   DW_AT_name        : (indirect string, offset: 0x17dac): fb_hGfxBox
    <a3b8f>   DW_AT_decl_file   : 6
    <a3b8f>   DW_AT_decl_line   : 415
    <a3b91>   DW_AT_decl_column : 13
    <a3b92>   DW_AT_prototyped  : 1
    <a3b92>   DW_AT_declaration : 1
    <a3b92>   DW_AT_sibling     : <0xa3bba>
 <2><a3b96>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b97>   DW_AT_type        : <0xa3355>
 <2><a3b9b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3b9c>   DW_AT_type        : <0xa3355>
 <2><a3ba0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3ba1>   DW_AT_type        : <0xa3355>
 <2><a3ba5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3ba6>   DW_AT_type        : <0xa3355>
 <2><a3baa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bab>   DW_AT_type        : <0xa3339>
 <2><a3baf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bb0>   DW_AT_type        : <0xa3355>
 <2><a3bb4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bb5>   DW_AT_type        : <0xa3339>
 <2><a3bb9>: Abbrev Number: 0
 <1><a3bba>: Abbrev Number: 36 (DW_TAG_subprogram)
    <a3bbb>   DW_AT_external    : 1
    <a3bbb>   DW_AT_name        : (indirect string, offset: 0x16da4): fb_hFixColor
    <a3bbf>   DW_AT_decl_file   : 6
    <a3bc0>   DW_AT_decl_line   : 405
    <a3bc2>   DW_AT_decl_column : 21
    <a3bc3>   DW_AT_prototyped  : 1
    <a3bc3>   DW_AT_type        : <0xa3339>
    <a3bc7>   DW_AT_declaration : 1
    <a3bc7>   DW_AT_sibling     : <0xa3bd6>
 <2><a3bcb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bcc>   DW_AT_type        : <0xa3355>
 <2><a3bd0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bd1>   DW_AT_type        : <0xa3339>
 <2><a3bd5>: Abbrev Number: 0
 <1><a3bd6>: Abbrev Number: 13 (DW_TAG_subprogram)
    <a3bd7>   DW_AT_external    : 1
    <a3bd7>   DW_AT_name        : (indirect string, offset: 0x17b97): fb_hFixCoordsOrder
    <a3bdb>   DW_AT_decl_file   : 6
    <a3bdb>   DW_AT_decl_line   : 413
    <a3bdd>   DW_AT_decl_column : 13
    <a3bde>   DW_AT_prototyped  : 1
    <a3bde>   DW_AT_declaration : 1
    <a3bde>   DW_AT_sibling     : <0xa3bf7>
 <2><a3be2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3be3>   DW_AT_type        : <0xa3494>
 <2><a3be7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3be8>   DW_AT_type        : <0xa3494>
 <2><a3bec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bed>   DW_AT_type        : <0xa3494>
 <2><a3bf1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3bf2>   DW_AT_type        : <0xa3494>
 <2><a3bf6>: Abbrev Number: 0
 <1><a3bf7>: Abbrev Number: 13 (DW_TAG_subprogram)
    <a3bf8>   DW_AT_external    : 1
    <a3bf8>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <a3bfc>   DW_AT_decl_file   : 6
    <a3bfc>   DW_AT_decl_line   : 410
    <a3bfe>   DW_AT_decl_column : 13
    <a3bff>   DW_AT_prototyped  : 1
    <a3bff>   DW_AT_declaration : 1
    <a3bff>   DW_AT_sibling     : <0xa3c0e>
 <2><a3c03>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3c04>   DW_AT_type        : <0xa3c0e>
 <2><a3c08>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3c09>   DW_AT_type        : <0xa3339>
 <2><a3c0d>: Abbrev Number: 0
 <1><a3c0e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a3c0f>   DW_AT_byte_size   : 8
    <a3c0f>   DW_AT_type        : <0xa378a>
 <1><a3c13>: Abbrev Number: 13 (DW_TAG_subprogram)
    <a3c14>   DW_AT_external    : 1
    <a3c14>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <a3c18>   DW_AT_decl_file   : 6
    <a3c18>   DW_AT_decl_line   : 409
    <a3c1a>   DW_AT_decl_column : 13
    <a3c1b>   DW_AT_prototyped  : 1
    <a3c1b>   DW_AT_declaration : 1
    <a3c1b>   DW_AT_sibling     : <0xa3c2a>
 <2><a3c1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3c20>   DW_AT_type        : <0xa3c0e>
 <2><a3c24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a3c25>   DW_AT_type        : <0xa336d>
 <2><a3c29>: Abbrev Number: 0
 <1><a3c2a>: Abbrev Number: 37 (DW_TAG_subprogram)
    <a3c2b>   DW_AT_external    : 1
    <a3c2b>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <a3c2f>   DW_AT_decl_file   : 6
    <a3c30>   DW_AT_decl_line   : 396
    <a3c32>   DW_AT_decl_column : 19
    <a3c33>   DW_AT_prototyped  : 1
    <a3c33>   DW_AT_type        : <0xa3c0e>
    <a3c37>   DW_AT_declaration : 1
 <1><a3c37>: Abbrev Number: 38 (DW_TAG_subprogram)
    <a3c38>   DW_AT_external    : 1
    <a3c38>   DW_AT_name        : (indirect string, offset: 0x18514): fb_GfxView
    <a3c3c>   DW_AT_decl_file   : 1
    <a3c3d>   DW_AT_decl_line   : 5
    <a3c3e>   DW_AT_decl_column : 13
    <a3c3f>   DW_AT_prototyped  : 1
    <a3c3f>   DW_AT_low_pc      : 0x4696c0
    <a3c47>   DW_AT_high_pc     : 0x23b
    <a3c4f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a3c51>   DW_AT_call_all_calls: 1
 <2><a3c51>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a3c52>   DW_AT_name        : x1
    <a3c55>   DW_AT_decl_file   : 1
    <a3c55>   DW_AT_decl_line   : 5
    <a3c55>   DW_AT_decl_column : 28
    <a3c56>   DW_AT_type        : <0xa3355>
    <a3c5a>   DW_AT_location    : 0x2fb40 (location list)
    <a3c5e>   DW_AT_GNU_locviews: 0x2fb3e
 <2><a3c62>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a3c63>   DW_AT_name        : y1
    <a3c66>   DW_AT_decl_file   : 1
    <a3c66>   DW_AT_decl_line   : 5
    <a3c66>   DW_AT_decl_column : 36
    <a3c67>   DW_AT_type        : <0xa3355>
    <a3c6b>   DW_AT_location    : 0x2fb48 (location list)
    <a3c6f>   DW_AT_GNU_locviews: 0x2fb46
 <2><a3c73>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a3c74>   DW_AT_name        : x2
    <a3c77>   DW_AT_decl_file   : 1
    <a3c77>   DW_AT_decl_line   : 5
    <a3c77>   DW_AT_decl_column : 44
    <a3c78>   DW_AT_type        : <0xa3355>
    <a3c7c>   DW_AT_location    : 0x2fb50 (location list)
    <a3c80>   DW_AT_GNU_locviews: 0x2fb4e
 <2><a3c84>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a3c85>   DW_AT_name        : y2
    <a3c88>   DW_AT_decl_file   : 1
    <a3c88>   DW_AT_decl_line   : 5
    <a3c88>   DW_AT_decl_column : 52
    <a3c89>   DW_AT_type        : <0xa3355>
    <a3c8d>   DW_AT_location    : 0x2fb58 (location list)
    <a3c91>   DW_AT_GNU_locviews: 0x2fb56
 <2><a3c95>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a3c96>   DW_AT_name        : (indirect string, offset: 0x1ac48): fill_color
    <a3c9a>   DW_AT_decl_file   : 1
    <a3c9a>   DW_AT_decl_line   : 5
    <a3c9a>   DW_AT_decl_column : 69
    <a3c9b>   DW_AT_type        : <0xa3339>
    <a3c9f>   DW_AT_location    : 0x2fb6a (location list)
    <a3ca3>   DW_AT_GNU_locviews: 0x2fb5e
 <2><a3ca7>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a3ca8>   DW_AT_name        : (indirect string, offset: 0x17fdc): border_color
    <a3cac>   DW_AT_decl_file   : 1
    <a3cac>   DW_AT_decl_line   : 5
    <a3cac>   DW_AT_decl_column : 94
    <a3cad>   DW_AT_type        : <0xa3339>
    <a3cb1>   DW_AT_location    : 0x2fba4 (location list)
    <a3cb5>   DW_AT_GNU_locviews: 0x2fb98
 <2><a3cb9>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <a3cba>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a3cbe>   DW_AT_decl_file   : 1
    <a3cbf>   DW_AT_decl_line   : 5
    <a3cc0>   DW_AT_decl_column : 112
    <a3cc1>   DW_AT_type        : <0xa3355>
    <a3cc5>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><a3cc8>: Abbrev Number: 27 (DW_TAG_variable)
    <a3cc9>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <a3ccd>   DW_AT_decl_file   : 1
    <a3ccd>   DW_AT_decl_line   : 7
    <a3cce>   DW_AT_decl_column : 13
    <a3ccf>   DW_AT_type        : <0xa3c0e>
    <a3cd3>   DW_AT_location    : 0x2fbd7 (location list)
    <a3cd7>   DW_AT_GNU_locviews: 0x2fbcf
 <2><a3cdb>: Abbrev Number: 27 (DW_TAG_variable)
    <a3cdc>   DW_AT_name        : (indirect string, offset: 0x1ac53): old_bg_color
    <a3ce0>   DW_AT_decl_file   : 1
    <a3ce0>   DW_AT_decl_line   : 8
    <a3ce1>   DW_AT_decl_column : 15
    <a3ce2>   DW_AT_type        : <0xa3339>
    <a3ce6>   DW_AT_location    : 0x2fbf3 (location list)
    <a3cea>   DW_AT_GNU_locviews: 0x2fbf1
 <2><a3cee>: Abbrev Number: 40 (DW_TAG_call_site)
    <a3cef>   DW_AT_call_return_pc: 0x4696f0
    <a3cf7>   DW_AT_call_origin : <0xa3c2a>
 <2><a3cfb>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3cfc>   DW_AT_call_return_pc: 0x4696fd
    <a3d04>   DW_AT_call_origin : <0xa3c13>
    <a3d08>   DW_AT_sibling     : <0xa3d18>
 <3><a3d0c>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d0d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a3d0f>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><a3d12>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d13>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a3d15>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a3d17>: Abbrev Number: 0
 <2><a3d18>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3d19>   DW_AT_call_return_pc: 0x469707
    <a3d21>   DW_AT_call_origin : <0xa3bf7>
    <a3d25>   DW_AT_sibling     : <0xa3d36>
 <3><a3d29>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d2a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a3d2c>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><a3d2f>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d30>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a3d32>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><a3d35>: Abbrev Number: 0
 <2><a3d36>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3d37>   DW_AT_call_return_pc: 0x46971e
    <a3d3f>   DW_AT_call_origin : <0xa3bd6>
    <a3d43>   DW_AT_sibling     : <0xa3d60>
 <3><a3d47>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d48>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a3d4a>   DW_AT_call_value  : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><a3d4d>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d4e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a3d50>   DW_AT_call_value  : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><a3d53>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d54>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <a3d56>   DW_AT_call_value  : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><a3d59>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d5a>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <a3d5c>   DW_AT_call_value  : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><a3d5f>: Abbrev Number: 0
 <2><a3d60>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3d61>   DW_AT_call_return_pc: 0x46986e
    <a3d69>   DW_AT_call_origin : <0xa3bba>
    <a3d6d>   DW_AT_sibling     : <0xa3d78>
 <3><a3d71>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d72>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a3d74>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><a3d77>: Abbrev Number: 0
 <2><a3d78>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3d79>   DW_AT_call_return_pc: 0x46987b
    <a3d81>   DW_AT_call_origin : <0xa3b78>
    <a3d85>   DW_AT_sibling     : <0xa3d8f>
 <3><a3d89>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3d8a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a3d8c>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><a3d8e>: Abbrev Number: 0
 <2><a3d8f>: Abbrev Number: 10 (DW_TAG_call_site)
    <a3d90>   DW_AT_call_return_pc: 0x46988a
    <a3d98>   DW_AT_call_origin : <0xa3bba>
    <a3d9c>   DW_AT_sibling     : <0xa3da7>
 <3><a3da0>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3da1>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a3da3>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><a3da6>: Abbrev Number: 0
 <2><a3da7>: Abbrev Number: 41 (DW_TAG_call_site)
    <a3da8>   DW_AT_call_return_pc: 0x4698d4
    <a3db0>   DW_AT_call_origin : <0xa3b8a>
 <3><a3db4>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <a3db5>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <a3db7>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a3db9>: Abbrev Number: 0
 <2><a3dba>: Abbrev Number: 0
 <1><a3dbb>: Abbrev Number: 0
  Compilation Unit @ offset 0xa3dbc:
   Length:        0x19f0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x92c7
   Pointer Size:  8
 <0><a3dc8>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <a3dc9>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <a3dcd>   DW_AT_language    : 29	(C11)
    <a3dce>   DW_AT_name        : (indirect line string, offset: 0xa7a): src/gfxlib2/gfx_blitter.c
    <a3dd2>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <a3dd6>   DW_AT_low_pc      : 0x469900
    <a3dde>   DW_AT_high_pc     : 0x2d21
    <a3de6>   DW_AT_stmt_list   : 0x5e286
 <1><a3dea>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3deb>   DW_AT_byte_size   : 1
    <a3dec>   DW_AT_encoding    : 8	(unsigned char)
    <a3ded>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><a3df1>: Abbrev Number: 16 (DW_TAG_const_type)
    <a3df2>   DW_AT_type        : <0xa3dea>
 <1><a3df6>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3df7>   DW_AT_byte_size   : 2
    <a3df8>   DW_AT_encoding    : 7	(unsigned)
    <a3df9>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><a3dfd>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3dfe>   DW_AT_byte_size   : 4
    <a3dff>   DW_AT_encoding    : 7	(unsigned)
    <a3e00>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><a3e04>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e05>   DW_AT_byte_size   : 8
    <a3e06>   DW_AT_encoding    : 7	(unsigned)
    <a3e07>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><a3e0b>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e0c>   DW_AT_byte_size   : 1
    <a3e0d>   DW_AT_encoding    : 6	(signed char)
    <a3e0e>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><a3e12>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e13>   DW_AT_byte_size   : 2
    <a3e14>   DW_AT_encoding    : 5	(signed)
    <a3e15>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><a3e19>: Abbrev Number: 28 (DW_TAG_base_type)
    <a3e1a>   DW_AT_byte_size   : 4
    <a3e1b>   DW_AT_encoding    : 5	(signed)
    <a3e1c>   DW_AT_name        : int
 <1><a3e20>: Abbrev Number: 29 (DW_TAG_volatile_type)
    <a3e21>   DW_AT_type        : <0xa3e19>
 <1><a3e25>: Abbrev Number: 16 (DW_TAG_const_type)
    <a3e26>   DW_AT_type        : <0xa3e19>
 <1><a3e2a>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e2b>   DW_AT_byte_size   : 8
    <a3e2c>   DW_AT_encoding    : 5	(signed)
    <a3e2d>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><a3e31>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <a3e32>   DW_AT_byte_size   : 8
 <1><a3e33>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3e34>   DW_AT_byte_size   : 8
    <a3e34>   DW_AT_type        : <0xa3e38>
 <1><a3e38>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e39>   DW_AT_byte_size   : 1
    <a3e3a>   DW_AT_encoding    : 6	(signed char)
    <a3e3b>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><a3e3f>: Abbrev Number: 15 (DW_TAG_typedef)
    <a3e40>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <a3e44>   DW_AT_decl_file   : 2
    <a3e45>   DW_AT_decl_line   : 209
    <a3e46>   DW_AT_decl_column : 23
    <a3e47>   DW_AT_type        : <0xa3e04>
 <1><a3e4b>: Abbrev Number: 31 (DW_TAG_typedef)
    <a3e4c>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <a3e50>   DW_AT_decl_file   : 2
    <a3e51>   DW_AT_decl_line   : 321
    <a3e53>   DW_AT_decl_column : 24
    <a3e54>   DW_AT_type        : <0xa3e19>
 <1><a3e58>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e59>   DW_AT_byte_size   : 8
    <a3e5a>   DW_AT_encoding    : 5	(signed)
    <a3e5b>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><a3e5f>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e60>   DW_AT_byte_size   : 8
    <a3e61>   DW_AT_encoding    : 7	(unsigned)
    <a3e62>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><a3e66>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3e67>   DW_AT_byte_size   : 8
    <a3e67>   DW_AT_type        : <0xa3e6b>
 <1><a3e6b>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><a3e6c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3e6d>   DW_AT_byte_size   : 8
    <a3e6d>   DW_AT_type        : <0xa3e71>
 <1><a3e71>: Abbrev Number: 33 (DW_TAG_subroutine_type)
    <a3e72>   DW_AT_prototyped  : 1
 <1><a3e72>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e73>   DW_AT_byte_size   : 8
    <a3e74>   DW_AT_encoding    : 4	(float)
    <a3e75>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><a3e79>: Abbrev Number: 10 (DW_TAG_base_type)
    <a3e7a>   DW_AT_byte_size   : 4
    <a3e7b>   DW_AT_encoding    : 4	(float)
    <a3e7c>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><a3e80>: Abbrev Number: 15 (DW_TAG_typedef)
    <a3e81>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <a3e85>   DW_AT_decl_file   : 3
    <a3e86>   DW_AT_decl_line   : 7
    <a3e87>   DW_AT_decl_column : 25
    <a3e88>   DW_AT_type        : <0xa3e8c>
 <1><a3e8c>: Abbrev Number: 34 (DW_TAG_structure_type)
    <a3e8d>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <a3e91>   DW_AT_declaration : 1
 <1><a3e91>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a3e92>   DW_AT_byte_size   : 8
    <a3e93>   DW_AT_decl_file   : 4
    <a3e93>   DW_AT_decl_line   : 4
    <a3e94>   DW_AT_decl_column : 3
    <a3e94>   DW_AT_sibling     : <0xa3eb3>
 <2><a3e98>: Abbrev Number: 3 (DW_TAG_member)
    <a3e99>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <a3e9d>   DW_AT_decl_file   : 4
    <a3e9e>   DW_AT_decl_line   : 5
    <a3e9f>   DW_AT_decl_column : 8
    <a3ea0>   DW_AT_type        : <0xa3e19>
    <a3ea4>   DW_AT_data_member_location: 0
 <2><a3ea5>: Abbrev Number: 3 (DW_TAG_member)
    <a3ea6>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <a3eaa>   DW_AT_decl_file   : 4
    <a3eab>   DW_AT_decl_line   : 6
    <a3eac>   DW_AT_decl_column : 8
    <a3ead>   DW_AT_type        : <0xa3e19>
    <a3eb1>   DW_AT_data_member_location: 4
 <2><a3eb2>: Abbrev Number: 0
 <1><a3eb3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a3eb4>   DW_AT_byte_size   : 16
    <a3eb5>   DW_AT_decl_file   : 4
    <a3eb5>   DW_AT_decl_line   : 8
    <a3eb6>   DW_AT_decl_column : 3
    <a3eb6>   DW_AT_sibling     : <0xa3ee9>
 <2><a3eba>: Abbrev Number: 11 (DW_TAG_member)
    <a3ebb>   DW_AT_name        : x
    <a3ebd>   DW_AT_decl_file   : 4
    <a3ebe>   DW_AT_decl_line   : 9
    <a3ebf>   DW_AT_decl_column : 8
    <a3ec0>   DW_AT_type        : <0xa3e19>
    <a3ec4>   DW_AT_data_member_location: 0
 <2><a3ec5>: Abbrev Number: 11 (DW_TAG_member)
    <a3ec6>   DW_AT_name        : y
    <a3ec8>   DW_AT_decl_file   : 4
    <a3ec9>   DW_AT_decl_line   : 9
    <a3eca>   DW_AT_decl_column : 11
    <a3ecb>   DW_AT_type        : <0xa3e19>
    <a3ecf>   DW_AT_data_member_location: 4
 <2><a3ed0>: Abbrev Number: 11 (DW_TAG_member)
    <a3ed1>   DW_AT_name        : dx
    <a3ed4>   DW_AT_decl_file   : 4
    <a3ed5>   DW_AT_decl_line   : 10
    <a3ed6>   DW_AT_decl_column : 8
    <a3ed7>   DW_AT_type        : <0xa3e19>
    <a3edb>   DW_AT_data_member_location: 8
 <2><a3edc>: Abbrev Number: 11 (DW_TAG_member)
    <a3edd>   DW_AT_name        : dy
    <a3ee0>   DW_AT_decl_file   : 4
    <a3ee1>   DW_AT_decl_line   : 10
    <a3ee2>   DW_AT_decl_column : 12
    <a3ee3>   DW_AT_type        : <0xa3e19>
    <a3ee7>   DW_AT_data_member_location: 12
 <2><a3ee8>: Abbrev Number: 0
 <1><a3ee9>: Abbrev Number: 35 (DW_TAG_union_type)
    <a3eea>   DW_AT_byte_size   : 16
    <a3eeb>   DW_AT_decl_file   : 4
    <a3eec>   DW_AT_decl_line   : 3
    <a3eed>   DW_AT_decl_column : 2
    <a3eee>   DW_AT_sibling     : <0xa3f19>
 <2><a3ef2>: Abbrev Number: 22 (DW_TAG_member)
    <a3ef3>   DW_AT_type        : <0xa3e91>
 <2><a3ef7>: Abbrev Number: 22 (DW_TAG_member)
    <a3ef8>   DW_AT_type        : <0xa3eb3>
 <2><a3efc>: Abbrev Number: 36 (DW_TAG_member)
    <a3efd>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <a3f01>   DW_AT_decl_file   : 4
    <a3f02>   DW_AT_decl_line   : 12
    <a3f03>   DW_AT_decl_column : 7
    <a3f04>   DW_AT_type        : <0xa3e19>
 <2><a3f08>: Abbrev Number: 23 (DW_TAG_member)
    <a3f09>   DW_AT_name        : z
    <a3f0b>   DW_AT_decl_file   : 4
    <a3f0b>   DW_AT_decl_line   : 13
    <a3f0c>   DW_AT_decl_column : 7
    <a3f0c>   DW_AT_type        : <0xa3e19>
 <2><a3f10>: Abbrev Number: 23 (DW_TAG_member)
    <a3f11>   DW_AT_name        : w
    <a3f13>   DW_AT_decl_file   : 4
    <a3f13>   DW_AT_decl_line   : 14
    <a3f14>   DW_AT_decl_column : 7
    <a3f14>   DW_AT_type        : <0xa3e19>
 <2><a3f18>: Abbrev Number: 0
 <1><a3f19>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a3f1a>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <a3f1e>   DW_AT_byte_size   : 20
    <a3f1f>   DW_AT_decl_file   : 4
    <a3f20>   DW_AT_decl_line   : 1
    <a3f21>   DW_AT_decl_column : 8
    <a3f22>   DW_AT_sibling     : <0xa3f3a>
 <2><a3f26>: Abbrev Number: 3 (DW_TAG_member)
    <a3f27>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <a3f2b>   DW_AT_decl_file   : 4
    <a3f2c>   DW_AT_decl_line   : 2
    <a3f2d>   DW_AT_decl_column : 6
    <a3f2e>   DW_AT_type        : <0xa3e19>
    <a3f32>   DW_AT_data_member_location: 0
 <2><a3f33>: Abbrev Number: 37 (DW_TAG_member)
    <a3f34>   DW_AT_type        : <0xa3ee9>
    <a3f38>   DW_AT_data_member_location: 4
 <2><a3f39>: Abbrev Number: 0
 <1><a3f3a>: Abbrev Number: 15 (DW_TAG_typedef)
    <a3f3b>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <a3f3f>   DW_AT_decl_file   : 4
    <a3f40>   DW_AT_decl_line   : 18
    <a3f41>   DW_AT_decl_column : 23
    <a3f42>   DW_AT_type        : <0xa3f19>
 <1><a3f46>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f47>   DW_AT_byte_size   : 8
    <a3f47>   DW_AT_type        : <0xa3f4b>
 <1><a3f4b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <a3f4c>   DW_AT_prototyped  : 1
    <a3f4c>   DW_AT_type        : <0xa3e19>
    <a3f50>   DW_AT_sibling     : <0xa3f5f>
 <2><a3f54>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f55>   DW_AT_type        : <0xa3e19>
 <2><a3f59>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f5a>   DW_AT_type        : <0xa3e19>
 <2><a3f5e>: Abbrev Number: 0
 <1><a3f5f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f60>   DW_AT_byte_size   : 8
    <a3f60>   DW_AT_type        : <0xa3e19>
 <1><a3f64>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f65>   DW_AT_byte_size   : 8
    <a3f65>   DW_AT_type        : <0xa3f69>
 <1><a3f69>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <a3f6a>   DW_AT_prototyped  : 1
    <a3f6a>   DW_AT_type        : <0xa3e19>
    <a3f6e>   DW_AT_sibling     : <0xa3f8c>
 <2><a3f72>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f73>   DW_AT_type        : <0xa3f5f>
 <2><a3f77>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f78>   DW_AT_type        : <0xa3f5f>
 <2><a3f7c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f7d>   DW_AT_type        : <0xa3f5f>
 <2><a3f81>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f82>   DW_AT_type        : <0xa3f5f>
 <2><a3f86>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3f87>   DW_AT_type        : <0xa3f5f>
 <2><a3f8b>: Abbrev Number: 0
 <1><a3f8c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f8d>   DW_AT_byte_size   : 8
    <a3f8d>   DW_AT_type        : <0xa3f3a>
 <1><a3f91>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f92>   DW_AT_byte_size   : 8
    <a3f92>   DW_AT_type        : <0xa3dea>
 <1><a3f96>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3f97>   DW_AT_byte_size   : 8
    <a3f97>   DW_AT_type        : <0xa3f91>
 <1><a3f9b>: Abbrev Number: 15 (DW_TAG_typedef)
    <a3f9c>   DW_AT_name        : (indirect string, offset: 0x19e73): BLITTER
    <a3fa0>   DW_AT_decl_file   : 5
    <a3fa1>   DW_AT_decl_line   : 137
    <a3fa2>   DW_AT_decl_column : 15
    <a3fa3>   DW_AT_type        : <0xa3fa7>
 <1><a3fa7>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <a3fa8>   DW_AT_prototyped  : 1
    <a3fa8>   DW_AT_sibling     : <0xa3fb7>
 <2><a3fac>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3fad>   DW_AT_type        : <0xa3f91>
 <2><a3fb1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3fb2>   DW_AT_type        : <0xa3e19>
 <2><a3fb6>: Abbrev Number: 0
 <1><a3fb7>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a3fb8>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <a3fbc>   DW_AT_byte_size   : 12
    <a3fbd>   DW_AT_decl_file   : 5
    <a3fbe>   DW_AT_decl_line   : 139
    <a3fbf>   DW_AT_decl_column : 16
    <a3fc0>   DW_AT_sibling     : <0xa3fe9>
 <2><a3fc4>: Abbrev Number: 11 (DW_TAG_member)
    <a3fc5>   DW_AT_name        : ch
    <a3fc8>   DW_AT_decl_file   : 5
    <a3fc9>   DW_AT_decl_line   : 140
    <a3fca>   DW_AT_decl_column : 14
    <a3fcb>   DW_AT_type        : <0xa3e4b>
    <a3fcf>   DW_AT_data_member_location: 0
 <2><a3fd0>: Abbrev Number: 11 (DW_TAG_member)
    <a3fd1>   DW_AT_name        : fg
    <a3fd4>   DW_AT_decl_file   : 5
    <a3fd5>   DW_AT_decl_line   : 141
    <a3fd6>   DW_AT_decl_column : 14
    <a3fd7>   DW_AT_type        : <0xa3dfd>
    <a3fdb>   DW_AT_data_member_location: 4
 <2><a3fdc>: Abbrev Number: 11 (DW_TAG_member)
    <a3fdd>   DW_AT_name        : bg
    <a3fe0>   DW_AT_decl_file   : 5
    <a3fe1>   DW_AT_decl_line   : 141
    <a3fe2>   DW_AT_decl_column : 18
    <a3fe3>   DW_AT_type        : <0xa3dfd>
    <a3fe7>   DW_AT_data_member_location: 8
 <2><a3fe8>: Abbrev Number: 0
 <1><a3fe9>: Abbrev Number: 15 (DW_TAG_typedef)
    <a3fea>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <a3fee>   DW_AT_decl_file   : 5
    <a3fef>   DW_AT_decl_line   : 142
    <a3ff0>   DW_AT_decl_column : 3
    <a3ff1>   DW_AT_type        : <0xa3fb7>
 <1><a3ff5>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a3ff6>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a3ffa>   DW_AT_byte_size   : 208
    <a3ffb>   DW_AT_decl_file   : 5
    <a3ffc>   DW_AT_decl_line   : 144
    <a3ffd>   DW_AT_decl_column : 16
    <a3ffe>   DW_AT_sibling     : <0xa41b8>
 <2><a4002>: Abbrev Number: 11 (DW_TAG_member)
    <a4003>   DW_AT_name        : id
    <a4006>   DW_AT_decl_file   : 5
    <a4007>   DW_AT_decl_line   : 146
    <a4008>   DW_AT_decl_column : 6
    <a4009>   DW_AT_type        : <0xa3e19>
    <a400d>   DW_AT_data_member_location: 0
 <2><a400e>: Abbrev Number: 3 (DW_TAG_member)
    <a400f>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <a4013>   DW_AT_decl_file   : 5
    <a4014>   DW_AT_decl_line   : 147
    <a4015>   DW_AT_decl_column : 9
    <a4016>   DW_AT_type        : <0xa3e19>
    <a401a>   DW_AT_data_member_location: 4
 <2><a401b>: Abbrev Number: 3 (DW_TAG_member)
    <a401c>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <a4020>   DW_AT_decl_file   : 5
    <a4021>   DW_AT_decl_line   : 148
    <a4022>   DW_AT_decl_column : 21
    <a4023>   DW_AT_type        : <0xa3f96>
    <a4027>   DW_AT_data_member_location: 8
 <2><a4028>: Abbrev Number: 3 (DW_TAG_member)
    <a4029>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <a402d>   DW_AT_decl_file   : 5
    <a402e>   DW_AT_decl_line   : 149
    <a402f>   DW_AT_decl_column : 9
    <a4030>   DW_AT_type        : <0xa3e19>
    <a4034>   DW_AT_data_member_location: 16
 <2><a4035>: Abbrev Number: 3 (DW_TAG_member)
    <a4036>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <a403a>   DW_AT_decl_file   : 5
    <a403b>   DW_AT_decl_line   : 150
    <a403c>   DW_AT_decl_column : 9
    <a403d>   DW_AT_type        : <0xa3e19>
    <a4041>   DW_AT_data_member_location: 20
 <2><a4042>: Abbrev Number: 3 (DW_TAG_member)
    <a4043>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <a4047>   DW_AT_decl_file   : 5
    <a4048>   DW_AT_decl_line   : 151
    <a4049>   DW_AT_decl_column : 20
    <a404a>   DW_AT_type        : <0xa3f91>
    <a404e>   DW_AT_data_member_location: 24
 <2><a404f>: Abbrev Number: 11 (DW_TAG_member)
    <a4050>   DW_AT_name        : w
    <a4052>   DW_AT_decl_file   : 5
    <a4053>   DW_AT_decl_line   : 152
    <a4054>   DW_AT_decl_column : 9
    <a4055>   DW_AT_type        : <0xa3e19>
    <a4059>   DW_AT_data_member_location: 32
 <2><a405a>: Abbrev Number: 11 (DW_TAG_member)
    <a405b>   DW_AT_name        : h
    <a405d>   DW_AT_decl_file   : 5
    <a405e>   DW_AT_decl_line   : 152
    <a405f>   DW_AT_decl_column : 12
    <a4060>   DW_AT_type        : <0xa3e19>
    <a4064>   DW_AT_data_member_location: 36
 <2><a4065>: Abbrev Number: 3 (DW_TAG_member)
    <a4066>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <a406a>   DW_AT_decl_file   : 5
    <a406b>   DW_AT_decl_line   : 153
    <a406c>   DW_AT_decl_column : 9
    <a406d>   DW_AT_type        : <0xa3e19>
    <a4071>   DW_AT_data_member_location: 40
 <2><a4072>: Abbrev Number: 11 (DW_TAG_member)
    <a4073>   DW_AT_name        : bpp
    <a4077>   DW_AT_decl_file   : 5
    <a4078>   DW_AT_decl_line   : 154
    <a4079>   DW_AT_decl_column : 9
    <a407a>   DW_AT_type        : <0xa3e19>
    <a407e>   DW_AT_data_member_location: 44
 <2><a407f>: Abbrev Number: 3 (DW_TAG_member)
    <a4080>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a4084>   DW_AT_decl_file   : 5
    <a4085>   DW_AT_decl_line   : 155
    <a4086>   DW_AT_decl_column : 9
    <a4087>   DW_AT_type        : <0xa3e19>
    <a408b>   DW_AT_data_member_location: 48
 <2><a408c>: Abbrev Number: 3 (DW_TAG_member)
    <a408d>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <a4091>   DW_AT_decl_file   : 5
    <a4092>   DW_AT_decl_line   : 156
    <a4093>   DW_AT_decl_column : 19
    <a4094>   DW_AT_type        : <0xa41b8>
    <a4098>   DW_AT_data_member_location: 56
 <2><a4099>: Abbrev Number: 3 (DW_TAG_member)
    <a409a>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <a409e>   DW_AT_decl_file   : 5
    <a409f>   DW_AT_decl_line   : 157
    <a40a0>   DW_AT_decl_column : 19
    <a40a1>   DW_AT_type        : <0xa41b8>
    <a40a5>   DW_AT_data_member_location: 64
 <2><a40a6>: Abbrev Number: 3 (DW_TAG_member)
    <a40a7>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <a40ab>   DW_AT_decl_file   : 5
    <a40ac>   DW_AT_decl_line   : 158
    <a40ad>   DW_AT_decl_column : 20
    <a40ae>   DW_AT_type        : <0xa3f91>
    <a40b2>   DW_AT_data_member_location: 72
 <2><a40b3>: Abbrev Number: 3 (DW_TAG_member)
    <a40b4>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a40b8>   DW_AT_decl_file   : 5
    <a40b9>   DW_AT_decl_line   : 159
    <a40ba>   DW_AT_decl_column : 11
    <a40bb>   DW_AT_type        : <0xa3e33>
    <a40bf>   DW_AT_data_member_location: 80
 <2><a40c0>: Abbrev Number: 3 (DW_TAG_member)
    <a40c1>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <a40c5>   DW_AT_decl_file   : 5
    <a40c6>   DW_AT_decl_line   : 160
    <a40c7>   DW_AT_decl_column : 29
    <a40c8>   DW_AT_type        : <0xa4286>
    <a40cc>   DW_AT_data_member_location: 88
 <2><a40cd>: Abbrev Number: 3 (DW_TAG_member)
    <a40ce>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <a40d2>   DW_AT_decl_file   : 5
    <a40d3>   DW_AT_decl_line   : 161
    <a40d4>   DW_AT_decl_column : 9
    <a40d5>   DW_AT_type        : <0xa3e19>
    <a40d9>   DW_AT_data_member_location: 96
 <2><a40da>: Abbrev Number: 3 (DW_TAG_member)
    <a40db>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <a40df>   DW_AT_decl_file   : 5
    <a40e0>   DW_AT_decl_line   : 162
    <a40e1>   DW_AT_decl_column : 27
    <a40e2>   DW_AT_type        : <0xa42b6>
    <a40e6>   DW_AT_data_member_location: 104
 <2><a40e7>: Abbrev Number: 3 (DW_TAG_member)
    <a40e8>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <a40ec>   DW_AT_decl_file   : 5
    <a40ed>   DW_AT_decl_line   : 163
    <a40ee>   DW_AT_decl_column : 9
    <a40ef>   DW_AT_type        : <0xa3e19>
    <a40f3>   DW_AT_data_member_location: 112
 <2><a40f4>: Abbrev Number: 3 (DW_TAG_member)
    <a40f5>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <a40f9>   DW_AT_decl_file   : 5
    <a40fa>   DW_AT_decl_line   : 164
    <a40fb>   DW_AT_decl_column : 9
    <a40fc>   DW_AT_type        : <0xa3e19>
    <a4100>   DW_AT_data_member_location: 116
 <2><a4101>: Abbrev Number: 3 (DW_TAG_member)
    <a4102>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <a4106>   DW_AT_decl_file   : 5
    <a4107>   DW_AT_decl_line   : 164
    <a4108>   DW_AT_decl_column : 19
    <a4109>   DW_AT_type        : <0xa3e19>
    <a410d>   DW_AT_data_member_location: 120
 <2><a410e>: Abbrev Number: 3 (DW_TAG_member)
    <a410f>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <a4113>   DW_AT_decl_file   : 5
    <a4114>   DW_AT_decl_line   : 165
    <a4115>   DW_AT_decl_column : 24
    <a4116>   DW_AT_type        : <0xa42ed>
    <a411a>   DW_AT_data_member_location: 128
 <2><a411b>: Abbrev Number: 3 (DW_TAG_member)
    <a411c>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <a4120>   DW_AT_decl_file   : 5
    <a4121>   DW_AT_decl_line   : 166
    <a4122>   DW_AT_decl_column : 9
    <a4123>   DW_AT_type        : <0xa3e19>
    <a4127>   DW_AT_data_member_location: 136
 <2><a4128>: Abbrev Number: 3 (DW_TAG_member)
    <a4129>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <a412d>   DW_AT_decl_file   : 5
    <a412e>   DW_AT_decl_line   : 166
    <a412f>   DW_AT_decl_column : 17
    <a4130>   DW_AT_type        : <0xa3e19>
    <a4134>   DW_AT_data_member_location: 140
 <2><a4135>: Abbrev Number: 3 (DW_TAG_member)
    <a4136>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <a413a>   DW_AT_decl_file   : 5
    <a413b>   DW_AT_decl_line   : 167
    <a413c>   DW_AT_decl_column : 11
    <a413d>   DW_AT_type        : <0xa3e79>
    <a4141>   DW_AT_data_member_location: 144
 <2><a4142>: Abbrev Number: 11 (DW_TAG_member)
    <a4143>   DW_AT_name        : key
    <a4147>   DW_AT_decl_file   : 5
    <a4148>   DW_AT_decl_line   : 168
    <a4149>   DW_AT_decl_column : 11
    <a414a>   DW_AT_type        : <0xa3e33>
    <a414e>   DW_AT_data_member_location: 152
 <2><a414f>: Abbrev Number: 3 (DW_TAG_member)
    <a4150>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <a4154>   DW_AT_decl_file   : 5
    <a4155>   DW_AT_decl_line   : 169
    <a4156>   DW_AT_decl_column : 6
    <a4157>   DW_AT_type        : <0xa3e19>
    <a415b>   DW_AT_data_member_location: 160
 <2><a415c>: Abbrev Number: 3 (DW_TAG_member)
    <a415d>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <a4161>   DW_AT_decl_file   : 5
    <a4162>   DW_AT_decl_line   : 170
    <a4163>   DW_AT_decl_column : 18
    <a4164>   DW_AT_type        : <0xa42f2>
    <a4168>   DW_AT_data_member_location: 168
 <2><a4169>: Abbrev Number: 3 (DW_TAG_member)
    <a416a>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <a416e>   DW_AT_decl_file   : 5
    <a416f>   DW_AT_decl_line   : 171
    <a4170>   DW_AT_decl_column : 12
    <a4171>   DW_AT_type        : <0xa3f8c>
    <a4175>   DW_AT_data_member_location: 176
 <2><a4176>: Abbrev Number: 3 (DW_TAG_member)
    <a4177>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <a417b>   DW_AT_decl_file   : 5
    <a417c>   DW_AT_decl_line   : 172
    <a417d>   DW_AT_decl_column : 9
    <a417e>   DW_AT_type        : <0xa3e19>
    <a4182>   DW_AT_data_member_location: 184
 <2><a4183>: Abbrev Number: 3 (DW_TAG_member)
    <a4184>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <a4188>   DW_AT_decl_file   : 5
    <a4189>   DW_AT_decl_line   : 172
    <a418a>   DW_AT_decl_column : 21
    <a418b>   DW_AT_type        : <0xa3e19>
    <a418f>   DW_AT_data_member_location: 188
 <2><a4190>: Abbrev Number: 3 (DW_TAG_member)
    <a4191>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <a4195>   DW_AT_decl_file   : 5
    <a4196>   DW_AT_decl_line   : 173
    <a4197>   DW_AT_decl_column : 11
    <a4198>   DW_AT_type        : <0xa42fc>
    <a419c>   DW_AT_data_member_location: 192
 <2><a419d>: Abbrev Number: 3 (DW_TAG_member)
    <a419e>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a41a2>   DW_AT_decl_file   : 5
    <a41a3>   DW_AT_decl_line   : 174
    <a41a4>   DW_AT_decl_column : 15
    <a41a5>   DW_AT_type        : <0xa3e20>
    <a41a9>   DW_AT_data_member_location: 200
 <2><a41aa>: Abbrev Number: 3 (DW_TAG_member)
    <a41ab>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <a41af>   DW_AT_decl_file   : 5
    <a41b0>   DW_AT_decl_line   : 175
    <a41b1>   DW_AT_decl_column : 6
    <a41b2>   DW_AT_type        : <0xa3e19>
    <a41b6>   DW_AT_data_member_location: 204
 <2><a41b7>: Abbrev Number: 0
 <1><a41b8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a41b9>   DW_AT_byte_size   : 8
    <a41b9>   DW_AT_type        : <0xa3dfd>
 <1><a41bd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a41be>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <a41c2>   DW_AT_byte_size   : 112
    <a41c3>   DW_AT_decl_file   : 5
    <a41c4>   DW_AT_decl_line   : 178
    <a41c5>   DW_AT_decl_column : 16
    <a41c6>   DW_AT_sibling     : <0xa4281>
 <2><a41ca>: Abbrev Number: 3 (DW_TAG_member)
    <a41cb>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <a41cf>   DW_AT_decl_file   : 5
    <a41d0>   DW_AT_decl_line   : 188
    <a41d1>   DW_AT_decl_column : 8
    <a41d2>   DW_AT_type        : <0xa3e33>
    <a41d6>   DW_AT_data_member_location: 0
 <2><a41d7>: Abbrev Number: 3 (DW_TAG_member)
    <a41d8>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <a41dc>   DW_AT_decl_file   : 5
    <a41dd>   DW_AT_decl_line   : 208
    <a41de>   DW_AT_decl_column : 8
    <a41df>   DW_AT_type        : <0xa4335>
    <a41e3>   DW_AT_data_member_location: 8
 <2><a41e4>: Abbrev Number: 3 (DW_TAG_member)
    <a41e5>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <a41e9>   DW_AT_decl_file   : 5
    <a41ea>   DW_AT_decl_line   : 222
    <a41eb>   DW_AT_decl_column : 9
    <a41ec>   DW_AT_type        : <0xa3e6c>
    <a41f0>   DW_AT_data_member_location: 16
 <2><a41f1>: Abbrev Number: 3 (DW_TAG_member)
    <a41f2>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <a41f6>   DW_AT_decl_file   : 5
    <a41f7>   DW_AT_decl_line   : 231
    <a41f8>   DW_AT_decl_column : 9
    <a41f9>   DW_AT_type        : <0xa3e6c>
    <a41fd>   DW_AT_data_member_location: 24
 <2><a41fe>: Abbrev Number: 3 (DW_TAG_member)
    <a41ff>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <a4203>   DW_AT_decl_file   : 5
    <a4204>   DW_AT_decl_line   : 239
    <a4205>   DW_AT_decl_column : 9
    <a4206>   DW_AT_type        : <0xa3e6c>
    <a420a>   DW_AT_data_member_location: 32
 <2><a420b>: Abbrev Number: 3 (DW_TAG_member)
    <a420c>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <a4210>   DW_AT_decl_file   : 5
    <a4211>   DW_AT_decl_line   : 248
    <a4212>   DW_AT_decl_column : 9
    <a4213>   DW_AT_type        : <0xa4354>
    <a4217>   DW_AT_data_member_location: 40
 <2><a4218>: Abbrev Number: 12 (DW_TAG_member)
    <a4219>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <a421d>   DW_AT_decl_file   : 5
    <a421d>   DW_AT_decl_line   : 258
    <a421f>   DW_AT_decl_column : 9
    <a4220>   DW_AT_type        : <0xa3e6c>
    <a4224>   DW_AT_data_member_location: 48
 <2><a4225>: Abbrev Number: 12 (DW_TAG_member)
    <a4226>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <a422a>   DW_AT_decl_file   : 5
    <a422a>   DW_AT_decl_line   : 274
    <a422c>   DW_AT_decl_column : 8
    <a422d>   DW_AT_type        : <0xa3f64>
    <a4231>   DW_AT_data_member_location: 56
 <2><a4232>: Abbrev Number: 12 (DW_TAG_member)
    <a4233>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <a4237>   DW_AT_decl_file   : 5
    <a4237>   DW_AT_decl_line   : 285
    <a4239>   DW_AT_decl_column : 9
    <a423a>   DW_AT_type        : <0xa4354>
    <a423e>   DW_AT_data_member_location: 64
 <2><a423f>: Abbrev Number: 12 (DW_TAG_member)
    <a4240>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <a4244>   DW_AT_decl_file   : 5
    <a4244>   DW_AT_decl_line   : 293
    <a4246>   DW_AT_decl_column : 9
    <a4247>   DW_AT_type        : <0xa4364>
    <a424b>   DW_AT_data_member_location: 72
 <2><a424c>: Abbrev Number: 12 (DW_TAG_member)
    <a424d>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <a4251>   DW_AT_decl_file   : 5
    <a4251>   DW_AT_decl_line   : 301
    <a4253>   DW_AT_decl_column : 8
    <a4254>   DW_AT_type        : <0xa3f46>
    <a4258>   DW_AT_data_member_location: 80
 <2><a4259>: Abbrev Number: 12 (DW_TAG_member)
    <a425a>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <a425e>   DW_AT_decl_file   : 5
    <a425e>   DW_AT_decl_line   : 314
    <a4260>   DW_AT_decl_column : 9
    <a4261>   DW_AT_type        : <0xa437d>
    <a4265>   DW_AT_data_member_location: 88
 <2><a4266>: Abbrev Number: 12 (DW_TAG_member)
    <a4267>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <a426b>   DW_AT_decl_file   : 5
    <a426b>   DW_AT_decl_line   : 321
    <a426d>   DW_AT_decl_column : 9
    <a426e>   DW_AT_type        : <0xa3e6c>
    <a4272>   DW_AT_data_member_location: 96
 <2><a4273>: Abbrev Number: 12 (DW_TAG_member)
    <a4274>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <a4278>   DW_AT_decl_file   : 5
    <a4278>   DW_AT_decl_line   : 328
    <a427a>   DW_AT_decl_column : 9
    <a427b>   DW_AT_type        : <0xa3e6c>
    <a427f>   DW_AT_data_member_location: 104
 <2><a4280>: Abbrev Number: 0
 <1><a4281>: Abbrev Number: 16 (DW_TAG_const_type)
    <a4282>   DW_AT_type        : <0xa41bd>
 <1><a4286>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4287>   DW_AT_byte_size   : 8
    <a4287>   DW_AT_type        : <0xa4281>
 <1><a428b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a428c>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <a4290>   DW_AT_byte_size   : 16
    <a4290>   DW_AT_decl_file   : 5
    <a4290>   DW_AT_decl_line   : 331
    <a4292>   DW_AT_decl_column : 16
    <a4292>   DW_AT_sibling     : <0xa42b1>
 <2><a4296>: Abbrev Number: 12 (DW_TAG_member)
    <a4297>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <a429b>   DW_AT_decl_file   : 5
    <a429b>   DW_AT_decl_line   : 333
    <a429d>   DW_AT_decl_column : 12
    <a429e>   DW_AT_type        : <0xa3e25>
    <a42a2>   DW_AT_data_member_location: 0
 <2><a42a3>: Abbrev Number: 12 (DW_TAG_member)
    <a42a4>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a42a8>   DW_AT_decl_file   : 5
    <a42a8>   DW_AT_decl_line   : 334
    <a42aa>   DW_AT_decl_column : 23
    <a42ab>   DW_AT_type        : <0xa4382>
    <a42af>   DW_AT_data_member_location: 8
 <2><a42b0>: Abbrev Number: 0
 <1><a42b1>: Abbrev Number: 16 (DW_TAG_const_type)
    <a42b2>   DW_AT_type        : <0xa428b>
 <1><a42b6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a42b7>   DW_AT_byte_size   : 8
    <a42b7>   DW_AT_type        : <0xa42b1>
 <1><a42bb>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a42bc>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <a42c0>   DW_AT_byte_size   : 16
    <a42c0>   DW_AT_decl_file   : 5
    <a42c0>   DW_AT_decl_line   : 337
    <a42c2>   DW_AT_decl_column : 16
    <a42c2>   DW_AT_sibling     : <0xa42e8>
 <2><a42c6>: Abbrev Number: 25 (DW_TAG_member)
    <a42c7>   DW_AT_name        : w
    <a42c9>   DW_AT_decl_file   : 5
    <a42c9>   DW_AT_decl_line   : 339
    <a42cb>   DW_AT_decl_column : 15
    <a42cb>   DW_AT_type        : <0xa3e25>
    <a42cf>   DW_AT_data_member_location: 0
 <2><a42d0>: Abbrev Number: 25 (DW_TAG_member)
    <a42d1>   DW_AT_name        : h
    <a42d3>   DW_AT_decl_file   : 5
    <a42d3>   DW_AT_decl_line   : 340
    <a42d5>   DW_AT_decl_column : 15
    <a42d5>   DW_AT_type        : <0xa3e25>
    <a42d9>   DW_AT_data_member_location: 4
 <2><a42da>: Abbrev Number: 12 (DW_TAG_member)
    <a42db>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a42df>   DW_AT_decl_file   : 5
    <a42df>   DW_AT_decl_line   : 341
    <a42e1>   DW_AT_decl_column : 23
    <a42e2>   DW_AT_type        : <0xa4382>
    <a42e6>   DW_AT_data_member_location: 8
 <2><a42e7>: Abbrev Number: 0
 <1><a42e8>: Abbrev Number: 16 (DW_TAG_const_type)
    <a42e9>   DW_AT_type        : <0xa42bb>
 <1><a42ed>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a42ee>   DW_AT_byte_size   : 8
    <a42ee>   DW_AT_type        : <0xa42e8>
 <1><a42f2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a42f3>   DW_AT_byte_size   : 8
    <a42f3>   DW_AT_type        : <0xa42f7>
 <1><a42f7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a42f8>   DW_AT_byte_size   : 8
    <a42f8>   DW_AT_type        : <0xa3fe9>
 <1><a42fc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a42fd>   DW_AT_byte_size   : 8
    <a42fd>   DW_AT_type        : <0xa3e80>
 <1><a4301>: Abbrev Number: 15 (DW_TAG_typedef)
    <a4302>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a4306>   DW_AT_decl_file   : 5
    <a4307>   DW_AT_decl_line   : 176
    <a4308>   DW_AT_decl_column : 3
    <a4309>   DW_AT_type        : <0xa3ff5>
 <1><a430d>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <a430e>   DW_AT_prototyped  : 1
    <a430e>   DW_AT_type        : <0xa3e19>
    <a4312>   DW_AT_sibling     : <0xa4335>
 <2><a4316>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4317>   DW_AT_type        : <0xa3e33>
 <2><a431b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a431c>   DW_AT_type        : <0xa3e19>
 <2><a4320>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4321>   DW_AT_type        : <0xa3e19>
 <2><a4325>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4326>   DW_AT_type        : <0xa3e19>
 <2><a432a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a432b>   DW_AT_type        : <0xa3e19>
 <2><a432f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4330>   DW_AT_type        : <0xa3e19>
 <2><a4334>: Abbrev Number: 0
 <1><a4335>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4336>   DW_AT_byte_size   : 8
    <a4336>   DW_AT_type        : <0xa430d>
 <1><a433a>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <a433b>   DW_AT_prototyped  : 1
    <a433b>   DW_AT_sibling     : <0xa4354>
 <2><a433f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4340>   DW_AT_type        : <0xa3e19>
 <2><a4344>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4345>   DW_AT_type        : <0xa3e19>
 <2><a4349>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a434a>   DW_AT_type        : <0xa3e19>
 <2><a434e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a434f>   DW_AT_type        : <0xa3e19>
 <2><a4353>: Abbrev Number: 0
 <1><a4354>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4355>   DW_AT_byte_size   : 8
    <a4355>   DW_AT_type        : <0xa433a>
 <1><a4359>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <a435a>   DW_AT_prototyped  : 1
    <a435a>   DW_AT_sibling     : <0xa4364>
 <2><a435e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a435f>   DW_AT_type        : <0xa3e33>
 <2><a4363>: Abbrev Number: 0
 <1><a4364>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4365>   DW_AT_byte_size   : 8
    <a4365>   DW_AT_type        : <0xa4359>
 <1><a4369>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <a436a>   DW_AT_prototyped  : 1
    <a436a>   DW_AT_type        : <0xa3f5f>
    <a436e>   DW_AT_sibling     : <0xa437d>
 <2><a4372>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4373>   DW_AT_type        : <0xa3e19>
 <2><a4377>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a4378>   DW_AT_type        : <0xa3f5f>
 <2><a437c>: Abbrev Number: 0
 <1><a437d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a437e>   DW_AT_byte_size   : 8
    <a437e>   DW_AT_type        : <0xa4369>
 <1><a4382>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4383>   DW_AT_byte_size   : 8
    <a4383>   DW_AT_type        : <0xa3df1>
 <1><a4387>: Abbrev Number: 20 (DW_TAG_variable)
    <a4388>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <a438c>   DW_AT_decl_file   : 5
    <a438c>   DW_AT_decl_line   : 364
    <a438e>   DW_AT_decl_column : 15
    <a438f>   DW_AT_type        : <0xa4393>
    <a4393>   DW_AT_external    : 1
    <a4393>   DW_AT_declaration : 1
 <1><a4393>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4394>   DW_AT_byte_size   : 8
    <a4394>   DW_AT_type        : <0xa4301>
 <1><a4398>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <a4399>   DW_AT_prototyped  : 1
    <a4399>   DW_AT_type        : <0xa3e31>
    <a439d>   DW_AT_sibling     : <0xa43b1>
 <2><a43a1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a43a2>   DW_AT_type        : <0xa3e31>
 <2><a43a6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a43a7>   DW_AT_type        : <0xa3e66>
 <2><a43ab>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a43ac>   DW_AT_type        : <0xa3e3f>
 <2><a43b0>: Abbrev Number: 0
 <1><a43b1>: Abbrev Number: 20 (DW_TAG_variable)
    <a43b2>   DW_AT_name        : (indirect string, offset: 0x16bb1): fb_hMemCpy
    <a43b6>   DW_AT_decl_file   : 5
    <a43b6>   DW_AT_decl_line   : 368
    <a43b8>   DW_AT_decl_column : 16
    <a43b9>   DW_AT_type        : <0xa43bd>
    <a43bd>   DW_AT_external    : 1
    <a43bd>   DW_AT_declaration : 1
 <1><a43bd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a43be>   DW_AT_byte_size   : 8
    <a43be>   DW_AT_type        : <0xa4398>
 <1><a43c2>: Abbrev Number: 20 (DW_TAG_variable)
    <a43c3>   DW_AT_name        : (indirect string, offset: 0x18132): __fb_color_conv_16to32
    <a43c7>   DW_AT_decl_file   : 5
    <a43c7>   DW_AT_decl_line   : 372
    <a43c9>   DW_AT_decl_column : 22
    <a43ca>   DW_AT_type        : <0xa41b8>
    <a43ce>   DW_AT_external    : 1
    <a43ce>   DW_AT_declaration : 1
 <1><a43ce>: Abbrev Number: 38 (DW_TAG_subprogram)
    <a43cf>   DW_AT_external    : 1
    <a43cf>   DW_AT_name        : (indirect string, offset: 0x1adbd): fb_hBlit_code_end
    <a43d3>   DW_AT_decl_file   : 1
    <a43d4>   DW_AT_decl_line   : 862
    <a43d6>   DW_AT_decl_column : 6
    <a43d7>   DW_AT_prototyped  : 1
 <1><a43d7>: Abbrev Number: 39 (DW_TAG_subprogram)
    <a43d8>   DW_AT_external    : 1
    <a43d8>   DW_AT_name        : (indirect string, offset: 0x19d8f): fb_hGetBlitter
    <a43dc>   DW_AT_decl_file   : 1
    <a43dd>   DW_AT_decl_line   : 782
    <a43df>   DW_AT_decl_column : 10
    <a43e0>   DW_AT_prototyped  : 1
    <a43e0>   DW_AT_type        : <0xa4456>
    <a43e4>   DW_AT_low_pc      : 0x46c350
    <a43ec>   DW_AT_high_pc     : 0x2cf
    <a43f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a43f6>   DW_AT_call_all_calls: 1
    <a43f6>   DW_AT_sibling     : <0xa4456>
 <2><a43fa>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a43fb>   DW_AT_name        : (indirect string, offset: 0x1acd1): device_depth
    <a43ff>   DW_AT_decl_file   : 1
    <a43ff>   DW_AT_decl_line   : 782
    <a4401>   DW_AT_decl_column : 29
    <a4402>   DW_AT_type        : <0xa3e19>
    <a4406>   DW_AT_location    : 0x2fc13 (location list)
    <a440a>   DW_AT_GNU_locviews: 0x2fc07
 <2><a440e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a440f>   DW_AT_name        : (indirect string, offset: 0x1a6c1): is_rgb
    <a4413>   DW_AT_decl_file   : 1
    <a4413>   DW_AT_decl_line   : 782
    <a4415>   DW_AT_decl_column : 47
    <a4416>   DW_AT_type        : <0xa3e19>
    <a441a>   DW_AT_location    : 0x2fc4f (location list)
    <a441e>   DW_AT_GNU_locviews: 0x2fc47
 <2><a4422>: Abbrev Number: 40 (DW_TAG_variable)
    <a4423>   DW_AT_name        : (indirect string, offset: 0x1ac92): all_blitters
    <a4427>   DW_AT_decl_file   : 1
    <a4428>   DW_AT_decl_line   : 784
    <a442a>   DW_AT_decl_column : 11
    <a442b>   DW_AT_type        : <0xa445b>
 <2><a442f>: Abbrev Number: 7 (DW_TAG_variable)
    <a4430>   DW_AT_name        : (indirect string, offset: 0x1a21f): blitter
    <a4434>   DW_AT_decl_file   : 1
    <a4434>   DW_AT_decl_line   : 803
    <a4436>   DW_AT_decl_column : 7
    <a4437>   DW_AT_type        : <0xa446b>
    <a443b>   DW_AT_location    : 0x2fc76 (location list)
    <a443f>   DW_AT_GNU_locviews: 0x2fc72
 <2><a4443>: Abbrev Number: 1 (DW_TAG_variable)
    <a4444>   DW_AT_name        : i
    <a4446>   DW_AT_decl_file   : 1
    <a4446>   DW_AT_decl_line   : 804
    <a4448>   DW_AT_decl_column : 6
    <a4449>   DW_AT_type        : <0xa3e19>
    <a444d>   DW_AT_location    : 0x2fc93 (location list)
    <a4451>   DW_AT_GNU_locviews: 0x2fc8f
 <2><a4455>: Abbrev Number: 0
 <1><a4456>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a4457>   DW_AT_byte_size   : 8
    <a4457>   DW_AT_type        : <0xa3f9b>
 <1><a445b>: Abbrev Number: 41 (DW_TAG_array_type)
    <a445c>   DW_AT_type        : <0xa4456>
    <a4460>   DW_AT_sibling     : <0xa446b>
 <2><a4464>: Abbrev Number: 42 (DW_TAG_subrange_type)
    <a4465>   DW_AT_type        : <0xa3e04>
    <a4469>   DW_AT_upper_bound : 23
 <2><a446a>: Abbrev Number: 0
 <1><a446b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a446c>   DW_AT_byte_size   : 8
    <a446c>   DW_AT_type        : <0xa4456>
 <1><a4470>: Abbrev Number: 8 (DW_TAG_subprogram)
    <a4471>   DW_AT_name        : (indirect string, offset: 0x1ac6f): fb_hBlit32to32RGB
    <a4475>   DW_AT_decl_file   : 1
    <a4475>   DW_AT_decl_line   : 753
    <a4477>   DW_AT_decl_column : 13
    <a4477>   DW_AT_prototyped  : 1
    <a4477>   DW_AT_low_pc      : 0x46c190
    <a447f>   DW_AT_high_pc     : 0x1a8
    <a4487>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a4489>   DW_AT_call_all_calls: 1
    <a4489>   DW_AT_sibling     : <0xa454a>
 <2><a448d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a448e>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <a4492>   DW_AT_decl_file   : 1
    <a4492>   DW_AT_decl_line   : 753
    <a4494>   DW_AT_decl_column : 46
    <a4495>   DW_AT_type        : <0xa3f91>
    <a4499>   DW_AT_location    : 0x2fca8 (location list)
    <a449d>   DW_AT_GNU_locviews: 0x2fca4
 <2><a44a1>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a44a2>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a44a6>   DW_AT_decl_file   : 1
    <a44a6>   DW_AT_decl_line   : 753
    <a44a8>   DW_AT_decl_column : 56
    <a44a9>   DW_AT_type        : <0xa3e19>
    <a44ad>   DW_AT_location    : 0x2fcbd (location list)
    <a44b1>   DW_AT_GNU_locviews: 0x2fcb7
 <2><a44b5>: Abbrev Number: 1 (DW_TAG_variable)
    <a44b6>   DW_AT_name        : d
    <a44b8>   DW_AT_decl_file   : 1
    <a44b8>   DW_AT_decl_line   : 755
    <a44ba>   DW_AT_decl_column : 16
    <a44bb>   DW_AT_type        : <0xa41b8>
    <a44bf>   DW_AT_location    : 0x2fce8 (location list)
    <a44c3>   DW_AT_GNU_locviews: 0x2fcd6
 <2><a44c7>: Abbrev Number: 1 (DW_TAG_variable)
    <a44c8>   DW_AT_name        : s
    <a44ca>   DW_AT_decl_file   : 1
    <a44ca>   DW_AT_decl_line   : 755
    <a44cc>   DW_AT_decl_column : 20
    <a44cd>   DW_AT_type        : <0xa41b8>
    <a44d1>   DW_AT_location    : 0x2fd59 (location list)
    <a44d5>   DW_AT_GNU_locviews: 0x2fd47
 <2><a44d9>: Abbrev Number: 1 (DW_TAG_variable)
    <a44da>   DW_AT_name        : src
    <a44de>   DW_AT_decl_file   : 1
    <a44de>   DW_AT_decl_line   : 756
    <a44e0>   DW_AT_decl_column : 17
    <a44e1>   DW_AT_type        : <0xa3f91>
    <a44e5>   DW_AT_location    : 0x2fdba (location list)
    <a44e9>   DW_AT_GNU_locviews: 0x2fdb8
 <2><a44ed>: Abbrev Number: 1 (DW_TAG_variable)
    <a44ee>   DW_AT_name        : c
    <a44f0>   DW_AT_decl_file   : 1
    <a44f0>   DW_AT_decl_line   : 757
    <a44f2>   DW_AT_decl_column : 15
    <a44f3>   DW_AT_type        : <0xa3dfd>
    <a44f7>   DW_AT_location    : 0x2fde0 (location list)
    <a44fb>   DW_AT_GNU_locviews: 0x2fdc2
 <2><a44ff>: Abbrev Number: 7 (DW_TAG_variable)
    <a4500>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a4504>   DW_AT_decl_file   : 1
    <a4504>   DW_AT_decl_line   : 758
    <a4506>   DW_AT_decl_column : 8
    <a4507>   DW_AT_type        : <0xa3e33>
    <a450b>   DW_AT_location    : 0x2feaf (location list)
    <a450f>   DW_AT_GNU_locviews: 0x2fead
 <2><a4513>: Abbrev Number: 1 (DW_TAG_variable)
    <a4514>   DW_AT_name        : x
    <a4516>   DW_AT_decl_file   : 1
    <a4516>   DW_AT_decl_line   : 759
    <a4518>   DW_AT_decl_column : 6
    <a4519>   DW_AT_type        : <0xa3e19>
    <a451d>   DW_AT_location    : 0x2fec7 (location list)
    <a4521>   DW_AT_GNU_locviews: 0x2feb7
 <2><a4525>: Abbrev Number: 1 (DW_TAG_variable)
    <a4526>   DW_AT_name        : y
    <a4528>   DW_AT_decl_file   : 1
    <a4528>   DW_AT_decl_line   : 759
    <a452a>   DW_AT_decl_column : 9
    <a452b>   DW_AT_type        : <0xa3e19>
    <a452f>   DW_AT_location    : 0x2ff17 (location list)
    <a4533>   DW_AT_GNU_locviews: 0x2ff11
 <2><a4537>: Abbrev Number: 1 (DW_TAG_variable)
    <a4538>   DW_AT_name        : z
    <a453a>   DW_AT_decl_file   : 1
    <a453a>   DW_AT_decl_line   : 759
    <a453c>   DW_AT_decl_column : 12
    <a453d>   DW_AT_type        : <0xa3e19>
    <a4541>   DW_AT_location    : 0x2ff39 (location list)
    <a4545>   DW_AT_GNU_locviews: 0x2ff2f
 <2><a4549>: Abbrev Number: 0
 <1><a454a>: Abbrev Number: 8 (DW_TAG_subprogram)
    <a454b>   DW_AT_name        : (indirect string, offset: 0x1ac9f): fb_hBlit32to24BGR
    <a454f>   DW_AT_decl_file   : 1
    <a454f>   DW_AT_decl_line   : 719
    <a4551>   DW_AT_decl_column : 13
    <a4551>   DW_AT_prototyped  : 1
    <a4551>   DW_AT_low_pc      : 0x46c0f0
    <a4559>   DW_AT_high_pc     : 0x95
    <a4561>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a4563>   DW_AT_call_all_calls: 1
    <a4563>   DW_AT_sibling     : <0xa4624>
 <2><a4567>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a4568>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <a456c>   DW_AT_decl_file   : 1
    <a456c>   DW_AT_decl_line   : 719
    <a456e>   DW_AT_decl_column : 46
    <a456f>   DW_AT_type        : <0xa3f91>
    <a4573>   DW_AT_location    : 0x2ff63 (location list)
    <a4577>   DW_AT_GNU_locviews: 0x2ff5f
 <2><a457b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a457c>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a4580>   DW_AT_decl_file   : 1
    <a4580>   DW_AT_decl_line   : 719
    <a4582>   DW_AT_decl_column : 56
    <a4583>   DW_AT_type        : <0xa3e19>
    <a4587>   DW_AT_location    : 0x2ff7a (location list)
    <a458b>   DW_AT_GNU_locviews: 0x2ff72
 <2><a458f>: Abbrev Number: 1 (DW_TAG_variable)
    <a4590>   DW_AT_name        : s
    <a4592>   DW_AT_decl_file   : 1
    <a4592>   DW_AT_decl_line   : 721
    <a4594>   DW_AT_decl_column : 16
    <a4595>   DW_AT_type        : <0xa41b8>
    <a4599>   DW_AT_location    : 0x2ffa2 (location list)
    <a459d>   DW_AT_GNU_locviews: 0x2ff9a
 <2><a45a1>: Abbrev Number: 1 (DW_TAG_variable)
    <a45a2>   DW_AT_name        : src
    <a45a6>   DW_AT_decl_file   : 1
    <a45a6>   DW_AT_decl_line   : 722
    <a45a8>   DW_AT_decl_column : 17
    <a45a9>   DW_AT_type        : <0xa3f91>
    <a45ad>   DW_AT_location    : 0x2ffc3 (location list)
    <a45b1>   DW_AT_GNU_locviews: 0x2ffc1
 <2><a45b5>: Abbrev Number: 1 (DW_TAG_variable)
    <a45b6>   DW_AT_name        : c
    <a45b8>   DW_AT_decl_file   : 1
    <a45b8>   DW_AT_decl_line   : 723
    <a45ba>   DW_AT_decl_column : 15
    <a45bb>   DW_AT_type        : <0xa3dfd>
    <a45bf>   DW_AT_location    : 0x2ffcd (location list)
    <a45c3>   DW_AT_GNU_locviews: 0x2ffcb
 <2><a45c7>: Abbrev Number: 1 (DW_TAG_variable)
    <a45c8>   DW_AT_name        : d
    <a45ca>   DW_AT_decl_file   : 1
    <a45ca>   DW_AT_decl_line   : 724
    <a45cc>   DW_AT_decl_column : 17
    <a45cd>   DW_AT_type        : <0xa3f91>
    <a45d1>   DW_AT_location    : 0x2ffdd (location list)
    <a45d5>   DW_AT_GNU_locviews: 0x2ffd5
 <2><a45d9>: Abbrev Number: 7 (DW_TAG_variable)
    <a45da>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a45de>   DW_AT_decl_file   : 1
    <a45de>   DW_AT_decl_line   : 725
    <a45e0>   DW_AT_decl_column : 8
    <a45e1>   DW_AT_type        : <0xa3e33>
    <a45e5>   DW_AT_location    : 0x2fffe (location list)
    <a45e9>   DW_AT_GNU_locviews: 0x2fffc
 <2><a45ed>: Abbrev Number: 1 (DW_TAG_variable)
    <a45ee>   DW_AT_name        : x
    <a45f0>   DW_AT_decl_file   : 1
    <a45f0>   DW_AT_decl_line   : 726
    <a45f2>   DW_AT_decl_column : 6
    <a45f3>   DW_AT_type        : <0xa3e19>
    <a45f7>   DW_AT_location    : 0x30008 (location list)
    <a45fb>   DW_AT_GNU_locviews: 0x30006
 <2><a45ff>: Abbrev Number: 1 (DW_TAG_variable)
    <a4600>   DW_AT_name        : y
    <a4602>   DW_AT_decl_file   : 1
    <a4602>   DW_AT_decl_line   : 726
    <a4604>   DW_AT_decl_column : 9
    <a4605>   DW_AT_type        : <0xa3e19>
    <a4609>   DW_AT_location    : 0x30016 (location list)
    <a460d>   DW_AT_GNU_locviews: 0x30010
 <2><a4611>: Abbrev Number: 1 (DW_TAG_variable)
    <a4612>   DW_AT_name        : z
    <a4614>   DW_AT_decl_file   : 1
    <a4614>   DW_AT_decl_line   : 726
    <a4616>   DW_AT_decl_column : 12
    <a4617>   DW_AT_type        : <0xa3e19>
    <a461b>   DW_AT_location    : 0x30038 (location list)
    <a461f>   DW_AT_GNU_locviews: 0x3002e
 <2><a4623>: Abbrev Number: 0
 <1><a4624>: Abbrev Number: 8 (DW_TAG_subprogram)
    <a4625>   DW_AT_name        : (indirect string, offset: 0x1acde): fb_hBlit32to24RGB
    <a4629>   DW_AT_decl_file   : 1
    <a4629>   DW_AT_decl_line   : 685
    <a462b>   DW_AT_decl_column : 13
    <a462b>   DW_AT_prototyped  : 1
    <a462b>   DW_AT_low_pc      : 0x46c050
    <a4633>   DW_AT_high_pc     : 0x9d
    <a463b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a463d>   DW_AT_call_all_calls: 1
    <a463d>   DW_AT_sibling     : <0xa46fe>
 <2><a4641>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a4642>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <a4646>   DW_AT_decl_file   : 1
    <a4646>   DW_AT_decl_line   : 685
    <a4648>   DW_AT_decl_column : 46
    <a4649>   DW_AT_type        : <0xa3f91>
    <a464d>   DW_AT_location    : 0x30063 (location list)
