    <b8abf>   DW_AT_decl_file   : 8
    <b8ac0>   DW_AT_decl_line   : 9
    <b8ac1>   DW_AT_decl_column : 11
    <b8ac2>   DW_AT_type        : <0xb85c1>
    <b8ac6>   DW_AT_data_member_location: 4
 <2><b8ac7>: Abbrev Number: 7 (DW_TAG_member)
    <b8ac8>   DW_AT_name        : dx
    <b8acb>   DW_AT_decl_file   : 8
    <b8acc>   DW_AT_decl_line   : 10
    <b8acd>   DW_AT_decl_column : 8
    <b8ace>   DW_AT_type        : <0xb85c1>
    <b8ad2>   DW_AT_data_member_location: 8
 <2><b8ad3>: Abbrev Number: 7 (DW_TAG_member)
    <b8ad4>   DW_AT_name        : dy
    <b8ad7>   DW_AT_decl_file   : 8
    <b8ad8>   DW_AT_decl_line   : 10
    <b8ad9>   DW_AT_decl_column : 12
    <b8ada>   DW_AT_type        : <0xb85c1>
    <b8ade>   DW_AT_data_member_location: 12
 <2><b8adf>: Abbrev Number: 0
 <1><b8ae0>: Abbrev Number: 29 (DW_TAG_union_type)
    <b8ae1>   DW_AT_byte_size   : 16
    <b8ae2>   DW_AT_decl_file   : 8
    <b8ae3>   DW_AT_decl_line   : 3
    <b8ae4>   DW_AT_decl_column : 2
    <b8ae5>   DW_AT_sibling     : <0xb8b10>
 <2><b8ae9>: Abbrev Number: 16 (DW_TAG_member)
    <b8aea>   DW_AT_type        : <0xb8a88>
 <2><b8aee>: Abbrev Number: 16 (DW_TAG_member)
    <b8aef>   DW_AT_type        : <0xb8aaa>
 <2><b8af3>: Abbrev Number: 30 (DW_TAG_member)
    <b8af4>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <b8af8>   DW_AT_decl_file   : 8
    <b8af9>   DW_AT_decl_line   : 12
    <b8afa>   DW_AT_decl_column : 7
    <b8afb>   DW_AT_type        : <0xb85c1>
 <2><b8aff>: Abbrev Number: 17 (DW_TAG_member)
    <b8b00>   DW_AT_name        : z
    <b8b02>   DW_AT_decl_file   : 8
    <b8b02>   DW_AT_decl_line   : 13
    <b8b03>   DW_AT_decl_column : 7
    <b8b03>   DW_AT_type        : <0xb85c1>
 <2><b8b07>: Abbrev Number: 17 (DW_TAG_member)
    <b8b08>   DW_AT_name        : w
    <b8b0a>   DW_AT_decl_file   : 8
    <b8b0a>   DW_AT_decl_line   : 14
    <b8b0b>   DW_AT_decl_column : 7
    <b8b0b>   DW_AT_type        : <0xb85c1>
 <2><b8b0f>: Abbrev Number: 0
 <1><b8b10>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b8b11>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <b8b15>   DW_AT_byte_size   : 20
    <b8b16>   DW_AT_decl_file   : 8
    <b8b17>   DW_AT_decl_line   : 1
    <b8b18>   DW_AT_decl_column : 8
    <b8b19>   DW_AT_sibling     : <0xb8b31>
 <2><b8b1d>: Abbrev Number: 2 (DW_TAG_member)
    <b8b1e>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b8b22>   DW_AT_decl_file   : 8
    <b8b23>   DW_AT_decl_line   : 2
    <b8b24>   DW_AT_decl_column : 6
    <b8b25>   DW_AT_type        : <0xb85c1>
    <b8b29>   DW_AT_data_member_location: 0
 <2><b8b2a>: Abbrev Number: 31 (DW_TAG_member)
    <b8b2b>   DW_AT_type        : <0xb8ae0>
    <b8b2f>   DW_AT_data_member_location: 4
 <2><b8b30>: Abbrev Number: 0
 <1><b8b31>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b32>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <b8b36>   DW_AT_decl_file   : 8
    <b8b37>   DW_AT_decl_line   : 18
    <b8b38>   DW_AT_decl_column : 23
    <b8b39>   DW_AT_type        : <0xb8b10>
 <1><b8b3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b3e>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <b8b42>   DW_AT_decl_file   : 9
    <b8b43>   DW_AT_decl_line   : 1
    <b8b44>   DW_AT_decl_column : 23
    <b8b45>   DW_AT_type        : <0xb8b49>
 <1><b8b49>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8b4a>   DW_AT_byte_size   : 8
    <b8b4a>   DW_AT_type        : <0xb8b4e>
 <1><b8b4e>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <b8b4f>   DW_AT_prototyped  : 1
    <b8b4f>   DW_AT_type        : <0xb896c>
 <1><b8b53>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b54>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <b8b58>   DW_AT_decl_file   : 9
    <b8b59>   DW_AT_decl_line   : 2
    <b8b5a>   DW_AT_decl_column : 23
    <b8b5b>   DW_AT_type        : <0xb8b5f>
 <1><b8b5f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8b60>   DW_AT_byte_size   : 8
    <b8b60>   DW_AT_type        : <0xb8b64>
 <1><b8b64>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <b8b65>   DW_AT_prototyped  : 1
    <b8b65>   DW_AT_type        : <0xb85c1>
 <1><b8b69>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b6a>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <b8b6e>   DW_AT_decl_file   : 9
    <b8b6f>   DW_AT_decl_line   : 3
    <b8b70>   DW_AT_decl_column : 23
    <b8b71>   DW_AT_type        : <0xb8b5f>
 <1><b8b75>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b76>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <b8b7a>   DW_AT_decl_file   : 9
    <b8b7b>   DW_AT_decl_line   : 10
    <b8b7c>   DW_AT_decl_column : 23
    <b8b7d>   DW_AT_type        : <0xb8b81>
 <1><b8b81>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8b82>   DW_AT_byte_size   : 8
    <b8b82>   DW_AT_type        : <0xb8b86>
 <1><b8b86>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b8b87>   DW_AT_prototyped  : 1
    <b8b87>   DW_AT_sibling     : <0xb8b91>
 <2><b8b8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8b8c>   DW_AT_type        : <0xb85c1>
 <2><b8b90>: Abbrev Number: 0
 <1><b8b91>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8b92>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <b8b96>   DW_AT_decl_file   : 9
    <b8b97>   DW_AT_decl_line   : 14
    <b8b98>   DW_AT_decl_column : 23
    <b8b99>   DW_AT_type        : <0xb8b9d>
 <1><b8b9d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8b9e>   DW_AT_byte_size   : 8
    <b8b9e>   DW_AT_type        : <0xb8ba2>
 <1><b8ba2>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8ba3>   DW_AT_prototyped  : 1
    <b8ba3>   DW_AT_type        : <0xb85c1>
    <b8ba7>   DW_AT_sibling     : <0xb8bbb>
 <2><b8bab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8bac>   DW_AT_type        : <0xb85c1>
 <2><b8bb0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8bb1>   DW_AT_type        : <0xb85c1>
 <2><b8bb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8bb6>   DW_AT_type        : <0xb85c1>
 <2><b8bba>: Abbrev Number: 0
 <1><b8bbb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8bbc>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <b8bc0>   DW_AT_decl_file   : 9
    <b8bc1>   DW_AT_decl_line   : 18
    <b8bc2>   DW_AT_decl_column : 23
    <b8bc3>   DW_AT_type        : <0xb8b9d>
 <1><b8bc7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8bc8>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <b8bcc>   DW_AT_decl_file   : 9
    <b8bcd>   DW_AT_decl_line   : 24
    <b8bce>   DW_AT_decl_column : 23
    <b8bcf>   DW_AT_type        : <0xb8660>
 <1><b8bd3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8bd4>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <b8bd8>   DW_AT_decl_file   : 9
    <b8bd9>   DW_AT_decl_line   : 28
    <b8bda>   DW_AT_decl_column : 23
    <b8bdb>   DW_AT_type        : <0xb8bdf>
 <1><b8bdf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8be0>   DW_AT_byte_size   : 8
    <b8be0>   DW_AT_type        : <0xb8be4>
 <1><b8be4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8be5>   DW_AT_prototyped  : 1
    <b8be5>   DW_AT_type        : <0xb85c1>
    <b8be9>   DW_AT_sibling     : <0xb8bf8>
 <2><b8bed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8bee>   DW_AT_type        : <0xb85c1>
 <2><b8bf2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8bf3>   DW_AT_type        : <0xb85c1>
 <2><b8bf7>: Abbrev Number: 0
 <1><b8bf8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8bf9>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <b8bfd>   DW_AT_decl_file   : 9
    <b8bfe>   DW_AT_decl_line   : 34
    <b8bff>   DW_AT_decl_column : 23
    <b8c00>   DW_AT_type        : <0xb8b5f>
 <1><b8c04>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c05>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <b8c09>   DW_AT_decl_file   : 9
    <b8c0a>   DW_AT_decl_line   : 35
    <b8c0b>   DW_AT_decl_column : 23
    <b8c0c>   DW_AT_type        : <0xb8b5f>
 <1><b8c10>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c11>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <b8c15>   DW_AT_decl_file   : 9
    <b8c16>   DW_AT_decl_line   : 36
    <b8c17>   DW_AT_decl_column : 23
    <b8c18>   DW_AT_type        : <0xb8c1c>
 <1><b8c1c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8c1d>   DW_AT_byte_size   : 8
    <b8c1d>   DW_AT_type        : <0xb8c21>
 <1><b8c21>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b8c22>   DW_AT_prototyped  : 1
    <b8c22>   DW_AT_sibling     : <0xb8c31>
 <2><b8c26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c27>   DW_AT_type        : <0xb8c31>
 <2><b8c2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c2c>   DW_AT_type        : <0xb8c31>
 <2><b8c30>: Abbrev Number: 0
 <1><b8c31>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8c32>   DW_AT_byte_size   : 8
    <b8c32>   DW_AT_type        : <0xb85c1>
 <1><b8c36>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c37>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <b8c3b>   DW_AT_decl_file   : 9
    <b8c3c>   DW_AT_decl_line   : 37
    <b8c3d>   DW_AT_decl_column : 23
    <b8c3e>   DW_AT_type        : <0xb8c1c>
 <1><b8c42>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c43>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <b8c47>   DW_AT_decl_file   : 9
    <b8c48>   DW_AT_decl_line   : 45
    <b8c49>   DW_AT_decl_column : 24
    <b8c4a>   DW_AT_type        : <0xb8c4e>
 <1><b8c4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8c4f>   DW_AT_byte_size   : 8
    <b8c4f>   DW_AT_type        : <0xb8c53>
 <1><b8c53>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8c54>   DW_AT_prototyped  : 1
    <b8c54>   DW_AT_type        : <0xb85a5>
    <b8c58>   DW_AT_sibling     : <0xb8c6c>
 <2><b8c5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c5d>   DW_AT_type        : <0xb85c1>
 <2><b8c61>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c62>   DW_AT_type        : <0xb85c1>
 <2><b8c66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c67>   DW_AT_type        : <0xb85c1>
 <2><b8c6b>: Abbrev Number: 0
 <1><b8c6c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c6d>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <b8c71>   DW_AT_decl_file   : 9
    <b8c72>   DW_AT_decl_line   : 48
    <b8c73>   DW_AT_decl_column : 23
    <b8c74>   DW_AT_type        : <0xb8c78>
 <1><b8c78>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8c79>   DW_AT_byte_size   : 8
    <b8c79>   DW_AT_type        : <0xb8c7d>
 <1><b8c7d>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b8c7e>   DW_AT_prototyped  : 1
    <b8c7e>   DW_AT_sibling     : <0xb8c92>
 <2><b8c82>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c83>   DW_AT_type        : <0xb8649>
 <2><b8c87>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c88>   DW_AT_type        : <0xb85f5>
 <2><b8c8c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8c8d>   DW_AT_type        : <0xb85c1>
 <2><b8c91>: Abbrev Number: 0
 <1><b8c92>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8c93>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <b8c97>   DW_AT_decl_file   : 9
    <b8c98>   DW_AT_decl_line   : 49
    <b8c99>   DW_AT_decl_column : 23
    <b8c9a>   DW_AT_type        : <0xb8c9e>
 <1><b8c9e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8c9f>   DW_AT_byte_size   : 8
    <b8c9f>   DW_AT_type        : <0xb8ca3>
 <1><b8ca3>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b8ca4>   DW_AT_prototyped  : 1
    <b8ca4>   DW_AT_sibling     : <0xb8cb8>
 <2><b8ca8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8ca9>   DW_AT_type        : <0xb890c>
 <2><b8cad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cae>   DW_AT_type        : <0xb85f5>
 <2><b8cb2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cb3>   DW_AT_type        : <0xb85c1>
 <2><b8cb7>: Abbrev Number: 0
 <1><b8cb8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8cb9>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <b8cbd>   DW_AT_decl_file   : 9
    <b8cbe>   DW_AT_decl_line   : 51
    <b8cbf>   DW_AT_decl_column : 24
    <b8cc0>   DW_AT_type        : <0xb8cc4>
 <1><b8cc4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8cc5>   DW_AT_byte_size   : 8
    <b8cc5>   DW_AT_type        : <0xb8cc9>
 <1><b8cc9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8cca>   DW_AT_prototyped  : 1
    <b8cca>   DW_AT_type        : <0xb85e9>
    <b8cce>   DW_AT_sibling     : <0xb8cdd>
 <2><b8cd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cd3>   DW_AT_type        : <0xb85e9>
 <2><b8cd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cd8>   DW_AT_type        : <0xb8626>
 <2><b8cdc>: Abbrev Number: 0
 <1><b8cdd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8cde>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <b8ce2>   DW_AT_decl_file   : 9
    <b8ce3>   DW_AT_decl_line   : 54
    <b8ce4>   DW_AT_decl_column : 23
    <b8ce5>   DW_AT_type        : <0xb8ce9>
 <1><b8ce9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8cea>   DW_AT_byte_size   : 8
    <b8cea>   DW_AT_type        : <0xb8cee>
 <1><b8cee>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8cef>   DW_AT_prototyped  : 1
    <b8cef>   DW_AT_type        : <0xb85c1>
    <b8cf3>   DW_AT_sibling     : <0xb8d16>
 <2><b8cf7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cf8>   DW_AT_type        : <0xb896c>
 <2><b8cfc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8cfd>   DW_AT_type        : <0xb85db>
 <2><b8d01>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d02>   DW_AT_type        : <0xb8626>
 <2><b8d06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d07>   DW_AT_type        : <0xb85c1>
 <2><b8d0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d0c>   DW_AT_type        : <0xb85c1>
 <2><b8d10>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d11>   DW_AT_type        : <0xb85c1>
 <2><b8d15>: Abbrev Number: 0
 <1><b8d16>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8d17>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b8d1b>   DW_AT_decl_file   : 9
    <b8d1c>   DW_AT_decl_line   : 56
    <b8d1d>   DW_AT_decl_column : 23
    <b8d1e>   DW_AT_type        : <0xb8d22>
 <1><b8d22>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8d23>   DW_AT_byte_size   : 8
    <b8d23>   DW_AT_type        : <0xb8d27>
 <1><b8d27>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8d28>   DW_AT_prototyped  : 1
    <b8d28>   DW_AT_type        : <0xb85c1>
    <b8d2c>   DW_AT_sibling     : <0xb8d4a>
 <2><b8d30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d31>   DW_AT_type        : <0xb890c>
 <2><b8d35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d36>   DW_AT_type        : <0xb86b5>
 <2><b8d3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d3b>   DW_AT_type        : <0xb8626>
 <2><b8d3f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d40>   DW_AT_type        : <0xb85c1>
 <2><b8d44>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d45>   DW_AT_type        : <0xb85c1>
 <2><b8d49>: Abbrev Number: 0
 <1><b8d4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8d4b>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <b8d4f>   DW_AT_decl_file   : 9
    <b8d50>   DW_AT_decl_line   : 67
    <b8d51>   DW_AT_decl_column : 23
    <b8d52>   DW_AT_type        : <0xb8d56>
 <1><b8d56>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8d57>   DW_AT_byte_size   : 8
    <b8d57>   DW_AT_type        : <0xb8d5b>
 <1><b8d5b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8d5c>   DW_AT_prototyped  : 1
    <b8d5c>   DW_AT_type        : <0xb85c1>
    <b8d60>   DW_AT_sibling     : <0xb8d6a>
 <2><b8d64>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d65>   DW_AT_type        : <0xb85c1>
 <2><b8d69>: Abbrev Number: 0
 <1><b8d6a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8d6b>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <b8d6f>   DW_AT_decl_file   : 9
    <b8d70>   DW_AT_decl_line   : 68
    <b8d71>   DW_AT_decl_column : 23
    <b8d72>   DW_AT_type        : <0xb8d76>
 <1><b8d76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8d77>   DW_AT_byte_size   : 8
    <b8d77>   DW_AT_type        : <0xb8d7b>
 <1><b8d7b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8d7c>   DW_AT_prototyped  : 1
    <b8d7c>   DW_AT_type        : <0xb85c1>
    <b8d80>   DW_AT_sibling     : <0xb8d9e>
 <2><b8d84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d85>   DW_AT_type        : <0xb8c31>
 <2><b8d89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d8a>   DW_AT_type        : <0xb8c31>
 <2><b8d8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d8f>   DW_AT_type        : <0xb8c31>
 <2><b8d93>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d94>   DW_AT_type        : <0xb8c31>
 <2><b8d98>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8d99>   DW_AT_type        : <0xb8c31>
 <2><b8d9d>: Abbrev Number: 0
 <1><b8d9e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8d9f>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b8da3>   DW_AT_decl_file   : 9
    <b8da4>   DW_AT_decl_line   : 69
    <b8da5>   DW_AT_decl_column : 23
    <b8da6>   DW_AT_type        : <0xb8daa>
 <1><b8daa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8dab>   DW_AT_byte_size   : 8
    <b8dab>   DW_AT_type        : <0xb8daf>
 <1><b8daf>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8db0>   DW_AT_prototyped  : 1
    <b8db0>   DW_AT_type        : <0xb85c1>
    <b8db4>   DW_AT_sibling     : <0xb8dcd>
 <2><b8db8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8db9>   DW_AT_type        : <0xb85c1>
 <2><b8dbd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8dbe>   DW_AT_type        : <0xb85c1>
 <2><b8dc2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8dc3>   DW_AT_type        : <0xb85c1>
 <2><b8dc7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8dc8>   DW_AT_type        : <0xb85c1>
 <2><b8dcc>: Abbrev Number: 0
 <1><b8dcd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8dce>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b8dd2>   DW_AT_decl_file   : 9
    <b8dd3>   DW_AT_decl_line   : 73
    <b8dd4>   DW_AT_decl_column : 23
    <b8dd5>   DW_AT_type        : <0xb8dd9>
 <1><b8dd9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8dda>   DW_AT_byte_size   : 8
    <b8dda>   DW_AT_type        : <0xb8dde>
 <1><b8dde>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8ddf>   DW_AT_prototyped  : 1
    <b8ddf>   DW_AT_type        : <0xb85c1>
    <b8de3>   DW_AT_sibling     : <0xb8ded>
 <2><b8de7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8de8>   DW_AT_type        : <0xb859e>
 <2><b8dec>: Abbrev Number: 0
 <1><b8ded>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8dee>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b8df2>   DW_AT_decl_file   : 9
    <b8df3>   DW_AT_decl_line   : 74
    <b8df4>   DW_AT_decl_column : 23
    <b8df5>   DW_AT_type        : <0xb8df9>
 <1><b8df9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8dfa>   DW_AT_byte_size   : 8
    <b8dfa>   DW_AT_type        : <0xb8dfe>
 <1><b8dfe>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b8dff>   DW_AT_prototyped  : 1
    <b8dff>   DW_AT_type        : <0xb85c1>
    <b8e03>   DW_AT_sibling     : <0xb8e12>
 <2><b8e07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8e08>   DW_AT_type        : <0xb859e>
 <2><b8e0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8e0d>   DW_AT_type        : <0xb8597>
 <2><b8e11>: Abbrev Number: 0
 <1><b8e12>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8e13>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b8e17>   DW_AT_decl_file   : 9
    <b8e18>   DW_AT_decl_line   : 80
    <b8e19>   DW_AT_decl_column : 23
    <b8e1a>   DW_AT_type        : <0xb8b81>
 <1><b8e1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8e1f>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b8e23>   DW_AT_decl_file   : 9
    <b8e24>   DW_AT_decl_line   : 83
    <b8e25>   DW_AT_decl_column : 23
    <b8e26>   DW_AT_type        : <0xb8d56>
 <1><b8e2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8e2b>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b8e2f>   DW_AT_decl_file   : 9
    <b8e30>   DW_AT_decl_line   : 86
    <b8e31>   DW_AT_decl_column : 23
    <b8e32>   DW_AT_type        : <0xb8bdf>
 <1><b8e36>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8e37>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b8e3b>   DW_AT_decl_file   : 9
    <b8e3c>   DW_AT_decl_line   : 89
    <b8e3d>   DW_AT_decl_column : 23
    <b8e3e>   DW_AT_type        : <0xb8bdf>
 <1><b8e42>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8e43>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b8e47>   DW_AT_decl_file   : 9
    <b8e48>   DW_AT_decl_line   : 91
    <b8e49>   DW_AT_decl_column : 23
    <b8e4a>   DW_AT_type        : <0xb8e4e>
 <1><b8e4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8e4f>   DW_AT_byte_size   : 8
    <b8e4f>   DW_AT_type        : <0xb8e53>
 <1><b8e53>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b8e54>   DW_AT_prototyped  : 1
    <b8e54>   DW_AT_sibling     : <0xb8e5e>
 <2><b8e58>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b8e59>   DW_AT_type        : <0xb8e5e>
 <2><b8e5d>: Abbrev Number: 0
 <1><b8e5e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b8e5f>   DW_AT_byte_size   : 8
    <b8e5f>   DW_AT_type        : <0xb8b31>
 <1><b8e63>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b8e64>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b8e68>   DW_AT_byte_size   : 224
    <b8e69>   DW_AT_decl_file   : 9
    <b8e6a>   DW_AT_decl_line   : 93
    <b8e6b>   DW_AT_decl_column : 16
    <b8e6c>   DW_AT_sibling     : <0xb8fdd>
 <2><b8e70>: Abbrev Number: 2 (DW_TAG_member)
    <b8e71>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b8e75>   DW_AT_decl_file   : 9
    <b8e76>   DW_AT_decl_line   : 94
    <b8e77>   DW_AT_decl_column : 23
    <b8e78>   DW_AT_type        : <0xb8b3d>
    <b8e7c>   DW_AT_data_member_location: 0
 <2><b8e7d>: Abbrev Number: 2 (DW_TAG_member)
    <b8e7e>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b8e82>   DW_AT_decl_file   : 9
    <b8e83>   DW_AT_decl_line   : 95
    <b8e84>   DW_AT_decl_column : 23
    <b8e85>   DW_AT_type        : <0xb8b53>
    <b8e89>   DW_AT_data_member_location: 8
 <2><b8e8a>: Abbrev Number: 2 (DW_TAG_member)
    <b8e8b>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b8e8f>   DW_AT_decl_file   : 9
    <b8e90>   DW_AT_decl_line   : 96
    <b8e91>   DW_AT_decl_column : 23
    <b8e92>   DW_AT_type        : <0xb8b69>
    <b8e96>   DW_AT_data_member_location: 16
 <2><b8e97>: Abbrev Number: 2 (DW_TAG_member)
    <b8e98>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b8e9c>   DW_AT_decl_file   : 9
    <b8e9d>   DW_AT_decl_line   : 97
    <b8e9e>   DW_AT_decl_column : 23
    <b8e9f>   DW_AT_type        : <0xb8b75>
    <b8ea3>   DW_AT_data_member_location: 24
 <2><b8ea4>: Abbrev Number: 2 (DW_TAG_member)
    <b8ea5>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b8ea9>   DW_AT_decl_file   : 9
    <b8eaa>   DW_AT_decl_line   : 98
    <b8eab>   DW_AT_decl_column : 23
    <b8eac>   DW_AT_type        : <0xb8b91>
    <b8eb0>   DW_AT_data_member_location: 32
 <2><b8eb1>: Abbrev Number: 2 (DW_TAG_member)
    <b8eb2>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b8eb6>   DW_AT_decl_file   : 9
    <b8eb7>   DW_AT_decl_line   : 99
    <b8eb8>   DW_AT_decl_column : 23
    <b8eb9>   DW_AT_type        : <0xb8bbb>
    <b8ebd>   DW_AT_data_member_location: 40
 <2><b8ebe>: Abbrev Number: 2 (DW_TAG_member)
    <b8ebf>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b8ec3>   DW_AT_decl_file   : 9
    <b8ec4>   DW_AT_decl_line   : 100
    <b8ec5>   DW_AT_decl_column : 23
    <b8ec6>   DW_AT_type        : <0xb8bd3>
    <b8eca>   DW_AT_data_member_location: 48
 <2><b8ecb>: Abbrev Number: 2 (DW_TAG_member)
    <b8ecc>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b8ed0>   DW_AT_decl_file   : 9
    <b8ed1>   DW_AT_decl_line   : 101
    <b8ed2>   DW_AT_decl_column : 23
    <b8ed3>   DW_AT_type        : <0xb8bf8>
    <b8ed7>   DW_AT_data_member_location: 56
 <2><b8ed8>: Abbrev Number: 2 (DW_TAG_member)
    <b8ed9>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b8edd>   DW_AT_decl_file   : 9
    <b8ede>   DW_AT_decl_line   : 102
    <b8edf>   DW_AT_decl_column : 23
    <b8ee0>   DW_AT_type        : <0xb8c04>
    <b8ee4>   DW_AT_data_member_location: 64
 <2><b8ee5>: Abbrev Number: 2 (DW_TAG_member)
    <b8ee6>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b8eea>   DW_AT_decl_file   : 9
    <b8eeb>   DW_AT_decl_line   : 103
    <b8eec>   DW_AT_decl_column : 23
    <b8eed>   DW_AT_type        : <0xb8c10>
    <b8ef1>   DW_AT_data_member_location: 72
 <2><b8ef2>: Abbrev Number: 2 (DW_TAG_member)
    <b8ef3>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b8ef7>   DW_AT_decl_file   : 9
    <b8ef8>   DW_AT_decl_line   : 104
    <b8ef9>   DW_AT_decl_column : 23
    <b8efa>   DW_AT_type        : <0xb8c36>
    <b8efe>   DW_AT_data_member_location: 80
 <2><b8eff>: Abbrev Number: 2 (DW_TAG_member)
    <b8f00>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b8f04>   DW_AT_decl_file   : 9
    <b8f05>   DW_AT_decl_line   : 105
    <b8f06>   DW_AT_decl_column : 24
    <b8f07>   DW_AT_type        : <0xb8c6c>
    <b8f0b>   DW_AT_data_member_location: 88
 <2><b8f0c>: Abbrev Number: 2 (DW_TAG_member)
    <b8f0d>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b8f11>   DW_AT_decl_file   : 9
    <b8f12>   DW_AT_decl_line   : 106
    <b8f13>   DW_AT_decl_column : 25
    <b8f14>   DW_AT_type        : <0xb8c92>
    <b8f18>   DW_AT_data_member_location: 96
 <2><b8f19>: Abbrev Number: 2 (DW_TAG_member)
    <b8f1a>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b8f1e>   DW_AT_decl_file   : 9
    <b8f1f>   DW_AT_decl_line   : 107
    <b8f20>   DW_AT_decl_column : 23
    <b8f21>   DW_AT_type        : <0xb8cb8>
    <b8f25>   DW_AT_data_member_location: 104
 <2><b8f26>: Abbrev Number: 2 (DW_TAG_member)
    <b8f27>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b8f2b>   DW_AT_decl_file   : 9
    <b8f2c>   DW_AT_decl_line   : 108
    <b8f2d>   DW_AT_decl_column : 23
    <b8f2e>   DW_AT_type        : <0xb8d4a>
    <b8f32>   DW_AT_data_member_location: 112
 <2><b8f33>: Abbrev Number: 2 (DW_TAG_member)
    <b8f34>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b8f38>   DW_AT_decl_file   : 9
    <b8f39>   DW_AT_decl_line   : 109
    <b8f3a>   DW_AT_decl_column : 23
    <b8f3b>   DW_AT_type        : <0xb8d6a>
    <b8f3f>   DW_AT_data_member_location: 120
 <2><b8f40>: Abbrev Number: 2 (DW_TAG_member)
    <b8f41>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b8f45>   DW_AT_decl_file   : 9
    <b8f46>   DW_AT_decl_line   : 110
    <b8f47>   DW_AT_decl_column : 23
    <b8f48>   DW_AT_type        : <0xb8d9e>
    <b8f4c>   DW_AT_data_member_location: 128
 <2><b8f4d>: Abbrev Number: 2 (DW_TAG_member)
    <b8f4e>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b8f52>   DW_AT_decl_file   : 9
    <b8f53>   DW_AT_decl_line   : 111
    <b8f54>   DW_AT_decl_column : 23
    <b8f55>   DW_AT_type        : <0xb8dcd>
    <b8f59>   DW_AT_data_member_location: 136
 <2><b8f5a>: Abbrev Number: 2 (DW_TAG_member)
    <b8f5b>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b8f5f>   DW_AT_decl_file   : 9
    <b8f60>   DW_AT_decl_line   : 112
    <b8f61>   DW_AT_decl_column : 23
    <b8f62>   DW_AT_type        : <0xb8ded>
    <b8f66>   DW_AT_data_member_location: 144
 <2><b8f67>: Abbrev Number: 2 (DW_TAG_member)
    <b8f68>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b8f6c>   DW_AT_decl_file   : 9
    <b8f6d>   DW_AT_decl_line   : 113
    <b8f6e>   DW_AT_decl_column : 25
    <b8f6f>   DW_AT_type        : <0xb8bc7>
    <b8f73>   DW_AT_data_member_location: 152
 <2><b8f74>: Abbrev Number: 2 (DW_TAG_member)
    <b8f75>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b8f79>   DW_AT_decl_file   : 9
    <b8f7a>   DW_AT_decl_line   : 114
    <b8f7b>   DW_AT_decl_column : 24
    <b8f7c>   DW_AT_type        : <0xb8cdd>
    <b8f80>   DW_AT_data_member_location: 160
 <2><b8f81>: Abbrev Number: 2 (DW_TAG_member)
    <b8f82>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <b8f86>   DW_AT_decl_file   : 9
    <b8f87>   DW_AT_decl_line   : 115
    <b8f88>   DW_AT_decl_column : 25
    <b8f89>   DW_AT_type        : <0xb8d16>
    <b8f8d>   DW_AT_data_member_location: 168
 <2><b8f8e>: Abbrev Number: 2 (DW_TAG_member)
    <b8f8f>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <b8f93>   DW_AT_decl_file   : 9
    <b8f94>   DW_AT_decl_line   : 116
    <b8f95>   DW_AT_decl_column : 23
    <b8f96>   DW_AT_type        : <0xb8c42>
    <b8f9a>   DW_AT_data_member_location: 176
 <2><b8f9b>: Abbrev Number: 2 (DW_TAG_member)
    <b8f9c>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <b8fa0>   DW_AT_decl_file   : 9
    <b8fa1>   DW_AT_decl_line   : 117
    <b8fa2>   DW_AT_decl_column : 23
    <b8fa3>   DW_AT_type        : <0xb8e12>
    <b8fa7>   DW_AT_data_member_location: 184
 <2><b8fa8>: Abbrev Number: 2 (DW_TAG_member)
    <b8fa9>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <b8fad>   DW_AT_decl_file   : 9
    <b8fae>   DW_AT_decl_line   : 118
    <b8faf>   DW_AT_decl_column : 22
    <b8fb0>   DW_AT_type        : <0xb8e1e>
    <b8fb4>   DW_AT_data_member_location: 192
 <2><b8fb5>: Abbrev Number: 2 (DW_TAG_member)
    <b8fb6>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <b8fba>   DW_AT_decl_file   : 9
    <b8fbb>   DW_AT_decl_line   : 119
    <b8fbc>   DW_AT_decl_column : 23
    <b8fbd>   DW_AT_type        : <0xb8e2a>
    <b8fc1>   DW_AT_data_member_location: 200
 <2><b8fc2>: Abbrev Number: 2 (DW_TAG_member)
    <b8fc3>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <b8fc7>   DW_AT_decl_file   : 9
    <b8fc8>   DW_AT_decl_line   : 120
    <b8fc9>   DW_AT_decl_column : 22
    <b8fca>   DW_AT_type        : <0xb8e36>
    <b8fce>   DW_AT_data_member_location: 208
 <2><b8fcf>: Abbrev Number: 2 (DW_TAG_member)
    <b8fd0>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <b8fd4>   DW_AT_decl_file   : 9
    <b8fd5>   DW_AT_decl_line   : 121
    <b8fd6>   DW_AT_decl_column : 23
    <b8fd7>   DW_AT_type        : <0xb8e42>
    <b8fdb>   DW_AT_data_member_location: 216
 <2><b8fdc>: Abbrev Number: 0
 <1><b8fdd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8fde>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b8fe2>   DW_AT_decl_file   : 9
    <b8fe3>   DW_AT_decl_line   : 122
    <b8fe4>   DW_AT_decl_column : 3
    <b8fe5>   DW_AT_type        : <0xb8e63>
 <1><b8fe9>: Abbrev Number: 32 (DW_TAG_structure_type)
    <b8fea>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <b8fee>   DW_AT_byte_size   : 20848
    <b8ff0>   DW_AT_decl_file   : 10
    <b8ff1>   DW_AT_decl_line   : 349
    <b8ff3>   DW_AT_decl_column : 16
    <b8ff4>   DW_AT_sibling     : <0xb9069>
 <2><b8ff8>: Abbrev Number: 10 (DW_TAG_member)
    <b8ff9>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <b8ffd>   DW_AT_decl_file   : 10
    <b8ffd>   DW_AT_decl_line   : 350
    <b8fff>   DW_AT_decl_column : 18
    <b8fff>   DW_AT_type        : <0xb85c1>
    <b9003>   DW_AT_data_member_location: 0
 <2><b9004>: Abbrev Number: 10 (DW_TAG_member)
    <b9005>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <b9009>   DW_AT_decl_file   : 10
    <b9009>   DW_AT_decl_line   : 351
    <b900b>   DW_AT_decl_column : 18
    <b900b>   DW_AT_type        : <0xb864f>
    <b900f>   DW_AT_data_member_location: 8
 <2><b9010>: Abbrev Number: 10 (DW_TAG_member)
    <b9011>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <b9015>   DW_AT_decl_file   : 10
    <b9015>   DW_AT_decl_line   : 352
    <b9017>   DW_AT_decl_column : 18
    <b9017>   DW_AT_type        : <0xb869b>
    <b901b>   DW_AT_data_member_location: 16
 <2><b901c>: Abbrev Number: 10 (DW_TAG_member)
    <b901d>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <b9021>   DW_AT_decl_file   : 10
    <b9021>   DW_AT_decl_line   : 353
    <b9023>   DW_AT_decl_column : 18
    <b9023>   DW_AT_type        : <0xb85e9>
    <b9027>   DW_AT_data_member_location: 40
 <2><b9028>: Abbrev Number: 10 (DW_TAG_member)
    <b9029>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b902d>   DW_AT_decl_file   : 10
    <b902d>   DW_AT_decl_line   : 354
    <b902f>   DW_AT_decl_column : 18
    <b902f>   DW_AT_type        : <0xb8fdd>
    <b9033>   DW_AT_data_member_location: 48
 <2><b9034>: Abbrev Number: 12 (DW_TAG_member)
    <b9035>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <b9039>   DW_AT_decl_file   : 10
    <b9039>   DW_AT_decl_line   : 355
    <b903b>   DW_AT_decl_column : 18
    <b903b>   DW_AT_type        : <0xb9069>
    <b903f>   DW_AT_data_member_location: 272
 <2><b9041>: Abbrev Number: 12 (DW_TAG_member)
    <b9042>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <b9046>   DW_AT_decl_file   : 10
    <b9046>   DW_AT_decl_line   : 356
    <b9048>   DW_AT_decl_column : 18
    <b9048>   DW_AT_type        : <0xb85c1>
    <b904c>   DW_AT_data_member_location: 20832
 <2><b904e>: Abbrev Number: 12 (DW_TAG_member)
    <b904f>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <b9053>   DW_AT_decl_file   : 10
    <b9053>   DW_AT_decl_line   : 357
    <b9055>   DW_AT_decl_column : 18
    <b9055>   DW_AT_type        : <0xb85c1>
    <b9059>   DW_AT_data_member_location: 20836
 <2><b905b>: Abbrev Number: 12 (DW_TAG_member)
    <b905c>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <b9060>   DW_AT_decl_file   : 10
    <b9060>   DW_AT_decl_line   : 358
    <b9062>   DW_AT_decl_column : 18
    <b9062>   DW_AT_type        : <0xb8660>
    <b9066>   DW_AT_data_member_location: 20840
 <2><b9068>: Abbrev Number: 0
 <1><b9069>: Abbrev Number: 14 (DW_TAG_array_type)
    <b906a>   DW_AT_type        : <0xb8a7c>
    <b906e>   DW_AT_sibling     : <0xb907a>
 <2><b9072>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <b9073>   DW_AT_type        : <0xb85ac>
    <b9077>   DW_AT_upper_bound : 256
 <2><b9079>: Abbrev Number: 0
 <1><b907a>: Abbrev Number: 13 (DW_TAG_typedef)
    <b907b>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <b907f>   DW_AT_decl_file   : 10
    <b9080>   DW_AT_decl_line   : 359
    <b9082>   DW_AT_decl_column : 3
    <b9083>   DW_AT_type        : <0xb8fe9>
 <1><b9087>: Abbrev Number: 34 (DW_TAG_variable)
    <b9088>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <b908c>   DW_AT_decl_file   : 10
    <b908d>   DW_AT_decl_line   : 361
    <b908f>   DW_AT_decl_column : 21
    <b9090>   DW_AT_type        : <0xb907a>
    <b9094>   DW_AT_external    : 1
    <b9094>   DW_AT_declaration : 1
 <1><b9094>: Abbrev Number: 35 (DW_TAG_subprogram)
    <b9095>   DW_AT_external    : 1
    <b9095>   DW_AT_name        : (indirect string, offset: 0x1b609): fb_ConsoleGetSize
    <b9099>   DW_AT_decl_file   : 11
    <b909a>   DW_AT_decl_line   : 55
    <b909b>   DW_AT_decl_column : 21
    <b909c>   DW_AT_prototyped  : 1
    <b909c>   DW_AT_declaration : 1
    <b909c>   DW_AT_sibling     : <0xb90ab>
 <2><b90a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b90a1>   DW_AT_type        : <0xb8c31>
 <2><b90a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b90a6>   DW_AT_type        : <0xb8c31>
 <2><b90aa>: Abbrev Number: 0
 <1><b90ab>: Abbrev Number: 36 (DW_TAG_subprogram)
    <b90ac>   DW_AT_external    : 1
    <b90ac>   DW_AT_name        : (indirect string, offset: 0x1a8df): fb_GetSize
    <b90b0>   DW_AT_decl_file   : 1
    <b90b1>   DW_AT_decl_line   : 6
    <b90b2>   DW_AT_decl_column : 13
    <b90b3>   DW_AT_prototyped  : 1
    <b90b3>   DW_AT_low_pc      : 0x471c70
    <b90bb>   DW_AT_high_pc     : 0x15
    <b90c3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b90c5>   DW_AT_call_all_calls: 1
 <2><b90c5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b90c6>   DW_AT_name        : (indirect string, offset: 0x1a968): cols
    <b90ca>   DW_AT_decl_file   : 1
    <b90ca>   DW_AT_decl_line   : 6
    <b90ca>   DW_AT_decl_column : 30
    <b90cb>   DW_AT_type        : <0xb8c31>
    <b90cf>   DW_AT_location    : 0x3a652 (location list)
    <b90d3>   DW_AT_GNU_locviews: 0x3a64a
 <2><b90d7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b90d8>   DW_AT_name        : (indirect string, offset: 0x1a8c4): rows
    <b90dc>   DW_AT_decl_file   : 1
    <b90dc>   DW_AT_decl_line   : 6
    <b90dc>   DW_AT_decl_column : 41
    <b90dd>   DW_AT_type        : <0xb8c31>
    <b90e1>   DW_AT_location    : 0x3a675 (location list)
    <b90e5>   DW_AT_GNU_locviews: 0x3a66d
 <2><b90e9>: Abbrev Number: 37 (DW_TAG_call_site)
    <b90ea>   DW_AT_call_return_pc: 0x471c7e
    <b90f2>   DW_AT_call_tail_call: 1
    <b90f2>   DW_AT_sibling     : <0xb9105>
 <3><b90f6>: Abbrev Number: 20 (DW_TAG_call_site_parameter)
    <b90f7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b90f9>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><b90fd>: Abbrev Number: 20 (DW_TAG_call_site_parameter)
    <b90fe>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b9100>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><b9104>: Abbrev Number: 0
 <2><b9105>: Abbrev Number: 38 (DW_TAG_call_site)
    <b9106>   DW_AT_call_return_pc: 0x471c85
    <b910e>   DW_AT_call_tail_call: 1
    <b910e>   DW_AT_call_origin : <0xb9094>
 <2><b9112>: Abbrev Number: 0
 <1><b9113>: Abbrev Number: 0
  Compilation Unit @ offset 0xb9114:
   Length:        0xb6c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xd612
   Pointer Size:  8
 <0><b9120>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <b9121>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <b9125>   DW_AT_language    : 29	(C11)
    <b9126>   DW_AT_name        : (indirect line string, offset: 0xde2): src/rtlib/hook_getx.c
    <b912a>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <b912e>   DW_AT_low_pc      : 0x471c90
    <b9136>   DW_AT_high_pc     : 0x15
    <b913e>   DW_AT_stmt_list   : 0x65fc6
 <1><b9142>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9143>   DW_AT_byte_size   : 1
    <b9144>   DW_AT_encoding    : 8	(unsigned char)
    <b9145>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><b9149>: Abbrev Number: 6 (DW_TAG_base_type)
    <b914a>   DW_AT_byte_size   : 2
    <b914b>   DW_AT_encoding    : 7	(unsigned)
    <b914c>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><b9150>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9151>   DW_AT_byte_size   : 4
    <b9152>   DW_AT_encoding    : 7	(unsigned)
    <b9153>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><b9157>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9158>   DW_AT_byte_size   : 8
    <b9159>   DW_AT_encoding    : 7	(unsigned)
    <b915a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><b915e>: Abbrev Number: 6 (DW_TAG_base_type)
    <b915f>   DW_AT_byte_size   : 1
    <b9160>   DW_AT_encoding    : 6	(signed char)
    <b9161>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><b9165>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9166>   DW_AT_byte_size   : 2
    <b9167>   DW_AT_encoding    : 5	(signed)
    <b9168>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><b916c>: Abbrev Number: 20 (DW_TAG_base_type)
    <b916d>   DW_AT_byte_size   : 4
    <b916e>   DW_AT_encoding    : 5	(signed)
    <b916f>   DW_AT_name        : int
 <1><b9173>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9174>   DW_AT_byte_size   : 8
    <b9175>   DW_AT_encoding    : 5	(signed)
    <b9176>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><b917a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b917b>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <b917f>   DW_AT_decl_file   : 2
    <b9180>   DW_AT_decl_line   : 153
    <b9181>   DW_AT_decl_column : 27
    <b9182>   DW_AT_type        : <0xb9173>
 <1><b9186>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b9187>   DW_AT_byte_size   : 8
 <1><b9188>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9189>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <b918d>   DW_AT_decl_file   : 2
    <b918e>   DW_AT_decl_line   : 194
    <b918f>   DW_AT_decl_column : 27
    <b9190>   DW_AT_type        : <0xb9173>
 <1><b9194>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9195>   DW_AT_byte_size   : 8
    <b9195>   DW_AT_type        : <0xb9199>
 <1><b9199>: Abbrev Number: 6 (DW_TAG_base_type)
    <b919a>   DW_AT_byte_size   : 1
    <b919b>   DW_AT_encoding    : 6	(signed char)
    <b919c>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><b91a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b91a1>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <b91a5>   DW_AT_decl_file   : 3
    <b91a6>   DW_AT_decl_line   : 209
    <b91a7>   DW_AT_decl_column : 23
    <b91a8>   DW_AT_type        : <0xb9157>
 <1><b91ac>: Abbrev Number: 13 (DW_TAG_typedef)
    <b91ad>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <b91b1>   DW_AT_decl_file   : 3
    <b91b2>   DW_AT_decl_line   : 321
    <b91b4>   DW_AT_decl_column : 24
    <b91b5>   DW_AT_type        : <0xb916c>
 <1><b91b9>: Abbrev Number: 22 (DW_TAG_const_type)
    <b91ba>   DW_AT_type        : <0xb91ac>
 <1><b91be>: Abbrev Number: 6 (DW_TAG_base_type)
    <b91bf>   DW_AT_byte_size   : 8
    <b91c0>   DW_AT_encoding    : 5	(signed)
    <b91c1>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><b91c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b91c6>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <b91ca>   DW_AT_decl_file   : 4
    <b91cb>   DW_AT_decl_line   : 87
    <b91cc>   DW_AT_decl_column : 19
    <b91cd>   DW_AT_type        : <0xb917a>
 <1><b91d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b91d2>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <b91d6>   DW_AT_decl_file   : 4
    <b91d7>   DW_AT_decl_line   : 108
    <b91d8>   DW_AT_decl_column : 19
    <b91d9>   DW_AT_type        : <0xb9188>
 <1><b91dd>: Abbrev Number: 6 (DW_TAG_base_type)
    <b91de>   DW_AT_byte_size   : 8
    <b91df>   DW_AT_encoding    : 7	(unsigned)
    <b91e0>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><b91e4>: Abbrev Number: 14 (DW_TAG_array_type)
    <b91e5>   DW_AT_type        : <0xb9199>
    <b91e9>   DW_AT_sibling     : <0xb91f4>
 <2><b91ed>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <b91ee>   DW_AT_type        : <0xb9157>
    <b91f2>   DW_AT_upper_bound : 3
 <2><b91f3>: Abbrev Number: 0
 <1><b91f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b91f5>   DW_AT_byte_size   : 8
    <b91f5>   DW_AT_type        : <0xb91f9>
 <1><b91f9>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><b91fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b91fb>   DW_AT_byte_size   : 8
    <b91fb>   DW_AT_type        : <0xb9194>
 <1><b91ff>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9200>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <b9204>   DW_AT_decl_file   : 5
    <b9205>   DW_AT_decl_line   : 22
    <b9206>   DW_AT_decl_column : 15
    <b9207>   DW_AT_type        : <0xb91c5>
 <1><b920b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b920c>   DW_AT_byte_size   : 8
    <b920c>   DW_AT_type        : <0xb9210>
 <1><b9210>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <b9211>   DW_AT_prototyped  : 1
 <1><b9211>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b9212>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <b9216>   DW_AT_byte_size   : 24
    <b9217>   DW_AT_decl_file   : 6
    <b9218>   DW_AT_decl_line   : 82
    <b9219>   DW_AT_decl_column : 16
    <b921a>   DW_AT_sibling     : <0xb9246>
 <2><b921e>: Abbrev Number: 2 (DW_TAG_member)
    <b921f>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b9223>   DW_AT_decl_file   : 6
    <b9224>   DW_AT_decl_line   : 83
    <b9225>   DW_AT_decl_column : 21
    <b9226>   DW_AT_type        : <0xb9194>
    <b922a>   DW_AT_data_member_location: 0
 <2><b922b>: Abbrev Number: 7 (DW_TAG_member)
    <b922c>   DW_AT_name        : len
    <b9230>   DW_AT_decl_file   : 6
    <b9231>   DW_AT_decl_line   : 84
    <b9232>   DW_AT_decl_column : 21
    <b9233>   DW_AT_type        : <0xb91d1>
    <b9237>   DW_AT_data_member_location: 8
 <2><b9238>: Abbrev Number: 2 (DW_TAG_member)
    <b9239>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b923d>   DW_AT_decl_file   : 6
    <b923e>   DW_AT_decl_line   : 85
    <b923f>   DW_AT_decl_column : 21
    <b9240>   DW_AT_type        : <0xb91d1>
    <b9244>   DW_AT_data_member_location: 16
 <2><b9245>: Abbrev Number: 0
 <1><b9246>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9247>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <b924b>   DW_AT_decl_file   : 6
    <b924c>   DW_AT_decl_line   : 86
    <b924d>   DW_AT_decl_column : 3
    <b924e>   DW_AT_type        : <0xb9211>
 <1><b9252>: Abbrev Number: 6 (DW_TAG_base_type)
    <b9253>   DW_AT_byte_size   : 8
    <b9254>   DW_AT_encoding    : 4	(float)
    <b9255>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><b9259>: Abbrev Number: 6 (DW_TAG_base_type)
    <b925a>   DW_AT_byte_size   : 4
    <b925b>   DW_AT_encoding    : 4	(float)
    <b925c>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><b9260>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9261>   DW_AT_byte_size   : 8
    <b9261>   DW_AT_type        : <0xb91ac>
 <1><b9265>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <b9266>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <b926a>   DW_AT_encoding    : 7	(unsigned)
    <b926b>   DW_AT_byte_size   : 4
    <b926c>   DW_AT_type        : <0xb9150>
    <b9270>   DW_AT_decl_file   : 7
    <b9271>   DW_AT_decl_line   : 25
    <b9272>   DW_AT_decl_column : 14
    <b9273>   DW_AT_sibling     : <0xb9290>
 <2><b9277>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b9278>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <b927c>   DW_AT_const_value : 0
 <2><b927d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b927e>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <b9282>   DW_AT_const_value : 1
 <2><b9283>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b9284>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <b9288>   DW_AT_const_value : 2
 <2><b9289>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b928a>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <b928e>   DW_AT_const_value : 3
 <2><b928f>: Abbrev Number: 0
 <1><b9290>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9291>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <b9295>   DW_AT_decl_file   : 7
    <b9296>   DW_AT_decl_line   : 30
    <b9297>   DW_AT_decl_column : 3
    <b9298>   DW_AT_type        : <0xb9265>
 <1><b929c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b929d>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <b92a1>   DW_AT_decl_file   : 7
    <b92a2>   DW_AT_decl_line   : 54
    <b92a3>   DW_AT_decl_column : 15
    <b92a4>   DW_AT_type        : <0xb92a8>
 <1><b92a8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b92a9>   DW_AT_byte_size   : 8
    <b92a9>   DW_AT_type        : <0xb92ad>
 <1><b92ad>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b92ae>   DW_AT_prototyped  : 1
    <b92ae>   DW_AT_type        : <0xb916c>
    <b92b2>   DW_AT_sibling     : <0xb92c1>
 <2><b92b6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b92b7>   DW_AT_type        : <0xb92c1>
 <2><b92bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b92bc>   DW_AT_type        : <0xb916c>
 <2><b92c0>: Abbrev Number: 0
 <1><b92c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b92c2>   DW_AT_byte_size   : 8
    <b92c2>   DW_AT_type        : <0xb92c6>
 <1><b92c6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b92c7>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <b92cb>   DW_AT_byte_size   : 80
    <b92cc>   DW_AT_decl_file   : 7
    <b92cd>   DW_AT_decl_line   : 97
    <b92ce>   DW_AT_decl_column : 16
    <b92cf>   DW_AT_sibling     : <0xb938a>
 <2><b92d3>: Abbrev Number: 2 (DW_TAG_member)
    <b92d4>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b92d8>   DW_AT_decl_file   : 7
    <b92d9>   DW_AT_decl_line   : 98
    <b92da>   DW_AT_decl_column : 21
    <b92db>   DW_AT_type        : <0xb916c>
    <b92df>   DW_AT_data_member_location: 0
 <2><b92e0>: Abbrev Number: 7 (DW_TAG_member)
    <b92e1>   DW_AT_name        : len
    <b92e5>   DW_AT_decl_file   : 7
    <b92e6>   DW_AT_decl_line   : 99
    <b92e7>   DW_AT_decl_column : 21
    <b92e8>   DW_AT_type        : <0xb916c>
    <b92ec>   DW_AT_data_member_location: 4
 <2><b92ed>: Abbrev Number: 2 (DW_TAG_member)
    <b92ee>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <b92f2>   DW_AT_decl_file   : 7
    <b92f3>   DW_AT_decl_line   : 100
    <b92f4>   DW_AT_decl_column : 21
    <b92f5>   DW_AT_type        : <0xb9290>
    <b92f9>   DW_AT_data_member_location: 8
 <2><b92fa>: Abbrev Number: 2 (DW_TAG_member)
    <b92fb>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b92ff>   DW_AT_decl_file   : 7
    <b9300>   DW_AT_decl_line   : 101
    <b9301>   DW_AT_decl_column : 21
    <b9302>   DW_AT_type        : <0xb91ff>
    <b9306>   DW_AT_data_member_location: 16
 <2><b9307>: Abbrev Number: 2 (DW_TAG_member)
    <b9308>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b930c>   DW_AT_decl_file   : 7
    <b930d>   DW_AT_decl_line   : 102
    <b930e>   DW_AT_decl_column : 21
    <b930f>   DW_AT_type        : <0xb916c>
    <b9313>   DW_AT_data_member_location: 24
 <2><b9314>: Abbrev Number: 2 (DW_TAG_member)
    <b9315>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <b9319>   DW_AT_decl_file   : 7
    <b931a>   DW_AT_decl_line   : 103
    <b931b>   DW_AT_decl_column : 21
    <b931c>   DW_AT_type        : <0xb916c>
    <b9320>   DW_AT_data_member_location: 28
 <2><b9321>: Abbrev Number: 2 (DW_TAG_member)
    <b9322>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <b9326>   DW_AT_decl_file   : 7
    <b9327>   DW_AT_decl_line   : 104
    <b9328>   DW_AT_decl_column : 21
    <b9329>   DW_AT_type        : <0xb916c>
    <b932d>   DW_AT_data_member_location: 32
 <2><b932e>: Abbrev Number: 2 (DW_TAG_member)
    <b932f>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <b9333>   DW_AT_decl_file   : 7
    <b9334>   DW_AT_decl_line   : 105
    <b9335>   DW_AT_decl_column : 21
    <b9336>   DW_AT_type        : <0xb9150>
    <b933a>   DW_AT_data_member_location: 36
 <2><b933b>: Abbrev Number: 2 (DW_TAG_member)
    <b933c>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <b9340>   DW_AT_decl_file   : 7
    <b9341>   DW_AT_decl_line   : 106
    <b9342>   DW_AT_decl_column : 21
    <b9343>   DW_AT_type        : <0xb9150>
    <b9347>   DW_AT_data_member_location: 40
 <2><b9348>: Abbrev Number: 2 (DW_TAG_member)
    <b9349>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <b934d>   DW_AT_decl_file   : 7
    <b934e>   DW_AT_decl_line   : 109
    <b934f>   DW_AT_decl_column : 21
    <b9350>   DW_AT_type        : <0xb91e4>
    <b9354>   DW_AT_data_member_location: 44
 <2><b9355>: Abbrev Number: 2 (DW_TAG_member)
    <b9356>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <b935a>   DW_AT_decl_file   : 7
    <b935b>   DW_AT_decl_line   : 110
    <b935c>   DW_AT_decl_column : 21
    <b935d>   DW_AT_type        : <0xb91a0>
    <b9361>   DW_AT_data_member_location: 48
 <2><b9362>: Abbrev Number: 2 (DW_TAG_member)
    <b9363>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b9367>   DW_AT_decl_file   : 7
    <b9368>   DW_AT_decl_line   : 112
    <b9369>   DW_AT_decl_column : 22
    <b936a>   DW_AT_type        : <0xb9622>
    <b936e>   DW_AT_data_member_location: 56
 <2><b936f>: Abbrev Number: 2 (DW_TAG_member)
    <b9370>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <b9374>   DW_AT_decl_file   : 7
    <b9375>   DW_AT_decl_line   : 114
    <b9376>   DW_AT_decl_column : 14
    <b9377>   DW_AT_type        : <0xb9186>
    <b937b>   DW_AT_data_member_location: 64
 <2><b937c>: Abbrev Number: 2 (DW_TAG_member)
    <b937d>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <b9381>   DW_AT_decl_file   : 7
    <b9382>   DW_AT_decl_line   : 116
    <b9383>   DW_AT_decl_column : 22
    <b9384>   DW_AT_type        : <0xb92c1>
    <b9388>   DW_AT_data_member_location: 72
 <2><b9389>: Abbrev Number: 0
 <1><b938a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b938b>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <b938f>   DW_AT_decl_file   : 7
    <b9390>   DW_AT_decl_line   : 59
    <b9391>   DW_AT_decl_column : 15
    <b9392>   DW_AT_type        : <0xb9396>
 <1><b9396>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9397>   DW_AT_byte_size   : 8
    <b9397>   DW_AT_type        : <0xb939b>
 <1><b939b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b939c>   DW_AT_prototyped  : 1
    <b939c>   DW_AT_type        : <0xb916c>
    <b93a0>   DW_AT_sibling     : <0xb93aa>
 <2><b93a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b93a5>   DW_AT_type        : <0xb92c1>
 <2><b93a9>: Abbrev Number: 0
 <1><b93aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <b93ab>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <b93af>   DW_AT_decl_file   : 7
    <b93b0>   DW_AT_decl_line   : 60
    <b93b1>   DW_AT_decl_column : 15
    <b93b2>   DW_AT_type        : <0xb9396>
 <1><b93b6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b93b7>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <b93bb>   DW_AT_decl_file   : 7
    <b93bc>   DW_AT_decl_line   : 61
    <b93bd>   DW_AT_decl_column : 15
    <b93be>   DW_AT_type        : <0xb93c2>
 <1><b93c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b93c3>   DW_AT_byte_size   : 8
    <b93c3>   DW_AT_type        : <0xb93c7>
 <1><b93c7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b93c8>   DW_AT_prototyped  : 1
    <b93c8>   DW_AT_type        : <0xb916c>
    <b93cc>   DW_AT_sibling     : <0xb93e0>
 <2><b93d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b93d1>   DW_AT_type        : <0xb92c1>
 <2><b93d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b93d6>   DW_AT_type        : <0xb91ff>
 <2><b93da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b93db>   DW_AT_type        : <0xb916c>
 <2><b93df>: Abbrev Number: 0
 <1><b93e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b93e1>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <b93e5>   DW_AT_decl_file   : 7
    <b93e6>   DW_AT_decl_line   : 62
    <b93e7>   DW_AT_decl_column : 15
    <b93e8>   DW_AT_type        : <0xb93ec>
 <1><b93ec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b93ed>   DW_AT_byte_size   : 8
    <b93ed>   DW_AT_type        : <0xb93f1>
 <1><b93f1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b93f2>   DW_AT_prototyped  : 1
    <b93f2>   DW_AT_type        : <0xb916c>
    <b93f6>   DW_AT_sibling     : <0xb9405>
 <2><b93fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b93fb>   DW_AT_type        : <0xb92c1>
 <2><b93ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9400>   DW_AT_type        : <0xb9405>
 <2><b9404>: Abbrev Number: 0
 <1><b9405>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9406>   DW_AT_byte_size   : 8
    <b9406>   DW_AT_type        : <0xb91ff>
 <1><b940a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b940b>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <b940f>   DW_AT_decl_file   : 7
    <b9410>   DW_AT_decl_line   : 63
    <b9411>   DW_AT_decl_column : 15
    <b9412>   DW_AT_type        : <0xb9416>
 <1><b9416>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9417>   DW_AT_byte_size   : 8
    <b9417>   DW_AT_type        : <0xb941b>
 <1><b941b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b941c>   DW_AT_prototyped  : 1
    <b941c>   DW_AT_type        : <0xb916c>
    <b9420>   DW_AT_sibling     : <0xb9434>
 <2><b9424>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9425>   DW_AT_type        : <0xb92c1>
 <2><b9429>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b942a>   DW_AT_type        : <0xb9186>
 <2><b942e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b942f>   DW_AT_type        : <0xb9434>
 <2><b9433>: Abbrev Number: 0
 <1><b9434>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9435>   DW_AT_byte_size   : 8
    <b9435>   DW_AT_type        : <0xb91a0>
 <1><b9439>: Abbrev Number: 3 (DW_TAG_typedef)
    <b943a>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <b943e>   DW_AT_decl_file   : 7
    <b943f>   DW_AT_decl_line   : 65
    <b9440>   DW_AT_decl_column : 15
    <b9441>   DW_AT_type        : <0xb9445>
 <1><b9445>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9446>   DW_AT_byte_size   : 8
    <b9446>   DW_AT_type        : <0xb944a>
 <1><b944a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b944b>   DW_AT_prototyped  : 1
    <b944b>   DW_AT_type        : <0xb916c>
    <b944f>   DW_AT_sibling     : <0xb9463>
 <2><b9453>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9454>   DW_AT_type        : <0xb92c1>
 <2><b9458>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9459>   DW_AT_type        : <0xb9260>
 <2><b945d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b945e>   DW_AT_type        : <0xb9434>
 <2><b9462>: Abbrev Number: 0
 <1><b9463>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9464>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <b9468>   DW_AT_decl_file   : 7
    <b9469>   DW_AT_decl_line   : 67
    <b946a>   DW_AT_decl_column : 15
    <b946b>   DW_AT_type        : <0xb946f>
 <1><b946f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9470>   DW_AT_byte_size   : 8
    <b9470>   DW_AT_type        : <0xb9474>
 <1><b9474>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9475>   DW_AT_prototyped  : 1
    <b9475>   DW_AT_type        : <0xb916c>
    <b9479>   DW_AT_sibling     : <0xb948d>
 <2><b947d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b947e>   DW_AT_type        : <0xb92c1>
 <2><b9482>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9483>   DW_AT_type        : <0xb91f4>
 <2><b9487>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9488>   DW_AT_type        : <0xb91a0>
 <2><b948c>: Abbrev Number: 0
 <1><b948d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b948e>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <b9492>   DW_AT_decl_file   : 7
    <b9493>   DW_AT_decl_line   : 69
    <b9494>   DW_AT_decl_column : 15
    <b9495>   DW_AT_type        : <0xb9499>
 <1><b9499>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b949a>   DW_AT_byte_size   : 8
    <b949a>   DW_AT_type        : <0xb949e>
 <1><b949e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b949f>   DW_AT_prototyped  : 1
    <b949f>   DW_AT_type        : <0xb916c>
    <b94a3>   DW_AT_sibling     : <0xb94b7>
 <2><b94a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94a8>   DW_AT_type        : <0xb92c1>
 <2><b94ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94ad>   DW_AT_type        : <0xb94b7>
 <2><b94b1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94b2>   DW_AT_type        : <0xb91a0>
 <2><b94b6>: Abbrev Number: 0
 <1><b94b7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b94b8>   DW_AT_byte_size   : 8
    <b94b8>   DW_AT_type        : <0xb91b9>
 <1><b94bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <b94bd>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <b94c1>   DW_AT_decl_file   : 7
    <b94c2>   DW_AT_decl_line   : 71
    <b94c3>   DW_AT_decl_column : 15
    <b94c4>   DW_AT_type        : <0xb94c8>
 <1><b94c8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b94c9>   DW_AT_byte_size   : 8
    <b94c9>   DW_AT_type        : <0xb94cd>
 <1><b94cd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b94ce>   DW_AT_prototyped  : 1
    <b94ce>   DW_AT_type        : <0xb916c>
    <b94d2>   DW_AT_sibling     : <0xb94e6>
 <2><b94d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94d7>   DW_AT_type        : <0xb92c1>
 <2><b94db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94dc>   DW_AT_type        : <0xb91ff>
 <2><b94e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b94e1>   DW_AT_type        : <0xb91ff>
 <2><b94e5>: Abbrev Number: 0
 <1><b94e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b94e7>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <b94eb>   DW_AT_decl_file   : 7
    <b94ec>   DW_AT_decl_line   : 73
    <b94ed>   DW_AT_decl_column : 15
    <b94ee>   DW_AT_type        : <0xb94c8>
 <1><b94f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <b94f3>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <b94f7>   DW_AT_decl_file   : 7
    <b94f8>   DW_AT_decl_line   : 75
    <b94f9>   DW_AT_decl_column : 15
    <b94fa>   DW_AT_type        : <0xb94fe>
 <1><b94fe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b94ff>   DW_AT_byte_size   : 8
    <b94ff>   DW_AT_type        : <0xb9503>
 <1><b9503>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9504>   DW_AT_prototyped  : 1
    <b9504>   DW_AT_type        : <0xb916c>
    <b9508>   DW_AT_sibling     : <0xb9517>
 <2><b950c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b950d>   DW_AT_type        : <0xb92c1>
 <2><b9511>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9512>   DW_AT_type        : <0xb9517>
 <2><b9516>: Abbrev Number: 0
 <1><b9517>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9518>   DW_AT_byte_size   : 8
    <b9518>   DW_AT_type        : <0xb9246>
 <1><b951c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b951d>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <b9521>   DW_AT_decl_file   : 7
    <b9522>   DW_AT_decl_line   : 76
    <b9523>   DW_AT_decl_column : 15
    <b9524>   DW_AT_type        : <0xb9528>
 <1><b9528>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9529>   DW_AT_byte_size   : 8
    <b9529>   DW_AT_type        : <0xb952d>
 <1><b952d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b952e>   DW_AT_prototyped  : 1
    <b952e>   DW_AT_type        : <0xb916c>
    <b9532>   DW_AT_sibling     : <0xb9546>
 <2><b9536>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9537>   DW_AT_type        : <0xb92c1>
 <2><b953b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b953c>   DW_AT_type        : <0xb9260>
 <2><b9540>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9541>   DW_AT_type        : <0xb91d1>
 <2><b9545>: Abbrev Number: 0
 <1><b9546>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9547>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <b954b>   DW_AT_decl_file   : 7
    <b954c>   DW_AT_decl_line   : 77
    <b954d>   DW_AT_decl_column : 15
    <b954e>   DW_AT_type        : <0xb9396>
 <1><b9552>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b9553>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <b9557>   DW_AT_byte_size   : 112
    <b9558>   DW_AT_decl_file   : 7
    <b9559>   DW_AT_decl_line   : 80
    <b955a>   DW_AT_decl_column : 16
    <b955b>   DW_AT_sibling     : <0xb9616>
 <2><b955f>: Abbrev Number: 2 (DW_TAG_member)
    <b9560>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <b9564>   DW_AT_decl_file   : 7
    <b9565>   DW_AT_decl_line   : 81
    <b9566>   DW_AT_decl_column : 25
    <b9567>   DW_AT_type        : <0xb938a>
    <b956b>   DW_AT_data_member_location: 0
 <2><b956c>: Abbrev Number: 2 (DW_TAG_member)
    <b956d>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <b9571>   DW_AT_decl_file   : 7
    <b9572>   DW_AT_decl_line   : 82
    <b9573>   DW_AT_decl_column : 25
    <b9574>   DW_AT_type        : <0xb93aa>
    <b9578>   DW_AT_data_member_location: 8
 <2><b9579>: Abbrev Number: 2 (DW_TAG_member)
    <b957a>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <b957e>   DW_AT_decl_file   : 7
    <b957f>   DW_AT_decl_line   : 83
    <b9580>   DW_AT_decl_column : 25
    <b9581>   DW_AT_type        : <0xb93b6>
    <b9585>   DW_AT_data_member_location: 16
 <2><b9586>: Abbrev Number: 2 (DW_TAG_member)
    <b9587>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <b958b>   DW_AT_decl_file   : 7
    <b958c>   DW_AT_decl_line   : 84
    <b958d>   DW_AT_decl_column : 25
    <b958e>   DW_AT_type        : <0xb93e0>
    <b9592>   DW_AT_data_member_location: 24
 <2><b9593>: Abbrev Number: 2 (DW_TAG_member)
    <b9594>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <b9598>   DW_AT_decl_file   : 7
    <b9599>   DW_AT_decl_line   : 85
    <b959a>   DW_AT_decl_column : 25
    <b959b>   DW_AT_type        : <0xb940a>
    <b959f>   DW_AT_data_member_location: 32
 <2><b95a0>: Abbrev Number: 2 (DW_TAG_member)
    <b95a1>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <b95a5>   DW_AT_decl_file   : 7
    <b95a6>   DW_AT_decl_line   : 86
    <b95a7>   DW_AT_decl_column : 25
    <b95a8>   DW_AT_type        : <0xb9439>
    <b95ac>   DW_AT_data_member_location: 40
 <2><b95ad>: Abbrev Number: 2 (DW_TAG_member)
    <b95ae>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <b95b2>   DW_AT_decl_file   : 7
    <b95b3>   DW_AT_decl_line   : 87
    <b95b4>   DW_AT_decl_column : 25
    <b95b5>   DW_AT_type        : <0xb9463>
    <b95b9>   DW_AT_data_member_location: 48
 <2><b95ba>: Abbrev Number: 2 (DW_TAG_member)
    <b95bb>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <b95bf>   DW_AT_decl_file   : 7
    <b95c0>   DW_AT_decl_line   : 88
    <b95c1>   DW_AT_decl_column : 25
    <b95c2>   DW_AT_type        : <0xb948d>
    <b95c6>   DW_AT_data_member_location: 56
 <2><b95c7>: Abbrev Number: 2 (DW_TAG_member)
    <b95c8>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <b95cc>   DW_AT_decl_file   : 7
    <b95cd>   DW_AT_decl_line   : 89
    <b95ce>   DW_AT_decl_column : 25
    <b95cf>   DW_AT_type        : <0xb94bc>
    <b95d3>   DW_AT_data_member_location: 64
 <2><b95d4>: Abbrev Number: 2 (DW_TAG_member)
    <b95d5>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <b95d9>   DW_AT_decl_file   : 7
    <b95da>   DW_AT_decl_line   : 90
    <b95db>   DW_AT_decl_column : 25
    <b95dc>   DW_AT_type        : <0xb94e6>
    <b95e0>   DW_AT_data_member_location: 72
 <2><b95e1>: Abbrev Number: 2 (DW_TAG_member)
    <b95e2>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <b95e6>   DW_AT_decl_file   : 7
    <b95e7>   DW_AT_decl_line   : 91
    <b95e8>   DW_AT_decl_column : 25
    <b95e9>   DW_AT_type        : <0xb94f2>
    <b95ed>   DW_AT_data_member_location: 80
 <2><b95ee>: Abbrev Number: 2 (DW_TAG_member)
    <b95ef>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <b95f3>   DW_AT_decl_file   : 7
    <b95f4>   DW_AT_decl_line   : 92
    <b95f5>   DW_AT_decl_column : 25
    <b95f6>   DW_AT_type        : <0xb951c>
    <b95fa>   DW_AT_data_member_location: 88
 <2><b95fb>: Abbrev Number: 2 (DW_TAG_member)
    <b95fc>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <b9600>   DW_AT_decl_file   : 7
    <b9601>   DW_AT_decl_line   : 93
    <b9602>   DW_AT_decl_column : 25
    <b9603>   DW_AT_type        : <0xb929c>
    <b9607>   DW_AT_data_member_location: 96
 <2><b9608>: Abbrev Number: 2 (DW_TAG_member)
    <b9609>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <b960d>   DW_AT_decl_file   : 7
    <b960e>   DW_AT_decl_line   : 94
    <b960f>   DW_AT_decl_column : 25
    <b9610>   DW_AT_type        : <0xb9546>
    <b9614>   DW_AT_data_member_location: 104
 <2><b9615>: Abbrev Number: 0
 <1><b9616>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9617>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <b961b>   DW_AT_decl_file   : 7
    <b961c>   DW_AT_decl_line   : 95
    <b961d>   DW_AT_decl_column : 3
    <b961e>   DW_AT_type        : <0xb9552>
 <1><b9622>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9623>   DW_AT_byte_size   : 8
    <b9623>   DW_AT_type        : <0xb9616>
 <1><b9627>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9628>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <b962c>   DW_AT_decl_file   : 7
    <b962d>   DW_AT_decl_line   : 117
    <b962e>   DW_AT_decl_column : 3
    <b962f>   DW_AT_type        : <0xb92c6>
 <1><b9633>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b9634>   DW_AT_byte_size   : 8
    <b9635>   DW_AT_decl_file   : 8
    <b9635>   DW_AT_decl_line   : 4
    <b9636>   DW_AT_decl_column : 3
    <b9636>   DW_AT_sibling     : <0xb9655>
 <2><b963a>: Abbrev Number: 2 (DW_TAG_member)
    <b963b>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <b963f>   DW_AT_decl_file   : 8
    <b9640>   DW_AT_decl_line   : 5
    <b9641>   DW_AT_decl_column : 8
    <b9642>   DW_AT_type        : <0xb916c>
    <b9646>   DW_AT_data_member_location: 0
 <2><b9647>: Abbrev Number: 2 (DW_TAG_member)
    <b9648>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <b964c>   DW_AT_decl_file   : 8
    <b964d>   DW_AT_decl_line   : 6
    <b964e>   DW_AT_decl_column : 8
    <b964f>   DW_AT_type        : <0xb916c>
    <b9653>   DW_AT_data_member_location: 4
 <2><b9654>: Abbrev Number: 0
 <1><b9655>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b9656>   DW_AT_byte_size   : 16
    <b9657>   DW_AT_decl_file   : 8
    <b9657>   DW_AT_decl_line   : 8
    <b9658>   DW_AT_decl_column : 3
    <b9658>   DW_AT_sibling     : <0xb968b>
 <2><b965c>: Abbrev Number: 7 (DW_TAG_member)
    <b965d>   DW_AT_name        : x
    <b965f>   DW_AT_decl_file   : 8
    <b9660>   DW_AT_decl_line   : 9
    <b9661>   DW_AT_decl_column : 8
    <b9662>   DW_AT_type        : <0xb916c>
    <b9666>   DW_AT_data_member_location: 0
 <2><b9667>: Abbrev Number: 7 (DW_TAG_member)
    <b9668>   DW_AT_name        : y
    <b966a>   DW_AT_decl_file   : 8
    <b966b>   DW_AT_decl_line   : 9
    <b966c>   DW_AT_decl_column : 11
    <b966d>   DW_AT_type        : <0xb916c>
    <b9671>   DW_AT_data_member_location: 4
 <2><b9672>: Abbrev Number: 7 (DW_TAG_member)
    <b9673>   DW_AT_name        : dx
    <b9676>   DW_AT_decl_file   : 8
    <b9677>   DW_AT_decl_line   : 10
    <b9678>   DW_AT_decl_column : 8
    <b9679>   DW_AT_type        : <0xb916c>
    <b967d>   DW_AT_data_member_location: 8
 <2><b967e>: Abbrev Number: 7 (DW_TAG_member)
    <b967f>   DW_AT_name        : dy
    <b9682>   DW_AT_decl_file   : 8
    <b9683>   DW_AT_decl_line   : 10
    <b9684>   DW_AT_decl_column : 12
    <b9685>   DW_AT_type        : <0xb916c>
    <b9689>   DW_AT_data_member_location: 12
 <2><b968a>: Abbrev Number: 0
 <1><b968b>: Abbrev Number: 27 (DW_TAG_union_type)
    <b968c>   DW_AT_byte_size   : 16
    <b968d>   DW_AT_decl_file   : 8
    <b968e>   DW_AT_decl_line   : 3
    <b968f>   DW_AT_decl_column : 2
    <b9690>   DW_AT_sibling     : <0xb96bb>
 <2><b9694>: Abbrev Number: 16 (DW_TAG_member)
    <b9695>   DW_AT_type        : <0xb9633>
 <2><b9699>: Abbrev Number: 16 (DW_TAG_member)
    <b969a>   DW_AT_type        : <0xb9655>
 <2><b969e>: Abbrev Number: 28 (DW_TAG_member)
    <b969f>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <b96a3>   DW_AT_decl_file   : 8
    <b96a4>   DW_AT_decl_line   : 12
    <b96a5>   DW_AT_decl_column : 7
    <b96a6>   DW_AT_type        : <0xb916c>
 <2><b96aa>: Abbrev Number: 17 (DW_TAG_member)
    <b96ab>   DW_AT_name        : z
    <b96ad>   DW_AT_decl_file   : 8
    <b96ad>   DW_AT_decl_line   : 13
    <b96ae>   DW_AT_decl_column : 7
    <b96ae>   DW_AT_type        : <0xb916c>
 <2><b96b2>: Abbrev Number: 17 (DW_TAG_member)
    <b96b3>   DW_AT_name        : w
    <b96b5>   DW_AT_decl_file   : 8
    <b96b5>   DW_AT_decl_line   : 14
    <b96b6>   DW_AT_decl_column : 7
    <b96b6>   DW_AT_type        : <0xb916c>
 <2><b96ba>: Abbrev Number: 0
 <1><b96bb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b96bc>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <b96c0>   DW_AT_byte_size   : 20
    <b96c1>   DW_AT_decl_file   : 8
    <b96c2>   DW_AT_decl_line   : 1
    <b96c3>   DW_AT_decl_column : 8
    <b96c4>   DW_AT_sibling     : <0xb96dc>
 <2><b96c8>: Abbrev Number: 2 (DW_TAG_member)
    <b96c9>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b96cd>   DW_AT_decl_file   : 8
    <b96ce>   DW_AT_decl_line   : 2
    <b96cf>   DW_AT_decl_column : 6
    <b96d0>   DW_AT_type        : <0xb916c>
    <b96d4>   DW_AT_data_member_location: 0
 <2><b96d5>: Abbrev Number: 29 (DW_TAG_member)
    <b96d6>   DW_AT_type        : <0xb968b>
    <b96da>   DW_AT_data_member_location: 4
 <2><b96db>: Abbrev Number: 0
 <1><b96dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <b96dd>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <b96e1>   DW_AT_decl_file   : 8
    <b96e2>   DW_AT_decl_line   : 18
    <b96e3>   DW_AT_decl_column : 23
    <b96e4>   DW_AT_type        : <0xb96bb>
 <1><b96e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b96e9>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <b96ed>   DW_AT_decl_file   : 9
    <b96ee>   DW_AT_decl_line   : 1
    <b96ef>   DW_AT_decl_column : 23
    <b96f0>   DW_AT_type        : <0xb96f4>
 <1><b96f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b96f5>   DW_AT_byte_size   : 8
    <b96f5>   DW_AT_type        : <0xb96f9>
 <1><b96f9>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <b96fa>   DW_AT_prototyped  : 1
    <b96fa>   DW_AT_type        : <0xb9517>
 <1><b96fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <b96ff>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <b9703>   DW_AT_decl_file   : 9
    <b9704>   DW_AT_decl_line   : 2
    <b9705>   DW_AT_decl_column : 23
    <b9706>   DW_AT_type        : <0xb970a>
 <1><b970a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b970b>   DW_AT_byte_size   : 8
    <b970b>   DW_AT_type        : <0xb970f>
 <1><b970f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <b9710>   DW_AT_prototyped  : 1
    <b9710>   DW_AT_type        : <0xb916c>
 <1><b9714>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9715>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <b9719>   DW_AT_decl_file   : 9
    <b971a>   DW_AT_decl_line   : 3
    <b971b>   DW_AT_decl_column : 23
    <b971c>   DW_AT_type        : <0xb970a>
 <1><b9720>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9721>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <b9725>   DW_AT_decl_file   : 9
    <b9726>   DW_AT_decl_line   : 10
    <b9727>   DW_AT_decl_column : 23
    <b9728>   DW_AT_type        : <0xb972c>
 <1><b972c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b972d>   DW_AT_byte_size   : 8
    <b972d>   DW_AT_type        : <0xb9731>
 <1><b9731>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b9732>   DW_AT_prototyped  : 1
    <b9732>   DW_AT_sibling     : <0xb973c>
 <2><b9736>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9737>   DW_AT_type        : <0xb916c>
 <2><b973b>: Abbrev Number: 0
 <1><b973c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b973d>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <b9741>   DW_AT_decl_file   : 9
    <b9742>   DW_AT_decl_line   : 14
    <b9743>   DW_AT_decl_column : 23
    <b9744>   DW_AT_type        : <0xb9748>
 <1><b9748>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9749>   DW_AT_byte_size   : 8
    <b9749>   DW_AT_type        : <0xb974d>
 <1><b974d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b974e>   DW_AT_prototyped  : 1
    <b974e>   DW_AT_type        : <0xb916c>
    <b9752>   DW_AT_sibling     : <0xb9766>
 <2><b9756>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9757>   DW_AT_type        : <0xb916c>
 <2><b975b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b975c>   DW_AT_type        : <0xb916c>
 <2><b9760>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9761>   DW_AT_type        : <0xb916c>
 <2><b9765>: Abbrev Number: 0
 <1><b9766>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9767>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <b976b>   DW_AT_decl_file   : 9
    <b976c>   DW_AT_decl_line   : 18
    <b976d>   DW_AT_decl_column : 23
    <b976e>   DW_AT_type        : <0xb9748>
 <1><b9772>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9773>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <b9777>   DW_AT_decl_file   : 9
    <b9778>   DW_AT_decl_line   : 24
    <b9779>   DW_AT_decl_column : 23
    <b977a>   DW_AT_type        : <0xb920b>
 <1><b977e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b977f>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <b9783>   DW_AT_decl_file   : 9
    <b9784>   DW_AT_decl_line   : 28
    <b9785>   DW_AT_decl_column : 23
    <b9786>   DW_AT_type        : <0xb978a>
 <1><b978a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b978b>   DW_AT_byte_size   : 8
    <b978b>   DW_AT_type        : <0xb978f>
 <1><b978f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9790>   DW_AT_prototyped  : 1
    <b9790>   DW_AT_type        : <0xb916c>
    <b9794>   DW_AT_sibling     : <0xb97a3>
 <2><b9798>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9799>   DW_AT_type        : <0xb916c>
 <2><b979d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b979e>   DW_AT_type        : <0xb916c>
 <2><b97a2>: Abbrev Number: 0
 <1><b97a3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b97a4>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <b97a8>   DW_AT_decl_file   : 9
    <b97a9>   DW_AT_decl_line   : 34
    <b97aa>   DW_AT_decl_column : 23
    <b97ab>   DW_AT_type        : <0xb970a>
 <1><b97af>: Abbrev Number: 3 (DW_TAG_typedef)
    <b97b0>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <b97b4>   DW_AT_decl_file   : 9
    <b97b5>   DW_AT_decl_line   : 35
    <b97b6>   DW_AT_decl_column : 23
    <b97b7>   DW_AT_type        : <0xb970a>
 <1><b97bb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b97bc>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <b97c0>   DW_AT_decl_file   : 9
    <b97c1>   DW_AT_decl_line   : 36
    <b97c2>   DW_AT_decl_column : 23
    <b97c3>   DW_AT_type        : <0xb97c7>
 <1><b97c7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b97c8>   DW_AT_byte_size   : 8
    <b97c8>   DW_AT_type        : <0xb97cc>
 <1><b97cc>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b97cd>   DW_AT_prototyped  : 1
    <b97cd>   DW_AT_sibling     : <0xb97dc>
 <2><b97d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b97d2>   DW_AT_type        : <0xb97dc>
 <2><b97d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b97d7>   DW_AT_type        : <0xb97dc>
 <2><b97db>: Abbrev Number: 0
 <1><b97dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b97dd>   DW_AT_byte_size   : 8
    <b97dd>   DW_AT_type        : <0xb916c>
 <1><b97e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b97e2>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <b97e6>   DW_AT_decl_file   : 9
    <b97e7>   DW_AT_decl_line   : 37
    <b97e8>   DW_AT_decl_column : 23
    <b97e9>   DW_AT_type        : <0xb97c7>
 <1><b97ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <b97ee>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <b97f2>   DW_AT_decl_file   : 9
    <b97f3>   DW_AT_decl_line   : 45
    <b97f4>   DW_AT_decl_column : 24
    <b97f5>   DW_AT_type        : <0xb97f9>
 <1><b97f9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b97fa>   DW_AT_byte_size   : 8
    <b97fa>   DW_AT_type        : <0xb97fe>
 <1><b97fe>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b97ff>   DW_AT_prototyped  : 1
    <b97ff>   DW_AT_type        : <0xb9150>
    <b9803>   DW_AT_sibling     : <0xb9817>
 <2><b9807>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9808>   DW_AT_type        : <0xb916c>
 <2><b980c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b980d>   DW_AT_type        : <0xb916c>
 <2><b9811>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9812>   DW_AT_type        : <0xb916c>
 <2><b9816>: Abbrev Number: 0
 <1><b9817>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9818>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <b981c>   DW_AT_decl_file   : 9
    <b981d>   DW_AT_decl_line   : 48
    <b981e>   DW_AT_decl_column : 23
    <b981f>   DW_AT_type        : <0xb9823>
 <1><b9823>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9824>   DW_AT_byte_size   : 8
    <b9824>   DW_AT_type        : <0xb9828>
 <1><b9828>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b9829>   DW_AT_prototyped  : 1
    <b9829>   DW_AT_sibling     : <0xb983d>
 <2><b982d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b982e>   DW_AT_type        : <0xb91f4>
 <2><b9832>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9833>   DW_AT_type        : <0xb91a0>
 <2><b9837>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9838>   DW_AT_type        : <0xb916c>
 <2><b983c>: Abbrev Number: 0
 <1><b983d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b983e>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <b9842>   DW_AT_decl_file   : 9
    <b9843>   DW_AT_decl_line   : 49
    <b9844>   DW_AT_decl_column : 23
    <b9845>   DW_AT_type        : <0xb9849>
 <1><b9849>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b984a>   DW_AT_byte_size   : 8
    <b984a>   DW_AT_type        : <0xb984e>
 <1><b984e>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b984f>   DW_AT_prototyped  : 1
    <b984f>   DW_AT_sibling     : <0xb9863>
 <2><b9853>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9854>   DW_AT_type        : <0xb94b7>
 <2><b9858>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9859>   DW_AT_type        : <0xb91a0>
 <2><b985d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b985e>   DW_AT_type        : <0xb916c>
 <2><b9862>: Abbrev Number: 0
 <1><b9863>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9864>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <b9868>   DW_AT_decl_file   : 9
    <b9869>   DW_AT_decl_line   : 51
    <b986a>   DW_AT_decl_column : 24
    <b986b>   DW_AT_type        : <0xb986f>
 <1><b986f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9870>   DW_AT_byte_size   : 8
    <b9870>   DW_AT_type        : <0xb9874>
 <1><b9874>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9875>   DW_AT_prototyped  : 1
    <b9875>   DW_AT_type        : <0xb9194>
    <b9879>   DW_AT_sibling     : <0xb9888>
 <2><b987d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b987e>   DW_AT_type        : <0xb9194>
 <2><b9882>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9883>   DW_AT_type        : <0xb91d1>
 <2><b9887>: Abbrev Number: 0
 <1><b9888>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9889>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <b988d>   DW_AT_decl_file   : 9
    <b988e>   DW_AT_decl_line   : 54
    <b988f>   DW_AT_decl_column : 23
    <b9890>   DW_AT_type        : <0xb9894>
 <1><b9894>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9895>   DW_AT_byte_size   : 8
    <b9895>   DW_AT_type        : <0xb9899>
 <1><b9899>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b989a>   DW_AT_prototyped  : 1
    <b989a>   DW_AT_type        : <0xb916c>
    <b989e>   DW_AT_sibling     : <0xb98c1>
 <2><b98a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98a3>   DW_AT_type        : <0xb9517>
 <2><b98a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98a8>   DW_AT_type        : <0xb9186>
 <2><b98ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98ad>   DW_AT_type        : <0xb91d1>
 <2><b98b1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98b2>   DW_AT_type        : <0xb916c>
 <2><b98b6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98b7>   DW_AT_type        : <0xb916c>
 <2><b98bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98bc>   DW_AT_type        : <0xb916c>
 <2><b98c0>: Abbrev Number: 0
 <1><b98c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b98c2>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b98c6>   DW_AT_decl_file   : 9
    <b98c7>   DW_AT_decl_line   : 56
    <b98c8>   DW_AT_decl_column : 23
    <b98c9>   DW_AT_type        : <0xb98cd>
 <1><b98cd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b98ce>   DW_AT_byte_size   : 8
    <b98ce>   DW_AT_type        : <0xb98d2>
 <1><b98d2>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b98d3>   DW_AT_prototyped  : 1
    <b98d3>   DW_AT_type        : <0xb916c>
    <b98d7>   DW_AT_sibling     : <0xb98f5>
 <2><b98db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98dc>   DW_AT_type        : <0xb94b7>
 <2><b98e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98e1>   DW_AT_type        : <0xb9260>
 <2><b98e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98e6>   DW_AT_type        : <0xb91d1>
 <2><b98ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98eb>   DW_AT_type        : <0xb916c>
 <2><b98ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b98f0>   DW_AT_type        : <0xb916c>
 <2><b98f4>: Abbrev Number: 0
 <1><b98f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b98f6>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <b98fa>   DW_AT_decl_file   : 9
    <b98fb>   DW_AT_decl_line   : 67
    <b98fc>   DW_AT_decl_column : 23
    <b98fd>   DW_AT_type        : <0xb9901>
 <1><b9901>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9902>   DW_AT_byte_size   : 8
    <b9902>   DW_AT_type        : <0xb9906>
 <1><b9906>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9907>   DW_AT_prototyped  : 1
    <b9907>   DW_AT_type        : <0xb916c>
    <b990b>   DW_AT_sibling     : <0xb9915>
 <2><b990f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9910>   DW_AT_type        : <0xb916c>
 <2><b9914>: Abbrev Number: 0
 <1><b9915>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9916>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <b991a>   DW_AT_decl_file   : 9
    <b991b>   DW_AT_decl_line   : 68
    <b991c>   DW_AT_decl_column : 23
    <b991d>   DW_AT_type        : <0xb9921>
 <1><b9921>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9922>   DW_AT_byte_size   : 8
    <b9922>   DW_AT_type        : <0xb9926>
 <1><b9926>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b9927>   DW_AT_prototyped  : 1
    <b9927>   DW_AT_type        : <0xb916c>
    <b992b>   DW_AT_sibling     : <0xb9949>
 <2><b992f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9930>   DW_AT_type        : <0xb97dc>
 <2><b9934>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9935>   DW_AT_type        : <0xb97dc>
 <2><b9939>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b993a>   DW_AT_type        : <0xb97dc>
 <2><b993e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b993f>   DW_AT_type        : <0xb97dc>
 <2><b9943>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9944>   DW_AT_type        : <0xb97dc>
 <2><b9948>: Abbrev Number: 0
 <1><b9949>: Abbrev Number: 3 (DW_TAG_typedef)
    <b994a>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b994e>   DW_AT_decl_file   : 9
    <b994f>   DW_AT_decl_line   : 69
    <b9950>   DW_AT_decl_column : 23
    <b9951>   DW_AT_type        : <0xb9955>
 <1><b9955>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9956>   DW_AT_byte_size   : 8
    <b9956>   DW_AT_type        : <0xb995a>
 <1><b995a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b995b>   DW_AT_prototyped  : 1
    <b995b>   DW_AT_type        : <0xb916c>
    <b995f>   DW_AT_sibling     : <0xb9978>
 <2><b9963>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9964>   DW_AT_type        : <0xb916c>
 <2><b9968>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9969>   DW_AT_type        : <0xb916c>
 <2><b996d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b996e>   DW_AT_type        : <0xb916c>
 <2><b9972>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9973>   DW_AT_type        : <0xb916c>
 <2><b9977>: Abbrev Number: 0
 <1><b9978>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9979>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b997d>   DW_AT_decl_file   : 9
    <b997e>   DW_AT_decl_line   : 73
    <b997f>   DW_AT_decl_column : 23
    <b9980>   DW_AT_type        : <0xb9984>
 <1><b9984>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9985>   DW_AT_byte_size   : 8
    <b9985>   DW_AT_type        : <0xb9989>
 <1><b9989>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b998a>   DW_AT_prototyped  : 1
    <b998a>   DW_AT_type        : <0xb916c>
    <b998e>   DW_AT_sibling     : <0xb9998>
 <2><b9992>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9993>   DW_AT_type        : <0xb9149>
 <2><b9997>: Abbrev Number: 0
 <1><b9998>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9999>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b999d>   DW_AT_decl_file   : 9
    <b999e>   DW_AT_decl_line   : 74
    <b999f>   DW_AT_decl_column : 23
    <b99a0>   DW_AT_type        : <0xb99a4>
 <1><b99a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b99a5>   DW_AT_byte_size   : 8
    <b99a5>   DW_AT_type        : <0xb99a9>
 <1><b99a9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b99aa>   DW_AT_prototyped  : 1
    <b99aa>   DW_AT_type        : <0xb916c>
    <b99ae>   DW_AT_sibling     : <0xb99bd>
 <2><b99b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b99b3>   DW_AT_type        : <0xb9149>
 <2><b99b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b99b8>   DW_AT_type        : <0xb9142>
 <2><b99bc>: Abbrev Number: 0
 <1><b99bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b99be>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b99c2>   DW_AT_decl_file   : 9
    <b99c3>   DW_AT_decl_line   : 80
    <b99c4>   DW_AT_decl_column : 23
    <b99c5>   DW_AT_type        : <0xb972c>
 <1><b99c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <b99ca>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b99ce>   DW_AT_decl_file   : 9
    <b99cf>   DW_AT_decl_line   : 83
    <b99d0>   DW_AT_decl_column : 23
    <b99d1>   DW_AT_type        : <0xb9901>
 <1><b99d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b99d6>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b99da>   DW_AT_decl_file   : 9
    <b99db>   DW_AT_decl_line   : 86
    <b99dc>   DW_AT_decl_column : 23
    <b99dd>   DW_AT_type        : <0xb978a>
 <1><b99e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b99e2>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b99e6>   DW_AT_decl_file   : 9
    <b99e7>   DW_AT_decl_line   : 89
    <b99e8>   DW_AT_decl_column : 23
    <b99e9>   DW_AT_type        : <0xb978a>
 <1><b99ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <b99ee>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b99f2>   DW_AT_decl_file   : 9
    <b99f3>   DW_AT_decl_line   : 91
    <b99f4>   DW_AT_decl_column : 23
    <b99f5>   DW_AT_type        : <0xb99f9>
 <1><b99f9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b99fa>   DW_AT_byte_size   : 8
    <b99fa>   DW_AT_type        : <0xb99fe>
 <1><b99fe>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <b99ff>   DW_AT_prototyped  : 1
    <b99ff>   DW_AT_sibling     : <0xb9a09>
 <2><b9a03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b9a04>   DW_AT_type        : <0xb9a09>
 <2><b9a08>: Abbrev Number: 0
 <1><b9a09>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b9a0a>   DW_AT_byte_size   : 8
    <b9a0a>   DW_AT_type        : <0xb96dc>
 <1><b9a0e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b9a0f>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b9a13>   DW_AT_byte_size   : 224
    <b9a14>   DW_AT_decl_file   : 9
    <b9a15>   DW_AT_decl_line   : 93
    <b9a16>   DW_AT_decl_column : 16
    <b9a17>   DW_AT_sibling     : <0xb9b88>
 <2><b9a1b>: Abbrev Number: 2 (DW_TAG_member)
    <b9a1c>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b9a20>   DW_AT_decl_file   : 9
    <b9a21>   DW_AT_decl_line   : 94
    <b9a22>   DW_AT_decl_column : 23
    <b9a23>   DW_AT_type        : <0xb96e8>
    <b9a27>   DW_AT_data_member_location: 0
 <2><b9a28>: Abbrev Number: 2 (DW_TAG_member)
    <b9a29>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b9a2d>   DW_AT_decl_file   : 9
    <b9a2e>   DW_AT_decl_line   : 95
    <b9a2f>   DW_AT_decl_column : 23
    <b9a30>   DW_AT_type        : <0xb96fe>
    <b9a34>   DW_AT_data_member_location: 8
 <2><b9a35>: Abbrev Number: 2 (DW_TAG_member)
    <b9a36>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b9a3a>   DW_AT_decl_file   : 9
    <b9a3b>   DW_AT_decl_line   : 96
    <b9a3c>   DW_AT_decl_column : 23
    <b9a3d>   DW_AT_type        : <0xb9714>
    <b9a41>   DW_AT_data_member_location: 16
 <2><b9a42>: Abbrev Number: 2 (DW_TAG_member)
    <b9a43>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b9a47>   DW_AT_decl_file   : 9
    <b9a48>   DW_AT_decl_line   : 97
    <b9a49>   DW_AT_decl_column : 23
    <b9a4a>   DW_AT_type        : <0xb9720>
    <b9a4e>   DW_AT_data_member_location: 24
 <2><b9a4f>: Abbrev Number: 2 (DW_TAG_member)
    <b9a50>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b9a54>   DW_AT_decl_file   : 9
    <b9a55>   DW_AT_decl_line   : 98
    <b9a56>   DW_AT_decl_column : 23
    <b9a57>   DW_AT_type        : <0xb973c>
    <b9a5b>   DW_AT_data_member_location: 32
 <2><b9a5c>: Abbrev Number: 2 (DW_TAG_member)
    <b9a5d>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b9a61>   DW_AT_decl_file   : 9
    <b9a62>   DW_AT_decl_line   : 99
    <b9a63>   DW_AT_decl_column : 23
    <b9a64>   DW_AT_type        : <0xb9766>
    <b9a68>   DW_AT_data_member_location: 40
 <2><b9a69>: Abbrev Number: 2 (DW_TAG_member)
    <b9a6a>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b9a6e>   DW_AT_decl_file   : 9
    <b9a6f>   DW_AT_decl_line   : 100
    <b9a70>   DW_AT_decl_column : 23
    <b9a71>   DW_AT_type        : <0xb977e>
    <b9a75>   DW_AT_data_member_location: 48
 <2><b9a76>: Abbrev Number: 2 (DW_TAG_member)
    <b9a77>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b9a7b>   DW_AT_decl_file   : 9
    <b9a7c>   DW_AT_decl_line   : 101
    <b9a7d>   DW_AT_decl_column : 23
    <b9a7e>   DW_AT_type        : <0xb97a3>
    <b9a82>   DW_AT_data_member_location: 56
 <2><b9a83>: Abbrev Number: 2 (DW_TAG_member)
    <b9a84>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b9a88>   DW_AT_decl_file   : 9
    <b9a89>   DW_AT_decl_line   : 102
    <b9a8a>   DW_AT_decl_column : 23
    <b9a8b>   DW_AT_type        : <0xb97af>
    <b9a8f>   DW_AT_data_member_location: 64
 <2><b9a90>: Abbrev Number: 2 (DW_TAG_member)
    <b9a91>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b9a95>   DW_AT_decl_file   : 9
    <b9a96>   DW_AT_decl_line   : 103
    <b9a97>   DW_AT_decl_column : 23
    <b9a98>   DW_AT_type        : <0xb97bb>
    <b9a9c>   DW_AT_data_member_location: 72
 <2><b9a9d>: Abbrev Number: 2 (DW_TAG_member)
    <b9a9e>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b9aa2>   DW_AT_decl_file   : 9
    <b9aa3>   DW_AT_decl_line   : 104
    <b9aa4>   DW_AT_decl_column : 23
    <b9aa5>   DW_AT_type        : <0xb97e1>
    <b9aa9>   DW_AT_data_member_location: 80
 <2><b9aaa>: Abbrev Number: 2 (DW_TAG_member)
    <b9aab>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b9aaf>   DW_AT_decl_file   : 9
    <b9ab0>   DW_AT_decl_line   : 105
    <b9ab1>   DW_AT_decl_column : 24
    <b9ab2>   DW_AT_type        : <0xb9817>
    <b9ab6>   DW_AT_data_member_location: 88
 <2><b9ab7>: Abbrev Number: 2 (DW_TAG_member)
    <b9ab8>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b9abc>   DW_AT_decl_file   : 9
    <b9abd>   DW_AT_decl_line   : 106
    <b9abe>   DW_AT_decl_column : 25
    <b9abf>   DW_AT_type        : <0xb983d>
    <b9ac3>   DW_AT_data_member_location: 96
 <2><b9ac4>: Abbrev Number: 2 (DW_TAG_member)
    <b9ac5>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b9ac9>   DW_AT_decl_file   : 9
    <b9aca>   DW_AT_decl_line   : 107
    <b9acb>   DW_AT_decl_column : 23
    <b9acc>   DW_AT_type        : <0xb9863>
    <b9ad0>   DW_AT_data_member_location: 104
 <2><b9ad1>: Abbrev Number: 2 (DW_TAG_member)
    <b9ad2>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b9ad6>   DW_AT_decl_file   : 9
    <b9ad7>   DW_AT_decl_line   : 108
    <b9ad8>   DW_AT_decl_column : 23
    <b9ad9>   DW_AT_type        : <0xb98f5>
    <b9add>   DW_AT_data_member_location: 112
 <2><b9ade>: Abbrev Number: 2 (DW_TAG_member)
    <b9adf>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b9ae3>   DW_AT_decl_file   : 9
    <b9ae4>   DW_AT_decl_line   : 109
    <b9ae5>   DW_AT_decl_column : 23
    <b9ae6>   DW_AT_type        : <0xb9915>
    <b9aea>   DW_AT_data_member_location: 120
 <2><b9aeb>: Abbrev Number: 2 (DW_TAG_member)
    <b9aec>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b9af0>   DW_AT_decl_file   : 9
    <b9af1>   DW_AT_decl_line   : 110
    <b9af2>   DW_AT_decl_column : 23
    <b9af3>   DW_AT_type        : <0xb9949>
    <b9af7>   DW_AT_data_member_location: 128
 <2><b9af8>: Abbrev Number: 2 (DW_TAG_member)
    <b9af9>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b9afd>   DW_AT_decl_file   : 9
    <b9afe>   DW_AT_decl_line   : 111
    <b9aff>   DW_AT_decl_column : 23
    <b9b00>   DW_AT_type        : <0xb9978>
    <b9b04>   DW_AT_data_member_location: 136
 <2><b9b05>: Abbrev Number: 2 (DW_TAG_member)
    <b9b06>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b9b0a>   DW_AT_decl_file   : 9
    <b9b0b>   DW_AT_decl_line   : 112
    <b9b0c>   DW_AT_decl_column : 23
    <b9b0d>   DW_AT_type        : <0xb9998>
    <b9b11>   DW_AT_data_member_location: 144
 <2><b9b12>: Abbrev Number: 2 (DW_TAG_member)
    <b9b13>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b9b17>   DW_AT_decl_file   : 9
    <b9b18>   DW_AT_decl_line   : 113
    <b9b19>   DW_AT_decl_column : 25
    <b9b1a>   DW_AT_type        : <0xb9772>
    <b9b1e>   DW_AT_data_member_location: 152
 <2><b9b1f>: Abbrev Number: 2 (DW_TAG_member)
    <b9b20>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b9b24>   DW_AT_decl_file   : 9
    <b9b25>   DW_AT_decl_line   : 114
    <b9b26>   DW_AT_decl_column : 24
    <b9b27>   DW_AT_type        : <0xb9888>
    <b9b2b>   DW_AT_data_member_location: 160
 <2><b9b2c>: Abbrev Number: 2 (DW_TAG_member)
