    <e9f5c>   DW_AT_byte_size   : 4
    <e9f5d>   DW_AT_encoding    : 7	(unsigned)
    <e9f5e>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><e9f62>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9f63>   DW_AT_byte_size   : 8
    <e9f64>   DW_AT_encoding    : 7	(unsigned)
    <e9f65>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><e9f69>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9f6a>   DW_AT_byte_size   : 1
    <e9f6b>   DW_AT_encoding    : 6	(signed char)
    <e9f6c>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><e9f70>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9f71>   DW_AT_byte_size   : 2
    <e9f72>   DW_AT_encoding    : 5	(signed)
    <e9f73>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><e9f77>: Abbrev Number: 23 (DW_TAG_base_type)
    <e9f78>   DW_AT_byte_size   : 4
    <e9f79>   DW_AT_encoding    : 5	(signed)
    <e9f7a>   DW_AT_name        : int
 <1><e9f7e>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9f7f>   DW_AT_byte_size   : 8
    <e9f80>   DW_AT_encoding    : 5	(signed)
    <e9f81>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><e9f85>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9f86>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <e9f8a>   DW_AT_decl_file   : 3
    <e9f8b>   DW_AT_decl_line   : 153
    <e9f8c>   DW_AT_decl_column : 27
    <e9f8d>   DW_AT_type        : <0xe9f7e>
 <1><e9f91>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <e9f92>   DW_AT_byte_size   : 8
 <1><e9f93>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9f94>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <e9f98>   DW_AT_decl_file   : 3
    <e9f99>   DW_AT_decl_line   : 194
    <e9f9a>   DW_AT_decl_column : 27
    <e9f9b>   DW_AT_type        : <0xe9f7e>
 <1><e9f9f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <e9fa0>   DW_AT_byte_size   : 8
    <e9fa0>   DW_AT_type        : <0xe9fa4>
 <1><e9fa4>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9fa5>   DW_AT_byte_size   : 1
    <e9fa6>   DW_AT_encoding    : 6	(signed char)
    <e9fa7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><e9fab>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9fac>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <e9fb0>   DW_AT_decl_file   : 4
    <e9fb1>   DW_AT_decl_line   : 209
    <e9fb2>   DW_AT_decl_column : 23
    <e9fb3>   DW_AT_type        : <0xe9f62>
 <1><e9fb7>: Abbrev Number: 25 (DW_TAG_typedef)
    <e9fb8>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <e9fbc>   DW_AT_decl_file   : 4
    <e9fbd>   DW_AT_decl_line   : 321
    <e9fbf>   DW_AT_decl_column : 24
    <e9fc0>   DW_AT_type        : <0xe9f77>
 <1><e9fc4>: Abbrev Number: 26 (DW_TAG_const_type)
    <e9fc5>   DW_AT_type        : <0xe9fb7>
 <1><e9fc9>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9fca>   DW_AT_byte_size   : 8
    <e9fcb>   DW_AT_encoding    : 5	(signed)
    <e9fcc>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e9fd0>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9fd1>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e9fd5>   DW_AT_decl_file   : 5
    <e9fd6>   DW_AT_decl_line   : 87
    <e9fd7>   DW_AT_decl_column : 19
    <e9fd8>   DW_AT_type        : <0xe9f85>
 <1><e9fdc>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9fdd>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <e9fe1>   DW_AT_decl_file   : 5
    <e9fe2>   DW_AT_decl_line   : 108
    <e9fe3>   DW_AT_decl_column : 19
    <e9fe4>   DW_AT_type        : <0xe9f93>
 <1><e9fe8>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9fe9>   DW_AT_byte_size   : 8
    <e9fea>   DW_AT_encoding    : 7	(unsigned)
    <e9feb>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e9fef>: Abbrev Number: 12 (DW_TAG_array_type)
    <e9ff0>   DW_AT_type        : <0xe9fa4>
    <e9ff4>   DW_AT_sibling     : <0xe9fff>
 <2><e9ff8>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <e9ff9>   DW_AT_type        : <0xe9f62>
    <e9ffd>   DW_AT_upper_bound : 3
 <2><e9ffe>: Abbrev Number: 0
 <1><e9fff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea000>   DW_AT_byte_size   : 8
    <ea000>   DW_AT_type        : <0xea004>
 <1><ea004>: Abbrev Number: 27 (DW_TAG_const_type)
 <1><ea005>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea006>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <ea00a>   DW_AT_decl_file   : 6
    <ea00b>   DW_AT_decl_line   : 22
    <ea00c>   DW_AT_decl_column : 15
    <ea00d>   DW_AT_type        : <0xe9fd0>
 <1><ea011>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ea012>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <ea016>   DW_AT_byte_size   : 24
    <ea017>   DW_AT_decl_file   : 7
    <ea018>   DW_AT_decl_line   : 82
    <ea019>   DW_AT_decl_column : 16
    <ea019>   DW_AT_sibling     : <0xea044>
 <2><ea01d>: Abbrev Number: 2 (DW_TAG_member)
    <ea01e>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <ea022>   DW_AT_decl_file   : 7
    <ea023>   DW_AT_decl_line   : 83
    <ea024>   DW_AT_decl_column : 21
    <ea025>   DW_AT_type        : <0xe9f9f>
    <ea029>   DW_AT_data_member_location: 0
 <2><ea02a>: Abbrev Number: 14 (DW_TAG_member)
    <ea02b>   DW_AT_name        : len
    <ea02f>   DW_AT_decl_file   : 7
    <ea030>   DW_AT_decl_line   : 84
    <ea031>   DW_AT_decl_column : 21
    <ea031>   DW_AT_type        : <0xe9fdc>
    <ea035>   DW_AT_data_member_location: 8
 <2><ea036>: Abbrev Number: 2 (DW_TAG_member)
    <ea037>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ea03b>   DW_AT_decl_file   : 7
    <ea03c>   DW_AT_decl_line   : 85
    <ea03d>   DW_AT_decl_column : 21
    <ea03e>   DW_AT_type        : <0xe9fdc>
    <ea042>   DW_AT_data_member_location: 16
 <2><ea043>: Abbrev Number: 0
 <1><ea044>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea045>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <ea049>   DW_AT_decl_file   : 7
    <ea04a>   DW_AT_decl_line   : 86
    <ea04b>   DW_AT_decl_column : 3
    <ea04c>   DW_AT_type        : <0xea011>
 <1><ea050>: Abbrev Number: 5 (DW_TAG_base_type)
    <ea051>   DW_AT_byte_size   : 8
    <ea052>   DW_AT_encoding    : 4	(float)
    <ea053>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><ea057>: Abbrev Number: 5 (DW_TAG_base_type)
    <ea058>   DW_AT_byte_size   : 4
    <ea059>   DW_AT_encoding    : 4	(float)
    <ea05a>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><ea05e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea05f>   DW_AT_byte_size   : 8
    <ea05f>   DW_AT_type        : <0xe9fb7>
 <1><ea063>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <ea064>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <ea068>   DW_AT_encoding    : 7	(unsigned)
    <ea069>   DW_AT_byte_size   : 4
    <ea06a>   DW_AT_type        : <0xe9f5b>
    <ea06e>   DW_AT_decl_file   : 2
    <ea06f>   DW_AT_decl_line   : 25
    <ea070>   DW_AT_decl_column : 14
    <ea071>   DW_AT_sibling     : <0xea08e>
 <2><ea075>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ea076>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <ea07a>   DW_AT_const_value : 0
 <2><ea07b>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ea07c>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <ea080>   DW_AT_const_value : 1
 <2><ea081>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ea082>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <ea086>   DW_AT_const_value : 2
 <2><ea087>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ea088>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <ea08c>   DW_AT_const_value : 3
 <2><ea08d>: Abbrev Number: 0
 <1><ea08e>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea08f>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <ea093>   DW_AT_decl_file   : 2
    <ea094>   DW_AT_decl_line   : 30
    <ea095>   DW_AT_decl_column : 3
    <ea096>   DW_AT_type        : <0xea063>
 <1><ea09a>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea09b>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <ea09f>   DW_AT_decl_file   : 2
    <ea0a0>   DW_AT_decl_line   : 54
    <ea0a1>   DW_AT_decl_column : 15
    <ea0a2>   DW_AT_type        : <0xea0a6>
 <1><ea0a6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea0a7>   DW_AT_byte_size   : 8
    <ea0a7>   DW_AT_type        : <0xea0ab>
 <1><ea0ab>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea0ac>   DW_AT_prototyped  : 1
    <ea0ac>   DW_AT_type        : <0xe9f77>
    <ea0b0>   DW_AT_sibling     : <0xea0bf>
 <2><ea0b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea0b5>   DW_AT_type        : <0xea0bf>
 <2><ea0b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea0ba>   DW_AT_type        : <0xe9f77>
 <2><ea0be>: Abbrev Number: 0
 <1><ea0bf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea0c0>   DW_AT_byte_size   : 8
    <ea0c0>   DW_AT_type        : <0xea0c4>
 <1><ea0c4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ea0c5>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <ea0c9>   DW_AT_byte_size   : 80
    <ea0ca>   DW_AT_decl_file   : 2
    <ea0cb>   DW_AT_decl_line   : 97
    <ea0cc>   DW_AT_decl_column : 16
    <ea0cc>   DW_AT_sibling     : <0xea186>
 <2><ea0d0>: Abbrev Number: 2 (DW_TAG_member)
    <ea0d1>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <ea0d5>   DW_AT_decl_file   : 2
    <ea0d6>   DW_AT_decl_line   : 98
    <ea0d7>   DW_AT_decl_column : 21
    <ea0d8>   DW_AT_type        : <0xe9f77>
    <ea0dc>   DW_AT_data_member_location: 0
 <2><ea0dd>: Abbrev Number: 14 (DW_TAG_member)
    <ea0de>   DW_AT_name        : len
    <ea0e2>   DW_AT_decl_file   : 2
    <ea0e3>   DW_AT_decl_line   : 99
    <ea0e4>   DW_AT_decl_column : 21
    <ea0e4>   DW_AT_type        : <0xe9f77>
    <ea0e8>   DW_AT_data_member_location: 4
 <2><ea0e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea0ea>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <ea0ee>   DW_AT_decl_file   : 2
    <ea0ef>   DW_AT_decl_line   : 100
    <ea0f0>   DW_AT_decl_column : 21
    <ea0f1>   DW_AT_type        : <0xea08e>
    <ea0f5>   DW_AT_data_member_location: 8
 <2><ea0f6>: Abbrev Number: 2 (DW_TAG_member)
    <ea0f7>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ea0fb>   DW_AT_decl_file   : 2
    <ea0fc>   DW_AT_decl_line   : 101
    <ea0fd>   DW_AT_decl_column : 21
    <ea0fe>   DW_AT_type        : <0xea005>
    <ea102>   DW_AT_data_member_location: 16
 <2><ea103>: Abbrev Number: 2 (DW_TAG_member)
    <ea104>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ea108>   DW_AT_decl_file   : 2
    <ea109>   DW_AT_decl_line   : 102
    <ea10a>   DW_AT_decl_column : 21
    <ea10b>   DW_AT_type        : <0xe9f77>
    <ea10f>   DW_AT_data_member_location: 24
 <2><ea110>: Abbrev Number: 2 (DW_TAG_member)
    <ea111>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <ea115>   DW_AT_decl_file   : 2
    <ea116>   DW_AT_decl_line   : 103
    <ea117>   DW_AT_decl_column : 21
    <ea118>   DW_AT_type        : <0xe9f77>
    <ea11c>   DW_AT_data_member_location: 28
 <2><ea11d>: Abbrev Number: 2 (DW_TAG_member)
    <ea11e>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <ea122>   DW_AT_decl_file   : 2
    <ea123>   DW_AT_decl_line   : 104
    <ea124>   DW_AT_decl_column : 21
    <ea125>   DW_AT_type        : <0xe9f77>
    <ea129>   DW_AT_data_member_location: 32
 <2><ea12a>: Abbrev Number: 2 (DW_TAG_member)
    <ea12b>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <ea12f>   DW_AT_decl_file   : 2
    <ea130>   DW_AT_decl_line   : 105
    <ea131>   DW_AT_decl_column : 21
    <ea132>   DW_AT_type        : <0xe9f5b>
    <ea136>   DW_AT_data_member_location: 36
 <2><ea137>: Abbrev Number: 2 (DW_TAG_member)
    <ea138>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <ea13c>   DW_AT_decl_file   : 2
    <ea13d>   DW_AT_decl_line   : 106
    <ea13e>   DW_AT_decl_column : 21
    <ea13f>   DW_AT_type        : <0xe9f5b>
    <ea143>   DW_AT_data_member_location: 40
 <2><ea144>: Abbrev Number: 2 (DW_TAG_member)
    <ea145>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <ea149>   DW_AT_decl_file   : 2
    <ea14a>   DW_AT_decl_line   : 109
    <ea14b>   DW_AT_decl_column : 21
    <ea14c>   DW_AT_type        : <0xe9fef>
    <ea150>   DW_AT_data_member_location: 44
 <2><ea151>: Abbrev Number: 2 (DW_TAG_member)
    <ea152>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <ea156>   DW_AT_decl_file   : 2
    <ea157>   DW_AT_decl_line   : 110
    <ea158>   DW_AT_decl_column : 21
    <ea159>   DW_AT_type        : <0xe9fab>
    <ea15d>   DW_AT_data_member_location: 48
 <2><ea15e>: Abbrev Number: 2 (DW_TAG_member)
    <ea15f>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <ea163>   DW_AT_decl_file   : 2
    <ea164>   DW_AT_decl_line   : 112
    <ea165>   DW_AT_decl_column : 22
    <ea166>   DW_AT_type        : <0xea41d>
    <ea16a>   DW_AT_data_member_location: 56
 <2><ea16b>: Abbrev Number: 2 (DW_TAG_member)
    <ea16c>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <ea170>   DW_AT_decl_file   : 2
    <ea171>   DW_AT_decl_line   : 114
    <ea172>   DW_AT_decl_column : 14
    <ea173>   DW_AT_type        : <0xe9f91>
    <ea177>   DW_AT_data_member_location: 64
 <2><ea178>: Abbrev Number: 2 (DW_TAG_member)
    <ea179>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <ea17d>   DW_AT_decl_file   : 2
    <ea17e>   DW_AT_decl_line   : 116
    <ea17f>   DW_AT_decl_column : 22
    <ea180>   DW_AT_type        : <0xea0bf>
    <ea184>   DW_AT_data_member_location: 72
 <2><ea185>: Abbrev Number: 0
 <1><ea186>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea187>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <ea18b>   DW_AT_decl_file   : 2
    <ea18c>   DW_AT_decl_line   : 59
    <ea18d>   DW_AT_decl_column : 15
    <ea18e>   DW_AT_type        : <0xea192>
 <1><ea192>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea193>   DW_AT_byte_size   : 8
    <ea193>   DW_AT_type        : <0xea197>
 <1><ea197>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea198>   DW_AT_prototyped  : 1
    <ea198>   DW_AT_type        : <0xe9f77>
    <ea19c>   DW_AT_sibling     : <0xea1a6>
 <2><ea1a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1a1>   DW_AT_type        : <0xea0bf>
 <2><ea1a5>: Abbrev Number: 0
 <1><ea1a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea1a7>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <ea1ab>   DW_AT_decl_file   : 2
    <ea1ac>   DW_AT_decl_line   : 60
    <ea1ad>   DW_AT_decl_column : 15
    <ea1ae>   DW_AT_type        : <0xea192>
 <1><ea1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea1b3>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <ea1b7>   DW_AT_decl_file   : 2
    <ea1b8>   DW_AT_decl_line   : 61
    <ea1b9>   DW_AT_decl_column : 15
    <ea1ba>   DW_AT_type        : <0xea1be>
 <1><ea1be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea1bf>   DW_AT_byte_size   : 8
    <ea1bf>   DW_AT_type        : <0xea1c3>
 <1><ea1c3>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea1c4>   DW_AT_prototyped  : 1
    <ea1c4>   DW_AT_type        : <0xe9f77>
    <ea1c8>   DW_AT_sibling     : <0xea1dc>
 <2><ea1cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1cd>   DW_AT_type        : <0xea0bf>
 <2><ea1d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1d2>   DW_AT_type        : <0xea005>
 <2><ea1d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1d7>   DW_AT_type        : <0xe9f77>
 <2><ea1db>: Abbrev Number: 0
 <1><ea1dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea1dd>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <ea1e1>   DW_AT_decl_file   : 2
    <ea1e2>   DW_AT_decl_line   : 62
    <ea1e3>   DW_AT_decl_column : 15
    <ea1e4>   DW_AT_type        : <0xea1e8>
 <1><ea1e8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea1e9>   DW_AT_byte_size   : 8
    <ea1e9>   DW_AT_type        : <0xea1ed>
 <1><ea1ed>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea1ee>   DW_AT_prototyped  : 1
    <ea1ee>   DW_AT_type        : <0xe9f77>
    <ea1f2>   DW_AT_sibling     : <0xea201>
 <2><ea1f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1f7>   DW_AT_type        : <0xea0bf>
 <2><ea1fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea1fc>   DW_AT_type        : <0xea201>
 <2><ea200>: Abbrev Number: 0
 <1><ea201>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea202>   DW_AT_byte_size   : 8
    <ea202>   DW_AT_type        : <0xea005>
 <1><ea206>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea207>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <ea20b>   DW_AT_decl_file   : 2
    <ea20c>   DW_AT_decl_line   : 63
    <ea20d>   DW_AT_decl_column : 15
    <ea20e>   DW_AT_type        : <0xea212>
 <1><ea212>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea213>   DW_AT_byte_size   : 8
    <ea213>   DW_AT_type        : <0xea217>
 <1><ea217>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea218>   DW_AT_prototyped  : 1
    <ea218>   DW_AT_type        : <0xe9f77>
    <ea21c>   DW_AT_sibling     : <0xea230>
 <2><ea220>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea221>   DW_AT_type        : <0xea0bf>
 <2><ea225>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea226>   DW_AT_type        : <0xe9f91>
 <2><ea22a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea22b>   DW_AT_type        : <0xea230>
 <2><ea22f>: Abbrev Number: 0
 <1><ea230>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea231>   DW_AT_byte_size   : 8
    <ea231>   DW_AT_type        : <0xe9fab>
 <1><ea235>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea236>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <ea23a>   DW_AT_decl_file   : 2
    <ea23b>   DW_AT_decl_line   : 65
    <ea23c>   DW_AT_decl_column : 15
    <ea23d>   DW_AT_type        : <0xea241>
 <1><ea241>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea242>   DW_AT_byte_size   : 8
    <ea242>   DW_AT_type        : <0xea246>
 <1><ea246>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea247>   DW_AT_prototyped  : 1
    <ea247>   DW_AT_type        : <0xe9f77>
    <ea24b>   DW_AT_sibling     : <0xea25f>
 <2><ea24f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea250>   DW_AT_type        : <0xea0bf>
 <2><ea254>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea255>   DW_AT_type        : <0xea05e>
 <2><ea259>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea25a>   DW_AT_type        : <0xea230>
 <2><ea25e>: Abbrev Number: 0
 <1><ea25f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea260>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <ea264>   DW_AT_decl_file   : 2
    <ea265>   DW_AT_decl_line   : 67
    <ea266>   DW_AT_decl_column : 15
    <ea267>   DW_AT_type        : <0xea26b>
 <1><ea26b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea26c>   DW_AT_byte_size   : 8
    <ea26c>   DW_AT_type        : <0xea270>
 <1><ea270>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea271>   DW_AT_prototyped  : 1
    <ea271>   DW_AT_type        : <0xe9f77>
    <ea275>   DW_AT_sibling     : <0xea289>
 <2><ea279>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea27a>   DW_AT_type        : <0xea0bf>
 <2><ea27e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea27f>   DW_AT_type        : <0xe9fff>
 <2><ea283>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea284>   DW_AT_type        : <0xe9fab>
 <2><ea288>: Abbrev Number: 0
 <1><ea289>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea28a>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <ea28e>   DW_AT_decl_file   : 2
    <ea28f>   DW_AT_decl_line   : 69
    <ea290>   DW_AT_decl_column : 15
    <ea291>   DW_AT_type        : <0xea295>
 <1><ea295>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea296>   DW_AT_byte_size   : 8
    <ea296>   DW_AT_type        : <0xea29a>
 <1><ea29a>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea29b>   DW_AT_prototyped  : 1
    <ea29b>   DW_AT_type        : <0xe9f77>
    <ea29f>   DW_AT_sibling     : <0xea2b3>
 <2><ea2a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2a4>   DW_AT_type        : <0xea0bf>
 <2><ea2a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2a9>   DW_AT_type        : <0xea2b3>
 <2><ea2ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2ae>   DW_AT_type        : <0xe9fab>
 <2><ea2b2>: Abbrev Number: 0
 <1><ea2b3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea2b4>   DW_AT_byte_size   : 8
    <ea2b4>   DW_AT_type        : <0xe9fc4>
 <1><ea2b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea2b9>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <ea2bd>   DW_AT_decl_file   : 2
    <ea2be>   DW_AT_decl_line   : 71
    <ea2bf>   DW_AT_decl_column : 15
    <ea2c0>   DW_AT_type        : <0xea2c4>
 <1><ea2c4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea2c5>   DW_AT_byte_size   : 8
    <ea2c5>   DW_AT_type        : <0xea2c9>
 <1><ea2c9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea2ca>   DW_AT_prototyped  : 1
    <ea2ca>   DW_AT_type        : <0xe9f77>
    <ea2ce>   DW_AT_sibling     : <0xea2e2>
 <2><ea2d2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2d3>   DW_AT_type        : <0xea0bf>
 <2><ea2d7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2d8>   DW_AT_type        : <0xea005>
 <2><ea2dc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea2dd>   DW_AT_type        : <0xea005>
 <2><ea2e1>: Abbrev Number: 0
 <1><ea2e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea2e3>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <ea2e7>   DW_AT_decl_file   : 2
    <ea2e8>   DW_AT_decl_line   : 73
    <ea2e9>   DW_AT_decl_column : 15
    <ea2ea>   DW_AT_type        : <0xea2c4>
 <1><ea2ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea2ef>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <ea2f3>   DW_AT_decl_file   : 2
    <ea2f4>   DW_AT_decl_line   : 75
    <ea2f5>   DW_AT_decl_column : 15
    <ea2f6>   DW_AT_type        : <0xea2fa>
 <1><ea2fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea2fb>   DW_AT_byte_size   : 8
    <ea2fb>   DW_AT_type        : <0xea2ff>
 <1><ea2ff>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea300>   DW_AT_prototyped  : 1
    <ea300>   DW_AT_type        : <0xe9f77>
    <ea304>   DW_AT_sibling     : <0xea313>
 <2><ea308>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea309>   DW_AT_type        : <0xea0bf>
 <2><ea30d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea30e>   DW_AT_type        : <0xea313>
 <2><ea312>: Abbrev Number: 0
 <1><ea313>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea314>   DW_AT_byte_size   : 8
    <ea314>   DW_AT_type        : <0xea044>
 <1><ea318>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea319>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <ea31d>   DW_AT_decl_file   : 2
    <ea31e>   DW_AT_decl_line   : 76
    <ea31f>   DW_AT_decl_column : 15
    <ea320>   DW_AT_type        : <0xea324>
 <1><ea324>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea325>   DW_AT_byte_size   : 8
    <ea325>   DW_AT_type        : <0xea329>
 <1><ea329>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea32a>   DW_AT_prototyped  : 1
    <ea32a>   DW_AT_type        : <0xe9f77>
    <ea32e>   DW_AT_sibling     : <0xea342>
 <2><ea332>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea333>   DW_AT_type        : <0xea0bf>
 <2><ea337>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea338>   DW_AT_type        : <0xea05e>
 <2><ea33c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea33d>   DW_AT_type        : <0xe9fdc>
 <2><ea341>: Abbrev Number: 0
 <1><ea342>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea343>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <ea347>   DW_AT_decl_file   : 2
    <ea348>   DW_AT_decl_line   : 77
    <ea349>   DW_AT_decl_column : 15
    <ea34a>   DW_AT_type        : <0xea192>
 <1><ea34e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ea34f>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <ea353>   DW_AT_byte_size   : 112
    <ea354>   DW_AT_decl_file   : 2
    <ea355>   DW_AT_decl_line   : 80
    <ea356>   DW_AT_decl_column : 16
    <ea356>   DW_AT_sibling     : <0xea411>
 <2><ea35a>: Abbrev Number: 2 (DW_TAG_member)
    <ea35b>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <ea35f>   DW_AT_decl_file   : 2
    <ea360>   DW_AT_decl_line   : 81
    <ea361>   DW_AT_decl_column : 25
    <ea362>   DW_AT_type        : <0xea186>
    <ea366>   DW_AT_data_member_location: 0
 <2><ea367>: Abbrev Number: 2 (DW_TAG_member)
    <ea368>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <ea36c>   DW_AT_decl_file   : 2
    <ea36d>   DW_AT_decl_line   : 82
    <ea36e>   DW_AT_decl_column : 25
    <ea36f>   DW_AT_type        : <0xea1a6>
    <ea373>   DW_AT_data_member_location: 8
 <2><ea374>: Abbrev Number: 2 (DW_TAG_member)
    <ea375>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <ea379>   DW_AT_decl_file   : 2
    <ea37a>   DW_AT_decl_line   : 83
    <ea37b>   DW_AT_decl_column : 25
    <ea37c>   DW_AT_type        : <0xea1b2>
    <ea380>   DW_AT_data_member_location: 16
 <2><ea381>: Abbrev Number: 2 (DW_TAG_member)
    <ea382>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <ea386>   DW_AT_decl_file   : 2
    <ea387>   DW_AT_decl_line   : 84
    <ea388>   DW_AT_decl_column : 25
    <ea389>   DW_AT_type        : <0xea1dc>
    <ea38d>   DW_AT_data_member_location: 24
 <2><ea38e>: Abbrev Number: 2 (DW_TAG_member)
    <ea38f>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <ea393>   DW_AT_decl_file   : 2
    <ea394>   DW_AT_decl_line   : 85
    <ea395>   DW_AT_decl_column : 25
    <ea396>   DW_AT_type        : <0xea206>
    <ea39a>   DW_AT_data_member_location: 32
 <2><ea39b>: Abbrev Number: 2 (DW_TAG_member)
    <ea39c>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <ea3a0>   DW_AT_decl_file   : 2
    <ea3a1>   DW_AT_decl_line   : 86
    <ea3a2>   DW_AT_decl_column : 25
    <ea3a3>   DW_AT_type        : <0xea235>
    <ea3a7>   DW_AT_data_member_location: 40
 <2><ea3a8>: Abbrev Number: 2 (DW_TAG_member)
    <ea3a9>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <ea3ad>   DW_AT_decl_file   : 2
    <ea3ae>   DW_AT_decl_line   : 87
    <ea3af>   DW_AT_decl_column : 25
    <ea3b0>   DW_AT_type        : <0xea25f>
    <ea3b4>   DW_AT_data_member_location: 48
 <2><ea3b5>: Abbrev Number: 2 (DW_TAG_member)
    <ea3b6>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <ea3ba>   DW_AT_decl_file   : 2
    <ea3bb>   DW_AT_decl_line   : 88
    <ea3bc>   DW_AT_decl_column : 25
    <ea3bd>   DW_AT_type        : <0xea289>
    <ea3c1>   DW_AT_data_member_location: 56
 <2><ea3c2>: Abbrev Number: 2 (DW_TAG_member)
    <ea3c3>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <ea3c7>   DW_AT_decl_file   : 2
    <ea3c8>   DW_AT_decl_line   : 89
    <ea3c9>   DW_AT_decl_column : 25
    <ea3ca>   DW_AT_type        : <0xea2b8>
    <ea3ce>   DW_AT_data_member_location: 64
 <2><ea3cf>: Abbrev Number: 2 (DW_TAG_member)
    <ea3d0>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <ea3d4>   DW_AT_decl_file   : 2
    <ea3d5>   DW_AT_decl_line   : 90
    <ea3d6>   DW_AT_decl_column : 25
    <ea3d7>   DW_AT_type        : <0xea2e2>
    <ea3db>   DW_AT_data_member_location: 72
 <2><ea3dc>: Abbrev Number: 2 (DW_TAG_member)
    <ea3dd>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <ea3e1>   DW_AT_decl_file   : 2
    <ea3e2>   DW_AT_decl_line   : 91
    <ea3e3>   DW_AT_decl_column : 25
    <ea3e4>   DW_AT_type        : <0xea2ee>
    <ea3e8>   DW_AT_data_member_location: 80
 <2><ea3e9>: Abbrev Number: 2 (DW_TAG_member)
    <ea3ea>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <ea3ee>   DW_AT_decl_file   : 2
    <ea3ef>   DW_AT_decl_line   : 92
    <ea3f0>   DW_AT_decl_column : 25
    <ea3f1>   DW_AT_type        : <0xea318>
    <ea3f5>   DW_AT_data_member_location: 88
 <2><ea3f6>: Abbrev Number: 2 (DW_TAG_member)
    <ea3f7>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <ea3fb>   DW_AT_decl_file   : 2
    <ea3fc>   DW_AT_decl_line   : 93
    <ea3fd>   DW_AT_decl_column : 25
    <ea3fe>   DW_AT_type        : <0xea09a>
    <ea402>   DW_AT_data_member_location: 96
 <2><ea403>: Abbrev Number: 2 (DW_TAG_member)
    <ea404>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <ea408>   DW_AT_decl_file   : 2
    <ea409>   DW_AT_decl_line   : 94
    <ea40a>   DW_AT_decl_column : 25
    <ea40b>   DW_AT_type        : <0xea342>
    <ea40f>   DW_AT_data_member_location: 104
 <2><ea410>: Abbrev Number: 0
 <1><ea411>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea412>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <ea416>   DW_AT_decl_file   : 2
    <ea417>   DW_AT_decl_line   : 95
    <ea418>   DW_AT_decl_column : 3
    <ea419>   DW_AT_type        : <0xea34e>
 <1><ea41d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea41e>   DW_AT_byte_size   : 8
    <ea41e>   DW_AT_type        : <0xea411>
 <1><ea422>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea423>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <ea427>   DW_AT_decl_file   : 2
    <ea428>   DW_AT_decl_line   : 117
    <ea429>   DW_AT_decl_column : 3
    <ea42a>   DW_AT_type        : <0xea0c4>
 <1><ea42e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea42f>   DW_AT_byte_size   : 8
    <ea42f>   DW_AT_type        : <0xea422>
 <1><ea433>: Abbrev Number: 29 (DW_TAG_structure_type)
    <ea434>   DW_AT_byte_size   : 20
    <ea435>   DW_AT_decl_file   : 8
    <ea436>   DW_AT_decl_line   : 45
    <ea437>   DW_AT_decl_column : 9
    <ea438>   DW_AT_sibling     : <0xea457>
 <2><ea43c>: Abbrev Number: 2 (DW_TAG_member)
    <ea43d>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <ea441>   DW_AT_decl_file   : 8
    <ea442>   DW_AT_decl_line   : 46
    <ea443>   DW_AT_decl_column : 18
    <ea444>   DW_AT_type        : <0xea457>
    <ea448>   DW_AT_data_member_location: 0
 <2><ea449>: Abbrev Number: 2 (DW_TAG_member)
    <ea44a>   DW_AT_name        : (indirect string, offset: 0x1d448): length
    <ea44e>   DW_AT_decl_file   : 8
    <ea44f>   DW_AT_decl_line   : 47
    <ea450>   DW_AT_decl_column : 18
    <ea451>   DW_AT_type        : <0xe9f5b>
    <ea455>   DW_AT_data_member_location: 16
 <2><ea456>: Abbrev Number: 0
 <1><ea457>: Abbrev Number: 12 (DW_TAG_array_type)
    <ea458>   DW_AT_type        : <0xe9fa4>
    <ea45c>   DW_AT_sibling     : <0xea467>
 <2><ea460>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ea461>   DW_AT_type        : <0xe9f62>
    <ea465>   DW_AT_upper_bound : 15
 <2><ea466>: Abbrev Number: 0
 <1><ea467>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea468>   DW_AT_name        : (indirect string, offset: 0x1b21f): DEV_SCRN_INFO
    <ea46c>   DW_AT_decl_file   : 8
    <ea46d>   DW_AT_decl_line   : 48
    <ea46e>   DW_AT_decl_column : 3
    <ea46f>   DW_AT_type        : <0xea433>
 <1><ea473>: Abbrev Number: 15 (DW_TAG_subprogram)
    <ea474>   DW_AT_external    : 1
    <ea474>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <ea478>   DW_AT_decl_file   : 7
    <ea479>   DW_AT_decl_line   : 111
    <ea47a>   DW_AT_decl_column : 21
    <ea47b>   DW_AT_prototyped  : 1
    <ea47b>   DW_AT_type        : <0xe9f77>
    <ea47f>   DW_AT_declaration : 1
    <ea47f>   DW_AT_sibling     : <0xea489>
 <2><ea483>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea484>   DW_AT_type        : <0xea313>
 <2><ea488>: Abbrev Number: 0
 <1><ea489>: Abbrev Number: 15 (DW_TAG_subprogram)
    <ea48a>   DW_AT_external    : 1
    <ea48a>   DW_AT_name        : (indirect string, offset: 0x1a955): memcpy
    <ea48e>   DW_AT_decl_file   : 9
    <ea48f>   DW_AT_decl_line   : 43
    <ea490>   DW_AT_decl_column : 14
    <ea491>   DW_AT_prototyped  : 1
    <ea491>   DW_AT_type        : <0xe9f91>
    <ea495>   DW_AT_declaration : 1
    <ea495>   DW_AT_sibling     : <0xea4a9>
 <2><ea499>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea49a>   DW_AT_type        : <0xe9f91>
 <2><ea49e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea49f>   DW_AT_type        : <0xe9fff>
 <2><ea4a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea4a4>   DW_AT_type        : <0xe9fab>
 <2><ea4a8>: Abbrev Number: 0
 <1><ea4a9>: Abbrev Number: 30 (DW_TAG_subprogram)
    <ea4aa>   DW_AT_external    : 1
    <ea4aa>   DW_AT_name        : (indirect string, offset: 0x3f97): fb_Inkey
    <ea4ae>   DW_AT_decl_file   : 10
    <ea4af>   DW_AT_decl_line   : 5
    <ea4b0>   DW_AT_decl_column : 21
    <ea4b1>   DW_AT_prototyped  : 1
    <ea4b1>   DW_AT_type        : <0xea313>
    <ea4b5>   DW_AT_declaration : 1
 <1><ea4b5>: Abbrev Number: 31 (DW_TAG_subprogram)
    <ea4b6>   DW_AT_external    : 1
    <ea4b6>   DW_AT_name        : (indirect string, offset: 0x1d6f7): fb_DevScrnEof
    <ea4ba>   DW_AT_decl_file   : 1
    <ea4bb>   DW_AT_decl_line   : 27
    <ea4bc>   DW_AT_decl_column : 5
    <ea4bd>   DW_AT_prototyped  : 1
    <ea4bd>   DW_AT_type        : <0xe9f77>
    <ea4c1>   DW_AT_ranges      : 0x187e2
    <ea4c5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea4c7>   DW_AT_call_all_calls: 1
    <ea4c7>   DW_AT_sibling     : <0xea5b5>
 <2><ea4cb>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <ea4cc>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <ea4d0>   DW_AT_decl_file   : 1
    <ea4d1>   DW_AT_decl_line   : 27
    <ea4d2>   DW_AT_decl_column : 29
    <ea4d3>   DW_AT_type        : <0xea42e>
    <ea4d7>   DW_AT_location    : 0x43db0 (location list)
    <ea4db>   DW_AT_GNU_locviews: 0x43da8
 <2><ea4df>: Abbrev Number: 16 (DW_TAG_variable)
    <ea4e0>   DW_AT_name        : (indirect string, offset: 0x19e53): info
    <ea4e4>   DW_AT_decl_file   : 1
    <ea4e4>   DW_AT_decl_line   : 29
    <ea4e5>   DW_AT_decl_column : 20
    <ea4e6>   DW_AT_type        : <0xea5b5>
    <ea4ea>   DW_AT_location    : 0x43ddf (location list)
    <ea4ee>   DW_AT_GNU_locviews: 0x43ddb
 <2><ea4f2>: Abbrev Number: 16 (DW_TAG_variable)
    <ea4f3>   DW_AT_name        : (indirect string, offset: 0x1d6ee): got_data
    <ea4f7>   DW_AT_decl_file   : 1
    <ea4f7>   DW_AT_decl_line   : 30
    <ea4f8>   DW_AT_decl_column : 15
    <ea4f9>   DW_AT_type        : <0xe9f77>
    <ea4fd>   DW_AT_location    : 0x43df9 (location list)
    <ea501>   DW_AT_GNU_locviews: 0x43df3
 <2><ea505>: Abbrev Number: 33 (DW_TAG_inlined_subroutine)
    <ea506>   DW_AT_abstract_origin: <0xea5ea>
    <ea50a>   DW_AT_entry_pc    : 0x479b40
    <ea512>   DW_AT_GNU_entry_view: 5
    <ea513>   DW_AT_ranges      : 0x187f8
    <ea517>   DW_AT_call_file   : 1
    <ea518>   DW_AT_call_line   : 33
    <ea519>   DW_AT_call_column : 29
    <ea51a>   DW_AT_sibling     : <0xea52c>
 <3><ea51e>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ea51f>   DW_AT_abstract_origin: <0xea5fb>
    <ea523>   DW_AT_location    : 0x43e39 (location list)
    <ea527>   DW_AT_GNU_locviews: 0x43e2f
 <3><ea52b>: Abbrev Number: 0
 <2><ea52c>: Abbrev Number: 34 (DW_TAG_inlined_subroutine)
    <ea52d>   DW_AT_abstract_origin: <0xea5ba>
    <ea531>   DW_AT_entry_pc    : 0x479b80
    <ea539>   DW_AT_GNU_entry_view: 2
    <ea53a>   DW_AT_low_pc      : 0x479b80
    <ea542>   DW_AT_high_pc     : 0x4f
    <ea54a>   DW_AT_call_file   : 1
    <ea54b>   DW_AT_call_line   : 38
    <ea54c>   DW_AT_call_column : 9
 <3><ea54d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ea54e>   DW_AT_abstract_origin: <0xea5c7>
    <ea552>   DW_AT_location    : 0x43e6f (location list)
    <ea556>   DW_AT_GNU_locviews: 0x43e6d
 <3><ea55a>: Abbrev Number: 9 (DW_TAG_variable)
    <ea55b>   DW_AT_abstract_origin: <0xea5d3>
    <ea55f>   DW_AT_location    : 0x43e80 (location list)
    <ea563>   DW_AT_GNU_locviews: 0x43e7c
 <3><ea567>: Abbrev Number: 9 (DW_TAG_variable)
    <ea568>   DW_AT_abstract_origin: <0xea5de>
    <ea56c>   DW_AT_location    : 0x43e9a (location list)
    <ea570>   DW_AT_GNU_locviews: 0x43e94
 <3><ea574>: Abbrev Number: 17 (DW_TAG_call_site)
    <ea575>   DW_AT_call_return_pc: 0x479b85
    <ea57d>   DW_AT_call_origin : <0xea4a9>
 <3><ea581>: Abbrev Number: 18 (DW_TAG_call_site)
    <ea582>   DW_AT_call_return_pc: 0x479bb7
    <ea58a>   DW_AT_call_origin : <0xea68a>
    <ea58e>   DW_AT_sibling     : <0xea59f>
 <4><ea592>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea593>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ea595>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ea598>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea599>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ea59b>   DW_AT_call_value  : 2 byte block: 7d 1 	(DW_OP_breg13 (r13): 1)
 <4><ea59e>: Abbrev Number: 0
 <3><ea59f>: Abbrev Number: 19 (DW_TAG_call_site)
    <ea5a0>   DW_AT_call_return_pc: 0x479bc2
    <ea5a8>   DW_AT_call_origin : <0xea473>
 <4><ea5ac>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea5ad>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ea5af>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><ea5b2>: Abbrev Number: 0
 <3><ea5b3>: Abbrev Number: 0
 <2><ea5b4>: Abbrev Number: 0
 <1><ea5b5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea5b6>   DW_AT_byte_size   : 8
    <ea5b6>   DW_AT_type        : <0xea467>
 <1><ea5ba>: Abbrev Number: 35 (DW_TAG_subprogram)
    <ea5bb>   DW_AT_external    : 1
    <ea5bb>   DW_AT_name        : (indirect string, offset: 0x1b22d): fb_DevScrnFillInput
    <ea5bf>   DW_AT_decl_file   : 1
    <ea5c0>   DW_AT_decl_line   : 5
    <ea5c1>   DW_AT_decl_column : 6
    <ea5c2>   DW_AT_prototyped  : 1
    <ea5c2>   DW_AT_inline      : 1	(inlined)
    <ea5c3>   DW_AT_sibling     : <0xea5ea>
 <2><ea5c7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <ea5c8>   DW_AT_name        : (indirect string, offset: 0x19e53): info
    <ea5cc>   DW_AT_decl_file   : 1
    <ea5cd>   DW_AT_decl_line   : 5
    <ea5ce>   DW_AT_decl_column : 42
    <ea5cf>   DW_AT_type        : <0xea5b5>
 <2><ea5d3>: Abbrev Number: 21 (DW_TAG_variable)
    <ea5d4>   DW_AT_name        : str
    <ea5d8>   DW_AT_decl_file   : 1
    <ea5d8>   DW_AT_decl_line   : 7
    <ea5d9>   DW_AT_decl_column : 15
    <ea5da>   DW_AT_type        : <0xea313>
 <2><ea5de>: Abbrev Number: 21 (DW_TAG_variable)
    <ea5df>   DW_AT_name        : len
    <ea5e3>   DW_AT_decl_file   : 1
    <ea5e3>   DW_AT_decl_line   : 8
    <ea5e4>   DW_AT_decl_column : 12
    <ea5e5>   DW_AT_type        : <0xe9fab>
 <2><ea5e9>: Abbrev Number: 0
 <1><ea5ea>: Abbrev Number: 36 (DW_TAG_subprogram)
    <ea5eb>   DW_AT_name        : (indirect string, offset: 0x1b241): FB_HANDLE_DEREF
    <ea5ef>   DW_AT_decl_file   : 2
    <ea5f0>   DW_AT_decl_line   : 144
    <ea5f1>   DW_AT_decl_column : 28
    <ea5f2>   DW_AT_prototyped  : 1
    <ea5f2>   DW_AT_type        : <0xea42e>
    <ea5f6>   DW_AT_inline      : 3	(declared as inline and inlined)
    <ea5f7>   DW_AT_sibling     : <0xea608>
 <2><ea5fb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <ea5fc>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <ea600>   DW_AT_decl_file   : 2
    <ea601>   DW_AT_decl_line   : 144
    <ea602>   DW_AT_decl_column : 54
    <ea603>   DW_AT_type        : <0xea42e>
 <2><ea607>: Abbrev Number: 0
 <1><ea608>: Abbrev Number: 37 (DW_TAG_subprogram)
    <ea609>   DW_AT_abstract_origin: <0xea5ba>
    <ea60d>   DW_AT_low_pc      : 0x479ae0
    <ea615>   DW_AT_high_pc     : 0x5e
    <ea61d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea61f>   DW_AT_call_all_calls: 1
    <ea61f>   DW_AT_sibling     : <0xea68a>
 <2><ea623>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ea624>   DW_AT_abstract_origin: <0xea5c7>
    <ea628>   DW_AT_location    : 0x43ec2 (location list)
    <ea62c>   DW_AT_GNU_locviews: 0x43eba
 <2><ea630>: Abbrev Number: 9 (DW_TAG_variable)
    <ea631>   DW_AT_abstract_origin: <0xea5d3>
    <ea635>   DW_AT_location    : 0x43ee9 (location list)
    <ea639>   DW_AT_GNU_locviews: 0x43ee3
 <2><ea63d>: Abbrev Number: 9 (DW_TAG_variable)
    <ea63e>   DW_AT_abstract_origin: <0xea5de>
    <ea642>   DW_AT_location    : 0x43f0e (location list)
    <ea646>   DW_AT_GNU_locviews: 0x43f02
 <2><ea64a>: Abbrev Number: 17 (DW_TAG_call_site)
    <ea64b>   DW_AT_call_return_pc: 0x479aec
    <ea653>   DW_AT_call_origin : <0xea4a9>
 <2><ea657>: Abbrev Number: 18 (DW_TAG_call_site)
    <ea658>   DW_AT_call_return_pc: 0x479b1a
    <ea660>   DW_AT_call_origin : <0xea473>
    <ea664>   DW_AT_sibling     : <0xea66f>
 <3><ea668>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea669>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ea66b>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><ea66e>: Abbrev Number: 0
 <2><ea66f>: Abbrev Number: 19 (DW_TAG_call_site)
    <ea670>   DW_AT_call_return_pc: 0x479b3c
    <ea678>   DW_AT_call_origin : <0xea68a>
 <3><ea67c>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea67d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ea67f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><ea682>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <ea683>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ea685>   DW_AT_call_value  : 2 byte block: 73 1 	(DW_OP_breg3 (rbx): 1)
 <3><ea688>: Abbrev Number: 0
 <2><ea689>: Abbrev Number: 0
 <1><ea68a>: Abbrev Number: 38 (DW_TAG_subprogram)
    <ea68b>   DW_AT_external    : 1
    <ea68b>   DW_AT_declaration : 1
    <ea68b>   DW_AT_linkage_name: (indirect string, offset: 0x1a955): memcpy
    <ea68f>   DW_AT_name        : (indirect string, offset: 0x1a94b): __builtin_memcpy
    <ea693>   DW_AT_decl_file   : 11
    <ea694>   DW_AT_decl_line   : 0
 <1><ea695>: Abbrev Number: 0
  Compilation Unit @ offset 0xea696:
   Length:        0xc9f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x18d61
   Pointer Size:  8
 <0><ea6a2>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <ea6a3>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <ea6a7>   DW_AT_language    : 29	(C11)
    <ea6a8>   DW_AT_name        : (indirect line string, offset: 0x18be): src/rtlib/dev_scrn_write.c
    <ea6ac>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <ea6b0>   DW_AT_low_pc      : 0x479be0
    <ea6b8>   DW_AT_high_pc     : 0x50
    <ea6c0>   DW_AT_stmt_list   : 0x6f8a8
 <1><ea6c4>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6c5>   DW_AT_byte_size   : 1
    <ea6c6>   DW_AT_encoding    : 8	(unsigned char)
    <ea6c7>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><ea6cb>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6cc>   DW_AT_byte_size   : 2
    <ea6cd>   DW_AT_encoding    : 7	(unsigned)
    <ea6ce>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><ea6d2>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6d3>   DW_AT_byte_size   : 4
    <ea6d4>   DW_AT_encoding    : 7	(unsigned)
    <ea6d5>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><ea6d9>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6da>   DW_AT_byte_size   : 8
    <ea6db>   DW_AT_encoding    : 7	(unsigned)
    <ea6dc>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><ea6e0>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6e1>   DW_AT_byte_size   : 1
    <ea6e2>   DW_AT_encoding    : 6	(signed char)
    <ea6e3>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><ea6e7>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6e8>   DW_AT_byte_size   : 2
    <ea6e9>   DW_AT_encoding    : 5	(signed)
    <ea6ea>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><ea6ee>: Abbrev Number: 23 (DW_TAG_base_type)
    <ea6ef>   DW_AT_byte_size   : 4
    <ea6f0>   DW_AT_encoding    : 5	(signed)
    <ea6f1>   DW_AT_name        : int
 <1><ea6f5>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea6f6>   DW_AT_byte_size   : 8
    <ea6f7>   DW_AT_encoding    : 5	(signed)
    <ea6f8>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><ea6fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea6fd>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <ea701>   DW_AT_decl_file   : 2
    <ea702>   DW_AT_decl_line   : 153
    <ea703>   DW_AT_decl_column : 27
    <ea704>   DW_AT_type        : <0xea6f5>
 <1><ea708>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <ea709>   DW_AT_byte_size   : 8
 <1><ea70a>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea70b>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <ea70f>   DW_AT_decl_file   : 2
    <ea710>   DW_AT_decl_line   : 194
    <ea711>   DW_AT_decl_column : 27
    <ea712>   DW_AT_type        : <0xea6f5>
 <1><ea716>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea717>   DW_AT_byte_size   : 8
    <ea717>   DW_AT_type        : <0xea71b>
 <1><ea71b>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea71c>   DW_AT_byte_size   : 1
    <ea71d>   DW_AT_encoding    : 6	(signed char)
    <ea71e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><ea722>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea723>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <ea727>   DW_AT_decl_file   : 3
    <ea728>   DW_AT_decl_line   : 209
    <ea729>   DW_AT_decl_column : 23
    <ea72a>   DW_AT_type        : <0xea6d9>
 <1><ea72e>: Abbrev Number: 15 (DW_TAG_typedef)
    <ea72f>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <ea733>   DW_AT_decl_file   : 3
    <ea734>   DW_AT_decl_line   : 321
    <ea736>   DW_AT_decl_column : 24
    <ea737>   DW_AT_type        : <0xea6ee>
 <1><ea73b>: Abbrev Number: 25 (DW_TAG_const_type)
    <ea73c>   DW_AT_type        : <0xea72e>
 <1><ea740>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea741>   DW_AT_byte_size   : 8
    <ea742>   DW_AT_encoding    : 5	(signed)
    <ea743>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><ea747>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea748>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <ea74c>   DW_AT_decl_file   : 4
    <ea74d>   DW_AT_decl_line   : 87
    <ea74e>   DW_AT_decl_column : 19
    <ea74f>   DW_AT_type        : <0xea6fc>
 <1><ea753>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea754>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <ea758>   DW_AT_decl_file   : 4
    <ea759>   DW_AT_decl_line   : 108
    <ea75a>   DW_AT_decl_column : 19
    <ea75b>   DW_AT_type        : <0xea70a>
 <1><ea75f>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea760>   DW_AT_byte_size   : 8
    <ea761>   DW_AT_encoding    : 7	(unsigned)
    <ea762>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><ea766>: Abbrev Number: 16 (DW_TAG_array_type)
    <ea767>   DW_AT_type        : <0xea71b>
    <ea76b>   DW_AT_sibling     : <0xea776>
 <2><ea76f>: Abbrev Number: 26 (DW_TAG_subrange_type)
    <ea770>   DW_AT_type        : <0xea6d9>
    <ea774>   DW_AT_upper_bound : 3
 <2><ea775>: Abbrev Number: 0
 <1><ea776>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea777>   DW_AT_byte_size   : 8
    <ea777>   DW_AT_type        : <0xea77b>
 <1><ea77b>: Abbrev Number: 27 (DW_TAG_const_type)
 <1><ea77c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea77d>   DW_AT_byte_size   : 8
    <ea77d>   DW_AT_type        : <0xea716>
 <1><ea781>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea782>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <ea786>   DW_AT_decl_file   : 5
    <ea787>   DW_AT_decl_line   : 22
    <ea788>   DW_AT_decl_column : 15
    <ea789>   DW_AT_type        : <0xea747>
 <1><ea78d>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <ea78e>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <ea792>   DW_AT_encoding    : 7	(void)
    <ea792>   DW_AT_byte_size   : 4
    <ea792>   DW_AT_type        : <0xea6d2>
    <ea796>   DW_AT_decl_file   : 7
    <ea797>   DW_AT_decl_line   : 1
    <ea798>   DW_AT_decl_column : 14
    <ea798>   DW_AT_sibling     : <0xea80f>
 <2><ea79c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea79d>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <ea7a1>   DW_AT_const_value : 0
 <2><ea7a2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7a3>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <ea7a7>   DW_AT_const_value : 1
 <2><ea7a8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7a9>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <ea7ad>   DW_AT_const_value : 2
 <2><ea7ae>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7af>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <ea7b3>   DW_AT_const_value : 3
 <2><ea7b4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7b5>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <ea7b9>   DW_AT_const_value : 4
 <2><ea7ba>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7bb>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <ea7bf>   DW_AT_const_value : 5
 <2><ea7c0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7c1>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <ea7c5>   DW_AT_const_value : 6
 <2><ea7c6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7c7>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <ea7cb>   DW_AT_const_value : 7
 <2><ea7cc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7cd>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <ea7d1>   DW_AT_const_value : 8
 <2><ea7d2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7d3>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <ea7d7>   DW_AT_const_value : 9
 <2><ea7d8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7d9>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <ea7dd>   DW_AT_const_value : 10
 <2><ea7de>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7df>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <ea7e3>   DW_AT_const_value : 11
 <2><ea7e4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7e5>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <ea7e9>   DW_AT_const_value : 12
 <2><ea7ea>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7eb>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <ea7ef>   DW_AT_const_value : 13
 <2><ea7f0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7f1>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <ea7f5>   DW_AT_const_value : 14
 <2><ea7f6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7f7>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <ea7fb>   DW_AT_const_value : 15
 <2><ea7fc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea7fd>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <ea801>   DW_AT_const_value : 16
 <2><ea802>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea803>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <ea807>   DW_AT_const_value : 17
 <2><ea808>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea809>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <ea80d>   DW_AT_const_value : 18
 <2><ea80e>: Abbrev Number: 0
 <1><ea80f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea810>   DW_AT_byte_size   : 8
    <ea810>   DW_AT_type        : <0xea814>
 <1><ea814>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <ea815>   DW_AT_prototyped  : 1
 <1><ea815>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ea816>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <ea81a>   DW_AT_byte_size   : 24
    <ea81b>   DW_AT_decl_file   : 6
    <ea81c>   DW_AT_decl_line   : 82
    <ea81d>   DW_AT_decl_column : 16
    <ea81e>   DW_AT_sibling     : <0xea84a>
 <2><ea822>: Abbrev Number: 2 (DW_TAG_member)
    <ea823>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <ea827>   DW_AT_decl_file   : 6
    <ea828>   DW_AT_decl_line   : 83
    <ea829>   DW_AT_decl_column : 21
    <ea82a>   DW_AT_type        : <0xea716>
    <ea82e>   DW_AT_data_member_location: 0
 <2><ea82f>: Abbrev Number: 8 (DW_TAG_member)
    <ea830>   DW_AT_name        : len
    <ea834>   DW_AT_decl_file   : 6
    <ea835>   DW_AT_decl_line   : 84
    <ea836>   DW_AT_decl_column : 21
    <ea837>   DW_AT_type        : <0xea753>
    <ea83b>   DW_AT_data_member_location: 8
 <2><ea83c>: Abbrev Number: 2 (DW_TAG_member)
    <ea83d>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ea841>   DW_AT_decl_file   : 6
    <ea842>   DW_AT_decl_line   : 85
    <ea843>   DW_AT_decl_column : 21
    <ea844>   DW_AT_type        : <0xea753>
    <ea848>   DW_AT_data_member_location: 16
 <2><ea849>: Abbrev Number: 0
 <1><ea84a>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea84b>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <ea84f>   DW_AT_decl_file   : 6
    <ea850>   DW_AT_decl_line   : 86
    <ea851>   DW_AT_decl_column : 3
    <ea852>   DW_AT_type        : <0xea815>
 <1><ea856>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea857>   DW_AT_byte_size   : 8
    <ea858>   DW_AT_encoding    : 4	(float)
    <ea859>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><ea85d>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea85e>   DW_AT_byte_size   : 4
    <ea85f>   DW_AT_encoding    : 4	(float)
    <ea860>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><ea864>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea865>   DW_AT_byte_size   : 8
    <ea865>   DW_AT_type        : <0xea72e>
 <1><ea869>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <ea86a>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <ea86e>   DW_AT_encoding    : 7	(void)
    <ea86e>   DW_AT_byte_size   : 4
    <ea86e>   DW_AT_type        : <0xea6d2>
    <ea872>   DW_AT_decl_file   : 8
    <ea873>   DW_AT_decl_line   : 25
    <ea874>   DW_AT_decl_column : 14
    <ea874>   DW_AT_sibling     : <0xea891>
 <2><ea878>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea879>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <ea87d>   DW_AT_const_value : 0
 <2><ea87e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea87f>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <ea883>   DW_AT_const_value : 1
 <2><ea884>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea885>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <ea889>   DW_AT_const_value : 2
 <2><ea88a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ea88b>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <ea88f>   DW_AT_const_value : 3
 <2><ea890>: Abbrev Number: 0
 <1><ea891>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea892>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <ea896>   DW_AT_decl_file   : 8
    <ea897>   DW_AT_decl_line   : 30
    <ea898>   DW_AT_decl_column : 3
    <ea899>   DW_AT_type        : <0xea869>
 <1><ea89d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea89e>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <ea8a2>   DW_AT_decl_file   : 8
    <ea8a3>   DW_AT_decl_line   : 54
    <ea8a4>   DW_AT_decl_column : 15
    <ea8a5>   DW_AT_type        : <0xea8a9>
 <1><ea8a9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea8aa>   DW_AT_byte_size   : 8
    <ea8aa>   DW_AT_type        : <0xea8ae>
 <1><ea8ae>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea8af>   DW_AT_prototyped  : 1
    <ea8af>   DW_AT_type        : <0xea6ee>
    <ea8b3>   DW_AT_sibling     : <0xea8c2>
 <2><ea8b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea8b8>   DW_AT_type        : <0xea8c2>
 <2><ea8bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea8bd>   DW_AT_type        : <0xea6ee>
 <2><ea8c1>: Abbrev Number: 0
 <1><ea8c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea8c3>   DW_AT_byte_size   : 8
    <ea8c3>   DW_AT_type        : <0xea8c7>
 <1><ea8c7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ea8c8>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <ea8cc>   DW_AT_byte_size   : 80
    <ea8cd>   DW_AT_decl_file   : 8
    <ea8ce>   DW_AT_decl_line   : 97
    <ea8cf>   DW_AT_decl_column : 16
    <ea8d0>   DW_AT_sibling     : <0xea98b>
 <2><ea8d4>: Abbrev Number: 2 (DW_TAG_member)
    <ea8d5>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <ea8d9>   DW_AT_decl_file   : 8
    <ea8da>   DW_AT_decl_line   : 98
    <ea8db>   DW_AT_decl_column : 21
    <ea8dc>   DW_AT_type        : <0xea6ee>
    <ea8e0>   DW_AT_data_member_location: 0
 <2><ea8e1>: Abbrev Number: 8 (DW_TAG_member)
    <ea8e2>   DW_AT_name        : len
    <ea8e6>   DW_AT_decl_file   : 8
    <ea8e7>   DW_AT_decl_line   : 99
    <ea8e8>   DW_AT_decl_column : 21
    <ea8e9>   DW_AT_type        : <0xea6ee>
    <ea8ed>   DW_AT_data_member_location: 4
 <2><ea8ee>: Abbrev Number: 2 (DW_TAG_member)
    <ea8ef>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <ea8f3>   DW_AT_decl_file   : 8
    <ea8f4>   DW_AT_decl_line   : 100
    <ea8f5>   DW_AT_decl_column : 21
    <ea8f6>   DW_AT_type        : <0xea891>
    <ea8fa>   DW_AT_data_member_location: 8
 <2><ea8fb>: Abbrev Number: 2 (DW_TAG_member)
    <ea8fc>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ea900>   DW_AT_decl_file   : 8
    <ea901>   DW_AT_decl_line   : 101
    <ea902>   DW_AT_decl_column : 21
    <ea903>   DW_AT_type        : <0xea781>
    <ea907>   DW_AT_data_member_location: 16
 <2><ea908>: Abbrev Number: 2 (DW_TAG_member)
    <ea909>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ea90d>   DW_AT_decl_file   : 8
    <ea90e>   DW_AT_decl_line   : 102
    <ea90f>   DW_AT_decl_column : 21
    <ea910>   DW_AT_type        : <0xea6ee>
    <ea914>   DW_AT_data_member_location: 24
 <2><ea915>: Abbrev Number: 2 (DW_TAG_member)
    <ea916>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <ea91a>   DW_AT_decl_file   : 8
    <ea91b>   DW_AT_decl_line   : 103
    <ea91c>   DW_AT_decl_column : 21
    <ea91d>   DW_AT_type        : <0xea6ee>
    <ea921>   DW_AT_data_member_location: 28
 <2><ea922>: Abbrev Number: 2 (DW_TAG_member)
    <ea923>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <ea927>   DW_AT_decl_file   : 8
    <ea928>   DW_AT_decl_line   : 104
    <ea929>   DW_AT_decl_column : 21
    <ea92a>   DW_AT_type        : <0xea6ee>
    <ea92e>   DW_AT_data_member_location: 32
 <2><ea92f>: Abbrev Number: 2 (DW_TAG_member)
    <ea930>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <ea934>   DW_AT_decl_file   : 8
    <ea935>   DW_AT_decl_line   : 105
    <ea936>   DW_AT_decl_column : 21
    <ea937>   DW_AT_type        : <0xea6d2>
    <ea93b>   DW_AT_data_member_location: 36
 <2><ea93c>: Abbrev Number: 2 (DW_TAG_member)
    <ea93d>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <ea941>   DW_AT_decl_file   : 8
    <ea942>   DW_AT_decl_line   : 106
    <ea943>   DW_AT_decl_column : 21
    <ea944>   DW_AT_type        : <0xea6d2>
    <ea948>   DW_AT_data_member_location: 40
 <2><ea949>: Abbrev Number: 2 (DW_TAG_member)
    <ea94a>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <ea94e>   DW_AT_decl_file   : 8
    <ea94f>   DW_AT_decl_line   : 109
    <ea950>   DW_AT_decl_column : 21
    <ea951>   DW_AT_type        : <0xea766>
    <ea955>   DW_AT_data_member_location: 44
 <2><ea956>: Abbrev Number: 2 (DW_TAG_member)
    <ea957>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <ea95b>   DW_AT_decl_file   : 8
    <ea95c>   DW_AT_decl_line   : 110
    <ea95d>   DW_AT_decl_column : 21
    <ea95e>   DW_AT_type        : <0xea722>
    <ea962>   DW_AT_data_member_location: 48
 <2><ea963>: Abbrev Number: 2 (DW_TAG_member)
    <ea964>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <ea968>   DW_AT_decl_file   : 8
    <ea969>   DW_AT_decl_line   : 112
    <ea96a>   DW_AT_decl_column : 22
    <ea96b>   DW_AT_type        : <0xeac23>
    <ea96f>   DW_AT_data_member_location: 56
 <2><ea970>: Abbrev Number: 2 (DW_TAG_member)
    <ea971>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <ea975>   DW_AT_decl_file   : 8
    <ea976>   DW_AT_decl_line   : 114
    <ea977>   DW_AT_decl_column : 14
    <ea978>   DW_AT_type        : <0xea708>
    <ea97c>   DW_AT_data_member_location: 64
 <2><ea97d>: Abbrev Number: 2 (DW_TAG_member)
    <ea97e>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <ea982>   DW_AT_decl_file   : 8
    <ea983>   DW_AT_decl_line   : 116
    <ea984>   DW_AT_decl_column : 22
    <ea985>   DW_AT_type        : <0xea8c2>
    <ea989>   DW_AT_data_member_location: 72
 <2><ea98a>: Abbrev Number: 0
 <1><ea98b>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea98c>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <ea990>   DW_AT_decl_file   : 8
    <ea991>   DW_AT_decl_line   : 59
    <ea992>   DW_AT_decl_column : 15
    <ea993>   DW_AT_type        : <0xea997>
 <1><ea997>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea998>   DW_AT_byte_size   : 8
    <ea998>   DW_AT_type        : <0xea99c>
 <1><ea99c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea99d>   DW_AT_prototyped  : 1
    <ea99d>   DW_AT_type        : <0xea6ee>
    <ea9a1>   DW_AT_sibling     : <0xea9ab>
 <2><ea9a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea9a6>   DW_AT_type        : <0xea8c2>
 <2><ea9aa>: Abbrev Number: 0
 <1><ea9ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea9ac>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <ea9b0>   DW_AT_decl_file   : 8
    <ea9b1>   DW_AT_decl_line   : 60
    <ea9b2>   DW_AT_decl_column : 15
    <ea9b3>   DW_AT_type        : <0xea997>
 <1><ea9b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea9b8>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <ea9bc>   DW_AT_decl_file   : 8
    <ea9bd>   DW_AT_decl_line   : 61
    <ea9be>   DW_AT_decl_column : 15
    <ea9bf>   DW_AT_type        : <0xea9c3>
 <1><ea9c3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea9c4>   DW_AT_byte_size   : 8
    <ea9c4>   DW_AT_type        : <0xea9c8>
 <1><ea9c8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea9c9>   DW_AT_prototyped  : 1
    <ea9c9>   DW_AT_type        : <0xea6ee>
    <ea9cd>   DW_AT_sibling     : <0xea9e1>
 <2><ea9d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea9d2>   DW_AT_type        : <0xea8c2>
 <2><ea9d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea9d7>   DW_AT_type        : <0xea781>
 <2><ea9db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea9dc>   DW_AT_type        : <0xea6ee>
 <2><ea9e0>: Abbrev Number: 0
 <1><ea9e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea9e2>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <ea9e6>   DW_AT_decl_file   : 8
    <ea9e7>   DW_AT_decl_line   : 62
    <ea9e8>   DW_AT_decl_column : 15
    <ea9e9>   DW_AT_type        : <0xea9ed>
 <1><ea9ed>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ea9ee>   DW_AT_byte_size   : 8
    <ea9ee>   DW_AT_type        : <0xea9f2>
 <1><ea9f2>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ea9f3>   DW_AT_prototyped  : 1
    <ea9f3>   DW_AT_type        : <0xea6ee>
    <ea9f7>   DW_AT_sibling     : <0xeaa06>
 <2><ea9fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ea9fc>   DW_AT_type        : <0xea8c2>
 <2><eaa00>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa01>   DW_AT_type        : <0xeaa06>
 <2><eaa05>: Abbrev Number: 0
 <1><eaa06>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa07>   DW_AT_byte_size   : 8
    <eaa07>   DW_AT_type        : <0xea781>
 <1><eaa0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaa0c>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <eaa10>   DW_AT_decl_file   : 8
    <eaa11>   DW_AT_decl_line   : 63
    <eaa12>   DW_AT_decl_column : 15
    <eaa13>   DW_AT_type        : <0xeaa17>
 <1><eaa17>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa18>   DW_AT_byte_size   : 8
    <eaa18>   DW_AT_type        : <0xeaa1c>
 <1><eaa1c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaa1d>   DW_AT_prototyped  : 1
    <eaa1d>   DW_AT_type        : <0xea6ee>
    <eaa21>   DW_AT_sibling     : <0xeaa35>
 <2><eaa25>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa26>   DW_AT_type        : <0xea8c2>
 <2><eaa2a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa2b>   DW_AT_type        : <0xea708>
 <2><eaa2f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa30>   DW_AT_type        : <0xeaa35>
 <2><eaa34>: Abbrev Number: 0
 <1><eaa35>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa36>   DW_AT_byte_size   : 8
    <eaa36>   DW_AT_type        : <0xea722>
 <1><eaa3a>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaa3b>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <eaa3f>   DW_AT_decl_file   : 8
    <eaa40>   DW_AT_decl_line   : 65
    <eaa41>   DW_AT_decl_column : 15
    <eaa42>   DW_AT_type        : <0xeaa46>
 <1><eaa46>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa47>   DW_AT_byte_size   : 8
    <eaa47>   DW_AT_type        : <0xeaa4b>
 <1><eaa4b>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaa4c>   DW_AT_prototyped  : 1
    <eaa4c>   DW_AT_type        : <0xea6ee>
    <eaa50>   DW_AT_sibling     : <0xeaa64>
 <2><eaa54>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa55>   DW_AT_type        : <0xea8c2>
 <2><eaa59>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa5a>   DW_AT_type        : <0xea864>
 <2><eaa5e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa5f>   DW_AT_type        : <0xeaa35>
 <2><eaa63>: Abbrev Number: 0
 <1><eaa64>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaa65>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <eaa69>   DW_AT_decl_file   : 8
    <eaa6a>   DW_AT_decl_line   : 67
    <eaa6b>   DW_AT_decl_column : 15
    <eaa6c>   DW_AT_type        : <0xeaa70>
 <1><eaa70>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa71>   DW_AT_byte_size   : 8
    <eaa71>   DW_AT_type        : <0xeaa75>
 <1><eaa75>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaa76>   DW_AT_prototyped  : 1
    <eaa76>   DW_AT_type        : <0xea6ee>
    <eaa7a>   DW_AT_sibling     : <0xeaa8e>
 <2><eaa7e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa7f>   DW_AT_type        : <0xea8c2>
 <2><eaa83>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa84>   DW_AT_type        : <0xea776>
 <2><eaa88>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaa89>   DW_AT_type        : <0xea722>
 <2><eaa8d>: Abbrev Number: 0
 <1><eaa8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaa8f>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <eaa93>   DW_AT_decl_file   : 8
    <eaa94>   DW_AT_decl_line   : 69
    <eaa95>   DW_AT_decl_column : 15
    <eaa96>   DW_AT_type        : <0xeaa9a>
 <1><eaa9a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaa9b>   DW_AT_byte_size   : 8
    <eaa9b>   DW_AT_type        : <0xeaa9f>
 <1><eaa9f>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaaa0>   DW_AT_prototyped  : 1
    <eaaa0>   DW_AT_type        : <0xea6ee>
    <eaaa4>   DW_AT_sibling     : <0xeaab8>
 <2><eaaa8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaaa9>   DW_AT_type        : <0xea8c2>
 <2><eaaad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaaae>   DW_AT_type        : <0xeaab8>
 <2><eaab2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaab3>   DW_AT_type        : <0xea722>
 <2><eaab7>: Abbrev Number: 0
 <1><eaab8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaab9>   DW_AT_byte_size   : 8
    <eaab9>   DW_AT_type        : <0xea73b>
 <1><eaabd>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaabe>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <eaac2>   DW_AT_decl_file   : 8
    <eaac3>   DW_AT_decl_line   : 71
    <eaac4>   DW_AT_decl_column : 15
    <eaac5>   DW_AT_type        : <0xeaac9>
 <1><eaac9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaaca>   DW_AT_byte_size   : 8
    <eaaca>   DW_AT_type        : <0xeaace>
 <1><eaace>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaacf>   DW_AT_prototyped  : 1
    <eaacf>   DW_AT_type        : <0xea6ee>
    <eaad3>   DW_AT_sibling     : <0xeaae7>
 <2><eaad7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaad8>   DW_AT_type        : <0xea8c2>
 <2><eaadc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaadd>   DW_AT_type        : <0xea781>
 <2><eaae1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaae2>   DW_AT_type        : <0xea781>
 <2><eaae6>: Abbrev Number: 0
 <1><eaae7>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaae8>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <eaaec>   DW_AT_decl_file   : 8
    <eaaed>   DW_AT_decl_line   : 73
    <eaaee>   DW_AT_decl_column : 15
    <eaaef>   DW_AT_type        : <0xeaac9>
 <1><eaaf3>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaaf4>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <eaaf8>   DW_AT_decl_file   : 8
    <eaaf9>   DW_AT_decl_line   : 75
    <eaafa>   DW_AT_decl_column : 15
    <eaafb>   DW_AT_type        : <0xeaaff>
 <1><eaaff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eab00>   DW_AT_byte_size   : 8
    <eab00>   DW_AT_type        : <0xeab04>
 <1><eab04>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eab05>   DW_AT_prototyped  : 1
    <eab05>   DW_AT_type        : <0xea6ee>
    <eab09>   DW_AT_sibling     : <0xeab18>
 <2><eab0d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eab0e>   DW_AT_type        : <0xea8c2>
 <2><eab12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eab13>   DW_AT_type        : <0xeab18>
 <2><eab17>: Abbrev Number: 0
 <1><eab18>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eab19>   DW_AT_byte_size   : 8
    <eab19>   DW_AT_type        : <0xea84a>
 <1><eab1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <eab1e>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <eab22>   DW_AT_decl_file   : 8
    <eab23>   DW_AT_decl_line   : 76
    <eab24>   DW_AT_decl_column : 15
    <eab25>   DW_AT_type        : <0xeab29>
 <1><eab29>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eab2a>   DW_AT_byte_size   : 8
    <eab2a>   DW_AT_type        : <0xeab2e>
 <1><eab2e>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eab2f>   DW_AT_prototyped  : 1
    <eab2f>   DW_AT_type        : <0xea6ee>
    <eab33>   DW_AT_sibling     : <0xeab47>
 <2><eab37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eab38>   DW_AT_type        : <0xea8c2>
 <2><eab3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eab3d>   DW_AT_type        : <0xea864>
 <2><eab41>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eab42>   DW_AT_type        : <0xea753>
 <2><eab46>: Abbrev Number: 0
 <1><eab47>: Abbrev Number: 3 (DW_TAG_typedef)
    <eab48>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <eab4c>   DW_AT_decl_file   : 8
    <eab4d>   DW_AT_decl_line   : 77
    <eab4e>   DW_AT_decl_column : 15
    <eab4f>   DW_AT_type        : <0xea997>
 <1><eab53>: Abbrev Number: 9 (DW_TAG_structure_type)
    <eab54>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <eab58>   DW_AT_byte_size   : 112
    <eab59>   DW_AT_decl_file   : 8
    <eab5a>   DW_AT_decl_line   : 80
    <eab5b>   DW_AT_decl_column : 16
    <eab5c>   DW_AT_sibling     : <0xeac17>
 <2><eab60>: Abbrev Number: 2 (DW_TAG_member)
    <eab61>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <eab65>   DW_AT_decl_file   : 8
    <eab66>   DW_AT_decl_line   : 81
    <eab67>   DW_AT_decl_column : 25
    <eab68>   DW_AT_type        : <0xea98b>
    <eab6c>   DW_AT_data_member_location: 0
 <2><eab6d>: Abbrev Number: 2 (DW_TAG_member)
    <eab6e>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <eab72>   DW_AT_decl_file   : 8
    <eab73>   DW_AT_decl_line   : 82
    <eab74>   DW_AT_decl_column : 25
    <eab75>   DW_AT_type        : <0xea9ab>
    <eab79>   DW_AT_data_member_location: 8
 <2><eab7a>: Abbrev Number: 2 (DW_TAG_member)
    <eab7b>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <eab7f>   DW_AT_decl_file   : 8
    <eab80>   DW_AT_decl_line   : 83
    <eab81>   DW_AT_decl_column : 25
    <eab82>   DW_AT_type        : <0xea9b7>
    <eab86>   DW_AT_data_member_location: 16
 <2><eab87>: Abbrev Number: 2 (DW_TAG_member)
    <eab88>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <eab8c>   DW_AT_decl_file   : 8
    <eab8d>   DW_AT_decl_line   : 84
    <eab8e>   DW_AT_decl_column : 25
    <eab8f>   DW_AT_type        : <0xea9e1>
    <eab93>   DW_AT_data_member_location: 24
 <2><eab94>: Abbrev Number: 2 (DW_TAG_member)
    <eab95>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <eab99>   DW_AT_decl_file   : 8
    <eab9a>   DW_AT_decl_line   : 85
    <eab9b>   DW_AT_decl_column : 25
    <eab9c>   DW_AT_type        : <0xeaa0b>
    <eaba0>   DW_AT_data_member_location: 32
 <2><eaba1>: Abbrev Number: 2 (DW_TAG_member)
    <eaba2>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <eaba6>   DW_AT_decl_file   : 8
    <eaba7>   DW_AT_decl_line   : 86
    <eaba8>   DW_AT_decl_column : 25
    <eaba9>   DW_AT_type        : <0xeaa3a>
    <eabad>   DW_AT_data_member_location: 40
 <2><eabae>: Abbrev Number: 2 (DW_TAG_member)
    <eabaf>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <eabb3>   DW_AT_decl_file   : 8
    <eabb4>   DW_AT_decl_line   : 87
    <eabb5>   DW_AT_decl_column : 25
    <eabb6>   DW_AT_type        : <0xeaa64>
    <eabba>   DW_AT_data_member_location: 48
 <2><eabbb>: Abbrev Number: 2 (DW_TAG_member)
    <eabbc>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <eabc0>   DW_AT_decl_file   : 8
    <eabc1>   DW_AT_decl_line   : 88
    <eabc2>   DW_AT_decl_column : 25
    <eabc3>   DW_AT_type        : <0xeaa8e>
    <eabc7>   DW_AT_data_member_location: 56
 <2><eabc8>: Abbrev Number: 2 (DW_TAG_member)
    <eabc9>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <eabcd>   DW_AT_decl_file   : 8
    <eabce>   DW_AT_decl_line   : 89
    <eabcf>   DW_AT_decl_column : 25
    <eabd0>   DW_AT_type        : <0xeaabd>
    <eabd4>   DW_AT_data_member_location: 64
 <2><eabd5>: Abbrev Number: 2 (DW_TAG_member)
    <eabd6>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <eabda>   DW_AT_decl_file   : 8
    <eabdb>   DW_AT_decl_line   : 90
    <eabdc>   DW_AT_decl_column : 25
    <eabdd>   DW_AT_type        : <0xeaae7>
    <eabe1>   DW_AT_data_member_location: 72
 <2><eabe2>: Abbrev Number: 2 (DW_TAG_member)
    <eabe3>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <eabe7>   DW_AT_decl_file   : 8
    <eabe8>   DW_AT_decl_line   : 91
    <eabe9>   DW_AT_decl_column : 25
    <eabea>   DW_AT_type        : <0xeaaf3>
    <eabee>   DW_AT_data_member_location: 80
 <2><eabef>: Abbrev Number: 2 (DW_TAG_member)
    <eabf0>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <eabf4>   DW_AT_decl_file   : 8
    <eabf5>   DW_AT_decl_line   : 92
    <eabf6>   DW_AT_decl_column : 25
    <eabf7>   DW_AT_type        : <0xeab1d>
    <eabfb>   DW_AT_data_member_location: 88
 <2><eabfc>: Abbrev Number: 2 (DW_TAG_member)
    <eabfd>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <eac01>   DW_AT_decl_file   : 8
    <eac02>   DW_AT_decl_line   : 93
    <eac03>   DW_AT_decl_column : 25
    <eac04>   DW_AT_type        : <0xea89d>
    <eac08>   DW_AT_data_member_location: 96
 <2><eac09>: Abbrev Number: 2 (DW_TAG_member)
    <eac0a>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <eac0e>   DW_AT_decl_file   : 8
    <eac0f>   DW_AT_decl_line   : 94
    <eac10>   DW_AT_decl_column : 25
    <eac11>   DW_AT_type        : <0xeab47>
    <eac15>   DW_AT_data_member_location: 104
 <2><eac16>: Abbrev Number: 0
 <1><eac17>: Abbrev Number: 3 (DW_TAG_typedef)
    <eac18>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <eac1c>   DW_AT_decl_file   : 8
    <eac1d>   DW_AT_decl_line   : 95
    <eac1e>   DW_AT_decl_column : 3
    <eac1f>   DW_AT_type        : <0xeab53>
 <1><eac23>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eac24>   DW_AT_byte_size   : 8
    <eac24>   DW_AT_type        : <0xeac17>
 <1><eac28>: Abbrev Number: 3 (DW_TAG_typedef)
    <eac29>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <eac2d>   DW_AT_decl_file   : 8
    <eac2e>   DW_AT_decl_line   : 117
    <eac2f>   DW_AT_decl_column : 3
    <eac30>   DW_AT_type        : <0xea8c7>
 <1><eac34>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eac35>   DW_AT_byte_size   : 8
    <eac35>   DW_AT_type        : <0xeac28>
 <1><eac39>: Abbrev Number: 18 (DW_TAG_structure_type)
    <eac3a>   DW_AT_byte_size   : 8
    <eac3b>   DW_AT_decl_file   : 9
    <eac3b>   DW_AT_decl_line   : 4
    <eac3c>   DW_AT_decl_column : 3
    <eac3c>   DW_AT_sibling     : <0xeac5b>
 <2><eac40>: Abbrev Number: 2 (DW_TAG_member)
    <eac41>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <eac45>   DW_AT_decl_file   : 9
    <eac46>   DW_AT_decl_line   : 5
    <eac47>   DW_AT_decl_column : 8
    <eac48>   DW_AT_type        : <0xea6ee>
    <eac4c>   DW_AT_data_member_location: 0
 <2><eac4d>: Abbrev Number: 2 (DW_TAG_member)
    <eac4e>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <eac52>   DW_AT_decl_file   : 9
    <eac53>   DW_AT_decl_line   : 6
    <eac54>   DW_AT_decl_column : 8
    <eac55>   DW_AT_type        : <0xea6ee>
    <eac59>   DW_AT_data_member_location: 4
 <2><eac5a>: Abbrev Number: 0
 <1><eac5b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <eac5c>   DW_AT_byte_size   : 16
    <eac5d>   DW_AT_decl_file   : 9
    <eac5d>   DW_AT_decl_line   : 8
    <eac5e>   DW_AT_decl_column : 3
    <eac5e>   DW_AT_sibling     : <0xeac91>
 <2><eac62>: Abbrev Number: 8 (DW_TAG_member)
    <eac63>   DW_AT_name        : x
    <eac65>   DW_AT_decl_file   : 9
    <eac66>   DW_AT_decl_line   : 9
    <eac67>   DW_AT_decl_column : 8
    <eac68>   DW_AT_type        : <0xea6ee>
    <eac6c>   DW_AT_data_member_location: 0
 <2><eac6d>: Abbrev Number: 8 (DW_TAG_member)
    <eac6e>   DW_AT_name        : y
    <eac70>   DW_AT_decl_file   : 9
    <eac71>   DW_AT_decl_line   : 9
    <eac72>   DW_AT_decl_column : 11
    <eac73>   DW_AT_type        : <0xea6ee>
    <eac77>   DW_AT_data_member_location: 4
 <2><eac78>: Abbrev Number: 8 (DW_TAG_member)
    <eac79>   DW_AT_name        : dx
    <eac7c>   DW_AT_decl_file   : 9
    <eac7d>   DW_AT_decl_line   : 10
    <eac7e>   DW_AT_decl_column : 8
    <eac7f>   DW_AT_type        : <0xea6ee>
    <eac83>   DW_AT_data_member_location: 8
 <2><eac84>: Abbrev Number: 8 (DW_TAG_member)
    <eac85>   DW_AT_name        : dy
    <eac88>   DW_AT_decl_file   : 9
    <eac89>   DW_AT_decl_line   : 10
    <eac8a>   DW_AT_decl_column : 12
    <eac8b>   DW_AT_type        : <0xea6ee>
    <eac8f>   DW_AT_data_member_location: 12
 <2><eac90>: Abbrev Number: 0
 <1><eac91>: Abbrev Number: 29 (DW_TAG_union_type)
    <eac92>   DW_AT_byte_size   : 16
    <eac93>   DW_AT_decl_file   : 9
    <eac94>   DW_AT_decl_line   : 3
    <eac95>   DW_AT_decl_column : 2
    <eac96>   DW_AT_sibling     : <0xeacc1>
 <2><eac9a>: Abbrev Number: 19 (DW_TAG_member)
    <eac9b>   DW_AT_type        : <0xeac39>
 <2><eac9f>: Abbrev Number: 19 (DW_TAG_member)
    <eaca0>   DW_AT_type        : <0xeac5b>
 <2><eaca4>: Abbrev Number: 30 (DW_TAG_member)
    <eaca5>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <eaca9>   DW_AT_decl_file   : 9
    <eacaa>   DW_AT_decl_line   : 12
    <eacab>   DW_AT_decl_column : 7
    <eacac>   DW_AT_type        : <0xea6ee>
 <2><eacb0>: Abbrev Number: 20 (DW_TAG_member)
    <eacb1>   DW_AT_name        : z
    <eacb3>   DW_AT_decl_file   : 9
    <eacb3>   DW_AT_decl_line   : 13
    <eacb4>   DW_AT_decl_column : 7
    <eacb4>   DW_AT_type        : <0xea6ee>
 <2><eacb8>: Abbrev Number: 20 (DW_TAG_member)
    <eacb9>   DW_AT_name        : w
    <eacbb>   DW_AT_decl_file   : 9
    <eacbb>   DW_AT_decl_line   : 14
    <eacbc>   DW_AT_decl_column : 7
    <eacbc>   DW_AT_type        : <0xea6ee>
 <2><eacc0>: Abbrev Number: 0
 <1><eacc1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <eacc2>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <eacc6>   DW_AT_byte_size   : 20
    <eacc7>   DW_AT_decl_file   : 9
    <eacc8>   DW_AT_decl_line   : 1
    <eacc9>   DW_AT_decl_column : 8
    <eacca>   DW_AT_sibling     : <0xeace2>
 <2><eacce>: Abbrev Number: 2 (DW_TAG_member)
    <eaccf>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <eacd3>   DW_AT_decl_file   : 9
    <eacd4>   DW_AT_decl_line   : 2
    <eacd5>   DW_AT_decl_column : 6
    <eacd6>   DW_AT_type        : <0xea6ee>
    <eacda>   DW_AT_data_member_location: 0
 <2><eacdb>: Abbrev Number: 31 (DW_TAG_member)
    <eacdc>   DW_AT_type        : <0xeac91>
    <eace0>   DW_AT_data_member_location: 4
 <2><eace1>: Abbrev Number: 0
 <1><eace2>: Abbrev Number: 3 (DW_TAG_typedef)
    <eace3>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <eace7>   DW_AT_decl_file   : 9
    <eace8>   DW_AT_decl_line   : 18
    <eace9>   DW_AT_decl_column : 23
    <eacea>   DW_AT_type        : <0xeacc1>
 <1><eacee>: Abbrev Number: 3 (DW_TAG_typedef)
    <eacef>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <eacf3>   DW_AT_decl_file   : 10
    <eacf4>   DW_AT_decl_line   : 1
    <eacf5>   DW_AT_decl_column : 23
    <eacf6>   DW_AT_type        : <0xeacfa>
 <1><eacfa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eacfb>   DW_AT_byte_size   : 8
    <eacfb>   DW_AT_type        : <0xeacff>
 <1><eacff>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <ead00>   DW_AT_prototyped  : 1
    <ead00>   DW_AT_type        : <0xeab18>
 <1><ead04>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead05>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <ead09>   DW_AT_decl_file   : 10
    <ead0a>   DW_AT_decl_line   : 2
    <ead0b>   DW_AT_decl_column : 23
    <ead0c>   DW_AT_type        : <0xead10>
 <1><ead10>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ead11>   DW_AT_byte_size   : 8
    <ead11>   DW_AT_type        : <0xead15>
 <1><ead15>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <ead16>   DW_AT_prototyped  : 1
    <ead16>   DW_AT_type        : <0xea6ee>
 <1><ead1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead1b>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <ead1f>   DW_AT_decl_file   : 10
    <ead20>   DW_AT_decl_line   : 3
    <ead21>   DW_AT_decl_column : 23
    <ead22>   DW_AT_type        : <0xead10>
 <1><ead26>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead27>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <ead2b>   DW_AT_decl_file   : 10
    <ead2c>   DW_AT_decl_line   : 10
    <ead2d>   DW_AT_decl_column : 23
    <ead2e>   DW_AT_type        : <0xead32>
 <1><ead32>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ead33>   DW_AT_byte_size   : 8
    <ead33>   DW_AT_type        : <0xead37>
 <1><ead37>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <ead38>   DW_AT_prototyped  : 1
    <ead38>   DW_AT_sibling     : <0xead42>
 <2><ead3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ead3d>   DW_AT_type        : <0xea6ee>
 <2><ead41>: Abbrev Number: 0
 <1><ead42>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead43>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <ead47>   DW_AT_decl_file   : 10
    <ead48>   DW_AT_decl_line   : 14
    <ead49>   DW_AT_decl_column : 23
    <ead4a>   DW_AT_type        : <0xead4e>
 <1><ead4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ead4f>   DW_AT_byte_size   : 8
    <ead4f>   DW_AT_type        : <0xead53>
 <1><ead53>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ead54>   DW_AT_prototyped  : 1
    <ead54>   DW_AT_type        : <0xea6ee>
    <ead58>   DW_AT_sibling     : <0xead6c>
 <2><ead5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ead5d>   DW_AT_type        : <0xea6ee>
 <2><ead61>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ead62>   DW_AT_type        : <0xea6ee>
 <2><ead66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ead67>   DW_AT_type        : <0xea6ee>
 <2><ead6b>: Abbrev Number: 0
 <1><ead6c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead6d>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <ead71>   DW_AT_decl_file   : 10
    <ead72>   DW_AT_decl_line   : 18
    <ead73>   DW_AT_decl_column : 23
    <ead74>   DW_AT_type        : <0xead4e>
 <1><ead78>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead79>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <ead7d>   DW_AT_decl_file   : 10
    <ead7e>   DW_AT_decl_line   : 24
    <ead7f>   DW_AT_decl_column : 23
    <ead80>   DW_AT_type        : <0xea80f>
 <1><ead84>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead85>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <ead89>   DW_AT_decl_file   : 10
    <ead8a>   DW_AT_decl_line   : 28
    <ead8b>   DW_AT_decl_column : 23
    <ead8c>   DW_AT_type        : <0xead90>
 <1><ead90>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ead91>   DW_AT_byte_size   : 8
    <ead91>   DW_AT_type        : <0xead95>
 <1><ead95>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ead96>   DW_AT_prototyped  : 1
    <ead96>   DW_AT_type        : <0xea6ee>
    <ead9a>   DW_AT_sibling     : <0xeada9>
 <2><ead9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ead9f>   DW_AT_type        : <0xea6ee>
 <2><eada3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eada4>   DW_AT_type        : <0xea6ee>
 <2><eada8>: Abbrev Number: 0
 <1><eada9>: Abbrev Number: 3 (DW_TAG_typedef)
    <eadaa>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <eadae>   DW_AT_decl_file   : 10
    <eadaf>   DW_AT_decl_line   : 34
    <eadb0>   DW_AT_decl_column : 23
    <eadb1>   DW_AT_type        : <0xead10>
 <1><eadb5>: Abbrev Number: 3 (DW_TAG_typedef)
    <eadb6>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <eadba>   DW_AT_decl_file   : 10
    <eadbb>   DW_AT_decl_line   : 35
    <eadbc>   DW_AT_decl_column : 23
    <eadbd>   DW_AT_type        : <0xead10>
 <1><eadc1>: Abbrev Number: 3 (DW_TAG_typedef)
    <eadc2>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <eadc6>   DW_AT_decl_file   : 10
    <eadc7>   DW_AT_decl_line   : 36
    <eadc8>   DW_AT_decl_column : 23
    <eadc9>   DW_AT_type        : <0xeadcd>
 <1><eadcd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eadce>   DW_AT_byte_size   : 8
    <eadce>   DW_AT_type        : <0xeadd2>
 <1><eadd2>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <eadd3>   DW_AT_prototyped  : 1
    <eadd3>   DW_AT_sibling     : <0xeade2>
 <2><eadd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eadd8>   DW_AT_type        : <0xeade2>
 <2><eaddc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaddd>   DW_AT_type        : <0xeade2>
 <2><eade1>: Abbrev Number: 0
 <1><eade2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eade3>   DW_AT_byte_size   : 8
    <eade3>   DW_AT_type        : <0xea6ee>
 <1><eade7>: Abbrev Number: 3 (DW_TAG_typedef)
    <eade8>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <eadec>   DW_AT_decl_file   : 10
    <eaded>   DW_AT_decl_line   : 37
    <eadee>   DW_AT_decl_column : 23
    <eadef>   DW_AT_type        : <0xeadcd>
 <1><eadf3>: Abbrev Number: 3 (DW_TAG_typedef)
    <eadf4>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <eadf8>   DW_AT_decl_file   : 10
    <eadf9>   DW_AT_decl_line   : 45
    <eadfa>   DW_AT_decl_column : 24
    <eadfb>   DW_AT_type        : <0xeadff>
 <1><eadff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eae00>   DW_AT_byte_size   : 8
    <eae00>   DW_AT_type        : <0xeae04>
 <1><eae04>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eae05>   DW_AT_prototyped  : 1
    <eae05>   DW_AT_type        : <0xea6d2>
    <eae09>   DW_AT_sibling     : <0xeae1d>
 <2><eae0d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae0e>   DW_AT_type        : <0xea6ee>
 <2><eae12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae13>   DW_AT_type        : <0xea6ee>
 <2><eae17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae18>   DW_AT_type        : <0xea6ee>
 <2><eae1c>: Abbrev Number: 0
 <1><eae1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <eae1e>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <eae22>   DW_AT_decl_file   : 10
    <eae23>   DW_AT_decl_line   : 48
    <eae24>   DW_AT_decl_column : 23
    <eae25>   DW_AT_type        : <0xeae29>
 <1><eae29>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eae2a>   DW_AT_byte_size   : 8
    <eae2a>   DW_AT_type        : <0xeae2e>
 <1><eae2e>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <eae2f>   DW_AT_prototyped  : 1
    <eae2f>   DW_AT_sibling     : <0xeae43>
 <2><eae33>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae34>   DW_AT_type        : <0xea776>
 <2><eae38>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae39>   DW_AT_type        : <0xea722>
 <2><eae3d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae3e>   DW_AT_type        : <0xea6ee>
 <2><eae42>: Abbrev Number: 0
 <1><eae43>: Abbrev Number: 3 (DW_TAG_typedef)
    <eae44>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <eae48>   DW_AT_decl_file   : 10
    <eae49>   DW_AT_decl_line   : 49
    <eae4a>   DW_AT_decl_column : 23
    <eae4b>   DW_AT_type        : <0xeae4f>
 <1><eae4f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eae50>   DW_AT_byte_size   : 8
    <eae50>   DW_AT_type        : <0xeae54>
 <1><eae54>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <eae55>   DW_AT_prototyped  : 1
    <eae55>   DW_AT_sibling     : <0xeae69>
 <2><eae59>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae5a>   DW_AT_type        : <0xeaab8>
 <2><eae5e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae5f>   DW_AT_type        : <0xea722>
 <2><eae63>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae64>   DW_AT_type        : <0xea6ee>
 <2><eae68>: Abbrev Number: 0
 <1><eae69>: Abbrev Number: 3 (DW_TAG_typedef)
    <eae6a>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <eae6e>   DW_AT_decl_file   : 10
    <eae6f>   DW_AT_decl_line   : 51
    <eae70>   DW_AT_decl_column : 24
    <eae71>   DW_AT_type        : <0xeae75>
 <1><eae75>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eae76>   DW_AT_byte_size   : 8
    <eae76>   DW_AT_type        : <0xeae7a>
 <1><eae7a>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eae7b>   DW_AT_prototyped  : 1
    <eae7b>   DW_AT_type        : <0xea716>
    <eae7f>   DW_AT_sibling     : <0xeae8e>
 <2><eae83>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae84>   DW_AT_type        : <0xea716>
 <2><eae88>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eae89>   DW_AT_type        : <0xea753>
 <2><eae8d>: Abbrev Number: 0
 <1><eae8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <eae8f>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <eae93>   DW_AT_decl_file   : 10
    <eae94>   DW_AT_decl_line   : 54
    <eae95>   DW_AT_decl_column : 23
    <eae96>   DW_AT_type        : <0xeae9a>
 <1><eae9a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eae9b>   DW_AT_byte_size   : 8
    <eae9b>   DW_AT_type        : <0xeae9f>
 <1><eae9f>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaea0>   DW_AT_prototyped  : 1
    <eaea0>   DW_AT_type        : <0xea6ee>
    <eaea4>   DW_AT_sibling     : <0xeaec7>
 <2><eaea8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaea9>   DW_AT_type        : <0xeab18>
 <2><eaead>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaeae>   DW_AT_type        : <0xea708>
 <2><eaeb2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaeb3>   DW_AT_type        : <0xea753>
 <2><eaeb7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaeb8>   DW_AT_type        : <0xea6ee>
 <2><eaebc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaebd>   DW_AT_type        : <0xea6ee>
 <2><eaec1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaec2>   DW_AT_type        : <0xea6ee>
 <2><eaec6>: Abbrev Number: 0
 <1><eaec7>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaec8>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <eaecc>   DW_AT_decl_file   : 10
    <eaecd>   DW_AT_decl_line   : 56
    <eaece>   DW_AT_decl_column : 23
    <eaecf>   DW_AT_type        : <0xeaed3>
 <1><eaed3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaed4>   DW_AT_byte_size   : 8
    <eaed4>   DW_AT_type        : <0xeaed8>
 <1><eaed8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaed9>   DW_AT_prototyped  : 1
    <eaed9>   DW_AT_type        : <0xea6ee>
    <eaedd>   DW_AT_sibling     : <0xeaefb>
 <2><eaee1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaee2>   DW_AT_type        : <0xeaab8>
 <2><eaee6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaee7>   DW_AT_type        : <0xea864>
 <2><eaeeb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaeec>   DW_AT_type        : <0xea753>
 <2><eaef0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaef1>   DW_AT_type        : <0xea6ee>
 <2><eaef5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaef6>   DW_AT_type        : <0xea6ee>
 <2><eaefa>: Abbrev Number: 0
 <1><eaefb>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaefc>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <eaf00>   DW_AT_decl_file   : 10
    <eaf01>   DW_AT_decl_line   : 67
    <eaf02>   DW_AT_decl_column : 23
    <eaf03>   DW_AT_type        : <0xeaf07>
 <1><eaf07>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaf08>   DW_AT_byte_size   : 8
    <eaf08>   DW_AT_type        : <0xeaf0c>
 <1><eaf0c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaf0d>   DW_AT_prototyped  : 1
    <eaf0d>   DW_AT_type        : <0xea6ee>
    <eaf11>   DW_AT_sibling     : <0xeaf1b>
 <2><eaf15>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf16>   DW_AT_type        : <0xea6ee>
 <2><eaf1a>: Abbrev Number: 0
 <1><eaf1b>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaf1c>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <eaf20>   DW_AT_decl_file   : 10
    <eaf21>   DW_AT_decl_line   : 68
    <eaf22>   DW_AT_decl_column : 23
    <eaf23>   DW_AT_type        : <0xeaf27>
 <1><eaf27>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaf28>   DW_AT_byte_size   : 8
    <eaf28>   DW_AT_type        : <0xeaf2c>
 <1><eaf2c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaf2d>   DW_AT_prototyped  : 1
    <eaf2d>   DW_AT_type        : <0xea6ee>
    <eaf31>   DW_AT_sibling     : <0xeaf4f>
 <2><eaf35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf36>   DW_AT_type        : <0xeade2>
 <2><eaf3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf3b>   DW_AT_type        : <0xeade2>
 <2><eaf3f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf40>   DW_AT_type        : <0xeade2>
 <2><eaf44>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf45>   DW_AT_type        : <0xeade2>
 <2><eaf49>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf4a>   DW_AT_type        : <0xeade2>
 <2><eaf4e>: Abbrev Number: 0
 <1><eaf4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaf50>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <eaf54>   DW_AT_decl_file   : 10
    <eaf55>   DW_AT_decl_line   : 69
    <eaf56>   DW_AT_decl_column : 23
    <eaf57>   DW_AT_type        : <0xeaf5b>
 <1><eaf5b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaf5c>   DW_AT_byte_size   : 8
    <eaf5c>   DW_AT_type        : <0xeaf60>
 <1><eaf60>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaf61>   DW_AT_prototyped  : 1
    <eaf61>   DW_AT_type        : <0xea6ee>
    <eaf65>   DW_AT_sibling     : <0xeaf7e>
 <2><eaf69>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf6a>   DW_AT_type        : <0xea6ee>
 <2><eaf6e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf6f>   DW_AT_type        : <0xea6ee>
 <2><eaf73>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf74>   DW_AT_type        : <0xea6ee>
 <2><eaf78>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf79>   DW_AT_type        : <0xea6ee>
 <2><eaf7d>: Abbrev Number: 0
 <1><eaf7e>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaf7f>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <eaf83>   DW_AT_decl_file   : 10
    <eaf84>   DW_AT_decl_line   : 73
    <eaf85>   DW_AT_decl_column : 23
    <eaf86>   DW_AT_type        : <0xeaf8a>
 <1><eaf8a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eaf8b>   DW_AT_byte_size   : 8
    <eaf8b>   DW_AT_type        : <0xeaf8f>
 <1><eaf8f>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eaf90>   DW_AT_prototyped  : 1
    <eaf90>   DW_AT_type        : <0xea6ee>
    <eaf94>   DW_AT_sibling     : <0xeaf9e>
 <2><eaf98>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eaf99>   DW_AT_type        : <0xea6cb>
 <2><eaf9d>: Abbrev Number: 0
 <1><eaf9e>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaf9f>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <eafa3>   DW_AT_decl_file   : 10
    <eafa4>   DW_AT_decl_line   : 74
    <eafa5>   DW_AT_decl_column : 23
    <eafa6>   DW_AT_type        : <0xeafaa>
 <1><eafaa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eafab>   DW_AT_byte_size   : 8
    <eafab>   DW_AT_type        : <0xeafaf>
 <1><eafaf>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <eafb0>   DW_AT_prototyped  : 1
    <eafb0>   DW_AT_type        : <0xea6ee>
    <eafb4>   DW_AT_sibling     : <0xeafc3>
 <2><eafb8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eafb9>   DW_AT_type        : <0xea6cb>
 <2><eafbd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eafbe>   DW_AT_type        : <0xea6c4>
 <2><eafc2>: Abbrev Number: 0
 <1><eafc3>: Abbrev Number: 3 (DW_TAG_typedef)
    <eafc4>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <eafc8>   DW_AT_decl_file   : 10
    <eafc9>   DW_AT_decl_line   : 80
    <eafca>   DW_AT_decl_column : 23
    <eafcb>   DW_AT_type        : <0xead32>
 <1><eafcf>: Abbrev Number: 3 (DW_TAG_typedef)
    <eafd0>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <eafd4>   DW_AT_decl_file   : 10
    <eafd5>   DW_AT_decl_line   : 83
    <eafd6>   DW_AT_decl_column : 23
    <eafd7>   DW_AT_type        : <0xeaf07>
 <1><eafdb>: Abbrev Number: 3 (DW_TAG_typedef)
    <eafdc>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <eafe0>   DW_AT_decl_file   : 10
    <eafe1>   DW_AT_decl_line   : 86
    <eafe2>   DW_AT_decl_column : 23
    <eafe3>   DW_AT_type        : <0xead90>
 <1><eafe7>: Abbrev Number: 3 (DW_TAG_typedef)
    <eafe8>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <eafec>   DW_AT_decl_file   : 10
    <eafed>   DW_AT_decl_line   : 89
    <eafee>   DW_AT_decl_column : 23
    <eafef>   DW_AT_type        : <0xead90>
 <1><eaff3>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaff4>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <eaff8>   DW_AT_decl_file   : 10
    <eaff9>   DW_AT_decl_line   : 91
    <eaffa>   DW_AT_decl_column : 23
