    <a8c76>   DW_AT_decl_file   : 9
    <a8c77>   DW_AT_decl_line   : 121
    <a8c78>   DW_AT_decl_column : 23
    <a8c79>   DW_AT_type        : <0xa8ae4>
    <a8c7d>   DW_AT_data_member_location: 216
 <2><a8c7e>: Abbrev Number: 0
 <1><a8c7f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8c80>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <a8c84>   DW_AT_decl_file   : 9
    <a8c85>   DW_AT_decl_line   : 122
    <a8c86>   DW_AT_decl_column : 3
    <a8c87>   DW_AT_type        : <0xa8b05>
 <1><a8c8b>: Abbrev Number: 38 (DW_TAG_structure_type)
    <a8c8c>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <a8c90>   DW_AT_byte_size   : 20848
    <a8c92>   DW_AT_decl_file   : 10
    <a8c93>   DW_AT_decl_line   : 349
    <a8c95>   DW_AT_decl_column : 16
    <a8c96>   DW_AT_sibling     : <0xa8d0b>
 <2><a8c9a>: Abbrev Number: 12 (DW_TAG_member)
    <a8c9b>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <a8c9f>   DW_AT_decl_file   : 10
    <a8c9f>   DW_AT_decl_line   : 350
    <a8ca1>   DW_AT_decl_column : 18
    <a8ca1>   DW_AT_type        : <0xa825e>
    <a8ca5>   DW_AT_data_member_location: 0
 <2><a8ca6>: Abbrev Number: 12 (DW_TAG_member)
    <a8ca7>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <a8cab>   DW_AT_decl_file   : 10
    <a8cab>   DW_AT_decl_line   : 351
    <a8cad>   DW_AT_decl_column : 18
    <a8cad>   DW_AT_type        : <0xa82ec>
    <a8cb1>   DW_AT_data_member_location: 8
 <2><a8cb2>: Abbrev Number: 12 (DW_TAG_member)
    <a8cb3>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <a8cb7>   DW_AT_decl_file   : 10
    <a8cb7>   DW_AT_decl_line   : 352
    <a8cb9>   DW_AT_decl_column : 18
    <a8cb9>   DW_AT_type        : <0xa8338>
    <a8cbd>   DW_AT_data_member_location: 16
 <2><a8cbe>: Abbrev Number: 12 (DW_TAG_member)
    <a8cbf>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <a8cc3>   DW_AT_decl_file   : 10
    <a8cc3>   DW_AT_decl_line   : 353
    <a8cc5>   DW_AT_decl_column : 18
    <a8cc5>   DW_AT_type        : <0xa8286>
    <a8cc9>   DW_AT_data_member_location: 40
 <2><a8cca>: Abbrev Number: 12 (DW_TAG_member)
    <a8ccb>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <a8ccf>   DW_AT_decl_file   : 10
    <a8ccf>   DW_AT_decl_line   : 354
    <a8cd1>   DW_AT_decl_column : 18
    <a8cd1>   DW_AT_type        : <0xa8c7f>
    <a8cd5>   DW_AT_data_member_location: 48
 <2><a8cd6>: Abbrev Number: 15 (DW_TAG_member)
    <a8cd7>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <a8cdb>   DW_AT_decl_file   : 10
    <a8cdb>   DW_AT_decl_line   : 355
    <a8cdd>   DW_AT_decl_column : 18
    <a8cdd>   DW_AT_type        : <0xa8d0b>
    <a8ce1>   DW_AT_data_member_location: 272
 <2><a8ce3>: Abbrev Number: 15 (DW_TAG_member)
    <a8ce4>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <a8ce8>   DW_AT_decl_file   : 10
    <a8ce8>   DW_AT_decl_line   : 356
    <a8cea>   DW_AT_decl_column : 18
    <a8cea>   DW_AT_type        : <0xa825e>
    <a8cee>   DW_AT_data_member_location: 20832
 <2><a8cf0>: Abbrev Number: 15 (DW_TAG_member)
    <a8cf1>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <a8cf5>   DW_AT_decl_file   : 10
    <a8cf5>   DW_AT_decl_line   : 357
    <a8cf7>   DW_AT_decl_column : 18
    <a8cf7>   DW_AT_type        : <0xa825e>
    <a8cfb>   DW_AT_data_member_location: 20836
 <2><a8cfd>: Abbrev Number: 15 (DW_TAG_member)
    <a8cfe>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <a8d02>   DW_AT_decl_file   : 10
    <a8d02>   DW_AT_decl_line   : 358
    <a8d04>   DW_AT_decl_column : 18
    <a8d04>   DW_AT_type        : <0xa82fd>
    <a8d08>   DW_AT_data_member_location: 20840
 <2><a8d0a>: Abbrev Number: 0
 <1><a8d0b>: Abbrev Number: 20 (DW_TAG_array_type)
    <a8d0c>   DW_AT_type        : <0xa8719>
    <a8d10>   DW_AT_sibling     : <0xa8d1c>
 <2><a8d14>: Abbrev Number: 39 (DW_TAG_subrange_type)
    <a8d15>   DW_AT_type        : <0xa8249>
    <a8d19>   DW_AT_upper_bound : 256
 <2><a8d1b>: Abbrev Number: 0
 <1><a8d1c>: Abbrev Number: 19 (DW_TAG_typedef)
    <a8d1d>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <a8d21>   DW_AT_decl_file   : 10
    <a8d22>   DW_AT_decl_line   : 359
    <a8d24>   DW_AT_decl_column : 3
    <a8d25>   DW_AT_type        : <0xa8c8b>
 <1><a8d29>: Abbrev Number: 40 (DW_TAG_variable)
    <a8d2a>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <a8d2e>   DW_AT_decl_file   : 10
    <a8d2f>   DW_AT_decl_line   : 361
    <a8d31>   DW_AT_decl_column : 21
    <a8d32>   DW_AT_type        : <0xa8d1c>
    <a8d36>   DW_AT_external    : 1
    <a8d36>   DW_AT_declaration : 1
 <1><a8d36>: Abbrev Number: 41 (DW_TAG_variable)
    <a8d37>   DW_AT_name        : (indirect string, offset: 0x1b17d): hooks_dev_scrn_null
    <a8d3b>   DW_AT_decl_file   : 1
    <a8d3c>   DW_AT_decl_line   : 5
    <a8d3d>   DW_AT_decl_column : 22
    <a8d3e>   DW_AT_type        : <0xa8708>
    <a8d42>   DW_AT_location    : 9 byte block: 3 0 13 4c 0 0 0 0 0 	(DW_OP_addr: 4c1300)
 <1><a8d4c>: Abbrev Number: 42 (DW_TAG_subprogram)
    <a8d4d>   DW_AT_external    : 1
    <a8d4d>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <a8d51>   DW_AT_decl_file   : 11
    <a8d52>   DW_AT_decl_line   : 61
    <a8d53>   DW_AT_decl_column : 14
    <a8d54>   DW_AT_prototyped  : 1
    <a8d54>   DW_AT_type        : <0xa8278>
    <a8d58>   DW_AT_declaration : 1
    <a8d58>   DW_AT_sibling     : <0xa8d6c>
 <2><a8d5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d5d>   DW_AT_type        : <0xa8278>
 <2><a8d61>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d62>   DW_AT_type        : <0xa825e>
 <2><a8d66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d67>   DW_AT_type        : <0xa8292>
 <2><a8d6b>: Abbrev Number: 0
 <1><a8d6c>: Abbrev Number: 43 (DW_TAG_subprogram)
    <a8d6d>   DW_AT_external    : 1
    <a8d6d>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <a8d71>   DW_AT_decl_file   : 12
    <a8d72>   DW_AT_decl_line   : 565
    <a8d74>   DW_AT_decl_column : 13
    <a8d75>   DW_AT_prototyped  : 1
    <a8d75>   DW_AT_declaration : 1
    <a8d75>   DW_AT_sibling     : <0xa8d7f>
 <2><a8d79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d7a>   DW_AT_type        : <0xa8278>
 <2><a8d7e>: Abbrev Number: 0
 <1><a8d7f>: Abbrev Number: 44 (DW_TAG_subprogram)
    <a8d80>   DW_AT_external    : 1
    <a8d80>   DW_AT_name        : (indirect string, offset: 0x17df6): calloc
    <a8d84>   DW_AT_decl_file   : 12
    <a8d85>   DW_AT_decl_line   : 542
    <a8d87>   DW_AT_decl_column : 14
    <a8d88>   DW_AT_prototyped  : 1
    <a8d88>   DW_AT_type        : <0xa8278>
    <a8d8c>   DW_AT_declaration : 1
    <a8d8c>   DW_AT_sibling     : <0xa8d9b>
 <2><a8d90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d91>   DW_AT_type        : <0xa8292>
 <2><a8d95>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8d96>   DW_AT_type        : <0xa8292>
 <2><a8d9a>: Abbrev Number: 0
 <1><a8d9b>: Abbrev Number: 45 (DW_TAG_subprogram)
    <a8d9c>   DW_AT_external    : 1
    <a8d9c>   DW_AT_name        : (indirect string, offset: 0x1b191): fb_GetX
    <a8da0>   DW_AT_decl_file   : 9
    <a8da1>   DW_AT_decl_line   : 40
    <a8da2>   DW_AT_decl_column : 21
    <a8da3>   DW_AT_prototyped  : 1
    <a8da3>   DW_AT_type        : <0xa825e>
    <a8da7>   DW_AT_declaration : 1
 <1><a8da7>: Abbrev Number: 46 (DW_TAG_subprogram)
    <a8da8>   DW_AT_external    : 1
    <a8da8>   DW_AT_name        : (indirect string, offset: 0x1a8df): fb_GetSize
    <a8dac>   DW_AT_decl_file   : 9
    <a8dad>   DW_AT_decl_line   : 43
    <a8dae>   DW_AT_decl_column : 21
    <a8daf>   DW_AT_prototyped  : 1
    <a8daf>   DW_AT_declaration : 1
    <a8daf>   DW_AT_sibling     : <0xa8dbe>
 <2><a8db3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8db4>   DW_AT_type        : <0xa88d3>
 <2><a8db8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a8db9>   DW_AT_type        : <0xa88d3>
 <2><a8dbd>: Abbrev Number: 0
 <1><a8dbe>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a8dbf>   DW_AT_external    : 1
    <a8dbf>   DW_AT_name        : (indirect string, offset: 0x1b167): fb_DevScrnInit_NoOpen
    <a8dc3>   DW_AT_decl_file   : 1
    <a8dc3>   DW_AT_decl_line   : 56
    <a8dc4>   DW_AT_decl_column : 6
    <a8dc4>   DW_AT_prototyped  : 1
    <a8dc4>   DW_AT_low_pc      : 0x46d770
    <a8dcc>   DW_AT_high_pc     : 0xd7
    <a8dd4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8dd6>   DW_AT_call_all_calls: 1
    <a8dd6>   DW_AT_sibling     : <0xa8e6a>
 <2><a8dda>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <a8ddb>   DW_AT_abstract_origin: <0xa8ea8>
    <a8ddf>   DW_AT_entry_pc    : 0x46d7f6
    <a8de7>   DW_AT_GNU_entry_view: 3
    <a8de8>   DW_AT_ranges      : 0x178cc
    <a8dec>   DW_AT_call_file   : 1
    <a8dec>   DW_AT_call_line   : 66
    <a8ded>   DW_AT_call_column : 9
    <a8dee>   DW_AT_sibling     : <0xa8e5c>
 <3><a8df2>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <a8df3>   DW_AT_abstract_origin: <0xa8f33>
    <a8df7>   DW_AT_entry_pc    : 0x46d7f6
    <a8dff>   DW_AT_GNU_entry_view: 5
    <a8e00>   DW_AT_ranges      : 0x178d7
    <a8e04>   DW_AT_call_file   : 1
    <a8e04>   DW_AT_call_line   : 44
    <a8e05>   DW_AT_call_column : 2
    <a8e06>   DW_AT_sibling     : <0xa8e43>
 <4><a8e0a>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <a8e0b>   DW_AT_ranges      : 0x178d7
 <5><a8e0f>: Abbrev Number: 16 (DW_TAG_variable)
    <a8e10>   DW_AT_abstract_origin: <0xa8f40>
    <a8e14>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <5><a8e17>: Abbrev Number: 13 (DW_TAG_call_site)
    <a8e18>   DW_AT_call_return_pc: 0x46d7fb
    <a8e20>   DW_AT_call_origin : <0xa8da7>
    <a8e24>   DW_AT_sibling     : <0xa8e34>
 <6><a8e28>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8e29>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a8e2b>   DW_AT_call_value  : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <6><a8e2e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8e2f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a8e31>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <6><a8e33>: Abbrev Number: 0
 <5><a8e34>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8e35>   DW_AT_call_return_pc: 0x46d800
    <a8e3d>   DW_AT_call_origin : <0xa8d9b>
 <5><a8e41>: Abbrev Number: 0
 <4><a8e42>: Abbrev Number: 0
 <3><a8e43>: Abbrev Number: 47 (DW_TAG_call_site)
    <a8e44>   DW_AT_call_return_pc: 0x46d828
    <a8e4c>   DW_AT_call_origin : <0xa8d7f>
 <4><a8e50>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8e51>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a8e53>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><a8e55>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8e56>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a8e58>   DW_AT_call_value  : 1 byte block: 44 	(DW_OP_lit20)
 <4><a8e5a>: Abbrev Number: 0
 <3><a8e5b>: Abbrev Number: 0
 <2><a8e5c>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8e5d>   DW_AT_call_return_pc: 0x46d847
    <a8e65>   DW_AT_call_origin : <0xa903e>
 <2><a8e69>: Abbrev Number: 0
 <1><a8e6a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a8e6b>   DW_AT_external    : 1
    <a8e6b>   DW_AT_name        : (indirect string, offset: 0x1b1af): fb_DevScrnEnd
    <a8e6f>   DW_AT_decl_file   : 1
    <a8e6f>   DW_AT_decl_line   : 48
    <a8e70>   DW_AT_decl_column : 6
    <a8e70>   DW_AT_prototyped  : 1
    <a8e70>   DW_AT_low_pc      : 0x46d750
    <a8e78>   DW_AT_high_pc     : 0x1c
    <a8e80>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8e82>   DW_AT_call_all_calls: 1
    <a8e82>   DW_AT_sibling     : <0xa8ea8>
 <2><a8e86>: Abbrev Number: 48 (DW_TAG_formal_parameter)
    <a8e87>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <a8e8b>   DW_AT_decl_file   : 1
    <a8e8c>   DW_AT_decl_line   : 48
    <a8e8d>   DW_AT_decl_column : 30
    <a8e8e>   DW_AT_type        : <0xa8725>
    <a8e92>   DW_AT_location    : 0x33600 (location list)
    <a8e96>   DW_AT_GNU_locviews: 0x335fa
 <2><a8e9a>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8e9b>   DW_AT_call_return_pc: 0x46d762
    <a8ea3>   DW_AT_call_origin : <0xa8d6c>
 <2><a8ea7>: Abbrev Number: 0
 <1><a8ea8>: Abbrev Number: 49 (DW_TAG_subprogram)
    <a8ea9>   DW_AT_external    : 1
    <a8ea9>   DW_AT_name        : (indirect string, offset: 0x1b199): fb_DevScrnInit_Screen
    <a8ead>   DW_AT_decl_file   : 1
    <a8eae>   DW_AT_decl_line   : 42
    <a8eaf>   DW_AT_decl_column : 6
    <a8eb0>   DW_AT_prototyped  : 1
    <a8eb0>   DW_AT_inline      : 1	(inlined)
 <1><a8eb1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a8eb2>   DW_AT_external    : 1
    <a8eb2>   DW_AT_name        : (indirect string, offset: 0x1821a): fb_DevScrnMaybeUpdateWidth
    <a8eb6>   DW_AT_decl_file   : 1
    <a8eb6>   DW_AT_decl_line   : 32
    <a8eb7>   DW_AT_decl_column : 6
    <a8eb7>   DW_AT_prototyped  : 1
    <a8eb7>   DW_AT_low_pc      : 0x46d670
    <a8ebf>   DW_AT_high_pc     : 0x62
    <a8ec7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8ec9>   DW_AT_call_all_calls: 1
    <a8ec9>   DW_AT_sibling     : <0xa8f33>
 <2><a8ecd>: Abbrev Number: 50 (DW_TAG_inlined_subroutine)
    <a8ece>   DW_AT_abstract_origin: <0xa8f33>
    <a8ed2>   DW_AT_entry_pc    : 0x46d68e
    <a8eda>   DW_AT_GNU_entry_view: 1
    <a8edb>   DW_AT_low_pc      : 0x46d68e
    <a8ee3>   DW_AT_high_pc     : 0x2a
    <a8eeb>   DW_AT_call_file   : 1
    <a8eec>   DW_AT_call_line   : 37
    <a8eed>   DW_AT_call_column : 3
    <a8eee>   DW_AT_sibling     : <0xa8f25>
 <3><a8ef2>: Abbrev Number: 16 (DW_TAG_variable)
    <a8ef3>   DW_AT_abstract_origin: <0xa8f40>
    <a8ef7>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><a8efa>: Abbrev Number: 13 (DW_TAG_call_site)
    <a8efb>   DW_AT_call_return_pc: 0x46d69a
    <a8f03>   DW_AT_call_origin : <0xa8da7>
    <a8f07>   DW_AT_sibling     : <0xa8f17>
 <4><a8f0b>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8f0c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a8f0e>   DW_AT_call_value  : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><a8f11>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8f12>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a8f14>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><a8f16>: Abbrev Number: 0
 <3><a8f17>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8f18>   DW_AT_call_return_pc: 0x46d69f
    <a8f20>   DW_AT_call_origin : <0xa8d9b>
 <3><a8f24>: Abbrev Number: 0
 <2><a8f25>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8f26>   DW_AT_call_return_pc: 0x46d6d2
    <a8f2e>   DW_AT_call_origin : <0xa903e>
 <2><a8f32>: Abbrev Number: 0
 <1><a8f33>: Abbrev Number: 51 (DW_TAG_subprogram)
    <a8f34>   DW_AT_external    : 1
    <a8f34>   DW_AT_name        : (indirect string, offset: 0x1b1bd): fb_DevScrnUpdateWidth
    <a8f38>   DW_AT_decl_file   : 1
    <a8f39>   DW_AT_decl_line   : 24
    <a8f3a>   DW_AT_decl_column : 6
    <a8f3b>   DW_AT_prototyped  : 1
    <a8f3b>   DW_AT_inline      : 1	(inlined)
    <a8f3c>   DW_AT_sibling     : <0xa8f4d>
 <2><a8f40>: Abbrev Number: 52 (DW_TAG_variable)
    <a8f41>   DW_AT_name        : (indirect string, offset: 0x1a968): cols
    <a8f45>   DW_AT_decl_file   : 1
    <a8f46>   DW_AT_decl_line   : 26
    <a8f47>   DW_AT_decl_column : 6
    <a8f48>   DW_AT_type        : <0xa825e>
 <2><a8f4c>: Abbrev Number: 0
 <1><a8f4d>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a8f4e>   DW_AT_abstract_origin: <0xa8f33>
    <a8f52>   DW_AT_low_pc      : 0x46d610
    <a8f5a>   DW_AT_high_pc     : 0x58
    <a8f62>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8f64>   DW_AT_call_all_calls: 1
    <a8f64>   DW_AT_sibling     : <0xa8fa8>
 <2><a8f68>: Abbrev Number: 16 (DW_TAG_variable)
    <a8f69>   DW_AT_abstract_origin: <0xa8f40>
    <a8f6d>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a8f70>: Abbrev Number: 13 (DW_TAG_call_site)
    <a8f71>   DW_AT_call_return_pc: 0x46d630
    <a8f79>   DW_AT_call_origin : <0xa8da7>
    <a8f7d>   DW_AT_sibling     : <0xa8f8d>
 <3><a8f81>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8f82>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a8f84>   DW_AT_call_value  : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><a8f87>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8f88>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a8f8a>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a8f8c>: Abbrev Number: 0
 <2><a8f8d>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8f8e>   DW_AT_call_return_pc: 0x46d635
    <a8f96>   DW_AT_call_origin : <0xa8d9b>
 <2><a8f9a>: Abbrev Number: 8 (DW_TAG_call_site)
    <a8f9b>   DW_AT_call_return_pc: 0x46d668
    <a8fa3>   DW_AT_call_origin : <0xa903e>
 <2><a8fa7>: Abbrev Number: 0
 <1><a8fa8>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a8fa9>   DW_AT_abstract_origin: <0xa8ea8>
    <a8fad>   DW_AT_low_pc      : 0x46d6e0
    <a8fb5>   DW_AT_high_pc     : 0x6e
    <a8fbd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8fbf>   DW_AT_call_all_calls: 1
    <a8fbf>   DW_AT_sibling     : <0xa903e>
 <2><a8fc3>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <a8fc4>   DW_AT_abstract_origin: <0xa8f33>
    <a8fc8>   DW_AT_entry_pc    : 0x46d6f6
    <a8fd0>   DW_AT_GNU_entry_view: 1
    <a8fd1>   DW_AT_ranges      : 0x178bc
    <a8fd5>   DW_AT_call_file   : 1
    <a8fd5>   DW_AT_call_line   : 44
    <a8fd6>   DW_AT_call_column : 2
    <a8fd7>   DW_AT_sibling     : <0xa9014>
 <3><a8fdb>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <a8fdc>   DW_AT_ranges      : 0x178bc
 <4><a8fe0>: Abbrev Number: 16 (DW_TAG_variable)
    <a8fe1>   DW_AT_abstract_origin: <0xa8f40>
    <a8fe5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><a8fe8>: Abbrev Number: 13 (DW_TAG_call_site)
    <a8fe9>   DW_AT_call_return_pc: 0x46d700
    <a8ff1>   DW_AT_call_origin : <0xa8da7>
    <a8ff5>   DW_AT_sibling     : <0xa9005>
 <5><a8ff9>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a8ffa>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a8ffc>   DW_AT_call_value  : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <5><a8fff>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a9000>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a9002>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><a9004>: Abbrev Number: 0
 <4><a9005>: Abbrev Number: 8 (DW_TAG_call_site)
    <a9006>   DW_AT_call_return_pc: 0x46d705
    <a900e>   DW_AT_call_origin : <0xa8d9b>
 <4><a9012>: Abbrev Number: 0
 <3><a9013>: Abbrev Number: 0
 <2><a9014>: Abbrev Number: 13 (DW_TAG_call_site)
    <a9015>   DW_AT_call_return_pc: 0x46d72d
    <a901d>   DW_AT_call_origin : <0xa8d7f>
    <a9021>   DW_AT_sibling     : <0xa9030>
 <3><a9025>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a9026>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a9028>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><a902a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a902b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a902d>   DW_AT_call_value  : 1 byte block: 44 	(DW_OP_lit20)
 <3><a902f>: Abbrev Number: 0
 <2><a9030>: Abbrev Number: 8 (DW_TAG_call_site)
    <a9031>   DW_AT_call_return_pc: 0x46d74e
    <a9039>   DW_AT_call_origin : <0xa903e>
 <2><a903d>: Abbrev Number: 0
 <1><a903e>: Abbrev Number: 53 (DW_TAG_subprogram)
    <a903f>   DW_AT_external    : 1
    <a903f>   DW_AT_declaration : 1
    <a903f>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <a9043>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><a9047>: Abbrev Number: 0
  Compilation Unit @ offset 0xa9048:
   Length:        0xf3a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xa6a6
   Pointer Size:  8
 <0><a9054>: Abbrev Number: 30 (DW_TAG_compile_unit)
    <a9055>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <a9059>   DW_AT_language    : 29	(C11)
    <a905a>   DW_AT_name        : (indirect line string, offset: 0xbcd): src/rtlib/dev_scrn_read.c
    <a905e>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <a9062>   DW_AT_ranges      : 0x1791e
    <a9066>   DW_AT_low_pc      : 0x0
    <a906e>   DW_AT_stmt_list   : 0x6200e
 <1><a9072>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9073>   DW_AT_byte_size   : 1
    <a9074>   DW_AT_encoding    : 8	(unsigned char)
    <a9075>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><a9079>: Abbrev Number: 8 (DW_TAG_base_type)
    <a907a>   DW_AT_byte_size   : 2
    <a907b>   DW_AT_encoding    : 7	(unsigned)
    <a907c>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><a9080>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9081>   DW_AT_byte_size   : 4
    <a9082>   DW_AT_encoding    : 7	(unsigned)
    <a9083>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><a9087>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9088>   DW_AT_byte_size   : 8
    <a9089>   DW_AT_encoding    : 7	(unsigned)
    <a908a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><a908e>: Abbrev Number: 8 (DW_TAG_base_type)
    <a908f>   DW_AT_byte_size   : 1
    <a9090>   DW_AT_encoding    : 6	(signed char)
    <a9091>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><a9095>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9096>   DW_AT_byte_size   : 2
    <a9097>   DW_AT_encoding    : 5	(signed)
    <a9098>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><a909c>: Abbrev Number: 31 (DW_TAG_base_type)
    <a909d>   DW_AT_byte_size   : 4
    <a909e>   DW_AT_encoding    : 5	(signed)
    <a909f>   DW_AT_name        : int
 <1><a90a3>: Abbrev Number: 8 (DW_TAG_base_type)
    <a90a4>   DW_AT_byte_size   : 8
    <a90a5>   DW_AT_encoding    : 5	(signed)
    <a90a6>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><a90aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <a90ab>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <a90af>   DW_AT_decl_file   : 3
    <a90b0>   DW_AT_decl_line   : 153
    <a90b1>   DW_AT_decl_column : 27
    <a90b2>   DW_AT_type        : <0xa90a3>
 <1><a90b6>: Abbrev Number: 32 (DW_TAG_pointer_type)
    <a90b7>   DW_AT_byte_size   : 8
 <1><a90b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <a90b9>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <a90bd>   DW_AT_decl_file   : 3
    <a90be>   DW_AT_decl_line   : 194
    <a90bf>   DW_AT_decl_column : 27
    <a90c0>   DW_AT_type        : <0xa90a3>
 <1><a90c4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a90c5>   DW_AT_byte_size   : 8
    <a90c5>   DW_AT_type        : <0xa90c9>
 <1><a90c9>: Abbrev Number: 8 (DW_TAG_base_type)
    <a90ca>   DW_AT_byte_size   : 1
    <a90cb>   DW_AT_encoding    : 6	(signed char)
    <a90cc>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><a90d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <a90d1>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <a90d5>   DW_AT_decl_file   : 4
    <a90d6>   DW_AT_decl_line   : 209
    <a90d7>   DW_AT_decl_column : 23
    <a90d8>   DW_AT_type        : <0xa9087>
 <1><a90dc>: Abbrev Number: 20 (DW_TAG_typedef)
    <a90dd>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <a90e1>   DW_AT_decl_file   : 4
    <a90e2>   DW_AT_decl_line   : 321
    <a90e4>   DW_AT_decl_column : 24
    <a90e5>   DW_AT_type        : <0xa909c>
 <1><a90e9>: Abbrev Number: 33 (DW_TAG_const_type)
    <a90ea>   DW_AT_type        : <0xa90dc>
 <1><a90ee>: Abbrev Number: 8 (DW_TAG_base_type)
    <a90ef>   DW_AT_byte_size   : 8
    <a90f0>   DW_AT_encoding    : 5	(signed)
    <a90f1>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><a90f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a90f6>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <a90fa>   DW_AT_decl_file   : 5
    <a90fb>   DW_AT_decl_line   : 87
    <a90fc>   DW_AT_decl_column : 19
    <a90fd>   DW_AT_type        : <0xa90aa>
 <1><a9101>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9102>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <a9106>   DW_AT_decl_file   : 5
    <a9107>   DW_AT_decl_line   : 108
    <a9108>   DW_AT_decl_column : 19
    <a9109>   DW_AT_type        : <0xa90b8>
 <1><a910d>: Abbrev Number: 8 (DW_TAG_base_type)
    <a910e>   DW_AT_byte_size   : 8
    <a910f>   DW_AT_encoding    : 7	(unsigned)
    <a9110>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><a9114>: Abbrev Number: 18 (DW_TAG_array_type)
    <a9115>   DW_AT_type        : <0xa90c9>
    <a9119>   DW_AT_sibling     : <0xa9124>
 <2><a911d>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <a911e>   DW_AT_type        : <0xa9087>
    <a9122>   DW_AT_upper_bound : 3
 <2><a9123>: Abbrev Number: 0
 <1><a9124>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9125>   DW_AT_byte_size   : 8
    <a9125>   DW_AT_type        : <0xa9129>
 <1><a9129>: Abbrev Number: 34 (DW_TAG_const_type)
 <1><a912a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a912b>   DW_AT_byte_size   : 8
    <a912b>   DW_AT_type        : <0xa90c4>
 <1><a912f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9130>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <a9134>   DW_AT_decl_file   : 6
    <a9135>   DW_AT_decl_line   : 22
    <a9136>   DW_AT_decl_column : 15
    <a9137>   DW_AT_type        : <0xa90f5>
 <1><a913b>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <a913c>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <a9140>   DW_AT_encoding    : 7	(void)
    <a9140>   DW_AT_byte_size   : 4
    <a9140>   DW_AT_type        : <0xa9080>
    <a9144>   DW_AT_decl_file   : 8
    <a9145>   DW_AT_decl_line   : 1
    <a9146>   DW_AT_decl_column : 14
    <a9146>   DW_AT_sibling     : <0xa91bd>
 <2><a914a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a914b>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <a914f>   DW_AT_const_value : 0
 <2><a9150>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9151>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <a9155>   DW_AT_const_value : 1
 <2><a9156>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9157>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <a915b>   DW_AT_const_value : 2
 <2><a915c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a915d>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <a9161>   DW_AT_const_value : 3
 <2><a9162>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9163>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <a9167>   DW_AT_const_value : 4
 <2><a9168>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9169>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <a916d>   DW_AT_const_value : 5
 <2><a916e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a916f>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <a9173>   DW_AT_const_value : 6
 <2><a9174>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9175>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <a9179>   DW_AT_const_value : 7
 <2><a917a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a917b>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <a917f>   DW_AT_const_value : 8
 <2><a9180>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9181>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <a9185>   DW_AT_const_value : 9
 <2><a9186>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9187>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <a918b>   DW_AT_const_value : 10
 <2><a918c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a918d>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <a9191>   DW_AT_const_value : 11
 <2><a9192>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9193>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <a9197>   DW_AT_const_value : 12
 <2><a9198>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9199>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <a919d>   DW_AT_const_value : 13
 <2><a919e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a919f>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <a91a3>   DW_AT_const_value : 14
 <2><a91a4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a91a5>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <a91a9>   DW_AT_const_value : 15
 <2><a91aa>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a91ab>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <a91af>   DW_AT_const_value : 16
 <2><a91b0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a91b1>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <a91b5>   DW_AT_const_value : 17
 <2><a91b6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a91b7>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <a91bb>   DW_AT_const_value : 18
 <2><a91bc>: Abbrev Number: 0
 <1><a91bd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a91be>   DW_AT_byte_size   : 8
    <a91be>   DW_AT_type        : <0xa91c2>
 <1><a91c2>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <a91c3>   DW_AT_prototyped  : 1
 <1><a91c3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a91c4>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <a91c8>   DW_AT_byte_size   : 24
    <a91c9>   DW_AT_decl_file   : 7
    <a91ca>   DW_AT_decl_line   : 82
    <a91cb>   DW_AT_decl_column : 16
    <a91cc>   DW_AT_sibling     : <0xa91f8>
 <2><a91d0>: Abbrev Number: 2 (DW_TAG_member)
    <a91d1>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a91d5>   DW_AT_decl_file   : 7
    <a91d6>   DW_AT_decl_line   : 83
    <a91d7>   DW_AT_decl_column : 21
    <a91d8>   DW_AT_type        : <0xa90c4>
    <a91dc>   DW_AT_data_member_location: 0
 <2><a91dd>: Abbrev Number: 9 (DW_TAG_member)
    <a91de>   DW_AT_name        : len
    <a91e2>   DW_AT_decl_file   : 7
    <a91e3>   DW_AT_decl_line   : 84
    <a91e4>   DW_AT_decl_column : 21
    <a91e5>   DW_AT_type        : <0xa9101>
    <a91e9>   DW_AT_data_member_location: 8
 <2><a91ea>: Abbrev Number: 2 (DW_TAG_member)
    <a91eb>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <a91ef>   DW_AT_decl_file   : 7
    <a91f0>   DW_AT_decl_line   : 85
    <a91f1>   DW_AT_decl_column : 21
    <a91f2>   DW_AT_type        : <0xa9101>
    <a91f6>   DW_AT_data_member_location: 16
 <2><a91f7>: Abbrev Number: 0
 <1><a91f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <a91f9>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <a91fd>   DW_AT_decl_file   : 7
    <a91fe>   DW_AT_decl_line   : 86
    <a91ff>   DW_AT_decl_column : 3
    <a9200>   DW_AT_type        : <0xa91c3>
 <1><a9204>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9205>   DW_AT_byte_size   : 8
    <a9206>   DW_AT_encoding    : 4	(float)
    <a9207>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><a920b>: Abbrev Number: 8 (DW_TAG_base_type)
    <a920c>   DW_AT_byte_size   : 4
    <a920d>   DW_AT_encoding    : 4	(float)
    <a920e>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><a9212>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9213>   DW_AT_byte_size   : 8
    <a9213>   DW_AT_type        : <0xa90dc>
 <1><a9217>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <a9218>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <a921c>   DW_AT_encoding    : 7	(void)
    <a921c>   DW_AT_byte_size   : 4
    <a921c>   DW_AT_type        : <0xa9080>
    <a9220>   DW_AT_decl_file   : 2
    <a9221>   DW_AT_decl_line   : 25
    <a9222>   DW_AT_decl_column : 14
    <a9222>   DW_AT_sibling     : <0xa923f>
 <2><a9226>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9227>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <a922b>   DW_AT_const_value : 0
 <2><a922c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a922d>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <a9231>   DW_AT_const_value : 1
 <2><a9232>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9233>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <a9237>   DW_AT_const_value : 2
 <2><a9238>: Abbrev Number: 5 (DW_TAG_enumerator)
    <a9239>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <a923d>   DW_AT_const_value : 3
 <2><a923e>: Abbrev Number: 0
 <1><a923f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9240>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <a9244>   DW_AT_decl_file   : 2
    <a9245>   DW_AT_decl_line   : 30
    <a9246>   DW_AT_decl_column : 3
    <a9247>   DW_AT_type        : <0xa9217>
 <1><a924b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a924c>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <a9250>   DW_AT_decl_file   : 2
    <a9251>   DW_AT_decl_line   : 54
    <a9252>   DW_AT_decl_column : 15
    <a9253>   DW_AT_type        : <0xa9257>
 <1><a9257>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9258>   DW_AT_byte_size   : 8
    <a9258>   DW_AT_type        : <0xa925c>
 <1><a925c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a925d>   DW_AT_prototyped  : 1
    <a925d>   DW_AT_type        : <0xa909c>
    <a9261>   DW_AT_sibling     : <0xa9270>
 <2><a9265>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9266>   DW_AT_type        : <0xa9270>
 <2><a926a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a926b>   DW_AT_type        : <0xa909c>
 <2><a926f>: Abbrev Number: 0
 <1><a9270>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9271>   DW_AT_byte_size   : 8
    <a9271>   DW_AT_type        : <0xa9275>
 <1><a9275>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a9276>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <a927a>   DW_AT_byte_size   : 80
    <a927b>   DW_AT_decl_file   : 2
    <a927c>   DW_AT_decl_line   : 97
    <a927d>   DW_AT_decl_column : 16
    <a927e>   DW_AT_sibling     : <0xa9339>
 <2><a9282>: Abbrev Number: 2 (DW_TAG_member)
    <a9283>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <a9287>   DW_AT_decl_file   : 2
    <a9288>   DW_AT_decl_line   : 98
    <a9289>   DW_AT_decl_column : 21
    <a928a>   DW_AT_type        : <0xa909c>
    <a928e>   DW_AT_data_member_location: 0
 <2><a928f>: Abbrev Number: 9 (DW_TAG_member)
    <a9290>   DW_AT_name        : len
    <a9294>   DW_AT_decl_file   : 2
    <a9295>   DW_AT_decl_line   : 99
    <a9296>   DW_AT_decl_column : 21
    <a9297>   DW_AT_type        : <0xa909c>
    <a929b>   DW_AT_data_member_location: 4
 <2><a929c>: Abbrev Number: 2 (DW_TAG_member)
    <a929d>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <a92a1>   DW_AT_decl_file   : 2
    <a92a2>   DW_AT_decl_line   : 100
    <a92a3>   DW_AT_decl_column : 21
    <a92a4>   DW_AT_type        : <0xa923f>
    <a92a8>   DW_AT_data_member_location: 8
 <2><a92a9>: Abbrev Number: 2 (DW_TAG_member)
    <a92aa>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <a92ae>   DW_AT_decl_file   : 2
    <a92af>   DW_AT_decl_line   : 101
    <a92b0>   DW_AT_decl_column : 21
    <a92b1>   DW_AT_type        : <0xa912f>
    <a92b5>   DW_AT_data_member_location: 16
 <2><a92b6>: Abbrev Number: 2 (DW_TAG_member)
    <a92b7>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <a92bb>   DW_AT_decl_file   : 2
    <a92bc>   DW_AT_decl_line   : 102
    <a92bd>   DW_AT_decl_column : 21
    <a92be>   DW_AT_type        : <0xa909c>
    <a92c2>   DW_AT_data_member_location: 24
 <2><a92c3>: Abbrev Number: 2 (DW_TAG_member)
    <a92c4>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <a92c8>   DW_AT_decl_file   : 2
    <a92c9>   DW_AT_decl_line   : 103
    <a92ca>   DW_AT_decl_column : 21
    <a92cb>   DW_AT_type        : <0xa909c>
    <a92cf>   DW_AT_data_member_location: 28
 <2><a92d0>: Abbrev Number: 2 (DW_TAG_member)
    <a92d1>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <a92d5>   DW_AT_decl_file   : 2
    <a92d6>   DW_AT_decl_line   : 104
    <a92d7>   DW_AT_decl_column : 21
    <a92d8>   DW_AT_type        : <0xa909c>
    <a92dc>   DW_AT_data_member_location: 32
 <2><a92dd>: Abbrev Number: 2 (DW_TAG_member)
    <a92de>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <a92e2>   DW_AT_decl_file   : 2
    <a92e3>   DW_AT_decl_line   : 105
    <a92e4>   DW_AT_decl_column : 21
    <a92e5>   DW_AT_type        : <0xa9080>
    <a92e9>   DW_AT_data_member_location: 36
 <2><a92ea>: Abbrev Number: 2 (DW_TAG_member)
    <a92eb>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <a92ef>   DW_AT_decl_file   : 2
    <a92f0>   DW_AT_decl_line   : 106
    <a92f1>   DW_AT_decl_column : 21
    <a92f2>   DW_AT_type        : <0xa9080>
    <a92f6>   DW_AT_data_member_location: 40
 <2><a92f7>: Abbrev Number: 2 (DW_TAG_member)
    <a92f8>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <a92fc>   DW_AT_decl_file   : 2
    <a92fd>   DW_AT_decl_line   : 109
    <a92fe>   DW_AT_decl_column : 21
    <a92ff>   DW_AT_type        : <0xa9114>
    <a9303>   DW_AT_data_member_location: 44
 <2><a9304>: Abbrev Number: 2 (DW_TAG_member)
    <a9305>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <a9309>   DW_AT_decl_file   : 2
    <a930a>   DW_AT_decl_line   : 110
    <a930b>   DW_AT_decl_column : 21
    <a930c>   DW_AT_type        : <0xa90d0>
    <a9310>   DW_AT_data_member_location: 48
 <2><a9311>: Abbrev Number: 2 (DW_TAG_member)
    <a9312>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <a9316>   DW_AT_decl_file   : 2
    <a9317>   DW_AT_decl_line   : 112
    <a9318>   DW_AT_decl_column : 22
    <a9319>   DW_AT_type        : <0xa95d1>
    <a931d>   DW_AT_data_member_location: 56
 <2><a931e>: Abbrev Number: 2 (DW_TAG_member)
    <a931f>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <a9323>   DW_AT_decl_file   : 2
    <a9324>   DW_AT_decl_line   : 114
    <a9325>   DW_AT_decl_column : 14
    <a9326>   DW_AT_type        : <0xa90b6>
    <a932a>   DW_AT_data_member_location: 64
 <2><a932b>: Abbrev Number: 2 (DW_TAG_member)
    <a932c>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <a9330>   DW_AT_decl_file   : 2
    <a9331>   DW_AT_decl_line   : 116
    <a9332>   DW_AT_decl_column : 22
    <a9333>   DW_AT_type        : <0xa9270>
    <a9337>   DW_AT_data_member_location: 72
 <2><a9338>: Abbrev Number: 0
 <1><a9339>: Abbrev Number: 3 (DW_TAG_typedef)
    <a933a>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <a933e>   DW_AT_decl_file   : 2
    <a933f>   DW_AT_decl_line   : 59
    <a9340>   DW_AT_decl_column : 15
    <a9341>   DW_AT_type        : <0xa9345>
 <1><a9345>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9346>   DW_AT_byte_size   : 8
    <a9346>   DW_AT_type        : <0xa934a>
 <1><a934a>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a934b>   DW_AT_prototyped  : 1
    <a934b>   DW_AT_type        : <0xa909c>
    <a934f>   DW_AT_sibling     : <0xa9359>
 <2><a9353>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9354>   DW_AT_type        : <0xa9270>
 <2><a9358>: Abbrev Number: 0
 <1><a9359>: Abbrev Number: 3 (DW_TAG_typedef)
    <a935a>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <a935e>   DW_AT_decl_file   : 2
    <a935f>   DW_AT_decl_line   : 60
    <a9360>   DW_AT_decl_column : 15
    <a9361>   DW_AT_type        : <0xa9345>
 <1><a9365>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9366>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <a936a>   DW_AT_decl_file   : 2
    <a936b>   DW_AT_decl_line   : 61
    <a936c>   DW_AT_decl_column : 15
    <a936d>   DW_AT_type        : <0xa9371>
 <1><a9371>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9372>   DW_AT_byte_size   : 8
    <a9372>   DW_AT_type        : <0xa9376>
 <1><a9376>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9377>   DW_AT_prototyped  : 1
    <a9377>   DW_AT_type        : <0xa909c>
    <a937b>   DW_AT_sibling     : <0xa938f>
 <2><a937f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9380>   DW_AT_type        : <0xa9270>
 <2><a9384>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9385>   DW_AT_type        : <0xa912f>
 <2><a9389>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a938a>   DW_AT_type        : <0xa909c>
 <2><a938e>: Abbrev Number: 0
 <1><a938f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9390>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <a9394>   DW_AT_decl_file   : 2
    <a9395>   DW_AT_decl_line   : 62
    <a9396>   DW_AT_decl_column : 15
    <a9397>   DW_AT_type        : <0xa939b>
 <1><a939b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a939c>   DW_AT_byte_size   : 8
    <a939c>   DW_AT_type        : <0xa93a0>
 <1><a93a0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a93a1>   DW_AT_prototyped  : 1
    <a93a1>   DW_AT_type        : <0xa909c>
    <a93a5>   DW_AT_sibling     : <0xa93b4>
 <2><a93a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a93aa>   DW_AT_type        : <0xa9270>
 <2><a93ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a93af>   DW_AT_type        : <0xa93b4>
 <2><a93b3>: Abbrev Number: 0
 <1><a93b4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a93b5>   DW_AT_byte_size   : 8
    <a93b5>   DW_AT_type        : <0xa912f>
 <1><a93b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <a93ba>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <a93be>   DW_AT_decl_file   : 2
    <a93bf>   DW_AT_decl_line   : 63
    <a93c0>   DW_AT_decl_column : 15
    <a93c1>   DW_AT_type        : <0xa93c5>
 <1><a93c5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a93c6>   DW_AT_byte_size   : 8
    <a93c6>   DW_AT_type        : <0xa93ca>
 <1><a93ca>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a93cb>   DW_AT_prototyped  : 1
    <a93cb>   DW_AT_type        : <0xa909c>
    <a93cf>   DW_AT_sibling     : <0xa93e3>
 <2><a93d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a93d4>   DW_AT_type        : <0xa9270>
 <2><a93d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a93d9>   DW_AT_type        : <0xa90b6>
 <2><a93dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a93de>   DW_AT_type        : <0xa93e3>
 <2><a93e2>: Abbrev Number: 0
 <1><a93e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a93e4>   DW_AT_byte_size   : 8
    <a93e4>   DW_AT_type        : <0xa90d0>
 <1><a93e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <a93e9>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <a93ed>   DW_AT_decl_file   : 2
    <a93ee>   DW_AT_decl_line   : 65
    <a93ef>   DW_AT_decl_column : 15
    <a93f0>   DW_AT_type        : <0xa93f4>
 <1><a93f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a93f5>   DW_AT_byte_size   : 8
    <a93f5>   DW_AT_type        : <0xa93f9>
 <1><a93f9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a93fa>   DW_AT_prototyped  : 1
    <a93fa>   DW_AT_type        : <0xa909c>
    <a93fe>   DW_AT_sibling     : <0xa9412>
 <2><a9402>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9403>   DW_AT_type        : <0xa9270>
 <2><a9407>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9408>   DW_AT_type        : <0xa9212>
 <2><a940c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a940d>   DW_AT_type        : <0xa93e3>
 <2><a9411>: Abbrev Number: 0
 <1><a9412>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9413>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <a9417>   DW_AT_decl_file   : 2
    <a9418>   DW_AT_decl_line   : 67
    <a9419>   DW_AT_decl_column : 15
    <a941a>   DW_AT_type        : <0xa941e>
 <1><a941e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a941f>   DW_AT_byte_size   : 8
    <a941f>   DW_AT_type        : <0xa9423>
 <1><a9423>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9424>   DW_AT_prototyped  : 1
    <a9424>   DW_AT_type        : <0xa909c>
    <a9428>   DW_AT_sibling     : <0xa943c>
 <2><a942c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a942d>   DW_AT_type        : <0xa9270>
 <2><a9431>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9432>   DW_AT_type        : <0xa9124>
 <2><a9436>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9437>   DW_AT_type        : <0xa90d0>
 <2><a943b>: Abbrev Number: 0
 <1><a943c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a943d>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <a9441>   DW_AT_decl_file   : 2
    <a9442>   DW_AT_decl_line   : 69
    <a9443>   DW_AT_decl_column : 15
    <a9444>   DW_AT_type        : <0xa9448>
 <1><a9448>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9449>   DW_AT_byte_size   : 8
    <a9449>   DW_AT_type        : <0xa944d>
 <1><a944d>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a944e>   DW_AT_prototyped  : 1
    <a944e>   DW_AT_type        : <0xa909c>
    <a9452>   DW_AT_sibling     : <0xa9466>
 <2><a9456>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9457>   DW_AT_type        : <0xa9270>
 <2><a945b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a945c>   DW_AT_type        : <0xa9466>
 <2><a9460>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9461>   DW_AT_type        : <0xa90d0>
 <2><a9465>: Abbrev Number: 0
 <1><a9466>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9467>   DW_AT_byte_size   : 8
    <a9467>   DW_AT_type        : <0xa90e9>
 <1><a946b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a946c>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <a9470>   DW_AT_decl_file   : 2
    <a9471>   DW_AT_decl_line   : 71
    <a9472>   DW_AT_decl_column : 15
    <a9473>   DW_AT_type        : <0xa9477>
 <1><a9477>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9478>   DW_AT_byte_size   : 8
    <a9478>   DW_AT_type        : <0xa947c>
 <1><a947c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a947d>   DW_AT_prototyped  : 1
    <a947d>   DW_AT_type        : <0xa909c>
    <a9481>   DW_AT_sibling     : <0xa9495>
 <2><a9485>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9486>   DW_AT_type        : <0xa9270>
 <2><a948a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a948b>   DW_AT_type        : <0xa912f>
 <2><a948f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9490>   DW_AT_type        : <0xa912f>
 <2><a9494>: Abbrev Number: 0
 <1><a9495>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9496>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <a949a>   DW_AT_decl_file   : 2
    <a949b>   DW_AT_decl_line   : 73
    <a949c>   DW_AT_decl_column : 15
    <a949d>   DW_AT_type        : <0xa9477>
 <1><a94a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <a94a2>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <a94a6>   DW_AT_decl_file   : 2
    <a94a7>   DW_AT_decl_line   : 75
    <a94a8>   DW_AT_decl_column : 15
    <a94a9>   DW_AT_type        : <0xa94ad>
 <1><a94ad>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a94ae>   DW_AT_byte_size   : 8
    <a94ae>   DW_AT_type        : <0xa94b2>
 <1><a94b2>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a94b3>   DW_AT_prototyped  : 1
    <a94b3>   DW_AT_type        : <0xa909c>
    <a94b7>   DW_AT_sibling     : <0xa94c6>
 <2><a94bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a94bc>   DW_AT_type        : <0xa9270>
 <2><a94c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a94c1>   DW_AT_type        : <0xa94c6>
 <2><a94c5>: Abbrev Number: 0
 <1><a94c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a94c7>   DW_AT_byte_size   : 8
    <a94c7>   DW_AT_type        : <0xa91f8>
 <1><a94cb>: Abbrev Number: 3 (DW_TAG_typedef)
    <a94cc>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <a94d0>   DW_AT_decl_file   : 2
    <a94d1>   DW_AT_decl_line   : 76
    <a94d2>   DW_AT_decl_column : 15
    <a94d3>   DW_AT_type        : <0xa94d7>
 <1><a94d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a94d8>   DW_AT_byte_size   : 8
    <a94d8>   DW_AT_type        : <0xa94dc>
 <1><a94dc>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a94dd>   DW_AT_prototyped  : 1
    <a94dd>   DW_AT_type        : <0xa909c>
    <a94e1>   DW_AT_sibling     : <0xa94f5>
 <2><a94e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a94e6>   DW_AT_type        : <0xa9270>
 <2><a94ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a94eb>   DW_AT_type        : <0xa9212>
 <2><a94ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a94f0>   DW_AT_type        : <0xa9101>
 <2><a94f4>: Abbrev Number: 0
 <1><a94f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a94f6>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <a94fa>   DW_AT_decl_file   : 2
    <a94fb>   DW_AT_decl_line   : 77
    <a94fc>   DW_AT_decl_column : 15
    <a94fd>   DW_AT_type        : <0xa9345>
 <1><a9501>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a9502>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <a9506>   DW_AT_byte_size   : 112
    <a9507>   DW_AT_decl_file   : 2
    <a9508>   DW_AT_decl_line   : 80
    <a9509>   DW_AT_decl_column : 16
    <a950a>   DW_AT_sibling     : <0xa95c5>
 <2><a950e>: Abbrev Number: 2 (DW_TAG_member)
    <a950f>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <a9513>   DW_AT_decl_file   : 2
    <a9514>   DW_AT_decl_line   : 81
    <a9515>   DW_AT_decl_column : 25
    <a9516>   DW_AT_type        : <0xa9339>
    <a951a>   DW_AT_data_member_location: 0
 <2><a951b>: Abbrev Number: 2 (DW_TAG_member)
    <a951c>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <a9520>   DW_AT_decl_file   : 2
    <a9521>   DW_AT_decl_line   : 82
    <a9522>   DW_AT_decl_column : 25
    <a9523>   DW_AT_type        : <0xa9359>
    <a9527>   DW_AT_data_member_location: 8
 <2><a9528>: Abbrev Number: 2 (DW_TAG_member)
    <a9529>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <a952d>   DW_AT_decl_file   : 2
    <a952e>   DW_AT_decl_line   : 83
    <a952f>   DW_AT_decl_column : 25
    <a9530>   DW_AT_type        : <0xa9365>
    <a9534>   DW_AT_data_member_location: 16
 <2><a9535>: Abbrev Number: 2 (DW_TAG_member)
    <a9536>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <a953a>   DW_AT_decl_file   : 2
    <a953b>   DW_AT_decl_line   : 84
    <a953c>   DW_AT_decl_column : 25
    <a953d>   DW_AT_type        : <0xa938f>
    <a9541>   DW_AT_data_member_location: 24
 <2><a9542>: Abbrev Number: 2 (DW_TAG_member)
    <a9543>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <a9547>   DW_AT_decl_file   : 2
    <a9548>   DW_AT_decl_line   : 85
    <a9549>   DW_AT_decl_column : 25
    <a954a>   DW_AT_type        : <0xa93b9>
    <a954e>   DW_AT_data_member_location: 32
 <2><a954f>: Abbrev Number: 2 (DW_TAG_member)
    <a9550>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <a9554>   DW_AT_decl_file   : 2
    <a9555>   DW_AT_decl_line   : 86
    <a9556>   DW_AT_decl_column : 25
    <a9557>   DW_AT_type        : <0xa93e8>
    <a955b>   DW_AT_data_member_location: 40
 <2><a955c>: Abbrev Number: 2 (DW_TAG_member)
    <a955d>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <a9561>   DW_AT_decl_file   : 2
    <a9562>   DW_AT_decl_line   : 87
    <a9563>   DW_AT_decl_column : 25
    <a9564>   DW_AT_type        : <0xa9412>
    <a9568>   DW_AT_data_member_location: 48
 <2><a9569>: Abbrev Number: 2 (DW_TAG_member)
    <a956a>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <a956e>   DW_AT_decl_file   : 2
    <a956f>   DW_AT_decl_line   : 88
    <a9570>   DW_AT_decl_column : 25
    <a9571>   DW_AT_type        : <0xa943c>
    <a9575>   DW_AT_data_member_location: 56
 <2><a9576>: Abbrev Number: 2 (DW_TAG_member)
    <a9577>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <a957b>   DW_AT_decl_file   : 2
    <a957c>   DW_AT_decl_line   : 89
    <a957d>   DW_AT_decl_column : 25
    <a957e>   DW_AT_type        : <0xa946b>
    <a9582>   DW_AT_data_member_location: 64
 <2><a9583>: Abbrev Number: 2 (DW_TAG_member)
    <a9584>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <a9588>   DW_AT_decl_file   : 2
    <a9589>   DW_AT_decl_line   : 90
    <a958a>   DW_AT_decl_column : 25
    <a958b>   DW_AT_type        : <0xa9495>
    <a958f>   DW_AT_data_member_location: 72
 <2><a9590>: Abbrev Number: 2 (DW_TAG_member)
    <a9591>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <a9595>   DW_AT_decl_file   : 2
    <a9596>   DW_AT_decl_line   : 91
    <a9597>   DW_AT_decl_column : 25
    <a9598>   DW_AT_type        : <0xa94a1>
    <a959c>   DW_AT_data_member_location: 80
 <2><a959d>: Abbrev Number: 2 (DW_TAG_member)
    <a959e>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <a95a2>   DW_AT_decl_file   : 2
    <a95a3>   DW_AT_decl_line   : 92
    <a95a4>   DW_AT_decl_column : 25
    <a95a5>   DW_AT_type        : <0xa94cb>
    <a95a9>   DW_AT_data_member_location: 88
 <2><a95aa>: Abbrev Number: 2 (DW_TAG_member)
    <a95ab>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <a95af>   DW_AT_decl_file   : 2
    <a95b0>   DW_AT_decl_line   : 93
    <a95b1>   DW_AT_decl_column : 25
    <a95b2>   DW_AT_type        : <0xa924b>
    <a95b6>   DW_AT_data_member_location: 96
 <2><a95b7>: Abbrev Number: 2 (DW_TAG_member)
    <a95b8>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <a95bc>   DW_AT_decl_file   : 2
    <a95bd>   DW_AT_decl_line   : 94
    <a95be>   DW_AT_decl_column : 25
    <a95bf>   DW_AT_type        : <0xa94f5>
    <a95c3>   DW_AT_data_member_location: 104
 <2><a95c4>: Abbrev Number: 0
 <1><a95c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a95c6>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <a95ca>   DW_AT_decl_file   : 2
    <a95cb>   DW_AT_decl_line   : 95
    <a95cc>   DW_AT_decl_column : 3
    <a95cd>   DW_AT_type        : <0xa9501>
 <1><a95d1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a95d2>   DW_AT_byte_size   : 8
    <a95d2>   DW_AT_type        : <0xa95c5>
 <1><a95d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <a95d7>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <a95db>   DW_AT_decl_file   : 2
    <a95dc>   DW_AT_decl_line   : 117
    <a95dd>   DW_AT_decl_column : 3
    <a95de>   DW_AT_type        : <0xa9275>
 <1><a95e2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a95e3>   DW_AT_byte_size   : 8
    <a95e3>   DW_AT_type        : <0xa95d6>
 <1><a95e7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a95e8>   DW_AT_byte_size   : 20
    <a95e9>   DW_AT_decl_file   : 9
    <a95ea>   DW_AT_decl_line   : 45
    <a95eb>   DW_AT_decl_column : 9
    <a95ec>   DW_AT_sibling     : <0xa960b>
 <2><a95f0>: Abbrev Number: 2 (DW_TAG_member)
    <a95f1>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <a95f5>   DW_AT_decl_file   : 9
    <a95f6>   DW_AT_decl_line   : 46
    <a95f7>   DW_AT_decl_column : 18
    <a95f8>   DW_AT_type        : <0xa960b>
    <a95fc>   DW_AT_data_member_location: 0
 <2><a95fd>: Abbrev Number: 2 (DW_TAG_member)
    <a95fe>   DW_AT_name        : (indirect string, offset: 0x1d448): length
    <a9602>   DW_AT_decl_file   : 9
    <a9603>   DW_AT_decl_line   : 47
    <a9604>   DW_AT_decl_column : 18
    <a9605>   DW_AT_type        : <0xa9080>
    <a9609>   DW_AT_data_member_location: 16
 <2><a960a>: Abbrev Number: 0
 <1><a960b>: Abbrev Number: 18 (DW_TAG_array_type)
    <a960c>   DW_AT_type        : <0xa90c9>
    <a9610>   DW_AT_sibling     : <0xa961b>
 <2><a9614>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <a9615>   DW_AT_type        : <0xa9087>
    <a9619>   DW_AT_upper_bound : 15
 <2><a961a>: Abbrev Number: 0
 <1><a961b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a961c>   DW_AT_name        : (indirect string, offset: 0x1b21f): DEV_SCRN_INFO
    <a9620>   DW_AT_decl_file   : 9
    <a9621>   DW_AT_decl_line   : 48
    <a9622>   DW_AT_decl_column : 3
    <a9623>   DW_AT_type        : <0xa95e7>
 <1><a9627>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a9628>   DW_AT_byte_size   : 8
    <a9629>   DW_AT_decl_file   : 10
    <a962a>   DW_AT_decl_line   : 4
    <a962b>   DW_AT_decl_column : 3
    <a962c>   DW_AT_sibling     : <0xa964b>
 <2><a9630>: Abbrev Number: 2 (DW_TAG_member)
    <a9631>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <a9635>   DW_AT_decl_file   : 10
    <a9636>   DW_AT_decl_line   : 5
    <a9637>   DW_AT_decl_column : 8
    <a9638>   DW_AT_type        : <0xa909c>
    <a963c>   DW_AT_data_member_location: 0
 <2><a963d>: Abbrev Number: 2 (DW_TAG_member)
    <a963e>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <a9642>   DW_AT_decl_file   : 10
    <a9643>   DW_AT_decl_line   : 6
    <a9644>   DW_AT_decl_column : 8
    <a9645>   DW_AT_type        : <0xa909c>
    <a9649>   DW_AT_data_member_location: 4
 <2><a964a>: Abbrev Number: 0
 <1><a964b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a964c>   DW_AT_byte_size   : 16
    <a964d>   DW_AT_decl_file   : 10
    <a964e>   DW_AT_decl_line   : 8
    <a964f>   DW_AT_decl_column : 3
    <a9650>   DW_AT_sibling     : <0xa9683>
 <2><a9654>: Abbrev Number: 9 (DW_TAG_member)
    <a9655>   DW_AT_name        : x
    <a9657>   DW_AT_decl_file   : 10
    <a9658>   DW_AT_decl_line   : 9
    <a9659>   DW_AT_decl_column : 8
    <a965a>   DW_AT_type        : <0xa909c>
    <a965e>   DW_AT_data_member_location: 0
 <2><a965f>: Abbrev Number: 9 (DW_TAG_member)
    <a9660>   DW_AT_name        : y
    <a9662>   DW_AT_decl_file   : 10
    <a9663>   DW_AT_decl_line   : 9
    <a9664>   DW_AT_decl_column : 11
    <a9665>   DW_AT_type        : <0xa909c>
    <a9669>   DW_AT_data_member_location: 4
 <2><a966a>: Abbrev Number: 9 (DW_TAG_member)
    <a966b>   DW_AT_name        : dx
    <a966e>   DW_AT_decl_file   : 10
    <a966f>   DW_AT_decl_line   : 10
    <a9670>   DW_AT_decl_column : 8
    <a9671>   DW_AT_type        : <0xa909c>
    <a9675>   DW_AT_data_member_location: 8
 <2><a9676>: Abbrev Number: 9 (DW_TAG_member)
    <a9677>   DW_AT_name        : dy
    <a967a>   DW_AT_decl_file   : 10
    <a967b>   DW_AT_decl_line   : 10
    <a967c>   DW_AT_decl_column : 12
    <a967d>   DW_AT_type        : <0xa909c>
    <a9681>   DW_AT_data_member_location: 12
 <2><a9682>: Abbrev Number: 0
 <1><a9683>: Abbrev Number: 36 (DW_TAG_union_type)
    <a9684>   DW_AT_byte_size   : 16
    <a9685>   DW_AT_decl_file   : 10
    <a9686>   DW_AT_decl_line   : 3
    <a9687>   DW_AT_decl_column : 2
    <a9688>   DW_AT_sibling     : <0xa96b3>
 <2><a968c>: Abbrev Number: 23 (DW_TAG_member)
    <a968d>   DW_AT_type        : <0xa9627>
 <2><a9691>: Abbrev Number: 23 (DW_TAG_member)
    <a9692>   DW_AT_type        : <0xa964b>
 <2><a9696>: Abbrev Number: 37 (DW_TAG_member)
    <a9697>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <a969b>   DW_AT_decl_file   : 10
    <a969c>   DW_AT_decl_line   : 12
    <a969d>   DW_AT_decl_column : 7
    <a969e>   DW_AT_type        : <0xa909c>
 <2><a96a2>: Abbrev Number: 24 (DW_TAG_member)
    <a96a3>   DW_AT_name        : z
    <a96a5>   DW_AT_decl_file   : 10
    <a96a5>   DW_AT_decl_line   : 13
    <a96a6>   DW_AT_decl_column : 7
    <a96a6>   DW_AT_type        : <0xa909c>
 <2><a96aa>: Abbrev Number: 24 (DW_TAG_member)
    <a96ab>   DW_AT_name        : w
    <a96ad>   DW_AT_decl_file   : 10
    <a96ad>   DW_AT_decl_line   : 14
    <a96ae>   DW_AT_decl_column : 7
    <a96ae>   DW_AT_type        : <0xa909c>
 <2><a96b2>: Abbrev Number: 0
 <1><a96b3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a96b4>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <a96b8>   DW_AT_byte_size   : 20
    <a96b9>   DW_AT_decl_file   : 10
    <a96ba>   DW_AT_decl_line   : 1
    <a96bb>   DW_AT_decl_column : 8
    <a96bc>   DW_AT_sibling     : <0xa96d4>
 <2><a96c0>: Abbrev Number: 2 (DW_TAG_member)
    <a96c1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <a96c5>   DW_AT_decl_file   : 10
    <a96c6>   DW_AT_decl_line   : 2
    <a96c7>   DW_AT_decl_column : 6
    <a96c8>   DW_AT_type        : <0xa909c>
    <a96cc>   DW_AT_data_member_location: 0
 <2><a96cd>: Abbrev Number: 38 (DW_TAG_member)
    <a96ce>   DW_AT_type        : <0xa9683>
    <a96d2>   DW_AT_data_member_location: 4
 <2><a96d3>: Abbrev Number: 0
 <1><a96d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a96d5>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <a96d9>   DW_AT_decl_file   : 10
    <a96da>   DW_AT_decl_line   : 18
    <a96db>   DW_AT_decl_column : 23
    <a96dc>   DW_AT_type        : <0xa96b3>
 <1><a96e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <a96e1>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <a96e5>   DW_AT_decl_file   : 11
    <a96e6>   DW_AT_decl_line   : 1
    <a96e7>   DW_AT_decl_column : 23
    <a96e8>   DW_AT_type        : <0xa96ec>
 <1><a96ec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a96ed>   DW_AT_byte_size   : 8
    <a96ed>   DW_AT_type        : <0xa96f1>
 <1><a96f1>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <a96f2>   DW_AT_prototyped  : 1
    <a96f2>   DW_AT_type        : <0xa94c6>
 <1><a96f6>: Abbrev Number: 3 (DW_TAG_typedef)
    <a96f7>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <a96fb>   DW_AT_decl_file   : 11
    <a96fc>   DW_AT_decl_line   : 2
    <a96fd>   DW_AT_decl_column : 23
    <a96fe>   DW_AT_type        : <0xa9702>
 <1><a9702>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9703>   DW_AT_byte_size   : 8
    <a9703>   DW_AT_type        : <0xa9707>
 <1><a9707>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <a9708>   DW_AT_prototyped  : 1
    <a9708>   DW_AT_type        : <0xa909c>
 <1><a970c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a970d>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <a9711>   DW_AT_decl_file   : 11
    <a9712>   DW_AT_decl_line   : 3
    <a9713>   DW_AT_decl_column : 23
    <a9714>   DW_AT_type        : <0xa9702>
 <1><a9718>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9719>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <a971d>   DW_AT_decl_file   : 11
    <a971e>   DW_AT_decl_line   : 10
    <a971f>   DW_AT_decl_column : 23
    <a9720>   DW_AT_type        : <0xa9724>
 <1><a9724>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9725>   DW_AT_byte_size   : 8
    <a9725>   DW_AT_type        : <0xa9729>
 <1><a9729>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <a972a>   DW_AT_prototyped  : 1
    <a972a>   DW_AT_sibling     : <0xa9734>
 <2><a972e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a972f>   DW_AT_type        : <0xa909c>
 <2><a9733>: Abbrev Number: 0
 <1><a9734>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9735>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <a9739>   DW_AT_decl_file   : 11
    <a973a>   DW_AT_decl_line   : 14
    <a973b>   DW_AT_decl_column : 23
    <a973c>   DW_AT_type        : <0xa9740>
 <1><a9740>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9741>   DW_AT_byte_size   : 8
    <a9741>   DW_AT_type        : <0xa9745>
 <1><a9745>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9746>   DW_AT_prototyped  : 1
    <a9746>   DW_AT_type        : <0xa909c>
    <a974a>   DW_AT_sibling     : <0xa975e>
 <2><a974e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a974f>   DW_AT_type        : <0xa909c>
 <2><a9753>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9754>   DW_AT_type        : <0xa909c>
 <2><a9758>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9759>   DW_AT_type        : <0xa909c>
 <2><a975d>: Abbrev Number: 0
 <1><a975e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a975f>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <a9763>   DW_AT_decl_file   : 11
    <a9764>   DW_AT_decl_line   : 18
    <a9765>   DW_AT_decl_column : 23
    <a9766>   DW_AT_type        : <0xa9740>
 <1><a976a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a976b>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <a976f>   DW_AT_decl_file   : 11
    <a9770>   DW_AT_decl_line   : 24
    <a9771>   DW_AT_decl_column : 23
    <a9772>   DW_AT_type        : <0xa91bd>
 <1><a9776>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9777>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <a977b>   DW_AT_decl_file   : 11
    <a977c>   DW_AT_decl_line   : 28
    <a977d>   DW_AT_decl_column : 23
    <a977e>   DW_AT_type        : <0xa9782>
 <1><a9782>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9783>   DW_AT_byte_size   : 8
    <a9783>   DW_AT_type        : <0xa9787>
 <1><a9787>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9788>   DW_AT_prototyped  : 1
    <a9788>   DW_AT_type        : <0xa909c>
    <a978c>   DW_AT_sibling     : <0xa979b>
 <2><a9790>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9791>   DW_AT_type        : <0xa909c>
 <2><a9795>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9796>   DW_AT_type        : <0xa909c>
 <2><a979a>: Abbrev Number: 0
 <1><a979b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a979c>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <a97a0>   DW_AT_decl_file   : 11
    <a97a1>   DW_AT_decl_line   : 34
    <a97a2>   DW_AT_decl_column : 23
    <a97a3>   DW_AT_type        : <0xa9702>
 <1><a97a7>: Abbrev Number: 3 (DW_TAG_typedef)
    <a97a8>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <a97ac>   DW_AT_decl_file   : 11
    <a97ad>   DW_AT_decl_line   : 35
    <a97ae>   DW_AT_decl_column : 23
    <a97af>   DW_AT_type        : <0xa9702>
 <1><a97b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <a97b4>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <a97b8>   DW_AT_decl_file   : 11
    <a97b9>   DW_AT_decl_line   : 36
    <a97ba>   DW_AT_decl_column : 23
    <a97bb>   DW_AT_type        : <0xa97bf>
 <1><a97bf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a97c0>   DW_AT_byte_size   : 8
    <a97c0>   DW_AT_type        : <0xa97c4>
 <1><a97c4>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <a97c5>   DW_AT_prototyped  : 1
    <a97c5>   DW_AT_sibling     : <0xa97d4>
 <2><a97c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a97ca>   DW_AT_type        : <0xa97d4>
 <2><a97ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a97cf>   DW_AT_type        : <0xa97d4>
 <2><a97d3>: Abbrev Number: 0
 <1><a97d4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a97d5>   DW_AT_byte_size   : 8
    <a97d5>   DW_AT_type        : <0xa909c>
 <1><a97d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <a97da>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <a97de>   DW_AT_decl_file   : 11
    <a97df>   DW_AT_decl_line   : 37
    <a97e0>   DW_AT_decl_column : 23
    <a97e1>   DW_AT_type        : <0xa97bf>
 <1><a97e5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a97e6>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <a97ea>   DW_AT_decl_file   : 11
    <a97eb>   DW_AT_decl_line   : 45
    <a97ec>   DW_AT_decl_column : 24
    <a97ed>   DW_AT_type        : <0xa97f1>
 <1><a97f1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a97f2>   DW_AT_byte_size   : 8
    <a97f2>   DW_AT_type        : <0xa97f6>
 <1><a97f6>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a97f7>   DW_AT_prototyped  : 1
    <a97f7>   DW_AT_type        : <0xa9080>
    <a97fb>   DW_AT_sibling     : <0xa980f>
 <2><a97ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9800>   DW_AT_type        : <0xa909c>
 <2><a9804>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9805>   DW_AT_type        : <0xa909c>
 <2><a9809>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a980a>   DW_AT_type        : <0xa909c>
 <2><a980e>: Abbrev Number: 0
 <1><a980f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9810>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <a9814>   DW_AT_decl_file   : 11
    <a9815>   DW_AT_decl_line   : 48
    <a9816>   DW_AT_decl_column : 23
    <a9817>   DW_AT_type        : <0xa981b>
 <1><a981b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a981c>   DW_AT_byte_size   : 8
    <a981c>   DW_AT_type        : <0xa9820>
 <1><a9820>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <a9821>   DW_AT_prototyped  : 1
    <a9821>   DW_AT_sibling     : <0xa9835>
 <2><a9825>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9826>   DW_AT_type        : <0xa9124>
 <2><a982a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a982b>   DW_AT_type        : <0xa90d0>
 <2><a982f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9830>   DW_AT_type        : <0xa909c>
 <2><a9834>: Abbrev Number: 0
 <1><a9835>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9836>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <a983a>   DW_AT_decl_file   : 11
    <a983b>   DW_AT_decl_line   : 49
    <a983c>   DW_AT_decl_column : 23
    <a983d>   DW_AT_type        : <0xa9841>
 <1><a9841>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9842>   DW_AT_byte_size   : 8
    <a9842>   DW_AT_type        : <0xa9846>
 <1><a9846>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <a9847>   DW_AT_prototyped  : 1
    <a9847>   DW_AT_sibling     : <0xa985b>
 <2><a984b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a984c>   DW_AT_type        : <0xa9466>
 <2><a9850>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9851>   DW_AT_type        : <0xa90d0>
 <2><a9855>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9856>   DW_AT_type        : <0xa909c>
 <2><a985a>: Abbrev Number: 0
 <1><a985b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a985c>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <a9860>   DW_AT_decl_file   : 11
    <a9861>   DW_AT_decl_line   : 51
    <a9862>   DW_AT_decl_column : 24
    <a9863>   DW_AT_type        : <0xa9867>
 <1><a9867>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9868>   DW_AT_byte_size   : 8
    <a9868>   DW_AT_type        : <0xa986c>
 <1><a986c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a986d>   DW_AT_prototyped  : 1
    <a986d>   DW_AT_type        : <0xa90c4>
    <a9871>   DW_AT_sibling     : <0xa9880>
 <2><a9875>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9876>   DW_AT_type        : <0xa90c4>
 <2><a987a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a987b>   DW_AT_type        : <0xa9101>
 <2><a987f>: Abbrev Number: 0
 <1><a9880>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9881>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <a9885>   DW_AT_decl_file   : 11
    <a9886>   DW_AT_decl_line   : 54
    <a9887>   DW_AT_decl_column : 23
    <a9888>   DW_AT_type        : <0xa988c>
 <1><a988c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a988d>   DW_AT_byte_size   : 8
    <a988d>   DW_AT_type        : <0xa9891>
 <1><a9891>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9892>   DW_AT_prototyped  : 1
    <a9892>   DW_AT_type        : <0xa909c>
    <a9896>   DW_AT_sibling     : <0xa98b9>
 <2><a989a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a989b>   DW_AT_type        : <0xa94c6>
 <2><a989f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98a0>   DW_AT_type        : <0xa90b6>
 <2><a98a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98a5>   DW_AT_type        : <0xa9101>
 <2><a98a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98aa>   DW_AT_type        : <0xa909c>
 <2><a98ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98af>   DW_AT_type        : <0xa909c>
 <2><a98b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98b4>   DW_AT_type        : <0xa909c>
 <2><a98b8>: Abbrev Number: 0
 <1><a98b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <a98ba>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <a98be>   DW_AT_decl_file   : 11
    <a98bf>   DW_AT_decl_line   : 56
    <a98c0>   DW_AT_decl_column : 23
    <a98c1>   DW_AT_type        : <0xa98c5>
 <1><a98c5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a98c6>   DW_AT_byte_size   : 8
    <a98c6>   DW_AT_type        : <0xa98ca>
 <1><a98ca>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a98cb>   DW_AT_prototyped  : 1
    <a98cb>   DW_AT_type        : <0xa909c>
    <a98cf>   DW_AT_sibling     : <0xa98ed>
 <2><a98d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98d4>   DW_AT_type        : <0xa9466>
 <2><a98d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98d9>   DW_AT_type        : <0xa9212>
 <2><a98dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98de>   DW_AT_type        : <0xa9101>
 <2><a98e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98e3>   DW_AT_type        : <0xa909c>
 <2><a98e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a98e8>   DW_AT_type        : <0xa909c>
 <2><a98ec>: Abbrev Number: 0
 <1><a98ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <a98ee>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <a98f2>   DW_AT_decl_file   : 11
    <a98f3>   DW_AT_decl_line   : 67
    <a98f4>   DW_AT_decl_column : 23
    <a98f5>   DW_AT_type        : <0xa98f9>
 <1><a98f9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a98fa>   DW_AT_byte_size   : 8
    <a98fa>   DW_AT_type        : <0xa98fe>
 <1><a98fe>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a98ff>   DW_AT_prototyped  : 1
    <a98ff>   DW_AT_type        : <0xa909c>
    <a9903>   DW_AT_sibling     : <0xa990d>
 <2><a9907>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9908>   DW_AT_type        : <0xa909c>
 <2><a990c>: Abbrev Number: 0
 <1><a990d>: Abbrev Number: 3 (DW_TAG_typedef)
    <a990e>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <a9912>   DW_AT_decl_file   : 11
    <a9913>   DW_AT_decl_line   : 68
    <a9914>   DW_AT_decl_column : 23
    <a9915>   DW_AT_type        : <0xa9919>
 <1><a9919>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a991a>   DW_AT_byte_size   : 8
    <a991a>   DW_AT_type        : <0xa991e>
 <1><a991e>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a991f>   DW_AT_prototyped  : 1
    <a991f>   DW_AT_type        : <0xa909c>
    <a9923>   DW_AT_sibling     : <0xa9941>
 <2><a9927>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9928>   DW_AT_type        : <0xa97d4>
 <2><a992c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a992d>   DW_AT_type        : <0xa97d4>
 <2><a9931>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9932>   DW_AT_type        : <0xa97d4>
 <2><a9936>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9937>   DW_AT_type        : <0xa97d4>
 <2><a993b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a993c>   DW_AT_type        : <0xa97d4>
 <2><a9940>: Abbrev Number: 0
 <1><a9941>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9942>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <a9946>   DW_AT_decl_file   : 11
    <a9947>   DW_AT_decl_line   : 69
    <a9948>   DW_AT_decl_column : 23
    <a9949>   DW_AT_type        : <0xa994d>
 <1><a994d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a994e>   DW_AT_byte_size   : 8
    <a994e>   DW_AT_type        : <0xa9952>
 <1><a9952>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9953>   DW_AT_prototyped  : 1
    <a9953>   DW_AT_type        : <0xa909c>
    <a9957>   DW_AT_sibling     : <0xa9970>
 <2><a995b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a995c>   DW_AT_type        : <0xa909c>
 <2><a9960>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9961>   DW_AT_type        : <0xa909c>
 <2><a9965>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9966>   DW_AT_type        : <0xa909c>
 <2><a996a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a996b>   DW_AT_type        : <0xa909c>
 <2><a996f>: Abbrev Number: 0
 <1><a9970>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9971>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <a9975>   DW_AT_decl_file   : 11
    <a9976>   DW_AT_decl_line   : 73
    <a9977>   DW_AT_decl_column : 23
    <a9978>   DW_AT_type        : <0xa997c>
 <1><a997c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a997d>   DW_AT_byte_size   : 8
    <a997d>   DW_AT_type        : <0xa9981>
 <1><a9981>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a9982>   DW_AT_prototyped  : 1
    <a9982>   DW_AT_type        : <0xa909c>
    <a9986>   DW_AT_sibling     : <0xa9990>
 <2><a998a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a998b>   DW_AT_type        : <0xa9079>
 <2><a998f>: Abbrev Number: 0
 <1><a9990>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9991>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <a9995>   DW_AT_decl_file   : 11
    <a9996>   DW_AT_decl_line   : 74
    <a9997>   DW_AT_decl_column : 23
    <a9998>   DW_AT_type        : <0xa999c>
 <1><a999c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a999d>   DW_AT_byte_size   : 8
    <a999d>   DW_AT_type        : <0xa99a1>
 <1><a99a1>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <a99a2>   DW_AT_prototyped  : 1
    <a99a2>   DW_AT_type        : <0xa909c>
    <a99a6>   DW_AT_sibling     : <0xa99b5>
 <2><a99aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a99ab>   DW_AT_type        : <0xa9079>
 <2><a99af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a99b0>   DW_AT_type        : <0xa9072>
 <2><a99b4>: Abbrev Number: 0
 <1><a99b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a99b6>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <a99ba>   DW_AT_decl_file   : 11
    <a99bb>   DW_AT_decl_line   : 80
    <a99bc>   DW_AT_decl_column : 23
    <a99bd>   DW_AT_type        : <0xa9724>
 <1><a99c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <a99c2>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <a99c6>   DW_AT_decl_file   : 11
    <a99c7>   DW_AT_decl_line   : 83
    <a99c8>   DW_AT_decl_column : 23
    <a99c9>   DW_AT_type        : <0xa98f9>
 <1><a99cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <a99ce>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <a99d2>   DW_AT_decl_file   : 11
    <a99d3>   DW_AT_decl_line   : 86
    <a99d4>   DW_AT_decl_column : 23
    <a99d5>   DW_AT_type        : <0xa9782>
 <1><a99d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <a99da>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <a99de>   DW_AT_decl_file   : 11
    <a99df>   DW_AT_decl_line   : 89
    <a99e0>   DW_AT_decl_column : 23
    <a99e1>   DW_AT_type        : <0xa9782>
 <1><a99e5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a99e6>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <a99ea>   DW_AT_decl_file   : 11
    <a99eb>   DW_AT_decl_line   : 91
    <a99ec>   DW_AT_decl_column : 23
    <a99ed>   DW_AT_type        : <0xa99f1>
 <1><a99f1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a99f2>   DW_AT_byte_size   : 8
    <a99f2>   DW_AT_type        : <0xa99f6>
 <1><a99f6>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <a99f7>   DW_AT_prototyped  : 1
    <a99f7>   DW_AT_sibling     : <0xa9a01>
 <2><a99fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a99fc>   DW_AT_type        : <0xa9a01>
 <2><a9a00>: Abbrev Number: 0
 <1><a9a01>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9a02>   DW_AT_byte_size   : 8
    <a9a02>   DW_AT_type        : <0xa96d4>
 <1><a9a06>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a9a07>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <a9a0b>   DW_AT_byte_size   : 224
    <a9a0c>   DW_AT_decl_file   : 11
    <a9a0d>   DW_AT_decl_line   : 93
    <a9a0e>   DW_AT_decl_column : 16
    <a9a0f>   DW_AT_sibling     : <0xa9b80>
 <2><a9a13>: Abbrev Number: 2 (DW_TAG_member)
    <a9a14>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <a9a18>   DW_AT_decl_file   : 11
    <a9a19>   DW_AT_decl_line   : 94
    <a9a1a>   DW_AT_decl_column : 23
    <a9a1b>   DW_AT_type        : <0xa96e0>
    <a9a1f>   DW_AT_data_member_location: 0
 <2><a9a20>: Abbrev Number: 2 (DW_TAG_member)
    <a9a21>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <a9a25>   DW_AT_decl_file   : 11
    <a9a26>   DW_AT_decl_line   : 95
    <a9a27>   DW_AT_decl_column : 23
    <a9a28>   DW_AT_type        : <0xa96f6>
    <a9a2c>   DW_AT_data_member_location: 8
 <2><a9a2d>: Abbrev Number: 2 (DW_TAG_member)
    <a9a2e>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <a9a32>   DW_AT_decl_file   : 11
    <a9a33>   DW_AT_decl_line   : 96
    <a9a34>   DW_AT_decl_column : 23
    <a9a35>   DW_AT_type        : <0xa970c>
    <a9a39>   DW_AT_data_member_location: 16
 <2><a9a3a>: Abbrev Number: 2 (DW_TAG_member)
    <a9a3b>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <a9a3f>   DW_AT_decl_file   : 11
    <a9a40>   DW_AT_decl_line   : 97
    <a9a41>   DW_AT_decl_column : 23
    <a9a42>   DW_AT_type        : <0xa9718>
    <a9a46>   DW_AT_data_member_location: 24
 <2><a9a47>: Abbrev Number: 2 (DW_TAG_member)
    <a9a48>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <a9a4c>   DW_AT_decl_file   : 11
    <a9a4d>   DW_AT_decl_line   : 98
    <a9a4e>   DW_AT_decl_column : 23
    <a9a4f>   DW_AT_type        : <0xa9734>
    <a9a53>   DW_AT_data_member_location: 32
 <2><a9a54>: Abbrev Number: 2 (DW_TAG_member)
    <a9a55>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <a9a59>   DW_AT_decl_file   : 11
    <a9a5a>   DW_AT_decl_line   : 99
    <a9a5b>   DW_AT_decl_column : 23
    <a9a5c>   DW_AT_type        : <0xa975e>
    <a9a60>   DW_AT_data_member_location: 40
 <2><a9a61>: Abbrev Number: 2 (DW_TAG_member)
    <a9a62>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <a9a66>   DW_AT_decl_file   : 11
    <a9a67>   DW_AT_decl_line   : 100
    <a9a68>   DW_AT_decl_column : 23
    <a9a69>   DW_AT_type        : <0xa9776>
    <a9a6d>   DW_AT_data_member_location: 48
 <2><a9a6e>: Abbrev Number: 2 (DW_TAG_member)
    <a9a6f>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <a9a73>   DW_AT_decl_file   : 11
    <a9a74>   DW_AT_decl_line   : 101
    <a9a75>   DW_AT_decl_column : 23
    <a9a76>   DW_AT_type        : <0xa979b>
    <a9a7a>   DW_AT_data_member_location: 56
 <2><a9a7b>: Abbrev Number: 2 (DW_TAG_member)
    <a9a7c>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <a9a80>   DW_AT_decl_file   : 11
    <a9a81>   DW_AT_decl_line   : 102
    <a9a82>   DW_AT_decl_column : 23
    <a9a83>   DW_AT_type        : <0xa97a7>
    <a9a87>   DW_AT_data_member_location: 64
 <2><a9a88>: Abbrev Number: 2 (DW_TAG_member)
    <a9a89>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <a9a8d>   DW_AT_decl_file   : 11
    <a9a8e>   DW_AT_decl_line   : 103
    <a9a8f>   DW_AT_decl_column : 23
    <a9a90>   DW_AT_type        : <0xa97b3>
    <a9a94>   DW_AT_data_member_location: 72
 <2><a9a95>: Abbrev Number: 2 (DW_TAG_member)
    <a9a96>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <a9a9a>   DW_AT_decl_file   : 11
    <a9a9b>   DW_AT_decl_line   : 104
    <a9a9c>   DW_AT_decl_column : 23
    <a9a9d>   DW_AT_type        : <0xa97d9>
    <a9aa1>   DW_AT_data_member_location: 80
 <2><a9aa2>: Abbrev Number: 2 (DW_TAG_member)
    <a9aa3>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <a9aa7>   DW_AT_decl_file   : 11
    <a9aa8>   DW_AT_decl_line   : 105
    <a9aa9>   DW_AT_decl_column : 24
    <a9aaa>   DW_AT_type        : <0xa980f>
    <a9aae>   DW_AT_data_member_location: 88
 <2><a9aaf>: Abbrev Number: 2 (DW_TAG_member)
    <a9ab0>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <a9ab4>   DW_AT_decl_file   : 11
    <a9ab5>   DW_AT_decl_line   : 106
    <a9ab6>   DW_AT_decl_column : 25
    <a9ab7>   DW_AT_type        : <0xa9835>
    <a9abb>   DW_AT_data_member_location: 96
 <2><a9abc>: Abbrev Number: 2 (DW_TAG_member)
    <a9abd>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <a9ac1>   DW_AT_decl_file   : 11
    <a9ac2>   DW_AT_decl_line   : 107
    <a9ac3>   DW_AT_decl_column : 23
    <a9ac4>   DW_AT_type        : <0xa985b>
    <a9ac8>   DW_AT_data_member_location: 104
 <2><a9ac9>: Abbrev Number: 2 (DW_TAG_member)
    <a9aca>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <a9ace>   DW_AT_decl_file   : 11
    <a9acf>   DW_AT_decl_line   : 108
    <a9ad0>   DW_AT_decl_column : 23
    <a9ad1>   DW_AT_type        : <0xa98ed>
    <a9ad5>   DW_AT_data_member_location: 112
 <2><a9ad6>: Abbrev Number: 2 (DW_TAG_member)
    <a9ad7>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <a9adb>   DW_AT_decl_file   : 11
    <a9adc>   DW_AT_decl_line   : 109
    <a9add>   DW_AT_decl_column : 23
    <a9ade>   DW_AT_type        : <0xa990d>
    <a9ae2>   DW_AT_data_member_location: 120
 <2><a9ae3>: Abbrev Number: 2 (DW_TAG_member)
    <a9ae4>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <a9ae8>   DW_AT_decl_file   : 11
    <a9ae9>   DW_AT_decl_line   : 110
    <a9aea>   DW_AT_decl_column : 23
    <a9aeb>   DW_AT_type        : <0xa9941>
    <a9aef>   DW_AT_data_member_location: 128
 <2><a9af0>: Abbrev Number: 2 (DW_TAG_member)
    <a9af1>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <a9af5>   DW_AT_decl_file   : 11
    <a9af6>   DW_AT_decl_line   : 111
    <a9af7>   DW_AT_decl_column : 23
    <a9af8>   DW_AT_type        : <0xa9970>
    <a9afc>   DW_AT_data_member_location: 136
 <2><a9afd>: Abbrev Number: 2 (DW_TAG_member)
    <a9afe>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <a9b02>   DW_AT_decl_file   : 11
    <a9b03>   DW_AT_decl_line   : 112
    <a9b04>   DW_AT_decl_column : 23
    <a9b05>   DW_AT_type        : <0xa9990>
    <a9b09>   DW_AT_data_member_location: 144
 <2><a9b0a>: Abbrev Number: 2 (DW_TAG_member)
    <a9b0b>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <a9b0f>   DW_AT_decl_file   : 11
    <a9b10>   DW_AT_decl_line   : 113
    <a9b11>   DW_AT_decl_column : 25
    <a9b12>   DW_AT_type        : <0xa976a>
    <a9b16>   DW_AT_data_member_location: 152
 <2><a9b17>: Abbrev Number: 2 (DW_TAG_member)
    <a9b18>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <a9b1c>   DW_AT_decl_file   : 11
    <a9b1d>   DW_AT_decl_line   : 114
    <a9b1e>   DW_AT_decl_column : 24
    <a9b1f>   DW_AT_type        : <0xa9880>
    <a9b23>   DW_AT_data_member_location: 160
 <2><a9b24>: Abbrev Number: 2 (DW_TAG_member)
    <a9b25>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <a9b29>   DW_AT_decl_file   : 11
    <a9b2a>   DW_AT_decl_line   : 115
    <a9b2b>   DW_AT_decl_column : 25
    <a9b2c>   DW_AT_type        : <0xa98b9>
    <a9b30>   DW_AT_data_member_location: 168
 <2><a9b31>: Abbrev Number: 2 (DW_TAG_member)
    <a9b32>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <a9b36>   DW_AT_decl_file   : 11
    <a9b37>   DW_AT_decl_line   : 116
    <a9b38>   DW_AT_decl_column : 23
    <a9b39>   DW_AT_type        : <0xa97e5>
    <a9b3d>   DW_AT_data_member_location: 176
 <2><a9b3e>: Abbrev Number: 2 (DW_TAG_member)
    <a9b3f>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <a9b43>   DW_AT_decl_file   : 11
    <a9b44>   DW_AT_decl_line   : 117
    <a9b45>   DW_AT_decl_column : 23
    <a9b46>   DW_AT_type        : <0xa99b5>
    <a9b4a>   DW_AT_data_member_location: 184
 <2><a9b4b>: Abbrev Number: 2 (DW_TAG_member)
    <a9b4c>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <a9b50>   DW_AT_decl_file   : 11
    <a9b51>   DW_AT_decl_line   : 118
    <a9b52>   DW_AT_decl_column : 22
    <a9b53>   DW_AT_type        : <0xa99c1>
    <a9b57>   DW_AT_data_member_location: 192
 <2><a9b58>: Abbrev Number: 2 (DW_TAG_member)
    <a9b59>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <a9b5d>   DW_AT_decl_file   : 11
    <a9b5e>   DW_AT_decl_line   : 119
    <a9b5f>   DW_AT_decl_column : 23
    <a9b60>   DW_AT_type        : <0xa99cd>
    <a9b64>   DW_AT_data_member_location: 200
 <2><a9b65>: Abbrev Number: 2 (DW_TAG_member)
    <a9b66>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <a9b6a>   DW_AT_decl_file   : 11
    <a9b6b>   DW_AT_decl_line   : 120
    <a9b6c>   DW_AT_decl_column : 22
    <a9b6d>   DW_AT_type        : <0xa99d9>
    <a9b71>   DW_AT_data_member_location: 208
 <2><a9b72>: Abbrev Number: 2 (DW_TAG_member)
    <a9b73>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <a9b77>   DW_AT_decl_file   : 11
    <a9b78>   DW_AT_decl_line   : 121
    <a9b79>   DW_AT_decl_column : 23
    <a9b7a>   DW_AT_type        : <0xa99e5>
    <a9b7e>   DW_AT_data_member_location: 216
 <2><a9b7f>: Abbrev Number: 0
 <1><a9b80>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9b81>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <a9b85>   DW_AT_decl_file   : 11
    <a9b86>   DW_AT_decl_line   : 122
    <a9b87>   DW_AT_decl_column : 3
    <a9b88>   DW_AT_type        : <0xa9a06>
 <1><a9b8c>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a9b8d>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <a9b91>   DW_AT_byte_size   : 20848
    <a9b93>   DW_AT_decl_file   : 12
    <a9b94>   DW_AT_decl_line   : 349
    <a9b96>   DW_AT_decl_column : 16
    <a9b97>   DW_AT_sibling     : <0xa9c0c>
 <2><a9b9b>: Abbrev Number: 13 (DW_TAG_member)
    <a9b9c>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <a9ba0>   DW_AT_decl_file   : 12
    <a9ba0>   DW_AT_decl_line   : 350
    <a9ba2>   DW_AT_decl_column : 18
    <a9ba2>   DW_AT_type        : <0xa909c>
    <a9ba6>   DW_AT_data_member_location: 0
 <2><a9ba7>: Abbrev Number: 13 (DW_TAG_member)
    <a9ba8>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <a9bac>   DW_AT_decl_file   : 12
    <a9bac>   DW_AT_decl_line   : 351
    <a9bae>   DW_AT_decl_column : 18
    <a9bae>   DW_AT_type        : <0xa912a>
    <a9bb2>   DW_AT_data_member_location: 8
 <2><a9bb3>: Abbrev Number: 13 (DW_TAG_member)
    <a9bb4>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <a9bb8>   DW_AT_decl_file   : 12
    <a9bb8>   DW_AT_decl_line   : 352
    <a9bba>   DW_AT_decl_column : 18
    <a9bba>   DW_AT_type        : <0xa91f8>
    <a9bbe>   DW_AT_data_member_location: 16
 <2><a9bbf>: Abbrev Number: 13 (DW_TAG_member)
    <a9bc0>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <a9bc4>   DW_AT_decl_file   : 12
    <a9bc4>   DW_AT_decl_line   : 353
    <a9bc6>   DW_AT_decl_column : 18
    <a9bc6>   DW_AT_type        : <0xa90c4>
    <a9bca>   DW_AT_data_member_location: 40
 <2><a9bcb>: Abbrev Number: 13 (DW_TAG_member)
    <a9bcc>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <a9bd0>   DW_AT_decl_file   : 12
    <a9bd0>   DW_AT_decl_line   : 354
    <a9bd2>   DW_AT_decl_column : 18
    <a9bd2>   DW_AT_type        : <0xa9b80>
    <a9bd6>   DW_AT_data_member_location: 48
 <2><a9bd7>: Abbrev Number: 15 (DW_TAG_member)
    <a9bd8>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <a9bdc>   DW_AT_decl_file   : 12
    <a9bdc>   DW_AT_decl_line   : 355
    <a9bde>   DW_AT_decl_column : 18
    <a9bde>   DW_AT_type        : <0xa9c0c>
    <a9be2>   DW_AT_data_member_location: 272
 <2><a9be4>: Abbrev Number: 15 (DW_TAG_member)
    <a9be5>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <a9be9>   DW_AT_decl_file   : 12
    <a9be9>   DW_AT_decl_line   : 356
    <a9beb>   DW_AT_decl_column : 18
    <a9beb>   DW_AT_type        : <0xa909c>
    <a9bef>   DW_AT_data_member_location: 20832
 <2><a9bf1>: Abbrev Number: 15 (DW_TAG_member)
    <a9bf2>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <a9bf6>   DW_AT_decl_file   : 12
    <a9bf6>   DW_AT_decl_line   : 357
    <a9bf8>   DW_AT_decl_column : 18
    <a9bf8>   DW_AT_type        : <0xa909c>
    <a9bfc>   DW_AT_data_member_location: 20836
 <2><a9bfe>: Abbrev Number: 15 (DW_TAG_member)
    <a9bff>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <a9c03>   DW_AT_decl_file   : 12
    <a9c03>   DW_AT_decl_line   : 358
    <a9c05>   DW_AT_decl_column : 18
    <a9c05>   DW_AT_type        : <0xa91bd>
    <a9c09>   DW_AT_data_member_location: 20840
 <2><a9c0b>: Abbrev Number: 0
 <1><a9c0c>: Abbrev Number: 18 (DW_TAG_array_type)
    <a9c0d>   DW_AT_type        : <0xa95d6>
    <a9c11>   DW_AT_sibling     : <0xa9c1d>
 <2><a9c15>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <a9c16>   DW_AT_type        : <0xa9087>
    <a9c1a>   DW_AT_upper_bound : 256
 <2><a9c1c>: Abbrev Number: 0
 <1><a9c1d>: Abbrev Number: 20 (DW_TAG_typedef)
    <a9c1e>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <a9c22>   DW_AT_decl_file   : 12
    <a9c23>   DW_AT_decl_line   : 359
    <a9c25>   DW_AT_decl_column : 3
    <a9c26>   DW_AT_type        : <0xa9b8c>
 <1><a9c2a>: Abbrev Number: 41 (DW_TAG_variable)
    <a9c2b>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <a9c2f>   DW_AT_decl_file   : 12
    <a9c30>   DW_AT_decl_line   : 361
    <a9c32>   DW_AT_decl_column : 21
    <a9c33>   DW_AT_type        : <0xa9c1d>
    <a9c37>   DW_AT_external    : 1
    <a9c37>   DW_AT_declaration : 1
 <1><a9c37>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9c38>   DW_AT_external    : 1
    <a9c38>   DW_AT_name        : (indirect string, offset: 0x1b1d3): fb_DevFileRead
    <a9c3c>   DW_AT_decl_file   : 9
    <a9c3d>   DW_AT_decl_line   : 14
    <a9c3e>   DW_AT_decl_column : 21
    <a9c3f>   DW_AT_prototyped  : 1
    <a9c3f>   DW_AT_type        : <0xa909c>
    <a9c43>   DW_AT_declaration : 1
    <a9c43>   DW_AT_sibling     : <0xa9c57>
 <2><a9c47>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c48>   DW_AT_type        : <0xa95e2>
 <2><a9c4c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c4d>   DW_AT_type        : <0xa90b6>
 <2><a9c51>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c52>   DW_AT_type        : <0xa93e3>
 <2><a9c56>: Abbrev Number: 0
 <1><a9c57>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9c58>   DW_AT_external    : 1
    <a9c58>   DW_AT_name        : (indirect string, offset: 0x1aebd): fb_IsRedirected
    <a9c5c>   DW_AT_decl_file   : 11
    <a9c5d>   DW_AT_decl_line   : 82
    <a9c5e>   DW_AT_decl_column : 15
    <a9c5f>   DW_AT_prototyped  : 1
    <a9c5f>   DW_AT_type        : <0xa909c>
    <a9c63>   DW_AT_declaration : 1
    <a9c63>   DW_AT_sibling     : <0xa9c6d>
 <2><a9c67>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c68>   DW_AT_type        : <0xa909c>
 <2><a9c6c>: Abbrev Number: 0
 <1><a9c6d>: Abbrev Number: 42 (DW_TAG_subprogram)
    <a9c6e>   DW_AT_external    : 1
    <a9c6e>   DW_AT_name        : (indirect string, offset: 0x1b167): fb_DevScrnInit_NoOpen
    <a9c72>   DW_AT_decl_file   : 9
    <a9c73>   DW_AT_decl_line   : 55
    <a9c74>   DW_AT_decl_column : 21
    <a9c75>   DW_AT_prototyped  : 1
    <a9c75>   DW_AT_declaration : 1
 <1><a9c75>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9c76>   DW_AT_external    : 1
    <a9c76>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <a9c7a>   DW_AT_decl_file   : 8
    <a9c7b>   DW_AT_decl_line   : 50
    <a9c7c>   DW_AT_decl_column : 22
    <a9c7d>   DW_AT_prototyped  : 1
    <a9c7d>   DW_AT_type        : <0xa909c>
    <a9c81>   DW_AT_declaration : 1
    <a9c81>   DW_AT_sibling     : <0xa9c8b>
 <2><a9c85>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c86>   DW_AT_type        : <0xa909c>
 <2><a9c8a>: Abbrev Number: 0
 <1><a9c8b>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9c8c>   DW_AT_external    : 1
    <a9c8c>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <a9c90>   DW_AT_decl_file   : 13
    <a9c91>   DW_AT_decl_line   : 61
    <a9c92>   DW_AT_decl_column : 14
    <a9c93>   DW_AT_prototyped  : 1
    <a9c93>   DW_AT_type        : <0xa90b6>
    <a9c97>   DW_AT_declaration : 1
    <a9c97>   DW_AT_sibling     : <0xa9cab>
 <2><a9c9b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9c9c>   DW_AT_type        : <0xa90b6>
 <2><a9ca0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9ca1>   DW_AT_type        : <0xa909c>
 <2><a9ca5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9ca6>   DW_AT_type        : <0xa90d0>
 <2><a9caa>: Abbrev Number: 0
 <1><a9cab>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9cac>   DW_AT_external    : 1
    <a9cac>   DW_AT_name        : (indirect string, offset: 0x19e10): memmove
    <a9cb0>   DW_AT_decl_file   : 13
    <a9cb1>   DW_AT_decl_line   : 47
    <a9cb2>   DW_AT_decl_column : 14
    <a9cb3>   DW_AT_prototyped  : 1
    <a9cb3>   DW_AT_type        : <0xa90b6>
    <a9cb7>   DW_AT_declaration : 1
    <a9cb7>   DW_AT_sibling     : <0xa9ccb>
 <2><a9cbb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9cbc>   DW_AT_type        : <0xa90b6>
 <2><a9cc0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9cc1>   DW_AT_type        : <0xa9124>
 <2><a9cc5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9cc6>   DW_AT_type        : <0xa90d0>
 <2><a9cca>: Abbrev Number: 0
 <1><a9ccb>: Abbrev Number: 10 (DW_TAG_subprogram)
    <a9ccc>   DW_AT_external    : 1
    <a9ccc>   DW_AT_name        : (indirect string, offset: 0x1a955): memcpy
    <a9cd0>   DW_AT_decl_file   : 13
    <a9cd1>   DW_AT_decl_line   : 43
    <a9cd2>   DW_AT_decl_column : 14
    <a9cd3>   DW_AT_prototyped  : 1
    <a9cd3>   DW_AT_type        : <0xa90b6>
    <a9cd7>   DW_AT_declaration : 1
    <a9cd7>   DW_AT_sibling     : <0xa9ceb>
 <2><a9cdb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9cdc>   DW_AT_type        : <0xa90b6>
 <2><a9ce0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9ce1>   DW_AT_type        : <0xa9124>
 <2><a9ce5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9ce6>   DW_AT_type        : <0xa90d0>
 <2><a9cea>: Abbrev Number: 0
 <1><a9ceb>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a9cec>   DW_AT_external    : 1
    <a9cec>   DW_AT_name        : (indirect string, offset: 0x1b22d): fb_DevScrnFillInput
    <a9cf0>   DW_AT_decl_file   : 9
    <a9cf1>   DW_AT_decl_line   : 72
    <a9cf2>   DW_AT_decl_column : 21
    <a9cf2>   DW_AT_prototyped  : 1
    <a9cf2>   DW_AT_declaration : 1
    <a9cf2>   DW_AT_sibling     : <0xa9cfc>
 <2><a9cf6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9cf7>   DW_AT_type        : <0xa9cfc>
 <2><a9cfb>: Abbrev Number: 0
 <1><a9cfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a9cfd>   DW_AT_byte_size   : 8
    <a9cfd>   DW_AT_type        : <0xa961b>
 <1><a9d01>: Abbrev Number: 43 (DW_TAG_subprogram)
    <a9d02>   DW_AT_external    : 1
    <a9d02>   DW_AT_name        : (indirect string, offset: 0x1b08d): fb_KeyHit
    <a9d06>   DW_AT_decl_file   : 11
    <a9d07>   DW_AT_decl_line   : 8
    <a9d08>   DW_AT_decl_column : 21
    <a9d09>   DW_AT_prototyped  : 1
    <a9d09>   DW_AT_type        : <0xa909c>
    <a9d0d>   DW_AT_declaration : 1
 <1><a9d0d>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a9d0e>   DW_AT_external    : 1
    <a9d0e>   DW_AT_name        : (indirect string, offset: 0x1849e): fb_Delay
    <a9d12>   DW_AT_decl_file   : 11
    <a9d13>   DW_AT_decl_line   : 78
    <a9d14>   DW_AT_decl_column : 21
    <a9d14>   DW_AT_prototyped  : 1
    <a9d14>   DW_AT_declaration : 1
    <a9d14>   DW_AT_sibling     : <0xa9d1e>
 <2><a9d18>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a9d19>   DW_AT_type        : <0xa909c>
