 <1><e76b2>: Abbrev Number: 2 (DW_TAG_base_type)
    <e76b3>   DW_AT_byte_size   : 8
    <e76b4>   DW_AT_encoding    : 5	(signed)
    <e76b5>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e76b9>: Abbrev Number: 5 (DW_TAG_typedef)
    <e76ba>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e76be>   DW_AT_decl_file   : 4
    <e76bf>   DW_AT_decl_line   : 87
    <e76c0>   DW_AT_decl_column : 19
    <e76c1>   DW_AT_type        : <0xe768c>
 <1><e76c5>: Abbrev Number: 2 (DW_TAG_base_type)
    <e76c6>   DW_AT_byte_size   : 8
    <e76c7>   DW_AT_encoding    : 7	(unsigned)
    <e76c8>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e76cc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <e76cd>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <e76d1>   DW_AT_byte_size   : 216
    <e76d2>   DW_AT_decl_file   : 5
    <e76d3>   DW_AT_decl_line   : 49
    <e76d4>   DW_AT_decl_column : 8
    <e76d5>   DW_AT_sibling     : <0xe7836>
 <2><e76d9>: Abbrev Number: 1 (DW_TAG_member)
    <e76da>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <e76de>   DW_AT_decl_file   : 5
    <e76de>   DW_AT_decl_line   : 51
    <e76df>   DW_AT_decl_column : 7
    <e76e0>   DW_AT_type        : <0xe7672>
    <e76e4>   DW_AT_data_member_location: 0
 <2><e76e5>: Abbrev Number: 1 (DW_TAG_member)
    <e76e6>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <e76ea>   DW_AT_decl_file   : 5
    <e76ea>   DW_AT_decl_line   : 54
    <e76eb>   DW_AT_decl_column : 9
    <e76ec>   DW_AT_type        : <0xe769a>
    <e76f0>   DW_AT_data_member_location: 8
 <2><e76f1>: Abbrev Number: 1 (DW_TAG_member)
    <e76f2>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <e76f6>   DW_AT_decl_file   : 5
    <e76f6>   DW_AT_decl_line   : 55
    <e76f7>   DW_AT_decl_column : 9
    <e76f8>   DW_AT_type        : <0xe769a>
    <e76fc>   DW_AT_data_member_location: 16
 <2><e76fd>: Abbrev Number: 1 (DW_TAG_member)
    <e76fe>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <e7702>   DW_AT_decl_file   : 5
    <e7702>   DW_AT_decl_line   : 56
    <e7703>   DW_AT_decl_column : 9
    <e7704>   DW_AT_type        : <0xe769a>
    <e7708>   DW_AT_data_member_location: 24
 <2><e7709>: Abbrev Number: 1 (DW_TAG_member)
    <e770a>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <e770e>   DW_AT_decl_file   : 5
    <e770e>   DW_AT_decl_line   : 57
    <e770f>   DW_AT_decl_column : 9
    <e7710>   DW_AT_type        : <0xe769a>
    <e7714>   DW_AT_data_member_location: 32
 <2><e7715>: Abbrev Number: 1 (DW_TAG_member)
    <e7716>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <e771a>   DW_AT_decl_file   : 5
    <e771a>   DW_AT_decl_line   : 58
    <e771b>   DW_AT_decl_column : 9
    <e771c>   DW_AT_type        : <0xe769a>
    <e7720>   DW_AT_data_member_location: 40
 <2><e7721>: Abbrev Number: 1 (DW_TAG_member)
    <e7722>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <e7726>   DW_AT_decl_file   : 5
    <e7726>   DW_AT_decl_line   : 59
    <e7727>   DW_AT_decl_column : 9
    <e7728>   DW_AT_type        : <0xe769a>
    <e772c>   DW_AT_data_member_location: 48
 <2><e772d>: Abbrev Number: 1 (DW_TAG_member)
    <e772e>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <e7732>   DW_AT_decl_file   : 5
    <e7732>   DW_AT_decl_line   : 60
    <e7733>   DW_AT_decl_column : 9
    <e7734>   DW_AT_type        : <0xe769a>
    <e7738>   DW_AT_data_member_location: 56
 <2><e7739>: Abbrev Number: 1 (DW_TAG_member)
    <e773a>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <e773e>   DW_AT_decl_file   : 5
    <e773e>   DW_AT_decl_line   : 61
    <e773f>   DW_AT_decl_column : 9
    <e7740>   DW_AT_type        : <0xe769a>
    <e7744>   DW_AT_data_member_location: 64
 <2><e7745>: Abbrev Number: 1 (DW_TAG_member)
    <e7746>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <e774a>   DW_AT_decl_file   : 5
    <e774a>   DW_AT_decl_line   : 64
    <e774b>   DW_AT_decl_column : 9
    <e774c>   DW_AT_type        : <0xe769a>
    <e7750>   DW_AT_data_member_location: 72
 <2><e7751>: Abbrev Number: 1 (DW_TAG_member)
    <e7752>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <e7756>   DW_AT_decl_file   : 5
    <e7756>   DW_AT_decl_line   : 65
    <e7757>   DW_AT_decl_column : 9
    <e7758>   DW_AT_type        : <0xe769a>
    <e775c>   DW_AT_data_member_location: 80
 <2><e775d>: Abbrev Number: 1 (DW_TAG_member)
    <e775e>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <e7762>   DW_AT_decl_file   : 5
    <e7762>   DW_AT_decl_line   : 66
    <e7763>   DW_AT_decl_column : 9
    <e7764>   DW_AT_type        : <0xe769a>
    <e7768>   DW_AT_data_member_location: 88
 <2><e7769>: Abbrev Number: 1 (DW_TAG_member)
    <e776a>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <e776e>   DW_AT_decl_file   : 5
    <e776e>   DW_AT_decl_line   : 68
    <e776f>   DW_AT_decl_column : 22
    <e7770>   DW_AT_type        : <0xe784f>
    <e7774>   DW_AT_data_member_location: 96
 <2><e7775>: Abbrev Number: 1 (DW_TAG_member)
    <e7776>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <e777a>   DW_AT_decl_file   : 5
    <e777a>   DW_AT_decl_line   : 70
    <e777b>   DW_AT_decl_column : 20
    <e777c>   DW_AT_type        : <0xe7854>
    <e7780>   DW_AT_data_member_location: 104
 <2><e7781>: Abbrev Number: 1 (DW_TAG_member)
    <e7782>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <e7786>   DW_AT_decl_file   : 5
    <e7786>   DW_AT_decl_line   : 72
    <e7787>   DW_AT_decl_column : 7
    <e7788>   DW_AT_type        : <0xe7672>
    <e778c>   DW_AT_data_member_location: 112
 <2><e778d>: Abbrev Number: 1 (DW_TAG_member)
    <e778e>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <e7792>   DW_AT_decl_file   : 5
    <e7792>   DW_AT_decl_line   : 73
    <e7793>   DW_AT_decl_column : 7
    <e7794>   DW_AT_type        : <0xe7672>
    <e7798>   DW_AT_data_member_location: 116
 <2><e7799>: Abbrev Number: 1 (DW_TAG_member)
    <e779a>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <e779e>   DW_AT_decl_file   : 5
    <e779e>   DW_AT_decl_line   : 74
    <e779f>   DW_AT_decl_column : 11
    <e77a0>   DW_AT_type        : <0xe7680>
    <e77a4>   DW_AT_data_member_location: 120
 <2><e77a5>: Abbrev Number: 1 (DW_TAG_member)
    <e77a6>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <e77aa>   DW_AT_decl_file   : 5
    <e77aa>   DW_AT_decl_line   : 77
    <e77ab>   DW_AT_decl_column : 18
    <e77ac>   DW_AT_type        : <0xe764f>
    <e77b0>   DW_AT_data_member_location: 128
 <2><e77b1>: Abbrev Number: 1 (DW_TAG_member)
    <e77b2>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <e77b6>   DW_AT_decl_file   : 5
    <e77b6>   DW_AT_decl_line   : 78
    <e77b7>   DW_AT_decl_column : 15
    <e77b8>   DW_AT_type        : <0xe7664>
    <e77bc>   DW_AT_data_member_location: 130
 <2><e77bd>: Abbrev Number: 1 (DW_TAG_member)
    <e77be>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <e77c2>   DW_AT_decl_file   : 5
    <e77c2>   DW_AT_decl_line   : 79
    <e77c3>   DW_AT_decl_column : 8
    <e77c4>   DW_AT_type        : <0xe7859>
    <e77c8>   DW_AT_data_member_location: 131
 <2><e77c9>: Abbrev Number: 1 (DW_TAG_member)
    <e77ca>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <e77ce>   DW_AT_decl_file   : 5
    <e77ce>   DW_AT_decl_line   : 81
    <e77cf>   DW_AT_decl_column : 15
    <e77d0>   DW_AT_type        : <0xe7869>
    <e77d4>   DW_AT_data_member_location: 136
 <2><e77d5>: Abbrev Number: 1 (DW_TAG_member)
    <e77d6>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <e77da>   DW_AT_decl_file   : 5
    <e77da>   DW_AT_decl_line   : 89
    <e77db>   DW_AT_decl_column : 13
    <e77dc>   DW_AT_type        : <0xe768c>
    <e77e0>   DW_AT_data_member_location: 144
 <2><e77e1>: Abbrev Number: 1 (DW_TAG_member)
    <e77e2>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <e77e6>   DW_AT_decl_file   : 5
    <e77e6>   DW_AT_decl_line   : 91
    <e77e7>   DW_AT_decl_column : 23
    <e77e8>   DW_AT_type        : <0xe7873>
    <e77ec>   DW_AT_data_member_location: 152
 <2><e77ed>: Abbrev Number: 1 (DW_TAG_member)
    <e77ee>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <e77f2>   DW_AT_decl_file   : 5
    <e77f2>   DW_AT_decl_line   : 92
    <e77f3>   DW_AT_decl_column : 25
    <e77f4>   DW_AT_type        : <0xe787d>
    <e77f8>   DW_AT_data_member_location: 160
 <2><e77f9>: Abbrev Number: 1 (DW_TAG_member)
    <e77fa>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <e77fe>   DW_AT_decl_file   : 5
    <e77fe>   DW_AT_decl_line   : 93
    <e77ff>   DW_AT_decl_column : 20
    <e7800>   DW_AT_type        : <0xe7854>
    <e7804>   DW_AT_data_member_location: 168
 <2><e7805>: Abbrev Number: 1 (DW_TAG_member)
    <e7806>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <e780a>   DW_AT_decl_file   : 5
    <e780a>   DW_AT_decl_line   : 94
    <e780b>   DW_AT_decl_column : 9
    <e780c>   DW_AT_type        : <0xe7698>
    <e7810>   DW_AT_data_member_location: 176
 <2><e7811>: Abbrev Number: 1 (DW_TAG_member)
    <e7812>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <e7816>   DW_AT_decl_file   : 5
    <e7816>   DW_AT_decl_line   : 95
    <e7817>   DW_AT_decl_column : 10
    <e7818>   DW_AT_type        : <0xe76a6>
    <e781c>   DW_AT_data_member_location: 184
 <2><e781d>: Abbrev Number: 1 (DW_TAG_member)
    <e781e>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <e7822>   DW_AT_decl_file   : 5
    <e7822>   DW_AT_decl_line   : 96
    <e7823>   DW_AT_decl_column : 7
    <e7824>   DW_AT_type        : <0xe7672>
    <e7828>   DW_AT_data_member_location: 192
 <2><e7829>: Abbrev Number: 1 (DW_TAG_member)
    <e782a>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <e782e>   DW_AT_decl_file   : 5
    <e782e>   DW_AT_decl_line   : 98
    <e782f>   DW_AT_decl_column : 8
    <e7830>   DW_AT_type        : <0xe7882>
    <e7834>   DW_AT_data_member_location: 196
 <2><e7835>: Abbrev Number: 0
 <1><e7836>: Abbrev Number: 5 (DW_TAG_typedef)
    <e7837>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <e783b>   DW_AT_decl_file   : 6
    <e783c>   DW_AT_decl_line   : 7
    <e783d>   DW_AT_decl_column : 25
    <e783e>   DW_AT_type        : <0xe76cc>
 <1><e7842>: Abbrev Number: 22 (DW_TAG_typedef)
    <e7843>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <e7847>   DW_AT_decl_file   : 5
    <e7848>   DW_AT_decl_line   : 43
    <e7849>   DW_AT_decl_column : 14
 <1><e784a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e784b>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <e784f>   DW_AT_declaration : 1
 <1><e784f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7850>   DW_AT_byte_size   : 8
    <e7850>   DW_AT_type        : <0xe784a>
 <1><e7854>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7855>   DW_AT_byte_size   : 8
    <e7855>   DW_AT_type        : <0xe76cc>
 <1><e7859>: Abbrev Number: 12 (DW_TAG_array_type)
    <e785a>   DW_AT_type        : <0xe769f>
    <e785e>   DW_AT_sibling     : <0xe7869>
 <2><e7862>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <e7863>   DW_AT_type        : <0xe765d>
    <e7867>   DW_AT_upper_bound : 0
 <2><e7868>: Abbrev Number: 0
 <1><e7869>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e786a>   DW_AT_byte_size   : 8
    <e786a>   DW_AT_type        : <0xe7842>
 <1><e786e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e786f>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <e7873>   DW_AT_declaration : 1
 <1><e7873>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7874>   DW_AT_byte_size   : 8
    <e7874>   DW_AT_type        : <0xe786e>
 <1><e7878>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e7879>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <e787d>   DW_AT_declaration : 1
 <1><e787d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e787e>   DW_AT_byte_size   : 8
    <e787e>   DW_AT_type        : <0xe7878>
 <1><e7882>: Abbrev Number: 12 (DW_TAG_array_type)
    <e7883>   DW_AT_type        : <0xe769f>
    <e7887>   DW_AT_sibling     : <0xe7892>
 <2><e788b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <e788c>   DW_AT_type        : <0xe765d>
    <e7890>   DW_AT_upper_bound : 19
 <2><e7891>: Abbrev Number: 0
 <1><e7892>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7893>   DW_AT_byte_size   : 8
    <e7893>   DW_AT_type        : <0xe7836>
 <1><e7897>: Abbrev Number: 5 (DW_TAG_typedef)
    <e7898>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <e789c>   DW_AT_decl_file   : 7
    <e789d>   DW_AT_decl_line   : 22
    <e789e>   DW_AT_decl_column : 15
    <e789f>   DW_AT_type        : <0xe76b9>
 <1><e78a3>: Abbrev Number: 2 (DW_TAG_base_type)
    <e78a4>   DW_AT_byte_size   : 8
    <e78a5>   DW_AT_encoding    : 4	(float)
    <e78a6>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><e78aa>: Abbrev Number: 2 (DW_TAG_base_type)
    <e78ab>   DW_AT_byte_size   : 4
    <e78ac>   DW_AT_encoding    : 4	(float)
    <e78ad>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><e78b1>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <e78b2>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <e78b6>   DW_AT_encoding    : 7	(unsigned)
    <e78b7>   DW_AT_byte_size   : 4
    <e78b8>   DW_AT_type        : <0xe7656>
    <e78bc>   DW_AT_decl_file   : 8
    <e78bd>   DW_AT_decl_line   : 25
    <e78be>   DW_AT_decl_column : 14
    <e78bf>   DW_AT_sibling     : <0xe78dc>
 <2><e78c3>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e78c4>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <e78c8>   DW_AT_const_value : 0
 <2><e78c9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e78ca>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <e78ce>   DW_AT_const_value : 1
 <2><e78cf>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e78d0>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <e78d4>   DW_AT_const_value : 2
 <2><e78d5>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e78d6>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <e78da>   DW_AT_const_value : 3
 <2><e78db>: Abbrev Number: 0
 <1><e78dc>: Abbrev Number: 5 (DW_TAG_typedef)
    <e78dd>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <e78e1>   DW_AT_decl_file   : 8
    <e78e2>   DW_AT_decl_line   : 30
    <e78e3>   DW_AT_decl_column : 3
    <e78e4>   DW_AT_type        : <0xe78b1>
 <1><e78e8>: Abbrev Number: 14 (DW_TAG_subprogram)
    <e78e9>   DW_AT_external    : 1
    <e78e9>   DW_AT_name        : (indirect string, offset: 0x1d6a4): ftello
    <e78ed>   DW_AT_decl_file   : 9
    <e78ed>   DW_AT_decl_line   : 723
    <e78ef>   DW_AT_decl_column : 18
    <e78f0>   DW_AT_linkage_name: (indirect string, offset: 0x1d691): ftello64
    <e78f4>   DW_AT_prototyped  : 1
    <e78f4>   DW_AT_type        : <0xe768c>
    <e78f8>   DW_AT_declaration : 1
    <e78f8>   DW_AT_sibling     : <0xe7902>
 <2><e78fc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e78fd>   DW_AT_type        : <0xe7892>
 <2><e7901>: Abbrev Number: 0
 <1><e7902>: Abbrev Number: 14 (DW_TAG_subprogram)
    <e7903>   DW_AT_external    : 1
    <e7903>   DW_AT_name        : (indirect string, offset: 0x1d681): fseeko
    <e7907>   DW_AT_decl_file   : 9
    <e7907>   DW_AT_decl_line   : 720
    <e7909>   DW_AT_decl_column : 12
    <e790a>   DW_AT_linkage_name: (indirect string, offset: 0x1d688): fseeko64
    <e790e>   DW_AT_prototyped  : 1
    <e790e>   DW_AT_type        : <0xe7672>
    <e7912>   DW_AT_declaration : 1
    <e7912>   DW_AT_sibling     : <0xe7926>
 <2><e7916>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e7917>   DW_AT_type        : <0xe7892>
 <2><e791b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e791c>   DW_AT_type        : <0xe768c>
 <2><e7920>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e7921>   DW_AT_type        : <0xe7672>
 <2><e7925>: Abbrev Number: 0
 <1><e7926>: Abbrev Number: 24 (DW_TAG_subprogram)
    <e7927>   DW_AT_external    : 1
    <e7927>   DW_AT_name        : (indirect string, offset: 0x1d4b1): fb_DevFileGetSize
    <e792b>   DW_AT_decl_file   : 1
    <e792c>   DW_AT_decl_line   : 34
    <e792d>   DW_AT_decl_column : 10
    <e792e>   DW_AT_prototyped  : 1
    <e792e>   DW_AT_type        : <0xe7897>
    <e7932>   DW_AT_low_pc      : 0x4797e0
    <e793a>   DW_AT_high_pc     : 0xa3
    <e7942>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e7944>   DW_AT_call_all_calls: 1
    <e7944>   DW_AT_sibling     : <0xe7a61>
 <2><e7948>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e7949>   DW_AT_name        : fp
    <e794c>   DW_AT_decl_file   : 1
    <e794d>   DW_AT_decl_line   : 34
    <e794e>   DW_AT_decl_column : 35
    <e794f>   DW_AT_type        : <0xe7892>
    <e7953>   DW_AT_location    : 0x437d9 (location list)
    <e7957>   DW_AT_GNU_locviews: 0x437c7
 <2><e795b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e795c>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <e7960>   DW_AT_decl_file   : 1
    <e7960>   DW_AT_decl_line   : 34
    <e7960>   DW_AT_decl_column : 43
    <e7961>   DW_AT_type        : <0xe7672>
    <e7965>   DW_AT_location    : 0x43827 (location list)
    <e7969>   DW_AT_GNU_locviews: 0x4381b
 <2><e796d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e796e>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <e7972>   DW_AT_decl_file   : 1
    <e7972>   DW_AT_decl_line   : 34
    <e7972>   DW_AT_decl_column : 63
    <e7973>   DW_AT_type        : <0xe78dc>
    <e7977>   DW_AT_location    : 0x43864 (location list)
    <e797b>   DW_AT_GNU_locviews: 0x43854
 <2><e797f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <e7980>   DW_AT_name        : (indirect string, offset: 0x1d6ab): seek_back
    <e7984>   DW_AT_decl_file   : 1
    <e7984>   DW_AT_decl_line   : 34
    <e7984>   DW_AT_decl_column : 74
    <e7985>   DW_AT_type        : <0xe7672>
    <e7989>   DW_AT_location    : 0x438af (location list)
    <e798d>   DW_AT_GNU_locviews: 0x4389f
 <2><e7991>: Abbrev Number: 26 (DW_TAG_variable)
    <e7992>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e7996>   DW_AT_decl_file   : 1
    <e7997>   DW_AT_decl_line   : 36
    <e7998>   DW_AT_decl_column : 11
    <e7999>   DW_AT_type        : <0xe7897>
    <e799d>   DW_AT_location    : 0x438f6 (location list)
    <e79a1>   DW_AT_GNU_locviews: 0x438ea
 <2><e79a5>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <e79a6>   DW_AT_abstract_origin: <0xe7a61>
    <e79aa>   DW_AT_entry_pc    : 0x47984d
    <e79b2>   DW_AT_GNU_entry_view: 1
    <e79b3>   DW_AT_ranges      : 0x187ad
    <e79b7>   DW_AT_call_file   : 1
    <e79b8>   DW_AT_call_line   : 50
    <e79b9>   DW_AT_call_column : 4
    <e79ba>   DW_AT_sibling     : <0xe7a17>
 <3><e79be>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e79bf>   DW_AT_abstract_origin: <0xe7a91>
    <e79c3>   DW_AT_location    : 0x43924 (location list)
    <e79c7>   DW_AT_GNU_locviews: 0x43922
 <3><e79cb>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e79cc>   DW_AT_abstract_origin: <0xe7a87>
    <e79d0>   DW_AT_location    : 0x43931 (location list)
    <e79d4>   DW_AT_GNU_locviews: 0x4392d
 <3><e79d8>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e79d9>   DW_AT_abstract_origin: <0xe7a7d>
    <e79dd>   DW_AT_location    : 0x43945 (location list)
    <e79e1>   DW_AT_GNU_locviews: 0x43943
 <3><e79e5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e79e6>   DW_AT_abstract_origin: <0xe7a72>
    <e79ea>   DW_AT_location    : 0x43954 (location list)
    <e79ee>   DW_AT_GNU_locviews: 0x43950
 <3><e79f2>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <e79f3>   DW_AT_ranges      : 0x187ad
 <4><e79f7>: Abbrev Number: 15 (DW_TAG_variable)
    <e79f8>   DW_AT_abstract_origin: <0xe7a9b>
 <4><e79fc>: Abbrev Number: 16 (DW_TAG_call_site)
    <e79fd>   DW_AT_call_return_pc: 0x47986c
    <e7a05>   DW_AT_call_origin : <0xe7902>
 <5><e7a09>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a0a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e7a0c>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <5><e7a0f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a10>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e7a12>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><e7a14>: Abbrev Number: 0
 <4><e7a15>: Abbrev Number: 0
 <3><e7a16>: Abbrev Number: 0
 <2><e7a17>: Abbrev Number: 17 (DW_TAG_call_site)
    <e7a18>   DW_AT_call_return_pc: 0x479806
    <e7a20>   DW_AT_call_tail_call: 1
    <e7a20>   DW_AT_call_origin : <0xe78e8>
    <e7a24>   DW_AT_sibling     : <0xe7a30>
 <3><e7a28>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a29>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e7a2b>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><e7a2f>: Abbrev Number: 0
 <2><e7a30>: Abbrev Number: 29 (DW_TAG_call_site)
    <e7a31>   DW_AT_call_return_pc: 0x479839
    <e7a39>   DW_AT_call_origin : <0xe7902>
    <e7a3d>   DW_AT_sibling     : <0xe7a4c>
 <3><e7a41>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a42>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e7a44>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e7a46>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a47>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e7a49>   DW_AT_call_value  : 1 byte block: 32 	(DW_OP_lit2)
 <3><e7a4b>: Abbrev Number: 0
 <2><e7a4c>: Abbrev Number: 16 (DW_TAG_call_site)
    <e7a4d>   DW_AT_call_return_pc: 0x479845
    <e7a55>   DW_AT_call_origin : <0xe78e8>
 <3><e7a59>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7a5a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e7a5c>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><e7a5f>: Abbrev Number: 0
 <2><e7a60>: Abbrev Number: 0
 <1><e7a61>: Abbrev Number: 30 (DW_TAG_subprogram)
    <e7a62>   DW_AT_external    : 1
    <e7a62>   DW_AT_name        : (indirect string, offset: 0x1d59f): fb_hDevFileSeekStart
    <e7a66>   DW_AT_decl_file   : 1
    <e7a67>   DW_AT_decl_line   : 5
    <e7a68>   DW_AT_decl_column : 5
    <e7a69>   DW_AT_prototyped  : 1
    <e7a69>   DW_AT_type        : <0xe7672>
    <e7a6d>   DW_AT_inline      : 1	(inlined)
    <e7a6e>   DW_AT_sibling     : <0xe7aa8>
 <2><e7a72>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <e7a73>   DW_AT_name        : fp
    <e7a76>   DW_AT_decl_file   : 1
    <e7a77>   DW_AT_decl_line   : 5
    <e7a78>   DW_AT_decl_column : 33
    <e7a79>   DW_AT_type        : <0xe7892>
 <2><e7a7d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e7a7e>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <e7a82>   DW_AT_decl_file   : 1
    <e7a82>   DW_AT_decl_line   : 5
    <e7a82>   DW_AT_decl_column : 41
    <e7a83>   DW_AT_type        : <0xe7672>
 <2><e7a87>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e7a88>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <e7a8c>   DW_AT_decl_file   : 1
    <e7a8c>   DW_AT_decl_line   : 5
    <e7a8c>   DW_AT_decl_column : 61
    <e7a8d>   DW_AT_type        : <0xe78dc>
 <2><e7a91>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e7a92>   DW_AT_name        : (indirect string, offset: 0x1d69a): seek_zero
    <e7a96>   DW_AT_decl_file   : 1
    <e7a96>   DW_AT_decl_line   : 5
    <e7a96>   DW_AT_decl_column : 72
    <e7a97>   DW_AT_type        : <0xe7672>
 <2><e7a9b>: Abbrev Number: 32 (DW_TAG_variable)
    <e7a9c>   DW_AT_name        : ofs
    <e7aa0>   DW_AT_decl_file   : 1
    <e7aa1>   DW_AT_decl_line   : 8
    <e7aa2>   DW_AT_decl_column : 9
    <e7aa3>   DW_AT_type        : <0xe76a6>
 <2><e7aa7>: Abbrev Number: 0
 <1><e7aa8>: Abbrev Number: 33 (DW_TAG_subprogram)
    <e7aa9>   DW_AT_abstract_origin: <0xe7a61>
    <e7aad>   DW_AT_low_pc      : 0x4797a0
    <e7ab5>   DW_AT_high_pc     : 0x33
    <e7abd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e7abf>   DW_AT_call_all_calls: 1
 <2><e7abf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e7ac0>   DW_AT_abstract_origin: <0xe7a72>
    <e7ac4>   DW_AT_location    : 0x43970 (location list)
    <e7ac8>   DW_AT_GNU_locviews: 0x43966
 <2><e7acc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e7acd>   DW_AT_abstract_origin: <0xe7a7d>
    <e7ad1>   DW_AT_location    : 0x4399a (location list)
    <e7ad5>   DW_AT_GNU_locviews: 0x43990
 <2><e7ad9>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e7ada>   DW_AT_abstract_origin: <0xe7a87>
    <e7ade>   DW_AT_location    : 0x439be (location list)
    <e7ae2>   DW_AT_GNU_locviews: 0x439ba
 <2><e7ae6>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e7ae7>   DW_AT_abstract_origin: <0xe7a91>
    <e7aeb>   DW_AT_location    : 0x439d6 (location list)
    <e7aef>   DW_AT_GNU_locviews: 0x439cc
 <2><e7af3>: Abbrev Number: 15 (DW_TAG_variable)
    <e7af4>   DW_AT_abstract_origin: <0xe7a9b>
 <2><e7af8>: Abbrev Number: 17 (DW_TAG_call_site)
    <e7af9>   DW_AT_call_return_pc: 0x4797ba
    <e7b01>   DW_AT_call_tail_call: 1
    <e7b01>   DW_AT_call_origin : <0xe7902>
    <e7b05>   DW_AT_sibling     : <0xe7b32>
 <3><e7b09>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7b0a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e7b0c>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><e7b10>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7b11>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e7b13>   DW_AT_call_value  : 24 byte block: a3 1 51 31 1c c ff ff ff ff 1a 33 24 3 c0 49 48 0 0 0 0 0 22 6 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)); DW_OP_lit1; DW_OP_minus; DW_OP_const4u: 4294967295; DW_OP_and; DW_OP_lit3; DW_OP_shl; DW_OP_addr: 4849c0; DW_OP_plus; DW_OP_deref)
 <3><e7b2c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7b2d>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e7b2f>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e7b31>: Abbrev Number: 0
 <2><e7b32>: Abbrev Number: 34 (DW_TAG_call_site)
    <e7b33>   DW_AT_call_return_pc: 0x4797cd
    <e7b3b>   DW_AT_call_tail_call: 1
    <e7b3b>   DW_AT_call_origin : <0xe7902>
 <3><e7b3f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7b40>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e7b42>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e7b44>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <e7b45>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e7b47>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e7b49>: Abbrev Number: 0
 <2><e7b4a>: Abbrev Number: 0
 <1><e7b4b>: Abbrev Number: 0
  Compilation Unit @ offset 0xe7b4c:
   Length:        0x845 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x183f2
   Pointer Size:  8
 <0><e7b58>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <e7b59>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <e7b5d>   DW_AT_language    : 29	(C11)
    <e7b5e>   DW_AT_name        : (indirect line string, offset: 0x1834): src/rtlib/dev_file_tell.c
    <e7b62>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <e7b66>   DW_AT_low_pc      : 0x479890
    <e7b6e>   DW_AT_high_pc     : 0x2a
    <e7b76>   DW_AT_stmt_list   : 0x6f29e
 <1><e7b7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b7b>   DW_AT_byte_size   : 1
    <e7b7c>   DW_AT_encoding    : 8	(unsigned char)
    <e7b7d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><e7b81>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b82>   DW_AT_byte_size   : 2
    <e7b83>   DW_AT_encoding    : 7	(unsigned)
    <e7b84>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><e7b88>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b89>   DW_AT_byte_size   : 4
    <e7b8a>   DW_AT_encoding    : 7	(unsigned)
    <e7b8b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><e7b8f>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b90>   DW_AT_byte_size   : 8
    <e7b91>   DW_AT_encoding    : 7	(unsigned)
    <e7b92>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><e7b96>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b97>   DW_AT_byte_size   : 1
    <e7b98>   DW_AT_encoding    : 6	(signed char)
    <e7b99>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><e7b9d>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7b9e>   DW_AT_byte_size   : 2
    <e7b9f>   DW_AT_encoding    : 5	(signed)
    <e7ba0>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><e7ba4>: Abbrev Number: 17 (DW_TAG_base_type)
    <e7ba5>   DW_AT_byte_size   : 4
    <e7ba6>   DW_AT_encoding    : 5	(signed)
    <e7ba7>   DW_AT_name        : int
 <1><e7bab>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7bac>   DW_AT_byte_size   : 8
    <e7bad>   DW_AT_encoding    : 5	(signed)
    <e7bae>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><e7bb2>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7bb3>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <e7bb7>   DW_AT_decl_file   : 2
    <e7bb8>   DW_AT_decl_line   : 152
    <e7bb9>   DW_AT_decl_column : 25
    <e7bba>   DW_AT_type        : <0xe7bab>
 <1><e7bbe>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7bbf>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <e7bc3>   DW_AT_decl_file   : 2
    <e7bc4>   DW_AT_decl_line   : 153
    <e7bc5>   DW_AT_decl_column : 27
    <e7bc6>   DW_AT_type        : <0xe7bab>
 <1><e7bca>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e7bcb>   DW_AT_byte_size   : 8
 <1><e7bcc>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7bcd>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <e7bd1>   DW_AT_decl_file   : 2
    <e7bd2>   DW_AT_decl_line   : 194
    <e7bd3>   DW_AT_decl_column : 27
    <e7bd4>   DW_AT_type        : <0xe7bab>
 <1><e7bd8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7bd9>   DW_AT_byte_size   : 8
    <e7bd9>   DW_AT_type        : <0xe7bdd>
 <1><e7bdd>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7bde>   DW_AT_byte_size   : 1
    <e7bdf>   DW_AT_encoding    : 6	(signed char)
    <e7be0>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><e7be4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7be5>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <e7be9>   DW_AT_decl_file   : 3
    <e7bea>   DW_AT_decl_line   : 209
    <e7beb>   DW_AT_decl_column : 23
    <e7bec>   DW_AT_type        : <0xe7b8f>
 <1><e7bf0>: Abbrev Number: 19 (DW_TAG_typedef)
    <e7bf1>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <e7bf5>   DW_AT_decl_file   : 3
    <e7bf6>   DW_AT_decl_line   : 321
    <e7bf8>   DW_AT_decl_column : 24
    <e7bf9>   DW_AT_type        : <0xe7ba4>
 <1><e7bfd>: Abbrev Number: 20 (DW_TAG_const_type)
    <e7bfe>   DW_AT_type        : <0xe7bf0>
 <1><e7c02>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7c03>   DW_AT_byte_size   : 8
    <e7c04>   DW_AT_encoding    : 5	(signed)
    <e7c05>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e7c09>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7c0a>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e7c0e>   DW_AT_decl_file   : 4
    <e7c0f>   DW_AT_decl_line   : 87
    <e7c10>   DW_AT_decl_column : 19
    <e7c11>   DW_AT_type        : <0xe7bbe>
 <1><e7c15>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7c16>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <e7c1a>   DW_AT_decl_file   : 4
    <e7c1b>   DW_AT_decl_line   : 108
    <e7c1c>   DW_AT_decl_column : 19
    <e7c1d>   DW_AT_type        : <0xe7bcc>
 <1><e7c21>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7c22>   DW_AT_byte_size   : 8
    <e7c23>   DW_AT_encoding    : 7	(unsigned)
    <e7c24>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e7c28>: Abbrev Number: 9 (DW_TAG_array_type)
    <e7c29>   DW_AT_type        : <0xe7bdd>
    <e7c2d>   DW_AT_sibling     : <0xe7c38>
 <2><e7c31>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e7c32>   DW_AT_type        : <0xe7b8f>
    <e7c36>   DW_AT_upper_bound : 3
 <2><e7c37>: Abbrev Number: 0
 <1><e7c38>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7c39>   DW_AT_byte_size   : 8
    <e7c39>   DW_AT_type        : <0xe7c3d>
 <1><e7c3d>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><e7c3e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e7c3f>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <e7c43>   DW_AT_byte_size   : 216
    <e7c44>   DW_AT_decl_file   : 5
    <e7c45>   DW_AT_decl_line   : 49
    <e7c46>   DW_AT_decl_column : 8
    <e7c47>   DW_AT_sibling     : <0xe7dc5>
 <2><e7c4b>: Abbrev Number: 1 (DW_TAG_member)
    <e7c4c>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <e7c50>   DW_AT_decl_file   : 5
    <e7c51>   DW_AT_decl_line   : 51
    <e7c52>   DW_AT_decl_column : 7
    <e7c53>   DW_AT_type        : <0xe7ba4>
    <e7c57>   DW_AT_data_member_location: 0
 <2><e7c58>: Abbrev Number: 1 (DW_TAG_member)
    <e7c59>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <e7c5d>   DW_AT_decl_file   : 5
    <e7c5e>   DW_AT_decl_line   : 54
    <e7c5f>   DW_AT_decl_column : 9
    <e7c60>   DW_AT_type        : <0xe7bd8>
    <e7c64>   DW_AT_data_member_location: 8
 <2><e7c65>: Abbrev Number: 1 (DW_TAG_member)
    <e7c66>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <e7c6a>   DW_AT_decl_file   : 5
    <e7c6b>   DW_AT_decl_line   : 55
    <e7c6c>   DW_AT_decl_column : 9
    <e7c6d>   DW_AT_type        : <0xe7bd8>
    <e7c71>   DW_AT_data_member_location: 16
 <2><e7c72>: Abbrev Number: 1 (DW_TAG_member)
    <e7c73>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <e7c77>   DW_AT_decl_file   : 5
    <e7c78>   DW_AT_decl_line   : 56
    <e7c79>   DW_AT_decl_column : 9
    <e7c7a>   DW_AT_type        : <0xe7bd8>
    <e7c7e>   DW_AT_data_member_location: 24
 <2><e7c7f>: Abbrev Number: 1 (DW_TAG_member)
    <e7c80>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <e7c84>   DW_AT_decl_file   : 5
    <e7c85>   DW_AT_decl_line   : 57
    <e7c86>   DW_AT_decl_column : 9
    <e7c87>   DW_AT_type        : <0xe7bd8>
    <e7c8b>   DW_AT_data_member_location: 32
 <2><e7c8c>: Abbrev Number: 1 (DW_TAG_member)
    <e7c8d>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <e7c91>   DW_AT_decl_file   : 5
    <e7c92>   DW_AT_decl_line   : 58
    <e7c93>   DW_AT_decl_column : 9
    <e7c94>   DW_AT_type        : <0xe7bd8>
    <e7c98>   DW_AT_data_member_location: 40
 <2><e7c99>: Abbrev Number: 1 (DW_TAG_member)
    <e7c9a>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <e7c9e>   DW_AT_decl_file   : 5
    <e7c9f>   DW_AT_decl_line   : 59
    <e7ca0>   DW_AT_decl_column : 9
    <e7ca1>   DW_AT_type        : <0xe7bd8>
    <e7ca5>   DW_AT_data_member_location: 48
 <2><e7ca6>: Abbrev Number: 1 (DW_TAG_member)
    <e7ca7>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <e7cab>   DW_AT_decl_file   : 5
    <e7cac>   DW_AT_decl_line   : 60
    <e7cad>   DW_AT_decl_column : 9
    <e7cae>   DW_AT_type        : <0xe7bd8>
    <e7cb2>   DW_AT_data_member_location: 56
 <2><e7cb3>: Abbrev Number: 1 (DW_TAG_member)
    <e7cb4>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <e7cb8>   DW_AT_decl_file   : 5
    <e7cb9>   DW_AT_decl_line   : 61
    <e7cba>   DW_AT_decl_column : 9
    <e7cbb>   DW_AT_type        : <0xe7bd8>
    <e7cbf>   DW_AT_data_member_location: 64
 <2><e7cc0>: Abbrev Number: 1 (DW_TAG_member)
    <e7cc1>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <e7cc5>   DW_AT_decl_file   : 5
    <e7cc6>   DW_AT_decl_line   : 64
    <e7cc7>   DW_AT_decl_column : 9
    <e7cc8>   DW_AT_type        : <0xe7bd8>
    <e7ccc>   DW_AT_data_member_location: 72
 <2><e7ccd>: Abbrev Number: 1 (DW_TAG_member)
    <e7cce>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <e7cd2>   DW_AT_decl_file   : 5
    <e7cd3>   DW_AT_decl_line   : 65
    <e7cd4>   DW_AT_decl_column : 9
    <e7cd5>   DW_AT_type        : <0xe7bd8>
    <e7cd9>   DW_AT_data_member_location: 80
 <2><e7cda>: Abbrev Number: 1 (DW_TAG_member)
    <e7cdb>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <e7cdf>   DW_AT_decl_file   : 5
    <e7ce0>   DW_AT_decl_line   : 66
    <e7ce1>   DW_AT_decl_column : 9
    <e7ce2>   DW_AT_type        : <0xe7bd8>
    <e7ce6>   DW_AT_data_member_location: 88
 <2><e7ce7>: Abbrev Number: 1 (DW_TAG_member)
    <e7ce8>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <e7cec>   DW_AT_decl_file   : 5
    <e7ced>   DW_AT_decl_line   : 68
    <e7cee>   DW_AT_decl_column : 22
    <e7cef>   DW_AT_type        : <0xe7dde>
    <e7cf3>   DW_AT_data_member_location: 96
 <2><e7cf4>: Abbrev Number: 1 (DW_TAG_member)
    <e7cf5>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <e7cf9>   DW_AT_decl_file   : 5
    <e7cfa>   DW_AT_decl_line   : 70
    <e7cfb>   DW_AT_decl_column : 20
    <e7cfc>   DW_AT_type        : <0xe7de3>
    <e7d00>   DW_AT_data_member_location: 104
 <2><e7d01>: Abbrev Number: 1 (DW_TAG_member)
    <e7d02>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <e7d06>   DW_AT_decl_file   : 5
    <e7d07>   DW_AT_decl_line   : 72
    <e7d08>   DW_AT_decl_column : 7
    <e7d09>   DW_AT_type        : <0xe7ba4>
    <e7d0d>   DW_AT_data_member_location: 112
 <2><e7d0e>: Abbrev Number: 1 (DW_TAG_member)
    <e7d0f>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <e7d13>   DW_AT_decl_file   : 5
    <e7d14>   DW_AT_decl_line   : 73
    <e7d15>   DW_AT_decl_column : 7
    <e7d16>   DW_AT_type        : <0xe7ba4>
    <e7d1a>   DW_AT_data_member_location: 116
 <2><e7d1b>: Abbrev Number: 1 (DW_TAG_member)
    <e7d1c>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <e7d20>   DW_AT_decl_file   : 5
    <e7d21>   DW_AT_decl_line   : 74
    <e7d22>   DW_AT_decl_column : 11
    <e7d23>   DW_AT_type        : <0xe7bb2>
    <e7d27>   DW_AT_data_member_location: 120
 <2><e7d28>: Abbrev Number: 1 (DW_TAG_member)
    <e7d29>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <e7d2d>   DW_AT_decl_file   : 5
    <e7d2e>   DW_AT_decl_line   : 77
    <e7d2f>   DW_AT_decl_column : 18
    <e7d30>   DW_AT_type        : <0xe7b81>
    <e7d34>   DW_AT_data_member_location: 128
 <2><e7d35>: Abbrev Number: 1 (DW_TAG_member)
    <e7d36>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <e7d3a>   DW_AT_decl_file   : 5
    <e7d3b>   DW_AT_decl_line   : 78
    <e7d3c>   DW_AT_decl_column : 15
    <e7d3d>   DW_AT_type        : <0xe7b96>
    <e7d41>   DW_AT_data_member_location: 130
 <2><e7d42>: Abbrev Number: 1 (DW_TAG_member)
    <e7d43>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <e7d47>   DW_AT_decl_file   : 5
    <e7d48>   DW_AT_decl_line   : 79
    <e7d49>   DW_AT_decl_column : 8
    <e7d4a>   DW_AT_type        : <0xe7de8>
    <e7d4e>   DW_AT_data_member_location: 131
 <2><e7d4f>: Abbrev Number: 1 (DW_TAG_member)
    <e7d50>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <e7d54>   DW_AT_decl_file   : 5
    <e7d55>   DW_AT_decl_line   : 81
    <e7d56>   DW_AT_decl_column : 15
    <e7d57>   DW_AT_type        : <0xe7df8>
    <e7d5b>   DW_AT_data_member_location: 136
 <2><e7d5c>: Abbrev Number: 1 (DW_TAG_member)
    <e7d5d>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <e7d61>   DW_AT_decl_file   : 5
    <e7d62>   DW_AT_decl_line   : 89
    <e7d63>   DW_AT_decl_column : 13
    <e7d64>   DW_AT_type        : <0xe7bbe>
    <e7d68>   DW_AT_data_member_location: 144
 <2><e7d69>: Abbrev Number: 1 (DW_TAG_member)
    <e7d6a>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <e7d6e>   DW_AT_decl_file   : 5
    <e7d6f>   DW_AT_decl_line   : 91
    <e7d70>   DW_AT_decl_column : 23
    <e7d71>   DW_AT_type        : <0xe7e02>
    <e7d75>   DW_AT_data_member_location: 152
 <2><e7d76>: Abbrev Number: 1 (DW_TAG_member)
    <e7d77>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <e7d7b>   DW_AT_decl_file   : 5
    <e7d7c>   DW_AT_decl_line   : 92
    <e7d7d>   DW_AT_decl_column : 25
    <e7d7e>   DW_AT_type        : <0xe7e0c>
    <e7d82>   DW_AT_data_member_location: 160
 <2><e7d83>: Abbrev Number: 1 (DW_TAG_member)
    <e7d84>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <e7d88>   DW_AT_decl_file   : 5
    <e7d89>   DW_AT_decl_line   : 93
    <e7d8a>   DW_AT_decl_column : 20
    <e7d8b>   DW_AT_type        : <0xe7de3>
    <e7d8f>   DW_AT_data_member_location: 168
 <2><e7d90>: Abbrev Number: 1 (DW_TAG_member)
    <e7d91>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <e7d95>   DW_AT_decl_file   : 5
    <e7d96>   DW_AT_decl_line   : 94
    <e7d97>   DW_AT_decl_column : 9
    <e7d98>   DW_AT_type        : <0xe7bca>
    <e7d9c>   DW_AT_data_member_location: 176
 <2><e7d9d>: Abbrev Number: 1 (DW_TAG_member)
    <e7d9e>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <e7da2>   DW_AT_decl_file   : 5
    <e7da3>   DW_AT_decl_line   : 95
    <e7da4>   DW_AT_decl_column : 10
    <e7da5>   DW_AT_type        : <0xe7be4>
    <e7da9>   DW_AT_data_member_location: 184
 <2><e7daa>: Abbrev Number: 1 (DW_TAG_member)
    <e7dab>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <e7daf>   DW_AT_decl_file   : 5
    <e7db0>   DW_AT_decl_line   : 96
    <e7db1>   DW_AT_decl_column : 7
    <e7db2>   DW_AT_type        : <0xe7ba4>
    <e7db6>   DW_AT_data_member_location: 192
 <2><e7db7>: Abbrev Number: 1 (DW_TAG_member)
    <e7db8>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <e7dbc>   DW_AT_decl_file   : 5
    <e7dbd>   DW_AT_decl_line   : 98
    <e7dbe>   DW_AT_decl_column : 8
    <e7dbf>   DW_AT_type        : <0xe7e11>
    <e7dc3>   DW_AT_data_member_location: 196
 <2><e7dc4>: Abbrev Number: 0
 <1><e7dc5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7dc6>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <e7dca>   DW_AT_decl_file   : 6
    <e7dcb>   DW_AT_decl_line   : 7
    <e7dcc>   DW_AT_decl_column : 25
    <e7dcd>   DW_AT_type        : <0xe7c3e>
 <1><e7dd1>: Abbrev Number: 22 (DW_TAG_typedef)
    <e7dd2>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <e7dd6>   DW_AT_decl_file   : 5
    <e7dd7>   DW_AT_decl_line   : 43
    <e7dd8>   DW_AT_decl_column : 14
 <1><e7dd9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e7dda>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <e7dde>   DW_AT_declaration : 1
 <1><e7dde>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7ddf>   DW_AT_byte_size   : 8
    <e7ddf>   DW_AT_type        : <0xe7dd9>
 <1><e7de3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7de4>   DW_AT_byte_size   : 8
    <e7de4>   DW_AT_type        : <0xe7c3e>
 <1><e7de8>: Abbrev Number: 9 (DW_TAG_array_type)
    <e7de9>   DW_AT_type        : <0xe7bdd>
    <e7ded>   DW_AT_sibling     : <0xe7df8>
 <2><e7df1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e7df2>   DW_AT_type        : <0xe7b8f>
    <e7df6>   DW_AT_upper_bound : 0
 <2><e7df7>: Abbrev Number: 0
 <1><e7df8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7df9>   DW_AT_byte_size   : 8
    <e7df9>   DW_AT_type        : <0xe7dd1>
 <1><e7dfd>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e7dfe>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <e7e02>   DW_AT_declaration : 1
 <1><e7e02>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7e03>   DW_AT_byte_size   : 8
    <e7e03>   DW_AT_type        : <0xe7dfd>
 <1><e7e07>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e7e08>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <e7e0c>   DW_AT_declaration : 1
 <1><e7e0c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7e0d>   DW_AT_byte_size   : 8
    <e7e0d>   DW_AT_type        : <0xe7e07>
 <1><e7e11>: Abbrev Number: 9 (DW_TAG_array_type)
    <e7e12>   DW_AT_type        : <0xe7bdd>
    <e7e16>   DW_AT_sibling     : <0xe7e21>
 <2><e7e1a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e7e1b>   DW_AT_type        : <0xe7b8f>
    <e7e1f>   DW_AT_upper_bound : 19
 <2><e7e20>: Abbrev Number: 0
 <1><e7e21>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7e22>   DW_AT_byte_size   : 8
    <e7e22>   DW_AT_type        : <0xe7dc5>
 <1><e7e26>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7e27>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <e7e2b>   DW_AT_decl_file   : 7
    <e7e2c>   DW_AT_decl_line   : 22
    <e7e2d>   DW_AT_decl_column : 15
    <e7e2e>   DW_AT_type        : <0xe7c09>
 <1><e7e32>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <e7e33>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <e7e37>   DW_AT_encoding    : 7	(void)
    <e7e37>   DW_AT_byte_size   : 4
    <e7e37>   DW_AT_type        : <0xe7b88>
    <e7e3b>   DW_AT_decl_file   : 9
    <e7e3c>   DW_AT_decl_line   : 1
    <e7e3d>   DW_AT_decl_column : 14
    <e7e3d>   DW_AT_sibling     : <0xe7eb4>
 <2><e7e41>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e42>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <e7e46>   DW_AT_const_value : 0
 <2><e7e47>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e48>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <e7e4c>   DW_AT_const_value : 1
 <2><e7e4d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e4e>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <e7e52>   DW_AT_const_value : 2
 <2><e7e53>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e54>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <e7e58>   DW_AT_const_value : 3
 <2><e7e59>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e5a>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <e7e5e>   DW_AT_const_value : 4
 <2><e7e5f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e60>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <e7e64>   DW_AT_const_value : 5
 <2><e7e65>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e66>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <e7e6a>   DW_AT_const_value : 6
 <2><e7e6b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e6c>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <e7e70>   DW_AT_const_value : 7
 <2><e7e71>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e72>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <e7e76>   DW_AT_const_value : 8
 <2><e7e77>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e78>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <e7e7c>   DW_AT_const_value : 9
 <2><e7e7d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e7e>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <e7e82>   DW_AT_const_value : 10
 <2><e7e83>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e84>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <e7e88>   DW_AT_const_value : 11
 <2><e7e89>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e8a>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <e7e8e>   DW_AT_const_value : 12
 <2><e7e8f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e90>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <e7e94>   DW_AT_const_value : 13
 <2><e7e95>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e96>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <e7e9a>   DW_AT_const_value : 14
 <2><e7e9b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7e9c>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <e7ea0>   DW_AT_const_value : 15
 <2><e7ea1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7ea2>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <e7ea6>   DW_AT_const_value : 16
 <2><e7ea7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7ea8>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <e7eac>   DW_AT_const_value : 17
 <2><e7ead>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7eae>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <e7eb2>   DW_AT_const_value : 18
 <2><e7eb3>: Abbrev Number: 0
 <1><e7eb4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e7eb5>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <e7eb9>   DW_AT_byte_size   : 24
    <e7eba>   DW_AT_decl_file   : 8
    <e7ebb>   DW_AT_decl_line   : 82
    <e7ebc>   DW_AT_decl_column : 16
    <e7ebd>   DW_AT_sibling     : <0xe7ee8>
 <2><e7ec1>: Abbrev Number: 1 (DW_TAG_member)
    <e7ec2>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <e7ec6>   DW_AT_decl_file   : 8
    <e7ec7>   DW_AT_decl_line   : 83
    <e7ec8>   DW_AT_decl_column : 21
    <e7ec9>   DW_AT_type        : <0xe7bd8>
    <e7ecd>   DW_AT_data_member_location: 0
 <2><e7ece>: Abbrev Number: 13 (DW_TAG_member)
    <e7ecf>   DW_AT_name        : len
    <e7ed3>   DW_AT_decl_file   : 8
    <e7ed4>   DW_AT_decl_line   : 84
    <e7ed5>   DW_AT_decl_column : 21
    <e7ed5>   DW_AT_type        : <0xe7c15>
    <e7ed9>   DW_AT_data_member_location: 8
 <2><e7eda>: Abbrev Number: 1 (DW_TAG_member)
    <e7edb>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e7edf>   DW_AT_decl_file   : 8
    <e7ee0>   DW_AT_decl_line   : 85
    <e7ee1>   DW_AT_decl_column : 21
    <e7ee2>   DW_AT_type        : <0xe7c15>
    <e7ee6>   DW_AT_data_member_location: 16
 <2><e7ee7>: Abbrev Number: 0
 <1><e7ee8>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7ee9>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <e7eed>   DW_AT_decl_file   : 8
    <e7eee>   DW_AT_decl_line   : 86
    <e7eef>   DW_AT_decl_column : 3
    <e7ef0>   DW_AT_type        : <0xe7eb4>
 <1><e7ef4>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7ef5>   DW_AT_byte_size   : 8
    <e7ef6>   DW_AT_encoding    : 4	(float)
    <e7ef7>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><e7efb>: Abbrev Number: 6 (DW_TAG_base_type)
    <e7efc>   DW_AT_byte_size   : 4
    <e7efd>   DW_AT_encoding    : 4	(float)
    <e7efe>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><e7f02>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7f03>   DW_AT_byte_size   : 8
    <e7f03>   DW_AT_type        : <0xe7bf0>
 <1><e7f07>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <e7f08>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <e7f0c>   DW_AT_encoding    : 7	(void)
    <e7f0c>   DW_AT_byte_size   : 4
    <e7f0c>   DW_AT_type        : <0xe7b88>
    <e7f10>   DW_AT_decl_file   : 10
    <e7f11>   DW_AT_decl_line   : 25
    <e7f12>   DW_AT_decl_column : 14
    <e7f12>   DW_AT_sibling     : <0xe7f2f>
 <2><e7f16>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7f17>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <e7f1b>   DW_AT_const_value : 0
 <2><e7f1c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7f1d>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <e7f21>   DW_AT_const_value : 1
 <2><e7f22>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7f23>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <e7f27>   DW_AT_const_value : 2
 <2><e7f28>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e7f29>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <e7f2d>   DW_AT_const_value : 3
 <2><e7f2e>: Abbrev Number: 0
 <1><e7f2f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7f30>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <e7f34>   DW_AT_decl_file   : 10
    <e7f35>   DW_AT_decl_line   : 30
    <e7f36>   DW_AT_decl_column : 3
    <e7f37>   DW_AT_type        : <0xe7f07>
 <1><e7f3b>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7f3c>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <e7f40>   DW_AT_decl_file   : 10
    <e7f41>   DW_AT_decl_line   : 54
    <e7f42>   DW_AT_decl_column : 15
    <e7f43>   DW_AT_type        : <0xe7f47>
 <1><e7f47>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7f48>   DW_AT_byte_size   : 8
    <e7f48>   DW_AT_type        : <0xe7f4c>
 <1><e7f4c>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e7f4d>   DW_AT_prototyped  : 1
    <e7f4d>   DW_AT_type        : <0xe7ba4>
    <e7f51>   DW_AT_sibling     : <0xe7f60>
 <2><e7f55>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e7f56>   DW_AT_type        : <0xe7f60>
 <2><e7f5a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e7f5b>   DW_AT_type        : <0xe7ba4>
 <2><e7f5f>: Abbrev Number: 0
 <1><e7f60>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7f61>   DW_AT_byte_size   : 8
    <e7f61>   DW_AT_type        : <0xe7f65>
 <1><e7f65>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e7f66>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <e7f6a>   DW_AT_byte_size   : 80
    <e7f6b>   DW_AT_decl_file   : 10
    <e7f6c>   DW_AT_decl_line   : 97
    <e7f6d>   DW_AT_decl_column : 16
    <e7f6e>   DW_AT_sibling     : <0xe8028>
 <2><e7f72>: Abbrev Number: 1 (DW_TAG_member)
    <e7f73>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <e7f77>   DW_AT_decl_file   : 10
    <e7f78>   DW_AT_decl_line   : 98
    <e7f79>   DW_AT_decl_column : 21
    <e7f7a>   DW_AT_type        : <0xe7ba4>
    <e7f7e>   DW_AT_data_member_location: 0
 <2><e7f7f>: Abbrev Number: 13 (DW_TAG_member)
    <e7f80>   DW_AT_name        : len
    <e7f84>   DW_AT_decl_file   : 10
    <e7f85>   DW_AT_decl_line   : 99
    <e7f86>   DW_AT_decl_column : 21
    <e7f86>   DW_AT_type        : <0xe7ba4>
    <e7f8a>   DW_AT_data_member_location: 4
 <2><e7f8b>: Abbrev Number: 1 (DW_TAG_member)
    <e7f8c>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <e7f90>   DW_AT_decl_file   : 10
    <e7f91>   DW_AT_decl_line   : 100
    <e7f92>   DW_AT_decl_column : 21
    <e7f93>   DW_AT_type        : <0xe7f2f>
    <e7f97>   DW_AT_data_member_location: 8
 <2><e7f98>: Abbrev Number: 1 (DW_TAG_member)
    <e7f99>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e7f9d>   DW_AT_decl_file   : 10
    <e7f9e>   DW_AT_decl_line   : 101
    <e7f9f>   DW_AT_decl_column : 21
    <e7fa0>   DW_AT_type        : <0xe7e26>
    <e7fa4>   DW_AT_data_member_location: 16
 <2><e7fa5>: Abbrev Number: 1 (DW_TAG_member)
    <e7fa6>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <e7faa>   DW_AT_decl_file   : 10
    <e7fab>   DW_AT_decl_line   : 102
    <e7fac>   DW_AT_decl_column : 21
    <e7fad>   DW_AT_type        : <0xe7ba4>
    <e7fb1>   DW_AT_data_member_location: 24
 <2><e7fb2>: Abbrev Number: 1 (DW_TAG_member)
    <e7fb3>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <e7fb7>   DW_AT_decl_file   : 10
    <e7fb8>   DW_AT_decl_line   : 103
    <e7fb9>   DW_AT_decl_column : 21
    <e7fba>   DW_AT_type        : <0xe7ba4>
    <e7fbe>   DW_AT_data_member_location: 28
 <2><e7fbf>: Abbrev Number: 1 (DW_TAG_member)
    <e7fc0>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <e7fc4>   DW_AT_decl_file   : 10
    <e7fc5>   DW_AT_decl_line   : 104
    <e7fc6>   DW_AT_decl_column : 21
    <e7fc7>   DW_AT_type        : <0xe7ba4>
    <e7fcb>   DW_AT_data_member_location: 32
 <2><e7fcc>: Abbrev Number: 1 (DW_TAG_member)
    <e7fcd>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <e7fd1>   DW_AT_decl_file   : 10
    <e7fd2>   DW_AT_decl_line   : 105
    <e7fd3>   DW_AT_decl_column : 21
    <e7fd4>   DW_AT_type        : <0xe7b88>
    <e7fd8>   DW_AT_data_member_location: 36
 <2><e7fd9>: Abbrev Number: 1 (DW_TAG_member)
    <e7fda>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <e7fde>   DW_AT_decl_file   : 10
    <e7fdf>   DW_AT_decl_line   : 106
    <e7fe0>   DW_AT_decl_column : 21
    <e7fe1>   DW_AT_type        : <0xe7b88>
    <e7fe5>   DW_AT_data_member_location: 40
 <2><e7fe6>: Abbrev Number: 1 (DW_TAG_member)
    <e7fe7>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <e7feb>   DW_AT_decl_file   : 10
    <e7fec>   DW_AT_decl_line   : 109
    <e7fed>   DW_AT_decl_column : 21
    <e7fee>   DW_AT_type        : <0xe7c28>
    <e7ff2>   DW_AT_data_member_location: 44
 <2><e7ff3>: Abbrev Number: 1 (DW_TAG_member)
    <e7ff4>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <e7ff8>   DW_AT_decl_file   : 10
    <e7ff9>   DW_AT_decl_line   : 110
    <e7ffa>   DW_AT_decl_column : 21
    <e7ffb>   DW_AT_type        : <0xe7be4>
    <e7fff>   DW_AT_data_member_location: 48
 <2><e8000>: Abbrev Number: 1 (DW_TAG_member)
    <e8001>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <e8005>   DW_AT_decl_file   : 10
    <e8006>   DW_AT_decl_line   : 112
    <e8007>   DW_AT_decl_column : 22
    <e8008>   DW_AT_type        : <0xe82c0>
    <e800c>   DW_AT_data_member_location: 56
 <2><e800d>: Abbrev Number: 1 (DW_TAG_member)
    <e800e>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <e8012>   DW_AT_decl_file   : 10
    <e8013>   DW_AT_decl_line   : 114
    <e8014>   DW_AT_decl_column : 14
    <e8015>   DW_AT_type        : <0xe7bca>
    <e8019>   DW_AT_data_member_location: 64
 <2><e801a>: Abbrev Number: 1 (DW_TAG_member)
    <e801b>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <e801f>   DW_AT_decl_file   : 10
    <e8020>   DW_AT_decl_line   : 116
    <e8021>   DW_AT_decl_column : 22
    <e8022>   DW_AT_type        : <0xe7f60>
    <e8026>   DW_AT_data_member_location: 72
 <2><e8027>: Abbrev Number: 0
 <1><e8028>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8029>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <e802d>   DW_AT_decl_file   : 10
    <e802e>   DW_AT_decl_line   : 59
    <e802f>   DW_AT_decl_column : 15
    <e8030>   DW_AT_type        : <0xe8034>
 <1><e8034>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8035>   DW_AT_byte_size   : 8
    <e8035>   DW_AT_type        : <0xe8039>
 <1><e8039>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e803a>   DW_AT_prototyped  : 1
    <e803a>   DW_AT_type        : <0xe7ba4>
    <e803e>   DW_AT_sibling     : <0xe8048>
 <2><e8042>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8043>   DW_AT_type        : <0xe7f60>
 <2><e8047>: Abbrev Number: 0
 <1><e8048>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8049>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <e804d>   DW_AT_decl_file   : 10
    <e804e>   DW_AT_decl_line   : 60
    <e804f>   DW_AT_decl_column : 15
    <e8050>   DW_AT_type        : <0xe8034>
 <1><e8054>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8055>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <e8059>   DW_AT_decl_file   : 10
    <e805a>   DW_AT_decl_line   : 61
    <e805b>   DW_AT_decl_column : 15
    <e805c>   DW_AT_type        : <0xe8060>
 <1><e8060>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8061>   DW_AT_byte_size   : 8
    <e8061>   DW_AT_type        : <0xe8065>
 <1><e8065>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e8066>   DW_AT_prototyped  : 1
    <e8066>   DW_AT_type        : <0xe7ba4>
    <e806a>   DW_AT_sibling     : <0xe807e>
 <2><e806e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e806f>   DW_AT_type        : <0xe7f60>
 <2><e8073>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8074>   DW_AT_type        : <0xe7e26>
 <2><e8078>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8079>   DW_AT_type        : <0xe7ba4>
 <2><e807d>: Abbrev Number: 0
 <1><e807e>: Abbrev Number: 4 (DW_TAG_typedef)
    <e807f>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <e8083>   DW_AT_decl_file   : 10
    <e8084>   DW_AT_decl_line   : 62
    <e8085>   DW_AT_decl_column : 15
    <e8086>   DW_AT_type        : <0xe808a>
 <1><e808a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e808b>   DW_AT_byte_size   : 8
    <e808b>   DW_AT_type        : <0xe808f>
 <1><e808f>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e8090>   DW_AT_prototyped  : 1
    <e8090>   DW_AT_type        : <0xe7ba4>
    <e8094>   DW_AT_sibling     : <0xe80a3>
 <2><e8098>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8099>   DW_AT_type        : <0xe7f60>
 <2><e809d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e809e>   DW_AT_type        : <0xe80a3>
 <2><e80a2>: Abbrev Number: 0
 <1><e80a3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e80a4>   DW_AT_byte_size   : 8
    <e80a4>   DW_AT_type        : <0xe7e26>
 <1><e80a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <e80a9>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <e80ad>   DW_AT_decl_file   : 10
    <e80ae>   DW_AT_decl_line   : 63
    <e80af>   DW_AT_decl_column : 15
    <e80b0>   DW_AT_type        : <0xe80b4>
 <1><e80b4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e80b5>   DW_AT_byte_size   : 8
    <e80b5>   DW_AT_type        : <0xe80b9>
 <1><e80b9>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e80ba>   DW_AT_prototyped  : 1
    <e80ba>   DW_AT_type        : <0xe7ba4>
    <e80be>   DW_AT_sibling     : <0xe80d2>
 <2><e80c2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80c3>   DW_AT_type        : <0xe7f60>
 <2><e80c7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80c8>   DW_AT_type        : <0xe7bca>
 <2><e80cc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80cd>   DW_AT_type        : <0xe80d2>
 <2><e80d1>: Abbrev Number: 0
 <1><e80d2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e80d3>   DW_AT_byte_size   : 8
    <e80d3>   DW_AT_type        : <0xe7be4>
 <1><e80d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <e80d8>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <e80dc>   DW_AT_decl_file   : 10
    <e80dd>   DW_AT_decl_line   : 65
    <e80de>   DW_AT_decl_column : 15
    <e80df>   DW_AT_type        : <0xe80e3>
 <1><e80e3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e80e4>   DW_AT_byte_size   : 8
    <e80e4>   DW_AT_type        : <0xe80e8>
 <1><e80e8>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e80e9>   DW_AT_prototyped  : 1
    <e80e9>   DW_AT_type        : <0xe7ba4>
    <e80ed>   DW_AT_sibling     : <0xe8101>
 <2><e80f1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80f2>   DW_AT_type        : <0xe7f60>
 <2><e80f6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80f7>   DW_AT_type        : <0xe7f02>
 <2><e80fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e80fc>   DW_AT_type        : <0xe80d2>
 <2><e8100>: Abbrev Number: 0
 <1><e8101>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8102>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <e8106>   DW_AT_decl_file   : 10
    <e8107>   DW_AT_decl_line   : 67
    <e8108>   DW_AT_decl_column : 15
    <e8109>   DW_AT_type        : <0xe810d>
 <1><e810d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e810e>   DW_AT_byte_size   : 8
    <e810e>   DW_AT_type        : <0xe8112>
 <1><e8112>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e8113>   DW_AT_prototyped  : 1
    <e8113>   DW_AT_type        : <0xe7ba4>
    <e8117>   DW_AT_sibling     : <0xe812b>
 <2><e811b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e811c>   DW_AT_type        : <0xe7f60>
 <2><e8120>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8121>   DW_AT_type        : <0xe7c38>
 <2><e8125>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8126>   DW_AT_type        : <0xe7be4>
 <2><e812a>: Abbrev Number: 0
 <1><e812b>: Abbrev Number: 4 (DW_TAG_typedef)
    <e812c>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <e8130>   DW_AT_decl_file   : 10
    <e8131>   DW_AT_decl_line   : 69
    <e8132>   DW_AT_decl_column : 15
    <e8133>   DW_AT_type        : <0xe8137>
 <1><e8137>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8138>   DW_AT_byte_size   : 8
    <e8138>   DW_AT_type        : <0xe813c>
 <1><e813c>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e813d>   DW_AT_prototyped  : 1
    <e813d>   DW_AT_type        : <0xe7ba4>
    <e8141>   DW_AT_sibling     : <0xe8155>
 <2><e8145>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8146>   DW_AT_type        : <0xe7f60>
 <2><e814a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e814b>   DW_AT_type        : <0xe8155>
 <2><e814f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8150>   DW_AT_type        : <0xe7be4>
 <2><e8154>: Abbrev Number: 0
 <1><e8155>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8156>   DW_AT_byte_size   : 8
    <e8156>   DW_AT_type        : <0xe7bfd>
 <1><e815a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e815b>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <e815f>   DW_AT_decl_file   : 10
    <e8160>   DW_AT_decl_line   : 71
    <e8161>   DW_AT_decl_column : 15
    <e8162>   DW_AT_type        : <0xe8166>
 <1><e8166>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8167>   DW_AT_byte_size   : 8
    <e8167>   DW_AT_type        : <0xe816b>
 <1><e816b>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e816c>   DW_AT_prototyped  : 1
    <e816c>   DW_AT_type        : <0xe7ba4>
    <e8170>   DW_AT_sibling     : <0xe8184>
 <2><e8174>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8175>   DW_AT_type        : <0xe7f60>
 <2><e8179>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e817a>   DW_AT_type        : <0xe7e26>
 <2><e817e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e817f>   DW_AT_type        : <0xe7e26>
 <2><e8183>: Abbrev Number: 0
 <1><e8184>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8185>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <e8189>   DW_AT_decl_file   : 10
    <e818a>   DW_AT_decl_line   : 73
    <e818b>   DW_AT_decl_column : 15
    <e818c>   DW_AT_type        : <0xe8166>
 <1><e8190>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8191>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <e8195>   DW_AT_decl_file   : 10
    <e8196>   DW_AT_decl_line   : 75
    <e8197>   DW_AT_decl_column : 15
    <e8198>   DW_AT_type        : <0xe819c>
 <1><e819c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e819d>   DW_AT_byte_size   : 8
    <e819d>   DW_AT_type        : <0xe81a1>
 <1><e81a1>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e81a2>   DW_AT_prototyped  : 1
    <e81a2>   DW_AT_type        : <0xe7ba4>
    <e81a6>   DW_AT_sibling     : <0xe81b5>
 <2><e81aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e81ab>   DW_AT_type        : <0xe7f60>
 <2><e81af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e81b0>   DW_AT_type        : <0xe81b5>
 <2><e81b4>: Abbrev Number: 0
 <1><e81b5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e81b6>   DW_AT_byte_size   : 8
    <e81b6>   DW_AT_type        : <0xe7ee8>
 <1><e81ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <e81bb>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <e81bf>   DW_AT_decl_file   : 10
    <e81c0>   DW_AT_decl_line   : 76
    <e81c1>   DW_AT_decl_column : 15
    <e81c2>   DW_AT_type        : <0xe81c6>
 <1><e81c6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e81c7>   DW_AT_byte_size   : 8
    <e81c7>   DW_AT_type        : <0xe81cb>
 <1><e81cb>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <e81cc>   DW_AT_prototyped  : 1
    <e81cc>   DW_AT_type        : <0xe7ba4>
    <e81d0>   DW_AT_sibling     : <0xe81e4>
 <2><e81d4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e81d5>   DW_AT_type        : <0xe7f60>
 <2><e81d9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e81da>   DW_AT_type        : <0xe7f02>
 <2><e81de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e81df>   DW_AT_type        : <0xe7c15>
 <2><e81e3>: Abbrev Number: 0
 <1><e81e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e81e5>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <e81e9>   DW_AT_decl_file   : 10
    <e81ea>   DW_AT_decl_line   : 77
    <e81eb>   DW_AT_decl_column : 15
    <e81ec>   DW_AT_type        : <0xe8034>
 <1><e81f0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e81f1>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <e81f5>   DW_AT_byte_size   : 112
    <e81f6>   DW_AT_decl_file   : 10
    <e81f7>   DW_AT_decl_line   : 80
    <e81f8>   DW_AT_decl_column : 16
    <e81f9>   DW_AT_sibling     : <0xe82b4>
 <2><e81fd>: Abbrev Number: 1 (DW_TAG_member)
    <e81fe>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <e8202>   DW_AT_decl_file   : 10
    <e8203>   DW_AT_decl_line   : 81
    <e8204>   DW_AT_decl_column : 25
    <e8205>   DW_AT_type        : <0xe8028>
    <e8209>   DW_AT_data_member_location: 0
 <2><e820a>: Abbrev Number: 1 (DW_TAG_member)
    <e820b>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <e820f>   DW_AT_decl_file   : 10
    <e8210>   DW_AT_decl_line   : 82
    <e8211>   DW_AT_decl_column : 25
    <e8212>   DW_AT_type        : <0xe8048>
    <e8216>   DW_AT_data_member_location: 8
 <2><e8217>: Abbrev Number: 1 (DW_TAG_member)
    <e8218>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <e821c>   DW_AT_decl_file   : 10
    <e821d>   DW_AT_decl_line   : 83
    <e821e>   DW_AT_decl_column : 25
    <e821f>   DW_AT_type        : <0xe8054>
    <e8223>   DW_AT_data_member_location: 16
 <2><e8224>: Abbrev Number: 1 (DW_TAG_member)
    <e8225>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <e8229>   DW_AT_decl_file   : 10
    <e822a>   DW_AT_decl_line   : 84
    <e822b>   DW_AT_decl_column : 25
    <e822c>   DW_AT_type        : <0xe807e>
    <e8230>   DW_AT_data_member_location: 24
 <2><e8231>: Abbrev Number: 1 (DW_TAG_member)
    <e8232>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <e8236>   DW_AT_decl_file   : 10
    <e8237>   DW_AT_decl_line   : 85
    <e8238>   DW_AT_decl_column : 25
    <e8239>   DW_AT_type        : <0xe80a8>
    <e823d>   DW_AT_data_member_location: 32
 <2><e823e>: Abbrev Number: 1 (DW_TAG_member)
    <e823f>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <e8243>   DW_AT_decl_file   : 10
    <e8244>   DW_AT_decl_line   : 86
    <e8245>   DW_AT_decl_column : 25
    <e8246>   DW_AT_type        : <0xe80d7>
    <e824a>   DW_AT_data_member_location: 40
 <2><e824b>: Abbrev Number: 1 (DW_TAG_member)
    <e824c>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <e8250>   DW_AT_decl_file   : 10
    <e8251>   DW_AT_decl_line   : 87
    <e8252>   DW_AT_decl_column : 25
    <e8253>   DW_AT_type        : <0xe8101>
    <e8257>   DW_AT_data_member_location: 48
 <2><e8258>: Abbrev Number: 1 (DW_TAG_member)
    <e8259>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <e825d>   DW_AT_decl_file   : 10
    <e825e>   DW_AT_decl_line   : 88
    <e825f>   DW_AT_decl_column : 25
    <e8260>   DW_AT_type        : <0xe812b>
    <e8264>   DW_AT_data_member_location: 56
 <2><e8265>: Abbrev Number: 1 (DW_TAG_member)
    <e8266>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <e826a>   DW_AT_decl_file   : 10
    <e826b>   DW_AT_decl_line   : 89
    <e826c>   DW_AT_decl_column : 25
    <e826d>   DW_AT_type        : <0xe815a>
    <e8271>   DW_AT_data_member_location: 64
 <2><e8272>: Abbrev Number: 1 (DW_TAG_member)
    <e8273>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <e8277>   DW_AT_decl_file   : 10
    <e8278>   DW_AT_decl_line   : 90
    <e8279>   DW_AT_decl_column : 25
    <e827a>   DW_AT_type        : <0xe8184>
    <e827e>   DW_AT_data_member_location: 72
 <2><e827f>: Abbrev Number: 1 (DW_TAG_member)
    <e8280>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <e8284>   DW_AT_decl_file   : 10
    <e8285>   DW_AT_decl_line   : 91
    <e8286>   DW_AT_decl_column : 25
    <e8287>   DW_AT_type        : <0xe8190>
    <e828b>   DW_AT_data_member_location: 80
 <2><e828c>: Abbrev Number: 1 (DW_TAG_member)
    <e828d>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <e8291>   DW_AT_decl_file   : 10
    <e8292>   DW_AT_decl_line   : 92
    <e8293>   DW_AT_decl_column : 25
    <e8294>   DW_AT_type        : <0xe81ba>
    <e8298>   DW_AT_data_member_location: 88
 <2><e8299>: Abbrev Number: 1 (DW_TAG_member)
    <e829a>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <e829e>   DW_AT_decl_file   : 10
    <e829f>   DW_AT_decl_line   : 93
    <e82a0>   DW_AT_decl_column : 25
    <e82a1>   DW_AT_type        : <0xe7f3b>
    <e82a5>   DW_AT_data_member_location: 96
 <2><e82a6>: Abbrev Number: 1 (DW_TAG_member)
    <e82a7>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <e82ab>   DW_AT_decl_file   : 10
    <e82ac>   DW_AT_decl_line   : 94
    <e82ad>   DW_AT_decl_column : 25
    <e82ae>   DW_AT_type        : <0xe81e4>
    <e82b2>   DW_AT_data_member_location: 104
 <2><e82b3>: Abbrev Number: 0
 <1><e82b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <e82b5>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <e82b9>   DW_AT_decl_file   : 10
    <e82ba>   DW_AT_decl_line   : 95
    <e82bb>   DW_AT_decl_column : 3
    <e82bc>   DW_AT_type        : <0xe81f0>
 <1><e82c0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e82c1>   DW_AT_byte_size   : 8
    <e82c1>   DW_AT_type        : <0xe82b4>
 <1><e82c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e82c6>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <e82ca>   DW_AT_decl_file   : 10
    <e82cb>   DW_AT_decl_line   : 117
    <e82cc>   DW_AT_decl_column : 3
    <e82cd>   DW_AT_type        : <0xe7f65>
 <1><e82d1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e82d2>   DW_AT_byte_size   : 8
    <e82d2>   DW_AT_type        : <0xe82c5>
 <1><e82d6>: Abbrev Number: 23 (DW_TAG_subprogram)
    <e82d7>   DW_AT_external    : 1
    <e82d7>   DW_AT_name        : (indirect string, offset: 0x1d6a4): ftello
    <e82db>   DW_AT_decl_file   : 11
    <e82dc>   DW_AT_decl_line   : 723
    <e82de>   DW_AT_decl_column : 18
    <e82df>   DW_AT_linkage_name: (indirect string, offset: 0x1d691): ftello64
    <e82e3>   DW_AT_prototyped  : 1
    <e82e3>   DW_AT_type        : <0xe7bbe>
    <e82e7>   DW_AT_declaration : 1
    <e82e7>   DW_AT_sibling     : <0xe82f1>
 <2><e82eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e82ec>   DW_AT_type        : <0xe7e21>
 <2><e82f0>: Abbrev Number: 0
 <1><e82f1>: Abbrev Number: 24 (DW_TAG_subprogram)
    <e82f2>   DW_AT_external    : 1
    <e82f2>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <e82f6>   DW_AT_decl_file   : 9
    <e82f7>   DW_AT_decl_line   : 50
    <e82f8>   DW_AT_decl_column : 22
    <e82f9>   DW_AT_prototyped  : 1
    <e82f9>   DW_AT_type        : <0xe7ba4>
    <e82fd>   DW_AT_declaration : 1
    <e82fd>   DW_AT_sibling     : <0xe8307>
 <2><e8301>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8302>   DW_AT_type        : <0xe7ba4>
 <2><e8306>: Abbrev Number: 0
 <1><e8307>: Abbrev Number: 25 (DW_TAG_subprogram)
    <e8308>   DW_AT_external    : 1
    <e8308>   DW_AT_name        : (indirect string, offset: 0x1d55c): fb_DevFileTell
    <e830c>   DW_AT_decl_file   : 1
    <e830d>   DW_AT_decl_line   : 5
    <e830e>   DW_AT_decl_column : 5
    <e830f>   DW_AT_prototyped  : 1
    <e830f>   DW_AT_type        : <0xe7ba4>
    <e8313>   DW_AT_low_pc      : 0x479890
    <e831b>   DW_AT_high_pc     : 0x2a
    <e8323>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e8325>   DW_AT_call_all_calls: 1
 <2><e8325>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e8326>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <e832a>   DW_AT_decl_file   : 1
    <e832a>   DW_AT_decl_line   : 5
    <e832a>   DW_AT_decl_column : 30
    <e832b>   DW_AT_type        : <0xe82d1>
    <e832f>   DW_AT_location    : 0x43a06 (location list)
    <e8333>   DW_AT_GNU_locviews: 0x43a02
 <2><e8337>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e8338>   DW_AT_name        : (indirect string, offset: 0x1d6b5): pOffset
    <e833c>   DW_AT_decl_file   : 1
    <e833c>   DW_AT_decl_line   : 5
    <e833c>   DW_AT_decl_column : 48
    <e833d>   DW_AT_type        : <0xe80a3>
    <e8341>   DW_AT_location    : 0x43a1e (location list)
    <e8345>   DW_AT_GNU_locviews: 0x43a14
 <2><e8349>: Abbrev Number: 26 (DW_TAG_variable)
    <e834a>   DW_AT_name        : fp
    <e834d>   DW_AT_decl_file   : 1
    <e834e>   DW_AT_decl_line   : 7
    <e834f>   DW_AT_decl_column : 8
    <e8350>   DW_AT_type        : <0xe7e21>
    <e8354>   DW_AT_location    : 0x43a44 (location list)
    <e8358>   DW_AT_GNU_locviews: 0x43a3e
 <2><e835c>: Abbrev Number: 27 (DW_TAG_call_site)
    <e835d>   DW_AT_call_return_pc: 0x4798a2
    <e8365>   DW_AT_call_origin : <0xe82d6>
 <2><e8369>: Abbrev Number: 28 (DW_TAG_call_site)
    <e836a>   DW_AT_call_return_pc: 0x4798ad
    <e8372>   DW_AT_call_tail_call: 1
    <e8372>   DW_AT_call_origin : <0xe82f1>
    <e8376>   DW_AT_sibling     : <0xe8380>
 <3><e837a>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <e837b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e837d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e837f>: Abbrev Number: 0
 <2><e8380>: Abbrev Number: 29 (DW_TAG_call_site)
    <e8381>   DW_AT_call_return_pc: 0x4798ba
    <e8389>   DW_AT_call_tail_call: 1
    <e8389>   DW_AT_call_origin : <0xe82f1>
 <3><e838d>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <e838e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e8390>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><e8392>: Abbrev Number: 0
 <2><e8393>: Abbrev Number: 0
 <1><e8394>: Abbrev Number: 0
  Compilation Unit @ offset 0xe8395:
   Length:        0x865 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x18587
   Pointer Size:  8
 <0><e83a1>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <e83a2>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <e83a6>   DW_AT_language    : 29	(C11)
    <e83a7>   DW_AT_name        : (indirect line string, offset: 0x184e): src/rtlib/dev_file_unlock.c
    <e83ab>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <e83af>   DW_AT_low_pc      : 0x4798c0
    <e83b7>   DW_AT_high_pc     : 0x22
    <e83bf>   DW_AT_stmt_list   : 0x6f37a
 <1><e83c3>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83c4>   DW_AT_byte_size   : 1
    <e83c5>   DW_AT_encoding    : 8	(unsigned char)
    <e83c6>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><e83ca>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83cb>   DW_AT_byte_size   : 2
    <e83cc>   DW_AT_encoding    : 7	(unsigned)
    <e83cd>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><e83d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83d2>   DW_AT_byte_size   : 4
    <e83d3>   DW_AT_encoding    : 7	(unsigned)
    <e83d4>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><e83d8>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83d9>   DW_AT_byte_size   : 8
    <e83da>   DW_AT_encoding    : 7	(unsigned)
    <e83db>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><e83df>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83e0>   DW_AT_byte_size   : 1
    <e83e1>   DW_AT_encoding    : 6	(signed char)
    <e83e2>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><e83e6>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83e7>   DW_AT_byte_size   : 2
    <e83e8>   DW_AT_encoding    : 5	(signed)
    <e83e9>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><e83ed>: Abbrev Number: 17 (DW_TAG_base_type)
    <e83ee>   DW_AT_byte_size   : 4
    <e83ef>   DW_AT_encoding    : 5	(signed)
    <e83f0>   DW_AT_name        : int
 <1><e83f4>: Abbrev Number: 6 (DW_TAG_base_type)
    <e83f5>   DW_AT_byte_size   : 8
    <e83f6>   DW_AT_encoding    : 5	(signed)
    <e83f7>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><e83fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <e83fc>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <e8400>   DW_AT_decl_file   : 2
    <e8401>   DW_AT_decl_line   : 152
    <e8402>   DW_AT_decl_column : 25
    <e8403>   DW_AT_type        : <0xe83f4>
 <1><e8407>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8408>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <e840c>   DW_AT_decl_file   : 2
    <e840d>   DW_AT_decl_line   : 153
    <e840e>   DW_AT_decl_column : 27
    <e840f>   DW_AT_type        : <0xe83f4>
 <1><e8413>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e8414>   DW_AT_byte_size   : 8
 <1><e8415>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8416>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <e841a>   DW_AT_decl_file   : 2
    <e841b>   DW_AT_decl_line   : 194
    <e841c>   DW_AT_decl_column : 27
    <e841d>   DW_AT_type        : <0xe83f4>
 <1><e8421>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8422>   DW_AT_byte_size   : 8
    <e8422>   DW_AT_type        : <0xe8426>
 <1><e8426>: Abbrev Number: 6 (DW_TAG_base_type)
    <e8427>   DW_AT_byte_size   : 1
    <e8428>   DW_AT_encoding    : 6	(signed char)
    <e8429>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><e842d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e842e>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <e8432>   DW_AT_decl_file   : 3
    <e8433>   DW_AT_decl_line   : 209
    <e8434>   DW_AT_decl_column : 23
    <e8435>   DW_AT_type        : <0xe83d8>
 <1><e8439>: Abbrev Number: 19 (DW_TAG_typedef)
    <e843a>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <e843e>   DW_AT_decl_file   : 3
    <e843f>   DW_AT_decl_line   : 321
    <e8441>   DW_AT_decl_column : 24
    <e8442>   DW_AT_type        : <0xe83ed>
 <1><e8446>: Abbrev Number: 20 (DW_TAG_const_type)
    <e8447>   DW_AT_type        : <0xe8439>
 <1><e844b>: Abbrev Number: 6 (DW_TAG_base_type)
    <e844c>   DW_AT_byte_size   : 8
    <e844d>   DW_AT_encoding    : 5	(signed)
    <e844e>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e8452>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8453>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e8457>   DW_AT_decl_file   : 4
    <e8458>   DW_AT_decl_line   : 87
    <e8459>   DW_AT_decl_column : 19
    <e845a>   DW_AT_type        : <0xe8407>
 <1><e845e>: Abbrev Number: 4 (DW_TAG_typedef)
    <e845f>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <e8463>   DW_AT_decl_file   : 4
    <e8464>   DW_AT_decl_line   : 108
    <e8465>   DW_AT_decl_column : 19
    <e8466>   DW_AT_type        : <0xe8415>
 <1><e846a>: Abbrev Number: 6 (DW_TAG_base_type)
    <e846b>   DW_AT_byte_size   : 8
    <e846c>   DW_AT_encoding    : 7	(unsigned)
    <e846d>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e8471>: Abbrev Number: 9 (DW_TAG_array_type)
    <e8472>   DW_AT_type        : <0xe8426>
    <e8476>   DW_AT_sibling     : <0xe8481>
 <2><e847a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e847b>   DW_AT_type        : <0xe83d8>
    <e847f>   DW_AT_upper_bound : 3
 <2><e8480>: Abbrev Number: 0
 <1><e8481>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8482>   DW_AT_byte_size   : 8
    <e8482>   DW_AT_type        : <0xe8486>
 <1><e8486>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><e8487>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e8488>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <e848c>   DW_AT_byte_size   : 216
    <e848d>   DW_AT_decl_file   : 5
    <e848e>   DW_AT_decl_line   : 49
    <e848f>   DW_AT_decl_column : 8
    <e8490>   DW_AT_sibling     : <0xe860e>
 <2><e8494>: Abbrev Number: 1 (DW_TAG_member)
    <e8495>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <e8499>   DW_AT_decl_file   : 5
    <e849a>   DW_AT_decl_line   : 51
    <e849b>   DW_AT_decl_column : 7
    <e849c>   DW_AT_type        : <0xe83ed>
    <e84a0>   DW_AT_data_member_location: 0
 <2><e84a1>: Abbrev Number: 1 (DW_TAG_member)
    <e84a2>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <e84a6>   DW_AT_decl_file   : 5
    <e84a7>   DW_AT_decl_line   : 54
    <e84a8>   DW_AT_decl_column : 9
    <e84a9>   DW_AT_type        : <0xe8421>
    <e84ad>   DW_AT_data_member_location: 8
 <2><e84ae>: Abbrev Number: 1 (DW_TAG_member)
    <e84af>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <e84b3>   DW_AT_decl_file   : 5
    <e84b4>   DW_AT_decl_line   : 55
    <e84b5>   DW_AT_decl_column : 9
    <e84b6>   DW_AT_type        : <0xe8421>
    <e84ba>   DW_AT_data_member_location: 16
 <2><e84bb>: Abbrev Number: 1 (DW_TAG_member)
    <e84bc>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <e84c0>   DW_AT_decl_file   : 5
    <e84c1>   DW_AT_decl_line   : 56
    <e84c2>   DW_AT_decl_column : 9
    <e84c3>   DW_AT_type        : <0xe8421>
    <e84c7>   DW_AT_data_member_location: 24
 <2><e84c8>: Abbrev Number: 1 (DW_TAG_member)
    <e84c9>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <e84cd>   DW_AT_decl_file   : 5
    <e84ce>   DW_AT_decl_line   : 57
    <e84cf>   DW_AT_decl_column : 9
    <e84d0>   DW_AT_type        : <0xe8421>
    <e84d4>   DW_AT_data_member_location: 32
 <2><e84d5>: Abbrev Number: 1 (DW_TAG_member)
    <e84d6>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <e84da>   DW_AT_decl_file   : 5
    <e84db>   DW_AT_decl_line   : 58
    <e84dc>   DW_AT_decl_column : 9
    <e84dd>   DW_AT_type        : <0xe8421>
    <e84e1>   DW_AT_data_member_location: 40
 <2><e84e2>: Abbrev Number: 1 (DW_TAG_member)
    <e84e3>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <e84e7>   DW_AT_decl_file   : 5
    <e84e8>   DW_AT_decl_line   : 59
    <e84e9>   DW_AT_decl_column : 9
    <e84ea>   DW_AT_type        : <0xe8421>
    <e84ee>   DW_AT_data_member_location: 48
 <2><e84ef>: Abbrev Number: 1 (DW_TAG_member)
    <e84f0>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <e84f4>   DW_AT_decl_file   : 5
    <e84f5>   DW_AT_decl_line   : 60
    <e84f6>   DW_AT_decl_column : 9
    <e84f7>   DW_AT_type        : <0xe8421>
    <e84fb>   DW_AT_data_member_location: 56
 <2><e84fc>: Abbrev Number: 1 (DW_TAG_member)
    <e84fd>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <e8501>   DW_AT_decl_file   : 5
    <e8502>   DW_AT_decl_line   : 61
    <e8503>   DW_AT_decl_column : 9
    <e8504>   DW_AT_type        : <0xe8421>
    <e8508>   DW_AT_data_member_location: 64
 <2><e8509>: Abbrev Number: 1 (DW_TAG_member)
    <e850a>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <e850e>   DW_AT_decl_file   : 5
    <e850f>   DW_AT_decl_line   : 64
    <e8510>   DW_AT_decl_column : 9
    <e8511>   DW_AT_type        : <0xe8421>
    <e8515>   DW_AT_data_member_location: 72
 <2><e8516>: Abbrev Number: 1 (DW_TAG_member)
    <e8517>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <e851b>   DW_AT_decl_file   : 5
    <e851c>   DW_AT_decl_line   : 65
    <e851d>   DW_AT_decl_column : 9
    <e851e>   DW_AT_type        : <0xe8421>
    <e8522>   DW_AT_data_member_location: 80
 <2><e8523>: Abbrev Number: 1 (DW_TAG_member)
    <e8524>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <e8528>   DW_AT_decl_file   : 5
    <e8529>   DW_AT_decl_line   : 66
    <e852a>   DW_AT_decl_column : 9
    <e852b>   DW_AT_type        : <0xe8421>
    <e852f>   DW_AT_data_member_location: 88
 <2><e8530>: Abbrev Number: 1 (DW_TAG_member)
    <e8531>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <e8535>   DW_AT_decl_file   : 5
    <e8536>   DW_AT_decl_line   : 68
    <e8537>   DW_AT_decl_column : 22
    <e8538>   DW_AT_type        : <0xe8627>
    <e853c>   DW_AT_data_member_location: 96
 <2><e853d>: Abbrev Number: 1 (DW_TAG_member)
    <e853e>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <e8542>   DW_AT_decl_file   : 5
    <e8543>   DW_AT_decl_line   : 70
    <e8544>   DW_AT_decl_column : 20
    <e8545>   DW_AT_type        : <0xe862c>
    <e8549>   DW_AT_data_member_location: 104
 <2><e854a>: Abbrev Number: 1 (DW_TAG_member)
    <e854b>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <e854f>   DW_AT_decl_file   : 5
    <e8550>   DW_AT_decl_line   : 72
    <e8551>   DW_AT_decl_column : 7
    <e8552>   DW_AT_type        : <0xe83ed>
    <e8556>   DW_AT_data_member_location: 112
 <2><e8557>: Abbrev Number: 1 (DW_TAG_member)
    <e8558>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <e855c>   DW_AT_decl_file   : 5
    <e855d>   DW_AT_decl_line   : 73
    <e855e>   DW_AT_decl_column : 7
    <e855f>   DW_AT_type        : <0xe83ed>
    <e8563>   DW_AT_data_member_location: 116
 <2><e8564>: Abbrev Number: 1 (DW_TAG_member)
    <e8565>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <e8569>   DW_AT_decl_file   : 5
    <e856a>   DW_AT_decl_line   : 74
    <e856b>   DW_AT_decl_column : 11
    <e856c>   DW_AT_type        : <0xe83fb>
    <e8570>   DW_AT_data_member_location: 120
 <2><e8571>: Abbrev Number: 1 (DW_TAG_member)
    <e8572>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <e8576>   DW_AT_decl_file   : 5
    <e8577>   DW_AT_decl_line   : 77
    <e8578>   DW_AT_decl_column : 18
    <e8579>   DW_AT_type        : <0xe83ca>
    <e857d>   DW_AT_data_member_location: 128
 <2><e857e>: Abbrev Number: 1 (DW_TAG_member)
    <e857f>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <e8583>   DW_AT_decl_file   : 5
    <e8584>   DW_AT_decl_line   : 78
    <e8585>   DW_AT_decl_column : 15
    <e8586>   DW_AT_type        : <0xe83df>
    <e858a>   DW_AT_data_member_location: 130
 <2><e858b>: Abbrev Number: 1 (DW_TAG_member)
    <e858c>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <e8590>   DW_AT_decl_file   : 5
    <e8591>   DW_AT_decl_line   : 79
    <e8592>   DW_AT_decl_column : 8
    <e8593>   DW_AT_type        : <0xe8631>
    <e8597>   DW_AT_data_member_location: 131
 <2><e8598>: Abbrev Number: 1 (DW_TAG_member)
    <e8599>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <e859d>   DW_AT_decl_file   : 5
    <e859e>   DW_AT_decl_line   : 81
    <e859f>   DW_AT_decl_column : 15
    <e85a0>   DW_AT_type        : <0xe8641>
    <e85a4>   DW_AT_data_member_location: 136
 <2><e85a5>: Abbrev Number: 1 (DW_TAG_member)
    <e85a6>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <e85aa>   DW_AT_decl_file   : 5
    <e85ab>   DW_AT_decl_line   : 89
    <e85ac>   DW_AT_decl_column : 13
    <e85ad>   DW_AT_type        : <0xe8407>
    <e85b1>   DW_AT_data_member_location: 144
 <2><e85b2>: Abbrev Number: 1 (DW_TAG_member)
    <e85b3>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <e85b7>   DW_AT_decl_file   : 5
    <e85b8>   DW_AT_decl_line   : 91
    <e85b9>   DW_AT_decl_column : 23
    <e85ba>   DW_AT_type        : <0xe864b>
    <e85be>   DW_AT_data_member_location: 152
 <2><e85bf>: Abbrev Number: 1 (DW_TAG_member)
    <e85c0>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <e85c4>   DW_AT_decl_file   : 5
    <e85c5>   DW_AT_decl_line   : 92
    <e85c6>   DW_AT_decl_column : 25
    <e85c7>   DW_AT_type        : <0xe8655>
    <e85cb>   DW_AT_data_member_location: 160
 <2><e85cc>: Abbrev Number: 1 (DW_TAG_member)
    <e85cd>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <e85d1>   DW_AT_decl_file   : 5
    <e85d2>   DW_AT_decl_line   : 93
    <e85d3>   DW_AT_decl_column : 20
    <e85d4>   DW_AT_type        : <0xe862c>
    <e85d8>   DW_AT_data_member_location: 168
 <2><e85d9>: Abbrev Number: 1 (DW_TAG_member)
    <e85da>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <e85de>   DW_AT_decl_file   : 5
    <e85df>   DW_AT_decl_line   : 94
    <e85e0>   DW_AT_decl_column : 9
    <e85e1>   DW_AT_type        : <0xe8413>
    <e85e5>   DW_AT_data_member_location: 176
 <2><e85e6>: Abbrev Number: 1 (DW_TAG_member)
    <e85e7>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <e85eb>   DW_AT_decl_file   : 5
    <e85ec>   DW_AT_decl_line   : 95
    <e85ed>   DW_AT_decl_column : 10
    <e85ee>   DW_AT_type        : <0xe842d>
    <e85f2>   DW_AT_data_member_location: 184
 <2><e85f3>: Abbrev Number: 1 (DW_TAG_member)
    <e85f4>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <e85f8>   DW_AT_decl_file   : 5
    <e85f9>   DW_AT_decl_line   : 96
    <e85fa>   DW_AT_decl_column : 7
    <e85fb>   DW_AT_type        : <0xe83ed>
    <e85ff>   DW_AT_data_member_location: 192
 <2><e8600>: Abbrev Number: 1 (DW_TAG_member)
    <e8601>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <e8605>   DW_AT_decl_file   : 5
    <e8606>   DW_AT_decl_line   : 98
    <e8607>   DW_AT_decl_column : 8
    <e8608>   DW_AT_type        : <0xe865a>
    <e860c>   DW_AT_data_member_location: 196
 <2><e860d>: Abbrev Number: 0
 <1><e860e>: Abbrev Number: 4 (DW_TAG_typedef)
    <e860f>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <e8613>   DW_AT_decl_file   : 6
    <e8614>   DW_AT_decl_line   : 7
    <e8615>   DW_AT_decl_column : 25
    <e8616>   DW_AT_type        : <0xe8487>
 <1><e861a>: Abbrev Number: 22 (DW_TAG_typedef)
    <e861b>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <e861f>   DW_AT_decl_file   : 5
    <e8620>   DW_AT_decl_line   : 43
    <e8621>   DW_AT_decl_column : 14
 <1><e8622>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e8623>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <e8627>   DW_AT_declaration : 1
 <1><e8627>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8628>   DW_AT_byte_size   : 8
    <e8628>   DW_AT_type        : <0xe8622>
 <1><e862c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e862d>   DW_AT_byte_size   : 8
    <e862d>   DW_AT_type        : <0xe8487>
 <1><e8631>: Abbrev Number: 9 (DW_TAG_array_type)
    <e8632>   DW_AT_type        : <0xe8426>
    <e8636>   DW_AT_sibling     : <0xe8641>
 <2><e863a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e863b>   DW_AT_type        : <0xe83d8>
    <e863f>   DW_AT_upper_bound : 0
 <2><e8640>: Abbrev Number: 0
 <1><e8641>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8642>   DW_AT_byte_size   : 8
    <e8642>   DW_AT_type        : <0xe861a>
 <1><e8646>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e8647>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <e864b>   DW_AT_declaration : 1
 <1><e864b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e864c>   DW_AT_byte_size   : 8
    <e864c>   DW_AT_type        : <0xe8646>
 <1><e8650>: Abbrev Number: 11 (DW_TAG_structure_type)
    <e8651>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <e8655>   DW_AT_declaration : 1
 <1><e8655>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8656>   DW_AT_byte_size   : 8
    <e8656>   DW_AT_type        : <0xe8650>
 <1><e865a>: Abbrev Number: 9 (DW_TAG_array_type)
    <e865b>   DW_AT_type        : <0xe8426>
    <e865f>   DW_AT_sibling     : <0xe866a>
 <2><e8663>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e8664>   DW_AT_type        : <0xe83d8>
    <e8668>   DW_AT_upper_bound : 19
 <2><e8669>: Abbrev Number: 0
 <1><e866a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e866b>   DW_AT_byte_size   : 8
    <e866b>   DW_AT_type        : <0xe860e>
 <1><e866f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8670>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <e8674>   DW_AT_decl_file   : 7
    <e8675>   DW_AT_decl_line   : 22
    <e8676>   DW_AT_decl_column : 15
    <e8677>   DW_AT_type        : <0xe8452>
 <1><e867b>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <e867c>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <e8680>   DW_AT_encoding    : 7	(void)
    <e8680>   DW_AT_byte_size   : 4
    <e8680>   DW_AT_type        : <0xe83d1>
    <e8684>   DW_AT_decl_file   : 9
    <e8685>   DW_AT_decl_line   : 1
    <e8686>   DW_AT_decl_column : 14
    <e8686>   DW_AT_sibling     : <0xe86fd>
 <2><e868a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e868b>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <e868f>   DW_AT_const_value : 0
 <2><e8690>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e8691>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <e8695>   DW_AT_const_value : 1
 <2><e8696>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e8697>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <e869b>   DW_AT_const_value : 2
 <2><e869c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e869d>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <e86a1>   DW_AT_const_value : 3
 <2><e86a2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86a3>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <e86a7>   DW_AT_const_value : 4
 <2><e86a8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86a9>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <e86ad>   DW_AT_const_value : 5
 <2><e86ae>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86af>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <e86b3>   DW_AT_const_value : 6
 <2><e86b4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86b5>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <e86b9>   DW_AT_const_value : 7
 <2><e86ba>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86bb>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <e86bf>   DW_AT_const_value : 8
 <2><e86c0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86c1>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <e86c5>   DW_AT_const_value : 9
 <2><e86c6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86c7>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <e86cb>   DW_AT_const_value : 10
 <2><e86cc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86cd>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <e86d1>   DW_AT_const_value : 11
 <2><e86d2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86d3>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <e86d7>   DW_AT_const_value : 12
 <2><e86d8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e86d9>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
