 <2><ec852>: Abbrev Number: 13 (DW_TAG_enumerator)
    <ec853>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <ec857>   DW_AT_const_value : 3
 <2><ec858>: Abbrev Number: 0
 <1><ec859>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec85a>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <ec85e>   DW_AT_decl_file   : 8
    <ec85f>   DW_AT_decl_line   : 30
    <ec860>   DW_AT_decl_column : 3
    <ec861>   DW_AT_type        : <0xec82e>
 <1><ec865>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec866>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <ec86a>   DW_AT_decl_file   : 8
    <ec86b>   DW_AT_decl_line   : 54
    <ec86c>   DW_AT_decl_column : 15
    <ec86d>   DW_AT_type        : <0xec871>
 <1><ec871>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec872>   DW_AT_byte_size   : 8
    <ec872>   DW_AT_type        : <0xec876>
 <1><ec876>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ec877>   DW_AT_prototyped  : 1
    <ec877>   DW_AT_type        : <0xec735>
    <ec87b>   DW_AT_sibling     : <0xec88a>
 <2><ec87f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec880>   DW_AT_type        : <0xec88a>
 <2><ec884>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec885>   DW_AT_type        : <0xec735>
 <2><ec889>: Abbrev Number: 0
 <1><ec88a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec88b>   DW_AT_byte_size   : 8
    <ec88b>   DW_AT_type        : <0xec88f>
 <1><ec88f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ec890>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <ec894>   DW_AT_byte_size   : 80
    <ec895>   DW_AT_decl_file   : 8
    <ec896>   DW_AT_decl_line   : 97
    <ec897>   DW_AT_decl_column : 16
    <ec898>   DW_AT_sibling     : <0xec953>
 <2><ec89c>: Abbrev Number: 2 (DW_TAG_member)
    <ec89d>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <ec8a1>   DW_AT_decl_file   : 8
    <ec8a2>   DW_AT_decl_line   : 98
    <ec8a3>   DW_AT_decl_column : 21
    <ec8a4>   DW_AT_type        : <0xec735>
    <ec8a8>   DW_AT_data_member_location: 0
 <2><ec8a9>: Abbrev Number: 9 (DW_TAG_member)
    <ec8aa>   DW_AT_name        : len
    <ec8ae>   DW_AT_decl_file   : 8
    <ec8af>   DW_AT_decl_line   : 99
    <ec8b0>   DW_AT_decl_column : 21
    <ec8b1>   DW_AT_type        : <0xec735>
    <ec8b5>   DW_AT_data_member_location: 4
 <2><ec8b6>: Abbrev Number: 2 (DW_TAG_member)
    <ec8b7>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <ec8bb>   DW_AT_decl_file   : 8
    <ec8bc>   DW_AT_decl_line   : 100
    <ec8bd>   DW_AT_decl_column : 21
    <ec8be>   DW_AT_type        : <0xec859>
    <ec8c2>   DW_AT_data_member_location: 8
 <2><ec8c3>: Abbrev Number: 2 (DW_TAG_member)
    <ec8c4>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ec8c8>   DW_AT_decl_file   : 8
    <ec8c9>   DW_AT_decl_line   : 101
    <ec8ca>   DW_AT_decl_column : 21
    <ec8cb>   DW_AT_type        : <0xec7c8>
    <ec8cf>   DW_AT_data_member_location: 16
 <2><ec8d0>: Abbrev Number: 2 (DW_TAG_member)
    <ec8d1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ec8d5>   DW_AT_decl_file   : 8
    <ec8d6>   DW_AT_decl_line   : 102
    <ec8d7>   DW_AT_decl_column : 21
    <ec8d8>   DW_AT_type        : <0xec735>
    <ec8dc>   DW_AT_data_member_location: 24
 <2><ec8dd>: Abbrev Number: 2 (DW_TAG_member)
    <ec8de>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <ec8e2>   DW_AT_decl_file   : 8
    <ec8e3>   DW_AT_decl_line   : 103
    <ec8e4>   DW_AT_decl_column : 21
    <ec8e5>   DW_AT_type        : <0xec735>
    <ec8e9>   DW_AT_data_member_location: 28
 <2><ec8ea>: Abbrev Number: 2 (DW_TAG_member)
    <ec8eb>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <ec8ef>   DW_AT_decl_file   : 8
    <ec8f0>   DW_AT_decl_line   : 104
    <ec8f1>   DW_AT_decl_column : 21
    <ec8f2>   DW_AT_type        : <0xec735>
    <ec8f6>   DW_AT_data_member_location: 32
 <2><ec8f7>: Abbrev Number: 2 (DW_TAG_member)
    <ec8f8>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <ec8fc>   DW_AT_decl_file   : 8
    <ec8fd>   DW_AT_decl_line   : 105
    <ec8fe>   DW_AT_decl_column : 21
    <ec8ff>   DW_AT_type        : <0xec719>
    <ec903>   DW_AT_data_member_location: 36
 <2><ec904>: Abbrev Number: 2 (DW_TAG_member)
    <ec905>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <ec909>   DW_AT_decl_file   : 8
    <ec90a>   DW_AT_decl_line   : 106
    <ec90b>   DW_AT_decl_column : 21
    <ec90c>   DW_AT_type        : <0xec719>
    <ec910>   DW_AT_data_member_location: 40
 <2><ec911>: Abbrev Number: 2 (DW_TAG_member)
    <ec912>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <ec916>   DW_AT_decl_file   : 8
    <ec917>   DW_AT_decl_line   : 109
    <ec918>   DW_AT_decl_column : 21
    <ec919>   DW_AT_type        : <0xec7ad>
    <ec91d>   DW_AT_data_member_location: 44
 <2><ec91e>: Abbrev Number: 2 (DW_TAG_member)
    <ec91f>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <ec923>   DW_AT_decl_file   : 8
    <ec924>   DW_AT_decl_line   : 110
    <ec925>   DW_AT_decl_column : 21
    <ec926>   DW_AT_type        : <0xec769>
    <ec92a>   DW_AT_data_member_location: 48
 <2><ec92b>: Abbrev Number: 2 (DW_TAG_member)
    <ec92c>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <ec930>   DW_AT_decl_file   : 8
    <ec931>   DW_AT_decl_line   : 112
    <ec932>   DW_AT_decl_column : 22
    <ec933>   DW_AT_type        : <0xecbeb>
    <ec937>   DW_AT_data_member_location: 56
 <2><ec938>: Abbrev Number: 2 (DW_TAG_member)
    <ec939>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <ec93d>   DW_AT_decl_file   : 8
    <ec93e>   DW_AT_decl_line   : 114
    <ec93f>   DW_AT_decl_column : 14
    <ec940>   DW_AT_type        : <0xec74f>
    <ec944>   DW_AT_data_member_location: 64
 <2><ec945>: Abbrev Number: 2 (DW_TAG_member)
    <ec946>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <ec94a>   DW_AT_decl_file   : 8
    <ec94b>   DW_AT_decl_line   : 116
    <ec94c>   DW_AT_decl_column : 22
    <ec94d>   DW_AT_type        : <0xec88a>
    <ec951>   DW_AT_data_member_location: 72
 <2><ec952>: Abbrev Number: 0
 <1><ec953>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec954>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <ec958>   DW_AT_decl_file   : 8
    <ec959>   DW_AT_decl_line   : 59
    <ec95a>   DW_AT_decl_column : 15
    <ec95b>   DW_AT_type        : <0xec95f>
 <1><ec95f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec960>   DW_AT_byte_size   : 8
    <ec960>   DW_AT_type        : <0xec964>
 <1><ec964>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ec965>   DW_AT_prototyped  : 1
    <ec965>   DW_AT_type        : <0xec735>
    <ec969>   DW_AT_sibling     : <0xec973>
 <2><ec96d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec96e>   DW_AT_type        : <0xec88a>
 <2><ec972>: Abbrev Number: 0
 <1><ec973>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec974>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <ec978>   DW_AT_decl_file   : 8
    <ec979>   DW_AT_decl_line   : 60
    <ec97a>   DW_AT_decl_column : 15
    <ec97b>   DW_AT_type        : <0xec95f>
 <1><ec97f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec980>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <ec984>   DW_AT_decl_file   : 8
    <ec985>   DW_AT_decl_line   : 61
    <ec986>   DW_AT_decl_column : 15
    <ec987>   DW_AT_type        : <0xec98b>
 <1><ec98b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec98c>   DW_AT_byte_size   : 8
    <ec98c>   DW_AT_type        : <0xec990>
 <1><ec990>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ec991>   DW_AT_prototyped  : 1
    <ec991>   DW_AT_type        : <0xec735>
    <ec995>   DW_AT_sibling     : <0xec9a9>
 <2><ec999>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec99a>   DW_AT_type        : <0xec88a>
 <2><ec99e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec99f>   DW_AT_type        : <0xec7c8>
 <2><ec9a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9a4>   DW_AT_type        : <0xec735>
 <2><ec9a8>: Abbrev Number: 0
 <1><ec9a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec9aa>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <ec9ae>   DW_AT_decl_file   : 8
    <ec9af>   DW_AT_decl_line   : 62
    <ec9b0>   DW_AT_decl_column : 15
    <ec9b1>   DW_AT_type        : <0xec9b5>
 <1><ec9b5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec9b6>   DW_AT_byte_size   : 8
    <ec9b6>   DW_AT_type        : <0xec9ba>
 <1><ec9ba>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ec9bb>   DW_AT_prototyped  : 1
    <ec9bb>   DW_AT_type        : <0xec735>
    <ec9bf>   DW_AT_sibling     : <0xec9ce>
 <2><ec9c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9c4>   DW_AT_type        : <0xec88a>
 <2><ec9c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9c9>   DW_AT_type        : <0xec9ce>
 <2><ec9cd>: Abbrev Number: 0
 <1><ec9ce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec9cf>   DW_AT_byte_size   : 8
    <ec9cf>   DW_AT_type        : <0xec7c8>
 <1><ec9d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec9d4>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <ec9d8>   DW_AT_decl_file   : 8
    <ec9d9>   DW_AT_decl_line   : 63
    <ec9da>   DW_AT_decl_column : 15
    <ec9db>   DW_AT_type        : <0xec9df>
 <1><ec9df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec9e0>   DW_AT_byte_size   : 8
    <ec9e0>   DW_AT_type        : <0xec9e4>
 <1><ec9e4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ec9e5>   DW_AT_prototyped  : 1
    <ec9e5>   DW_AT_type        : <0xec735>
    <ec9e9>   DW_AT_sibling     : <0xec9fd>
 <2><ec9ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9ee>   DW_AT_type        : <0xec88a>
 <2><ec9f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9f3>   DW_AT_type        : <0xec74f>
 <2><ec9f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ec9f8>   DW_AT_type        : <0xec9fd>
 <2><ec9fc>: Abbrev Number: 0
 <1><ec9fd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ec9fe>   DW_AT_byte_size   : 8
    <ec9fe>   DW_AT_type        : <0xec769>
 <1><eca02>: Abbrev Number: 3 (DW_TAG_typedef)
    <eca03>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <eca07>   DW_AT_decl_file   : 8
    <eca08>   DW_AT_decl_line   : 65
    <eca09>   DW_AT_decl_column : 15
    <eca0a>   DW_AT_type        : <0xeca0e>
 <1><eca0e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eca0f>   DW_AT_byte_size   : 8
    <eca0f>   DW_AT_type        : <0xeca13>
 <1><eca13>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <eca14>   DW_AT_prototyped  : 1
    <eca14>   DW_AT_type        : <0xec735>
    <eca18>   DW_AT_sibling     : <0xeca2c>
 <2><eca1c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca1d>   DW_AT_type        : <0xec88a>
 <2><eca21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca22>   DW_AT_type        : <0xec829>
 <2><eca26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca27>   DW_AT_type        : <0xec9fd>
 <2><eca2b>: Abbrev Number: 0
 <1><eca2c>: Abbrev Number: 3 (DW_TAG_typedef)
    <eca2d>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <eca31>   DW_AT_decl_file   : 8
    <eca32>   DW_AT_decl_line   : 67
    <eca33>   DW_AT_decl_column : 15
    <eca34>   DW_AT_type        : <0xeca38>
 <1><eca38>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eca39>   DW_AT_byte_size   : 8
    <eca39>   DW_AT_type        : <0xeca3d>
 <1><eca3d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <eca3e>   DW_AT_prototyped  : 1
    <eca3e>   DW_AT_type        : <0xec735>
    <eca42>   DW_AT_sibling     : <0xeca56>
 <2><eca46>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca47>   DW_AT_type        : <0xec88a>
 <2><eca4b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca4c>   DW_AT_type        : <0xec7bd>
 <2><eca50>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca51>   DW_AT_type        : <0xec769>
 <2><eca55>: Abbrev Number: 0
 <1><eca56>: Abbrev Number: 3 (DW_TAG_typedef)
    <eca57>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <eca5b>   DW_AT_decl_file   : 8
    <eca5c>   DW_AT_decl_line   : 69
    <eca5d>   DW_AT_decl_column : 15
    <eca5e>   DW_AT_type        : <0xeca62>
 <1><eca62>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eca63>   DW_AT_byte_size   : 8
    <eca63>   DW_AT_type        : <0xeca67>
 <1><eca67>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <eca68>   DW_AT_prototyped  : 1
    <eca68>   DW_AT_type        : <0xec735>
    <eca6c>   DW_AT_sibling     : <0xeca80>
 <2><eca70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca71>   DW_AT_type        : <0xec88a>
 <2><eca75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca76>   DW_AT_type        : <0xeca80>
 <2><eca7a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eca7b>   DW_AT_type        : <0xec769>
 <2><eca7f>: Abbrev Number: 0
 <1><eca80>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eca81>   DW_AT_byte_size   : 8
    <eca81>   DW_AT_type        : <0xec782>
 <1><eca85>: Abbrev Number: 3 (DW_TAG_typedef)
    <eca86>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <eca8a>   DW_AT_decl_file   : 8
    <eca8b>   DW_AT_decl_line   : 71
    <eca8c>   DW_AT_decl_column : 15
    <eca8d>   DW_AT_type        : <0xeca91>
 <1><eca91>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eca92>   DW_AT_byte_size   : 8
    <eca92>   DW_AT_type        : <0xeca96>
 <1><eca96>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <eca97>   DW_AT_prototyped  : 1
    <eca97>   DW_AT_type        : <0xec735>
    <eca9b>   DW_AT_sibling     : <0xecaaf>
 <2><eca9f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecaa0>   DW_AT_type        : <0xec88a>
 <2><ecaa4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecaa5>   DW_AT_type        : <0xec7c8>
 <2><ecaa9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecaaa>   DW_AT_type        : <0xec7c8>
 <2><ecaae>: Abbrev Number: 0
 <1><ecaaf>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecab0>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <ecab4>   DW_AT_decl_file   : 8
    <ecab5>   DW_AT_decl_line   : 73
    <ecab6>   DW_AT_decl_column : 15
    <ecab7>   DW_AT_type        : <0xeca91>
 <1><ecabb>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecabc>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <ecac0>   DW_AT_decl_file   : 8
    <ecac1>   DW_AT_decl_line   : 75
    <ecac2>   DW_AT_decl_column : 15
    <ecac3>   DW_AT_type        : <0xecac7>
 <1><ecac7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecac8>   DW_AT_byte_size   : 8
    <ecac8>   DW_AT_type        : <0xecacc>
 <1><ecacc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecacd>   DW_AT_prototyped  : 1
    <ecacd>   DW_AT_type        : <0xec735>
    <ecad1>   DW_AT_sibling     : <0xecae0>
 <2><ecad5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecad6>   DW_AT_type        : <0xec88a>
 <2><ecada>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecadb>   DW_AT_type        : <0xecae0>
 <2><ecadf>: Abbrev Number: 0
 <1><ecae0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecae1>   DW_AT_byte_size   : 8
    <ecae1>   DW_AT_type        : <0xec80f>
 <1><ecae5>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecae6>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <ecaea>   DW_AT_decl_file   : 8
    <ecaeb>   DW_AT_decl_line   : 76
    <ecaec>   DW_AT_decl_column : 15
    <ecaed>   DW_AT_type        : <0xecaf1>
 <1><ecaf1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecaf2>   DW_AT_byte_size   : 8
    <ecaf2>   DW_AT_type        : <0xecaf6>
 <1><ecaf6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecaf7>   DW_AT_prototyped  : 1
    <ecaf7>   DW_AT_type        : <0xec735>
    <ecafb>   DW_AT_sibling     : <0xecb0f>
 <2><ecaff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecb00>   DW_AT_type        : <0xec88a>
 <2><ecb04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecb05>   DW_AT_type        : <0xec829>
 <2><ecb09>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecb0a>   DW_AT_type        : <0xec79a>
 <2><ecb0e>: Abbrev Number: 0
 <1><ecb0f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecb10>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <ecb14>   DW_AT_decl_file   : 8
    <ecb15>   DW_AT_decl_line   : 77
    <ecb16>   DW_AT_decl_column : 15
    <ecb17>   DW_AT_type        : <0xec95f>
 <1><ecb1b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ecb1c>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <ecb20>   DW_AT_byte_size   : 112
    <ecb21>   DW_AT_decl_file   : 8
    <ecb22>   DW_AT_decl_line   : 80
    <ecb23>   DW_AT_decl_column : 16
    <ecb24>   DW_AT_sibling     : <0xecbdf>
 <2><ecb28>: Abbrev Number: 2 (DW_TAG_member)
    <ecb29>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <ecb2d>   DW_AT_decl_file   : 8
    <ecb2e>   DW_AT_decl_line   : 81
    <ecb2f>   DW_AT_decl_column : 25
    <ecb30>   DW_AT_type        : <0xec953>
    <ecb34>   DW_AT_data_member_location: 0
 <2><ecb35>: Abbrev Number: 2 (DW_TAG_member)
    <ecb36>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <ecb3a>   DW_AT_decl_file   : 8
    <ecb3b>   DW_AT_decl_line   : 82
    <ecb3c>   DW_AT_decl_column : 25
    <ecb3d>   DW_AT_type        : <0xec973>
    <ecb41>   DW_AT_data_member_location: 8
 <2><ecb42>: Abbrev Number: 2 (DW_TAG_member)
    <ecb43>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <ecb47>   DW_AT_decl_file   : 8
    <ecb48>   DW_AT_decl_line   : 83
    <ecb49>   DW_AT_decl_column : 25
    <ecb4a>   DW_AT_type        : <0xec97f>
    <ecb4e>   DW_AT_data_member_location: 16
 <2><ecb4f>: Abbrev Number: 2 (DW_TAG_member)
    <ecb50>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <ecb54>   DW_AT_decl_file   : 8
    <ecb55>   DW_AT_decl_line   : 84
    <ecb56>   DW_AT_decl_column : 25
    <ecb57>   DW_AT_type        : <0xec9a9>
    <ecb5b>   DW_AT_data_member_location: 24
 <2><ecb5c>: Abbrev Number: 2 (DW_TAG_member)
    <ecb5d>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <ecb61>   DW_AT_decl_file   : 8
    <ecb62>   DW_AT_decl_line   : 85
    <ecb63>   DW_AT_decl_column : 25
    <ecb64>   DW_AT_type        : <0xec9d3>
    <ecb68>   DW_AT_data_member_location: 32
 <2><ecb69>: Abbrev Number: 2 (DW_TAG_member)
    <ecb6a>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <ecb6e>   DW_AT_decl_file   : 8
    <ecb6f>   DW_AT_decl_line   : 86
    <ecb70>   DW_AT_decl_column : 25
    <ecb71>   DW_AT_type        : <0xeca02>
    <ecb75>   DW_AT_data_member_location: 40
 <2><ecb76>: Abbrev Number: 2 (DW_TAG_member)
    <ecb77>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <ecb7b>   DW_AT_decl_file   : 8
    <ecb7c>   DW_AT_decl_line   : 87
    <ecb7d>   DW_AT_decl_column : 25
    <ecb7e>   DW_AT_type        : <0xeca2c>
    <ecb82>   DW_AT_data_member_location: 48
 <2><ecb83>: Abbrev Number: 2 (DW_TAG_member)
    <ecb84>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <ecb88>   DW_AT_decl_file   : 8
    <ecb89>   DW_AT_decl_line   : 88
    <ecb8a>   DW_AT_decl_column : 25
    <ecb8b>   DW_AT_type        : <0xeca56>
    <ecb8f>   DW_AT_data_member_location: 56
 <2><ecb90>: Abbrev Number: 2 (DW_TAG_member)
    <ecb91>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <ecb95>   DW_AT_decl_file   : 8
    <ecb96>   DW_AT_decl_line   : 89
    <ecb97>   DW_AT_decl_column : 25
    <ecb98>   DW_AT_type        : <0xeca85>
    <ecb9c>   DW_AT_data_member_location: 64
 <2><ecb9d>: Abbrev Number: 2 (DW_TAG_member)
    <ecb9e>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <ecba2>   DW_AT_decl_file   : 8
    <ecba3>   DW_AT_decl_line   : 90
    <ecba4>   DW_AT_decl_column : 25
    <ecba5>   DW_AT_type        : <0xecaaf>
    <ecba9>   DW_AT_data_member_location: 72
 <2><ecbaa>: Abbrev Number: 2 (DW_TAG_member)
    <ecbab>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <ecbaf>   DW_AT_decl_file   : 8
    <ecbb0>   DW_AT_decl_line   : 91
    <ecbb1>   DW_AT_decl_column : 25
    <ecbb2>   DW_AT_type        : <0xecabb>
    <ecbb6>   DW_AT_data_member_location: 80
 <2><ecbb7>: Abbrev Number: 2 (DW_TAG_member)
    <ecbb8>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <ecbbc>   DW_AT_decl_file   : 8
    <ecbbd>   DW_AT_decl_line   : 92
    <ecbbe>   DW_AT_decl_column : 25
    <ecbbf>   DW_AT_type        : <0xecae5>
    <ecbc3>   DW_AT_data_member_location: 88
 <2><ecbc4>: Abbrev Number: 2 (DW_TAG_member)
    <ecbc5>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <ecbc9>   DW_AT_decl_file   : 8
    <ecbca>   DW_AT_decl_line   : 93
    <ecbcb>   DW_AT_decl_column : 25
    <ecbcc>   DW_AT_type        : <0xec865>
    <ecbd0>   DW_AT_data_member_location: 96
 <2><ecbd1>: Abbrev Number: 2 (DW_TAG_member)
    <ecbd2>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <ecbd6>   DW_AT_decl_file   : 8
    <ecbd7>   DW_AT_decl_line   : 94
    <ecbd8>   DW_AT_decl_column : 25
    <ecbd9>   DW_AT_type        : <0xecb0f>
    <ecbdd>   DW_AT_data_member_location: 104
 <2><ecbde>: Abbrev Number: 0
 <1><ecbdf>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecbe0>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <ecbe4>   DW_AT_decl_file   : 8
    <ecbe5>   DW_AT_decl_line   : 95
    <ecbe6>   DW_AT_decl_column : 3
    <ecbe7>   DW_AT_type        : <0xecb1b>
 <1><ecbeb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecbec>   DW_AT_byte_size   : 8
    <ecbec>   DW_AT_type        : <0xecbdf>
 <1><ecbf0>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecbf1>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <ecbf5>   DW_AT_decl_file   : 8
    <ecbf6>   DW_AT_decl_line   : 117
    <ecbf7>   DW_AT_decl_column : 3
    <ecbf8>   DW_AT_type        : <0xec88f>
 <1><ecbfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecbfd>   DW_AT_byte_size   : 8
    <ecbfd>   DW_AT_type        : <0xecbf0>
 <1><ecc01>: Abbrev Number: 18 (DW_TAG_structure_type)
    <ecc02>   DW_AT_byte_size   : 8
    <ecc03>   DW_AT_decl_file   : 9
    <ecc03>   DW_AT_decl_line   : 4
    <ecc04>   DW_AT_decl_column : 3
    <ecc04>   DW_AT_sibling     : <0xecc23>
 <2><ecc08>: Abbrev Number: 2 (DW_TAG_member)
    <ecc09>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <ecc0d>   DW_AT_decl_file   : 9
    <ecc0e>   DW_AT_decl_line   : 5
    <ecc0f>   DW_AT_decl_column : 8
    <ecc10>   DW_AT_type        : <0xec735>
    <ecc14>   DW_AT_data_member_location: 0
 <2><ecc15>: Abbrev Number: 2 (DW_TAG_member)
    <ecc16>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <ecc1a>   DW_AT_decl_file   : 9
    <ecc1b>   DW_AT_decl_line   : 6
    <ecc1c>   DW_AT_decl_column : 8
    <ecc1d>   DW_AT_type        : <0xec735>
    <ecc21>   DW_AT_data_member_location: 4
 <2><ecc22>: Abbrev Number: 0
 <1><ecc23>: Abbrev Number: 18 (DW_TAG_structure_type)
    <ecc24>   DW_AT_byte_size   : 16
    <ecc25>   DW_AT_decl_file   : 9
    <ecc25>   DW_AT_decl_line   : 8
    <ecc26>   DW_AT_decl_column : 3
    <ecc26>   DW_AT_sibling     : <0xecc59>
 <2><ecc2a>: Abbrev Number: 9 (DW_TAG_member)
    <ecc2b>   DW_AT_name        : x
    <ecc2d>   DW_AT_decl_file   : 9
    <ecc2e>   DW_AT_decl_line   : 9
    <ecc2f>   DW_AT_decl_column : 8
    <ecc30>   DW_AT_type        : <0xec735>
    <ecc34>   DW_AT_data_member_location: 0
 <2><ecc35>: Abbrev Number: 9 (DW_TAG_member)
    <ecc36>   DW_AT_name        : y
    <ecc38>   DW_AT_decl_file   : 9
    <ecc39>   DW_AT_decl_line   : 9
    <ecc3a>   DW_AT_decl_column : 11
    <ecc3b>   DW_AT_type        : <0xec735>
    <ecc3f>   DW_AT_data_member_location: 4
 <2><ecc40>: Abbrev Number: 9 (DW_TAG_member)
    <ecc41>   DW_AT_name        : dx
    <ecc44>   DW_AT_decl_file   : 9
    <ecc45>   DW_AT_decl_line   : 10
    <ecc46>   DW_AT_decl_column : 8
    <ecc47>   DW_AT_type        : <0xec735>
    <ecc4b>   DW_AT_data_member_location: 8
 <2><ecc4c>: Abbrev Number: 9 (DW_TAG_member)
    <ecc4d>   DW_AT_name        : dy
    <ecc50>   DW_AT_decl_file   : 9
    <ecc51>   DW_AT_decl_line   : 10
    <ecc52>   DW_AT_decl_column : 12
    <ecc53>   DW_AT_type        : <0xec735>
    <ecc57>   DW_AT_data_member_location: 12
 <2><ecc58>: Abbrev Number: 0
 <1><ecc59>: Abbrev Number: 35 (DW_TAG_union_type)
    <ecc5a>   DW_AT_byte_size   : 16
    <ecc5b>   DW_AT_decl_file   : 9
    <ecc5c>   DW_AT_decl_line   : 3
    <ecc5d>   DW_AT_decl_column : 2
    <ecc5e>   DW_AT_sibling     : <0xecc89>
 <2><ecc62>: Abbrev Number: 19 (DW_TAG_member)
    <ecc63>   DW_AT_type        : <0xecc01>
 <2><ecc67>: Abbrev Number: 19 (DW_TAG_member)
    <ecc68>   DW_AT_type        : <0xecc23>
 <2><ecc6c>: Abbrev Number: 36 (DW_TAG_member)
    <ecc6d>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <ecc71>   DW_AT_decl_file   : 9
    <ecc72>   DW_AT_decl_line   : 12
    <ecc73>   DW_AT_decl_column : 7
    <ecc74>   DW_AT_type        : <0xec735>
 <2><ecc78>: Abbrev Number: 20 (DW_TAG_member)
    <ecc79>   DW_AT_name        : z
    <ecc7b>   DW_AT_decl_file   : 9
    <ecc7b>   DW_AT_decl_line   : 13
    <ecc7c>   DW_AT_decl_column : 7
    <ecc7c>   DW_AT_type        : <0xec735>
 <2><ecc80>: Abbrev Number: 20 (DW_TAG_member)
    <ecc81>   DW_AT_name        : w
    <ecc83>   DW_AT_decl_file   : 9
    <ecc83>   DW_AT_decl_line   : 14
    <ecc84>   DW_AT_decl_column : 7
    <ecc84>   DW_AT_type        : <0xec735>
 <2><ecc88>: Abbrev Number: 0
 <1><ecc89>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ecc8a>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <ecc8e>   DW_AT_byte_size   : 20
    <ecc8f>   DW_AT_decl_file   : 9
    <ecc90>   DW_AT_decl_line   : 1
    <ecc91>   DW_AT_decl_column : 8
    <ecc92>   DW_AT_sibling     : <0xeccaa>
 <2><ecc96>: Abbrev Number: 2 (DW_TAG_member)
    <ecc97>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ecc9b>   DW_AT_decl_file   : 9
    <ecc9c>   DW_AT_decl_line   : 2
    <ecc9d>   DW_AT_decl_column : 6
    <ecc9e>   DW_AT_type        : <0xec735>
    <ecca2>   DW_AT_data_member_location: 0
 <2><ecca3>: Abbrev Number: 37 (DW_TAG_member)
    <ecca4>   DW_AT_type        : <0xecc59>
    <ecca8>   DW_AT_data_member_location: 4
 <2><ecca9>: Abbrev Number: 0
 <1><eccaa>: Abbrev Number: 3 (DW_TAG_typedef)
    <eccab>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <eccaf>   DW_AT_decl_file   : 9
    <eccb0>   DW_AT_decl_line   : 18
    <eccb1>   DW_AT_decl_column : 23
    <eccb2>   DW_AT_type        : <0xecc89>
 <1><eccb6>: Abbrev Number: 3 (DW_TAG_typedef)
    <eccb7>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <eccbb>   DW_AT_decl_file   : 10
    <eccbc>   DW_AT_decl_line   : 1
    <eccbd>   DW_AT_decl_column : 23
    <eccbe>   DW_AT_type        : <0xeccc2>
 <1><eccc2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eccc3>   DW_AT_byte_size   : 8
    <eccc3>   DW_AT_type        : <0xeccc7>
 <1><eccc7>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <eccc8>   DW_AT_prototyped  : 1
    <eccc8>   DW_AT_type        : <0xecae0>
 <1><ecccc>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecccd>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <eccd1>   DW_AT_decl_file   : 10
    <eccd2>   DW_AT_decl_line   : 2
    <eccd3>   DW_AT_decl_column : 23
    <eccd4>   DW_AT_type        : <0xeccd8>
 <1><eccd8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eccd9>   DW_AT_byte_size   : 8
    <eccd9>   DW_AT_type        : <0xeccdd>
 <1><eccdd>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <eccde>   DW_AT_prototyped  : 1
    <eccde>   DW_AT_type        : <0xec735>
 <1><ecce2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecce3>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <ecce7>   DW_AT_decl_file   : 10
    <ecce8>   DW_AT_decl_line   : 3
    <ecce9>   DW_AT_decl_column : 23
    <eccea>   DW_AT_type        : <0xeccd8>
 <1><eccee>: Abbrev Number: 3 (DW_TAG_typedef)
    <eccef>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <eccf3>   DW_AT_decl_file   : 10
    <eccf4>   DW_AT_decl_line   : 10
    <eccf5>   DW_AT_decl_column : 23
    <eccf6>   DW_AT_type        : <0xeccfa>
 <1><eccfa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eccfb>   DW_AT_byte_size   : 8
    <eccfb>   DW_AT_type        : <0xeccff>
 <1><eccff>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ecd00>   DW_AT_prototyped  : 1
    <ecd00>   DW_AT_sibling     : <0xecd0a>
 <2><ecd04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd05>   DW_AT_type        : <0xec735>
 <2><ecd09>: Abbrev Number: 0
 <1><ecd0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd0b>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <ecd0f>   DW_AT_decl_file   : 10
    <ecd10>   DW_AT_decl_line   : 14
    <ecd11>   DW_AT_decl_column : 23
    <ecd12>   DW_AT_type        : <0xecd16>
 <1><ecd16>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecd17>   DW_AT_byte_size   : 8
    <ecd17>   DW_AT_type        : <0xecd1b>
 <1><ecd1b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecd1c>   DW_AT_prototyped  : 1
    <ecd1c>   DW_AT_type        : <0xec735>
    <ecd20>   DW_AT_sibling     : <0xecd34>
 <2><ecd24>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd25>   DW_AT_type        : <0xec735>
 <2><ecd29>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd2a>   DW_AT_type        : <0xec735>
 <2><ecd2e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd2f>   DW_AT_type        : <0xec735>
 <2><ecd33>: Abbrev Number: 0
 <1><ecd34>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd35>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <ecd39>   DW_AT_decl_file   : 10
    <ecd3a>   DW_AT_decl_line   : 18
    <ecd3b>   DW_AT_decl_column : 23
    <ecd3c>   DW_AT_type        : <0xecd16>
 <1><ecd40>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd41>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <ecd45>   DW_AT_decl_file   : 10
    <ecd46>   DW_AT_decl_line   : 24
    <ecd47>   DW_AT_decl_column : 23
    <ecd48>   DW_AT_type        : <0xec7d4>
 <1><ecd4c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd4d>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <ecd51>   DW_AT_decl_file   : 10
    <ecd52>   DW_AT_decl_line   : 28
    <ecd53>   DW_AT_decl_column : 23
    <ecd54>   DW_AT_type        : <0xecd58>
 <1><ecd58>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecd59>   DW_AT_byte_size   : 8
    <ecd59>   DW_AT_type        : <0xecd5d>
 <1><ecd5d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecd5e>   DW_AT_prototyped  : 1
    <ecd5e>   DW_AT_type        : <0xec735>
    <ecd62>   DW_AT_sibling     : <0xecd71>
 <2><ecd66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd67>   DW_AT_type        : <0xec735>
 <2><ecd6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecd6c>   DW_AT_type        : <0xec735>
 <2><ecd70>: Abbrev Number: 0
 <1><ecd71>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd72>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <ecd76>   DW_AT_decl_file   : 10
    <ecd77>   DW_AT_decl_line   : 34
    <ecd78>   DW_AT_decl_column : 23
    <ecd79>   DW_AT_type        : <0xeccd8>
 <1><ecd7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd7e>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <ecd82>   DW_AT_decl_file   : 10
    <ecd83>   DW_AT_decl_line   : 35
    <ecd84>   DW_AT_decl_column : 23
    <ecd85>   DW_AT_type        : <0xeccd8>
 <1><ecd89>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecd8a>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <ecd8e>   DW_AT_decl_file   : 10
    <ecd8f>   DW_AT_decl_line   : 36
    <ecd90>   DW_AT_decl_column : 23
    <ecd91>   DW_AT_type        : <0xecd95>
 <1><ecd95>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecd96>   DW_AT_byte_size   : 8
    <ecd96>   DW_AT_type        : <0xecd9a>
 <1><ecd9a>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ecd9b>   DW_AT_prototyped  : 1
    <ecd9b>   DW_AT_sibling     : <0xecdaa>
 <2><ecd9f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecda0>   DW_AT_type        : <0xecdaa>
 <2><ecda4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecda5>   DW_AT_type        : <0xecdaa>
 <2><ecda9>: Abbrev Number: 0
 <1><ecdaa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecdab>   DW_AT_byte_size   : 8
    <ecdab>   DW_AT_type        : <0xec735>
 <1><ecdaf>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecdb0>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <ecdb4>   DW_AT_decl_file   : 10
    <ecdb5>   DW_AT_decl_line   : 37
    <ecdb6>   DW_AT_decl_column : 23
    <ecdb7>   DW_AT_type        : <0xecd95>
 <1><ecdbb>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecdbc>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <ecdc0>   DW_AT_decl_file   : 10
    <ecdc1>   DW_AT_decl_line   : 45
    <ecdc2>   DW_AT_decl_column : 24
    <ecdc3>   DW_AT_type        : <0xecdc7>
 <1><ecdc7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecdc8>   DW_AT_byte_size   : 8
    <ecdc8>   DW_AT_type        : <0xecdcc>
 <1><ecdcc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecdcd>   DW_AT_prototyped  : 1
    <ecdcd>   DW_AT_type        : <0xec719>
    <ecdd1>   DW_AT_sibling     : <0xecde5>
 <2><ecdd5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecdd6>   DW_AT_type        : <0xec735>
 <2><ecdda>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecddb>   DW_AT_type        : <0xec735>
 <2><ecddf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecde0>   DW_AT_type        : <0xec735>
 <2><ecde4>: Abbrev Number: 0
 <1><ecde5>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecde6>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <ecdea>   DW_AT_decl_file   : 10
    <ecdeb>   DW_AT_decl_line   : 48
    <ecdec>   DW_AT_decl_column : 23
    <ecded>   DW_AT_type        : <0xecdf1>
 <1><ecdf1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecdf2>   DW_AT_byte_size   : 8
    <ecdf2>   DW_AT_type        : <0xecdf6>
 <1><ecdf6>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ecdf7>   DW_AT_prototyped  : 1
    <ecdf7>   DW_AT_sibling     : <0xece0b>
 <2><ecdfb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecdfc>   DW_AT_type        : <0xec7bd>
 <2><ece00>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece01>   DW_AT_type        : <0xec769>
 <2><ece05>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece06>   DW_AT_type        : <0xec735>
 <2><ece0a>: Abbrev Number: 0
 <1><ece0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <ece0c>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <ece10>   DW_AT_decl_file   : 10
    <ece11>   DW_AT_decl_line   : 49
    <ece12>   DW_AT_decl_column : 23
    <ece13>   DW_AT_type        : <0xece17>
 <1><ece17>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ece18>   DW_AT_byte_size   : 8
    <ece18>   DW_AT_type        : <0xece1c>
 <1><ece1c>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ece1d>   DW_AT_prototyped  : 1
    <ece1d>   DW_AT_sibling     : <0xece31>
 <2><ece21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece22>   DW_AT_type        : <0xeca80>
 <2><ece26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece27>   DW_AT_type        : <0xec769>
 <2><ece2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece2c>   DW_AT_type        : <0xec735>
 <2><ece30>: Abbrev Number: 0
 <1><ece31>: Abbrev Number: 3 (DW_TAG_typedef)
    <ece32>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <ece36>   DW_AT_decl_file   : 10
    <ece37>   DW_AT_decl_line   : 51
    <ece38>   DW_AT_decl_column : 24
    <ece39>   DW_AT_type        : <0xece3d>
 <1><ece3d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ece3e>   DW_AT_byte_size   : 8
    <ece3e>   DW_AT_type        : <0xece42>
 <1><ece42>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ece43>   DW_AT_prototyped  : 1
    <ece43>   DW_AT_type        : <0xec75d>
    <ece47>   DW_AT_sibling     : <0xece56>
 <2><ece4b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece4c>   DW_AT_type        : <0xec75d>
 <2><ece50>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece51>   DW_AT_type        : <0xec79a>
 <2><ece55>: Abbrev Number: 0
 <1><ece56>: Abbrev Number: 3 (DW_TAG_typedef)
    <ece57>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <ece5b>   DW_AT_decl_file   : 10
    <ece5c>   DW_AT_decl_line   : 54
    <ece5d>   DW_AT_decl_column : 23
    <ece5e>   DW_AT_type        : <0xece62>
 <1><ece62>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ece63>   DW_AT_byte_size   : 8
    <ece63>   DW_AT_type        : <0xece67>
 <1><ece67>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ece68>   DW_AT_prototyped  : 1
    <ece68>   DW_AT_type        : <0xec735>
    <ece6c>   DW_AT_sibling     : <0xece8f>
 <2><ece70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece71>   DW_AT_type        : <0xecae0>
 <2><ece75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece76>   DW_AT_type        : <0xec74f>
 <2><ece7a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece7b>   DW_AT_type        : <0xec79a>
 <2><ece7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece80>   DW_AT_type        : <0xec735>
 <2><ece84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece85>   DW_AT_type        : <0xec735>
 <2><ece89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ece8a>   DW_AT_type        : <0xec735>
 <2><ece8e>: Abbrev Number: 0
 <1><ece8f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ece90>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <ece94>   DW_AT_decl_file   : 10
    <ece95>   DW_AT_decl_line   : 56
    <ece96>   DW_AT_decl_column : 23
    <ece97>   DW_AT_type        : <0xece9b>
 <1><ece9b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ece9c>   DW_AT_byte_size   : 8
    <ece9c>   DW_AT_type        : <0xecea0>
 <1><ecea0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecea1>   DW_AT_prototyped  : 1
    <ecea1>   DW_AT_type        : <0xec735>
    <ecea5>   DW_AT_sibling     : <0xecec3>
 <2><ecea9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eceaa>   DW_AT_type        : <0xeca80>
 <2><eceae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eceaf>   DW_AT_type        : <0xec829>
 <2><eceb3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eceb4>   DW_AT_type        : <0xec79a>
 <2><eceb8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <eceb9>   DW_AT_type        : <0xec735>
 <2><ecebd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecebe>   DW_AT_type        : <0xec735>
 <2><ecec2>: Abbrev Number: 0
 <1><ecec3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecec4>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <ecec8>   DW_AT_decl_file   : 10
    <ecec9>   DW_AT_decl_line   : 67
    <ececa>   DW_AT_decl_column : 23
    <ececb>   DW_AT_type        : <0xececf>
 <1><ececf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eced0>   DW_AT_byte_size   : 8
    <eced0>   DW_AT_type        : <0xeced4>
 <1><eced4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <eced5>   DW_AT_prototyped  : 1
    <eced5>   DW_AT_type        : <0xec735>
    <eced9>   DW_AT_sibling     : <0xecee3>
 <2><ecedd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecede>   DW_AT_type        : <0xec735>
 <2><ecee2>: Abbrev Number: 0
 <1><ecee3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecee4>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <ecee8>   DW_AT_decl_file   : 10
    <ecee9>   DW_AT_decl_line   : 68
    <eceea>   DW_AT_decl_column : 23
    <eceeb>   DW_AT_type        : <0xeceef>
 <1><eceef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecef0>   DW_AT_byte_size   : 8
    <ecef0>   DW_AT_type        : <0xecef4>
 <1><ecef4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecef5>   DW_AT_prototyped  : 1
    <ecef5>   DW_AT_type        : <0xec735>
    <ecef9>   DW_AT_sibling     : <0xecf17>
 <2><ecefd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecefe>   DW_AT_type        : <0xecdaa>
 <2><ecf02>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf03>   DW_AT_type        : <0xecdaa>
 <2><ecf07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf08>   DW_AT_type        : <0xecdaa>
 <2><ecf0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf0d>   DW_AT_type        : <0xecdaa>
 <2><ecf11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf12>   DW_AT_type        : <0xecdaa>
 <2><ecf16>: Abbrev Number: 0
 <1><ecf17>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecf18>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <ecf1c>   DW_AT_decl_file   : 10
    <ecf1d>   DW_AT_decl_line   : 69
    <ecf1e>   DW_AT_decl_column : 23
    <ecf1f>   DW_AT_type        : <0xecf23>
 <1><ecf23>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecf24>   DW_AT_byte_size   : 8
    <ecf24>   DW_AT_type        : <0xecf28>
 <1><ecf28>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecf29>   DW_AT_prototyped  : 1
    <ecf29>   DW_AT_type        : <0xec735>
    <ecf2d>   DW_AT_sibling     : <0xecf46>
 <2><ecf31>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf32>   DW_AT_type        : <0xec735>
 <2><ecf36>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf37>   DW_AT_type        : <0xec735>
 <2><ecf3b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf3c>   DW_AT_type        : <0xec735>
 <2><ecf40>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf41>   DW_AT_type        : <0xec735>
 <2><ecf45>: Abbrev Number: 0
 <1><ecf46>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecf47>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <ecf4b>   DW_AT_decl_file   : 10
    <ecf4c>   DW_AT_decl_line   : 73
    <ecf4d>   DW_AT_decl_column : 23
    <ecf4e>   DW_AT_type        : <0xecf52>
 <1><ecf52>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecf53>   DW_AT_byte_size   : 8
    <ecf53>   DW_AT_type        : <0xecf57>
 <1><ecf57>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecf58>   DW_AT_prototyped  : 1
    <ecf58>   DW_AT_type        : <0xec735>
    <ecf5c>   DW_AT_sibling     : <0xecf66>
 <2><ecf60>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf61>   DW_AT_type        : <0xec712>
 <2><ecf65>: Abbrev Number: 0
 <1><ecf66>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecf67>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <ecf6b>   DW_AT_decl_file   : 10
    <ecf6c>   DW_AT_decl_line   : 74
    <ecf6d>   DW_AT_decl_column : 23
    <ecf6e>   DW_AT_type        : <0xecf72>
 <1><ecf72>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecf73>   DW_AT_byte_size   : 8
    <ecf73>   DW_AT_type        : <0xecf77>
 <1><ecf77>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ecf78>   DW_AT_prototyped  : 1
    <ecf78>   DW_AT_type        : <0xec735>
    <ecf7c>   DW_AT_sibling     : <0xecf8b>
 <2><ecf80>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf81>   DW_AT_type        : <0xec712>
 <2><ecf85>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecf86>   DW_AT_type        : <0xec70b>
 <2><ecf8a>: Abbrev Number: 0
 <1><ecf8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecf8c>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <ecf90>   DW_AT_decl_file   : 10
    <ecf91>   DW_AT_decl_line   : 80
    <ecf92>   DW_AT_decl_column : 23
    <ecf93>   DW_AT_type        : <0xeccfa>
 <1><ecf97>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecf98>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <ecf9c>   DW_AT_decl_file   : 10
    <ecf9d>   DW_AT_decl_line   : 83
    <ecf9e>   DW_AT_decl_column : 23
    <ecf9f>   DW_AT_type        : <0xececf>
 <1><ecfa3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecfa4>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <ecfa8>   DW_AT_decl_file   : 10
    <ecfa9>   DW_AT_decl_line   : 86
    <ecfaa>   DW_AT_decl_column : 23
    <ecfab>   DW_AT_type        : <0xecd58>
 <1><ecfaf>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecfb0>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <ecfb4>   DW_AT_decl_file   : 10
    <ecfb5>   DW_AT_decl_line   : 89
    <ecfb6>   DW_AT_decl_column : 23
    <ecfb7>   DW_AT_type        : <0xecd58>
 <1><ecfbb>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecfbc>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <ecfc0>   DW_AT_decl_file   : 10
    <ecfc1>   DW_AT_decl_line   : 91
    <ecfc2>   DW_AT_decl_column : 23
    <ecfc3>   DW_AT_type        : <0xecfc7>
 <1><ecfc7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecfc8>   DW_AT_byte_size   : 8
    <ecfc8>   DW_AT_type        : <0xecfcc>
 <1><ecfcc>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ecfcd>   DW_AT_prototyped  : 1
    <ecfcd>   DW_AT_sibling     : <0xecfd7>
 <2><ecfd1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ecfd2>   DW_AT_type        : <0xecfd7>
 <2><ecfd6>: Abbrev Number: 0
 <1><ecfd7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ecfd8>   DW_AT_byte_size   : 8
    <ecfd8>   DW_AT_type        : <0xeccaa>
 <1><ecfdc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ecfdd>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <ecfe1>   DW_AT_byte_size   : 224
    <ecfe2>   DW_AT_decl_file   : 10
    <ecfe3>   DW_AT_decl_line   : 93
    <ecfe4>   DW_AT_decl_column : 16
    <ecfe5>   DW_AT_sibling     : <0xed156>
 <2><ecfe9>: Abbrev Number: 2 (DW_TAG_member)
    <ecfea>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <ecfee>   DW_AT_decl_file   : 10
    <ecfef>   DW_AT_decl_line   : 94
    <ecff0>   DW_AT_decl_column : 23
    <ecff1>   DW_AT_type        : <0xeccb6>
    <ecff5>   DW_AT_data_member_location: 0
 <2><ecff6>: Abbrev Number: 2 (DW_TAG_member)
    <ecff7>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <ecffb>   DW_AT_decl_file   : 10
    <ecffc>   DW_AT_decl_line   : 95
    <ecffd>   DW_AT_decl_column : 23
    <ecffe>   DW_AT_type        : <0xecccc>
    <ed002>   DW_AT_data_member_location: 8
 <2><ed003>: Abbrev Number: 2 (DW_TAG_member)
    <ed004>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <ed008>   DW_AT_decl_file   : 10
    <ed009>   DW_AT_decl_line   : 96
    <ed00a>   DW_AT_decl_column : 23
    <ed00b>   DW_AT_type        : <0xecce2>
    <ed00f>   DW_AT_data_member_location: 16
 <2><ed010>: Abbrev Number: 2 (DW_TAG_member)
    <ed011>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <ed015>   DW_AT_decl_file   : 10
    <ed016>   DW_AT_decl_line   : 97
    <ed017>   DW_AT_decl_column : 23
    <ed018>   DW_AT_type        : <0xeccee>
    <ed01c>   DW_AT_data_member_location: 24
 <2><ed01d>: Abbrev Number: 2 (DW_TAG_member)
    <ed01e>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <ed022>   DW_AT_decl_file   : 10
    <ed023>   DW_AT_decl_line   : 98
    <ed024>   DW_AT_decl_column : 23
    <ed025>   DW_AT_type        : <0xecd0a>
    <ed029>   DW_AT_data_member_location: 32
 <2><ed02a>: Abbrev Number: 2 (DW_TAG_member)
    <ed02b>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <ed02f>   DW_AT_decl_file   : 10
    <ed030>   DW_AT_decl_line   : 99
    <ed031>   DW_AT_decl_column : 23
    <ed032>   DW_AT_type        : <0xecd34>
    <ed036>   DW_AT_data_member_location: 40
 <2><ed037>: Abbrev Number: 2 (DW_TAG_member)
    <ed038>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <ed03c>   DW_AT_decl_file   : 10
    <ed03d>   DW_AT_decl_line   : 100
    <ed03e>   DW_AT_decl_column : 23
    <ed03f>   DW_AT_type        : <0xecd4c>
    <ed043>   DW_AT_data_member_location: 48
 <2><ed044>: Abbrev Number: 2 (DW_TAG_member)
    <ed045>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <ed049>   DW_AT_decl_file   : 10
    <ed04a>   DW_AT_decl_line   : 101
    <ed04b>   DW_AT_decl_column : 23
    <ed04c>   DW_AT_type        : <0xecd71>
    <ed050>   DW_AT_data_member_location: 56
 <2><ed051>: Abbrev Number: 2 (DW_TAG_member)
    <ed052>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <ed056>   DW_AT_decl_file   : 10
    <ed057>   DW_AT_decl_line   : 102
    <ed058>   DW_AT_decl_column : 23
    <ed059>   DW_AT_type        : <0xecd7d>
    <ed05d>   DW_AT_data_member_location: 64
 <2><ed05e>: Abbrev Number: 2 (DW_TAG_member)
    <ed05f>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <ed063>   DW_AT_decl_file   : 10
    <ed064>   DW_AT_decl_line   : 103
    <ed065>   DW_AT_decl_column : 23
    <ed066>   DW_AT_type        : <0xecd89>
    <ed06a>   DW_AT_data_member_location: 72
 <2><ed06b>: Abbrev Number: 2 (DW_TAG_member)
    <ed06c>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <ed070>   DW_AT_decl_file   : 10
    <ed071>   DW_AT_decl_line   : 104
    <ed072>   DW_AT_decl_column : 23
    <ed073>   DW_AT_type        : <0xecdaf>
    <ed077>   DW_AT_data_member_location: 80
 <2><ed078>: Abbrev Number: 2 (DW_TAG_member)
    <ed079>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <ed07d>   DW_AT_decl_file   : 10
    <ed07e>   DW_AT_decl_line   : 105
    <ed07f>   DW_AT_decl_column : 24
    <ed080>   DW_AT_type        : <0xecde5>
    <ed084>   DW_AT_data_member_location: 88
 <2><ed085>: Abbrev Number: 2 (DW_TAG_member)
    <ed086>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <ed08a>   DW_AT_decl_file   : 10
    <ed08b>   DW_AT_decl_line   : 106
    <ed08c>   DW_AT_decl_column : 25
    <ed08d>   DW_AT_type        : <0xece0b>
    <ed091>   DW_AT_data_member_location: 96
 <2><ed092>: Abbrev Number: 2 (DW_TAG_member)
    <ed093>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <ed097>   DW_AT_decl_file   : 10
    <ed098>   DW_AT_decl_line   : 107
    <ed099>   DW_AT_decl_column : 23
    <ed09a>   DW_AT_type        : <0xece31>
    <ed09e>   DW_AT_data_member_location: 104
 <2><ed09f>: Abbrev Number: 2 (DW_TAG_member)
    <ed0a0>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <ed0a4>   DW_AT_decl_file   : 10
    <ed0a5>   DW_AT_decl_line   : 108
    <ed0a6>   DW_AT_decl_column : 23
    <ed0a7>   DW_AT_type        : <0xecec3>
    <ed0ab>   DW_AT_data_member_location: 112
 <2><ed0ac>: Abbrev Number: 2 (DW_TAG_member)
    <ed0ad>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <ed0b1>   DW_AT_decl_file   : 10
    <ed0b2>   DW_AT_decl_line   : 109
    <ed0b3>   DW_AT_decl_column : 23
    <ed0b4>   DW_AT_type        : <0xecee3>
    <ed0b8>   DW_AT_data_member_location: 120
 <2><ed0b9>: Abbrev Number: 2 (DW_TAG_member)
    <ed0ba>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <ed0be>   DW_AT_decl_file   : 10
    <ed0bf>   DW_AT_decl_line   : 110
    <ed0c0>   DW_AT_decl_column : 23
    <ed0c1>   DW_AT_type        : <0xecf17>
    <ed0c5>   DW_AT_data_member_location: 128
 <2><ed0c6>: Abbrev Number: 2 (DW_TAG_member)
    <ed0c7>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <ed0cb>   DW_AT_decl_file   : 10
    <ed0cc>   DW_AT_decl_line   : 111
    <ed0cd>   DW_AT_decl_column : 23
    <ed0ce>   DW_AT_type        : <0xecf46>
    <ed0d2>   DW_AT_data_member_location: 136
 <2><ed0d3>: Abbrev Number: 2 (DW_TAG_member)
    <ed0d4>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <ed0d8>   DW_AT_decl_file   : 10
    <ed0d9>   DW_AT_decl_line   : 112
    <ed0da>   DW_AT_decl_column : 23
    <ed0db>   DW_AT_type        : <0xecf66>
    <ed0df>   DW_AT_data_member_location: 144
 <2><ed0e0>: Abbrev Number: 2 (DW_TAG_member)
    <ed0e1>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <ed0e5>   DW_AT_decl_file   : 10
    <ed0e6>   DW_AT_decl_line   : 113
    <ed0e7>   DW_AT_decl_column : 25
    <ed0e8>   DW_AT_type        : <0xecd40>
    <ed0ec>   DW_AT_data_member_location: 152
 <2><ed0ed>: Abbrev Number: 2 (DW_TAG_member)
    <ed0ee>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <ed0f2>   DW_AT_decl_file   : 10
    <ed0f3>   DW_AT_decl_line   : 114
    <ed0f4>   DW_AT_decl_column : 24
    <ed0f5>   DW_AT_type        : <0xece56>
    <ed0f9>   DW_AT_data_member_location: 160
 <2><ed0fa>: Abbrev Number: 2 (DW_TAG_member)
    <ed0fb>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <ed0ff>   DW_AT_decl_file   : 10
    <ed100>   DW_AT_decl_line   : 115
    <ed101>   DW_AT_decl_column : 25
    <ed102>   DW_AT_type        : <0xece8f>
    <ed106>   DW_AT_data_member_location: 168
 <2><ed107>: Abbrev Number: 2 (DW_TAG_member)
    <ed108>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <ed10c>   DW_AT_decl_file   : 10
    <ed10d>   DW_AT_decl_line   : 116
    <ed10e>   DW_AT_decl_column : 23
    <ed10f>   DW_AT_type        : <0xecdbb>
    <ed113>   DW_AT_data_member_location: 176
 <2><ed114>: Abbrev Number: 2 (DW_TAG_member)
    <ed115>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <ed119>   DW_AT_decl_file   : 10
    <ed11a>   DW_AT_decl_line   : 117
    <ed11b>   DW_AT_decl_column : 23
    <ed11c>   DW_AT_type        : <0xecf8b>
    <ed120>   DW_AT_data_member_location: 184
 <2><ed121>: Abbrev Number: 2 (DW_TAG_member)
    <ed122>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <ed126>   DW_AT_decl_file   : 10
    <ed127>   DW_AT_decl_line   : 118
    <ed128>   DW_AT_decl_column : 22
    <ed129>   DW_AT_type        : <0xecf97>
    <ed12d>   DW_AT_data_member_location: 192
 <2><ed12e>: Abbrev Number: 2 (DW_TAG_member)
    <ed12f>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <ed133>   DW_AT_decl_file   : 10
    <ed134>   DW_AT_decl_line   : 119
    <ed135>   DW_AT_decl_column : 23
    <ed136>   DW_AT_type        : <0xecfa3>
    <ed13a>   DW_AT_data_member_location: 200
 <2><ed13b>: Abbrev Number: 2 (DW_TAG_member)
    <ed13c>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <ed140>   DW_AT_decl_file   : 10
    <ed141>   DW_AT_decl_line   : 120
    <ed142>   DW_AT_decl_column : 22
    <ed143>   DW_AT_type        : <0xecfaf>
    <ed147>   DW_AT_data_member_location: 208
 <2><ed148>: Abbrev Number: 2 (DW_TAG_member)
    <ed149>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <ed14d>   DW_AT_decl_file   : 10
    <ed14e>   DW_AT_decl_line   : 121
    <ed14f>   DW_AT_decl_column : 23
    <ed150>   DW_AT_type        : <0xecfbb>
    <ed154>   DW_AT_data_member_location: 216
 <2><ed155>: Abbrev Number: 0
 <1><ed156>: Abbrev Number: 3 (DW_TAG_typedef)
    <ed157>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <ed15b>   DW_AT_decl_file   : 10
    <ed15c>   DW_AT_decl_line   : 122
    <ed15d>   DW_AT_decl_column : 3
    <ed15e>   DW_AT_type        : <0xecfdc>
 <1><ed162>: Abbrev Number: 38 (DW_TAG_structure_type)
    <ed163>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <ed167>   DW_AT_byte_size   : 20848
    <ed169>   DW_AT_decl_file   : 11
    <ed16a>   DW_AT_decl_line   : 349
    <ed16c>   DW_AT_decl_column : 16
    <ed16d>   DW_AT_sibling     : <0xed1e2>
 <2><ed171>: Abbrev Number: 12 (DW_TAG_member)
    <ed172>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <ed176>   DW_AT_decl_file   : 11
    <ed176>   DW_AT_decl_line   : 350
    <ed178>   DW_AT_decl_column : 18
    <ed178>   DW_AT_type        : <0xec735>
    <ed17c>   DW_AT_data_member_location: 0
 <2><ed17d>: Abbrev Number: 12 (DW_TAG_member)
    <ed17e>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <ed182>   DW_AT_decl_file   : 11
    <ed182>   DW_AT_decl_line   : 351
    <ed184>   DW_AT_decl_column : 18
    <ed184>   DW_AT_type        : <0xec7c3>
    <ed188>   DW_AT_data_member_location: 8
 <2><ed189>: Abbrev Number: 12 (DW_TAG_member)
    <ed18a>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <ed18e>   DW_AT_decl_file   : 11
    <ed18e>   DW_AT_decl_line   : 352
    <ed190>   DW_AT_decl_column : 18
    <ed190>   DW_AT_type        : <0xec80f>
    <ed194>   DW_AT_data_member_location: 16
 <2><ed195>: Abbrev Number: 12 (DW_TAG_member)
    <ed196>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <ed19a>   DW_AT_decl_file   : 11
    <ed19a>   DW_AT_decl_line   : 353
    <ed19c>   DW_AT_decl_column : 18
    <ed19c>   DW_AT_type        : <0xec75d>
    <ed1a0>   DW_AT_data_member_location: 40
 <2><ed1a1>: Abbrev Number: 12 (DW_TAG_member)
    <ed1a2>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <ed1a6>   DW_AT_decl_file   : 11
    <ed1a6>   DW_AT_decl_line   : 354
    <ed1a8>   DW_AT_decl_column : 18
    <ed1a8>   DW_AT_type        : <0xed156>
    <ed1ac>   DW_AT_data_member_location: 48
 <2><ed1ad>: Abbrev Number: 14 (DW_TAG_member)
    <ed1ae>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <ed1b2>   DW_AT_decl_file   : 11
    <ed1b2>   DW_AT_decl_line   : 355
    <ed1b4>   DW_AT_decl_column : 18
    <ed1b4>   DW_AT_type        : <0xed1e2>
    <ed1b8>   DW_AT_data_member_location: 272
 <2><ed1ba>: Abbrev Number: 14 (DW_TAG_member)
    <ed1bb>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <ed1bf>   DW_AT_decl_file   : 11
    <ed1bf>   DW_AT_decl_line   : 356
    <ed1c1>   DW_AT_decl_column : 18
    <ed1c1>   DW_AT_type        : <0xec735>
    <ed1c5>   DW_AT_data_member_location: 20832
 <2><ed1c7>: Abbrev Number: 14 (DW_TAG_member)
    <ed1c8>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <ed1cc>   DW_AT_decl_file   : 11
    <ed1cc>   DW_AT_decl_line   : 357
    <ed1ce>   DW_AT_decl_column : 18
    <ed1ce>   DW_AT_type        : <0xec735>
    <ed1d2>   DW_AT_data_member_location: 20836
 <2><ed1d4>: Abbrev Number: 14 (DW_TAG_member)
    <ed1d5>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <ed1d9>   DW_AT_decl_file   : 11
    <ed1d9>   DW_AT_decl_line   : 358
    <ed1db>   DW_AT_decl_column : 18
    <ed1db>   DW_AT_type        : <0xec7d4>
    <ed1df>   DW_AT_data_member_location: 20840
 <2><ed1e1>: Abbrev Number: 0
 <1><ed1e2>: Abbrev Number: 17 (DW_TAG_array_type)
    <ed1e3>   DW_AT_type        : <0xecbf0>
    <ed1e7>   DW_AT_sibling     : <0xed1f3>
 <2><ed1eb>: Abbrev Number: 39 (DW_TAG_subrange_type)
    <ed1ec>   DW_AT_type        : <0xec720>
    <ed1f0>   DW_AT_upper_bound : 256
 <2><ed1f2>: Abbrev Number: 0
 <1><ed1f3>: Abbrev Number: 16 (DW_TAG_typedef)
    <ed1f4>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <ed1f8>   DW_AT_decl_file   : 11
    <ed1f9>   DW_AT_decl_line   : 359
    <ed1fb>   DW_AT_decl_column : 3
    <ed1fc>   DW_AT_type        : <0xed162>
 <1><ed200>: Abbrev Number: 40 (DW_TAG_variable)
    <ed201>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <ed205>   DW_AT_decl_file   : 11
    <ed206>   DW_AT_decl_line   : 361
    <ed208>   DW_AT_decl_column : 21
    <ed209>   DW_AT_type        : <0xed1f3>
    <ed20d>   DW_AT_external    : 1
    <ed20d>   DW_AT_declaration : 1
 <1><ed20d>: Abbrev Number: 22 (DW_TAG_subprogram)
    <ed20e>   DW_AT_external    : 1
    <ed20e>   DW_AT_name        : (indirect string, offset: 0x1ab06): wcslen
    <ed212>   DW_AT_decl_file   : 12
    <ed213>   DW_AT_decl_line   : 222
    <ed214>   DW_AT_decl_column : 15
    <ed215>   DW_AT_prototyped  : 1
    <ed215>   DW_AT_type        : <0xec769>
    <ed219>   DW_AT_declaration : 1
    <ed219>   DW_AT_sibling     : <0xed223>
 <2><ed21d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed21e>   DW_AT_type        : <0xeca80>
 <2><ed222>: Abbrev Number: 0
 <1><ed223>: Abbrev Number: 22 (DW_TAG_subprogram)
    <ed224>   DW_AT_external    : 1
    <ed224>   DW_AT_name        : (indirect string, offset: 0x1b52c): fb_FilePutDataEx
    <ed228>   DW_AT_decl_file   : 8
    <ed229>   DW_AT_decl_line   : 159
    <ed22a>   DW_AT_decl_column : 21
    <ed22b>   DW_AT_prototyped  : 1
    <ed22b>   DW_AT_type        : <0xec735>
    <ed22f>   DW_AT_declaration : 1
    <ed22f>   DW_AT_sibling     : <0xed257>
 <2><ed233>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed234>   DW_AT_type        : <0xecbfc>
 <2><ed238>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed239>   DW_AT_type        : <0xec7c8>
 <2><ed23d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed23e>   DW_AT_type        : <0xec7bd>
 <2><ed242>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed243>   DW_AT_type        : <0xec769>
 <2><ed247>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed248>   DW_AT_type        : <0xec735>
 <2><ed24c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed24d>   DW_AT_type        : <0xec735>
 <2><ed251>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ed252>   DW_AT_type        : <0xec735>
 <2><ed256>: Abbrev Number: 0
 <1><ed257>: Abbrev Number: 41 (DW_TAG_subprogram)
    <ed258>   DW_AT_external    : 1
    <ed258>   DW_AT_name        : (indirect string, offset: 0x1d777): fb_DevScrnInit_WriteWstr
    <ed25c>   DW_AT_decl_file   : 13
    <ed25d>   DW_AT_decl_line   : 57
    <ed25e>   DW_AT_decl_column : 21
    <ed25f>   DW_AT_prototyped  : 1
    <ed25f>   DW_AT_declaration : 1
 <1><ed25f>: Abbrev Number: 42 (DW_TAG_subprogram)
    <ed260>   DW_AT_external    : 1
    <ed260>   DW_AT_name        : (indirect string, offset: 0x1d790): fb_hFilePrintBufferWstr
    <ed264>   DW_AT_decl_file   : 1
    <ed265>   DW_AT_decl_line   : 18
    <ed266>   DW_AT_decl_column : 5
    <ed267>   DW_AT_prototyped  : 1
    <ed267>   DW_AT_type        : <0xec735>
    <ed26b>   DW_AT_low_pc      : 0x479e50
    <ed273>   DW_AT_high_pc     : 0x84
    <ed27b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ed27d>   DW_AT_call_all_calls: 1
    <ed27d>   DW_AT_sibling     : <0xed368>
 <2><ed281>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <ed282>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <ed286>   DW_AT_decl_file   : 1
    <ed286>   DW_AT_decl_line   : 20
    <ed287>   DW_AT_decl_column : 7
    <ed288>   DW_AT_type        : <0xec735>
    <ed28c>   DW_AT_location    : 0x44193 (location list)
    <ed290>   DW_AT_GNU_locviews: 0x4418b
 <2><ed294>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <ed295>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <ed299>   DW_AT_decl_file   : 1
    <ed299>   DW_AT_decl_line   : 21
    <ed29a>   DW_AT_decl_column : 19
    <ed29b>   DW_AT_type        : <0xeca80>
    <ed29f>   DW_AT_location    : 0x441b6 (location list)
    <ed2a3>   DW_AT_GNU_locviews: 0x441b0
 <2><ed2a7>: Abbrev Number: 43 (DW_TAG_inlined_subroutine)
    <ed2a8>   DW_AT_abstract_origin: <0xed39c>
    <ed2ac>   DW_AT_entry_pc    : 0x479e50
    <ed2b4>   DW_AT_GNU_entry_view: 2
    <ed2b5>   DW_AT_ranges      : 0x18834
    <ed2b9>   DW_AT_call_file   : 1
    <ed2ba>   DW_AT_call_line   : 25
    <ed2bb>   DW_AT_call_column : 46
    <ed2bc>   DW_AT_sibling     : <0xed2e2>
 <3><ed2c0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed2c1>   DW_AT_abstract_origin: <0xed3ad>
    <ed2c5>   DW_AT_location    : 0x441d0 (location list)
    <ed2c9>   DW_AT_GNU_locviews: 0x441cc
 <3><ed2cd>: Abbrev Number: 15 (DW_TAG_call_site)
    <ed2ce>   DW_AT_call_return_pc: 0x479e6e
    <ed2d6>   DW_AT_call_origin : <0xed20d>
 <4><ed2da>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed2db>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ed2dd>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ed2e0>: Abbrev Number: 0
 <3><ed2e1>: Abbrev Number: 0
 <2><ed2e2>: Abbrev Number: 44 (DW_TAG_inlined_subroutine)
    <ed2e3>   DW_AT_abstract_origin: <0xed368>
    <ed2e7>   DW_AT_entry_pc    : 0x479ea2
    <ed2ef>   DW_AT_GNU_entry_view: 0
    <ed2f0>   DW_AT_low_pc      : 0x479ea2
    <ed2f8>   DW_AT_high_pc     : 0x27
    <ed300>   DW_AT_call_file   : 1
    <ed301>   DW_AT_call_line   : 24
    <ed302>   DW_AT_call_column : 12
 <3><ed303>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed304>   DW_AT_abstract_origin: <0xed38f>
    <ed308>   DW_AT_location    : 0x441dd (location list)
    <ed30c>   DW_AT_GNU_locviews: 0x441db
 <3><ed310>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed311>   DW_AT_abstract_origin: <0xed384>
    <ed315>   DW_AT_location    : 0x441e7 (location list)
    <ed319>   DW_AT_GNU_locviews: 0x441e5
 <3><ed31d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed31e>   DW_AT_abstract_origin: <0xed379>
    <ed322>   DW_AT_location    : 0x441f1 (location list)
    <ed326>   DW_AT_GNU_locviews: 0x441ef
 <3><ed32a>: Abbrev Number: 24 (DW_TAG_call_site)
    <ed32b>   DW_AT_call_return_pc: 0x479ea7
    <ed333>   DW_AT_call_origin : <0xed257>
 <3><ed337>: Abbrev Number: 15 (DW_TAG_call_site)
    <ed338>   DW_AT_call_return_pc: 0x479ec9
    <ed340>   DW_AT_call_origin : <0xed223>
 <4><ed344>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed345>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ed347>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><ed34a>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed34b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ed34d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><ed34f>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed350>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ed352>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ed355>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed356>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <ed358>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><ed35b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed35c>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <ed35e>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><ed360>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed361>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <ed363>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><ed365>: Abbrev Number: 0
 <3><ed366>: Abbrev Number: 0
 <2><ed367>: Abbrev Number: 0
 <1><ed368>: Abbrev Number: 45 (DW_TAG_subprogram)
    <ed369>   DW_AT_external    : 1
    <ed369>   DW_AT_name        : (indirect string, offset: 0x1bc36): fb_hFilePrintBufferWstrEx
    <ed36d>   DW_AT_decl_file   : 1
    <ed36e>   DW_AT_decl_line   : 6
    <ed36f>   DW_AT_decl_column : 5
    <ed370>   DW_AT_prototyped  : 1
    <ed370>   DW_AT_type        : <0xec735>
    <ed374>   DW_AT_inline      : 1	(inlined)
    <ed375>   DW_AT_sibling     : <0xed39c>
 <2><ed379>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ed37a>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <ed37e>   DW_AT_decl_file   : 1
    <ed37e>   DW_AT_decl_line   : 8
    <ed37f>   DW_AT_decl_column : 12
    <ed380>   DW_AT_type        : <0xecbfc>
 <2><ed384>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ed385>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <ed389>   DW_AT_decl_file   : 1
    <ed389>   DW_AT_decl_line   : 9
    <ed38a>   DW_AT_decl_column : 19
    <ed38b>   DW_AT_type        : <0xeca80>
 <2><ed38f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ed390>   DW_AT_name        : len
    <ed394>   DW_AT_decl_file   : 1
    <ed395>   DW_AT_decl_line   : 10
    <ed396>   DW_AT_decl_column : 10
    <ed397>   DW_AT_type        : <0xec769>
 <2><ed39b>: Abbrev Number: 0
 <1><ed39c>: Abbrev Number: 46 (DW_TAG_subprogram)
    <ed39d>   DW_AT_name        : (indirect string, offset: 0x1ab1d): fb_wstr_Len
    <ed3a1>   DW_AT_decl_file   : 2
    <ed3a2>   DW_AT_decl_line   : 144
    <ed3a3>   DW_AT_decl_column : 27
    <ed3a4>   DW_AT_prototyped  : 1
    <ed3a4>   DW_AT_type        : <0xec79a>
    <ed3a8>   DW_AT_inline      : 3	(declared as inline and inlined)
    <ed3a9>   DW_AT_sibling     : <0xed3b8>
 <2><ed3ad>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ed3ae>   DW_AT_name        : s
    <ed3b0>   DW_AT_decl_file   : 2
    <ed3b1>   DW_AT_decl_line   : 144
    <ed3b2>   DW_AT_decl_column : 56
    <ed3b3>   DW_AT_type        : <0xeca80>
 <2><ed3b7>: Abbrev Number: 0
 <1><ed3b8>: Abbrev Number: 47 (DW_TAG_subprogram)
    <ed3b9>   DW_AT_abstract_origin: <0xed368>
    <ed3bd>   DW_AT_low_pc      : 0x479e10
    <ed3c5>   DW_AT_high_pc     : 0x3d
    <ed3cd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ed3cf>   DW_AT_call_all_calls: 1
 <2><ed3cf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed3d0>   DW_AT_abstract_origin: <0xed379>
    <ed3d4>   DW_AT_location    : 0x441ff (location list)
    <ed3d8>   DW_AT_GNU_locviews: 0x441f9
 <2><ed3dc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed3dd>   DW_AT_abstract_origin: <0xed384>
    <ed3e1>   DW_AT_location    : 0x44218 (location list)
    <ed3e5>   DW_AT_GNU_locviews: 0x44212
 <2><ed3e9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ed3ea>   DW_AT_abstract_origin: <0xed38f>
    <ed3ee>   DW_AT_location    : 0x44231 (location list)
    <ed3f2>   DW_AT_GNU_locviews: 0x4422b
 <2><ed3f6>: Abbrev Number: 24 (DW_TAG_call_site)
    <ed3f7>   DW_AT_call_return_pc: 0x479e23
    <ed3ff>   DW_AT_call_origin : <0xed257>
 <2><ed403>: Abbrev Number: 15 (DW_TAG_call_site)
    <ed404>   DW_AT_call_return_pc: 0x479e45
    <ed40c>   DW_AT_call_origin : <0xed223>
 <3><ed410>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed411>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ed413>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><ed416>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed417>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ed419>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><ed41b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed41c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ed41e>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><ed421>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed422>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <ed424>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><ed427>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed428>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <ed42a>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><ed42c>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <ed42d>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <ed42f>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><ed431>: Abbrev Number: 0
 <2><ed432>: Abbrev Number: 0
 <1><ed433>: Abbrev Number: 0
  Compilation Unit @ offset 0xed434:
   Length:        0x25eb (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x196d5
   Pointer Size:  8
 <0><ed440>: Abbrev Number: 61 (DW_TAG_compile_unit)
    <ed441>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <ed445>   DW_AT_language    : 29	(C11)
    <ed446>   DW_AT_name        : (indirect line string, offset: 0x1928): src/rtlib/unix/hinit.c
    <ed44a>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <ed44e>   DW_AT_low_pc      : 0x479ee0
    <ed456>   DW_AT_high_pc     : 0x10ca
    <ed45e>   DW_AT_stmt_list   : 0x6fd39
 <1><ed462>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed463>   DW_AT_byte_size   : 1
    <ed464>   DW_AT_encoding    : 8	(unsigned char)
    <ed465>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><ed469>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed46a>   DW_AT_byte_size   : 2
    <ed46b>   DW_AT_encoding    : 7	(unsigned)
    <ed46c>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><ed470>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed471>   DW_AT_byte_size   : 4
    <ed472>   DW_AT_encoding    : 7	(unsigned)
    <ed473>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><ed477>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed478>   DW_AT_byte_size   : 8
    <ed479>   DW_AT_encoding    : 7	(unsigned)
    <ed47a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><ed47e>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed47f>   DW_AT_byte_size   : 1
    <ed480>   DW_AT_encoding    : 6	(signed char)
    <ed481>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><ed485>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed486>   DW_AT_byte_size   : 2
    <ed487>   DW_AT_encoding    : 5	(signed)
    <ed488>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><ed48c>: Abbrev Number: 62 (DW_TAG_base_type)
    <ed48d>   DW_AT_byte_size   : 4
    <ed48e>   DW_AT_encoding    : 5	(signed)
    <ed48f>   DW_AT_name        : int
 <1><ed493>: Abbrev Number: 24 (DW_TAG_const_type)
    <ed494>   DW_AT_type        : <0xed48c>
 <1><ed498>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed499>   DW_AT_byte_size   : 8
    <ed49a>   DW_AT_encoding    : 5	(signed)
    <ed49b>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><ed49f>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4a0>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <ed4a4>   DW_AT_decl_file   : 3
    <ed4a5>   DW_AT_decl_line   : 152
    <ed4a6>   DW_AT_decl_column : 25
    <ed4a7>   DW_AT_type        : <0xed498>
 <1><ed4ab>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4ac>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <ed4b0>   DW_AT_decl_file   : 3
    <ed4b1>   DW_AT_decl_line   : 153
    <ed4b2>   DW_AT_decl_column : 27
    <ed4b3>   DW_AT_type        : <0xed498>
 <1><ed4b7>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4b8>   DW_AT_name        : (indirect string, offset: 0x1a5f3): __pid_t
    <ed4bc>   DW_AT_decl_file   : 3
    <ed4bd>   DW_AT_decl_line   : 154
    <ed4be>   DW_AT_decl_column : 25
    <ed4bf>   DW_AT_type        : <0xed48c>
 <1><ed4c3>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4c4>   DW_AT_name        : (indirect string, offset: 0x194f0): __useconds_t
    <ed4c8>   DW_AT_decl_file   : 3
    <ed4c9>   DW_AT_decl_line   : 161
    <ed4ca>   DW_AT_decl_column : 30
    <ed4cb>   DW_AT_type        : <0xed470>
 <1><ed4cf>: Abbrev Number: 63 (DW_TAG_pointer_type)
    <ed4d0>   DW_AT_byte_size   : 8
 <1><ed4d1>: Abbrev Number: 28 (DW_TAG_restrict_type)
    <ed4d2>   DW_AT_type        : <0xed4cf>
 <1><ed4d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed4d7>   DW_AT_byte_size   : 8
    <ed4d7>   DW_AT_type        : <0xed4db>
 <1><ed4db>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed4dc>   DW_AT_byte_size   : 1
    <ed4dd>   DW_AT_encoding    : 6	(signed char)
    <ed4de>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><ed4e2>: Abbrev Number: 24 (DW_TAG_const_type)
    <ed4e3>   DW_AT_type        : <0xed4db>
 <1><ed4e7>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4e8>   DW_AT_name        : (indirect string, offset: 0x1d7af): __sig_atomic_t
    <ed4ec>   DW_AT_decl_file   : 3
    <ed4ed>   DW_AT_decl_line   : 215
    <ed4ee>   DW_AT_decl_column : 13
    <ed4ef>   DW_AT_type        : <0xed48c>
 <1><ed4f3>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed4f4>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <ed4f8>   DW_AT_decl_file   : 4
    <ed4f9>   DW_AT_decl_line   : 209
    <ed4fa>   DW_AT_decl_column : 23
    <ed4fb>   DW_AT_type        : <0xed477>
 <1><ed4ff>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed500>   DW_AT_byte_size   : 8
    <ed501>   DW_AT_encoding    : 5	(signed)
    <ed502>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><ed506>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed507>   DW_AT_byte_size   : 8
    <ed507>   DW_AT_type        : <0xed4e2>
 <1><ed50b>: Abbrev Number: 28 (DW_TAG_restrict_type)
    <ed50c>   DW_AT_type        : <0xed506>
 <1><ed510>: Abbrev Number: 29 (DW_TAG_structure_type)
    <ed511>   DW_AT_name        : (indirect string, offset: 0x18e9a): __pthread_internal_list
    <ed515>   DW_AT_byte_size   : 16
    <ed516>   DW_AT_decl_file   : 5
    <ed517>   DW_AT_decl_line   : 49
    <ed518>   DW_AT_decl_column : 16
    <ed519>   DW_AT_sibling     : <0xed538>
 <2><ed51d>: Abbrev Number: 3 (DW_TAG_member)
    <ed51e>   DW_AT_name        : (indirect string, offset: 0x18ed4): __prev
    <ed522>   DW_AT_decl_file   : 5
    <ed523>   DW_AT_decl_line   : 51
    <ed524>   DW_AT_decl_column : 35
    <ed525>   DW_AT_type        : <0xed538>
    <ed529>   DW_AT_data_member_location: 0
 <2><ed52a>: Abbrev Number: 3 (DW_TAG_member)
    <ed52b>   DW_AT_name        : (indirect string, offset: 0x190a3): __next
    <ed52f>   DW_AT_decl_file   : 5
    <ed530>   DW_AT_decl_line   : 52
    <ed531>   DW_AT_decl_column : 35
    <ed532>   DW_AT_type        : <0xed538>
    <ed536>   DW_AT_data_member_location: 8
 <2><ed537>: Abbrev Number: 0
 <1><ed538>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed539>   DW_AT_byte_size   : 8
    <ed539>   DW_AT_type        : <0xed510>
 <1><ed53d>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed53e>   DW_AT_name        : (indirect string, offset: 0x18905): __pthread_list_t
    <ed542>   DW_AT_decl_file   : 5
    <ed543>   DW_AT_decl_line   : 53
    <ed544>   DW_AT_decl_column : 3
    <ed545>   DW_AT_type        : <0xed510>
 <1><ed549>: Abbrev Number: 29 (DW_TAG_structure_type)
    <ed54a>   DW_AT_name        : (indirect string, offset: 0x18599): __pthread_mutex_s
    <ed54e>   DW_AT_byte_size   : 40
    <ed54f>   DW_AT_decl_file   : 6
    <ed550>   DW_AT_decl_line   : 22
    <ed551>   DW_AT_decl_column : 8
    <ed552>   DW_AT_sibling     : <0xed5bf>
 <2><ed556>: Abbrev Number: 3 (DW_TAG_member)
    <ed557>   DW_AT_name        : (indirect string, offset: 0x188e1): __lock
    <ed55b>   DW_AT_decl_file   : 6
    <ed55c>   DW_AT_decl_line   : 24
    <ed55d>   DW_AT_decl_column : 7
    <ed55e>   DW_AT_type        : <0xed48c>
    <ed562>   DW_AT_data_member_location: 0
 <2><ed563>: Abbrev Number: 3 (DW_TAG_member)
    <ed564>   DW_AT_name        : (indirect string, offset: 0x18d03): __count
    <ed568>   DW_AT_decl_file   : 6
    <ed569>   DW_AT_decl_line   : 25
    <ed56a>   DW_AT_decl_column : 16
    <ed56b>   DW_AT_type        : <0xed470>
    <ed56f>   DW_AT_data_member_location: 4
 <2><ed570>: Abbrev Number: 3 (DW_TAG_member)
    <ed571>   DW_AT_name        : (indirect string, offset: 0x1885e): __owner
    <ed575>   DW_AT_decl_file   : 6
    <ed576>   DW_AT_decl_line   : 26
    <ed577>   DW_AT_decl_column : 7
    <ed578>   DW_AT_type        : <0xed48c>
    <ed57c>   DW_AT_data_member_location: 8
 <2><ed57d>: Abbrev Number: 3 (DW_TAG_member)
    <ed57e>   DW_AT_name        : (indirect string, offset: 0x1952e): __nusers
    <ed582>   DW_AT_decl_file   : 6
    <ed583>   DW_AT_decl_line   : 28
    <ed584>   DW_AT_decl_column : 16
    <ed585>   DW_AT_type        : <0xed470>
    <ed589>   DW_AT_data_member_location: 12
 <2><ed58a>: Abbrev Number: 3 (DW_TAG_member)
    <ed58b>   DW_AT_name        : (indirect string, offset: 0x18b54): __kind
    <ed58f>   DW_AT_decl_file   : 6
    <ed590>   DW_AT_decl_line   : 32
    <ed591>   DW_AT_decl_column : 7
    <ed592>   DW_AT_type        : <0xed48c>
    <ed596>   DW_AT_data_member_location: 16
 <2><ed597>: Abbrev Number: 3 (DW_TAG_member)
    <ed598>   DW_AT_name        : (indirect string, offset: 0x1950b): __spins
    <ed59c>   DW_AT_decl_file   : 6
    <ed59d>   DW_AT_decl_line   : 34
    <ed59e>   DW_AT_decl_column : 9
    <ed59f>   DW_AT_type        : <0xed485>
    <ed5a3>   DW_AT_data_member_location: 20
 <2><ed5a4>: Abbrev Number: 3 (DW_TAG_member)
    <ed5a5>   DW_AT_name        : (indirect string, offset: 0x19127): __elision
    <ed5a9>   DW_AT_decl_file   : 6
    <ed5aa>   DW_AT_decl_line   : 35
    <ed5ab>   DW_AT_decl_column : 9
    <ed5ac>   DW_AT_type        : <0xed485>
    <ed5b0>   DW_AT_data_member_location: 22
 <2><ed5b1>: Abbrev Number: 3 (DW_TAG_member)
    <ed5b2>   DW_AT_name        : (indirect string, offset: 0x1985e): __list
    <ed5b6>   DW_AT_decl_file   : 6
    <ed5b7>   DW_AT_decl_line   : 36
    <ed5b8>   DW_AT_decl_column : 20
    <ed5b9>   DW_AT_type        : <0xed53d>
    <ed5bd>   DW_AT_data_member_location: 24
 <2><ed5be>: Abbrev Number: 0
 <1><ed5bf>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed5c0>   DW_AT_byte_size   : 8
    <ed5c1>   DW_AT_encoding    : 7	(unsigned)
    <ed5c2>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><ed5c6>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed5c7>   DW_AT_name        : (indirect string, offset: 0x18786): pthread_t
    <ed5cb>   DW_AT_decl_file   : 7
    <ed5cc>   DW_AT_decl_line   : 27
    <ed5cd>   DW_AT_decl_column : 27
    <ed5ce>   DW_AT_type        : <0xed477>
 <1><ed5d2>: Abbrev Number: 46 (DW_TAG_union_type)
    <ed5d3>   DW_AT_byte_size   : 4
    <ed5d4>   DW_AT_decl_file   : 7
    <ed5d4>   DW_AT_decl_line   : 32
    <ed5d5>   DW_AT_decl_column : 9
    <ed5d5>   DW_AT_sibling     : <0xed5f0>
 <2><ed5d9>: Abbrev Number: 22 (DW_TAG_member)
    <ed5da>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <ed5de>   DW_AT_decl_file   : 7
    <ed5de>   DW_AT_decl_line   : 34
    <ed5df>   DW_AT_decl_column : 8
    <ed5e0>   DW_AT_type        : <0xed5f0>
 <2><ed5e4>: Abbrev Number: 22 (DW_TAG_member)
    <ed5e5>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <ed5e9>   DW_AT_decl_file   : 7
    <ed5e9>   DW_AT_decl_line   : 35
    <ed5ea>   DW_AT_decl_column : 7
    <ed5eb>   DW_AT_type        : <0xed48c>
 <2><ed5ef>: Abbrev Number: 0
 <1><ed5f0>: Abbrev Number: 16 (DW_TAG_array_type)
    <ed5f1>   DW_AT_type        : <0xed4db>
    <ed5f5>   DW_AT_sibling     : <0xed600>
 <2><ed5f9>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ed5fa>   DW_AT_type        : <0xed477>
    <ed5fe>   DW_AT_upper_bound : 3
 <2><ed5ff>: Abbrev Number: 0
 <1><ed600>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed601>   DW_AT_name        : (indirect string, offset: 0x190d8): pthread_mutexattr_t
    <ed605>   DW_AT_decl_file   : 7
    <ed606>   DW_AT_decl_line   : 36
    <ed607>   DW_AT_decl_column : 3
    <ed608>   DW_AT_type        : <0xed5d2>
 <1><ed60c>: Abbrev Number: 24 (DW_TAG_const_type)
    <ed60d>   DW_AT_type        : <0xed600>
 <1><ed611>: Abbrev Number: 64 (DW_TAG_union_type)
    <ed612>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <ed616>   DW_AT_byte_size   : 56
    <ed617>   DW_AT_decl_file   : 7
    <ed618>   DW_AT_decl_line   : 56
    <ed619>   DW_AT_decl_column : 7
    <ed61a>   DW_AT_sibling     : <0xed635>
 <2><ed61e>: Abbrev Number: 22 (DW_TAG_member)
    <ed61f>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <ed623>   DW_AT_decl_file   : 7
    <ed623>   DW_AT_decl_line   : 58
    <ed624>   DW_AT_decl_column : 8
    <ed625>   DW_AT_type        : <0xed635>
 <2><ed629>: Abbrev Number: 22 (DW_TAG_member)
    <ed62a>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <ed62e>   DW_AT_decl_file   : 7
    <ed62e>   DW_AT_decl_line   : 59
    <ed62f>   DW_AT_decl_column : 12
    <ed630>   DW_AT_type        : <0xed498>
 <2><ed634>: Abbrev Number: 0
 <1><ed635>: Abbrev Number: 16 (DW_TAG_array_type)
    <ed636>   DW_AT_type        : <0xed4db>
    <ed63a>   DW_AT_sibling     : <0xed645>
 <2><ed63e>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ed63f>   DW_AT_type        : <0xed477>
    <ed643>   DW_AT_upper_bound : 55
 <2><ed644>: Abbrev Number: 0
 <1><ed645>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed646>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <ed64a>   DW_AT_decl_file   : 7
    <ed64b>   DW_AT_decl_line   : 62
    <ed64c>   DW_AT_decl_column : 30
    <ed64d>   DW_AT_type        : <0xed611>
 <1><ed651>: Abbrev Number: 24 (DW_TAG_const_type)
    <ed652>   DW_AT_type        : <0xed645>
 <1><ed656>: Abbrev Number: 46 (DW_TAG_union_type)
    <ed657>   DW_AT_byte_size   : 40
    <ed658>   DW_AT_decl_file   : 7
    <ed658>   DW_AT_decl_line   : 67
    <ed659>   DW_AT_decl_column : 9
    <ed659>   DW_AT_sibling     : <0xed67f>
 <2><ed65d>: Abbrev Number: 22 (DW_TAG_member)
    <ed65e>   DW_AT_name        : (indirect string, offset: 0x18a56): __data
    <ed662>   DW_AT_decl_file   : 7
    <ed662>   DW_AT_decl_line   : 69
    <ed663>   DW_AT_decl_column : 28
    <ed664>   DW_AT_type        : <0xed549>
 <2><ed668>: Abbrev Number: 22 (DW_TAG_member)
    <ed669>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <ed66d>   DW_AT_decl_file   : 7
    <ed66d>   DW_AT_decl_line   : 70
    <ed66e>   DW_AT_decl_column : 8
    <ed66f>   DW_AT_type        : <0xed67f>
 <2><ed673>: Abbrev Number: 22 (DW_TAG_member)
    <ed674>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <ed678>   DW_AT_decl_file   : 7
    <ed678>   DW_AT_decl_line   : 71
    <ed679>   DW_AT_decl_column : 12
    <ed67a>   DW_AT_type        : <0xed498>
 <2><ed67e>: Abbrev Number: 0
 <1><ed67f>: Abbrev Number: 16 (DW_TAG_array_type)
    <ed680>   DW_AT_type        : <0xed4db>
    <ed684>   DW_AT_sibling     : <0xed68f>
 <2><ed688>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ed689>   DW_AT_type        : <0xed477>
    <ed68d>   DW_AT_upper_bound : 39
 <2><ed68e>: Abbrev Number: 0
 <1><ed68f>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed690>   DW_AT_name        : (indirect string, offset: 0x18a90): pthread_mutex_t
    <ed694>   DW_AT_decl_file   : 7
    <ed695>   DW_AT_decl_line   : 72
    <ed696>   DW_AT_decl_column : 3
    <ed697>   DW_AT_type        : <0xed656>
 <1><ed69b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed69c>   DW_AT_byte_size   : 8
    <ed69c>   DW_AT_type        : <0xed6a0>
 <1><ed6a0>: Abbrev Number: 65 (DW_TAG_const_type)
 <1><ed6a1>: Abbrev Number: 29 (DW_TAG_structure_type)
    <ed6a2>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <ed6a6>   DW_AT_byte_size   : 216
    <ed6a7>   DW_AT_decl_file   : 8
    <ed6a8>   DW_AT_decl_line   : 49
    <ed6a9>   DW_AT_decl_column : 8
    <ed6aa>   DW_AT_sibling     : <0xed828>
 <2><ed6ae>: Abbrev Number: 3 (DW_TAG_member)
    <ed6af>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <ed6b3>   DW_AT_decl_file   : 8
    <ed6b4>   DW_AT_decl_line   : 51
    <ed6b5>   DW_AT_decl_column : 7
    <ed6b6>   DW_AT_type        : <0xed48c>
    <ed6ba>   DW_AT_data_member_location: 0
 <2><ed6bb>: Abbrev Number: 3 (DW_TAG_member)
    <ed6bc>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <ed6c0>   DW_AT_decl_file   : 8
    <ed6c1>   DW_AT_decl_line   : 54
    <ed6c2>   DW_AT_decl_column : 9
    <ed6c3>   DW_AT_type        : <0xed4d6>
    <ed6c7>   DW_AT_data_member_location: 8
 <2><ed6c8>: Abbrev Number: 3 (DW_TAG_member)
    <ed6c9>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <ed6cd>   DW_AT_decl_file   : 8
    <ed6ce>   DW_AT_decl_line   : 55
    <ed6cf>   DW_AT_decl_column : 9
    <ed6d0>   DW_AT_type        : <0xed4d6>
    <ed6d4>   DW_AT_data_member_location: 16
 <2><ed6d5>: Abbrev Number: 3 (DW_TAG_member)
    <ed6d6>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <ed6da>   DW_AT_decl_file   : 8
    <ed6db>   DW_AT_decl_line   : 56
    <ed6dc>   DW_AT_decl_column : 9
    <ed6dd>   DW_AT_type        : <0xed4d6>
    <ed6e1>   DW_AT_data_member_location: 24
 <2><ed6e2>: Abbrev Number: 3 (DW_TAG_member)
    <ed6e3>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <ed6e7>   DW_AT_decl_file   : 8
    <ed6e8>   DW_AT_decl_line   : 57
    <ed6e9>   DW_AT_decl_column : 9
    <ed6ea>   DW_AT_type        : <0xed4d6>
    <ed6ee>   DW_AT_data_member_location: 32
 <2><ed6ef>: Abbrev Number: 3 (DW_TAG_member)
    <ed6f0>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <ed6f4>   DW_AT_decl_file   : 8
    <ed6f5>   DW_AT_decl_line   : 58
    <ed6f6>   DW_AT_decl_column : 9
    <ed6f7>   DW_AT_type        : <0xed4d6>
    <ed6fb>   DW_AT_data_member_location: 40
 <2><ed6fc>: Abbrev Number: 3 (DW_TAG_member)
    <ed6fd>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <ed701>   DW_AT_decl_file   : 8
    <ed702>   DW_AT_decl_line   : 59
    <ed703>   DW_AT_decl_column : 9
    <ed704>   DW_AT_type        : <0xed4d6>
    <ed708>   DW_AT_data_member_location: 48
 <2><ed709>: Abbrev Number: 3 (DW_TAG_member)
    <ed70a>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <ed70e>   DW_AT_decl_file   : 8
    <ed70f>   DW_AT_decl_line   : 60
    <ed710>   DW_AT_decl_column : 9
    <ed711>   DW_AT_type        : <0xed4d6>
    <ed715>   DW_AT_data_member_location: 56
 <2><ed716>: Abbrev Number: 3 (DW_TAG_member)
    <ed717>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <ed71b>   DW_AT_decl_file   : 8
    <ed71c>   DW_AT_decl_line   : 61
    <ed71d>   DW_AT_decl_column : 9
    <ed71e>   DW_AT_type        : <0xed4d6>
    <ed722>   DW_AT_data_member_location: 64
 <2><ed723>: Abbrev Number: 3 (DW_TAG_member)
    <ed724>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <ed728>   DW_AT_decl_file   : 8
    <ed729>   DW_AT_decl_line   : 64
    <ed72a>   DW_AT_decl_column : 9
    <ed72b>   DW_AT_type        : <0xed4d6>
    <ed72f>   DW_AT_data_member_location: 72
 <2><ed730>: Abbrev Number: 3 (DW_TAG_member)
    <ed731>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <ed735>   DW_AT_decl_file   : 8
    <ed736>   DW_AT_decl_line   : 65
    <ed737>   DW_AT_decl_column : 9
    <ed738>   DW_AT_type        : <0xed4d6>
    <ed73c>   DW_AT_data_member_location: 80
 <2><ed73d>: Abbrev Number: 3 (DW_TAG_member)
    <ed73e>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <ed742>   DW_AT_decl_file   : 8
    <ed743>   DW_AT_decl_line   : 66
    <ed744>   DW_AT_decl_column : 9
    <ed745>   DW_AT_type        : <0xed4d6>
    <ed749>   DW_AT_data_member_location: 88
 <2><ed74a>: Abbrev Number: 3 (DW_TAG_member)
    <ed74b>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <ed74f>   DW_AT_decl_file   : 8
    <ed750>   DW_AT_decl_line   : 68
    <ed751>   DW_AT_decl_column : 22
    <ed752>   DW_AT_type        : <0xed841>
    <ed756>   DW_AT_data_member_location: 96
 <2><ed757>: Abbrev Number: 3 (DW_TAG_member)
    <ed758>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <ed75c>   DW_AT_decl_file   : 8
    <ed75d>   DW_AT_decl_line   : 70
    <ed75e>   DW_AT_decl_column : 20
    <ed75f>   DW_AT_type        : <0xed846>
    <ed763>   DW_AT_data_member_location: 104
 <2><ed764>: Abbrev Number: 3 (DW_TAG_member)
    <ed765>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <ed769>   DW_AT_decl_file   : 8
    <ed76a>   DW_AT_decl_line   : 72
    <ed76b>   DW_AT_decl_column : 7
    <ed76c>   DW_AT_type        : <0xed48c>
    <ed770>   DW_AT_data_member_location: 112
 <2><ed771>: Abbrev Number: 3 (DW_TAG_member)
    <ed772>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <ed776>   DW_AT_decl_file   : 8
    <ed777>   DW_AT_decl_line   : 73
    <ed778>   DW_AT_decl_column : 7
    <ed779>   DW_AT_type        : <0xed48c>
    <ed77d>   DW_AT_data_member_location: 116
 <2><ed77e>: Abbrev Number: 3 (DW_TAG_member)
    <ed77f>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <ed783>   DW_AT_decl_file   : 8
    <ed784>   DW_AT_decl_line   : 74
    <ed785>   DW_AT_decl_column : 11
    <ed786>   DW_AT_type        : <0xed49f>
    <ed78a>   DW_AT_data_member_location: 120
 <2><ed78b>: Abbrev Number: 3 (DW_TAG_member)
    <ed78c>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <ed790>   DW_AT_decl_file   : 8
    <ed791>   DW_AT_decl_line   : 77
    <ed792>   DW_AT_decl_column : 18
    <ed793>   DW_AT_type        : <0xed469>
    <ed797>   DW_AT_data_member_location: 128
 <2><ed798>: Abbrev Number: 3 (DW_TAG_member)
    <ed799>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <ed79d>   DW_AT_decl_file   : 8
    <ed79e>   DW_AT_decl_line   : 78
    <ed79f>   DW_AT_decl_column : 15
    <ed7a0>   DW_AT_type        : <0xed47e>
    <ed7a4>   DW_AT_data_member_location: 130
 <2><ed7a5>: Abbrev Number: 3 (DW_TAG_member)
    <ed7a6>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <ed7aa>   DW_AT_decl_file   : 8
    <ed7ab>   DW_AT_decl_line   : 79
    <ed7ac>   DW_AT_decl_column : 8
    <ed7ad>   DW_AT_type        : <0xed84b>
    <ed7b1>   DW_AT_data_member_location: 131
 <2><ed7b2>: Abbrev Number: 3 (DW_TAG_member)
    <ed7b3>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <ed7b7>   DW_AT_decl_file   : 8
    <ed7b8>   DW_AT_decl_line   : 81
    <ed7b9>   DW_AT_decl_column : 15
    <ed7ba>   DW_AT_type        : <0xed85b>
    <ed7be>   DW_AT_data_member_location: 136
 <2><ed7bf>: Abbrev Number: 3 (DW_TAG_member)
    <ed7c0>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <ed7c4>   DW_AT_decl_file   : 8
    <ed7c5>   DW_AT_decl_line   : 89
    <ed7c6>   DW_AT_decl_column : 13
    <ed7c7>   DW_AT_type        : <0xed4ab>
    <ed7cb>   DW_AT_data_member_location: 144
 <2><ed7cc>: Abbrev Number: 3 (DW_TAG_member)
    <ed7cd>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <ed7d1>   DW_AT_decl_file   : 8
    <ed7d2>   DW_AT_decl_line   : 91
    <ed7d3>   DW_AT_decl_column : 23
    <ed7d4>   DW_AT_type        : <0xed865>
    <ed7d8>   DW_AT_data_member_location: 152
 <2><ed7d9>: Abbrev Number: 3 (DW_TAG_member)
    <ed7da>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <ed7de>   DW_AT_decl_file   : 8
    <ed7df>   DW_AT_decl_line   : 92
    <ed7e0>   DW_AT_decl_column : 25
    <ed7e1>   DW_AT_type        : <0xed86f>
    <ed7e5>   DW_AT_data_member_location: 160
 <2><ed7e6>: Abbrev Number: 3 (DW_TAG_member)
    <ed7e7>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <ed7eb>   DW_AT_decl_file   : 8
    <ed7ec>   DW_AT_decl_line   : 93
    <ed7ed>   DW_AT_decl_column : 20
    <ed7ee>   DW_AT_type        : <0xed846>
    <ed7f2>   DW_AT_data_member_location: 168
 <2><ed7f3>: Abbrev Number: 3 (DW_TAG_member)
    <ed7f4>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <ed7f8>   DW_AT_decl_file   : 8
    <ed7f9>   DW_AT_decl_line   : 94
    <ed7fa>   DW_AT_decl_column : 9
    <ed7fb>   DW_AT_type        : <0xed4cf>
    <ed7ff>   DW_AT_data_member_location: 176
 <2><ed800>: Abbrev Number: 3 (DW_TAG_member)
    <ed801>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <ed805>   DW_AT_decl_file   : 8
    <ed806>   DW_AT_decl_line   : 95
    <ed807>   DW_AT_decl_column : 10
    <ed808>   DW_AT_type        : <0xed4f3>
    <ed80c>   DW_AT_data_member_location: 184
 <2><ed80d>: Abbrev Number: 3 (DW_TAG_member)
    <ed80e>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <ed812>   DW_AT_decl_file   : 8
    <ed813>   DW_AT_decl_line   : 96
    <ed814>   DW_AT_decl_column : 7
    <ed815>   DW_AT_type        : <0xed48c>
    <ed819>   DW_AT_data_member_location: 192
 <2><ed81a>: Abbrev Number: 3 (DW_TAG_member)
    <ed81b>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <ed81f>   DW_AT_decl_file   : 8
    <ed820>   DW_AT_decl_line   : 98
    <ed821>   DW_AT_decl_column : 8
    <ed822>   DW_AT_type        : <0xed874>
    <ed826>   DW_AT_data_member_location: 196
 <2><ed827>: Abbrev Number: 0
 <1><ed828>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed829>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <ed82d>   DW_AT_decl_file   : 9
    <ed82e>   DW_AT_decl_line   : 7
    <ed82f>   DW_AT_decl_column : 25
    <ed830>   DW_AT_type        : <0xed6a1>
 <1><ed834>: Abbrev Number: 66 (DW_TAG_typedef)
    <ed835>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <ed839>   DW_AT_decl_file   : 8
    <ed83a>   DW_AT_decl_line   : 43
    <ed83b>   DW_AT_decl_column : 14
 <1><ed83c>: Abbrev Number: 36 (DW_TAG_structure_type)
    <ed83d>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <ed841>   DW_AT_declaration : 1
 <1><ed841>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed842>   DW_AT_byte_size   : 8
    <ed842>   DW_AT_type        : <0xed83c>
 <1><ed846>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed847>   DW_AT_byte_size   : 8
    <ed847>   DW_AT_type        : <0xed6a1>
 <1><ed84b>: Abbrev Number: 16 (DW_TAG_array_type)
    <ed84c>   DW_AT_type        : <0xed4db>
    <ed850>   DW_AT_sibling     : <0xed85b>
 <2><ed854>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ed855>   DW_AT_type        : <0xed477>
    <ed859>   DW_AT_upper_bound : 0
 <2><ed85a>: Abbrev Number: 0
 <1><ed85b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed85c>   DW_AT_byte_size   : 8
    <ed85c>   DW_AT_type        : <0xed834>
 <1><ed860>: Abbrev Number: 36 (DW_TAG_structure_type)
    <ed861>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <ed865>   DW_AT_declaration : 1
 <1><ed865>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed866>   DW_AT_byte_size   : 8
    <ed866>   DW_AT_type        : <0xed860>
 <1><ed86a>: Abbrev Number: 36 (DW_TAG_structure_type)
    <ed86b>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <ed86f>   DW_AT_declaration : 1
 <1><ed86f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed870>   DW_AT_byte_size   : 8
    <ed870>   DW_AT_type        : <0xed86a>
 <1><ed874>: Abbrev Number: 16 (DW_TAG_array_type)
    <ed875>   DW_AT_type        : <0xed4db>
    <ed879>   DW_AT_sibling     : <0xed884>
 <2><ed87d>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ed87e>   DW_AT_type        : <0xed477>
    <ed882>   DW_AT_upper_bound : 19
 <2><ed883>: Abbrev Number: 0
 <1><ed884>: Abbrev Number: 30 (DW_TAG_variable)
    <ed885>   DW_AT_name        : (indirect string, offset: 0x1b976): stdin
    <ed889>   DW_AT_decl_file   : 10
    <ed88a>   DW_AT_decl_line   : 137
    <ed88b>   DW_AT_decl_column : 14
    <ed88c>   DW_AT_type        : <0xed890>
    <ed890>   DW_AT_external    : 1
    <ed890>   DW_AT_declaration : 1
 <1><ed890>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed891>   DW_AT_byte_size   : 8
    <ed891>   DW_AT_type        : <0xed828>
 <1><ed895>: Abbrev Number: 28 (DW_TAG_restrict_type)
    <ed896>   DW_AT_type        : <0xed890>
 <1><ed89a>: Abbrev Number: 30 (DW_TAG_variable)
    <ed89b>   DW_AT_name        : (indirect string, offset: 0x1b9ba): stdout
    <ed89f>   DW_AT_decl_file   : 10
    <ed8a0>   DW_AT_decl_line   : 138
    <ed8a1>   DW_AT_decl_column : 14
    <ed8a2>   DW_AT_type        : <0xed890>
    <ed8a6>   DW_AT_external    : 1
    <ed8a6>   DW_AT_declaration : 1
 <1><ed8a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed8a7>   DW_AT_byte_size   : 8
    <ed8a7>   DW_AT_type        : <0xed4d6>
 <1><ed8ab>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed8ac>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <ed8b0>   DW_AT_decl_file   : 11
    <ed8b1>   DW_AT_decl_line   : 23
    <ed8b2>   DW_AT_decl_column : 23
    <ed8b3>   DW_AT_type        : <0xed462>
 <1><ed8b7>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed8b8>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <ed8bc>   DW_AT_decl_file   : 11
    <ed8bd>   DW_AT_decl_line   : 24
    <ed8be>   DW_AT_decl_column : 22
    <ed8bf>   DW_AT_type        : <0xed470>
 <1><ed8c3>: Abbrev Number: 10 (DW_TAG_typedef)
    <ed8c4>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
