    <93906>   DW_AT_type        : <0x9376c>
    <9390a>   DW_AT_sibling     : <0x9391e>
 <2><9390e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9390f>   DW_AT_type        : <0x9376c>
 <2><93913>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93914>   DW_AT_type        : <0x9376c>
 <2><93918>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93919>   DW_AT_type        : <0x937a0>
 <2><9391d>: Abbrev Number: 0
 <1><9391e>: Abbrev Number: 8 (DW_TAG_typedef)
    <9391f>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <93923>   DW_AT_decl_file   : 5
    <93924>   DW_AT_decl_line   : 14
    <93925>   DW_AT_decl_column : 15
    <93926>   DW_AT_type        : <0x9392a>
 <1><9392a>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <9392b>   DW_AT_prototyped  : 1
    <9392b>   DW_AT_sibling     : <0x9395d>
 <2><9392f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93930>   DW_AT_type        : <0x9395d>
 <2><93934>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93935>   DW_AT_type        : <0x9395d>
 <2><93939>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9393a>   DW_AT_type        : <0x93788>
 <2><9393e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9393f>   DW_AT_type        : <0x93788>
 <2><93943>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93944>   DW_AT_type        : <0x93788>
 <2><93948>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93949>   DW_AT_type        : <0x93788>
 <2><9394d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9394e>   DW_AT_type        : <0x93788>
 <2><93952>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93953>   DW_AT_type        : <0x93962>
 <2><93957>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93958>   DW_AT_type        : <0x937a0>
 <2><9395c>: Abbrev Number: 0
 <1><9395d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9395e>   DW_AT_byte_size   : 8
    <9395e>   DW_AT_type        : <0x93759>
 <1><93962>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93963>   DW_AT_byte_size   : 8
    <93963>   DW_AT_type        : <0x938f9>
 <1><93967>: Abbrev Number: 12 (DW_TAG_structure_type)
    <93968>   DW_AT_byte_size   : 16
    <93969>   DW_AT_decl_file   : 5
    <9396a>   DW_AT_decl_line   : 26
    <9396b>   DW_AT_decl_column : 3
    <9396b>   DW_AT_sibling     : <0x939a4>
 <2><9396f>: Abbrev Number: 1 (DW_TAG_member)
    <93970>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <93974>   DW_AT_decl_file   : 5
    <93975>   DW_AT_decl_line   : 27
    <93976>   DW_AT_decl_column : 8
    <93977>   DW_AT_type        : <0x93788>
    <9397b>   DW_AT_data_member_location: 0
 <2><9397c>: Abbrev Number: 1 (DW_TAG_member)
    <9397d>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <93981>   DW_AT_decl_file   : 5
    <93982>   DW_AT_decl_line   : 27
    <93983>   DW_AT_decl_column : 16
    <93984>   DW_AT_type        : <0x93788>
    <93988>   DW_AT_data_member_location: 4
 <2><93989>: Abbrev Number: 1 (DW_TAG_member)
    <9398a>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <9398e>   DW_AT_decl_file   : 5
    <9398f>   DW_AT_decl_line   : 27
    <93990>   DW_AT_decl_column : 24
    <93991>   DW_AT_type        : <0x93788>
    <93995>   DW_AT_data_member_location: 8
 <2><93996>: Abbrev Number: 1 (DW_TAG_member)
    <93997>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <9399b>   DW_AT_decl_file   : 5
    <9399c>   DW_AT_decl_line   : 27
    <9399d>   DW_AT_decl_column : 32
    <9399e>   DW_AT_type        : <0x93788>
    <939a2>   DW_AT_data_member_location: 12
 <2><939a3>: Abbrev Number: 0
 <1><939a4>: Abbrev Number: 16 (DW_TAG_union_type)
    <939a5>   DW_AT_byte_size   : 16
    <939a5>   DW_AT_decl_file   : 5
    <939a6>   DW_AT_decl_line   : 25
    <939a7>   DW_AT_decl_column : 2
    <939a7>   DW_AT_sibling     : <0x939bc>
 <2><939ab>: Abbrev Number: 13 (DW_TAG_member)
    <939ac>   DW_AT_type        : <0x93967>
 <2><939b0>: Abbrev Number: 17 (DW_TAG_member)
    <939b1>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <939b5>   DW_AT_decl_file   : 5
    <939b6>   DW_AT_decl_line   : 29
    <939b7>   DW_AT_decl_column : 7
    <939b7>   DW_AT_type        : <0x939bc>
 <2><939bb>: Abbrev Number: 0
 <1><939bc>: Abbrev Number: 20 (DW_TAG_array_type)
    <939bd>   DW_AT_type        : <0x93788>
    <939c1>   DW_AT_sibling     : <0x939cc>
 <2><939c5>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <939c6>   DW_AT_type        : <0x93773>
    <939ca>   DW_AT_upper_bound : 3
 <2><939cb>: Abbrev Number: 0
 <1><939cc>: Abbrev Number: 12 (DW_TAG_structure_type)
    <939cd>   DW_AT_byte_size   : 16
    <939ce>   DW_AT_decl_file   : 5
    <939cf>   DW_AT_decl_line   : 32
    <939d0>   DW_AT_decl_column : 3
    <939d0>   DW_AT_sibling     : <0x93a09>
 <2><939d4>: Abbrev Number: 1 (DW_TAG_member)
    <939d5>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <939d9>   DW_AT_decl_file   : 5
    <939da>   DW_AT_decl_line   : 33
    <939db>   DW_AT_decl_column : 8
    <939dc>   DW_AT_type        : <0x93788>
    <939e0>   DW_AT_data_member_location: 0
 <2><939e1>: Abbrev Number: 1 (DW_TAG_member)
    <939e2>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <939e6>   DW_AT_decl_file   : 5
    <939e7>   DW_AT_decl_line   : 33
    <939e8>   DW_AT_decl_column : 20
    <939e9>   DW_AT_type        : <0x93788>
    <939ed>   DW_AT_data_member_location: 4
 <2><939ee>: Abbrev Number: 1 (DW_TAG_member)
    <939ef>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <939f3>   DW_AT_decl_file   : 5
    <939f4>   DW_AT_decl_line   : 33
    <939f5>   DW_AT_decl_column : 32
    <939f6>   DW_AT_type        : <0x93788>
    <939fa>   DW_AT_data_member_location: 8
 <2><939fb>: Abbrev Number: 1 (DW_TAG_member)
    <939fc>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <93a00>   DW_AT_decl_file   : 5
    <93a01>   DW_AT_decl_line   : 33
    <93a02>   DW_AT_decl_column : 44
    <93a03>   DW_AT_type        : <0x93788>
    <93a07>   DW_AT_data_member_location: 12
 <2><93a08>: Abbrev Number: 0
 <1><93a09>: Abbrev Number: 16 (DW_TAG_union_type)
    <93a0a>   DW_AT_byte_size   : 16
    <93a0a>   DW_AT_decl_file   : 5
    <93a0b>   DW_AT_decl_line   : 31
    <93a0c>   DW_AT_decl_column : 2
    <93a0c>   DW_AT_sibling     : <0x93a21>
 <2><93a10>: Abbrev Number: 13 (DW_TAG_member)
    <93a11>   DW_AT_type        : <0x939cc>
 <2><93a15>: Abbrev Number: 17 (DW_TAG_member)
    <93a16>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <93a1a>   DW_AT_decl_file   : 5
    <93a1b>   DW_AT_decl_line   : 35
    <93a1c>   DW_AT_decl_column : 7
    <93a1c>   DW_AT_type        : <0x939bc>
 <2><93a20>: Abbrev Number: 0
 <1><93a21>: Abbrev Number: 11 (DW_TAG_structure_type)
    <93a22>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <93a26>   DW_AT_byte_size   : 216
    <93a27>   DW_AT_decl_file   : 5
    <93a28>   DW_AT_decl_line   : 16
    <93a29>   DW_AT_decl_column : 16
    <93a2a>   DW_AT_sibling     : <0x93b3e>
 <2><93a2e>: Abbrev Number: 5 (DW_TAG_member)
    <93a2f>   DW_AT_name        : id
    <93a32>   DW_AT_decl_file   : 5
    <93a33>   DW_AT_decl_line   : 17
    <93a34>   DW_AT_decl_column : 6
    <93a35>   DW_AT_type        : <0x93788>
    <93a39>   DW_AT_data_member_location: 0
 <2><93a3a>: Abbrev Number: 1 (DW_TAG_member)
    <93a3b>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <93a3f>   DW_AT_decl_file   : 5
    <93a40>   DW_AT_decl_line   : 18
    <93a41>   DW_AT_decl_column : 6
    <93a42>   DW_AT_type        : <0x93788>
    <93a46>   DW_AT_data_member_location: 4
 <2><93a47>: Abbrev Number: 1 (DW_TAG_member)
    <93a48>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <93a4c>   DW_AT_decl_file   : 5
    <93a4d>   DW_AT_decl_line   : 19
    <93a4e>   DW_AT_decl_column : 18
    <93a4f>   DW_AT_type        : <0x93b3e>
    <93a53>   DW_AT_data_member_location: 8
 <2><93a54>: Abbrev Number: 1 (DW_TAG_member)
    <93a55>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <93a59>   DW_AT_decl_file   : 5
    <93a5a>   DW_AT_decl_line   : 20
    <93a5b>   DW_AT_decl_column : 6
    <93a5c>   DW_AT_type        : <0x93788>
    <93a60>   DW_AT_data_member_location: 16
 <2><93a61>: Abbrev Number: 1 (DW_TAG_member)
    <93a62>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <93a66>   DW_AT_decl_file   : 5
    <93a67>   DW_AT_decl_line   : 21
    <93a68>   DW_AT_decl_column : 6
    <93a69>   DW_AT_type        : <0x93788>
    <93a6d>   DW_AT_data_member_location: 20
 <2><93a6e>: Abbrev Number: 1 (DW_TAG_member)
    <93a6f>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <93a73>   DW_AT_decl_file   : 5
    <93a74>   DW_AT_decl_line   : 22
    <93a75>   DW_AT_decl_column : 6
    <93a76>   DW_AT_type        : <0x93788>
    <93a7a>   DW_AT_data_member_location: 24
 <2><93a7b>: Abbrev Number: 1 (DW_TAG_member)
    <93a7c>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <93a80>   DW_AT_decl_file   : 5
    <93a81>   DW_AT_decl_line   : 23
    <93a82>   DW_AT_decl_column : 8
    <93a83>   DW_AT_type        : <0x937a0>
    <93a87>   DW_AT_data_member_location: 32
 <2><93a88>: Abbrev Number: 1 (DW_TAG_member)
    <93a89>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <93a8d>   DW_AT_decl_file   : 5
    <93a8e>   DW_AT_decl_line   : 24
    <93a8f>   DW_AT_decl_column : 8
    <93a90>   DW_AT_type        : <0x937e2>
    <93a94>   DW_AT_data_member_location: 40
 <2><93a95>: Abbrev Number: 1 (DW_TAG_member)
    <93a96>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <93a9a>   DW_AT_decl_file   : 5
    <93a9b>   DW_AT_decl_line   : 24
    <93a9c>   DW_AT_decl_column : 16
    <93a9d>   DW_AT_type        : <0x937e2>
    <93aa1>   DW_AT_data_member_location: 44
 <2><93aa2>: Abbrev Number: 18 (DW_TAG_member)
    <93aa3>   DW_AT_type        : <0x939a4>
    <93aa7>   DW_AT_data_member_location: 48
 <2><93aa8>: Abbrev Number: 18 (DW_TAG_member)
    <93aa9>   DW_AT_type        : <0x93a09>
    <93aad>   DW_AT_data_member_location: 64
 <2><93aae>: Abbrev Number: 1 (DW_TAG_member)
    <93aaf>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <93ab3>   DW_AT_decl_file   : 5
    <93ab4>   DW_AT_decl_line   : 37
    <93ab5>   DW_AT_decl_column : 8
    <93ab6>   DW_AT_type        : <0x937e2>
    <93aba>   DW_AT_data_member_location: 80
 <2><93abb>: Abbrev Number: 1 (DW_TAG_member)
    <93abc>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <93ac0>   DW_AT_decl_file   : 5
    <93ac1>   DW_AT_decl_line   : 37
    <93ac2>   DW_AT_decl_column : 15
    <93ac3>   DW_AT_type        : <0x937e2>
    <93ac7>   DW_AT_data_member_location: 84
 <2><93ac8>: Abbrev Number: 1 (DW_TAG_member)
    <93ac9>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <93acd>   DW_AT_decl_file   : 5
    <93ace>   DW_AT_decl_line   : 37
    <93acf>   DW_AT_decl_column : 22
    <93ad0>   DW_AT_type        : <0x937e2>
    <93ad4>   DW_AT_data_member_location: 88
 <2><93ad5>: Abbrev Number: 1 (DW_TAG_member)
    <93ad6>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <93ada>   DW_AT_decl_file   : 5
    <93adb>   DW_AT_decl_line   : 37
    <93adc>   DW_AT_decl_column : 29
    <93add>   DW_AT_type        : <0x937e2>
    <93ae1>   DW_AT_data_member_location: 92
 <2><93ae2>: Abbrev Number: 1 (DW_TAG_member)
    <93ae3>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <93ae7>   DW_AT_decl_file   : 5
    <93ae8>   DW_AT_decl_line   : 38
    <93ae9>   DW_AT_decl_column : 15
    <93aea>   DW_AT_type        : <0x9376c>
    <93aee>   DW_AT_data_member_location: 96
 <2><93aef>: Abbrev Number: 1 (DW_TAG_member)
    <93af0>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <93af4>   DW_AT_decl_file   : 5
    <93af5>   DW_AT_decl_line   : 38
    <93af6>   DW_AT_decl_column : 25
    <93af7>   DW_AT_type        : <0x9376c>
    <93afb>   DW_AT_data_member_location: 100
 <2><93afc>: Abbrev Number: 1 (DW_TAG_member)
    <93afd>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <93b01>   DW_AT_decl_file   : 5
    <93b02>   DW_AT_decl_line   : 39
    <93b03>   DW_AT_decl_column : 9
    <93b04>   DW_AT_type        : <0x93b62>
    <93b08>   DW_AT_data_member_location: 104
 <2><93b09>: Abbrev Number: 1 (DW_TAG_member)
    <93b0a>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <93b0e>   DW_AT_decl_file   : 5
    <93b0f>   DW_AT_decl_line   : 40
    <93b10>   DW_AT_decl_column : 17
    <93b11>   DW_AT_type        : <0x93b80>
    <93b15>   DW_AT_data_member_location: 112
 <2><93b16>: Abbrev Number: 1 (DW_TAG_member)
    <93b17>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <93b1b>   DW_AT_decl_file   : 5
    <93b1c>   DW_AT_decl_line   : 41
    <93b1d>   DW_AT_decl_column : 10
    <93b1e>   DW_AT_type        : <0x93b9e>
    <93b22>   DW_AT_data_member_location: 120
 <2><93b23>: Abbrev Number: 1 (DW_TAG_member)
    <93b24>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <93b28>   DW_AT_decl_file   : 5
    <93b29>   DW_AT_decl_line   : 42
    <93b2a>   DW_AT_decl_column : 11
    <93b2b>   DW_AT_type        : <0x93ba3>
    <93b2f>   DW_AT_data_member_location: 128
 <2><93b30>: Abbrev Number: 1 (DW_TAG_member)
    <93b31>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <93b35>   DW_AT_decl_file   : 5
    <93b36>   DW_AT_decl_line   : 43
    <93b37>   DW_AT_decl_column : 6
    <93b38>   DW_AT_type        : <0x93788>
    <93b3c>   DW_AT_data_member_location: 208
 <2><93b3d>: Abbrev Number: 0
 <1><93b3e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b3f>   DW_AT_byte_size   : 8
    <93b3f>   DW_AT_type        : <0x9395d>
 <1><93b43>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <93b44>   DW_AT_prototyped  : 1
    <93b44>   DW_AT_sibling     : <0x93b5d>
 <2><93b48>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b49>   DW_AT_type        : <0x93b5d>
 <2><93b4d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b4e>   DW_AT_type        : <0x93788>
 <2><93b52>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b53>   DW_AT_type        : <0x93788>
 <2><93b57>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b58>   DW_AT_type        : <0x9376c>
 <2><93b5c>: Abbrev Number: 0
 <1><93b5d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b5e>   DW_AT_byte_size   : 8
    <93b5e>   DW_AT_type        : <0x93a21>
 <1><93b62>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b63>   DW_AT_byte_size   : 8
    <93b63>   DW_AT_type        : <0x93b43>
 <1><93b67>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <93b68>   DW_AT_prototyped  : 1
    <93b68>   DW_AT_type        : <0x9376c>
    <93b6c>   DW_AT_sibling     : <0x93b80>
 <2><93b70>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b71>   DW_AT_type        : <0x93b5d>
 <2><93b75>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b76>   DW_AT_type        : <0x93788>
 <2><93b7a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b7b>   DW_AT_type        : <0x93788>
 <2><93b7f>: Abbrev Number: 0
 <1><93b80>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b81>   DW_AT_byte_size   : 8
    <93b81>   DW_AT_type        : <0x93b67>
 <1><93b85>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <93b86>   DW_AT_prototyped  : 1
    <93b86>   DW_AT_type        : <0x937a0>
    <93b8a>   DW_AT_sibling     : <0x93b9e>
 <2><93b8e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b8f>   DW_AT_type        : <0x937a0>
 <2><93b93>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b94>   DW_AT_type        : <0x93788>
 <2><93b98>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93b99>   DW_AT_type        : <0x937ae>
 <2><93b9d>: Abbrev Number: 0
 <1><93b9e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b9f>   DW_AT_byte_size   : 8
    <93b9f>   DW_AT_type        : <0x93b85>
 <1><93ba3>: Abbrev Number: 20 (DW_TAG_array_type)
    <93ba4>   DW_AT_type        : <0x93bb3>
    <93ba8>   DW_AT_sibling     : <0x93bb3>
 <2><93bac>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <93bad>   DW_AT_type        : <0x93773>
    <93bb1>   DW_AT_upper_bound : 9
 <2><93bb2>: Abbrev Number: 0
 <1><93bb3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93bb4>   DW_AT_byte_size   : 8
    <93bb4>   DW_AT_type        : <0x93bb8>
 <1><93bb8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93bb9>   DW_AT_byte_size   : 8
    <93bb9>   DW_AT_type        : <0x9391e>
 <1><93bbd>: Abbrev Number: 8 (DW_TAG_typedef)
    <93bbe>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <93bc2>   DW_AT_decl_file   : 5
    <93bc3>   DW_AT_decl_line   : 44
    <93bc4>   DW_AT_decl_column : 3
    <93bc5>   DW_AT_type        : <0x93a21>
 <1><93bc9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <93bca>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <93bce>   DW_AT_byte_size   : 12
    <93bcf>   DW_AT_decl_file   : 6
    <93bd0>   DW_AT_decl_line   : 139
    <93bd1>   DW_AT_decl_column : 16
    <93bd2>   DW_AT_sibling     : <0x93bfb>
 <2><93bd6>: Abbrev Number: 5 (DW_TAG_member)
    <93bd7>   DW_AT_name        : ch
    <93bda>   DW_AT_decl_file   : 6
    <93bdb>   DW_AT_decl_line   : 140
    <93bdc>   DW_AT_decl_column : 14
    <93bdd>   DW_AT_type        : <0x937ba>
    <93be1>   DW_AT_data_member_location: 0
 <2><93be2>: Abbrev Number: 5 (DW_TAG_member)
    <93be3>   DW_AT_name        : fg
    <93be6>   DW_AT_decl_file   : 6
    <93be7>   DW_AT_decl_line   : 141
    <93be8>   DW_AT_decl_column : 14
    <93be9>   DW_AT_type        : <0x9376c>
    <93bed>   DW_AT_data_member_location: 4
 <2><93bee>: Abbrev Number: 5 (DW_TAG_member)
    <93bef>   DW_AT_name        : bg
    <93bf2>   DW_AT_decl_file   : 6
    <93bf3>   DW_AT_decl_line   : 141
    <93bf4>   DW_AT_decl_column : 18
    <93bf5>   DW_AT_type        : <0x9376c>
    <93bf9>   DW_AT_data_member_location: 8
 <2><93bfa>: Abbrev Number: 0
 <1><93bfb>: Abbrev Number: 8 (DW_TAG_typedef)
    <93bfc>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <93c00>   DW_AT_decl_file   : 6
    <93c01>   DW_AT_decl_line   : 142
    <93c02>   DW_AT_decl_column : 3
    <93c03>   DW_AT_type        : <0x93bc9>
 <1><93c07>: Abbrev Number: 11 (DW_TAG_structure_type)
    <93c08>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <93c0c>   DW_AT_byte_size   : 208
    <93c0d>   DW_AT_decl_file   : 6
    <93c0e>   DW_AT_decl_line   : 144
    <93c0f>   DW_AT_decl_column : 16
    <93c10>   DW_AT_sibling     : <0x93dca>
 <2><93c14>: Abbrev Number: 5 (DW_TAG_member)
    <93c15>   DW_AT_name        : id
    <93c18>   DW_AT_decl_file   : 6
    <93c19>   DW_AT_decl_line   : 146
    <93c1a>   DW_AT_decl_column : 6
    <93c1b>   DW_AT_type        : <0x93788>
    <93c1f>   DW_AT_data_member_location: 0
 <2><93c20>: Abbrev Number: 1 (DW_TAG_member)
    <93c21>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <93c25>   DW_AT_decl_file   : 6
    <93c26>   DW_AT_decl_line   : 147
    <93c27>   DW_AT_decl_column : 9
    <93c28>   DW_AT_type        : <0x93788>
    <93c2c>   DW_AT_data_member_location: 4
 <2><93c2d>: Abbrev Number: 1 (DW_TAG_member)
    <93c2e>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <93c32>   DW_AT_decl_file   : 6
    <93c33>   DW_AT_decl_line   : 148
    <93c34>   DW_AT_decl_column : 21
    <93c35>   DW_AT_type        : <0x93b3e>
    <93c39>   DW_AT_data_member_location: 8
 <2><93c3a>: Abbrev Number: 1 (DW_TAG_member)
    <93c3b>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <93c3f>   DW_AT_decl_file   : 6
    <93c40>   DW_AT_decl_line   : 149
    <93c41>   DW_AT_decl_column : 9
    <93c42>   DW_AT_type        : <0x93788>
    <93c46>   DW_AT_data_member_location: 16
 <2><93c47>: Abbrev Number: 1 (DW_TAG_member)
    <93c48>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <93c4c>   DW_AT_decl_file   : 6
    <93c4d>   DW_AT_decl_line   : 150
    <93c4e>   DW_AT_decl_column : 9
    <93c4f>   DW_AT_type        : <0x93788>
    <93c53>   DW_AT_data_member_location: 20
 <2><93c54>: Abbrev Number: 1 (DW_TAG_member)
    <93c55>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <93c59>   DW_AT_decl_file   : 6
    <93c5a>   DW_AT_decl_line   : 151
    <93c5b>   DW_AT_decl_column : 20
    <93c5c>   DW_AT_type        : <0x9395d>
    <93c60>   DW_AT_data_member_location: 24
 <2><93c61>: Abbrev Number: 5 (DW_TAG_member)
    <93c62>   DW_AT_name        : w
    <93c64>   DW_AT_decl_file   : 6
    <93c65>   DW_AT_decl_line   : 152
    <93c66>   DW_AT_decl_column : 9
    <93c67>   DW_AT_type        : <0x93788>
    <93c6b>   DW_AT_data_member_location: 32
 <2><93c6c>: Abbrev Number: 5 (DW_TAG_member)
    <93c6d>   DW_AT_name        : h
    <93c6f>   DW_AT_decl_file   : 6
    <93c70>   DW_AT_decl_line   : 152
    <93c71>   DW_AT_decl_column : 12
    <93c72>   DW_AT_type        : <0x93788>
    <93c76>   DW_AT_data_member_location: 36
 <2><93c77>: Abbrev Number: 1 (DW_TAG_member)
    <93c78>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <93c7c>   DW_AT_decl_file   : 6
    <93c7d>   DW_AT_decl_line   : 153
    <93c7e>   DW_AT_decl_column : 9
    <93c7f>   DW_AT_type        : <0x93788>
    <93c83>   DW_AT_data_member_location: 40
 <2><93c84>: Abbrev Number: 5 (DW_TAG_member)
    <93c85>   DW_AT_name        : bpp
    <93c89>   DW_AT_decl_file   : 6
    <93c8a>   DW_AT_decl_line   : 154
    <93c8b>   DW_AT_decl_column : 9
    <93c8c>   DW_AT_type        : <0x93788>
    <93c90>   DW_AT_data_member_location: 44
 <2><93c91>: Abbrev Number: 1 (DW_TAG_member)
    <93c92>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <93c96>   DW_AT_decl_file   : 6
    <93c97>   DW_AT_decl_line   : 155
    <93c98>   DW_AT_decl_column : 9
    <93c99>   DW_AT_type        : <0x93788>
    <93c9d>   DW_AT_data_member_location: 48
 <2><93c9e>: Abbrev Number: 1 (DW_TAG_member)
    <93c9f>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <93ca3>   DW_AT_decl_file   : 6
    <93ca4>   DW_AT_decl_line   : 156
    <93ca5>   DW_AT_decl_column : 19
    <93ca6>   DW_AT_type        : <0x93dca>
    <93caa>   DW_AT_data_member_location: 56
 <2><93cab>: Abbrev Number: 1 (DW_TAG_member)
    <93cac>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <93cb0>   DW_AT_decl_file   : 6
    <93cb1>   DW_AT_decl_line   : 157
    <93cb2>   DW_AT_decl_column : 19
    <93cb3>   DW_AT_type        : <0x93dca>
    <93cb7>   DW_AT_data_member_location: 64
 <2><93cb8>: Abbrev Number: 1 (DW_TAG_member)
    <93cb9>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <93cbd>   DW_AT_decl_file   : 6
    <93cbe>   DW_AT_decl_line   : 158
    <93cbf>   DW_AT_decl_column : 20
    <93cc0>   DW_AT_type        : <0x9395d>
    <93cc4>   DW_AT_data_member_location: 72
 <2><93cc5>: Abbrev Number: 1 (DW_TAG_member)
    <93cc6>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <93cca>   DW_AT_decl_file   : 6
    <93ccb>   DW_AT_decl_line   : 159
    <93ccc>   DW_AT_decl_column : 11
    <93ccd>   DW_AT_type        : <0x937a2>
    <93cd1>   DW_AT_data_member_location: 80
 <2><93cd2>: Abbrev Number: 1 (DW_TAG_member)
    <93cd3>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <93cd7>   DW_AT_decl_file   : 6
    <93cd8>   DW_AT_decl_line   : 160
    <93cd9>   DW_AT_decl_column : 29
    <93cda>   DW_AT_type        : <0x93e98>
    <93cde>   DW_AT_data_member_location: 88
 <2><93cdf>: Abbrev Number: 1 (DW_TAG_member)
    <93ce0>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <93ce4>   DW_AT_decl_file   : 6
    <93ce5>   DW_AT_decl_line   : 161
    <93ce6>   DW_AT_decl_column : 9
    <93ce7>   DW_AT_type        : <0x93788>
    <93ceb>   DW_AT_data_member_location: 96
 <2><93cec>: Abbrev Number: 1 (DW_TAG_member)
    <93ced>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <93cf1>   DW_AT_decl_file   : 6
    <93cf2>   DW_AT_decl_line   : 162
    <93cf3>   DW_AT_decl_column : 27
    <93cf4>   DW_AT_type        : <0x93ec8>
    <93cf8>   DW_AT_data_member_location: 104
 <2><93cf9>: Abbrev Number: 1 (DW_TAG_member)
    <93cfa>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <93cfe>   DW_AT_decl_file   : 6
    <93cff>   DW_AT_decl_line   : 163
    <93d00>   DW_AT_decl_column : 9
    <93d01>   DW_AT_type        : <0x93788>
    <93d05>   DW_AT_data_member_location: 112
 <2><93d06>: Abbrev Number: 1 (DW_TAG_member)
    <93d07>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <93d0b>   DW_AT_decl_file   : 6
    <93d0c>   DW_AT_decl_line   : 164
    <93d0d>   DW_AT_decl_column : 9
    <93d0e>   DW_AT_type        : <0x93788>
    <93d12>   DW_AT_data_member_location: 116
 <2><93d13>: Abbrev Number: 1 (DW_TAG_member)
    <93d14>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <93d18>   DW_AT_decl_file   : 6
    <93d19>   DW_AT_decl_line   : 164
    <93d1a>   DW_AT_decl_column : 19
    <93d1b>   DW_AT_type        : <0x93788>
    <93d1f>   DW_AT_data_member_location: 120
 <2><93d20>: Abbrev Number: 1 (DW_TAG_member)
    <93d21>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <93d25>   DW_AT_decl_file   : 6
    <93d26>   DW_AT_decl_line   : 165
    <93d27>   DW_AT_decl_column : 24
    <93d28>   DW_AT_type        : <0x93eff>
    <93d2c>   DW_AT_data_member_location: 128
 <2><93d2d>: Abbrev Number: 1 (DW_TAG_member)
    <93d2e>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <93d32>   DW_AT_decl_file   : 6
    <93d33>   DW_AT_decl_line   : 166
    <93d34>   DW_AT_decl_column : 9
    <93d35>   DW_AT_type        : <0x93788>
    <93d39>   DW_AT_data_member_location: 136
 <2><93d3a>: Abbrev Number: 1 (DW_TAG_member)
    <93d3b>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <93d3f>   DW_AT_decl_file   : 6
    <93d40>   DW_AT_decl_line   : 166
    <93d41>   DW_AT_decl_column : 17
    <93d42>   DW_AT_type        : <0x93788>
    <93d46>   DW_AT_data_member_location: 140
 <2><93d47>: Abbrev Number: 1 (DW_TAG_member)
    <93d48>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <93d4c>   DW_AT_decl_file   : 6
    <93d4d>   DW_AT_decl_line   : 167
    <93d4e>   DW_AT_decl_column : 11
    <93d4f>   DW_AT_type        : <0x937e2>
    <93d53>   DW_AT_data_member_location: 144
 <2><93d54>: Abbrev Number: 5 (DW_TAG_member)
    <93d55>   DW_AT_name        : key
    <93d59>   DW_AT_decl_file   : 6
    <93d5a>   DW_AT_decl_line   : 168
    <93d5b>   DW_AT_decl_column : 11
    <93d5c>   DW_AT_type        : <0x937a2>
    <93d60>   DW_AT_data_member_location: 152
 <2><93d61>: Abbrev Number: 1 (DW_TAG_member)
    <93d62>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <93d66>   DW_AT_decl_file   : 6
    <93d67>   DW_AT_decl_line   : 169
    <93d68>   DW_AT_decl_column : 6
    <93d69>   DW_AT_type        : <0x93788>
    <93d6d>   DW_AT_data_member_location: 160
 <2><93d6e>: Abbrev Number: 1 (DW_TAG_member)
    <93d6f>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <93d73>   DW_AT_decl_file   : 6
    <93d74>   DW_AT_decl_line   : 170
    <93d75>   DW_AT_decl_column : 18
    <93d76>   DW_AT_type        : <0x93f04>
    <93d7a>   DW_AT_data_member_location: 168
 <2><93d7b>: Abbrev Number: 1 (DW_TAG_member)
    <93d7c>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <93d80>   DW_AT_decl_file   : 6
    <93d81>   DW_AT_decl_line   : 171
    <93d82>   DW_AT_decl_column : 12
    <93d83>   DW_AT_type        : <0x938f4>
    <93d87>   DW_AT_data_member_location: 176
 <2><93d88>: Abbrev Number: 1 (DW_TAG_member)
    <93d89>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <93d8d>   DW_AT_decl_file   : 6
    <93d8e>   DW_AT_decl_line   : 172
    <93d8f>   DW_AT_decl_column : 9
    <93d90>   DW_AT_type        : <0x93788>
    <93d94>   DW_AT_data_member_location: 184
 <2><93d95>: Abbrev Number: 1 (DW_TAG_member)
    <93d96>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <93d9a>   DW_AT_decl_file   : 6
    <93d9b>   DW_AT_decl_line   : 172
    <93d9c>   DW_AT_decl_column : 21
    <93d9d>   DW_AT_type        : <0x93788>
    <93da1>   DW_AT_data_member_location: 188
 <2><93da2>: Abbrev Number: 1 (DW_TAG_member)
    <93da3>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <93da7>   DW_AT_decl_file   : 6
    <93da8>   DW_AT_decl_line   : 173
    <93da9>   DW_AT_decl_column : 11
    <93daa>   DW_AT_type        : <0x93f0e>
    <93dae>   DW_AT_data_member_location: 192
 <2><93daf>: Abbrev Number: 1 (DW_TAG_member)
    <93db0>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <93db4>   DW_AT_decl_file   : 6
    <93db5>   DW_AT_decl_line   : 174
    <93db6>   DW_AT_decl_column : 15
    <93db7>   DW_AT_type        : <0x9378f>
    <93dbb>   DW_AT_data_member_location: 200
 <2><93dbc>: Abbrev Number: 1 (DW_TAG_member)
    <93dbd>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <93dc1>   DW_AT_decl_file   : 6
    <93dc2>   DW_AT_decl_line   : 175
    <93dc3>   DW_AT_decl_column : 6
    <93dc4>   DW_AT_type        : <0x93788>
    <93dc8>   DW_AT_data_member_location: 204
 <2><93dc9>: Abbrev Number: 0
 <1><93dca>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93dcb>   DW_AT_byte_size   : 8
    <93dcb>   DW_AT_type        : <0x9376c>
 <1><93dcf>: Abbrev Number: 11 (DW_TAG_structure_type)
    <93dd0>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <93dd4>   DW_AT_byte_size   : 112
    <93dd5>   DW_AT_decl_file   : 6
    <93dd6>   DW_AT_decl_line   : 178
    <93dd7>   DW_AT_decl_column : 16
    <93dd8>   DW_AT_sibling     : <0x93e93>
 <2><93ddc>: Abbrev Number: 1 (DW_TAG_member)
    <93ddd>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <93de1>   DW_AT_decl_file   : 6
    <93de2>   DW_AT_decl_line   : 188
    <93de3>   DW_AT_decl_column : 8
    <93de4>   DW_AT_type        : <0x937a2>
    <93de8>   DW_AT_data_member_location: 0
 <2><93de9>: Abbrev Number: 1 (DW_TAG_member)
    <93dea>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <93dee>   DW_AT_decl_file   : 6
    <93def>   DW_AT_decl_line   : 208
    <93df0>   DW_AT_decl_column : 8
    <93df1>   DW_AT_type        : <0x93f47>
    <93df5>   DW_AT_data_member_location: 8
 <2><93df6>: Abbrev Number: 1 (DW_TAG_member)
    <93df7>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <93dfb>   DW_AT_decl_file   : 6
    <93dfc>   DW_AT_decl_line   : 222
    <93dfd>   DW_AT_decl_column : 9
    <93dfe>   DW_AT_type        : <0x937d5>
    <93e02>   DW_AT_data_member_location: 16
 <2><93e03>: Abbrev Number: 1 (DW_TAG_member)
    <93e04>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <93e08>   DW_AT_decl_file   : 6
    <93e09>   DW_AT_decl_line   : 231
    <93e0a>   DW_AT_decl_column : 9
    <93e0b>   DW_AT_type        : <0x937d5>
    <93e0f>   DW_AT_data_member_location: 24
 <2><93e10>: Abbrev Number: 1 (DW_TAG_member)
    <93e11>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <93e15>   DW_AT_decl_file   : 6
    <93e16>   DW_AT_decl_line   : 239
    <93e17>   DW_AT_decl_column : 9
    <93e18>   DW_AT_type        : <0x937d5>
    <93e1c>   DW_AT_data_member_location: 32
 <2><93e1d>: Abbrev Number: 1 (DW_TAG_member)
    <93e1e>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <93e22>   DW_AT_decl_file   : 6
    <93e23>   DW_AT_decl_line   : 248
    <93e24>   DW_AT_decl_column : 9
    <93e25>   DW_AT_type        : <0x93f66>
    <93e29>   DW_AT_data_member_location: 40
 <2><93e2a>: Abbrev Number: 7 (DW_TAG_member)
    <93e2b>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <93e2f>   DW_AT_decl_file   : 6
    <93e2f>   DW_AT_decl_line   : 258
    <93e31>   DW_AT_decl_column : 9
    <93e32>   DW_AT_type        : <0x937d5>
    <93e36>   DW_AT_data_member_location: 48
 <2><93e37>: Abbrev Number: 7 (DW_TAG_member)
    <93e38>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <93e3c>   DW_AT_decl_file   : 6
    <93e3c>   DW_AT_decl_line   : 274
    <93e3e>   DW_AT_decl_column : 8
    <93e3f>   DW_AT_type        : <0x938cc>
    <93e43>   DW_AT_data_member_location: 56
 <2><93e44>: Abbrev Number: 7 (DW_TAG_member)
    <93e45>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <93e49>   DW_AT_decl_file   : 6
    <93e49>   DW_AT_decl_line   : 285
    <93e4b>   DW_AT_decl_column : 9
    <93e4c>   DW_AT_type        : <0x93f66>
    <93e50>   DW_AT_data_member_location: 64
 <2><93e51>: Abbrev Number: 7 (DW_TAG_member)
    <93e52>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <93e56>   DW_AT_decl_file   : 6
    <93e56>   DW_AT_decl_line   : 293
    <93e58>   DW_AT_decl_column : 9
    <93e59>   DW_AT_type        : <0x93f76>
    <93e5d>   DW_AT_data_member_location: 72
 <2><93e5e>: Abbrev Number: 7 (DW_TAG_member)
    <93e5f>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <93e63>   DW_AT_decl_file   : 6
    <93e63>   DW_AT_decl_line   : 301
    <93e65>   DW_AT_decl_column : 8
    <93e66>   DW_AT_type        : <0x938ae>
    <93e6a>   DW_AT_data_member_location: 80
 <2><93e6b>: Abbrev Number: 7 (DW_TAG_member)
    <93e6c>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <93e70>   DW_AT_decl_file   : 6
    <93e70>   DW_AT_decl_line   : 314
    <93e72>   DW_AT_decl_column : 9
    <93e73>   DW_AT_type        : <0x93f8f>
    <93e77>   DW_AT_data_member_location: 88
 <2><93e78>: Abbrev Number: 7 (DW_TAG_member)
    <93e79>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <93e7d>   DW_AT_decl_file   : 6
    <93e7d>   DW_AT_decl_line   : 321
    <93e7f>   DW_AT_decl_column : 9
    <93e80>   DW_AT_type        : <0x937d5>
    <93e84>   DW_AT_data_member_location: 96
 <2><93e85>: Abbrev Number: 7 (DW_TAG_member)
    <93e86>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <93e8a>   DW_AT_decl_file   : 6
    <93e8a>   DW_AT_decl_line   : 328
    <93e8c>   DW_AT_decl_column : 9
    <93e8d>   DW_AT_type        : <0x937d5>
    <93e91>   DW_AT_data_member_location: 104
 <2><93e92>: Abbrev Number: 0
 <1><93e93>: Abbrev Number: 10 (DW_TAG_const_type)
    <93e94>   DW_AT_type        : <0x93dcf>
 <1><93e98>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93e99>   DW_AT_byte_size   : 8
    <93e99>   DW_AT_type        : <0x93e93>
 <1><93e9d>: Abbrev Number: 22 (DW_TAG_structure_type)
    <93e9e>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <93ea2>   DW_AT_byte_size   : 16
    <93ea2>   DW_AT_decl_file   : 6
    <93ea2>   DW_AT_decl_line   : 331
    <93ea4>   DW_AT_decl_column : 16
    <93ea4>   DW_AT_sibling     : <0x93ec3>
 <2><93ea8>: Abbrev Number: 7 (DW_TAG_member)
    <93ea9>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <93ead>   DW_AT_decl_file   : 6
    <93ead>   DW_AT_decl_line   : 333
    <93eaf>   DW_AT_decl_column : 12
    <93eb0>   DW_AT_type        : <0x93794>
    <93eb4>   DW_AT_data_member_location: 0
 <2><93eb5>: Abbrev Number: 7 (DW_TAG_member)
    <93eb6>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <93eba>   DW_AT_decl_file   : 6
    <93eba>   DW_AT_decl_line   : 334
    <93ebc>   DW_AT_decl_column : 23
    <93ebd>   DW_AT_type        : <0x93f94>
    <93ec1>   DW_AT_data_member_location: 8
 <2><93ec2>: Abbrev Number: 0
 <1><93ec3>: Abbrev Number: 10 (DW_TAG_const_type)
    <93ec4>   DW_AT_type        : <0x93e9d>
 <1><93ec8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93ec9>   DW_AT_byte_size   : 8
    <93ec9>   DW_AT_type        : <0x93ec3>
 <1><93ecd>: Abbrev Number: 22 (DW_TAG_structure_type)
    <93ece>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <93ed2>   DW_AT_byte_size   : 16
    <93ed2>   DW_AT_decl_file   : 6
    <93ed2>   DW_AT_decl_line   : 337
    <93ed4>   DW_AT_decl_column : 16
    <93ed4>   DW_AT_sibling     : <0x93efa>
 <2><93ed8>: Abbrev Number: 23 (DW_TAG_member)
    <93ed9>   DW_AT_name        : w
    <93edb>   DW_AT_decl_file   : 6
    <93edb>   DW_AT_decl_line   : 339
    <93edd>   DW_AT_decl_column : 15
    <93edd>   DW_AT_type        : <0x93794>
    <93ee1>   DW_AT_data_member_location: 0
 <2><93ee2>: Abbrev Number: 23 (DW_TAG_member)
    <93ee3>   DW_AT_name        : h
    <93ee5>   DW_AT_decl_file   : 6
    <93ee5>   DW_AT_decl_line   : 340
    <93ee7>   DW_AT_decl_column : 15
    <93ee7>   DW_AT_type        : <0x93794>
    <93eeb>   DW_AT_data_member_location: 4
 <2><93eec>: Abbrev Number: 7 (DW_TAG_member)
    <93eed>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <93ef1>   DW_AT_decl_file   : 6
    <93ef1>   DW_AT_decl_line   : 341
    <93ef3>   DW_AT_decl_column : 23
    <93ef4>   DW_AT_type        : <0x93f94>
    <93ef8>   DW_AT_data_member_location: 8
 <2><93ef9>: Abbrev Number: 0
 <1><93efa>: Abbrev Number: 10 (DW_TAG_const_type)
    <93efb>   DW_AT_type        : <0x93ecd>
 <1><93eff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f00>   DW_AT_byte_size   : 8
    <93f00>   DW_AT_type        : <0x93efa>
 <1><93f04>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f05>   DW_AT_byte_size   : 8
    <93f05>   DW_AT_type        : <0x93f09>
 <1><93f09>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f0a>   DW_AT_byte_size   : 8
    <93f0a>   DW_AT_type        : <0x93bfb>
 <1><93f0e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f0f>   DW_AT_byte_size   : 8
    <93f0f>   DW_AT_type        : <0x937e9>
 <1><93f13>: Abbrev Number: 8 (DW_TAG_typedef)
    <93f14>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <93f18>   DW_AT_decl_file   : 6
    <93f19>   DW_AT_decl_line   : 176
    <93f1a>   DW_AT_decl_column : 3
    <93f1b>   DW_AT_type        : <0x93c07>
 <1><93f1f>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <93f20>   DW_AT_prototyped  : 1
    <93f20>   DW_AT_type        : <0x93788>
    <93f24>   DW_AT_sibling     : <0x93f47>
 <2><93f28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f29>   DW_AT_type        : <0x937a2>
 <2><93f2d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f2e>   DW_AT_type        : <0x93788>
 <2><93f32>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f33>   DW_AT_type        : <0x93788>
 <2><93f37>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f38>   DW_AT_type        : <0x93788>
 <2><93f3c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f3d>   DW_AT_type        : <0x93788>
 <2><93f41>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f42>   DW_AT_type        : <0x93788>
 <2><93f46>: Abbrev Number: 0
 <1><93f47>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f48>   DW_AT_byte_size   : 8
    <93f48>   DW_AT_type        : <0x93f1f>
 <1><93f4c>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <93f4d>   DW_AT_prototyped  : 1
    <93f4d>   DW_AT_sibling     : <0x93f66>
 <2><93f51>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f52>   DW_AT_type        : <0x93788>
 <2><93f56>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f57>   DW_AT_type        : <0x93788>
 <2><93f5b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f5c>   DW_AT_type        : <0x93788>
 <2><93f60>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f61>   DW_AT_type        : <0x93788>
 <2><93f65>: Abbrev Number: 0
 <1><93f66>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f67>   DW_AT_byte_size   : 8
    <93f67>   DW_AT_type        : <0x93f4c>
 <1><93f6b>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <93f6c>   DW_AT_prototyped  : 1
    <93f6c>   DW_AT_sibling     : <0x93f76>
 <2><93f70>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f71>   DW_AT_type        : <0x937a2>
 <2><93f75>: Abbrev Number: 0
 <1><93f76>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f77>   DW_AT_byte_size   : 8
    <93f77>   DW_AT_type        : <0x93f6b>
 <1><93f7b>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <93f7c>   DW_AT_prototyped  : 1
    <93f7c>   DW_AT_type        : <0x938c7>
    <93f80>   DW_AT_sibling     : <0x93f8f>
 <2><93f84>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f85>   DW_AT_type        : <0x93788>
 <2><93f89>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93f8a>   DW_AT_type        : <0x938c7>
 <2><93f8e>: Abbrev Number: 0
 <1><93f8f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f90>   DW_AT_byte_size   : 8
    <93f90>   DW_AT_type        : <0x93f7b>
 <1><93f94>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93f95>   DW_AT_byte_size   : 8
    <93f95>   DW_AT_type        : <0x93760>
 <1><93f99>: Abbrev Number: 33 (DW_TAG_variable)
    <93f9a>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <93f9e>   DW_AT_decl_file   : 6
    <93f9f>   DW_AT_decl_line   : 364
    <93fa1>   DW_AT_decl_column : 15
    <93fa2>   DW_AT_type        : <0x93fa6>
    <93fa6>   DW_AT_external    : 1
    <93fa6>   DW_AT_declaration : 1
 <1><93fa6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93fa7>   DW_AT_byte_size   : 8
    <93fa7>   DW_AT_type        : <0x93f13>
 <1><93fab>: Abbrev Number: 34 (DW_TAG_subprogram)
    <93fac>   DW_AT_external    : 1
    <93fac>   DW_AT_name        : (indirect string, offset: 0x18008): fb_hMakeColor
    <93fb0>   DW_AT_decl_file   : 6
    <93fb1>   DW_AT_decl_line   : 404
    <93fb3>   DW_AT_decl_column : 21
    <93fb4>   DW_AT_prototyped  : 1
    <93fb4>   DW_AT_type        : <0x9376c>
    <93fb8>   DW_AT_declaration : 1
    <93fb8>   DW_AT_sibling     : <0x93fd6>
 <2><93fbc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fbd>   DW_AT_type        : <0x93788>
 <2><93fc1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fc2>   DW_AT_type        : <0x9376c>
 <2><93fc6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fc7>   DW_AT_type        : <0x93788>
 <2><93fcb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fcc>   DW_AT_type        : <0x93788>
 <2><93fd0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fd1>   DW_AT_type        : <0x93788>
 <2><93fd5>: Abbrev Number: 0
 <1><93fd6>: Abbrev Number: 35 (DW_TAG_subprogram)
    <93fd7>   DW_AT_external    : 1
    <93fd7>   DW_AT_name        : (indirect string, offset: 0x141e9): fb_GfxPalette
    <93fdb>   DW_AT_decl_file   : 6
    <93fdc>   DW_AT_decl_line   : 446
    <93fde>   DW_AT_decl_column : 20
    <93fdf>   DW_AT_prototyped  : 1
    <93fdf>   DW_AT_declaration : 1
    <93fdf>   DW_AT_sibling     : <0x93ff8>
 <2><93fe3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fe4>   DW_AT_type        : <0x93788>
 <2><93fe8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fe9>   DW_AT_type        : <0x93788>
 <2><93fed>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93fee>   DW_AT_type        : <0x93788>
 <2><93ff2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93ff3>   DW_AT_type        : <0x93788>
 <2><93ff7>: Abbrev Number: 0
 <1><93ff8>: Abbrev Number: 36 (DW_TAG_subprogram)
    <93ff9>   DW_AT_external    : 1
    <93ff9>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <93ffd>   DW_AT_decl_file   : 6
    <93ffe>   DW_AT_decl_line   : 396
    <94000>   DW_AT_decl_column : 19
    <94001>   DW_AT_prototyped  : 1
    <94001>   DW_AT_type        : <0x94005>
    <94005>   DW_AT_declaration : 1
 <1><94005>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <94006>   DW_AT_byte_size   : 8
    <94006>   DW_AT_type        : <0x93bbd>
 <1><9400a>: Abbrev Number: 37 (DW_TAG_subprogram)
    <9400b>   DW_AT_external    : 1
    <9400b>   DW_AT_name        : (indirect string, offset: 0x18126): fb_GfxColor
    <9400f>   DW_AT_decl_file   : 1
    <94010>   DW_AT_decl_line   : 5
    <94011>   DW_AT_decl_column : 5
    <94012>   DW_AT_prototyped  : 1
    <94012>   DW_AT_type        : <0x93788>
    <94016>   DW_AT_low_pc      : 0x464710
    <9401e>   DW_AT_high_pc     : 0x1f7
    <94026>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <94028>   DW_AT_call_all_calls: 1
 <2><94028>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <94029>   DW_AT_name        : fg
    <9402c>   DW_AT_decl_file   : 1
    <9402c>   DW_AT_decl_line   : 5
    <9402c>   DW_AT_decl_column : 21
    <9402d>   DW_AT_type        : <0x93788>
    <94031>   DW_AT_location    : 0x2c01f (location list)
    <94035>   DW_AT_GNU_locviews: 0x2c00f
 <2><94039>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <9403a>   DW_AT_name        : bg
    <9403d>   DW_AT_decl_file   : 1
    <9403d>   DW_AT_decl_line   : 5
    <9403d>   DW_AT_decl_column : 29
    <9403e>   DW_AT_type        : <0x93788>
    <94042>   DW_AT_location    : 0x2c068 (location list)
    <94046>   DW_AT_GNU_locviews: 0x2c05c
 <2><9404a>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <9404b>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <9404f>   DW_AT_decl_file   : 1
    <94050>   DW_AT_decl_line   : 5
    <94051>   DW_AT_decl_column : 37
    <94052>   DW_AT_type        : <0x93788>
    <94056>   DW_AT_location    : 0x2c0a0 (location list)
    <9405a>   DW_AT_GNU_locviews: 0x2c094
 <2><9405e>: Abbrev Number: 39 (DW_TAG_variable)
    <9405f>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <94063>   DW_AT_decl_file   : 1
    <94064>   DW_AT_decl_line   : 7
    <94065>   DW_AT_decl_column : 13
    <94066>   DW_AT_type        : <0x94005>
    <9406a>   DW_AT_location    : 0x2c0d2 (location list)
    <9406e>   DW_AT_GNU_locviews: 0x2c0ca
 <2><94072>: Abbrev Number: 25 (DW_TAG_variable)
    <94073>   DW_AT_name        : cur
    <94077>   DW_AT_decl_file   : 1
    <94077>   DW_AT_decl_line   : 8
    <94078>   DW_AT_decl_column : 6
    <94079>   DW_AT_type        : <0x93788>
    <9407d>   DW_AT_location    : 0x2c0f1 (location list)
    <94081>   DW_AT_GNU_locviews: 0x2c0eb
 <2><94085>: Abbrev Number: 40 (DW_TAG_lexical_block)
    <94086>   DW_AT_low_pc      : 0x464799
    <9408e>   DW_AT_high_pc     : 0x49
    <94096>   DW_AT_sibling     : <0x940ac>
 <3><9409a>: Abbrev Number: 25 (DW_TAG_variable)
    <9409b>   DW_AT_name        : c
    <9409d>   DW_AT_decl_file   : 1
    <9409d>   DW_AT_decl_line   : 17
    <9409e>   DW_AT_decl_column : 12
    <9409f>   DW_AT_type        : <0x9376c>
    <940a3>   DW_AT_location    : 0x2c108 (location list)
    <940a7>   DW_AT_GNU_locviews: 0x2c104
 <3><940ab>: Abbrev Number: 0
 <2><940ac>: Abbrev Number: 41 (DW_TAG_call_site)
    <940ad>   DW_AT_call_return_pc: 0x46472a
    <940b5>   DW_AT_call_origin : <0x93ff8>
 <2><940b9>: Abbrev Number: 15 (DW_TAG_call_site)
    <940ba>   DW_AT_call_return_pc: 0x46484d
    <940c2>   DW_AT_call_origin : <0x93fab>
    <940c6>   DW_AT_sibling     : <0x940ee>
 <3><940ca>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <940cb>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <940cd>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><940d0>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <940d1>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <940d3>   DW_AT_call_value  : 7 byte block: 76 0 40 26 8 ff 1a 	(DW_OP_breg6 (rbp): 0; DW_OP_lit16; DW_OP_shra; DW_OP_const1u: 255; DW_OP_and)
 <3><940db>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <940dc>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <940de>   DW_AT_call_value  : 5 byte block: 76 0 9 f8 24 	(DW_OP_breg6 (rbp): 0; DW_OP_const1s: -8; DW_OP_shl)
 <3><940e4>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <940e5>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <940e7>   DW_AT_call_value  : 5 byte block: 76 0 8 ff 1a 	(DW_OP_breg6 (rbp): 0; DW_OP_const1u: 255; DW_OP_and)
 <3><940ed>: Abbrev Number: 0
 <2><940ee>: Abbrev Number: 15 (DW_TAG_call_site)
    <940ef>   DW_AT_call_return_pc: 0x4648a0
    <940f7>   DW_AT_call_origin : <0x93fd6>
    <940fb>   DW_AT_sibling     : <0x94117>
 <3><940ff>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94100>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <94102>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><94104>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94105>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <94107>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><9410a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <9410b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <9410d>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><94110>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94111>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <94113>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><94116>: Abbrev Number: 0
 <2><94117>: Abbrev Number: 15 (DW_TAG_call_site)
    <94118>   DW_AT_call_return_pc: 0x4648bc
    <94120>   DW_AT_call_origin : <0x93fd6>
    <94124>   DW_AT_sibling     : <0x94140>
 <3><94128>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94129>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9412b>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><9412d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <9412e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <94130>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><94133>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94134>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <94136>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><94139>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <9413a>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <9413c>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><9413f>: Abbrev Number: 0
 <2><94140>: Abbrev Number: 15 (DW_TAG_call_site)
    <94141>   DW_AT_call_return_pc: 0x4648d9
    <94149>   DW_AT_call_origin : <0x93fd6>
    <9414d>   DW_AT_sibling     : <0x9416a>
 <3><94151>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94152>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <94154>   DW_AT_call_value  : 5 byte block: 7c 0 9 fc 21 	(DW_OP_breg12 (r12): 0; DW_OP_const1s: -4; DW_OP_or)
 <3><9415a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <9415b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9415d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><9415f>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94160>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <94162>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><94164>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94165>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <94167>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><94169>: Abbrev Number: 0
 <2><9416a>: Abbrev Number: 42 (DW_TAG_call_site)
    <9416b>   DW_AT_call_return_pc: 0x4648fe
    <94173>   DW_AT_call_origin : <0x93fab>
 <3><94177>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94178>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9417a>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><9417d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <9417e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <94180>   DW_AT_call_value  : 7 byte block: 7c 0 40 26 8 ff 1a 	(DW_OP_breg12 (r12): 0; DW_OP_lit16; DW_OP_shra; DW_OP_const1u: 255; DW_OP_and)
 <3><94188>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94189>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <9418b>   DW_AT_call_value  : 5 byte block: 7c 0 9 f8 24 	(DW_OP_breg12 (r12): 0; DW_OP_const1s: -8; DW_OP_shl)
 <3><94191>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <94192>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <94194>   DW_AT_call_value  : 5 byte block: 7c 0 8 ff 1a 	(DW_OP_breg12 (r12): 0; DW_OP_const1u: 255; DW_OP_and)
 <3><9419a>: Abbrev Number: 0
 <2><9419b>: Abbrev Number: 0
 <1><9419c>: Abbrev Number: 0
  Compilation Unit @ offset 0x9419d:
   Length:        0x2e8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x652b
   Pointer Size:  8
 <0><941a9>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <941aa>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <941ae>   DW_AT_language    : 29	(C11)
    <941af>   DW_AT_name        : (indirect line string, offset: 0x73a): src/gfxlib2/gfx_data.c
    <941b3>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <941b7>   DW_AT_low_pc      : 0x464910
    <941bf>   DW_AT_high_pc     : 0x65
    <941c7>   DW_AT_stmt_list   : 0x5a037
 <1><941cb>: Abbrev Number: 1 (DW_TAG_base_type)
    <941cc>   DW_AT_byte_size   : 1
    <941cd>   DW_AT_encoding    : 8	(unsigned char)
    <941ce>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><941d2>: Abbrev Number: 3 (DW_TAG_const_type)
    <941d3>   DW_AT_type        : <0x941cb>
 <1><941d7>: Abbrev Number: 1 (DW_TAG_base_type)
    <941d8>   DW_AT_byte_size   : 2
    <941d9>   DW_AT_encoding    : 7	(unsigned)
    <941da>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><941de>: Abbrev Number: 1 (DW_TAG_base_type)
    <941df>   DW_AT_byte_size   : 4
    <941e0>   DW_AT_encoding    : 7	(unsigned)
    <941e1>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><941e5>: Abbrev Number: 1 (DW_TAG_base_type)
    <941e6>   DW_AT_byte_size   : 8
    <941e7>   DW_AT_encoding    : 7	(unsigned)
    <941e8>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><941ec>: Abbrev Number: 1 (DW_TAG_base_type)
    <941ed>   DW_AT_byte_size   : 1
    <941ee>   DW_AT_encoding    : 6	(signed char)
    <941ef>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><941f3>: Abbrev Number: 1 (DW_TAG_base_type)
    <941f4>   DW_AT_byte_size   : 2
    <941f5>   DW_AT_encoding    : 5	(signed)
    <941f6>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><941fa>: Abbrev Number: 20 (DW_TAG_base_type)
    <941fb>   DW_AT_byte_size   : 4
    <941fc>   DW_AT_encoding    : 5	(signed)
    <941fd>   DW_AT_name        : int
 <1><94201>: Abbrev Number: 3 (DW_TAG_const_type)
    <94202>   DW_AT_type        : <0x941fa>
 <1><94206>: Abbrev Number: 1 (DW_TAG_base_type)
    <94207>   DW_AT_byte_size   : 8
    <94208>   DW_AT_encoding    : 5	(signed)
    <94209>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9420d>: Abbrev Number: 10 (DW_TAG_typedef)
    <9420e>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <94212>   DW_AT_decl_file   : 2
    <94213>   DW_AT_decl_line   : 194
    <94214>   DW_AT_decl_column : 27
    <94215>   DW_AT_type        : <0x94206>
 <1><94219>: Abbrev Number: 1 (DW_TAG_base_type)
    <9421a>   DW_AT_byte_size   : 1
    <9421b>   DW_AT_encoding    : 6	(signed char)
    <9421c>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><94220>: Abbrev Number: 1 (DW_TAG_base_type)
    <94221>   DW_AT_byte_size   : 8
    <94222>   DW_AT_encoding    : 5	(signed)
    <94223>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><94227>: Abbrev Number: 10 (DW_TAG_typedef)
    <94228>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <9422c>   DW_AT_decl_file   : 3
    <9422d>   DW_AT_decl_line   : 108
    <9422e>   DW_AT_decl_column : 19
    <9422f>   DW_AT_type        : <0x9420d>
 <1><94233>: Abbrev Number: 1 (DW_TAG_base_type)
    <94234>   DW_AT_byte_size   : 8
    <94235>   DW_AT_encoding    : 7	(unsigned)
    <94236>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9423a>: Abbrev Number: 1 (DW_TAG_base_type)
    <9423b>   DW_AT_byte_size   : 8
    <9423c>   DW_AT_encoding    : 4	(float)
    <9423d>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><94241>: Abbrev Number: 1 (DW_TAG_base_type)
    <94242>   DW_AT_byte_size   : 4
    <94243>   DW_AT_encoding    : 4	(float)
    <94244>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><94248>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <94249>   DW_AT_byte_size   : 8
    <94249>   DW_AT_type        : <0x941cb>
 <1><9424d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9424e>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <94252>   DW_AT_byte_size   : 16
    <94252>   DW_AT_decl_file   : 4
    <94252>   DW_AT_decl_line   : 331
    <94254>   DW_AT_decl_column : 16
    <94254>   DW_AT_sibling     : <0x94273>
 <2><94258>: Abbrev Number: 9 (DW_TAG_member)
    <94259>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <9425d>   DW_AT_decl_file   : 4
    <9425d>   DW_AT_decl_line   : 333
    <9425f>   DW_AT_decl_column : 12
    <94260>   DW_AT_type        : <0x94201>
    <94264>   DW_AT_data_member_location: 0
 <2><94265>: Abbrev Number: 9 (DW_TAG_member)
    <94266>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9426a>   DW_AT_decl_file   : 4
    <9426a>   DW_AT_decl_line   : 334
    <9426c>   DW_AT_decl_column : 23
    <9426d>   DW_AT_type        : <0x942a0>
    <94271>   DW_AT_data_member_location: 8
 <2><94272>: Abbrev Number: 0
 <1><94273>: Abbrev Number: 11 (DW_TAG_structure_type)
    <94274>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <94278>   DW_AT_byte_size   : 16
    <94278>   DW_AT_decl_file   : 4
    <94278>   DW_AT_decl_line   : 337
    <9427a>   DW_AT_decl_column : 16
    <9427a>   DW_AT_sibling     : <0x942a0>
 <2><9427e>: Abbrev Number: 12 (DW_TAG_member)
    <9427f>   DW_AT_name        : w
    <94281>   DW_AT_decl_file   : 4
    <94281>   DW_AT_decl_line   : 339
    <94283>   DW_AT_decl_column : 15
    <94283>   DW_AT_type        : <0x94201>
    <94287>   DW_AT_data_member_location: 0
 <2><94288>: Abbrev Number: 12 (DW_TAG_member)
    <94289>   DW_AT_name        : h
    <9428b>   DW_AT_decl_file   : 4
    <9428b>   DW_AT_decl_line   : 340
    <9428d>   DW_AT_decl_column : 15
    <9428d>   DW_AT_type        : <0x94201>
    <94291>   DW_AT_data_member_location: 4
 <2><94292>: Abbrev Number: 9 (DW_TAG_member)
    <94293>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <94297>   DW_AT_decl_file   : 4
    <94297>   DW_AT_decl_line   : 341
    <94299>   DW_AT_decl_column : 23
    <9429a>   DW_AT_type        : <0x942a0>
    <9429e>   DW_AT_data_member_location: 8
 <2><9429f>: Abbrev Number: 0
 <1><942a0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <942a1>   DW_AT_byte_size   : 8
    <942a1>   DW_AT_type        : <0x941d2>
 <1><942a5>: Abbrev Number: 13 (DW_TAG_typedef)
    <942a6>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <942aa>   DW_AT_decl_file   : 4
    <942aa>   DW_AT_decl_line   : 335
    <942ac>   DW_AT_decl_column : 3
    <942ac>   DW_AT_type        : <0x9424d>
 <1><942b0>: Abbrev Number: 3 (DW_TAG_const_type)
    <942b1>   DW_AT_type        : <0x942a5>
 <1><942b5>: Abbrev Number: 13 (DW_TAG_typedef)
    <942b6>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <942ba>   DW_AT_decl_file   : 4
    <942ba>   DW_AT_decl_line   : 342
    <942bc>   DW_AT_decl_column : 3
    <942bc>   DW_AT_type        : <0x94273>
 <1><942c0>: Abbrev Number: 3 (DW_TAG_const_type)
    <942c1>   DW_AT_type        : <0x942b5>
 <1><942c5>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <942c6>   DW_AT_encoding    : 7	(void)
    <942c6>   DW_AT_byte_size   : 4
    <942c6>   DW_AT_type        : <0x941de>
    <942ca>   DW_AT_decl_file   : 4
    <942ca>   DW_AT_decl_line   : 376
    <942cc>   DW_AT_decl_column : 6
    <942cc>   DW_AT_sibling     : <0x942e9>
 <2><942d0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942d1>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <942d5>   DW_AT_const_value : 0
 <2><942d6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942d7>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <942db>   DW_AT_const_value : 1
 <2><942dc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942dd>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <942e1>   DW_AT_const_value : 2
 <2><942e2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942e3>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <942e7>   DW_AT_const_value : 3
 <2><942e8>: Abbrev Number: 0
 <1><942e9>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <942ea>   DW_AT_encoding    : 7	(void)
    <942ea>   DW_AT_byte_size   : 4
    <942ea>   DW_AT_type        : <0x941de>
    <942ee>   DW_AT_decl_file   : 4
    <942ee>   DW_AT_decl_line   : 384
    <942f0>   DW_AT_decl_column : 6
    <942f0>   DW_AT_sibling     : <0x94313>
 <2><942f4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942f5>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <942f9>   DW_AT_const_value : 0
 <2><942fa>: Abbrev Number: 2 (DW_TAG_enumerator)
    <942fb>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <942ff>   DW_AT_const_value : 1
 <2><94300>: Abbrev Number: 2 (DW_TAG_enumerator)
    <94301>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <94305>   DW_AT_const_value : 2
 <2><94306>: Abbrev Number: 2 (DW_TAG_enumerator)
    <94307>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <9430b>   DW_AT_const_value : 3
 <2><9430c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9430d>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <94311>   DW_AT_const_value : 4
 <2><94312>: Abbrev Number: 0
 <1><94313>: Abbrev Number: 4 (DW_TAG_array_type)
    <94314>   DW_AT_type        : <0x942c0>
    <94318>   DW_AT_sibling     : <0x94323>
 <2><9431c>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9431d>   DW_AT_type        : <0x941e5>
    <94321>   DW_AT_upper_bound : 2
 <2><94322>: Abbrev Number: 0
 <1><94323>: Abbrev Number: 3 (DW_TAG_const_type)
    <94324>   DW_AT_type        : <0x94313>
 <1><94328>: Abbrev Number: 16 (DW_TAG_variable)
    <94329>   DW_AT_name        : (indirect string, offset: 0x183d0): __fb_font
    <9432d>   DW_AT_decl_file   : 4
    <9432d>   DW_AT_decl_line   : 392
    <9432f>   DW_AT_decl_column : 19
    <94330>   DW_AT_type        : <0x94323>
    <94334>   DW_AT_external    : 1
    <94334>   DW_AT_declaration : 1
 <1><94334>: Abbrev Number: 4 (DW_TAG_array_type)
    <94335>   DW_AT_type        : <0x942b0>
    <94339>   DW_AT_sibling     : <0x94344>
 <2><9433d>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9433e>   DW_AT_type        : <0x941e5>
    <94342>   DW_AT_upper_bound : 3
 <2><94343>: Abbrev Number: 0
 <1><94344>: Abbrev Number: 3 (DW_TAG_const_type)
    <94345>   DW_AT_type        : <0x94334>
 <1><94349>: Abbrev Number: 16 (DW_TAG_variable)
    <9434a>   DW_AT_name        : (indirect string, offset: 0x1806c): __fb_palette
    <9434e>   DW_AT_decl_file   : 4
    <9434e>   DW_AT_decl_line   : 393
    <94350>   DW_AT_decl_column : 22
    <94351>   DW_AT_type        : <0x94344>
    <94355>   DW_AT_external    : 1
    <94355>   DW_AT_declaration : 1
 <1><94355>: Abbrev Number: 4 (DW_TAG_array_type)
    <94356>   DW_AT_type        : <0x941d2>
    <9435a>   DW_AT_sibling     : <0x94366>
 <2><9435e>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9435f>   DW_AT_type        : <0x941e5>
    <94363>   DW_AT_upper_bound : 4981
 <2><94365>: Abbrev Number: 0
 <1><94366>: Abbrev Number: 3 (DW_TAG_const_type)
    <94367>   DW_AT_type        : <0x94355>
 <1><9436b>: Abbrev Number: 5 (DW_TAG_variable)
    <9436c>   DW_AT_name        : (indirect string, offset: 0x19d3f): compressed_data
    <94370>   DW_AT_decl_file   : 5
    <94371>   DW_AT_decl_line   : 12
    <94372>   DW_AT_decl_column : 28
    <94373>   DW_AT_type        : <0x94366>
    <94377>   DW_AT_location    : 9 byte block: 3 c0 27 48 0 0 0 0 0 	(DW_OP_addr: 4827c0)
 <1><94381>: Abbrev Number: 4 (DW_TAG_array_type)
    <94382>   DW_AT_type        : <0x941cb>
    <94386>   DW_AT_sibling     : <0x94392>
 <2><9438a>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9438b>   DW_AT_type        : <0x941e5>
    <9438f>   DW_AT_upper_bound : 10741
 <2><94391>: Abbrev Number: 0
 <1><94392>: Abbrev Number: 5 (DW_TAG_variable)
    <94393>   DW_AT_name        : (indirect string, offset: 0x19d5a): internal_data
    <94397>   DW_AT_decl_file   : 1
    <94398>   DW_AT_decl_line   : 7
    <94399>   DW_AT_decl_column : 22
    <9439a>   DW_AT_type        : <0x94381>
    <9439e>   DW_AT_location    : 9 byte block: 3 e0 5e 4b 0 0 0 0 0 	(DW_OP_addr: 4b5ee0)
 <1><943a8>: Abbrev Number: 18 (DW_TAG_variable)
    <943a9>   DW_AT_specification: <0x94328>
    <943ad>   DW_AT_decl_file   : 1
    <943ad>   DW_AT_decl_line   : 10
    <943ae>   DW_AT_decl_column : 12
    <943af>   DW_AT_location    : 9 byte block: 3 60 99 48 0 0 0 0 0 	(DW_OP_addr: 489960)
 <1><943b9>: Abbrev Number: 18 (DW_TAG_variable)
    <943ba>   DW_AT_specification: <0x94349>
    <943be>   DW_AT_decl_file   : 1
    <943be>   DW_AT_decl_line   : 18
    <943bf>   DW_AT_decl_column : 15
    <943c0>   DW_AT_location    : 9 byte block: 3 20 99 48 0 0 0 0 0 	(DW_OP_addr: 489920)
 <1><943ca>: Abbrev Number: 21 (DW_TAG_subprogram)
    <943cb>   DW_AT_external    : 1
    <943cb>   DW_AT_name        : (indirect string, offset: 0x19d4f): fb_hDecode
    <943cf>   DW_AT_decl_file   : 4
    <943d0>   DW_AT_decl_line   : 400
    <943d2>   DW_AT_decl_column : 19
    <943d3>   DW_AT_prototyped  : 1
    <943d3>   DW_AT_type        : <0x941fa>
    <943d7>   DW_AT_declaration : 1
    <943d7>   DW_AT_sibling     : <0x943f0>
 <2><943db>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <943dc>   DW_AT_type        : <0x942a0>
 <2><943e0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <943e1>   DW_AT_type        : <0x94227>
 <2><943e5>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <943e6>   DW_AT_type        : <0x94248>
 <2><943ea>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <943eb>   DW_AT_type        : <0x943f0>
 <2><943ef>: Abbrev Number: 0
 <1><943f0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <943f1>   DW_AT_byte_size   : 8
    <943f1>   DW_AT_type        : <0x94227>
 <1><943f5>: Abbrev Number: 22 (DW_TAG_subprogram)
    <943f6>   DW_AT_external    : 1
    <943f6>   DW_AT_name        : (indirect string, offset: 0x182d8): fb_hSetupData
    <943fa>   DW_AT_decl_file   : 1
    <943fb>   DW_AT_decl_line   : 27
    <943fc>   DW_AT_decl_column : 6
    <943fd>   DW_AT_prototyped  : 1
    <943fd>   DW_AT_low_pc      : 0x464910
    <94405>   DW_AT_high_pc     : 0x65
    <9440d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9440f>   DW_AT_call_all_calls: 1
    <9440f>   DW_AT_sibling     : <0x9447f>
 <2><94413>: Abbrev Number: 5 (DW_TAG_variable)
    <94414>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <94418>   DW_AT_decl_file   : 1
    <94419>   DW_AT_decl_line   : 29
    <9441a>   DW_AT_decl_column : 13
    <9441b>   DW_AT_type        : <0x941fa>
    <9441f>   DW_AT_location    : 9 byte block: 3 c0 5e 4b 0 0 0 0 0 	(DW_OP_addr: 4b5ec0)
 <2><94429>: Abbrev Number: 5 (DW_TAG_variable)
    <9442a>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <9442e>   DW_AT_decl_file   : 1
    <9442f>   DW_AT_decl_line   : 34
    <94430>   DW_AT_decl_column : 10
    <94431>   DW_AT_type        : <0x94227>
    <94435>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><94438>: Abbrev Number: 23 (DW_TAG_call_site)
    <94439>   DW_AT_call_return_pc: 0x464951
    <94441>   DW_AT_call_origin : <0x943ca>
    <94445>   DW_AT_sibling     : <0x94471>
 <3><94449>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <9444a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9444c>   DW_AT_call_value  : 9 byte block: 3 c0 27 48 0 0 0 0 0 	(DW_OP_addr: 4827c0)
 <3><94456>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <94457>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <94459>   DW_AT_call_value  : 3 byte block: a 76 13 	(DW_OP_const2u: 4982)
 <3><9445d>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <9445e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <94460>   DW_AT_call_value  : 9 byte block: 3 e0 5e 4b 0 0 0 0 0 	(DW_OP_addr: 4b5ee0)
 <3><9446a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <9446b>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <9446d>   DW_AT_call_value  : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><94470>: Abbrev Number: 0
 <2><94471>: Abbrev Number: 24 (DW_TAG_call_site)
    <94472>   DW_AT_call_return_pc: 0x464975
    <9447a>   DW_AT_call_origin : <0x9447f>
 <2><9447e>: Abbrev Number: 0
 <1><9447f>: Abbrev Number: 25 (DW_TAG_subprogram)
    <94480>   DW_AT_external    : 1
    <94480>   DW_AT_declaration : 1
    <94480>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <94484>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><94488>: Abbrev Number: 0
  Compilation Unit @ offset 0x94489:
   Length:        0x29de (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x6692
   Pointer Size:  8
 <0><94495>: Abbrev Number: 55 (DW_TAG_compile_unit)
    <94496>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <9449a>   DW_AT_language    : 29	(C11)
    <9449b>   DW_AT_name        : (indirect line string, offset: 0x762): src/gfxlib2/linux/gfx_driver_fbdev.c
    <9449f>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <944a3>   DW_AT_low_pc      : 0x464980
    <944ab>   DW_AT_high_pc     : 0x1da3
    <944b3>   DW_AT_stmt_list   : 0x5a0c2
 <1><944b7>: Abbrev Number: 18 (DW_TAG_base_type)
    <944b8>   DW_AT_byte_size   : 1
    <944b9>   DW_AT_encoding    : 8	(unsigned char)
    <944ba>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><944be>: Abbrev Number: 14 (DW_TAG_const_type)
    <944bf>   DW_AT_type        : <0x944b7>
 <1><944c3>: Abbrev Number: 18 (DW_TAG_base_type)
    <944c4>   DW_AT_byte_size   : 2
    <944c5>   DW_AT_encoding    : 7	(unsigned)
    <944c6>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><944ca>: Abbrev Number: 18 (DW_TAG_base_type)
    <944cb>   DW_AT_byte_size   : 4
    <944cc>   DW_AT_encoding    : 7	(unsigned)
    <944cd>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><944d1>: Abbrev Number: 18 (DW_TAG_base_type)
    <944d2>   DW_AT_byte_size   : 8
    <944d3>   DW_AT_encoding    : 7	(unsigned)
    <944d4>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><944d8>: Abbrev Number: 18 (DW_TAG_base_type)
    <944d9>   DW_AT_byte_size   : 1
    <944da>   DW_AT_encoding    : 6	(signed char)
    <944db>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><944df>: Abbrev Number: 18 (DW_TAG_base_type)
    <944e0>   DW_AT_byte_size   : 2
    <944e1>   DW_AT_encoding    : 5	(signed)
    <944e2>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><944e6>: Abbrev Number: 56 (DW_TAG_base_type)
    <944e7>   DW_AT_byte_size   : 4
    <944e8>   DW_AT_encoding    : 5	(signed)
    <944e9>   DW_AT_name        : int
 <1><944ed>: Abbrev Number: 57 (DW_TAG_volatile_type)
    <944ee>   DW_AT_type        : <0x944e6>
 <1><944f2>: Abbrev Number: 14 (DW_TAG_const_type)
    <944f3>   DW_AT_type        : <0x944e6>
 <1><944f7>: Abbrev Number: 18 (DW_TAG_base_type)
    <944f8>   DW_AT_byte_size   : 8
    <944f9>   DW_AT_encoding    : 5	(signed)
    <944fa>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><944fe>: Abbrev Number: 8 (DW_TAG_typedef)
    <944ff>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <94503>   DW_AT_decl_file   : 2
    <94504>   DW_AT_decl_line   : 153
    <94505>   DW_AT_decl_column : 27
    <94506>   DW_AT_type        : <0x944f7>
 <1><9450a>: Abbrev Number: 8 (DW_TAG_typedef)
    <9450b>   DW_AT_name        : (indirect string, offset: 0x1a0fb): __time_t
    <9450f>   DW_AT_decl_file   : 2
    <94510>   DW_AT_decl_line   : 160
    <94511>   DW_AT_decl_column : 26
    <94512>   DW_AT_type        : <0x944f7>
 <1><94516>: Abbrev Number: 8 (DW_TAG_typedef)
    <94517>   DW_AT_name        : (indirect string, offset: 0x194f0): __useconds_t
    <9451b>   DW_AT_decl_file   : 2
    <9451c>   DW_AT_decl_line   : 161
    <9451d>   DW_AT_decl_column : 30
    <9451e>   DW_AT_type        : <0x944ca>
 <1><94522>: Abbrev Number: 8 (DW_TAG_typedef)
    <94523>   DW_AT_name        : (indirect string, offset: 0x1a028): __suseconds_t
    <94527>   DW_AT_decl_file   : 2
    <94528>   DW_AT_decl_line   : 162
    <94529>   DW_AT_decl_column : 31
    <9452a>   DW_AT_type        : <0x944f7>
 <1><9452e>: Abbrev Number: 58 (DW_TAG_pointer_type)
    <9452f>   DW_AT_byte_size   : 8
 <1><94530>: Abbrev Number: 23 (DW_TAG_restrict_type)
    <94531>   DW_AT_type        : <0x9452e>
 <1><94535>: Abbrev Number: 8 (DW_TAG_typedef)
    <94536>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <9453a>   DW_AT_decl_file   : 2
    <9453b>   DW_AT_decl_line   : 194
    <9453c>   DW_AT_decl_column : 27
    <9453d>   DW_AT_type        : <0x944f7>
 <1><94541>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <94542>   DW_AT_byte_size   : 8
    <94542>   DW_AT_type        : <0x94546>
 <1><94546>: Abbrev Number: 18 (DW_TAG_base_type)
    <94547>   DW_AT_byte_size   : 1
    <94548>   DW_AT_encoding    : 6	(signed char)
    <94549>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><9454d>: Abbrev Number: 14 (DW_TAG_const_type)
    <9454e>   DW_AT_type        : <0x94546>
 <1><94552>: Abbrev Number: 8 (DW_TAG_typedef)
    <94553>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <94557>   DW_AT_decl_file   : 3
    <94558>   DW_AT_decl_line   : 209
    <94559>   DW_AT_decl_column : 23
    <9455a>   DW_AT_type        : <0x944d1>
 <1><9455e>: Abbrev Number: 38 (DW_TAG_typedef)
    <9455f>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <94563>   DW_AT_decl_file   : 3
    <94564>   DW_AT_decl_line   : 321
    <94566>   DW_AT_decl_column : 24
    <94567>   DW_AT_type        : <0x944e6>
 <1><9456b>: Abbrev Number: 18 (DW_TAG_base_type)
    <9456c>   DW_AT_byte_size   : 8
    <9456d>   DW_AT_encoding    : 5	(signed)
    <9456e>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><94572>: Abbrev Number: 8 (DW_TAG_typedef)
    <94573>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <94577>   DW_AT_decl_file   : 4
    <94578>   DW_AT_decl_line   : 108
    <94579>   DW_AT_decl_column : 19
    <9457a>   DW_AT_type        : <0x94535>
 <1><9457e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <9457f>   DW_AT_name        : (indirect string, offset: 0x19ead): timeval
    <94583>   DW_AT_byte_size   : 16
    <94584>   DW_AT_decl_file   : 5
    <94585>   DW_AT_decl_line   : 8
    <94586>   DW_AT_decl_column : 8
    <94587>   DW_AT_sibling     : <0x945a6>
 <2><9458b>: Abbrev Number: 3 (DW_TAG_member)
    <9458c>   DW_AT_name        : (indirect string, offset: 0x1a25e): tv_sec
    <94590>   DW_AT_decl_file   : 5
    <94591>   DW_AT_decl_line   : 10
    <94592>   DW_AT_decl_column : 12
    <94593>   DW_AT_type        : <0x9450a>
    <94597>   DW_AT_data_member_location: 0
 <2><94598>: Abbrev Number: 3 (DW_TAG_member)
    <94599>   DW_AT_name        : (indirect string, offset: 0x19f33): tv_usec
    <9459d>   DW_AT_decl_file   : 5
    <9459e>   DW_AT_decl_line   : 11
    <9459f>   DW_AT_decl_column : 17
    <945a0>   DW_AT_type        : <0x94522>
    <945a4>   DW_AT_data_member_location: 8
 <2><945a5>: Abbrev Number: 0
 <1><945a6>: Abbrev Number: 8 (DW_TAG_typedef)
    <945a7>   DW_AT_name        : (indirect string, offset: 0x19f14): __fd_mask
    <945ab>   DW_AT_decl_file   : 6
    <945ac>   DW_AT_decl_line   : 49
    <945ad>   DW_AT_decl_column : 18
    <945ae>   DW_AT_type        : <0x944f7>
 <1><945b2>: Abbrev Number: 29 (DW_TAG_structure_type)
    <945b3>   DW_AT_byte_size   : 128
    <945b4>   DW_AT_decl_file   : 6
    <945b5>   DW_AT_decl_line   : 59
    <945b6>   DW_AT_decl_column : 9
    <945b7>   DW_AT_sibling     : <0x945c9>
 <2><945bb>: Abbrev Number: 3 (DW_TAG_member)
    <945bc>   DW_AT_name        : (indirect string, offset: 0x19e41): __fds_bits
    <945c0>   DW_AT_decl_file   : 6
    <945c1>   DW_AT_decl_line   : 67
    <945c2>   DW_AT_decl_column : 15
    <945c3>   DW_AT_type        : <0x945c9>
    <945c7>   DW_AT_data_member_location: 0
 <2><945c8>: Abbrev Number: 0
 <1><945c9>: Abbrev Number: 12 (DW_TAG_array_type)
    <945ca>   DW_AT_type        : <0x945a6>
    <945ce>   DW_AT_sibling     : <0x945d9>
 <2><945d2>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <945d3>   DW_AT_type        : <0x944d1>
    <945d7>   DW_AT_upper_bound : 15
 <2><945d8>: Abbrev Number: 0
 <1><945d9>: Abbrev Number: 8 (DW_TAG_typedef)
    <945da>   DW_AT_name        : (indirect string, offset: 0x1a198): fd_set
    <945de>   DW_AT_decl_file   : 6
    <945df>   DW_AT_decl_line   : 70
    <945e0>   DW_AT_decl_column : 5
    <945e1>   DW_AT_type        : <0x945b2>
 <1><945e5>: Abbrev Number: 19 (DW_TAG_structure_type)
    <945e6>   DW_AT_name        : (indirect string, offset: 0x18e9a): __pthread_internal_list
    <945ea>   DW_AT_byte_size   : 16
    <945eb>   DW_AT_decl_file   : 7
    <945ec>   DW_AT_decl_line   : 49
    <945ed>   DW_AT_decl_column : 16
    <945ee>   DW_AT_sibling     : <0x9460d>
 <2><945f2>: Abbrev Number: 3 (DW_TAG_member)
    <945f3>   DW_AT_name        : (indirect string, offset: 0x18ed4): __prev
    <945f7>   DW_AT_decl_file   : 7
    <945f8>   DW_AT_decl_line   : 51
    <945f9>   DW_AT_decl_column : 35
    <945fa>   DW_AT_type        : <0x9460d>
    <945fe>   DW_AT_data_member_location: 0
 <2><945ff>: Abbrev Number: 3 (DW_TAG_member)
    <94600>   DW_AT_name        : (indirect string, offset: 0x190a3): __next
    <94604>   DW_AT_decl_file   : 7
    <94605>   DW_AT_decl_line   : 52
    <94606>   DW_AT_decl_column : 35
    <94607>   DW_AT_type        : <0x9460d>
    <9460b>   DW_AT_data_member_location: 8
 <2><9460c>: Abbrev Number: 0
 <1><9460d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9460e>   DW_AT_byte_size   : 8
    <9460e>   DW_AT_type        : <0x945e5>
 <1><94612>: Abbrev Number: 8 (DW_TAG_typedef)
    <94613>   DW_AT_name        : (indirect string, offset: 0x18905): __pthread_list_t
    <94617>   DW_AT_decl_file   : 7
    <94618>   DW_AT_decl_line   : 53
    <94619>   DW_AT_decl_column : 3
    <9461a>   DW_AT_type        : <0x945e5>
 <1><9461e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <9461f>   DW_AT_name        : (indirect string, offset: 0x18599): __pthread_mutex_s
    <94623>   DW_AT_byte_size   : 40
    <94624>   DW_AT_decl_file   : 8
    <94625>   DW_AT_decl_line   : 22
    <94626>   DW_AT_decl_column : 8
    <94627>   DW_AT_sibling     : <0x94694>
 <2><9462b>: Abbrev Number: 3 (DW_TAG_member)
    <9462c>   DW_AT_name        : (indirect string, offset: 0x188e1): __lock
    <94630>   DW_AT_decl_file   : 8
    <94631>   DW_AT_decl_line   : 24
    <94632>   DW_AT_decl_column : 7
    <94633>   DW_AT_type        : <0x944e6>
    <94637>   DW_AT_data_member_location: 0
 <2><94638>: Abbrev Number: 3 (DW_TAG_member)
    <94639>   DW_AT_name        : (indirect string, offset: 0x18d03): __count
    <9463d>   DW_AT_decl_file   : 8
    <9463e>   DW_AT_decl_line   : 25
    <9463f>   DW_AT_decl_column : 16
    <94640>   DW_AT_type        : <0x944ca>
    <94644>   DW_AT_data_member_location: 4
 <2><94645>: Abbrev Number: 3 (DW_TAG_member)
    <94646>   DW_AT_name        : (indirect string, offset: 0x1885e): __owner
    <9464a>   DW_AT_decl_file   : 8
    <9464b>   DW_AT_decl_line   : 26
    <9464c>   DW_AT_decl_column : 7
    <9464d>   DW_AT_type        : <0x944e6>
    <94651>   DW_AT_data_member_location: 8
 <2><94652>: Abbrev Number: 3 (DW_TAG_member)
    <94653>   DW_AT_name        : (indirect string, offset: 0x1952e): __nusers
    <94657>   DW_AT_decl_file   : 8
    <94658>   DW_AT_decl_line   : 28
    <94659>   DW_AT_decl_column : 16
    <9465a>   DW_AT_type        : <0x944ca>
    <9465e>   DW_AT_data_member_location: 12
 <2><9465f>: Abbrev Number: 3 (DW_TAG_member)
    <94660>   DW_AT_name        : (indirect string, offset: 0x18b54): __kind
    <94664>   DW_AT_decl_file   : 8
    <94665>   DW_AT_decl_line   : 32
    <94666>   DW_AT_decl_column : 7
    <94667>   DW_AT_type        : <0x944e6>
    <9466b>   DW_AT_data_member_location: 16
 <2><9466c>: Abbrev Number: 3 (DW_TAG_member)
    <9466d>   DW_AT_name        : (indirect string, offset: 0x1950b): __spins
    <94671>   DW_AT_decl_file   : 8
    <94672>   DW_AT_decl_line   : 34
    <94673>   DW_AT_decl_column : 9
    <94674>   DW_AT_type        : <0x944df>
    <94678>   DW_AT_data_member_location: 20
 <2><94679>: Abbrev Number: 3 (DW_TAG_member)
    <9467a>   DW_AT_name        : (indirect string, offset: 0x19127): __elision
    <9467e>   DW_AT_decl_file   : 8
    <9467f>   DW_AT_decl_line   : 35
    <94680>   DW_AT_decl_column : 9
    <94681>   DW_AT_type        : <0x944df>
    <94685>   DW_AT_data_member_location: 22
 <2><94686>: Abbrev Number: 3 (DW_TAG_member)
    <94687>   DW_AT_name        : (indirect string, offset: 0x1985e): __list
    <9468b>   DW_AT_decl_file   : 8
    <9468c>   DW_AT_decl_line   : 36
    <9468d>   DW_AT_decl_column : 20
    <9468e>   DW_AT_type        : <0x94612>
    <94692>   DW_AT_data_member_location: 24
 <2><94693>: Abbrev Number: 0
 <1><94694>: Abbrev Number: 29 (DW_TAG_structure_type)
    <94695>   DW_AT_byte_size   : 8
    <94696>   DW_AT_decl_file   : 7
    <94697>   DW_AT_decl_line   : 97
    <94698>   DW_AT_decl_column : 5
    <94699>   DW_AT_sibling     : <0x946b8>
 <2><9469d>: Abbrev Number: 3 (DW_TAG_member)
    <9469e>   DW_AT_name        : (indirect string, offset: 0x1960c): __low
    <946a2>   DW_AT_decl_file   : 7
    <946a3>   DW_AT_decl_line   : 99
    <946a4>   DW_AT_decl_column : 20
    <946a5>   DW_AT_type        : <0x944ca>
    <946a9>   DW_AT_data_member_location: 0
 <2><946aa>: Abbrev Number: 3 (DW_TAG_member)
    <946ab>   DW_AT_name        : (indirect string, offset: 0x195e0): __high
    <946af>   DW_AT_decl_file   : 7
    <946b0>   DW_AT_decl_line   : 100
    <946b1>   DW_AT_decl_column : 20
    <946b2>   DW_AT_type        : <0x944ca>
    <946b6>   DW_AT_data_member_location: 4
 <2><946b7>: Abbrev Number: 0
 <1><946b8>: Abbrev Number: 27 (DW_TAG_union_type)
    <946b9>   DW_AT_byte_size   : 8
    <946ba>   DW_AT_decl_file   : 7
    <946bb>   DW_AT_decl_line   : 94
    <946bc>   DW_AT_decl_column : 17
    <946bd>   DW_AT_sibling     : <0x946da>
 <2><946c1>: Abbrev Number: 10 (DW_TAG_member)
    <946c2>   DW_AT_name        : (indirect string, offset: 0x19981): __wseq
    <946c6>   DW_AT_decl_file   : 7
    <946c7>   DW_AT_decl_line   : 96
    <946c8>   DW_AT_decl_column : 42
    <946c9>   DW_AT_type        : <0x946da>
 <2><946cd>: Abbrev Number: 10 (DW_TAG_member)
    <946ce>   DW_AT_name        : (indirect string, offset: 0x1931e): __wseq32
    <946d2>   DW_AT_decl_file   : 7
    <946d3>   DW_AT_decl_line   : 101
    <946d4>   DW_AT_decl_column : 7
    <946d5>   DW_AT_type        : <0x94694>
 <2><946d9>: Abbrev Number: 0
 <1><946da>: Abbrev Number: 18 (DW_TAG_base_type)
    <946db>   DW_AT_byte_size   : 8
    <946dc>   DW_AT_encoding    : 7	(unsigned)
    <946dd>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><946e1>: Abbrev Number: 29 (DW_TAG_structure_type)
    <946e2>   DW_AT_byte_size   : 8
    <946e3>   DW_AT_decl_file   : 7
    <946e4>   DW_AT_decl_line   : 106
    <946e5>   DW_AT_decl_column : 5
    <946e6>   DW_AT_sibling     : <0x94705>
 <2><946ea>: Abbrev Number: 3 (DW_TAG_member)
    <946eb>   DW_AT_name        : (indirect string, offset: 0x1960c): __low
    <946ef>   DW_AT_decl_file   : 7
    <946f0>   DW_AT_decl_line   : 108
    <946f1>   DW_AT_decl_column : 20
    <946f2>   DW_AT_type        : <0x944ca>
    <946f6>   DW_AT_data_member_location: 0
 <2><946f7>: Abbrev Number: 3 (DW_TAG_member)
    <946f8>   DW_AT_name        : (indirect string, offset: 0x195e0): __high
    <946fc>   DW_AT_decl_file   : 7
    <946fd>   DW_AT_decl_line   : 109
    <946fe>   DW_AT_decl_column : 20
    <946ff>   DW_AT_type        : <0x944ca>
    <94703>   DW_AT_data_member_location: 4
 <2><94704>: Abbrev Number: 0
 <1><94705>: Abbrev Number: 27 (DW_TAG_union_type)
    <94706>   DW_AT_byte_size   : 8
    <94707>   DW_AT_decl_file   : 7
    <94708>   DW_AT_decl_line   : 103
    <94709>   DW_AT_decl_column : 17
    <9470a>   DW_AT_sibling     : <0x94727>
 <2><9470e>: Abbrev Number: 10 (DW_TAG_member)
    <9470f>   DW_AT_name        : (indirect string, offset: 0x18b5b): __g1_start
    <94713>   DW_AT_decl_file   : 7
    <94714>   DW_AT_decl_line   : 105
    <94715>   DW_AT_decl_column : 42
    <94716>   DW_AT_type        : <0x946da>
 <2><9471a>: Abbrev Number: 10 (DW_TAG_member)
    <9471b>   DW_AT_name        : (indirect string, offset: 0x19131): __g1_start32
    <9471f>   DW_AT_decl_file   : 7
    <94720>   DW_AT_decl_line   : 110
    <94721>   DW_AT_decl_column : 7
    <94722>   DW_AT_type        : <0x946e1>
 <2><94726>: Abbrev Number: 0
 <1><94727>: Abbrev Number: 19 (DW_TAG_structure_type)
    <94728>   DW_AT_name        : (indirect string, offset: 0x19a69): __pthread_cond_s
    <9472c>   DW_AT_byte_size   : 48
    <9472d>   DW_AT_decl_file   : 7
    <9472e>   DW_AT_decl_line   : 92
    <9472f>   DW_AT_decl_column : 8
    <94730>   DW_AT_sibling     : <0x94782>
 <2><94734>: Abbrev Number: 39 (DW_TAG_member)
    <94735>   DW_AT_type        : <0x946b8>
    <94739>   DW_AT_data_member_location: 0
 <2><9473a>: Abbrev Number: 39 (DW_TAG_member)
    <9473b>   DW_AT_type        : <0x94705>
    <9473f>   DW_AT_data_member_location: 8
 <2><94740>: Abbrev Number: 3 (DW_TAG_member)
    <94741>   DW_AT_name        : (indirect string, offset: 0x18ced): __g_refs
    <94745>   DW_AT_decl_file   : 7
    <94746>   DW_AT_decl_line   : 112
    <94747>   DW_AT_decl_column : 16
    <94748>   DW_AT_type        : <0x94782>
    <9474c>   DW_AT_data_member_location: 16
 <2><9474d>: Abbrev Number: 3 (DW_TAG_member)
    <9474e>   DW_AT_name        : (indirect string, offset: 0x19178): __g_size
    <94752>   DW_AT_decl_file   : 7
    <94753>   DW_AT_decl_line   : 113
    <94754>   DW_AT_decl_column : 16
    <94755>   DW_AT_type        : <0x94782>
    <94759>   DW_AT_data_member_location: 24
 <2><9475a>: Abbrev Number: 3 (DW_TAG_member)
    <9475b>   DW_AT_name        : (indirect string, offset: 0x18bc5): __g1_orig_size
    <9475f>   DW_AT_decl_file   : 7
    <94760>   DW_AT_decl_line   : 114
    <94761>   DW_AT_decl_column : 16
    <94762>   DW_AT_type        : <0x944ca>
    <94766>   DW_AT_data_member_location: 32
 <2><94767>: Abbrev Number: 3 (DW_TAG_member)
    <94768>   DW_AT_name        : (indirect string, offset: 0x18d8c): __wrefs
    <9476c>   DW_AT_decl_file   : 7
    <9476d>   DW_AT_decl_line   : 115
    <9476e>   DW_AT_decl_column : 16
    <9476f>   DW_AT_type        : <0x944ca>
    <94773>   DW_AT_data_member_location: 36
 <2><94774>: Abbrev Number: 3 (DW_TAG_member)
    <94775>   DW_AT_name        : (indirect string, offset: 0x19718): __g_signals
    <94779>   DW_AT_decl_file   : 7
    <9477a>   DW_AT_decl_line   : 116
    <9477b>   DW_AT_decl_column : 16
    <9477c>   DW_AT_type        : <0x94782>
    <94780>   DW_AT_data_member_location: 40
 <2><94781>: Abbrev Number: 0
 <1><94782>: Abbrev Number: 12 (DW_TAG_array_type)
    <94783>   DW_AT_type        : <0x944ca>
    <94787>   DW_AT_sibling     : <0x94792>
 <2><9478b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <9478c>   DW_AT_type        : <0x944d1>
    <94790>   DW_AT_upper_bound : 1
 <2><94791>: Abbrev Number: 0
 <1><94792>: Abbrev Number: 8 (DW_TAG_typedef)
    <94793>   DW_AT_name        : (indirect string, offset: 0x18786): pthread_t
    <94797>   DW_AT_decl_file   : 9
    <94798>   DW_AT_decl_line   : 27
    <94799>   DW_AT_decl_column : 27
    <9479a>   DW_AT_type        : <0x944d1>
 <1><9479e>: Abbrev Number: 27 (DW_TAG_union_type)
    <9479f>   DW_AT_byte_size   : 4
    <947a0>   DW_AT_decl_file   : 9
    <947a1>   DW_AT_decl_line   : 32
    <947a2>   DW_AT_decl_column : 9
    <947a3>   DW_AT_sibling     : <0x947c0>
 <2><947a7>: Abbrev Number: 10 (DW_TAG_member)
    <947a8>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <947ac>   DW_AT_decl_file   : 9
    <947ad>   DW_AT_decl_line   : 34
    <947ae>   DW_AT_decl_column : 8
    <947af>   DW_AT_type        : <0x947c0>
 <2><947b3>: Abbrev Number: 10 (DW_TAG_member)
    <947b4>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <947b8>   DW_AT_decl_file   : 9
    <947b9>   DW_AT_decl_line   : 35
    <947ba>   DW_AT_decl_column : 7
    <947bb>   DW_AT_type        : <0x944e6>
 <2><947bf>: Abbrev Number: 0
 <1><947c0>: Abbrev Number: 12 (DW_TAG_array_type)
    <947c1>   DW_AT_type        : <0x94546>
    <947c5>   DW_AT_sibling     : <0x947d0>
 <2><947c9>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <947ca>   DW_AT_type        : <0x944d1>
    <947ce>   DW_AT_upper_bound : 3
 <2><947cf>: Abbrev Number: 0
 <1><947d0>: Abbrev Number: 8 (DW_TAG_typedef)
    <947d1>   DW_AT_name        : (indirect string, offset: 0x190d8): pthread_mutexattr_t
    <947d5>   DW_AT_decl_file   : 9
    <947d6>   DW_AT_decl_line   : 36
    <947d7>   DW_AT_decl_column : 3
    <947d8>   DW_AT_type        : <0x9479e>
 <1><947dc>: Abbrev Number: 14 (DW_TAG_const_type)
    <947dd>   DW_AT_type        : <0x947d0>
 <1><947e1>: Abbrev Number: 27 (DW_TAG_union_type)
    <947e2>   DW_AT_byte_size   : 4
    <947e3>   DW_AT_decl_file   : 9
    <947e4>   DW_AT_decl_line   : 41
    <947e5>   DW_AT_decl_column : 9
    <947e6>   DW_AT_sibling     : <0x94803>
 <2><947ea>: Abbrev Number: 10 (DW_TAG_member)
    <947eb>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <947ef>   DW_AT_decl_file   : 9
    <947f0>   DW_AT_decl_line   : 43
    <947f1>   DW_AT_decl_column : 8
    <947f2>   DW_AT_type        : <0x947c0>
 <2><947f6>: Abbrev Number: 10 (DW_TAG_member)
    <947f7>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <947fb>   DW_AT_decl_file   : 9
    <947fc>   DW_AT_decl_line   : 44
    <947fd>   DW_AT_decl_column : 7
    <947fe>   DW_AT_type        : <0x944e6>
 <2><94802>: Abbrev Number: 0
 <1><94803>: Abbrev Number: 8 (DW_TAG_typedef)
    <94804>   DW_AT_name        : (indirect string, offset: 0x185dc): pthread_condattr_t
    <94808>   DW_AT_decl_file   : 9
    <94809>   DW_AT_decl_line   : 45
    <9480a>   DW_AT_decl_column : 3
    <9480b>   DW_AT_type        : <0x947e1>
 <1><9480f>: Abbrev Number: 14 (DW_TAG_const_type)
    <94810>   DW_AT_type        : <0x94803>
 <1><94814>: Abbrev Number: 59 (DW_TAG_union_type)
    <94815>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <94819>   DW_AT_byte_size   : 56
    <9481a>   DW_AT_decl_file   : 9
    <9481b>   DW_AT_decl_line   : 56
    <9481c>   DW_AT_decl_column : 7
    <9481d>   DW_AT_sibling     : <0x9483a>
 <2><94821>: Abbrev Number: 10 (DW_TAG_member)
    <94822>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <94826>   DW_AT_decl_file   : 9
    <94827>   DW_AT_decl_line   : 58
    <94828>   DW_AT_decl_column : 8
    <94829>   DW_AT_type        : <0x9483a>
 <2><9482d>: Abbrev Number: 10 (DW_TAG_member)
    <9482e>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <94832>   DW_AT_decl_file   : 9
    <94833>   DW_AT_decl_line   : 59
    <94834>   DW_AT_decl_column : 12
    <94835>   DW_AT_type        : <0x944f7>
 <2><94839>: Abbrev Number: 0
 <1><9483a>: Abbrev Number: 12 (DW_TAG_array_type)
    <9483b>   DW_AT_type        : <0x94546>
    <9483f>   DW_AT_sibling     : <0x9484a>
 <2><94843>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <94844>   DW_AT_type        : <0x944d1>
    <94848>   DW_AT_upper_bound : 55
 <2><94849>: Abbrev Number: 0
 <1><9484a>: Abbrev Number: 8 (DW_TAG_typedef)
    <9484b>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <9484f>   DW_AT_decl_file   : 9
    <94850>   DW_AT_decl_line   : 62
    <94851>   DW_AT_decl_column : 30
    <94852>   DW_AT_type        : <0x94814>
 <1><94856>: Abbrev Number: 14 (DW_TAG_const_type)
    <94857>   DW_AT_type        : <0x9484a>
 <1><9485b>: Abbrev Number: 27 (DW_TAG_union_type)
    <9485c>   DW_AT_byte_size   : 40
    <9485d>   DW_AT_decl_file   : 9
    <9485e>   DW_AT_decl_line   : 67
    <9485f>   DW_AT_decl_column : 9
    <94860>   DW_AT_sibling     : <0x94889>
 <2><94864>: Abbrev Number: 10 (DW_TAG_member)
    <94865>   DW_AT_name        : (indirect string, offset: 0x18a56): __data
    <94869>   DW_AT_decl_file   : 9
    <9486a>   DW_AT_decl_line   : 69
    <9486b>   DW_AT_decl_column : 28
    <9486c>   DW_AT_type        : <0x9461e>
 <2><94870>: Abbrev Number: 10 (DW_TAG_member)
    <94871>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <94875>   DW_AT_decl_file   : 9
    <94876>   DW_AT_decl_line   : 70
    <94877>   DW_AT_decl_column : 8
    <94878>   DW_AT_type        : <0x94889>
 <2><9487c>: Abbrev Number: 10 (DW_TAG_member)
    <9487d>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <94881>   DW_AT_decl_file   : 9
    <94882>   DW_AT_decl_line   : 71
    <94883>   DW_AT_decl_column : 12
    <94884>   DW_AT_type        : <0x944f7>
 <2><94888>: Abbrev Number: 0
 <1><94889>: Abbrev Number: 12 (DW_TAG_array_type)
    <9488a>   DW_AT_type        : <0x94546>
    <9488e>   DW_AT_sibling     : <0x94899>
 <2><94892>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <94893>   DW_AT_type        : <0x944d1>
    <94897>   DW_AT_upper_bound : 39
 <2><94898>: Abbrev Number: 0
 <1><94899>: Abbrev Number: 8 (DW_TAG_typedef)
    <9489a>   DW_AT_name        : (indirect string, offset: 0x18a90): pthread_mutex_t
    <9489e>   DW_AT_decl_file   : 9
    <9489f>   DW_AT_decl_line   : 72
    <948a0>   DW_AT_decl_column : 3
    <948a1>   DW_AT_type        : <0x9485b>
 <1><948a5>: Abbrev Number: 27 (DW_TAG_union_type)
    <948a6>   DW_AT_byte_size   : 48
    <948a7>   DW_AT_decl_file   : 9
    <948a8>   DW_AT_decl_line   : 75
    <948a9>   DW_AT_decl_column : 9
    <948aa>   DW_AT_sibling     : <0x948d3>
 <2><948ae>: Abbrev Number: 10 (DW_TAG_member)
    <948af>   DW_AT_name        : (indirect string, offset: 0x18a56): __data
    <948b3>   DW_AT_decl_file   : 9
    <948b4>   DW_AT_decl_line   : 77
    <948b5>   DW_AT_decl_column : 27
    <948b6>   DW_AT_type        : <0x94727>
 <2><948ba>: Abbrev Number: 10 (DW_TAG_member)
    <948bb>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <948bf>   DW_AT_decl_file   : 9
    <948c0>   DW_AT_decl_line   : 78
    <948c1>   DW_AT_decl_column : 8
    <948c2>   DW_AT_type        : <0x948d3>
 <2><948c6>: Abbrev Number: 10 (DW_TAG_member)
    <948c7>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <948cb>   DW_AT_decl_file   : 9
    <948cc>   DW_AT_decl_line   : 79
    <948cd>   DW_AT_decl_column : 31
    <948ce>   DW_AT_type        : <0x9456b>
 <2><948d2>: Abbrev Number: 0
 <1><948d3>: Abbrev Number: 12 (DW_TAG_array_type)
    <948d4>   DW_AT_type        : <0x94546>
    <948d8>   DW_AT_sibling     : <0x948e3>
 <2><948dc>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <948dd>   DW_AT_type        : <0x944d1>
    <948e1>   DW_AT_upper_bound : 47
 <2><948e2>: Abbrev Number: 0
 <1><948e3>: Abbrev Number: 8 (DW_TAG_typedef)
    <948e4>   DW_AT_name        : (indirect string, offset: 0x19001): pthread_cond_t
    <948e8>   DW_AT_decl_file   : 9
    <948e9>   DW_AT_decl_line   : 80
    <948ea>   DW_AT_decl_column : 3
    <948eb>   DW_AT_type        : <0x948a5>
 <1><948ef>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <948f0>   DW_AT_byte_size   : 8
    <948f0>   DW_AT_type        : <0x948f4>
 <1><948f4>: Abbrev Number: 60 (DW_TAG_const_type)
 <1><948f5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <948f6>   DW_AT_byte_size   : 8
    <948f6>   DW_AT_type        : <0x9454d>
 <1><948fa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <948fb>   DW_AT_byte_size   : 8
    <948fb>   DW_AT_type        : <0x948ff>
 <1><948ff>: Abbrev Number: 61 (DW_TAG_subroutine_type)
    <94900>   DW_AT_prototyped  : 1
 <1><94900>: Abbrev Number: 18 (DW_TAG_base_type)
    <94901>   DW_AT_byte_size   : 8
    <94902>   DW_AT_encoding    : 4	(float)
    <94903>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><94907>: Abbrev Number: 18 (DW_TAG_base_type)
    <94908>   DW_AT_byte_size   : 4
    <94909>   DW_AT_encoding    : 4	(float)
    <9490a>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9490e>: Abbrev Number: 12 (DW_TAG_array_type)
    <9490f>   DW_AT_type        : <0x94546>
    <94913>   DW_AT_sibling     : <0x9491e>
 <2><94917>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <94918>   DW_AT_type        : <0x944d1>
    <9491c>   DW_AT_upper_bound : 15
 <2><9491d>: Abbrev Number: 0
 <1><9491e>: Abbrev Number: 8 (DW_TAG_typedef)
    <9491f>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <94923>   DW_AT_decl_file   : 10
    <94924>   DW_AT_decl_line   : 7
    <94925>   DW_AT_decl_column : 25
    <94926>   DW_AT_type        : <0x9492a>
 <1><9492a>: Abbrev Number: 62 (DW_TAG_structure_type)
    <9492b>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <9492f>   DW_AT_declaration : 1
 <1><9492f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <94930>   DW_AT_byte_size   : 8
    <94931>   DW_AT_decl_file   : 11
    <94932>   DW_AT_decl_line   : 4
    <94933>   DW_AT_decl_column : 3
    <94934>   DW_AT_sibling     : <0x94953>
 <2><94938>: Abbrev Number: 3 (DW_TAG_member)
    <94939>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9493d>   DW_AT_decl_file   : 11
    <9493e>   DW_AT_decl_line   : 5
    <9493f>   DW_AT_decl_column : 8
    <94940>   DW_AT_type        : <0x944e6>
    <94944>   DW_AT_data_member_location: 0
 <2><94945>: Abbrev Number: 3 (DW_TAG_member)
    <94946>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9494a>   DW_AT_decl_file   : 11
    <9494b>   DW_AT_decl_line   : 6
    <9494c>   DW_AT_decl_column : 8
    <9494d>   DW_AT_type        : <0x944e6>
    <94951>   DW_AT_data_member_location: 4
 <2><94952>: Abbrev Number: 0
 <1><94953>: Abbrev Number: 29 (DW_TAG_structure_type)
    <94954>   DW_AT_byte_size   : 16
    <94955>   DW_AT_decl_file   : 11
    <94956>   DW_AT_decl_line   : 8
    <94957>   DW_AT_decl_column : 3
    <94958>   DW_AT_sibling     : <0x9498b>
 <2><9495c>: Abbrev Number: 9 (DW_TAG_member)
    <9495d>   DW_AT_name        : x
    <9495f>   DW_AT_decl_file   : 11
    <94960>   DW_AT_decl_line   : 9
    <94961>   DW_AT_decl_column : 8
    <94962>   DW_AT_type        : <0x944e6>
    <94966>   DW_AT_data_member_location: 0
 <2><94967>: Abbrev Number: 9 (DW_TAG_member)
    <94968>   DW_AT_name        : y
    <9496a>   DW_AT_decl_file   : 11
    <9496b>   DW_AT_decl_line   : 9
    <9496c>   DW_AT_decl_column : 11
    <9496d>   DW_AT_type        : <0x944e6>
    <94971>   DW_AT_data_member_location: 4
 <2><94972>: Abbrev Number: 9 (DW_TAG_member)
    <94973>   DW_AT_name        : dx
    <94976>   DW_AT_decl_file   : 11
    <94977>   DW_AT_decl_line   : 10
    <94978>   DW_AT_decl_column : 8
    <94979>   DW_AT_type        : <0x944e6>
