 <2><b616f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6170>   DW_AT_type        : <0xb59ca>
 <2><b6174>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6175>   DW_AT_type        : <0xb5a15>
 <2><b6179>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b617a>   DW_AT_type        : <0xb59b0>
 <2><b617e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b617f>   DW_AT_type        : <0xb59b0>
 <2><b6183>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6184>   DW_AT_type        : <0xb59b0>
 <2><b6188>: Abbrev Number: 0
 <1><b6189>: Abbrev Number: 3 (DW_TAG_typedef)
    <b618a>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b618e>   DW_AT_decl_file   : 10
    <b618f>   DW_AT_decl_line   : 56
    <b6190>   DW_AT_decl_column : 23
    <b6191>   DW_AT_type        : <0xb6195>
 <1><b6195>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6196>   DW_AT_byte_size   : 8
    <b6196>   DW_AT_type        : <0xb619a>
 <1><b619a>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b619b>   DW_AT_prototyped  : 1
    <b619b>   DW_AT_type        : <0xb59b0>
    <b619f>   DW_AT_sibling     : <0xb61bd>
 <2><b61a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b61a4>   DW_AT_type        : <0xb5d7a>
 <2><b61a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b61a9>   DW_AT_type        : <0xb5b26>
 <2><b61ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b61ae>   DW_AT_type        : <0xb5a15>
 <2><b61b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)

 <1><b61e9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b61ea>   DW_AT_byte_size   : 8
    <b61ea>   DW_AT_type        : <0xb61ee>
 <1><b61ee>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b61ef>   DW_AT_prototyped  : 1
    <b61ef>   DW_AT_type        : <0xb59b0>
    <b61f3>   DW_AT_sibling     : <0xb6211>
 <2><b61f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b61f8>   DW_AT_type        : <0xb60a4>
 <2><b61fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b61fd>   DW_AT_type        : <0xb60a4>
 <2><b6201>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6202>   DW_AT_type        : <0xb60a4>
 <2><b6206>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6207>   DW_AT_type        : <0xb60a4>
 <2><b620b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b620c>   DW_AT_type        : <0xb60a4>
 <2><b6210>: Abbrev Number: 0
 <1><b6211>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6212>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b6216>   DW_AT_decl_file   : 10
    <b6217>   DW_AT_decl_line   : 69
    <b6218>   DW_AT_decl_column : 23
    <b6219>   DW_AT_type        : <0xb621d>
 <1><b621d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b621e>   DW_AT_byte_size   : 8
    <b621e>   DW_AT_type        : <0xb6222>
 <1><b6222>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b6223>   DW_AT_prototyped  : 1
    <b6223>   DW_AT_type        : <0xb59b0>
    <b6227>   DW_AT_sibling     : <0xb6240>
 <2><b622b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b622c>   DW_AT_type        : <0xb59b0>
 <2><b6230>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6231>   DW_AT_type        : <0xb59b0>
 <2><b6235>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6236>   DW_AT_type        : <0xb59b0>
 <2><b623a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b623b>   DW_AT_type        : <0xb59b0>
 <2><b623f>: Abbrev Number: 0
 <1><b6240>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6241>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b6245>   DW_AT_decl_file   : 10
    <b6246>   DW_AT_decl_line   : 73
    <b6247>   DW_AT_decl_column : 23
    <b6248>   DW_AT_type        : <0xb624c>
 <1><b624c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b624d>   DW_AT_byte_size   : 8
    <b624d>   DW_AT_type        : <0xb6251>
 <1><b6251>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b6252>   DW_AT_prototyped  : 1
    <b6252>   DW_AT_type        : <0xb59b0>
    <b6256>   DW_AT_sibling     : <0xb6260>
 <2><b625a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b625b>   DW_AT_type        : <0xb598d>
 <2><b625f>: Abbrev Number: 0
 <1><b6260>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6261>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b6265>   DW_AT_decl_file   : 10
    <b6266>   DW_AT_decl_line   : 74
    <b6267>   DW_AT_decl_column : 23
    <b6268>   DW_AT_type        : <0xb626c>
 <1><b626c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b626d>   DW_AT_byte_size   : 8
    <b626d>   DW_AT_type        : <0xb6271>
 <1><b6271>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b6272>   DW_AT_prototyped  : 1
    <b6272>   DW_AT_type        : <0xb59b0>
    <b6276>   DW_AT_sibling     : <0xb6285>
 <2><b627a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b627b>   DW_AT_type        : <0xb598d>
 <2><b627f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6280>   DW_AT_type        : <0xb5986>
 <2><b6284>: Abbrev Number: 0
 <1><b6285>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6286>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b628a>   DW_AT_decl_file   : 10
    <b628b>   DW_AT_decl_line   : 80
    <b628c>   DW_AT_decl_column : 23
    <b628d>   DW_AT_type        : <0xb5ff4>
 <1><b6291>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6292>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b6296>   DW_AT_decl_file   : 10
    <b6297>   DW_AT_decl_line   : 83
    <b6298>   DW_AT_decl_column : 23
    <b6299>   DW_AT_type        : <0xb61c9>
 <1><b629d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b629e>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b62a2>   DW_AT_decl_file   : 10
    <b62a3>   DW_AT_decl_line   : 86
    <b62a4>   DW_AT_decl_column : 23
    <b62a5>   DW_AT_type        : <0xb6052>
 <1><b62a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <b62aa>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b62ae>   DW_AT_decl_file   : 10
    <b62af>   DW_AT_decl_line   : 89
    <b62b0>   DW_AT_decl_column : 23
    <b62b1>   DW_AT_type        : <0xb6052>
 <1><b62b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b62b6>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b62ba>   DW_AT_decl_file   : 10
    <b62bb>   DW_AT_decl_line   : 91
    <b62bc>   DW_AT_decl_column : 23
    <b62bd>   DW_AT_type        : <0xb62c1>
 <1><b62c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b62c2>   DW_AT_byte_size   : 8
    <b62c2>   DW_AT_type        : <0xb62c6>
 <1><b62c6>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b62c7>   DW_AT_prototyped  : 1
    <b62c7>   DW_AT_sibling     : <0xb62d1>
 <2><b62cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b62cc>   DW_AT_type        : <0xb62d1>
 <2><b62d0>: Abbrev Number: 0
 <1><b62d1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b62d2>   DW_AT_byte_size   : 8
    <b62d2>   DW_AT_type        : <0xb5fa4>
 <1><b62d6>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b62d7>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b62db>   DW_AT_byte_size   : 224
    <b62dc>   DW_AT_decl_file   : 10
    <b62dd>   DW_AT_decl_line   : 93
    <b62de>   DW_AT_decl_column : 16
    <b62df>   DW_AT_sibling     : <0xb6450>
 <2><b62e3>: Abbrev Number: 2 (DW_TAG_member)
    <b62e4>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b62e8>   DW_AT_decl_file   : 10
    <b62e9>   DW_AT_decl_line   : 94
    <b62ea>   DW_AT_decl_column : 23
    <b62eb>   DW_AT_type        : <0xb5fb0>
    <b62ef>   DW_AT_data_member_location: 0
 <2><b62f0>: Abbrev Number: 2 (DW_TAG_member)
    <b62f1>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b62f5>   DW_AT_decl_file   : 10
    <b62f6>   DW_AT_decl_line   : 95
    <b62f7>   DW_AT_decl_column : 23
    <b62f8>   DW_AT_type        : <0xb5fc6>
    <b62fc>   DW_AT_data_member_location: 8
 <2><b62fd>: Abbrev Number: 2 (DW_TAG_member)
    <b62fe>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b6302>   DW_AT_decl_file   : 10
    <b6303>   DW_AT_decl_line   : 96
    <b6304>   DW_AT_decl_column : 23
    <b6305>   DW_AT_type        : <0xb5fdc>
    <b6309>   DW_AT_data_member_location: 16
 <2><b630a>: Abbrev Number: 2 (DW_TAG_member)
    <b630b>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b630f>   DW_AT_decl_file   : 10
    <b6310>   DW_AT_decl_line   : 97
    <b6311>   DW_AT_decl_column : 23
    <b6312>   DW_AT_type        : <0xb5fe8>
    <b6316>   DW_AT_data_member_location: 24
 <2><b6317>: Abbrev Number: 2 (DW_TAG_member)
    <b6318>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b631c>   DW_AT_decl_file   : 10
    <b631d>   DW_AT_decl_line   : 98
    <b631e>   DW_AT_decl_column : 23
    <b631f>   DW_AT_type        : <0xb6004>
    <b6323>   DW_AT_data_member_location: 32
 <2><b6324>: Abbrev Number: 2 (DW_TAG_member)
    <b6325>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b6329>   DW_AT_decl_file   : 10
    <b632a>   DW_AT_decl_line   : 99
    <b632b>   DW_AT_decl_column : 23
    <b632c>   DW_AT_type        : <0xb602e>
    <b6330>   DW_AT_data_member_location: 40
 <2><b6331>: Abbrev Number: 2 (DW_TAG_member)
    <b6332>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b6336>   DW_AT_decl_file   : 10
    <b6337>   DW_AT_decl_line   : 100
    <b6338>   DW_AT_decl_column : 23
    <b6339>   DW_AT_type        : <0xb6046>
    <b633d>   DW_AT_data_member_location: 48
 <2><b633e>: Abbrev Number: 2 (DW_TAG_member)
    <b633f>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b6343>   DW_AT_decl_file   : 10
    <b6344>   DW_AT_decl_line   : 101
    <b6345>   DW_AT_decl_column : 23
    <b6346>   DW_AT_type        : <0xb606b>
    <b634a>   DW_AT_data_member_location: 56
 <2><b634b>: Abbrev Number: 2 (DW_TAG_member)
    <b634c>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b6350>   DW_AT_decl_file   : 10
    <b6351>   DW_AT_decl_line   : 102
    <b6352>   DW_AT_decl_column : 23
    <b6353>   DW_AT_type        : <0xb6077>
    <b6357>   DW_AT_data_member_location: 64
 <2><b6358>: Abbrev Number: 2 (DW_TAG_member)
    <b6359>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b635d>   DW_AT_decl_file   : 10
    <b635e>   DW_AT_decl_line   : 103
    <b635f>   DW_AT_decl_column : 23
    <b6360>   DW_AT_type        : <0xb6083>
    <b6364>   DW_AT_data_member_location: 72
 <2><b6365>: Abbrev Number: 2 (DW_TAG_member)
    <b6366>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b636a>   DW_AT_decl_file   : 10
    <b636b>   DW_AT_decl_line   : 104
    <b636c>   DW_AT_decl_column : 23
    <b636d>   DW_AT_type        : <0xb60a9>
    <b6371>   DW_AT_data_member_location: 80
 <2><b6372>: Abbrev Number: 2 (DW_TAG_member)
    <b6373>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b6377>   DW_AT_decl_file   : 10
    <b6378>   DW_AT_decl_line   : 105
    <b6379>   DW_AT_decl_column : 24
    <b637a>   DW_AT_type        : <0xb60df>
    <b637e>   DW_AT_data_member_location: 88
 <2><b637f>: Abbrev Number: 2 (DW_TAG_member)
    <b6380>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b6384>   DW_AT_decl_file   : 10
    <b6385>   DW_AT_decl_line   : 106
    <b6386>   DW_AT_decl_column : 25
    <b6387>   DW_AT_type        : <0xb6105>
    <b638b>   DW_AT_data_member_location: 96
 <2><b638c>: Abbrev Number: 2 (DW_TAG_member)
    <b638d>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b6391>   DW_AT_decl_file   : 10
    <b6392>   DW_AT_decl_line   : 107
    <b6393>   DW_AT_decl_column : 23
    <b6394>   DW_AT_type        : <0xb612b>
    <b6398>   DW_AT_data_member_location: 104
 <2><b6399>: Abbrev Number: 2 (DW_TAG_member)
    <b639a>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b639e>   DW_AT_decl_file   : 10
    <b639f>   DW_AT_decl_line   : 108
    <b63a0>   DW_AT_decl_column : 23
    <b63a1>   DW_AT_type        : <0xb61bd>
    <b63a5>   DW_AT_data_member_location: 112
 <2><b63a6>: Abbrev Number: 2 (DW_TAG_member)
    <b63a7>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b63ab>   DW_AT_decl_file   : 10
    <b63ac>   DW_AT_decl_line   : 109
    <b63ad>   DW_AT_decl_column : 23
    <b63ae>   DW_AT_type        : <0xb61dd>
    <b63b2>   DW_AT_data_member_location: 120
 <2><b63b3>: Abbrev Number: 2 (DW_TAG_member)
    <b63b4>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b63b8>   DW_AT_decl_file   : 10
    <b63b9>   DW_AT_decl_line   : 110
    <b63ba>   DW_AT_decl_column : 23
    <b63bb>   DW_AT_type        : <0xb6211>
    <b63bf>   DW_AT_data_member_location: 128
 <2><b63c0>: Abbrev Number: 2 (DW_TAG_member)
    <b63c1>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b63c5>   DW_AT_decl_file   : 10
    <b63c6>   DW_AT_decl_line   : 111
    <b63c7>   DW_AT_decl_column : 23
    <b63c8>   DW_AT_type        : <0xb6240>
    <b63cc>   DW_AT_data_member_location: 136
 <2><b63cd>: Abbrev Number: 2 (DW_TAG_member)
    <b63ce>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b63d2>   DW_AT_decl_file   : 10
    <b63d3>   DW_AT_decl_line   : 112
    <b63d4>   DW_AT_decl_column : 23
    <b63d5>   DW_AT_type        : <0xb6260>
    <b63d9>   DW_AT_data_member_location: 144
 <2><b63da>: Abbrev Number: 2 (DW_TAG_member)
    <b63db>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b63df>   DW_AT_decl_file   : 10
    <b63e0>   DW_AT_decl_line   : 113
    <b63e1>   DW_AT_decl_column : 25
    <b63e2>   DW_AT_type        : <0xb603a>
    <b63e6>   DW_AT_data_member_location: 152
 <2><b63e7>: Abbrev Number: 2 (DW_TAG_member)
    <b63e8>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b63ec>   DW_AT_decl_file   : 10
    <b63ed>   DW_AT_decl_line   : 114
    <b63ee>   DW_AT_decl_column : 24
    <b63ef>   DW_AT_type        : <0xb6150>
    <b63f3>   DW_AT_data_member_location: 160
 <2><b63f4>: Abbrev Number: 2 (DW_TAG_member)
    <b63f5>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <b63f9>   DW_AT_decl_file   : 10
    <b63fa>   DW_AT_decl_line   : 115
    <b63fb>   DW_AT_decl_column : 25
    <b63fc>   DW_AT_type        : <0xb6189>
    <b6400>   DW_AT_data_member_location: 168
 <2><b6401>: Abbrev Number: 2 (DW_TAG_member)
    <b6402>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <b6406>   DW_AT_decl_file   : 10
    <b6407>   DW_AT_decl_line   : 116
    <b6408>   DW_AT_decl_column : 23
    <b6409>   DW_AT_type        : <0xb60b5>
    <b640d>   DW_AT_data_member_location: 176
 <2><b640e>: Abbrev Number: 2 (DW_TAG_member)
    <b640f>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <b6413>   DW_AT_decl_file   : 10
    <b6414>   DW_AT_decl_line   : 117
    <b6415>   DW_AT_decl_column : 23
    <b6416>   DW_AT_type        : <0xb6285>
    <b641a>   DW_AT_data_member_location: 184
 <2><b641b>: Abbrev Number: 2 (DW_TAG_member)
    <b641c>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <b6420>   DW_AT_decl_file   : 10
    <b6421>   DW_AT_decl_line   : 118
    <b6422>   DW_AT_decl_column : 22
    <b6423>   DW_AT_type        : <0xb6291>
    <b6427>   DW_AT_data_member_location: 192
 <2><b6428>: Abbrev Number: 2 (DW_TAG_member)
    <b6429>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <b642d>   DW_AT_decl_file   : 10
    <b642e>   DW_AT_decl_line   : 119
    <b642f>   DW_AT_decl_column : 23
    <b6430>   DW_AT_type        : <0xb629d>
    <b6434>   DW_AT_data_member_location: 200
 <2><b6435>: Abbrev Number: 2 (DW_TAG_member)
    <b6436>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <b643a>   DW_AT_decl_file   : 10
    <b643b>   DW_AT_decl_line   : 120
    <b643c>   DW_AT_decl_column : 22
    <b643d>   DW_AT_type        : <0xb62a9>
    <b6441>   DW_AT_data_member_location: 208
 <2><b6442>: Abbrev Number: 2 (DW_TAG_member)
    <b6443>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <b6447>   DW_AT_decl_file   : 10
    <b6448>   DW_AT_decl_line   : 121
    <b6449>   DW_AT_decl_column : 23
    <b644a>   DW_AT_type        : <0xb62b5>
    <b644e>   DW_AT_data_member_location: 216
 <2><b644f>: Abbrev Number: 0
 <1><b6450>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6451>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b6455>   DW_AT_decl_file   : 10
    <b6456>   DW_AT_decl_line   : 122
    <b6457>   DW_AT_decl_column : 3
    <b6458>   DW_AT_type        : <0xb62d6>
 <1><b645c>: Abbrev Number: 42 (DW_TAG_structure_type)
    <b645d>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <b6461>   DW_AT_byte_size   : 20848
    <b6463>   DW_AT_decl_file   : 11
    <b6464>   DW_AT_decl_line   : 349
    <b6466>   DW_AT_decl_column : 16
    <b6467>   DW_AT_sibling     : <0xb64dc>
 <2><b646b>: Abbrev Number: 14 (DW_TAG_member)
    <b646c>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <b6470>   DW_AT_decl_file   : 11
    <b6470>   DW_AT_decl_line   : 350
    <b6472>   DW_AT_decl_column : 18
    <b6472>   DW_AT_type        : <0xb59b0>
    <b6476>   DW_AT_data_member_location: 0
 <2><b6477>: Abbrev Number: 14 (DW_TAG_member)
    <b6478>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <b647c>   DW_AT_decl_file   : 11
    <b647c>   DW_AT_decl_line   : 351
    <b647e>   DW_AT_decl_column : 18
    <b647e>   DW_AT_type        : <0xb5a3e>
    <b6482>   DW_AT_data_member_location: 8
 <2><b6483>: Abbrev Number: 14 (DW_TAG_member)
    <b6484>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <b6488>   DW_AT_decl_file   : 11
    <b6488>   DW_AT_decl_line   : 352
    <b648a>   DW_AT_decl_column : 18
    <b648a>   DW_AT_type        : <0xb5b0c>
    <b648e>   DW_AT_data_member_location: 16
 <2><b648f>: Abbrev Number: 14 (DW_TAG_member)
    <b6490>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <b6494>   DW_AT_decl_file   : 11
    <b6494>   DW_AT_decl_line   : 353
    <b6496>   DW_AT_decl_column : 18
    <b6496>   DW_AT_type        : <0xb59d8>
    <b649a>   DW_AT_data_member_location: 40
 <2><b649b>: Abbrev Number: 14 (DW_TAG_member)
    <b649c>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b64a0>   DW_AT_decl_file   : 11
    <b64a0>   DW_AT_decl_line   : 354
    <b64a2>   DW_AT_decl_column : 18
    <b64a2>   DW_AT_type        : <0xb6450>
    <b64a6>   DW_AT_data_member_location: 48
 <2><b64a7>: Abbrev Number: 15 (DW_TAG_member)
    <b64a8>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <b64ac>   DW_AT_decl_file   : 11
    <b64ac>   DW_AT_decl_line   : 355
    <b64ae>   DW_AT_decl_column : 18
    <b64ae>   DW_AT_type        : <0xb64dc>
    <b64b2>   DW_AT_data_member_location: 272
 <2><b64b4>: Abbrev Number: 15 (DW_TAG_member)
    <b64b5>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <b64b9>   DW_AT_decl_file   : 11
    <b64b9>   DW_AT_decl_line   : 356
    <b64bb>   DW_AT_decl_column : 18
    <b64bb>   DW_AT_type        : <0xb59b0>
    <b64bf>   DW_AT_data_member_location: 20832
 <2><b64c1>: Abbrev Number: 15 (DW_TAG_member)
    <b64c2>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <b64c6>   DW_AT_decl_file   : 11
    <b64c6>   DW_AT_decl_line   : 357
    <b64c8>   DW_AT_decl_column : 18
    <b64c8>   DW_AT_type        : <0xb59b0>
    <b64cc>   DW_AT_data_member_location: 20836
 <2><b64ce>: Abbrev Number: 15 (DW_TAG_member)
    <b64cf>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <b64d3>   DW_AT_decl_file   : 11
    <b64d3>   DW_AT_decl_line   : 358
    <b64d5>   DW_AT_decl_column : 18
    <b64d5>   DW_AT_type        : <0xb5ad1>
    <b64d9>   DW_AT_data_member_location: 20840
 <2><b64db>: Abbrev Number: 0
 <1><b64dc>: Abbrev Number: 21 (DW_TAG_array_type)
    <b64dd>   DW_AT_type        : <0xb5eea>
    <b64e1>   DW_AT_sibling     : <0xb64ed>
 <2><b64e5>: Abbrev Number: 43 (DW_TAG_subrange_type)
    <b64e6>   DW_AT_type        : <0xb599b>
    <b64ea>   DW_AT_upper_bound : 256
 <2><b64ec>: Abbrev Number: 0
 <1><b64ed>: Abbrev Number: 20 (DW_TAG_typedef)
    <b64ee>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <b64f2>   DW_AT_decl_file   : 11
    <b64f3>   DW_AT_decl_line   : 359
    <b64f5>   DW_AT_decl_column : 3
    <b64f6>   DW_AT_type        : <0xb645c>
 <1><b64fa>: Abbrev Number: 44 (DW_TAG_variable)
    <b64fb>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <b64ff>   DW_AT_decl_file   : 11
    <b6500>   DW_AT_decl_line   : 361
    <b6502>   DW_AT_decl_column : 21
    <b6503>   DW_AT_type        : <0xb64ed>
    <b6507>   DW_AT_external    : 1
    <b6507>   DW_AT_declaration : 1
 <1><b6507>: Abbrev Number: 45 (DW_TAG_subprogram)
    <b6508>   DW_AT_external    : 1
    <b6508>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <b650c>   DW_AT_decl_file   : 7
    <b650d>   DW_AT_decl_line   : 50
    <b650e>   DW_AT_decl_column : 22
    <b650f>   DW_AT_prototyped  : 1
    <b650f>   DW_AT_type        : <0xb59b0>
    <b6513>   DW_AT_declaration : 1
    <b6513>   DW_AT_sibling     : <0xb651d>
 <2><b6517>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6518>   DW_AT_type        : <0xb59b0>
 <2><b651c>: Abbrev Number: 0
 <1><b651d>: Abbrev Number: 27 (DW_TAG_subprogram)
    <b651e>   DW_AT_external    : 1
    <b651e>   DW_AT_name        : (indirect string, offset: 0x1b589): fb_FileSeekLarge
    <b6522>   DW_AT_decl_file   : 1
    <b6522>   DW_AT_decl_line   : 38
    <b6523>   DW_AT_decl_column : 12
    <b6523>   DW_AT_prototyped  : 1
    <b6523>   DW_AT_type        : <0xb59b0>
    <b6527>   DW_AT_low_pc      : 0x471820
    <b652f>   DW_AT_high_pc     : 0x89
    <b6537>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b6539>   DW_AT_call_all_calls: 1
    <b6539>   DW_AT_sibling     : <0xb65f9>
 <2><b653d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b653e>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <b6542>   DW_AT_decl_file   : 1
    <b6542>   DW_AT_decl_line   : 38
    <b6543>   DW_AT_decl_column : 34
    <b6544>   DW_AT_type        : <0xb59b0>
    <b6548>   DW_AT_location    : 0x3a06d (location list)
    <b654c>   DW_AT_GNU_locviews: 0x3a05f
 <2><b6550>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b6551>   DW_AT_name        : (indirect string, offset: 0x1b582): newpos
    <b6555>   DW_AT_decl_file   : 1
    <b6555>   DW_AT_decl_line   : 38
    <b6556>   DW_AT_decl_column : 50
    <b6557>   DW_AT_type        : <0xb5a02>
    <b655b>   DW_AT_location    : 0x3a0b6 (location list)
    <b655f>   DW_AT_GNU_locviews: 0x3a0aa
 <2><b6563>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <b6564>   DW_AT_abstract_origin: <0xb66d5>
    <b6568>   DW_AT_entry_pc    : 0x47184b
    <b6570>   DW_AT_GNU_entry_view: 0
    <b6571>   DW_AT_ranges      : 0x18050
    <b6575>   DW_AT_call_file   : 1
    <b6575>   DW_AT_call_line   : 40
    <b6576>   DW_AT_call_column : 12
 <3><b6576>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b6577>   DW_AT_abstract_origin: <0xb66f0>
    <b657b>   DW_AT_location    : 0x3a0f3 (location list)
    <b657f>   DW_AT_GNU_locviews: 0x3a0e9
 <3><b6583>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b6584>   DW_AT_abstract_origin: <0xb66e6>
    <b6588>   DW_AT_location    : 0x3a11f (location list)
    <b658c>   DW_AT_GNU_locviews: 0x3a119
 <3><b6590>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <b6591>   DW_AT_ranges      : 0x18050
 <4><b6595>: Abbrev Number: 10 (DW_TAG_variable)
    <b6596>   DW_AT_abstract_origin: <0xb66fa>
 <4><b659a>: Abbrev Number: 17 (DW_TAG_inlined_subroutine)
    <b659b>   DW_AT_abstract_origin: <0xb66d5>
    <b659f>   DW_AT_entry_pc    : 0x471854
    <b65a7>   DW_AT_GNU_entry_view: 0
    <b65a8>   DW_AT_low_pc      : 0x471854
    <b65b0>   DW_AT_high_pc     : 0xc
    <b65b8>   DW_AT_call_file   : 1
    <b65b8>   DW_AT_call_line   : 5
    <b65b8>   DW_AT_call_column : 5
    <b65b8>   DW_AT_sibling     : <0xb65e7>
 <5><b65bc>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <b65bd>   DW_AT_abstract_origin: <0xb66e6>
 <5><b65c1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b65c2>   DW_AT_abstract_origin: <0xb66f0>
    <b65c6>   DW_AT_location    : 0x3a137 (location list)
    <b65ca>   DW_AT_GNU_locviews: 0x3a135
 <5><b65ce>: Abbrev Number: 10 (DW_TAG_variable)
    <b65cf>   DW_AT_abstract_origin: <0xb66fa>
 <5><b65d3>: Abbrev Number: 18 (DW_TAG_call_site)
    <b65d4>   DW_AT_call_return_pc: 0x47185e
    <b65dc>   DW_AT_call_tail_call: 1
    <b65dc>   DW_AT_call_origin : <0xb6507>
 <6><b65e0>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b65e1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b65e3>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <6><b65e5>: Abbrev Number: 0
 <5><b65e6>: Abbrev Number: 0
 <4><b65e7>: Abbrev Number: 19 (DW_TAG_call_site)
    <b65e8>   DW_AT_call_return_pc: 0x47188e
    <b65f0>   DW_AT_call_tail_call: 1
 <5><b65f0>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b65f1>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b65f3>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><b65f5>: Abbrev Number: 0
 <4><b65f6>: Abbrev Number: 0
 <3><b65f7>: Abbrev Number: 0
 <2><b65f8>: Abbrev Number: 0
 <1><b65f9>: Abbrev Number: 27 (DW_TAG_subprogram)
    <b65fa>   DW_AT_external    : 1
    <b65fa>   DW_AT_name        : (indirect string, offset: 0x2b78): fb_FileSeek
    <b65fe>   DW_AT_decl_file   : 1
    <b65fe>   DW_AT_decl_line   : 33
    <b65ff>   DW_AT_decl_column : 12
    <b65ff>   DW_AT_prototyped  : 1
    <b65ff>   DW_AT_type        : <0xb59b0>
    <b6603>   DW_AT_low_pc      : 0x471780
    <b660b>   DW_AT_high_pc     : 0x91
    <b6613>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b6615>   DW_AT_call_all_calls: 1
    <b6615>   DW_AT_sibling     : <0xb66d5>
 <2><b6619>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b661a>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <b661e>   DW_AT_decl_file   : 1
    <b661e>   DW_AT_decl_line   : 33
    <b661f>   DW_AT_decl_column : 29
    <b6620>   DW_AT_type        : <0xb59b0>
    <b6624>   DW_AT_location    : 0x3a150 (location list)
    <b6628>   DW_AT_GNU_locviews: 0x3a142
 <2><b662c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b662d>   DW_AT_name        : (indirect string, offset: 0x1b582): newpos
    <b6631>   DW_AT_decl_file   : 1
    <b6631>   DW_AT_decl_line   : 33
    <b6632>   DW_AT_decl_column : 39
    <b6633>   DW_AT_type        : <0xb59b0>
    <b6637>   DW_AT_location    : 0x3a194 (location list)
    <b663b>   DW_AT_GNU_locviews: 0x3a188
 <2><b663f>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <b6640>   DW_AT_abstract_origin: <0xb66d5>
    <b6644>   DW_AT_entry_pc    : 0x4717ab
    <b664c>   DW_AT_GNU_entry_view: 0
    <b664d>   DW_AT_ranges      : 0x18041
    <b6651>   DW_AT_call_file   : 1
    <b6651>   DW_AT_call_line   : 35
    <b6652>   DW_AT_call_column : 12
 <3><b6652>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b6653>   DW_AT_abstract_origin: <0xb66f0>
    <b6657>   DW_AT_location    : 0x3a1ce (location list)
    <b665b>   DW_AT_GNU_locviews: 0x3a1c6
 <3><b665f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b6660>   DW_AT_abstract_origin: <0xb66e6>
    <b6664>   DW_AT_location    : 0x3a200 (location list)
    <b6668>   DW_AT_GNU_locviews: 0x3a1fa
 <3><b666c>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <b666d>   DW_AT_ranges      : 0x18041
 <4><b6671>: Abbrev Number: 10 (DW_TAG_variable)
    <b6672>   DW_AT_abstract_origin: <0xb66fa>
 <4><b6676>: Abbrev Number: 17 (DW_TAG_inlined_subroutine)
    <b6677>   DW_AT_abstract_origin: <0xb66d5>
    <b667b>   DW_AT_entry_pc    : 0x4717b4
    <b6683>   DW_AT_GNU_entry_view: 0
    <b6684>   DW_AT_low_pc      : 0x4717b4
    <b668c>   DW_AT_high_pc     : 0xc
    <b6694>   DW_AT_call_file   : 1
    <b6694>   DW_AT_call_line   : 5
    <b6694>   DW_AT_call_column : 5
    <b6694>   DW_AT_sibling     : <0xb66c3>
 <5><b6698>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <b6699>   DW_AT_abstract_origin: <0xb66e6>
 <5><b669d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b669e>   DW_AT_abstract_origin: <0xb66f0>
    <b66a2>   DW_AT_location    : 0x3a217 (location list)
    <b66a6>   DW_AT_GNU_locviews: 0x3a215
 <5><b66aa>: Abbrev Number: 10 (DW_TAG_variable)
    <b66ab>   DW_AT_abstract_origin: <0xb66fa>
 <5><b66af>: Abbrev Number: 18 (DW_TAG_call_site)
    <b66b0>   DW_AT_call_return_pc: 0x4717be
    <b66b8>   DW_AT_call_tail_call: 1
    <b66b8>   DW_AT_call_origin : <0xb6507>
 <6><b66bc>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b66bd>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b66bf>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <6><b66c1>: Abbrev Number: 0
 <5><b66c2>: Abbrev Number: 0
 <4><b66c3>: Abbrev Number: 19 (DW_TAG_call_site)
    <b66c4>   DW_AT_call_return_pc: 0x4717f1
    <b66cc>   DW_AT_call_tail_call: 1
 <5><b66cc>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b66cd>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b66cf>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><b66d1>: Abbrev Number: 0
 <4><b66d2>: Abbrev Number: 0
 <3><b66d3>: Abbrev Number: 0
 <2><b66d4>: Abbrev Number: 0
 <1><b66d5>: Abbrev Number: 46 (DW_TAG_subprogram)
    <b66d6>   DW_AT_external    : 1
    <b66d6>   DW_AT_name        : (indirect string, offset: 0x1b3b9): fb_FileSeekEx
    <b66da>   DW_AT_decl_file   : 1
    <b66db>   DW_AT_decl_line   : 5
    <b66dc>   DW_AT_decl_column : 5
    <b66dd>   DW_AT_prototyped  : 1
    <b66dd>   DW_AT_type        : <0xb59b0>
    <b66e1>   DW_AT_inline      : 1	(inlined)
    <b66e2>   DW_AT_sibling     : <0xb6707>
 <2><b66e6>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <b66e7>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <b66eb>   DW_AT_decl_file   : 1
    <b66eb>   DW_AT_decl_line   : 5
    <b66eb>   DW_AT_decl_column : 29
    <b66ec>   DW_AT_type        : <0xb5ef6>
 <2><b66f0>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <b66f1>   DW_AT_name        : (indirect string, offset: 0x1b582): newpos
    <b66f5>   DW_AT_decl_file   : 1
    <b66f5>   DW_AT_decl_line   : 5
    <b66f5>   DW_AT_decl_column : 46
    <b66f6>   DW_AT_type        : <0xb5a43>
 <2><b66fa>: Abbrev Number: 47 (DW_TAG_variable)
    <b66fb>   DW_AT_name        : res
    <b66ff>   DW_AT_decl_file   : 1
    <b6700>   DW_AT_decl_line   : 7
    <b6701>   DW_AT_decl_column : 6
    <b6702>   DW_AT_type        : <0xb59b0>
 <2><b6706>: Abbrev Number: 0
 <1><b6707>: Abbrev Number: 48 (DW_TAG_subprogram)
    <b6708>   DW_AT_abstract_origin: <0xb66d5>
    <b670c>   DW_AT_low_pc      : 0x471730
    <b6714>   DW_AT_high_pc     : 0x4b
    <b671c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b671e>   DW_AT_call_all_calls: 1
 <2><b671e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b671f>   DW_AT_abstract_origin: <0xb66e6>
    <b6723>   DW_AT_location    : 0x3a230 (location list)
    <b6727>   DW_AT_GNU_locviews: 0x3a228
 <2><b672b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b672c>   DW_AT_abstract_origin: <0xb66f0>
    <b6730>   DW_AT_location    : 0x3a253 (location list)
    <b6734>   DW_AT_GNU_locviews: 0x3a24b
 <2><b6738>: Abbrev Number: 10 (DW_TAG_variable)
    <b6739>   DW_AT_abstract_origin: <0xb66fa>
 <2><b673d>: Abbrev Number: 17 (DW_TAG_inlined_subroutine)
    <b673e>   DW_AT_abstract_origin: <0xb66d5>
    <b6742>   DW_AT_entry_pc    : 0x471771
    <b674a>   DW_AT_GNU_entry_view: 0
    <b674b>   DW_AT_low_pc      : 0x471771
    <b6753>   DW_AT_high_pc     : 0xa
    <b675b>   DW_AT_call_file   : 1
    <b675b>   DW_AT_call_line   : 5
    <b675b>   DW_AT_call_column : 5
    <b675b>   DW_AT_sibling     : <0xb6792>
 <3><b675f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b6760>   DW_AT_abstract_origin: <0xb66e6>
    <b6764>   DW_AT_location    : 0x3a26e (location list)
    <b6768>   DW_AT_GNU_locviews: 0x3a26a
 <3><b676c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <b676d>   DW_AT_abstract_origin: <0xb66f0>
    <b6771>   DW_AT_location    : 0x3a27e (location list)
    <b6775>   DW_AT_GNU_locviews: 0x3a27c
 <3><b6779>: Abbrev Number: 10 (DW_TAG_variable)
    <b677a>   DW_AT_abstract_origin: <0xb66fa>
 <3><b677e>: Abbrev Number: 18 (DW_TAG_call_site)
    <b677f>   DW_AT_call_return_pc: 0x47177b
    <b6787>   DW_AT_call_tail_call: 1
    <b6787>   DW_AT_call_origin : <0xb6507>
 <4><b678b>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b678c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b678e>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><b6790>: Abbrev Number: 0
 <3><b6791>: Abbrev Number: 0
 <2><b6792>: Abbrev Number: 19 (DW_TAG_call_site)
    <b6793>   DW_AT_call_return_pc: 0x47175c
    <b679b>   DW_AT_call_tail_call: 1
 <3><b679b>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <b679c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b679e>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><b67a0>: Abbrev Number: 0
 <2><b67a1>: Abbrev Number: 0
 <1><b67a2>: Abbrev Number: 0
  Compilation Unit @ offset 0xb67a3:
   Length:        0xd57 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xcd3c
   Pointer Size:  8
 <0><b67af>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <b67b0>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <b67b4>   DW_AT_language    : 29	(C11)
    <b67b5>   DW_AT_name        : (indirect line string, offset: 0xd4e): src/rtlib/file_size.c
    <b67b9>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <b67bd>   DW_AT_low_pc      : 0x4718b0
    <b67c5>   DW_AT_high_pc     : 0x1a9
    <b67cd>   DW_AT_stmt_list   : 0x65a79
 <1><b67d1>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67d2>   DW_AT_byte_size   : 1
    <b67d3>   DW_AT_encoding    : 8	(unsigned char)
    <b67d4>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><b67d8>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67d9>   DW_AT_byte_size   : 2
    <b67da>   DW_AT_encoding    : 7	(unsigned)
    <b67db>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><b67df>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67e0>   DW_AT_byte_size   : 4
    <b67e1>   DW_AT_encoding    : 7	(unsigned)
    <b67e2>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><b67e6>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67e7>   DW_AT_byte_size   : 8
    <b67e8>   DW_AT_encoding    : 7	(unsigned)
    <b67e9>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><b67ed>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67ee>   DW_AT_byte_size   : 1
    <b67ef>   DW_AT_encoding    : 6	(signed char)
    <b67f0>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><b67f4>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67f5>   DW_AT_byte_size   : 2
    <b67f6>   DW_AT_encoding    : 5	(signed)
    <b67f7>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><b67fb>: Abbrev Number: 28 (DW_TAG_base_type)
    <b67fc>   DW_AT_byte_size   : 4
    <b67fd>   DW_AT_encoding    : 5	(signed)
    <b67fe>   DW_AT_name        : int
 <1><b6802>: Abbrev Number: 7 (DW_TAG_base_type)
    <b6803>   DW_AT_byte_size   : 8
    <b6804>   DW_AT_encoding    : 5	(signed)
    <b6805>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><b6809>: Abbrev Number: 3 (DW_TAG_typedef)
    <b680a>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <b680e>   DW_AT_decl_file   : 2
    <b680f>   DW_AT_decl_line   : 153
    <b6810>   DW_AT_decl_column : 27
    <b6811>   DW_AT_type        : <0xb6802>
 <1><b6815>: Abbrev Number: 29 (DW_TAG_pointer_type)
    <b6816>   DW_AT_byte_size   : 8
 <1><b6817>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6818>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <b681c>   DW_AT_decl_file   : 2
    <b681d>   DW_AT_decl_line   : 194
    <b681e>   DW_AT_decl_column : 27
    <b681f>   DW_AT_type        : <0xb6802>
 <1><b6823>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6824>   DW_AT_byte_size   : 8
    <b6824>   DW_AT_type        : <0xb6828>
 <1><b6828>: Abbrev Number: 7 (DW_TAG_base_type)
    <b6829>   DW_AT_byte_size   : 1
    <b682a>   DW_AT_encoding    : 6	(signed char)
    <b682b>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><b682f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6830>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <b6834>   DW_AT_decl_file   : 3
    <b6835>   DW_AT_decl_line   : 209
    <b6836>   DW_AT_decl_column : 23
    <b6837>   DW_AT_type        : <0xb67e6>
 <1><b683b>: Abbrev Number: 16 (DW_TAG_typedef)
    <b683c>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <b6840>   DW_AT_decl_file   : 3
    <b6841>   DW_AT_decl_line   : 321
    <b6843>   DW_AT_decl_column : 24
    <b6844>   DW_AT_type        : <0xb67fb>
 <1><b6848>: Abbrev Number: 30 (DW_TAG_const_type)
    <b6849>   DW_AT_type        : <0xb683b>
 <1><b684d>: Abbrev Number: 7 (DW_TAG_base_type)
    <b684e>   DW_AT_byte_size   : 8
    <b684f>   DW_AT_encoding    : 5	(signed)
    <b6850>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><b6854>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6855>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <b6859>   DW_AT_decl_file   : 4
    <b685a>   DW_AT_decl_line   : 87
    <b685b>   DW_AT_decl_column : 19
    <b685c>   DW_AT_type        : <0xb6809>
 <1><b6860>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6861>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <b6865>   DW_AT_decl_file   : 4
    <b6866>   DW_AT_decl_line   : 108
    <b6867>   DW_AT_decl_column : 19
    <b6868>   DW_AT_type        : <0xb6817>
 <1><b686c>: Abbrev Number: 7 (DW_TAG_base_type)
    <b686d>   DW_AT_byte_size   : 8
    <b686e>   DW_AT_encoding    : 7	(unsigned)
    <b686f>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><b6873>: Abbrev Number: 17 (DW_TAG_array_type)
    <b6874>   DW_AT_type        : <0xb6828>
    <b6878>   DW_AT_sibling     : <0xb6883>
 <2><b687c>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <b687d>   DW_AT_type        : <0xb67e6>
    <b6881>   DW_AT_upper_bound : 3
 <2><b6882>: Abbrev Number: 0
 <1><b6883>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6884>   DW_AT_byte_size   : 8
    <b6884>   DW_AT_type        : <0xb6888>
 <1><b6888>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><b6889>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b688a>   DW_AT_byte_size   : 8
    <b688a>   DW_AT_type        : <0xb6823>
 <1><b688e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b688f>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <b6893>   DW_AT_decl_file   : 5
    <b6894>   DW_AT_decl_line   : 22
    <b6895>   DW_AT_decl_column : 15
    <b6896>   DW_AT_type        : <0xb6854>
 <1><b689a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b689b>   DW_AT_byte_size   : 8
    <b689b>   DW_AT_type        : <0xb689f>
 <1><b689f>: Abbrev Number: 33 (DW_TAG_subroutine_type)
    <b68a0>   DW_AT_prototyped  : 1
 <1><b68a0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b68a1>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <b68a5>   DW_AT_byte_size   : 24
    <b68a6>   DW_AT_decl_file   : 6
    <b68a7>   DW_AT_decl_line   : 82
    <b68a8>   DW_AT_decl_column : 16
    <b68a9>   DW_AT_sibling     : <0xb68d5>
 <2><b68ad>: Abbrev Number: 2 (DW_TAG_member)
    <b68ae>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b68b2>   DW_AT_decl_file   : 6
    <b68b3>   DW_AT_decl_line   : 83
    <b68b4>   DW_AT_decl_column : 21
    <b68b5>   DW_AT_type        : <0xb6823>
    <b68b9>   DW_AT_data_member_location: 0
 <2><b68ba>: Abbrev Number: 8 (DW_TAG_member)
    <b68bb>   DW_AT_name        : len
    <b68bf>   DW_AT_decl_file   : 6
    <b68c0>   DW_AT_decl_line   : 84
    <b68c1>   DW_AT_decl_column : 21
    <b68c2>   DW_AT_type        : <0xb6860>
    <b68c6>   DW_AT_data_member_location: 8
 <2><b68c7>: Abbrev Number: 2 (DW_TAG_member)
    <b68c8>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b68cc>   DW_AT_decl_file   : 6
    <b68cd>   DW_AT_decl_line   : 85
    <b68ce>   DW_AT_decl_column : 21
    <b68cf>   DW_AT_type        : <0xb6860>
    <b68d3>   DW_AT_data_member_location: 16
 <2><b68d4>: Abbrev Number: 0
 <1><b68d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b68d6>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <b68da>   DW_AT_decl_file   : 6
    <b68db>   DW_AT_decl_line   : 86
    <b68dc>   DW_AT_decl_column : 3
    <b68dd>   DW_AT_type        : <0xb68a0>
 <1><b68e1>: Abbrev Number: 7 (DW_TAG_base_type)
    <b68e2>   DW_AT_byte_size   : 8
    <b68e3>   DW_AT_encoding    : 4	(float)
    <b68e4>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><b68e8>: Abbrev Number: 7 (DW_TAG_base_type)
    <b68e9>   DW_AT_byte_size   : 4
    <b68ea>   DW_AT_encoding    : 4	(float)
    <b68eb>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><b68ef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b68f0>   DW_AT_byte_size   : 8
    <b68f0>   DW_AT_type        : <0xb683b>
 <1><b68f4>: Abbrev Number: 34 (DW_TAG_enumeration_type)
    <b68f5>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <b68f9>   DW_AT_encoding    : 7	(unsigned)
    <b68fa>   DW_AT_byte_size   : 4
    <b68fb>   DW_AT_type        : <0xb67df>
    <b68ff>   DW_AT_decl_file   : 7
    <b6900>   DW_AT_decl_line   : 25
    <b6901>   DW_AT_decl_column : 14
    <b6902>   DW_AT_sibling     : <0xb691f>
 <2><b6906>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b6907>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <b690b>   DW_AT_const_value : 0
 <2><b690c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b690d>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <b6911>   DW_AT_const_value : 1
 <2><b6912>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b6913>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <b6917>   DW_AT_const_value : 2
 <2><b6918>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b6919>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <b691d>   DW_AT_const_value : 3
 <2><b691e>: Abbrev Number: 0
 <1><b691f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6920>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <b6924>   DW_AT_decl_file   : 7
    <b6925>   DW_AT_decl_line   : 30
    <b6926>   DW_AT_decl_column : 3
    <b6927>   DW_AT_type        : <0xb68f4>
 <1><b692b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b692c>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <b6930>   DW_AT_decl_file   : 7
    <b6931>   DW_AT_decl_line   : 54
    <b6932>   DW_AT_decl_column : 15
    <b6933>   DW_AT_type        : <0xb6937>
 <1><b6937>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6938>   DW_AT_byte_size   : 8
    <b6938>   DW_AT_type        : <0xb693c>
 <1><b693c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b693d>   DW_AT_prototyped  : 1
    <b693d>   DW_AT_type        : <0xb67fb>
    <b6941>   DW_AT_sibling     : <0xb6950>
 <2><b6945>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6946>   DW_AT_type        : <0xb6950>
 <2><b694a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b694b>   DW_AT_type        : <0xb67fb>
 <2><b694f>: Abbrev Number: 0
 <1><b6950>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6951>   DW_AT_byte_size   : 8
    <b6951>   DW_AT_type        : <0xb6955>
 <1><b6955>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b6956>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <b695a>   DW_AT_byte_size   : 80
    <b695b>   DW_AT_decl_file   : 7
    <b695c>   DW_AT_decl_line   : 97
    <b695d>   DW_AT_decl_column : 16
    <b695e>   DW_AT_sibling     : <0xb6a19>
 <2><b6962>: Abbrev Number: 2 (DW_TAG_member)
    <b6963>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b6967>   DW_AT_decl_file   : 7
    <b6968>   DW_AT_decl_line   : 98
    <b6969>   DW_AT_decl_column : 21
    <b696a>   DW_AT_type        : <0xb67fb>
    <b696e>   DW_AT_data_member_location: 0
 <2><b696f>: Abbrev Number: 8 (DW_TAG_member)
    <b6970>   DW_AT_name        : len
    <b6974>   DW_AT_decl_file   : 7
    <b6975>   DW_AT_decl_line   : 99
    <b6976>   DW_AT_decl_column : 21
    <b6977>   DW_AT_type        : <0xb67fb>
    <b697b>   DW_AT_data_member_location: 4
 <2><b697c>: Abbrev Number: 2 (DW_TAG_member)
    <b697d>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <b6981>   DW_AT_decl_file   : 7
    <b6982>   DW_AT_decl_line   : 100
    <b6983>   DW_AT_decl_column : 21
    <b6984>   DW_AT_type        : <0xb691f>
    <b6988>   DW_AT_data_member_location: 8
 <2><b6989>: Abbrev Number: 2 (DW_TAG_member)
    <b698a>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b698e>   DW_AT_decl_file   : 7
    <b698f>   DW_AT_decl_line   : 101
    <b6990>   DW_AT_decl_column : 21
    <b6991>   DW_AT_type        : <0xb688e>
    <b6995>   DW_AT_data_member_location: 16
 <2><b6996>: Abbrev Number: 2 (DW_TAG_member)
    <b6997>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b699b>   DW_AT_decl_file   : 7
    <b699c>   DW_AT_decl_line   : 102
    <b699d>   DW_AT_decl_column : 21
    <b699e>   DW_AT_type        : <0xb67fb>
    <b69a2>   DW_AT_data_member_location: 24
 <2><b69a3>: Abbrev Number: 2 (DW_TAG_member)
    <b69a4>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <b69a8>   DW_AT_decl_file   : 7
    <b69a9>   DW_AT_decl_line   : 103
    <b69aa>   DW_AT_decl_column : 21
    <b69ab>   DW_AT_type        : <0xb67fb>
    <b69af>   DW_AT_data_member_location: 28
 <2><b69b0>: Abbrev Number: 2 (DW_TAG_member)
    <b69b1>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <b69b5>   DW_AT_decl_file   : 7
    <b69b6>   DW_AT_decl_line   : 104
    <b69b7>   DW_AT_decl_column : 21
    <b69b8>   DW_AT_type        : <0xb67fb>
    <b69bc>   DW_AT_data_member_location: 32
 <2><b69bd>: Abbrev Number: 2 (DW_TAG_member)
    <b69be>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <b69c2>   DW_AT_decl_file   : 7
    <b69c3>   DW_AT_decl_line   : 105
    <b69c4>   DW_AT_decl_column : 21
    <b69c5>   DW_AT_type        : <0xb67df>
    <b69c9>   DW_AT_data_member_location: 36
 <2><b69ca>: Abbrev Number: 2 (DW_TAG_member)
    <b69cb>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <b69cf>   DW_AT_decl_file   : 7
    <b69d0>   DW_AT_decl_line   : 106
    <b69d1>   DW_AT_decl_column : 21
    <b69d2>   DW_AT_type        : <0xb67df>
    <b69d6>   DW_AT_data_member_location: 40
 <2><b69d7>: Abbrev Number: 2 (DW_TAG_member)
    <b69d8>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <b69dc>   DW_AT_decl_file   : 7
    <b69dd>   DW_AT_decl_line   : 109
    <b69de>   DW_AT_decl_column : 21
    <b69df>   DW_AT_type        : <0xb6873>
    <b69e3>   DW_AT_data_member_location: 44
 <2><b69e4>: Abbrev Number: 2 (DW_TAG_member)
    <b69e5>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <b69e9>   DW_AT_decl_file   : 7
    <b69ea>   DW_AT_decl_line   : 110
    <b69eb>   DW_AT_decl_column : 21
    <b69ec>   DW_AT_type        : <0xb682f>
    <b69f0>   DW_AT_data_member_location: 48
 <2><b69f1>: Abbrev Number: 2 (DW_TAG_member)
    <b69f2>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b69f6>   DW_AT_decl_file   : 7
    <b69f7>   DW_AT_decl_line   : 112
    <b69f8>   DW_AT_decl_column : 22
    <b69f9>   DW_AT_type        : <0xb6cb1>
    <b69fd>   DW_AT_data_member_location: 56
 <2><b69fe>: Abbrev Number: 2 (DW_TAG_member)
    <b69ff>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <b6a03>   DW_AT_decl_file   : 7
    <b6a04>   DW_AT_decl_line   : 114
    <b6a05>   DW_AT_decl_column : 14
    <b6a06>   DW_AT_type        : <0xb6815>
    <b6a0a>   DW_AT_data_member_location: 64
 <2><b6a0b>: Abbrev Number: 2 (DW_TAG_member)
    <b6a0c>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <b6a10>   DW_AT_decl_file   : 7
    <b6a11>   DW_AT_decl_line   : 116
    <b6a12>   DW_AT_decl_column : 22
    <b6a13>   DW_AT_type        : <0xb6950>
    <b6a17>   DW_AT_data_member_location: 72
 <2><b6a18>: Abbrev Number: 0
 <1><b6a19>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6a1a>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <b6a1e>   DW_AT_decl_file   : 7
    <b6a1f>   DW_AT_decl_line   : 59
    <b6a20>   DW_AT_decl_column : 15
    <b6a21>   DW_AT_type        : <0xb6a25>
 <1><b6a25>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6a26>   DW_AT_byte_size   : 8
    <b6a26>   DW_AT_type        : <0xb6a2a>
 <1><b6a2a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6a2b>   DW_AT_prototyped  : 1
    <b6a2b>   DW_AT_type        : <0xb67fb>
    <b6a2f>   DW_AT_sibling     : <0xb6a39>
 <2><b6a33>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a34>   DW_AT_type        : <0xb6950>
 <2><b6a38>: Abbrev Number: 0
 <1><b6a39>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6a3a>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <b6a3e>   DW_AT_decl_file   : 7
    <b6a3f>   DW_AT_decl_line   : 60
    <b6a40>   DW_AT_decl_column : 15
    <b6a41>   DW_AT_type        : <0xb6a25>
 <1><b6a45>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6a46>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <b6a4a>   DW_AT_decl_file   : 7
    <b6a4b>   DW_AT_decl_line   : 61
    <b6a4c>   DW_AT_decl_column : 15
    <b6a4d>   DW_AT_type        : <0xb6a51>
 <1><b6a51>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6a52>   DW_AT_byte_size   : 8
    <b6a52>   DW_AT_type        : <0xb6a56>
 <1><b6a56>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6a57>   DW_AT_prototyped  : 1
    <b6a57>   DW_AT_type        : <0xb67fb>
    <b6a5b>   DW_AT_sibling     : <0xb6a6f>
 <2><b6a5f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a60>   DW_AT_type        : <0xb6950>
 <2><b6a64>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a65>   DW_AT_type        : <0xb688e>
 <2><b6a69>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a6a>   DW_AT_type        : <0xb67fb>
 <2><b6a6e>: Abbrev Number: 0
 <1><b6a6f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6a70>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <b6a74>   DW_AT_decl_file   : 7
    <b6a75>   DW_AT_decl_line   : 62
    <b6a76>   DW_AT_decl_column : 15
    <b6a77>   DW_AT_type        : <0xb6a7b>
 <1><b6a7b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6a7c>   DW_AT_byte_size   : 8
    <b6a7c>   DW_AT_type        : <0xb6a80>
 <1><b6a80>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6a81>   DW_AT_prototyped  : 1
    <b6a81>   DW_AT_type        : <0xb67fb>
    <b6a85>   DW_AT_sibling     : <0xb6a94>
 <2><b6a89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a8a>   DW_AT_type        : <0xb6950>
 <2><b6a8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6a8f>   DW_AT_type        : <0xb6a94>
 <2><b6a93>: Abbrev Number: 0
 <1><b6a94>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6a95>   DW_AT_byte_size   : 8
    <b6a95>   DW_AT_type        : <0xb688e>
 <1><b6a99>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6a9a>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <b6a9e>   DW_AT_decl_file   : 7
    <b6a9f>   DW_AT_decl_line   : 63
    <b6aa0>   DW_AT_decl_column : 15
    <b6aa1>   DW_AT_type        : <0xb6aa5>
 <1><b6aa5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6aa6>   DW_AT_byte_size   : 8
    <b6aa6>   DW_AT_type        : <0xb6aaa>
 <1><b6aaa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6aab>   DW_AT_prototyped  : 1
    <b6aab>   DW_AT_type        : <0xb67fb>
    <b6aaf>   DW_AT_sibling     : <0xb6ac3>
 <2><b6ab3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ab4>   DW_AT_type        : <0xb6950>
 <2><b6ab8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ab9>   DW_AT_type        : <0xb6815>
 <2><b6abd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6abe>   DW_AT_type        : <0xb6ac3>
 <2><b6ac2>: Abbrev Number: 0
 <1><b6ac3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6ac4>   DW_AT_byte_size   : 8
    <b6ac4>   DW_AT_type        : <0xb682f>
 <1><b6ac8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6ac9>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <b6acd>   DW_AT_decl_file   : 7
    <b6ace>   DW_AT_decl_line   : 65
    <b6acf>   DW_AT_decl_column : 15
    <b6ad0>   DW_AT_type        : <0xb6ad4>
 <1><b6ad4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6ad5>   DW_AT_byte_size   : 8
    <b6ad5>   DW_AT_type        : <0xb6ad9>
 <1><b6ad9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6ada>   DW_AT_prototyped  : 1
    <b6ada>   DW_AT_type        : <0xb67fb>
    <b6ade>   DW_AT_sibling     : <0xb6af2>
 <2><b6ae2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ae3>   DW_AT_type        : <0xb6950>
 <2><b6ae7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ae8>   DW_AT_type        : <0xb68ef>
 <2><b6aec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6aed>   DW_AT_type        : <0xb6ac3>
 <2><b6af1>: Abbrev Number: 0
 <1><b6af2>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6af3>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <b6af7>   DW_AT_decl_file   : 7
    <b6af8>   DW_AT_decl_line   : 67
    <b6af9>   DW_AT_decl_column : 15
    <b6afa>   DW_AT_type        : <0xb6afe>
 <1><b6afe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6aff>   DW_AT_byte_size   : 8
    <b6aff>   DW_AT_type        : <0xb6b03>
 <1><b6b03>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6b04>   DW_AT_prototyped  : 1
    <b6b04>   DW_AT_type        : <0xb67fb>
    <b6b08>   DW_AT_sibling     : <0xb6b1c>
 <2><b6b0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b0d>   DW_AT_type        : <0xb6950>
 <2><b6b11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b12>   DW_AT_type        : <0xb6883>
 <2><b6b16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b17>   DW_AT_type        : <0xb682f>
 <2><b6b1b>: Abbrev Number: 0
 <1><b6b1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6b1d>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <b6b21>   DW_AT_decl_file   : 7
    <b6b22>   DW_AT_decl_line   : 69
    <b6b23>   DW_AT_decl_column : 15
    <b6b24>   DW_AT_type        : <0xb6b28>
 <1><b6b28>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6b29>   DW_AT_byte_size   : 8
    <b6b29>   DW_AT_type        : <0xb6b2d>
 <1><b6b2d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6b2e>   DW_AT_prototyped  : 1
    <b6b2e>   DW_AT_type        : <0xb67fb>
    <b6b32>   DW_AT_sibling     : <0xb6b46>
 <2><b6b36>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b37>   DW_AT_type        : <0xb6950>
 <2><b6b3b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b3c>   DW_AT_type        : <0xb6b46>
 <2><b6b40>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b41>   DW_AT_type        : <0xb682f>
 <2><b6b45>: Abbrev Number: 0
 <1><b6b46>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6b47>   DW_AT_byte_size   : 8
    <b6b47>   DW_AT_type        : <0xb6848>
 <1><b6b4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6b4c>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <b6b50>   DW_AT_decl_file   : 7
    <b6b51>   DW_AT_decl_line   : 71
    <b6b52>   DW_AT_decl_column : 15
    <b6b53>   DW_AT_type        : <0xb6b57>
 <1><b6b57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6b58>   DW_AT_byte_size   : 8
    <b6b58>   DW_AT_type        : <0xb6b5c>
 <1><b6b5c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6b5d>   DW_AT_prototyped  : 1
    <b6b5d>   DW_AT_type        : <0xb67fb>
    <b6b61>   DW_AT_sibling     : <0xb6b75>
 <2><b6b65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b66>   DW_AT_type        : <0xb6950>
 <2><b6b6a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b6b>   DW_AT_type        : <0xb688e>
 <2><b6b6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b70>   DW_AT_type        : <0xb688e>
 <2><b6b74>: Abbrev Number: 0
 <1><b6b75>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6b76>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <b6b7a>   DW_AT_decl_file   : 7
    <b6b7b>   DW_AT_decl_line   : 73
    <b6b7c>   DW_AT_decl_column : 15
    <b6b7d>   DW_AT_type        : <0xb6b57>
 <1><b6b81>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6b82>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <b6b86>   DW_AT_decl_file   : 7
    <b6b87>   DW_AT_decl_line   : 75
    <b6b88>   DW_AT_decl_column : 15
    <b6b89>   DW_AT_type        : <0xb6b8d>
 <1><b6b8d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6b8e>   DW_AT_byte_size   : 8
    <b6b8e>   DW_AT_type        : <0xb6b92>
 <1><b6b92>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6b93>   DW_AT_prototyped  : 1
    <b6b93>   DW_AT_type        : <0xb67fb>
    <b6b97>   DW_AT_sibling     : <0xb6ba6>
 <2><b6b9b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6b9c>   DW_AT_type        : <0xb6950>
 <2><b6ba0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ba1>   DW_AT_type        : <0xb6ba6>
 <2><b6ba5>: Abbrev Number: 0
 <1><b6ba6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6ba7>   DW_AT_byte_size   : 8
    <b6ba7>   DW_AT_type        : <0xb68d5>
 <1><b6bab>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6bac>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <b6bb0>   DW_AT_decl_file   : 7
    <b6bb1>   DW_AT_decl_line   : 76
    <b6bb2>   DW_AT_decl_column : 15
    <b6bb3>   DW_AT_type        : <0xb6bb7>
 <1><b6bb7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6bb8>   DW_AT_byte_size   : 8
    <b6bb8>   DW_AT_type        : <0xb6bbc>
 <1><b6bbc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6bbd>   DW_AT_prototyped  : 1
    <b6bbd>   DW_AT_type        : <0xb67fb>
    <b6bc1>   DW_AT_sibling     : <0xb6bd5>
 <2><b6bc5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6bc6>   DW_AT_type        : <0xb6950>
 <2><b6bca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6bcb>   DW_AT_type        : <0xb68ef>
 <2><b6bcf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6bd0>   DW_AT_type        : <0xb6860>
 <2><b6bd4>: Abbrev Number: 0
 <1><b6bd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6bd6>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <b6bda>   DW_AT_decl_file   : 7
    <b6bdb>   DW_AT_decl_line   : 77
    <b6bdc>   DW_AT_decl_column : 15
    <b6bdd>   DW_AT_type        : <0xb6a25>
 <1><b6be1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b6be2>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <b6be6>   DW_AT_byte_size   : 112
    <b6be7>   DW_AT_decl_file   : 7
    <b6be8>   DW_AT_decl_line   : 80
    <b6be9>   DW_AT_decl_column : 16
    <b6bea>   DW_AT_sibling     : <0xb6ca5>
 <2><b6bee>: Abbrev Number: 2 (DW_TAG_member)
    <b6bef>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <b6bf3>   DW_AT_decl_file   : 7
    <b6bf4>   DW_AT_decl_line   : 81
    <b6bf5>   DW_AT_decl_column : 25
    <b6bf6>   DW_AT_type        : <0xb6a19>
    <b6bfa>   DW_AT_data_member_location: 0
 <2><b6bfb>: Abbrev Number: 2 (DW_TAG_member)
    <b6bfc>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <b6c00>   DW_AT_decl_file   : 7
    <b6c01>   DW_AT_decl_line   : 82
    <b6c02>   DW_AT_decl_column : 25
    <b6c03>   DW_AT_type        : <0xb6a39>
    <b6c07>   DW_AT_data_member_location: 8
 <2><b6c08>: Abbrev Number: 2 (DW_TAG_member)
    <b6c09>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <b6c0d>   DW_AT_decl_file   : 7
    <b6c0e>   DW_AT_decl_line   : 83
    <b6c0f>   DW_AT_decl_column : 25
    <b6c10>   DW_AT_type        : <0xb6a45>
    <b6c14>   DW_AT_data_member_location: 16
 <2><b6c15>: Abbrev Number: 2 (DW_TAG_member)
    <b6c16>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <b6c1a>   DW_AT_decl_file   : 7
    <b6c1b>   DW_AT_decl_line   : 84
    <b6c1c>   DW_AT_decl_column : 25
    <b6c1d>   DW_AT_type        : <0xb6a6f>
    <b6c21>   DW_AT_data_member_location: 24
 <2><b6c22>: Abbrev Number: 2 (DW_TAG_member)
    <b6c23>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <b6c27>   DW_AT_decl_file   : 7
    <b6c28>   DW_AT_decl_line   : 85
    <b6c29>   DW_AT_decl_column : 25
    <b6c2a>   DW_AT_type        : <0xb6a99>
    <b6c2e>   DW_AT_data_member_location: 32
 <2><b6c2f>: Abbrev Number: 2 (DW_TAG_member)
    <b6c30>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <b6c34>   DW_AT_decl_file   : 7
    <b6c35>   DW_AT_decl_line   : 86
    <b6c36>   DW_AT_decl_column : 25
    <b6c37>   DW_AT_type        : <0xb6ac8>
    <b6c3b>   DW_AT_data_member_location: 40
 <2><b6c3c>: Abbrev Number: 2 (DW_TAG_member)
    <b6c3d>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <b6c41>   DW_AT_decl_file   : 7
    <b6c42>   DW_AT_decl_line   : 87
    <b6c43>   DW_AT_decl_column : 25
    <b6c44>   DW_AT_type        : <0xb6af2>
    <b6c48>   DW_AT_data_member_location: 48
 <2><b6c49>: Abbrev Number: 2 (DW_TAG_member)
    <b6c4a>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <b6c4e>   DW_AT_decl_file   : 7
    <b6c4f>   DW_AT_decl_line   : 88
    <b6c50>   DW_AT_decl_column : 25
    <b6c51>   DW_AT_type        : <0xb6b1c>
    <b6c55>   DW_AT_data_member_location: 56
 <2><b6c56>: Abbrev Number: 2 (DW_TAG_member)
    <b6c57>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <b6c5b>   DW_AT_decl_file   : 7
    <b6c5c>   DW_AT_decl_line   : 89
    <b6c5d>   DW_AT_decl_column : 25
    <b6c5e>   DW_AT_type        : <0xb6b4b>
    <b6c62>   DW_AT_data_member_location: 64
 <2><b6c63>: Abbrev Number: 2 (DW_TAG_member)
    <b6c64>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <b6c68>   DW_AT_decl_file   : 7
    <b6c69>   DW_AT_decl_line   : 90
    <b6c6a>   DW_AT_decl_column : 25
    <b6c6b>   DW_AT_type        : <0xb6b75>
    <b6c6f>   DW_AT_data_member_location: 72
 <2><b6c70>: Abbrev Number: 2 (DW_TAG_member)
    <b6c71>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <b6c75>   DW_AT_decl_file   : 7
    <b6c76>   DW_AT_decl_line   : 91
    <b6c77>   DW_AT_decl_column : 25
    <b6c78>   DW_AT_type        : <0xb6b81>
    <b6c7c>   DW_AT_data_member_location: 80
 <2><b6c7d>: Abbrev Number: 2 (DW_TAG_member)
    <b6c7e>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <b6c82>   DW_AT_decl_file   : 7
    <b6c83>   DW_AT_decl_line   : 92
    <b6c84>   DW_AT_decl_column : 25
    <b6c85>   DW_AT_type        : <0xb6bab>
    <b6c89>   DW_AT_data_member_location: 88
 <2><b6c8a>: Abbrev Number: 2 (DW_TAG_member)
    <b6c8b>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <b6c8f>   DW_AT_decl_file   : 7
    <b6c90>   DW_AT_decl_line   : 93
    <b6c91>   DW_AT_decl_column : 25
    <b6c92>   DW_AT_type        : <0xb692b>
    <b6c96>   DW_AT_data_member_location: 96
 <2><b6c97>: Abbrev Number: 2 (DW_TAG_member)
    <b6c98>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <b6c9c>   DW_AT_decl_file   : 7
    <b6c9d>   DW_AT_decl_line   : 94
    <b6c9e>   DW_AT_decl_column : 25
    <b6c9f>   DW_AT_type        : <0xb6bd5>
    <b6ca3>   DW_AT_data_member_location: 104
 <2><b6ca4>: Abbrev Number: 0
 <1><b6ca5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6ca6>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <b6caa>   DW_AT_decl_file   : 7
    <b6cab>   DW_AT_decl_line   : 95
    <b6cac>   DW_AT_decl_column : 3
    <b6cad>   DW_AT_type        : <0xb6be1>
 <1><b6cb1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6cb2>   DW_AT_byte_size   : 8
    <b6cb2>   DW_AT_type        : <0xb6ca5>
 <1><b6cb6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6cb7>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <b6cbb>   DW_AT_decl_file   : 7
    <b6cbc>   DW_AT_decl_line   : 117
    <b6cbd>   DW_AT_decl_column : 3
    <b6cbe>   DW_AT_type        : <0xb6955>
 <1><b6cc2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6cc3>   DW_AT_byte_size   : 8
    <b6cc3>   DW_AT_type        : <0xb6cb6>
 <1><b6cc7>: Abbrev Number: 18 (DW_TAG_structure_type)
    <b6cc8>   DW_AT_byte_size   : 8
    <b6cc9>   DW_AT_decl_file   : 8
    <b6cc9>   DW_AT_decl_line   : 4
    <b6cca>   DW_AT_decl_column : 3
    <b6cca>   DW_AT_sibling     : <0xb6ce9>
 <2><b6cce>: Abbrev Number: 2 (DW_TAG_member)
    <b6ccf>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <b6cd3>   DW_AT_decl_file   : 8
    <b6cd4>   DW_AT_decl_line   : 5
    <b6cd5>   DW_AT_decl_column : 8
    <b6cd6>   DW_AT_type        : <0xb67fb>
    <b6cda>   DW_AT_data_member_location: 0
 <2><b6cdb>: Abbrev Number: 2 (DW_TAG_member)
    <b6cdc>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <b6ce0>   DW_AT_decl_file   : 8
    <b6ce1>   DW_AT_decl_line   : 6
    <b6ce2>   DW_AT_decl_column : 8
    <b6ce3>   DW_AT_type        : <0xb67fb>
    <b6ce7>   DW_AT_data_member_location: 4
 <2><b6ce8>: Abbrev Number: 0
 <1><b6ce9>: Abbrev Number: 18 (DW_TAG_structure_type)
    <b6cea>   DW_AT_byte_size   : 16
    <b6ceb>   DW_AT_decl_file   : 8
    <b6ceb>   DW_AT_decl_line   : 8
    <b6cec>   DW_AT_decl_column : 3
    <b6cec>   DW_AT_sibling     : <0xb6d1f>
 <2><b6cf0>: Abbrev Number: 8 (DW_TAG_member)
    <b6cf1>   DW_AT_name        : x
    <b6cf3>   DW_AT_decl_file   : 8
    <b6cf4>   DW_AT_decl_line   : 9
    <b6cf5>   DW_AT_decl_column : 8
    <b6cf6>   DW_AT_type        : <0xb67fb>
    <b6cfa>   DW_AT_data_member_location: 0
 <2><b6cfb>: Abbrev Number: 8 (DW_TAG_member)
    <b6cfc>   DW_AT_name        : y
    <b6cfe>   DW_AT_decl_file   : 8
    <b6cff>   DW_AT_decl_line   : 9
    <b6d00>   DW_AT_decl_column : 11
    <b6d01>   DW_AT_type        : <0xb67fb>
    <b6d05>   DW_AT_data_member_location: 4
 <2><b6d06>: Abbrev Number: 8 (DW_TAG_member)
    <b6d07>   DW_AT_name        : dx
    <b6d0a>   DW_AT_decl_file   : 8
    <b6d0b>   DW_AT_decl_line   : 10
    <b6d0c>   DW_AT_decl_column : 8
    <b6d0d>   DW_AT_type        : <0xb67fb>
    <b6d11>   DW_AT_data_member_location: 8
 <2><b6d12>: Abbrev Number: 8 (DW_TAG_member)
    <b6d13>   DW_AT_name        : dy
    <b6d16>   DW_AT_decl_file   : 8
    <b6d17>   DW_AT_decl_line   : 10
    <b6d18>   DW_AT_decl_column : 12
    <b6d19>   DW_AT_type        : <0xb67fb>
    <b6d1d>   DW_AT_data_member_location: 12
 <2><b6d1e>: Abbrev Number: 0
 <1><b6d1f>: Abbrev Number: 35 (DW_TAG_union_type)
    <b6d20>   DW_AT_byte_size   : 16
    <b6d21>   DW_AT_decl_file   : 8
    <b6d22>   DW_AT_decl_line   : 3
    <b6d23>   DW_AT_decl_column : 2
    <b6d24>   DW_AT_sibling     : <0xb6d4f>
 <2><b6d28>: Abbrev Number: 19 (DW_TAG_member)
    <b6d29>   DW_AT_type        : <0xb6cc7>
 <2><b6d2d>: Abbrev Number: 19 (DW_TAG_member)
    <b6d2e>   DW_AT_type        : <0xb6ce9>
 <2><b6d32>: Abbrev Number: 36 (DW_TAG_member)
    <b6d33>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <b6d37>   DW_AT_decl_file   : 8
    <b6d38>   DW_AT_decl_line   : 12
    <b6d39>   DW_AT_decl_column : 7
    <b6d3a>   DW_AT_type        : <0xb67fb>
 <2><b6d3e>: Abbrev Number: 20 (DW_TAG_member)
    <b6d3f>   DW_AT_name        : z
    <b6d41>   DW_AT_decl_file   : 8
    <b6d41>   DW_AT_decl_line   : 13
    <b6d42>   DW_AT_decl_column : 7
    <b6d42>   DW_AT_type        : <0xb67fb>
 <2><b6d46>: Abbrev Number: 20 (DW_TAG_member)
    <b6d47>   DW_AT_name        : w
    <b6d49>   DW_AT_decl_file   : 8
    <b6d49>   DW_AT_decl_line   : 14
    <b6d4a>   DW_AT_decl_column : 7
    <b6d4a>   DW_AT_type        : <0xb67fb>
 <2><b6d4e>: Abbrev Number: 0
 <1><b6d4f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b6d50>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <b6d54>   DW_AT_byte_size   : 20
    <b6d55>   DW_AT_decl_file   : 8
    <b6d56>   DW_AT_decl_line   : 1
    <b6d57>   DW_AT_decl_column : 8
    <b6d58>   DW_AT_sibling     : <0xb6d70>
 <2><b6d5c>: Abbrev Number: 2 (DW_TAG_member)
    <b6d5d>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b6d61>   DW_AT_decl_file   : 8
    <b6d62>   DW_AT_decl_line   : 2
    <b6d63>   DW_AT_decl_column : 6
    <b6d64>   DW_AT_type        : <0xb67fb>
    <b6d68>   DW_AT_data_member_location: 0
 <2><b6d69>: Abbrev Number: 37 (DW_TAG_member)
    <b6d6a>   DW_AT_type        : <0xb6d1f>
    <b6d6e>   DW_AT_data_member_location: 4
 <2><b6d6f>: Abbrev Number: 0
 <1><b6d70>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6d71>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <b6d75>   DW_AT_decl_file   : 8
    <b6d76>   DW_AT_decl_line   : 18
    <b6d77>   DW_AT_decl_column : 23
    <b6d78>   DW_AT_type        : <0xb6d4f>
 <1><b6d7c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6d7d>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <b6d81>   DW_AT_decl_file   : 9
    <b6d82>   DW_AT_decl_line   : 1
    <b6d83>   DW_AT_decl_column : 23
    <b6d84>   DW_AT_type        : <0xb6d88>
 <1><b6d88>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6d89>   DW_AT_byte_size   : 8
    <b6d89>   DW_AT_type        : <0xb6d8d>
 <1><b6d8d>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <b6d8e>   DW_AT_prototyped  : 1
    <b6d8e>   DW_AT_type        : <0xb6ba6>
 <1><b6d92>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6d93>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <b6d97>   DW_AT_decl_file   : 9
    <b6d98>   DW_AT_decl_line   : 2
    <b6d99>   DW_AT_decl_column : 23
    <b6d9a>   DW_AT_type        : <0xb6d9e>
 <1><b6d9e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6d9f>   DW_AT_byte_size   : 8
    <b6d9f>   DW_AT_type        : <0xb6da3>
 <1><b6da3>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <b6da4>   DW_AT_prototyped  : 1
    <b6da4>   DW_AT_type        : <0xb67fb>
 <1><b6da8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6da9>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <b6dad>   DW_AT_decl_file   : 9
    <b6dae>   DW_AT_decl_line   : 3
    <b6daf>   DW_AT_decl_column : 23
    <b6db0>   DW_AT_type        : <0xb6d9e>
 <1><b6db4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6db5>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <b6db9>   DW_AT_decl_file   : 9
    <b6dba>   DW_AT_decl_line   : 10
    <b6dbb>   DW_AT_decl_column : 23
    <b6dbc>   DW_AT_type        : <0xb6dc0>
 <1><b6dc0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6dc1>   DW_AT_byte_size   : 8
    <b6dc1>   DW_AT_type        : <0xb6dc5>
 <1><b6dc5>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b6dc6>   DW_AT_prototyped  : 1
    <b6dc6>   DW_AT_sibling     : <0xb6dd0>
 <2><b6dca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6dcb>   DW_AT_type        : <0xb67fb>
 <2><b6dcf>: Abbrev Number: 0
 <1><b6dd0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6dd1>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <b6dd5>   DW_AT_decl_file   : 9
    <b6dd6>   DW_AT_decl_line   : 14
    <b6dd7>   DW_AT_decl_column : 23
    <b6dd8>   DW_AT_type        : <0xb6ddc>
 <1><b6ddc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6ddd>   DW_AT_byte_size   : 8
    <b6ddd>   DW_AT_type        : <0xb6de1>
 <1><b6de1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6de2>   DW_AT_prototyped  : 1
    <b6de2>   DW_AT_type        : <0xb67fb>
    <b6de6>   DW_AT_sibling     : <0xb6dfa>
 <2><b6dea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6deb>   DW_AT_type        : <0xb67fb>
 <2><b6def>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6df0>   DW_AT_type        : <0xb67fb>
 <2><b6df4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6df5>   DW_AT_type        : <0xb67fb>
 <2><b6df9>: Abbrev Number: 0
 <1><b6dfa>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6dfb>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <b6dff>   DW_AT_decl_file   : 9
    <b6e00>   DW_AT_decl_line   : 18
    <b6e01>   DW_AT_decl_column : 23
    <b6e02>   DW_AT_type        : <0xb6ddc>
 <1><b6e06>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e07>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <b6e0b>   DW_AT_decl_file   : 9
    <b6e0c>   DW_AT_decl_line   : 24
    <b6e0d>   DW_AT_decl_column : 23
    <b6e0e>   DW_AT_type        : <0xb689a>
 <1><b6e12>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e13>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <b6e17>   DW_AT_decl_file   : 9
    <b6e18>   DW_AT_decl_line   : 28
    <b6e19>   DW_AT_decl_column : 23
    <b6e1a>   DW_AT_type        : <0xb6e1e>
 <1><b6e1e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6e1f>   DW_AT_byte_size   : 8
    <b6e1f>   DW_AT_type        : <0xb6e23>
 <1><b6e23>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6e24>   DW_AT_prototyped  : 1
    <b6e24>   DW_AT_type        : <0xb67fb>
    <b6e28>   DW_AT_sibling     : <0xb6e37>
 <2><b6e2c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6e2d>   DW_AT_type        : <0xb67fb>
 <2><b6e31>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6e32>   DW_AT_type        : <0xb67fb>
 <2><b6e36>: Abbrev Number: 0
 <1><b6e37>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e38>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <b6e3c>   DW_AT_decl_file   : 9
    <b6e3d>   DW_AT_decl_line   : 34
    <b6e3e>   DW_AT_decl_column : 23
    <b6e3f>   DW_AT_type        : <0xb6d9e>
 <1><b6e43>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e44>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <b6e48>   DW_AT_decl_file   : 9
    <b6e49>   DW_AT_decl_line   : 35
    <b6e4a>   DW_AT_decl_column : 23
    <b6e4b>   DW_AT_type        : <0xb6d9e>
 <1><b6e4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e50>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <b6e54>   DW_AT_decl_file   : 9
    <b6e55>   DW_AT_decl_line   : 36
    <b6e56>   DW_AT_decl_column : 23
    <b6e57>   DW_AT_type        : <0xb6e5b>
 <1><b6e5b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6e5c>   DW_AT_byte_size   : 8
    <b6e5c>   DW_AT_type        : <0xb6e60>
 <1><b6e60>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b6e61>   DW_AT_prototyped  : 1
    <b6e61>   DW_AT_sibling     : <0xb6e70>
 <2><b6e65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6e66>   DW_AT_type        : <0xb6e70>
 <2><b6e6a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6e6b>   DW_AT_type        : <0xb6e70>
 <2><b6e6f>: Abbrev Number: 0
 <1><b6e70>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6e71>   DW_AT_byte_size   : 8
    <b6e71>   DW_AT_type        : <0xb67fb>
 <1><b6e75>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e76>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <b6e7a>   DW_AT_decl_file   : 9
    <b6e7b>   DW_AT_decl_line   : 37
    <b6e7c>   DW_AT_decl_column : 23
    <b6e7d>   DW_AT_type        : <0xb6e5b>
 <1><b6e81>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e82>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <b6e86>   DW_AT_decl_file   : 9
    <b6e87>   DW_AT_decl_line   : 45
    <b6e88>   DW_AT_decl_column : 24
    <b6e89>   DW_AT_type        : <0xb6e8d>
 <1><b6e8d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6e8e>   DW_AT_byte_size   : 8
    <b6e8e>   DW_AT_type        : <0xb6e92>
 <1><b6e92>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6e93>   DW_AT_prototyped  : 1
    <b6e93>   DW_AT_type        : <0xb67df>
    <b6e97>   DW_AT_sibling     : <0xb6eab>
 <2><b6e9b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6e9c>   DW_AT_type        : <0xb67fb>
 <2><b6ea0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ea1>   DW_AT_type        : <0xb67fb>
 <2><b6ea5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ea6>   DW_AT_type        : <0xb67fb>
 <2><b6eaa>: Abbrev Number: 0
 <1><b6eab>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6eac>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <b6eb0>   DW_AT_decl_file   : 9
    <b6eb1>   DW_AT_decl_line   : 48
    <b6eb2>   DW_AT_decl_column : 23
    <b6eb3>   DW_AT_type        : <0xb6eb7>
 <1><b6eb7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6eb8>   DW_AT_byte_size   : 8
    <b6eb8>   DW_AT_type        : <0xb6ebc>
 <1><b6ebc>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b6ebd>   DW_AT_prototyped  : 1
    <b6ebd>   DW_AT_sibling     : <0xb6ed1>
 <2><b6ec1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ec2>   DW_AT_type        : <0xb6883>
 <2><b6ec6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ec7>   DW_AT_type        : <0xb682f>
 <2><b6ecb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ecc>   DW_AT_type        : <0xb67fb>
 <2><b6ed0>: Abbrev Number: 0
 <1><b6ed1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6ed2>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <b6ed6>   DW_AT_decl_file   : 9
    <b6ed7>   DW_AT_decl_line   : 49
    <b6ed8>   DW_AT_decl_column : 23
    <b6ed9>   DW_AT_type        : <0xb6edd>
 <1><b6edd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6ede>   DW_AT_byte_size   : 8
    <b6ede>   DW_AT_type        : <0xb6ee2>
 <1><b6ee2>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b6ee3>   DW_AT_prototyped  : 1
    <b6ee3>   DW_AT_sibling     : <0xb6ef7>
 <2><b6ee7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ee8>   DW_AT_type        : <0xb6b46>
 <2><b6eec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6eed>   DW_AT_type        : <0xb682f>
 <2><b6ef1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ef2>   DW_AT_type        : <0xb67fb>
 <2><b6ef6>: Abbrev Number: 0
 <1><b6ef7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6ef8>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <b6efc>   DW_AT_decl_file   : 9
    <b6efd>   DW_AT_decl_line   : 51
    <b6efe>   DW_AT_decl_column : 24
    <b6eff>   DW_AT_type        : <0xb6f03>
 <1><b6f03>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6f04>   DW_AT_byte_size   : 8
    <b6f04>   DW_AT_type        : <0xb6f08>
 <1><b6f08>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6f09>   DW_AT_prototyped  : 1
    <b6f09>   DW_AT_type        : <0xb6823>
    <b6f0d>   DW_AT_sibling     : <0xb6f1c>
 <2><b6f11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f12>   DW_AT_type        : <0xb6823>
 <2><b6f16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f17>   DW_AT_type        : <0xb6860>
 <2><b6f1b>: Abbrev Number: 0
 <1><b6f1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f1d>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <b6f21>   DW_AT_decl_file   : 9
    <b6f22>   DW_AT_decl_line   : 54
    <b6f23>   DW_AT_decl_column : 23
    <b6f24>   DW_AT_type        : <0xb6f28>
 <1><b6f28>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6f29>   DW_AT_byte_size   : 8
    <b6f29>   DW_AT_type        : <0xb6f2d>
 <1><b6f2d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6f2e>   DW_AT_prototyped  : 1
    <b6f2e>   DW_AT_type        : <0xb67fb>
    <b6f32>   DW_AT_sibling     : <0xb6f55>
 <2><b6f36>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f37>   DW_AT_type        : <0xb6ba6>
 <2><b6f3b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f3c>   DW_AT_type        : <0xb6815>
 <2><b6f40>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f41>   DW_AT_type        : <0xb6860>
 <2><b6f45>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f46>   DW_AT_type        : <0xb67fb>
 <2><b6f4a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f4b>   DW_AT_type        : <0xb67fb>
 <2><b6f4f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f50>   DW_AT_type        : <0xb67fb>
 <2><b6f54>: Abbrev Number: 0
 <1><b6f55>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f56>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b6f5a>   DW_AT_decl_file   : 9
    <b6f5b>   DW_AT_decl_line   : 56
    <b6f5c>   DW_AT_decl_column : 23
    <b6f5d>   DW_AT_type        : <0xb6f61>
 <1><b6f61>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6f62>   DW_AT_byte_size   : 8
    <b6f62>   DW_AT_type        : <0xb6f66>
 <1><b6f66>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6f67>   DW_AT_prototyped  : 1
    <b6f67>   DW_AT_type        : <0xb67fb>
    <b6f6b>   DW_AT_sibling     : <0xb6f89>
 <2><b6f6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f70>   DW_AT_type        : <0xb6b46>
 <2><b6f74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f75>   DW_AT_type        : <0xb68ef>
 <2><b6f79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f7a>   DW_AT_type        : <0xb6860>
 <2><b6f7e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f7f>   DW_AT_type        : <0xb67fb>
 <2><b6f83>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6f84>   DW_AT_type        : <0xb67fb>
 <2><b6f88>: Abbrev Number: 0
 <1><b6f89>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f8a>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <b6f8e>   DW_AT_decl_file   : 9
    <b6f8f>   DW_AT_decl_line   : 67
    <b6f90>   DW_AT_decl_column : 23
    <b6f91>   DW_AT_type        : <0xb6f95>
 <1><b6f95>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6f96>   DW_AT_byte_size   : 8
    <b6f96>   DW_AT_type        : <0xb6f9a>
 <1><b6f9a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6f9b>   DW_AT_prototyped  : 1
    <b6f9b>   DW_AT_type        : <0xb67fb>
    <b6f9f>   DW_AT_sibling     : <0xb6fa9>
 <2><b6fa3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fa4>   DW_AT_type        : <0xb67fb>
 <2><b6fa8>: Abbrev Number: 0
 <1><b6fa9>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6faa>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <b6fae>   DW_AT_decl_file   : 9
    <b6faf>   DW_AT_decl_line   : 68
    <b6fb0>   DW_AT_decl_column : 23
    <b6fb1>   DW_AT_type        : <0xb6fb5>
 <1><b6fb5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6fb6>   DW_AT_byte_size   : 8
    <b6fb6>   DW_AT_type        : <0xb6fba>
 <1><b6fba>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6fbb>   DW_AT_prototyped  : 1
    <b6fbb>   DW_AT_type        : <0xb67fb>
    <b6fbf>   DW_AT_sibling     : <0xb6fdd>
 <2><b6fc3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fc4>   DW_AT_type        : <0xb6e70>
 <2><b6fc8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fc9>   DW_AT_type        : <0xb6e70>
 <2><b6fcd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fce>   DW_AT_type        : <0xb6e70>
 <2><b6fd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fd3>   DW_AT_type        : <0xb6e70>
 <2><b6fd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6fd8>   DW_AT_type        : <0xb6e70>
 <2><b6fdc>: Abbrev Number: 0
 <1><b6fdd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6fde>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b6fe2>   DW_AT_decl_file   : 9
    <b6fe3>   DW_AT_decl_line   : 69
    <b6fe4>   DW_AT_decl_column : 23
    <b6fe5>   DW_AT_type        : <0xb6fe9>
 <1><b6fe9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b6fea>   DW_AT_byte_size   : 8
    <b6fea>   DW_AT_type        : <0xb6fee>
 <1><b6fee>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b6fef>   DW_AT_prototyped  : 1
    <b6fef>   DW_AT_type        : <0xb67fb>
    <b6ff3>   DW_AT_sibling     : <0xb700c>
 <2><b6ff7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ff8>   DW_AT_type        : <0xb67fb>
 <2><b6ffc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b6ffd>   DW_AT_type        : <0xb67fb>
 <2><b7001>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7002>   DW_AT_type        : <0xb67fb>
 <2><b7006>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7007>   DW_AT_type        : <0xb67fb>
 <2><b700b>: Abbrev Number: 0
 <1><b700c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b700d>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b7011>   DW_AT_decl_file   : 9
    <b7012>   DW_AT_decl_line   : 73
    <b7013>   DW_AT_decl_column : 23
    <b7014>   DW_AT_type        : <0xb7018>
 <1><b7018>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b7019>   DW_AT_byte_size   : 8
    <b7019>   DW_AT_type        : <0xb701d>
 <1><b701d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b701e>   DW_AT_prototyped  : 1
    <b701e>   DW_AT_type        : <0xb67fb>
    <b7022>   DW_AT_sibling     : <0xb702c>
 <2><b7026>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7027>   DW_AT_type        : <0xb67d8>
 <2><b702b>: Abbrev Number: 0
 <1><b702c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b702d>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b7031>   DW_AT_decl_file   : 9
    <b7032>   DW_AT_decl_line   : 74
    <b7033>   DW_AT_decl_column : 23
    <b7034>   DW_AT_type        : <0xb7038>
 <1><b7038>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b7039>   DW_AT_byte_size   : 8
    <b7039>   DW_AT_type        : <0xb703d>
 <1><b703d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b703e>   DW_AT_prototyped  : 1
    <b703e>   DW_AT_type        : <0xb67fb>
    <b7042>   DW_AT_sibling     : <0xb7051>
 <2><b7046>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7047>   DW_AT_type        : <0xb67d8>
 <2><b704b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b704c>   DW_AT_type        : <0xb67d1>
 <2><b7050>: Abbrev Number: 0
 <1><b7051>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7052>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b7056>   DW_AT_decl_file   : 9
    <b7057>   DW_AT_decl_line   : 80
    <b7058>   DW_AT_decl_column : 23
    <b7059>   DW_AT_type        : <0xb6dc0>
 <1><b705d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b705e>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b7062>   DW_AT_decl_file   : 9
    <b7063>   DW_AT_decl_line   : 83
    <b7064>   DW_AT_decl_column : 23
    <b7065>   DW_AT_type        : <0xb6f95>
 <1><b7069>: Abbrev Number: 3 (DW_TAG_typedef)
    <b706a>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b706e>   DW_AT_decl_file   : 9
    <b706f>   DW_AT_decl_line   : 86
    <b7070>   DW_AT_decl_column : 23
    <b7071>   DW_AT_type        : <0xb6e1e>
 <1><b7075>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7076>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b707a>   DW_AT_decl_file   : 9
    <b707b>   DW_AT_decl_line   : 89
    <b707c>   DW_AT_decl_column : 23
    <b707d>   DW_AT_type        : <0xb6e1e>
 <1><b7081>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7082>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b7086>   DW_AT_decl_file   : 9
    <b7087>   DW_AT_decl_line   : 91
    <b7088>   DW_AT_decl_column : 23
    <b7089>   DW_AT_type        : <0xb708d>
 <1><b708d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b708e>   DW_AT_byte_size   : 8
    <b708e>   DW_AT_type        : <0xb7092>
 <1><b7092>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b7093>   DW_AT_prototyped  : 1
    <b7093>   DW_AT_sibling     : <0xb709d>
 <2><b7097>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7098>   DW_AT_type        : <0xb709d>
 <2><b709c>: Abbrev Number: 0
 <1><b709d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b709e>   DW_AT_byte_size   : 8
    <b709e>   DW_AT_type        : <0xb6d70>
 <1><b70a2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b70a3>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b70a7>   DW_AT_byte_size   : 224
    <b70a8>   DW_AT_decl_file   : 9
    <b70a9>   DW_AT_decl_line   : 93
    <b70aa>   DW_AT_decl_column : 16
    <b70ab>   DW_AT_sibling     : <0xb721c>
 <2><b70af>: Abbrev Number: 2 (DW_TAG_member)
    <b70b0>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b70b4>   DW_AT_decl_file   : 9
    <b70b5>   DW_AT_decl_line   : 94
    <b70b6>   DW_AT_decl_column : 23
    <b70b7>   DW_AT_type        : <0xb6d7c>
    <b70bb>   DW_AT_data_member_location: 0
 <2><b70bc>: Abbrev Number: 2 (DW_TAG_member)
    <b70bd>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b70c1>   DW_AT_decl_file   : 9
    <b70c2>   DW_AT_decl_line   : 95
    <b70c3>   DW_AT_decl_column : 23
    <b70c4>   DW_AT_type        : <0xb6d92>
    <b70c8>   DW_AT_data_member_location: 8
 <2><b70c9>: Abbrev Number: 2 (DW_TAG_member)
    <b70ca>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b70ce>   DW_AT_decl_file   : 9
    <b70cf>   DW_AT_decl_line   : 96
    <b70d0>   DW_AT_decl_column : 23
    <b70d1>   DW_AT_type        : <0xb6da8>
    <b70d5>   DW_AT_data_member_location: 16
 <2><b70d6>: Abbrev Number: 2 (DW_TAG_member)
    <b70d7>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b70db>   DW_AT_decl_file   : 9
    <b70dc>   DW_AT_decl_line   : 97
    <b70dd>   DW_AT_decl_column : 23
    <b70de>   DW_AT_type        : <0xb6db4>
    <b70e2>   DW_AT_data_member_location: 24
 <2><b70e3>: Abbrev Number: 2 (DW_TAG_member)
    <b70e4>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b70e8>   DW_AT_decl_file   : 9
    <b70e9>   DW_AT_decl_line   : 98
    <b70ea>   DW_AT_decl_column : 23
    <b70eb>   DW_AT_type        : <0xb6dd0>
    <b70ef>   DW_AT_data_member_location: 32
 <2><b70f0>: Abbrev Number: 2 (DW_TAG_member)
    <b70f1>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b70f5>   DW_AT_decl_file   : 9
    <b70f6>   DW_AT_decl_line   : 99
    <b70f7>   DW_AT_decl_column : 23
    <b70f8>   DW_AT_type        : <0xb6dfa>
    <b70fc>   DW_AT_data_member_location: 40
 <2><b70fd>: Abbrev Number: 2 (DW_TAG_member)
    <b70fe>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b7102>   DW_AT_decl_file   : 9
    <b7103>   DW_AT_decl_line   : 100
    <b7104>   DW_AT_decl_column : 23
    <b7105>   DW_AT_type        : <0xb6e12>
    <b7109>   DW_AT_data_member_location: 48
 <2><b710a>: Abbrev Number: 2 (DW_TAG_member)
    <b710b>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b710f>   DW_AT_decl_file   : 9
    <b7110>   DW_AT_decl_line   : 101
    <b7111>   DW_AT_decl_column : 23
    <b7112>   DW_AT_type        : <0xb6e37>
    <b7116>   DW_AT_data_member_location: 56
 <2><b7117>: Abbrev Number: 2 (DW_TAG_member)
    <b7118>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b711c>   DW_AT_decl_file   : 9
    <b711d>   DW_AT_decl_line   : 102
    <b711e>   DW_AT_decl_column : 23
    <b711f>   DW_AT_type        : <0xb6e43>
    <b7123>   DW_AT_data_member_location: 64
 <2><b7124>: Abbrev Number: 2 (DW_TAG_member)
    <b7125>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b7129>   DW_AT_decl_file   : 9
    <b712a>   DW_AT_decl_line   : 103
    <b712b>   DW_AT_decl_column : 23
    <b712c>   DW_AT_type        : <0xb6e4f>
    <b7130>   DW_AT_data_member_location: 72
 <2><b7131>: Abbrev Number: 2 (DW_TAG_member)
    <b7132>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b7136>   DW_AT_decl_file   : 9
    <b7137>   DW_AT_decl_line   : 104
    <b7138>   DW_AT_decl_column : 23
    <b7139>   DW_AT_type        : <0xb6e75>
    <b713d>   DW_AT_data_member_location: 80
 <2><b713e>: Abbrev Number: 2 (DW_TAG_member)
    <b713f>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b7143>   DW_AT_decl_file   : 9
    <b7144>   DW_AT_decl_line   : 105
    <b7145>   DW_AT_decl_column : 24
    <b7146>   DW_AT_type        : <0xb6eab>
    <b714a>   DW_AT_data_member_location: 88
 <2><b714b>: Abbrev Number: 2 (DW_TAG_member)
    <b714c>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b7150>   DW_AT_decl_file   : 9
    <b7151>   DW_AT_decl_line   : 106
    <b7152>   DW_AT_decl_column : 25
    <b7153>   DW_AT_type        : <0xb6ed1>
    <b7157>   DW_AT_data_member_location: 96
 <2><b7158>: Abbrev Number: 2 (DW_TAG_member)
    <b7159>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b715d>   DW_AT_decl_file   : 9
    <b715e>   DW_AT_decl_line   : 107
    <b715f>   DW_AT_decl_column : 23
    <b7160>   DW_AT_type        : <0xb6ef7>
    <b7164>   DW_AT_data_member_location: 104
 <2><b7165>: Abbrev Number: 2 (DW_TAG_member)
    <b7166>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b716a>   DW_AT_decl_file   : 9
    <b716b>   DW_AT_decl_line   : 108
    <b716c>   DW_AT_decl_column : 23
    <b716d>   DW_AT_type        : <0xb6f89>
    <b7171>   DW_AT_data_member_location: 112
 <2><b7172>: Abbrev Number: 2 (DW_TAG_member)
    <b7173>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b7177>   DW_AT_decl_file   : 9
    <b7178>   DW_AT_decl_line   : 109
    <b7179>   DW_AT_decl_column : 23
    <b717a>   DW_AT_type        : <0xb6fa9>
    <b717e>   DW_AT_data_member_location: 120
 <2><b717f>: Abbrev Number: 2 (DW_TAG_member)
    <b7180>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b7184>   DW_AT_decl_file   : 9
    <b7185>   DW_AT_decl_line   : 110
    <b7186>   DW_AT_decl_column : 23
    <b7187>   DW_AT_type        : <0xb6fdd>
    <b718b>   DW_AT_data_member_location: 128
 <2><b718c>: Abbrev Number: 2 (DW_TAG_member)
    <b718d>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b7191>   DW_AT_decl_file   : 9
    <b7192>   DW_AT_decl_line   : 111
    <b7193>   DW_AT_decl_column : 23
    <b7194>   DW_AT_type        : <0xb700c>
    <b7198>   DW_AT_data_member_location: 136
 <2><b7199>: Abbrev Number: 2 (DW_TAG_member)
    <b719a>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b719e>   DW_AT_decl_file   : 9
    <b719f>   DW_AT_decl_line   : 112
    <b71a0>   DW_AT_decl_column : 23
    <b71a1>   DW_AT_type        : <0xb702c>
    <b71a5>   DW_AT_data_member_location: 144
 <2><b71a6>: Abbrev Number: 2 (DW_TAG_member)
    <b71a7>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b71ab>   DW_AT_decl_file   : 9
    <b71ac>   DW_AT_decl_line   : 113
    <b71ad>   DW_AT_decl_column : 25
    <b71ae>   DW_AT_type        : <0xb6e06>
    <b71b2>   DW_AT_data_member_location: 152
 <2><b71b3>: Abbrev Number: 2 (DW_TAG_member)
    <b71b4>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b71b8>   DW_AT_decl_file   : 9
    <b71b9>   DW_AT_decl_line   : 114
    <b71ba>   DW_AT_decl_column : 24
    <b71bb>   DW_AT_type        : <0xb6f1c>
    <b71bf>   DW_AT_data_member_location: 160
 <2><b71c0>: Abbrev Number: 2 (DW_TAG_member)
    <b71c1>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <b71c5>   DW_AT_decl_file   : 9
    <b71c6>   DW_AT_decl_line   : 115
    <b71c7>   DW_AT_decl_column : 25
    <b71c8>   DW_AT_type        : <0xb6f55>
    <b71cc>   DW_AT_data_member_location: 168
 <2><b71cd>: Abbrev Number: 2 (DW_TAG_member)
    <b71ce>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <b71d2>   DW_AT_decl_file   : 9
    <b71d3>   DW_AT_decl_line   : 116
    <b71d4>   DW_AT_decl_column : 23
    <b71d5>   DW_AT_type        : <0xb6e81>
    <b71d9>   DW_AT_data_member_location: 176
 <2><b71da>: Abbrev Number: 2 (DW_TAG_member)
    <b71db>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <b71df>   DW_AT_decl_file   : 9
    <b71e0>   DW_AT_decl_line   : 117
    <b71e1>   DW_AT_decl_column : 23
    <b71e2>   DW_AT_type        : <0xb7051>
    <b71e6>   DW_AT_data_member_location: 184
 <2><b71e7>: Abbrev Number: 2 (DW_TAG_member)
    <b71e8>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <b71ec>   DW_AT_decl_file   : 9
    <b71ed>   DW_AT_decl_line   : 118
    <b71ee>   DW_AT_decl_column : 22
    <b71ef>   DW_AT_type        : <0xb705d>
    <b71f3>   DW_AT_data_member_location: 192
 <2><b71f4>: Abbrev Number: 2 (DW_TAG_member)
    <b71f5>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <b71f9>   DW_AT_decl_file   : 9
    <b71fa>   DW_AT_decl_line   : 119
    <b71fb>   DW_AT_decl_column : 23
    <b71fc>   DW_AT_type        : <0xb7069>
    <b7200>   DW_AT_data_member_location: 200
 <2><b7201>: Abbrev Number: 2 (DW_TAG_member)
    <b7202>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <b7206>   DW_AT_decl_file   : 9
    <b7207>   DW_AT_decl_line   : 120
    <b7208>   DW_AT_decl_column : 22
    <b7209>   DW_AT_type        : <0xb7075>
    <b720d>   DW_AT_data_member_location: 208
 <2><b720e>: Abbrev Number: 2 (DW_TAG_member)
    <b720f>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <b7213>   DW_AT_decl_file   : 9
    <b7214>   DW_AT_decl_line   : 121
    <b7215>   DW_AT_decl_column : 23
    <b7216>   DW_AT_type        : <0xb7081>
    <b721a>   DW_AT_data_member_location: 216
 <2><b721b>: Abbrev Number: 0
 <1><b721c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b721d>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b7221>   DW_AT_decl_file   : 9
    <b7222>   DW_AT_decl_line   : 122
    <b7223>   DW_AT_decl_column : 3
    <b7224>   DW_AT_type        : <0xb70a2>
 <1><b7228>: Abbrev Number: 38 (DW_TAG_structure_type)
    <b7229>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <b722d>   DW_AT_byte_size   : 20848
    <b722f>   DW_AT_decl_file   : 10
    <b7230>   DW_AT_decl_line   : 349
    <b7232>   DW_AT_decl_column : 16
    <b7233>   DW_AT_sibling     : <0xb72a8>
 <2><b7237>: Abbrev Number: 12 (DW_TAG_member)
    <b7238>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <b723c>   DW_AT_decl_file   : 10
    <b723c>   DW_AT_decl_line   : 350
    <b723e>   DW_AT_decl_column : 18
    <b723e>   DW_AT_type        : <0xb67fb>
    <b7242>   DW_AT_data_member_location: 0
 <2><b7243>: Abbrev Number: 12 (DW_TAG_member)
    <b7244>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <b7248>   DW_AT_decl_file   : 10
    <b7248>   DW_AT_decl_line   : 351
    <b724a>   DW_AT_decl_column : 18
    <b724a>   DW_AT_type        : <0xb6889>
    <b724e>   DW_AT_data_member_location: 8
 <2><b724f>: Abbrev Number: 12 (DW_TAG_member)
    <b7250>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <b7254>   DW_AT_decl_file   : 10
    <b7254>   DW_AT_decl_line   : 352
    <b7256>   DW_AT_decl_column : 18
    <b7256>   DW_AT_type        : <0xb68d5>
    <b725a>   DW_AT_data_member_location: 16
 <2><b725b>: Abbrev Number: 12 (DW_TAG_member)
    <b725c>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <b7260>   DW_AT_decl_file   : 10
    <b7260>   DW_AT_decl_line   : 353
    <b7262>   DW_AT_decl_column : 18
    <b7262>   DW_AT_type        : <0xb6823>
    <b7266>   DW_AT_data_member_location: 40
 <2><b7267>: Abbrev Number: 12 (DW_TAG_member)
    <b7268>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b726c>   DW_AT_decl_file   : 10
    <b726c>   DW_AT_decl_line   : 354
    <b726e>   DW_AT_decl_column : 18
    <b726e>   DW_AT_type        : <0xb721c>
    <b7272>   DW_AT_data_member_location: 48
 <2><b7273>: Abbrev Number: 14 (DW_TAG_member)
    <b7274>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <b7278>   DW_AT_decl_file   : 10
    <b7278>   DW_AT_decl_line   : 355
    <b727a>   DW_AT_decl_column : 18
