    <b371b>   DW_AT_call_origin : <0xb3239>
    <b371f>   DW_AT_sibling     : <0xb3729>
 <8><b3723>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <b3724>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b3726>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <8><b3728>: Abbrev Number: 0
 <7><b3729>: Abbrev Number: 26 (DW_TAG_call_site)
    <b372a>   DW_AT_call_return_pc: 0x470efe
    <b3732>   DW_AT_sibling     : <0xb3749>
 <8><b3736>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <b3737>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b3739>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <8><b373c>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <b373d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b373f>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <8><b3742>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <b3743>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b3745>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <8><b3748>: Abbrev Number: 0
 <7><b3749>: Abbrev Number: 27 (DW_TAG_call_site)
    <b374a>   DW_AT_call_return_pc: 0x470f18
    <b3752>   DW_AT_call_tail_call: 1
    <b3752>   DW_AT_call_origin : <0xb3239>
 <7><b3756>: Abbrev Number: 11 (DW_TAG_call_site)
    <b3757>   DW_AT_call_return_pc: 0x470f2b
    <b375f>   DW_AT_call_origin : <0xb321d>
    <b3763>   DW_AT_sibling     : <0xb3774>

    <b3ee8>   DW_AT_decl_line   : 108
    <b3ee9>   DW_AT_decl_column : 19
    <b3eea>   DW_AT_type        : <0xb3e94>
 <1><b3eee>: Abbrev Number: 8 (DW_TAG_base_type)
    <b3eef>   DW_AT_byte_size   : 8
    <b3ef0>   DW_AT_encoding    : 7	(unsigned)
    <b3ef1>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><b3ef5>: Abbrev Number: 23 (DW_TAG_array_type)
    <b3ef6>   DW_AT_type        : <0xb3ea5>
    <b3efa>   DW_AT_sibling     : <0xb3f05>
 <2><b3efe>: Abbrev Number: 39 (DW_TAG_subrange_type)
    <b3eff>   DW_AT_type        : <0xb3e63>
    <b3f03>   DW_AT_upper_bound : 3
 <2><b3f04>: Abbrev Number: 0
 <1><b3f05>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b3f06>   DW_AT_byte_size   : 8
    <b3f06>   DW_AT_type        : <0xb3f0a>
 <1><b3f0a>: Abbrev Number: 40 (DW_TAG_const_type)
 <1><b3f0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b3f0c>   DW_AT_byte_size   : 8
    <b3f0c>   DW_AT_type        : <0xb3eac>
 <1><b3f10>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b3f11>   DW_AT_byte_size   : 8
    <b3f11>   DW_AT_type        : <0xb3ea0>
 <1><b3f15>: Abbrev Number: 3 (DW_TAG_typedef)
    <b3f16>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <b3f1a>   DW_AT_decl_file   : 5
    <b3f1b>   DW_AT_decl_line   : 22
    <b3f1c>   DW_AT_decl_column : 15
    <b3f1d>   DW_AT_type        : <0xb3ed6>
 <1><b3f21>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <b3f22>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <b3f26>   DW_AT_encoding    : 7	(void)
    <b3f26>   DW_AT_byte_size   : 4
    <b3f26>   DW_AT_type        : <0xb3e5c>
    <b3f2a>   DW_AT_decl_file   : 7
    <b3f2b>   DW_AT_decl_line   : 1
    <b3f2c>   DW_AT_decl_column : 14
    <b3f2c>   DW_AT_sibling     : <0xb3fa3>
 <2><b3f30>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f31>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <b3f35>   DW_AT_const_value : 0
 <2><b3f36>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f37>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <b3f3b>   DW_AT_const_value : 1
 <2><b3f3c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f3d>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <b3f41>   DW_AT_const_value : 2
 <2><b3f42>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f43>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <b3f47>   DW_AT_const_value : 3
 <2><b3f48>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f49>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <b3f4d>   DW_AT_const_value : 4
 <2><b3f4e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f4f>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <b3f53>   DW_AT_const_value : 5
 <2><b3f54>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f55>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <b3f59>   DW_AT_const_value : 6
 <2><b3f5a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f5b>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <b3f5f>   DW_AT_const_value : 7
 <2><b3f60>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f61>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <b3f65>   DW_AT_const_value : 8
 <2><b3f66>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f67>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <b3f6b>   DW_AT_const_value : 9
 <2><b3f6c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f6d>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <b3f71>   DW_AT_const_value : 10
 <2><b3f72>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f73>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <b3f77>   DW_AT_const_value : 11
 <2><b3f78>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f79>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <b3f7d>   DW_AT_const_value : 12
 <2><b3f7e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f7f>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <b3f83>   DW_AT_const_value : 13
 <2><b3f84>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f85>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <b3f89>   DW_AT_const_value : 14
 <2><b3f8a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f8b>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <b3f8f>   DW_AT_const_value : 15
 <2><b3f90>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f91>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <b3f95>   DW_AT_const_value : 16
 <2><b3f96>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f97>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <b3f9b>   DW_AT_const_value : 17
 <2><b3f9c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b3f9d>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <b3fa1>   DW_AT_const_value : 18
 <2><b3fa2>: Abbrev Number: 0
 <1><b3fa3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b3fa4>   DW_AT_byte_size   : 8
    <b3fa4>   DW_AT_type        : <0xb3fa8>
 <1><b3fa8>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <b3fa9>   DW_AT_prototyped  : 1
 <1><b3fa9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b3faa>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <b3fae>   DW_AT_byte_size   : 24
    <b3faf>   DW_AT_decl_file   : 6
    <b3fb0>   DW_AT_decl_line   : 82
    <b3fb1>   DW_AT_decl_column : 16
    <b3fb2>   DW_AT_sibling     : <0xb3fde>
 <2><b3fb6>: Abbrev Number: 2 (DW_TAG_member)
    <b3fb7>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b3fbb>   DW_AT_decl_file   : 6
    <b3fbc>   DW_AT_decl_line   : 83
    <b3fbd>   DW_AT_decl_column : 21
    <b3fbe>   DW_AT_type        : <0xb3ea0>
    <b3fc2>   DW_AT_data_member_location: 0
 <2><b3fc3>: Abbrev Number: 11 (DW_TAG_member)
    <b3fc4>   DW_AT_name        : len
    <b3fc8>   DW_AT_decl_file   : 6
    <b3fc9>   DW_AT_decl_line   : 84
    <b3fca>   DW_AT_decl_column : 21
    <b3fcb>   DW_AT_type        : <0xb3ee2>
    <b3fcf>   DW_AT_data_member_location: 8
 <2><b3fd0>: Abbrev Number: 2 (DW_TAG_member)
    <b3fd1>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b3fd5>   DW_AT_decl_file   : 6
    <b3fd6>   DW_AT_decl_line   : 85
    <b3fd7>   DW_AT_decl_column : 21
    <b3fd8>   DW_AT_type        : <0xb3ee2>
    <b3fdc>   DW_AT_data_member_location: 16
 <2><b3fdd>: Abbrev Number: 0
 <1><b3fde>: Abbrev Number: 3 (DW_TAG_typedef)
    <b3fdf>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <b3fe3>   DW_AT_decl_file   : 6
    <b3fe4>   DW_AT_decl_line   : 86
    <b3fe5>   DW_AT_decl_column : 3
    <b3fe6>   DW_AT_type        : <0xb3fa9>
 <1><b3fea>: Abbrev Number: 8 (DW_TAG_base_type)
    <b3feb>   DW_AT_byte_size   : 8
    <b3fec>   DW_AT_encoding    : 4	(float)
    <b3fed>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><b3ff1>: Abbrev Number: 8 (DW_TAG_base_type)
    <b3ff2>   DW_AT_byte_size   : 4
    <b3ff3>   DW_AT_encoding    : 4	(float)
    <b3ff4>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><b3ff8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b3ff9>   DW_AT_byte_size   : 8
    <b3ff9>   DW_AT_type        : <0xb3ebd>
 <1><b3ffd>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <b3ffe>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <b4002>   DW_AT_encoding    : 7	(void)
    <b4002>   DW_AT_byte_size   : 4
    <b4002>   DW_AT_type        : <0xb3e5c>
    <b4006>   DW_AT_decl_file   : 8
    <b4007>   DW_AT_decl_line   : 25
    <b4008>   DW_AT_decl_column : 14
    <b4008>   DW_AT_sibling     : <0xb4025>
 <2><b400c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b400d>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <b4011>   DW_AT_const_value : 0
 <2><b4012>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b4013>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <b4017>   DW_AT_const_value : 1
 <2><b4018>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b4019>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <b401d>   DW_AT_const_value : 2
 <2><b401e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b401f>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <b4023>   DW_AT_const_value : 3
 <2><b4024>: Abbrev Number: 0
 <1><b4025>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4026>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <b402a>   DW_AT_decl_file   : 8
    <b402b>   DW_AT_decl_line   : 30
    <b402c>   DW_AT_decl_column : 3
    <b402d>   DW_AT_type        : <0xb3ffd>
 <1><b4031>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4032>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <b4036>   DW_AT_decl_file   : 8
    <b4037>   DW_AT_decl_line   : 54
    <b4038>   DW_AT_decl_column : 15
    <b4039>   DW_AT_type        : <0xb403d>
 <1><b403d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b403e>   DW_AT_byte_size   : 8
    <b403e>   DW_AT_type        : <0xb4042>
 <1><b4042>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4043>   DW_AT_prototyped  : 1
    <b4043>   DW_AT_type        : <0xb3e78>
    <b4047>   DW_AT_sibling     : <0xb4056>
 <2><b404b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b404c>   DW_AT_type        : <0xb4056>
 <2><b4050>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4051>   DW_AT_type        : <0xb3e78>
 <2><b4055>: Abbrev Number: 0
 <1><b4056>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4057>   DW_AT_byte_size   : 8
    <b4057>   DW_AT_type        : <0xb405b>
 <1><b405b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b405c>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <b4060>   DW_AT_byte_size   : 80
    <b4061>   DW_AT_decl_file   : 8
    <b4062>   DW_AT_decl_line   : 97
    <b4063>   DW_AT_decl_column : 16
    <b4064>   DW_AT_sibling     : <0xb411f>
 <2><b4068>: Abbrev Number: 2 (DW_TAG_member)
    <b4069>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b406d>   DW_AT_decl_file   : 8
    <b406e>   DW_AT_decl_line   : 98
    <b406f>   DW_AT_decl_column : 21
    <b4070>   DW_AT_type        : <0xb3e78>
    <b4074>   DW_AT_data_member_location: 0
 <2><b4075>: Abbrev Number: 11 (DW_TAG_member)
    <b4076>   DW_AT_name        : len
    <b407a>   DW_AT_decl_file   : 8
    <b407b>   DW_AT_decl_line   : 99
    <b407c>   DW_AT_decl_column : 21
    <b407d>   DW_AT_type        : <0xb3e78>
    <b4081>   DW_AT_data_member_location: 4
 <2><b4082>: Abbrev Number: 2 (DW_TAG_member)
    <b4083>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <b4087>   DW_AT_decl_file   : 8
    <b4088>   DW_AT_decl_line   : 100
    <b4089>   DW_AT_decl_column : 21
    <b408a>   DW_AT_type        : <0xb4025>
    <b408e>   DW_AT_data_member_location: 8
 <2><b408f>: Abbrev Number: 2 (DW_TAG_member)
    <b4090>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b4094>   DW_AT_decl_file   : 8
    <b4095>   DW_AT_decl_line   : 101
    <b4096>   DW_AT_decl_column : 21
    <b4097>   DW_AT_type        : <0xb3f15>
    <b409b>   DW_AT_data_member_location: 16
 <2><b409c>: Abbrev Number: 2 (DW_TAG_member)
    <b409d>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b40a1>   DW_AT_decl_file   : 8
    <b40a2>   DW_AT_decl_line   : 102
    <b40a3>   DW_AT_decl_column : 21
    <b40a4>   DW_AT_type        : <0xb3e78>
    <b40a8>   DW_AT_data_member_location: 24
 <2><b40a9>: Abbrev Number: 2 (DW_TAG_member)
    <b40aa>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <b40ae>   DW_AT_decl_file   : 8
    <b40af>   DW_AT_decl_line   : 103
    <b40b0>   DW_AT_decl_column : 21
    <b40b1>   DW_AT_type        : <0xb3e78>
    <b40b5>   DW_AT_data_member_location: 28
 <2><b40b6>: Abbrev Number: 2 (DW_TAG_member)
    <b40b7>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <b40bb>   DW_AT_decl_file   : 8
    <b40bc>   DW_AT_decl_line   : 104
    <b40bd>   DW_AT_decl_column : 21
    <b40be>   DW_AT_type        : <0xb3e78>
    <b40c2>   DW_AT_data_member_location: 32
 <2><b40c3>: Abbrev Number: 2 (DW_TAG_member)
    <b40c4>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <b40c8>   DW_AT_decl_file   : 8
    <b40c9>   DW_AT_decl_line   : 105
    <b40ca>   DW_AT_decl_column : 21
    <b40cb>   DW_AT_type        : <0xb3e5c>
    <b40cf>   DW_AT_data_member_location: 36
 <2><b40d0>: Abbrev Number: 2 (DW_TAG_member)
    <b40d1>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <b40d5>   DW_AT_decl_file   : 8
    <b40d6>   DW_AT_decl_line   : 106
    <b40d7>   DW_AT_decl_column : 21
    <b40d8>   DW_AT_type        : <0xb3e5c>
    <b40dc>   DW_AT_data_member_location: 40
 <2><b40dd>: Abbrev Number: 2 (DW_TAG_member)
    <b40de>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <b40e2>   DW_AT_decl_file   : 8
    <b40e3>   DW_AT_decl_line   : 109
    <b40e4>   DW_AT_decl_column : 21
    <b40e5>   DW_AT_type        : <0xb3ef5>
    <b40e9>   DW_AT_data_member_location: 44
 <2><b40ea>: Abbrev Number: 2 (DW_TAG_member)
    <b40eb>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <b40ef>   DW_AT_decl_file   : 8
    <b40f0>   DW_AT_decl_line   : 110
    <b40f1>   DW_AT_decl_column : 21
    <b40f2>   DW_AT_type        : <0xb3eb1>
    <b40f6>   DW_AT_data_member_location: 48
 <2><b40f7>: Abbrev Number: 2 (DW_TAG_member)
    <b40f8>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b40fc>   DW_AT_decl_file   : 8
    <b40fd>   DW_AT_decl_line   : 112
    <b40fe>   DW_AT_decl_column : 22
    <b40ff>   DW_AT_type        : <0xb43b7>
    <b4103>   DW_AT_data_member_location: 56
 <2><b4104>: Abbrev Number: 2 (DW_TAG_member)
    <b4105>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <b4109>   DW_AT_decl_file   : 8
    <b410a>   DW_AT_decl_line   : 114
    <b410b>   DW_AT_decl_column : 14
    <b410c>   DW_AT_type        : <0xb3e92>
    <b4110>   DW_AT_data_member_location: 64
 <2><b4111>: Abbrev Number: 2 (DW_TAG_member)
    <b4112>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <b4116>   DW_AT_decl_file   : 8
    <b4117>   DW_AT_decl_line   : 116
    <b4118>   DW_AT_decl_column : 22
    <b4119>   DW_AT_type        : <0xb4056>
    <b411d>   DW_AT_data_member_location: 72
 <2><b411e>: Abbrev Number: 0
 <1><b411f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4120>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <b4124>   DW_AT_decl_file   : 8
    <b4125>   DW_AT_decl_line   : 59
    <b4126>   DW_AT_decl_column : 15
    <b4127>   DW_AT_type        : <0xb412b>
 <1><b412b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b412c>   DW_AT_byte_size   : 8
    <b412c>   DW_AT_type        : <0xb4130>
 <1><b4130>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4131>   DW_AT_prototyped  : 1
    <b4131>   DW_AT_type        : <0xb3e78>
    <b4135>   DW_AT_sibling     : <0xb413f>
 <2><b4139>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b413a>   DW_AT_type        : <0xb4056>
 <2><b413e>: Abbrev Number: 0
 <1><b413f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4140>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <b4144>   DW_AT_decl_file   : 8
    <b4145>   DW_AT_decl_line   : 60
    <b4146>   DW_AT_decl_column : 15
    <b4147>   DW_AT_type        : <0xb412b>
 <1><b414b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b414c>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <b4150>   DW_AT_decl_file   : 8
    <b4151>   DW_AT_decl_line   : 61
    <b4152>   DW_AT_decl_column : 15
    <b4153>   DW_AT_type        : <0xb4157>
 <1><b4157>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4158>   DW_AT_byte_size   : 8
    <b4158>   DW_AT_type        : <0xb415c>
 <1><b415c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b415d>   DW_AT_prototyped  : 1
    <b415d>   DW_AT_type        : <0xb3e78>
    <b4161>   DW_AT_sibling     : <0xb4175>
 <2><b4165>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4166>   DW_AT_type        : <0xb4056>
 <2><b416a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b416b>   DW_AT_type        : <0xb3f15>
 <2><b416f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4170>   DW_AT_type        : <0xb3e78>
 <2><b4174>: Abbrev Number: 0
 <1><b4175>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4176>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <b417a>   DW_AT_decl_file   : 8
    <b417b>   DW_AT_decl_line   : 62
    <b417c>   DW_AT_decl_column : 15
    <b417d>   DW_AT_type        : <0xb4181>
 <1><b4181>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4182>   DW_AT_byte_size   : 8
    <b4182>   DW_AT_type        : <0xb4186>
 <1><b4186>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4187>   DW_AT_prototyped  : 1
    <b4187>   DW_AT_type        : <0xb3e78>
    <b418b>   DW_AT_sibling     : <0xb419a>
 <2><b418f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4190>   DW_AT_type        : <0xb4056>
 <2><b4194>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4195>   DW_AT_type        : <0xb419a>
 <2><b4199>: Abbrev Number: 0
 <1><b419a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b419b>   DW_AT_byte_size   : 8
    <b419b>   DW_AT_type        : <0xb3f15>
 <1><b419f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b41a0>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <b41a4>   DW_AT_decl_file   : 8
    <b41a5>   DW_AT_decl_line   : 63
    <b41a6>   DW_AT_decl_column : 15
    <b41a7>   DW_AT_type        : <0xb41ab>
 <1><b41ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b41ac>   DW_AT_byte_size   : 8
    <b41ac>   DW_AT_type        : <0xb41b0>
 <1><b41b0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b41b1>   DW_AT_prototyped  : 1
    <b41b1>   DW_AT_type        : <0xb3e78>
    <b41b5>   DW_AT_sibling     : <0xb41c9>
 <2><b41b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41ba>   DW_AT_type        : <0xb4056>
 <2><b41be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41bf>   DW_AT_type        : <0xb3e92>
 <2><b41c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41c4>   DW_AT_type        : <0xb41c9>
 <2><b41c8>: Abbrev Number: 0
 <1><b41c9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b41ca>   DW_AT_byte_size   : 8
    <b41ca>   DW_AT_type        : <0xb3eb1>
 <1><b41ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <b41cf>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <b41d3>   DW_AT_decl_file   : 8
    <b41d4>   DW_AT_decl_line   : 65
    <b41d5>   DW_AT_decl_column : 15
    <b41d6>   DW_AT_type        : <0xb41da>
 <1><b41da>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b41db>   DW_AT_byte_size   : 8
    <b41db>   DW_AT_type        : <0xb41df>
 <1><b41df>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b41e0>   DW_AT_prototyped  : 1
    <b41e0>   DW_AT_type        : <0xb3e78>
    <b41e4>   DW_AT_sibling     : <0xb41f8>
 <2><b41e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41e9>   DW_AT_type        : <0xb4056>
 <2><b41ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41ee>   DW_AT_type        : <0xb3ff8>
 <2><b41f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b41f3>   DW_AT_type        : <0xb41c9>
 <2><b41f7>: Abbrev Number: 0
 <1><b41f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b41f9>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <b41fd>   DW_AT_decl_file   : 8
    <b41fe>   DW_AT_decl_line   : 67
    <b41ff>   DW_AT_decl_column : 15
    <b4200>   DW_AT_type        : <0xb4204>
 <1><b4204>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4205>   DW_AT_byte_size   : 8
    <b4205>   DW_AT_type        : <0xb4209>
 <1><b4209>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b420a>   DW_AT_prototyped  : 1
    <b420a>   DW_AT_type        : <0xb3e78>
    <b420e>   DW_AT_sibling     : <0xb4222>
 <2><b4212>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4213>   DW_AT_type        : <0xb4056>
 <2><b4217>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4218>   DW_AT_type        : <0xb3f05>
 <2><b421c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b421d>   DW_AT_type        : <0xb3eb1>
 <2><b4221>: Abbrev Number: 0
 <1><b4222>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4223>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <b4227>   DW_AT_decl_file   : 8
    <b4228>   DW_AT_decl_line   : 69
    <b4229>   DW_AT_decl_column : 15
    <b422a>   DW_AT_type        : <0xb422e>
 <1><b422e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b422f>   DW_AT_byte_size   : 8
    <b422f>   DW_AT_type        : <0xb4233>
 <1><b4233>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4234>   DW_AT_prototyped  : 1
    <b4234>   DW_AT_type        : <0xb3e78>
    <b4238>   DW_AT_sibling     : <0xb424c>
 <2><b423c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b423d>   DW_AT_type        : <0xb4056>
 <2><b4241>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4242>   DW_AT_type        : <0xb424c>
 <2><b4246>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4247>   DW_AT_type        : <0xb3eb1>
 <2><b424b>: Abbrev Number: 0
 <1><b424c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b424d>   DW_AT_byte_size   : 8
    <b424d>   DW_AT_type        : <0xb3eca>
 <1><b4251>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4252>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <b4256>   DW_AT_decl_file   : 8
    <b4257>   DW_AT_decl_line   : 71
    <b4258>   DW_AT_decl_column : 15
    <b4259>   DW_AT_type        : <0xb425d>
 <1><b425d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b425e>   DW_AT_byte_size   : 8
    <b425e>   DW_AT_type        : <0xb4262>
 <1><b4262>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4263>   DW_AT_prototyped  : 1
    <b4263>   DW_AT_type        : <0xb3e78>
    <b4267>   DW_AT_sibling     : <0xb427b>
 <2><b426b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b426c>   DW_AT_type        : <0xb4056>
 <2><b4270>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4271>   DW_AT_type        : <0xb3f15>
 <2><b4275>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4276>   DW_AT_type        : <0xb3f15>
 <2><b427a>: Abbrev Number: 0
 <1><b427b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b427c>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <b4280>   DW_AT_decl_file   : 8
    <b4281>   DW_AT_decl_line   : 73
    <b4282>   DW_AT_decl_column : 15
    <b4283>   DW_AT_type        : <0xb425d>
 <1><b4287>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4288>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <b428c>   DW_AT_decl_file   : 8
    <b428d>   DW_AT_decl_line   : 75
    <b428e>   DW_AT_decl_column : 15
    <b428f>   DW_AT_type        : <0xb4293>
 <1><b4293>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4294>   DW_AT_byte_size   : 8
    <b4294>   DW_AT_type        : <0xb4298>
 <1><b4298>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4299>   DW_AT_prototyped  : 1
    <b4299>   DW_AT_type        : <0xb3e78>
    <b429d>   DW_AT_sibling     : <0xb42ac>
 <2><b42a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b42a2>   DW_AT_type        : <0xb4056>
 <2><b42a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b42a7>   DW_AT_type        : <0xb42ac>
 <2><b42ab>: Abbrev Number: 0
 <1><b42ac>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b42ad>   DW_AT_byte_size   : 8
    <b42ad>   DW_AT_type        : <0xb3fde>
 <1><b42b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b42b2>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <b42b6>   DW_AT_decl_file   : 8
    <b42b7>   DW_AT_decl_line   : 76
    <b42b8>   DW_AT_decl_column : 15
    <b42b9>   DW_AT_type        : <0xb42bd>
 <1><b42bd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b42be>   DW_AT_byte_size   : 8
    <b42be>   DW_AT_type        : <0xb42c2>
 <1><b42c2>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b42c3>   DW_AT_prototyped  : 1
    <b42c3>   DW_AT_type        : <0xb3e78>
    <b42c7>   DW_AT_sibling     : <0xb42db>
 <2><b42cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b42cc>   DW_AT_type        : <0xb4056>
 <2><b42d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b42d1>   DW_AT_type        : <0xb3ff8>
 <2><b42d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b42d6>   DW_AT_type        : <0xb3ee2>
 <2><b42da>: Abbrev Number: 0
 <1><b42db>: Abbrev Number: 3 (DW_TAG_typedef)
    <b42dc>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <b42e0>   DW_AT_decl_file   : 8
    <b42e1>   DW_AT_decl_line   : 77
    <b42e2>   DW_AT_decl_column : 15
    <b42e3>   DW_AT_type        : <0xb412b>
 <1><b42e7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b42e8>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <b42ec>   DW_AT_byte_size   : 112
    <b42ed>   DW_AT_decl_file   : 8
    <b42ee>   DW_AT_decl_line   : 80
    <b42ef>   DW_AT_decl_column : 16
    <b42f0>   DW_AT_sibling     : <0xb43ab>
 <2><b42f4>: Abbrev Number: 2 (DW_TAG_member)
    <b42f5>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <b42f9>   DW_AT_decl_file   : 8
    <b42fa>   DW_AT_decl_line   : 81
    <b42fb>   DW_AT_decl_column : 25
    <b42fc>   DW_AT_type        : <0xb411f>
    <b4300>   DW_AT_data_member_location: 0
 <2><b4301>: Abbrev Number: 2 (DW_TAG_member)
    <b4302>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <b4306>   DW_AT_decl_file   : 8
    <b4307>   DW_AT_decl_line   : 82
    <b4308>   DW_AT_decl_column : 25
    <b4309>   DW_AT_type        : <0xb413f>
    <b430d>   DW_AT_data_member_location: 8
 <2><b430e>: Abbrev Number: 2 (DW_TAG_member)
    <b430f>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <b4313>   DW_AT_decl_file   : 8
    <b4314>   DW_AT_decl_line   : 83
    <b4315>   DW_AT_decl_column : 25
    <b4316>   DW_AT_type        : <0xb414b>
    <b431a>   DW_AT_data_member_location: 16
 <2><b431b>: Abbrev Number: 2 (DW_TAG_member)
    <b431c>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <b4320>   DW_AT_decl_file   : 8
    <b4321>   DW_AT_decl_line   : 84
    <b4322>   DW_AT_decl_column : 25
    <b4323>   DW_AT_type        : <0xb4175>
    <b4327>   DW_AT_data_member_location: 24
 <2><b4328>: Abbrev Number: 2 (DW_TAG_member)
    <b4329>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <b432d>   DW_AT_decl_file   : 8
    <b432e>   DW_AT_decl_line   : 85
    <b432f>   DW_AT_decl_column : 25
    <b4330>   DW_AT_type        : <0xb419f>
    <b4334>   DW_AT_data_member_location: 32
 <2><b4335>: Abbrev Number: 2 (DW_TAG_member)
    <b4336>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <b433a>   DW_AT_decl_file   : 8
    <b433b>   DW_AT_decl_line   : 86
    <b433c>   DW_AT_decl_column : 25
    <b433d>   DW_AT_type        : <0xb41ce>
    <b4341>   DW_AT_data_member_location: 40
 <2><b4342>: Abbrev Number: 2 (DW_TAG_member)
    <b4343>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <b4347>   DW_AT_decl_file   : 8
    <b4348>   DW_AT_decl_line   : 87
    <b4349>   DW_AT_decl_column : 25
    <b434a>   DW_AT_type        : <0xb41f8>
    <b434e>   DW_AT_data_member_location: 48
 <2><b434f>: Abbrev Number: 2 (DW_TAG_member)
    <b4350>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <b4354>   DW_AT_decl_file   : 8
    <b4355>   DW_AT_decl_line   : 88
    <b4356>   DW_AT_decl_column : 25
    <b4357>   DW_AT_type        : <0xb4222>
    <b435b>   DW_AT_data_member_location: 56
 <2><b435c>: Abbrev Number: 2 (DW_TAG_member)
    <b435d>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <b4361>   DW_AT_decl_file   : 8
    <b4362>   DW_AT_decl_line   : 89
    <b4363>   DW_AT_decl_column : 25
    <b4364>   DW_AT_type        : <0xb4251>
    <b4368>   DW_AT_data_member_location: 64
 <2><b4369>: Abbrev Number: 2 (DW_TAG_member)
    <b436a>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <b436e>   DW_AT_decl_file   : 8
    <b436f>   DW_AT_decl_line   : 90
    <b4370>   DW_AT_decl_column : 25
    <b4371>   DW_AT_type        : <0xb427b>
    <b4375>   DW_AT_data_member_location: 72
 <2><b4376>: Abbrev Number: 2 (DW_TAG_member)
    <b4377>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <b437b>   DW_AT_decl_file   : 8
    <b437c>   DW_AT_decl_line   : 91
    <b437d>   DW_AT_decl_column : 25
    <b437e>   DW_AT_type        : <0xb4287>
    <b4382>   DW_AT_data_member_location: 80
 <2><b4383>: Abbrev Number: 2 (DW_TAG_member)
    <b4384>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <b4388>   DW_AT_decl_file   : 8
    <b4389>   DW_AT_decl_line   : 92
    <b438a>   DW_AT_decl_column : 25
    <b438b>   DW_AT_type        : <0xb42b1>
    <b438f>   DW_AT_data_member_location: 88
 <2><b4390>: Abbrev Number: 2 (DW_TAG_member)
    <b4391>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <b4395>   DW_AT_decl_file   : 8
    <b4396>   DW_AT_decl_line   : 93
    <b4397>   DW_AT_decl_column : 25
    <b4398>   DW_AT_type        : <0xb4031>
    <b439c>   DW_AT_data_member_location: 96
 <2><b439d>: Abbrev Number: 2 (DW_TAG_member)
    <b439e>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <b43a2>   DW_AT_decl_file   : 8
    <b43a3>   DW_AT_decl_line   : 94
    <b43a4>   DW_AT_decl_column : 25
    <b43a5>   DW_AT_type        : <0xb42db>
    <b43a9>   DW_AT_data_member_location: 104
 <2><b43aa>: Abbrev Number: 0
 <1><b43ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <b43ac>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <b43b0>   DW_AT_decl_file   : 8
    <b43b1>   DW_AT_decl_line   : 95
    <b43b2>   DW_AT_decl_column : 3
    <b43b3>   DW_AT_type        : <0xb42e7>
 <1><b43b7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b43b8>   DW_AT_byte_size   : 8
    <b43b8>   DW_AT_type        : <0xb43ab>
 <1><b43bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <b43bd>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <b43c1>   DW_AT_decl_file   : 8
    <b43c2>   DW_AT_decl_line   : 117
    <b43c3>   DW_AT_decl_column : 3
    <b43c4>   DW_AT_type        : <0xb405b>
 <1><b43c8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b43c9>   DW_AT_byte_size   : 8
    <b43c9>   DW_AT_type        : <0xb43bc>
 <1><b43cd>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b43ce>   DW_AT_byte_size   : 8
    <b43cf>   DW_AT_decl_file   : 9
    <b43cf>   DW_AT_decl_line   : 4
    <b43d0>   DW_AT_decl_column : 3
    <b43d0>   DW_AT_sibling     : <0xb43ef>
 <2><b43d4>: Abbrev Number: 2 (DW_TAG_member)
    <b43d5>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <b43d9>   DW_AT_decl_file   : 9
    <b43da>   DW_AT_decl_line   : 5
    <b43db>   DW_AT_decl_column : 8
    <b43dc>   DW_AT_type        : <0xb3e78>
    <b43e0>   DW_AT_data_member_location: 0
 <2><b43e1>: Abbrev Number: 2 (DW_TAG_member)
    <b43e2>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <b43e6>   DW_AT_decl_file   : 9
    <b43e7>   DW_AT_decl_line   : 6
    <b43e8>   DW_AT_decl_column : 8
    <b43e9>   DW_AT_type        : <0xb3e78>
    <b43ed>   DW_AT_data_member_location: 4
 <2><b43ee>: Abbrev Number: 0
 <1><b43ef>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b43f0>   DW_AT_byte_size   : 16
    <b43f1>   DW_AT_decl_file   : 9
    <b43f1>   DW_AT_decl_line   : 8
    <b43f2>   DW_AT_decl_column : 3
    <b43f2>   DW_AT_sibling     : <0xb4425>
 <2><b43f6>: Abbrev Number: 11 (DW_TAG_member)
    <b43f7>   DW_AT_name        : x
    <b43f9>   DW_AT_decl_file   : 9
    <b43fa>   DW_AT_decl_line   : 9
    <b43fb>   DW_AT_decl_column : 8
    <b43fc>   DW_AT_type        : <0xb3e78>
    <b4400>   DW_AT_data_member_location: 0
 <2><b4401>: Abbrev Number: 11 (DW_TAG_member)
    <b4402>   DW_AT_name        : y
    <b4404>   DW_AT_decl_file   : 9
    <b4405>   DW_AT_decl_line   : 9
    <b4406>   DW_AT_decl_column : 11
    <b4407>   DW_AT_type        : <0xb3e78>
    <b440b>   DW_AT_data_member_location: 4
 <2><b440c>: Abbrev Number: 11 (DW_TAG_member)
    <b440d>   DW_AT_name        : dx
    <b4410>   DW_AT_decl_file   : 9
    <b4411>   DW_AT_decl_line   : 10
    <b4412>   DW_AT_decl_column : 8
    <b4413>   DW_AT_type        : <0xb3e78>
    <b4417>   DW_AT_data_member_location: 8
 <2><b4418>: Abbrev Number: 11 (DW_TAG_member)
    <b4419>   DW_AT_name        : dy
    <b441c>   DW_AT_decl_file   : 9
    <b441d>   DW_AT_decl_line   : 10
    <b441e>   DW_AT_decl_column : 12
    <b441f>   DW_AT_type        : <0xb3e78>
    <b4423>   DW_AT_data_member_location: 12
 <2><b4424>: Abbrev Number: 0
 <1><b4425>: Abbrev Number: 42 (DW_TAG_union_type)
    <b4426>   DW_AT_byte_size   : 16
    <b4427>   DW_AT_decl_file   : 9
    <b4428>   DW_AT_decl_line   : 3
    <b4429>   DW_AT_decl_column : 2
    <b442a>   DW_AT_sibling     : <0xb4455>
 <2><b442e>: Abbrev Number: 26 (DW_TAG_member)
    <b442f>   DW_AT_type        : <0xb43cd>
 <2><b4433>: Abbrev Number: 26 (DW_TAG_member)
    <b4434>   DW_AT_type        : <0xb43ef>
 <2><b4438>: Abbrev Number: 43 (DW_TAG_member)
    <b4439>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <b443d>   DW_AT_decl_file   : 9
    <b443e>   DW_AT_decl_line   : 12
    <b443f>   DW_AT_decl_column : 7
    <b4440>   DW_AT_type        : <0xb3e78>
 <2><b4444>: Abbrev Number: 27 (DW_TAG_member)
    <b4445>   DW_AT_name        : z
    <b4447>   DW_AT_decl_file   : 9
    <b4447>   DW_AT_decl_line   : 13
    <b4448>   DW_AT_decl_column : 7
    <b4448>   DW_AT_type        : <0xb3e78>
 <2><b444c>: Abbrev Number: 27 (DW_TAG_member)
    <b444d>   DW_AT_name        : w
    <b444f>   DW_AT_decl_file   : 9
    <b444f>   DW_AT_decl_line   : 14
    <b4450>   DW_AT_decl_column : 7
    <b4450>   DW_AT_type        : <0xb3e78>
 <2><b4454>: Abbrev Number: 0
 <1><b4455>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b4456>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <b445a>   DW_AT_byte_size   : 20
    <b445b>   DW_AT_decl_file   : 9
    <b445c>   DW_AT_decl_line   : 1
    <b445d>   DW_AT_decl_column : 8
    <b445e>   DW_AT_sibling     : <0xb4476>
 <2><b4462>: Abbrev Number: 2 (DW_TAG_member)
    <b4463>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b4467>   DW_AT_decl_file   : 9
    <b4468>   DW_AT_decl_line   : 2
    <b4469>   DW_AT_decl_column : 6
    <b446a>   DW_AT_type        : <0xb3e78>
    <b446e>   DW_AT_data_member_location: 0
 <2><b446f>: Abbrev Number: 44 (DW_TAG_member)
    <b4470>   DW_AT_type        : <0xb4425>
    <b4474>   DW_AT_data_member_location: 4
 <2><b4475>: Abbrev Number: 0
 <1><b4476>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4477>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <b447b>   DW_AT_decl_file   : 9
    <b447c>   DW_AT_decl_line   : 18
    <b447d>   DW_AT_decl_column : 23
    <b447e>   DW_AT_type        : <0xb4455>
 <1><b4482>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4483>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <b4487>   DW_AT_decl_file   : 10
    <b4488>   DW_AT_decl_line   : 1
    <b4489>   DW_AT_decl_column : 23
    <b448a>   DW_AT_type        : <0xb448e>
 <1><b448e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b448f>   DW_AT_byte_size   : 8
    <b448f>   DW_AT_type        : <0xb4493>
 <1><b4493>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <b4494>   DW_AT_prototyped  : 1
    <b4494>   DW_AT_type        : <0xb42ac>
 <1><b4498>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4499>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <b449d>   DW_AT_decl_file   : 10
    <b449e>   DW_AT_decl_line   : 2
    <b449f>   DW_AT_decl_column : 23
    <b44a0>   DW_AT_type        : <0xb44a4>
 <1><b44a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b44a5>   DW_AT_byte_size   : 8
    <b44a5>   DW_AT_type        : <0xb44a9>
 <1><b44a9>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <b44aa>   DW_AT_prototyped  : 1
    <b44aa>   DW_AT_type        : <0xb3e78>
 <1><b44ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <b44af>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <b44b3>   DW_AT_decl_file   : 10
    <b44b4>   DW_AT_decl_line   : 3
    <b44b5>   DW_AT_decl_column : 23
    <b44b6>   DW_AT_type        : <0xb44a4>
 <1><b44ba>: Abbrev Number: 3 (DW_TAG_typedef)
    <b44bb>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <b44bf>   DW_AT_decl_file   : 10
    <b44c0>   DW_AT_decl_line   : 10
    <b44c1>   DW_AT_decl_column : 23
    <b44c2>   DW_AT_type        : <0xb44c6>
 <1><b44c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b44c7>   DW_AT_byte_size   : 8
    <b44c7>   DW_AT_type        : <0xb44cb>
 <1><b44cb>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b44cc>   DW_AT_prototyped  : 1
    <b44cc>   DW_AT_sibling     : <0xb44d6>
 <2><b44d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b44d1>   DW_AT_type        : <0xb3e78>
 <2><b44d5>: Abbrev Number: 0
 <1><b44d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b44d7>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <b44db>   DW_AT_decl_file   : 10
    <b44dc>   DW_AT_decl_line   : 14
    <b44dd>   DW_AT_decl_column : 23
    <b44de>   DW_AT_type        : <0xb44e2>
 <1><b44e2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b44e3>   DW_AT_byte_size   : 8
    <b44e3>   DW_AT_type        : <0xb44e7>
 <1><b44e7>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b44e8>   DW_AT_prototyped  : 1
    <b44e8>   DW_AT_type        : <0xb3e78>
    <b44ec>   DW_AT_sibling     : <0xb4500>
 <2><b44f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b44f1>   DW_AT_type        : <0xb3e78>
 <2><b44f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b44f6>   DW_AT_type        : <0xb3e78>
 <2><b44fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b44fb>   DW_AT_type        : <0xb3e78>
 <2><b44ff>: Abbrev Number: 0
 <1><b4500>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4501>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <b4505>   DW_AT_decl_file   : 10
    <b4506>   DW_AT_decl_line   : 18
    <b4507>   DW_AT_decl_column : 23
    <b4508>   DW_AT_type        : <0xb44e2>
 <1><b450c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b450d>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <b4511>   DW_AT_decl_file   : 10
    <b4512>   DW_AT_decl_line   : 24
    <b4513>   DW_AT_decl_column : 23
    <b4514>   DW_AT_type        : <0xb3fa3>
 <1><b4518>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4519>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <b451d>   DW_AT_decl_file   : 10
    <b451e>   DW_AT_decl_line   : 28
    <b451f>   DW_AT_decl_column : 23
    <b4520>   DW_AT_type        : <0xb4524>
 <1><b4524>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4525>   DW_AT_byte_size   : 8
    <b4525>   DW_AT_type        : <0xb4529>
 <1><b4529>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b452a>   DW_AT_prototyped  : 1
    <b452a>   DW_AT_type        : <0xb3e78>
    <b452e>   DW_AT_sibling     : <0xb453d>
 <2><b4532>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4533>   DW_AT_type        : <0xb3e78>
 <2><b4537>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4538>   DW_AT_type        : <0xb3e78>
 <2><b453c>: Abbrev Number: 0
 <1><b453d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b453e>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <b4542>   DW_AT_decl_file   : 10
    <b4543>   DW_AT_decl_line   : 34
    <b4544>   DW_AT_decl_column : 23
    <b4545>   DW_AT_type        : <0xb44a4>
 <1><b4549>: Abbrev Number: 3 (DW_TAG_typedef)
    <b454a>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <b454e>   DW_AT_decl_file   : 10
    <b454f>   DW_AT_decl_line   : 35
    <b4550>   DW_AT_decl_column : 23
    <b4551>   DW_AT_type        : <0xb44a4>
 <1><b4555>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4556>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <b455a>   DW_AT_decl_file   : 10
    <b455b>   DW_AT_decl_line   : 36
    <b455c>   DW_AT_decl_column : 23
    <b455d>   DW_AT_type        : <0xb4561>
 <1><b4561>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4562>   DW_AT_byte_size   : 8
    <b4562>   DW_AT_type        : <0xb4566>
 <1><b4566>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b4567>   DW_AT_prototyped  : 1
    <b4567>   DW_AT_sibling     : <0xb4576>
 <2><b456b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b456c>   DW_AT_type        : <0xb4576>
 <2><b4570>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4571>   DW_AT_type        : <0xb4576>
 <2><b4575>: Abbrev Number: 0
 <1><b4576>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4577>   DW_AT_byte_size   : 8
    <b4577>   DW_AT_type        : <0xb3e78>
 <1><b457b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b457c>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <b4580>   DW_AT_decl_file   : 10
    <b4581>   DW_AT_decl_line   : 37
    <b4582>   DW_AT_decl_column : 23
    <b4583>   DW_AT_type        : <0xb4561>
 <1><b4587>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4588>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <b458c>   DW_AT_decl_file   : 10
    <b458d>   DW_AT_decl_line   : 45
    <b458e>   DW_AT_decl_column : 24
    <b458f>   DW_AT_type        : <0xb4593>
 <1><b4593>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4594>   DW_AT_byte_size   : 8
    <b4594>   DW_AT_type        : <0xb4598>
 <1><b4598>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4599>   DW_AT_prototyped  : 1
    <b4599>   DW_AT_type        : <0xb3e5c>
    <b459d>   DW_AT_sibling     : <0xb45b1>
 <2><b45a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45a2>   DW_AT_type        : <0xb3e78>
 <2><b45a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45a7>   DW_AT_type        : <0xb3e78>
 <2><b45ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45ac>   DW_AT_type        : <0xb3e78>
 <2><b45b0>: Abbrev Number: 0
 <1><b45b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b45b2>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <b45b6>   DW_AT_decl_file   : 10
    <b45b7>   DW_AT_decl_line   : 48
    <b45b8>   DW_AT_decl_column : 23
    <b45b9>   DW_AT_type        : <0xb45bd>
 <1><b45bd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b45be>   DW_AT_byte_size   : 8
    <b45be>   DW_AT_type        : <0xb45c2>
 <1><b45c2>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b45c3>   DW_AT_prototyped  : 1
    <b45c3>   DW_AT_sibling     : <0xb45d7>
 <2><b45c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45c8>   DW_AT_type        : <0xb3f05>
 <2><b45cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45cd>   DW_AT_type        : <0xb3eb1>
 <2><b45d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45d2>   DW_AT_type        : <0xb3e78>
 <2><b45d6>: Abbrev Number: 0
 <1><b45d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b45d8>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <b45dc>   DW_AT_decl_file   : 10
    <b45dd>   DW_AT_decl_line   : 49
    <b45de>   DW_AT_decl_column : 23
    <b45df>   DW_AT_type        : <0xb45e3>
 <1><b45e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b45e4>   DW_AT_byte_size   : 8
    <b45e4>   DW_AT_type        : <0xb45e8>
 <1><b45e8>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b45e9>   DW_AT_prototyped  : 1
    <b45e9>   DW_AT_sibling     : <0xb45fd>
 <2><b45ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45ee>   DW_AT_type        : <0xb424c>
 <2><b45f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45f3>   DW_AT_type        : <0xb3eb1>
 <2><b45f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b45f8>   DW_AT_type        : <0xb3e78>
 <2><b45fc>: Abbrev Number: 0
 <1><b45fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b45fe>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <b4602>   DW_AT_decl_file   : 10
    <b4603>   DW_AT_decl_line   : 51
    <b4604>   DW_AT_decl_column : 24
    <b4605>   DW_AT_type        : <0xb4609>
 <1><b4609>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b460a>   DW_AT_byte_size   : 8
    <b460a>   DW_AT_type        : <0xb460e>
 <1><b460e>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b460f>   DW_AT_prototyped  : 1
    <b460f>   DW_AT_type        : <0xb3ea0>
    <b4613>   DW_AT_sibling     : <0xb4622>
 <2><b4617>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4618>   DW_AT_type        : <0xb3ea0>
 <2><b461c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b461d>   DW_AT_type        : <0xb3ee2>
 <2><b4621>: Abbrev Number: 0
 <1><b4622>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4623>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <b4627>   DW_AT_decl_file   : 10
    <b4628>   DW_AT_decl_line   : 54
    <b4629>   DW_AT_decl_column : 23
    <b462a>   DW_AT_type        : <0xb462e>
 <1><b462e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b462f>   DW_AT_byte_size   : 8
    <b462f>   DW_AT_type        : <0xb4633>
 <1><b4633>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4634>   DW_AT_prototyped  : 1
    <b4634>   DW_AT_type        : <0xb3e78>
    <b4638>   DW_AT_sibling     : <0xb465b>
 <2><b463c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b463d>   DW_AT_type        : <0xb42ac>
 <2><b4641>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4642>   DW_AT_type        : <0xb3e92>
 <2><b4646>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4647>   DW_AT_type        : <0xb3ee2>
 <2><b464b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b464c>   DW_AT_type        : <0xb3e78>
 <2><b4650>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4651>   DW_AT_type        : <0xb3e78>
 <2><b4655>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4656>   DW_AT_type        : <0xb3e78>
 <2><b465a>: Abbrev Number: 0
 <1><b465b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b465c>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b4660>   DW_AT_decl_file   : 10
    <b4661>   DW_AT_decl_line   : 56
    <b4662>   DW_AT_decl_column : 23
    <b4663>   DW_AT_type        : <0xb4667>
 <1><b4667>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4668>   DW_AT_byte_size   : 8
    <b4668>   DW_AT_type        : <0xb466c>
 <1><b466c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b466d>   DW_AT_prototyped  : 1
    <b466d>   DW_AT_type        : <0xb3e78>
    <b4671>   DW_AT_sibling     : <0xb468f>
 <2><b4675>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4676>   DW_AT_type        : <0xb424c>
 <2><b467a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b467b>   DW_AT_type        : <0xb3ff8>
 <2><b467f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4680>   DW_AT_type        : <0xb3ee2>
 <2><b4684>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4685>   DW_AT_type        : <0xb3e78>
 <2><b4689>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b468a>   DW_AT_type        : <0xb3e78>
 <2><b468e>: Abbrev Number: 0
 <1><b468f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4690>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <b4694>   DW_AT_decl_file   : 10
    <b4695>   DW_AT_decl_line   : 67
    <b4696>   DW_AT_decl_column : 23
    <b4697>   DW_AT_type        : <0xb469b>
 <1><b469b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b469c>   DW_AT_byte_size   : 8
    <b469c>   DW_AT_type        : <0xb46a0>
 <1><b46a0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b46a1>   DW_AT_prototyped  : 1
    <b46a1>   DW_AT_type        : <0xb3e78>
    <b46a5>   DW_AT_sibling     : <0xb46af>
 <2><b46a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46aa>   DW_AT_type        : <0xb3e78>
 <2><b46ae>: Abbrev Number: 0
 <1><b46af>: Abbrev Number: 3 (DW_TAG_typedef)
    <b46b0>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <b46b4>   DW_AT_decl_file   : 10
    <b46b5>   DW_AT_decl_line   : 68
    <b46b6>   DW_AT_decl_column : 23
    <b46b7>   DW_AT_type        : <0xb46bb>
 <1><b46bb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b46bc>   DW_AT_byte_size   : 8
    <b46bc>   DW_AT_type        : <0xb46c0>
 <1><b46c0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b46c1>   DW_AT_prototyped  : 1
    <b46c1>   DW_AT_type        : <0xb3e78>
    <b46c5>   DW_AT_sibling     : <0xb46e3>
 <2><b46c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46ca>   DW_AT_type        : <0xb4576>
 <2><b46ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46cf>   DW_AT_type        : <0xb4576>
 <2><b46d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46d4>   DW_AT_type        : <0xb4576>
 <2><b46d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46d9>   DW_AT_type        : <0xb4576>
 <2><b46dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46de>   DW_AT_type        : <0xb4576>
 <2><b46e2>: Abbrev Number: 0
 <1><b46e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b46e4>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b46e8>   DW_AT_decl_file   : 10
    <b46e9>   DW_AT_decl_line   : 69
    <b46ea>   DW_AT_decl_column : 23
    <b46eb>   DW_AT_type        : <0xb46ef>
 <1><b46ef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b46f0>   DW_AT_byte_size   : 8
    <b46f0>   DW_AT_type        : <0xb46f4>
 <1><b46f4>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b46f5>   DW_AT_prototyped  : 1
    <b46f5>   DW_AT_type        : <0xb3e78>
    <b46f9>   DW_AT_sibling     : <0xb4712>
 <2><b46fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b46fe>   DW_AT_type        : <0xb3e78>
 <2><b4702>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4703>   DW_AT_type        : <0xb3e78>
 <2><b4707>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4708>   DW_AT_type        : <0xb3e78>
 <2><b470c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b470d>   DW_AT_type        : <0xb3e78>
 <2><b4711>: Abbrev Number: 0
 <1><b4712>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4713>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b4717>   DW_AT_decl_file   : 10
    <b4718>   DW_AT_decl_line   : 73
    <b4719>   DW_AT_decl_column : 23
    <b471a>   DW_AT_type        : <0xb471e>
 <1><b471e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b471f>   DW_AT_byte_size   : 8
    <b471f>   DW_AT_type        : <0xb4723>
 <1><b4723>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4724>   DW_AT_prototyped  : 1
    <b4724>   DW_AT_type        : <0xb3e78>
    <b4728>   DW_AT_sibling     : <0xb4732>
 <2><b472c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b472d>   DW_AT_type        : <0xb3e55>
 <2><b4731>: Abbrev Number: 0
 <1><b4732>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4733>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b4737>   DW_AT_decl_file   : 10
    <b4738>   DW_AT_decl_line   : 74
    <b4739>   DW_AT_decl_column : 23
    <b473a>   DW_AT_type        : <0xb473e>
 <1><b473e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b473f>   DW_AT_byte_size   : 8
    <b473f>   DW_AT_type        : <0xb4743>
 <1><b4743>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b4744>   DW_AT_prototyped  : 1
    <b4744>   DW_AT_type        : <0xb3e78>
    <b4748>   DW_AT_sibling     : <0xb4757>
 <2><b474c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b474d>   DW_AT_type        : <0xb3e55>
 <2><b4751>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4752>   DW_AT_type        : <0xb3e4e>
 <2><b4756>: Abbrev Number: 0
 <1><b4757>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4758>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b475c>   DW_AT_decl_file   : 10
    <b475d>   DW_AT_decl_line   : 80
    <b475e>   DW_AT_decl_column : 23
    <b475f>   DW_AT_type        : <0xb44c6>
 <1><b4763>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4764>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b4768>   DW_AT_decl_file   : 10
    <b4769>   DW_AT_decl_line   : 83
    <b476a>   DW_AT_decl_column : 23
    <b476b>   DW_AT_type        : <0xb469b>
 <1><b476f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4770>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b4774>   DW_AT_decl_file   : 10
    <b4775>   DW_AT_decl_line   : 86
    <b4776>   DW_AT_decl_column : 23
    <b4777>   DW_AT_type        : <0xb4524>
 <1><b477b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b477c>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b4780>   DW_AT_decl_file   : 10
    <b4781>   DW_AT_decl_line   : 89
    <b4782>   DW_AT_decl_column : 23
    <b4783>   DW_AT_type        : <0xb4524>
 <1><b4787>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4788>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b478c>   DW_AT_decl_file   : 10
    <b478d>   DW_AT_decl_line   : 91
    <b478e>   DW_AT_decl_column : 23
    <b478f>   DW_AT_type        : <0xb4793>
 <1><b4793>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4794>   DW_AT_byte_size   : 8
    <b4794>   DW_AT_type        : <0xb4798>
 <1><b4798>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b4799>   DW_AT_prototyped  : 1
    <b4799>   DW_AT_sibling     : <0xb47a3>
 <2><b479d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b479e>   DW_AT_type        : <0xb47a3>
 <2><b47a2>: Abbrev Number: 0
 <1><b47a3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b47a4>   DW_AT_byte_size   : 8
    <b47a4>   DW_AT_type        : <0xb4476>
 <1><b47a8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b47a9>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b47ad>   DW_AT_byte_size   : 224
    <b47ae>   DW_AT_decl_file   : 10
    <b47af>   DW_AT_decl_line   : 93
    <b47b0>   DW_AT_decl_column : 16
    <b47b1>   DW_AT_sibling     : <0xb4922>
 <2><b47b5>: Abbrev Number: 2 (DW_TAG_member)
    <b47b6>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b47ba>   DW_AT_decl_file   : 10
    <b47bb>   DW_AT_decl_line   : 94
    <b47bc>   DW_AT_decl_column : 23
    <b47bd>   DW_AT_type        : <0xb4482>
    <b47c1>   DW_AT_data_member_location: 0
 <2><b47c2>: Abbrev Number: 2 (DW_TAG_member)
    <b47c3>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b47c7>   DW_AT_decl_file   : 10
    <b47c8>   DW_AT_decl_line   : 95
    <b47c9>   DW_AT_decl_column : 23
    <b47ca>   DW_AT_type        : <0xb4498>
    <b47ce>   DW_AT_data_member_location: 8
 <2><b47cf>: Abbrev Number: 2 (DW_TAG_member)
    <b47d0>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b47d4>   DW_AT_decl_file   : 10
    <b47d5>   DW_AT_decl_line   : 96
    <b47d6>   DW_AT_decl_column : 23
    <b47d7>   DW_AT_type        : <0xb44ae>
    <b47db>   DW_AT_data_member_location: 16
 <2><b47dc>: Abbrev Number: 2 (DW_TAG_member)
    <b47dd>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b47e1>   DW_AT_decl_file   : 10
    <b47e2>   DW_AT_decl_line   : 97
    <b47e3>   DW_AT_decl_column : 23
    <b47e4>   DW_AT_type        : <0xb44ba>
    <b47e8>   DW_AT_data_member_location: 24
 <2><b47e9>: Abbrev Number: 2 (DW_TAG_member)
    <b47ea>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b47ee>   DW_AT_decl_file   : 10
    <b47ef>   DW_AT_decl_line   : 98
    <b47f0>   DW_AT_decl_column : 23
    <b47f1>   DW_AT_type        : <0xb44d6>
    <b47f5>   DW_AT_data_member_location: 32
 <2><b47f6>: Abbrev Number: 2 (DW_TAG_member)
    <b47f7>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b47fb>   DW_AT_decl_file   : 10
    <b47fc>   DW_AT_decl_line   : 99
    <b47fd>   DW_AT_decl_column : 23
    <b47fe>   DW_AT_type        : <0xb4500>
    <b4802>   DW_AT_data_member_location: 40
 <2><b4803>: Abbrev Number: 2 (DW_TAG_member)
    <b4804>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b4808>   DW_AT_decl_file   : 10
    <b4809>   DW_AT_decl_line   : 100
    <b480a>   DW_AT_decl_column : 23
    <b480b>   DW_AT_type        : <0xb4518>
    <b480f>   DW_AT_data_member_location: 48
 <2><b4810>: Abbrev Number: 2 (DW_TAG_member)
    <b4811>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b4815>   DW_AT_decl_file   : 10
    <b4816>   DW_AT_decl_line   : 101
    <b4817>   DW_AT_decl_column : 23
    <b4818>   DW_AT_type        : <0xb453d>
    <b481c>   DW_AT_data_member_location: 56
 <2><b481d>: Abbrev Number: 2 (DW_TAG_member)
    <b481e>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b4822>   DW_AT_decl_file   : 10
    <b4823>   DW_AT_decl_line   : 102
    <b4824>   DW_AT_decl_column : 23
    <b4825>   DW_AT_type        : <0xb4549>
    <b4829>   DW_AT_data_member_location: 64
 <2><b482a>: Abbrev Number: 2 (DW_TAG_member)
    <b482b>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b482f>   DW_AT_decl_file   : 10
    <b4830>   DW_AT_decl_line   : 103
    <b4831>   DW_AT_decl_column : 23
    <b4832>   DW_AT_type        : <0xb4555>
    <b4836>   DW_AT_data_member_location: 72
 <2><b4837>: Abbrev Number: 2 (DW_TAG_member)
    <b4838>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b483c>   DW_AT_decl_file   : 10
    <b483d>   DW_AT_decl_line   : 104
    <b483e>   DW_AT_decl_column : 23
    <b483f>   DW_AT_type        : <0xb457b>
    <b4843>   DW_AT_data_member_location: 80
 <2><b4844>: Abbrev Number: 2 (DW_TAG_member)
    <b4845>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b4849>   DW_AT_decl_file   : 10
    <b484a>   DW_AT_decl_line   : 105
    <b484b>   DW_AT_decl_column : 24
    <b484c>   DW_AT_type        : <0xb45b1>
    <b4850>   DW_AT_data_member_location: 88
 <2><b4851>: Abbrev Number: 2 (DW_TAG_member)
    <b4852>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b4856>   DW_AT_decl_file   : 10
    <b4857>   DW_AT_decl_line   : 106
    <b4858>   DW_AT_decl_column : 25
    <b4859>   DW_AT_type        : <0xb45d7>
    <b485d>   DW_AT_data_member_location: 96
 <2><b485e>: Abbrev Number: 2 (DW_TAG_member)
    <b485f>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b4863>   DW_AT_decl_file   : 10
    <b4864>   DW_AT_decl_line   : 107
    <b4865>   DW_AT_decl_column : 23
    <b4866>   DW_AT_type        : <0xb45fd>
    <b486a>   DW_AT_data_member_location: 104
 <2><b486b>: Abbrev Number: 2 (DW_TAG_member)
    <b486c>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b4870>   DW_AT_decl_file   : 10
    <b4871>   DW_AT_decl_line   : 108
    <b4872>   DW_AT_decl_column : 23
    <b4873>   DW_AT_type        : <0xb468f>
    <b4877>   DW_AT_data_member_location: 112
 <2><b4878>: Abbrev Number: 2 (DW_TAG_member)
    <b4879>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b487d>   DW_AT_decl_file   : 10
    <b487e>   DW_AT_decl_line   : 109
    <b487f>   DW_AT_decl_column : 23
    <b4880>   DW_AT_type        : <0xb46af>
    <b4884>   DW_AT_data_member_location: 120
 <2><b4885>: Abbrev Number: 2 (DW_TAG_member)
    <b4886>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b488a>   DW_AT_decl_file   : 10
    <b488b>   DW_AT_decl_line   : 110
    <b488c>   DW_AT_decl_column : 23
    <b488d>   DW_AT_type        : <0xb46e3>
    <b4891>   DW_AT_data_member_location: 128
 <2><b4892>: Abbrev Number: 2 (DW_TAG_member)
    <b4893>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b4897>   DW_AT_decl_file   : 10
    <b4898>   DW_AT_decl_line   : 111
    <b4899>   DW_AT_decl_column : 23
    <b489a>   DW_AT_type        : <0xb4712>
    <b489e>   DW_AT_data_member_location: 136
 <2><b489f>: Abbrev Number: 2 (DW_TAG_member)
    <b48a0>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b48a4>   DW_AT_decl_file   : 10
    <b48a5>   DW_AT_decl_line   : 112
    <b48a6>   DW_AT_decl_column : 23
    <b48a7>   DW_AT_type        : <0xb4732>
    <b48ab>   DW_AT_data_member_location: 144
 <2><b48ac>: Abbrev Number: 2 (DW_TAG_member)
    <b48ad>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b48b1>   DW_AT_decl_file   : 10
    <b48b2>   DW_AT_decl_line   : 113
    <b48b3>   DW_AT_decl_column : 25
    <b48b4>   DW_AT_type        : <0xb450c>
    <b48b8>   DW_AT_data_member_location: 152
 <2><b48b9>: Abbrev Number: 2 (DW_TAG_member)
    <b48ba>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b48be>   DW_AT_decl_file   : 10
    <b48bf>   DW_AT_decl_line   : 114
    <b48c0>   DW_AT_decl_column : 24
    <b48c1>   DW_AT_type        : <0xb4622>
    <b48c5>   DW_AT_data_member_location: 160
 <2><b48c6>: Abbrev Number: 2 (DW_TAG_member)
    <b48c7>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <b48cb>   DW_AT_decl_file   : 10
    <b48cc>   DW_AT_decl_line   : 115
    <b48cd>   DW_AT_decl_column : 25
    <b48ce>   DW_AT_type        : <0xb465b>
    <b48d2>   DW_AT_data_member_location: 168
 <2><b48d3>: Abbrev Number: 2 (DW_TAG_member)
    <b48d4>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <b48d8>   DW_AT_decl_file   : 10
    <b48d9>   DW_AT_decl_line   : 116
    <b48da>   DW_AT_decl_column : 23
    <b48db>   DW_AT_type        : <0xb4587>
    <b48df>   DW_AT_data_member_location: 176
 <2><b48e0>: Abbrev Number: 2 (DW_TAG_member)
    <b48e1>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <b48e5>   DW_AT_decl_file   : 10
    <b48e6>   DW_AT_decl_line   : 117
    <b48e7>   DW_AT_decl_column : 23
    <b48e8>   DW_AT_type        : <0xb4757>
    <b48ec>   DW_AT_data_member_location: 184
 <2><b48ed>: Abbrev Number: 2 (DW_TAG_member)
    <b48ee>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <b48f2>   DW_AT_decl_file   : 10
    <b48f3>   DW_AT_decl_line   : 118
    <b48f4>   DW_AT_decl_column : 22
    <b48f5>   DW_AT_type        : <0xb4763>
    <b48f9>   DW_AT_data_member_location: 192
 <2><b48fa>: Abbrev Number: 2 (DW_TAG_member)
    <b48fb>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <b48ff>   DW_AT_decl_file   : 10
    <b4900>   DW_AT_decl_line   : 119
    <b4901>   DW_AT_decl_column : 23
    <b4902>   DW_AT_type        : <0xb476f>
    <b4906>   DW_AT_data_member_location: 200
 <2><b4907>: Abbrev Number: 2 (DW_TAG_member)
    <b4908>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <b490c>   DW_AT_decl_file   : 10
    <b490d>   DW_AT_decl_line   : 120
    <b490e>   DW_AT_decl_column : 22
    <b490f>   DW_AT_type        : <0xb477b>
    <b4913>   DW_AT_data_member_location: 208
 <2><b4914>: Abbrev Number: 2 (DW_TAG_member)
    <b4915>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <b4919>   DW_AT_decl_file   : 10
    <b491a>   DW_AT_decl_line   : 121
    <b491b>   DW_AT_decl_column : 23
    <b491c>   DW_AT_type        : <0xb4787>
    <b4920>   DW_AT_data_member_location: 216
 <2><b4921>: Abbrev Number: 0
 <1><b4922>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4923>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b4927>   DW_AT_decl_file   : 10
    <b4928>   DW_AT_decl_line   : 122
    <b4929>   DW_AT_decl_column : 3
    <b492a>   DW_AT_type        : <0xb47a8>
 <1><b492e>: Abbrev Number: 45 (DW_TAG_structure_type)
    <b492f>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <b4933>   DW_AT_byte_size   : 20848
    <b4935>   DW_AT_decl_file   : 11
    <b4936>   DW_AT_decl_line   : 349
    <b4938>   DW_AT_decl_column : 16
    <b4939>   DW_AT_sibling     : <0xb49ae>
 <2><b493d>: Abbrev Number: 14 (DW_TAG_member)
    <b493e>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <b4942>   DW_AT_decl_file   : 11
    <b4942>   DW_AT_decl_line   : 350
    <b4944>   DW_AT_decl_column : 18
    <b4944>   DW_AT_type        : <0xb3e78>
    <b4948>   DW_AT_data_member_location: 0
 <2><b4949>: Abbrev Number: 14 (DW_TAG_member)
    <b494a>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <b494e>   DW_AT_decl_file   : 11
    <b494e>   DW_AT_decl_line   : 351
    <b4950>   DW_AT_decl_column : 18
    <b4950>   DW_AT_type        : <0xb3f10>
    <b4954>   DW_AT_data_member_location: 8
 <2><b4955>: Abbrev Number: 14 (DW_TAG_member)
    <b4956>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <b495a>   DW_AT_decl_file   : 11
    <b495a>   DW_AT_decl_line   : 352
    <b495c>   DW_AT_decl_column : 18
    <b495c>   DW_AT_type        : <0xb3fde>
    <b4960>   DW_AT_data_member_location: 16
 <2><b4961>: Abbrev Number: 14 (DW_TAG_member)
    <b4962>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <b4966>   DW_AT_decl_file   : 11
    <b4966>   DW_AT_decl_line   : 353
    <b4968>   DW_AT_decl_column : 18
    <b4968>   DW_AT_type        : <0xb3ea0>
    <b496c>   DW_AT_data_member_location: 40
 <2><b496d>: Abbrev Number: 14 (DW_TAG_member)
    <b496e>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b4972>   DW_AT_decl_file   : 11
    <b4972>   DW_AT_decl_line   : 354
    <b4974>   DW_AT_decl_column : 18
    <b4974>   DW_AT_type        : <0xb4922>
    <b4978>   DW_AT_data_member_location: 48
 <2><b4979>: Abbrev Number: 15 (DW_TAG_member)
    <b497a>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <b497e>   DW_AT_decl_file   : 11
    <b497e>   DW_AT_decl_line   : 355
    <b4980>   DW_AT_decl_column : 18
    <b4980>   DW_AT_type        : <0xb49ae>
    <b4984>   DW_AT_data_member_location: 272
 <2><b4986>: Abbrev Number: 15 (DW_TAG_member)
    <b4987>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <b498b>   DW_AT_decl_file   : 11
    <b498b>   DW_AT_decl_line   : 356
    <b498d>   DW_AT_decl_column : 18
    <b498d>   DW_AT_type        : <0xb3e78>
    <b4991>   DW_AT_data_member_location: 20832
 <2><b4993>: Abbrev Number: 15 (DW_TAG_member)
    <b4994>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <b4998>   DW_AT_decl_file   : 11
    <b4998>   DW_AT_decl_line   : 357
    <b499a>   DW_AT_decl_column : 18
    <b499a>   DW_AT_type        : <0xb3e78>
    <b499e>   DW_AT_data_member_location: 20836
 <2><b49a0>: Abbrev Number: 15 (DW_TAG_member)
    <b49a1>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <b49a5>   DW_AT_decl_file   : 11
    <b49a5>   DW_AT_decl_line   : 358
    <b49a7>   DW_AT_decl_column : 18
    <b49a7>   DW_AT_type        : <0xb3fa3>
    <b49ab>   DW_AT_data_member_location: 20840
 <2><b49ad>: Abbrev Number: 0
 <1><b49ae>: Abbrev Number: 23 (DW_TAG_array_type)
    <b49af>   DW_AT_type        : <0xb43bc>
    <b49b3>   DW_AT_sibling     : <0xb49bf>
 <2><b49b7>: Abbrev Number: 46 (DW_TAG_subrange_type)
    <b49b8>   DW_AT_type        : <0xb3e63>
    <b49bc>   DW_AT_upper_bound : 256
 <2><b49be>: Abbrev Number: 0
 <1><b49bf>: Abbrev Number: 22 (DW_TAG_typedef)
    <b49c0>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <b49c4>   DW_AT_decl_file   : 11
    <b49c5>   DW_AT_decl_line   : 359
    <b49c7>   DW_AT_decl_column : 3
    <b49c8>   DW_AT_type        : <0xb492e>
 <1><b49cc>: Abbrev Number: 47 (DW_TAG_variable)
    <b49cd>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <b49d1>   DW_AT_decl_file   : 11
    <b49d2>   DW_AT_decl_line   : 361
    <b49d4>   DW_AT_decl_column : 21
    <b49d5>   DW_AT_type        : <0xb49bf>
    <b49d9>   DW_AT_external    : 1
    <b49d9>   DW_AT_declaration : 1
 <1><b49d9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <b49da>   DW_AT_external    : 1
    <b49da>   DW_AT_name        : (indirect string, offset: 0x1a955): memcpy
    <b49de>   DW_AT_decl_file   : 12
    <b49df>   DW_AT_decl_line   : 43
    <b49e0>   DW_AT_decl_column : 14
    <b49e1>   DW_AT_prototyped  : 1
    <b49e1>   DW_AT_type        : <0xb3e92>
    <b49e5>   DW_AT_declaration : 1
    <b49e5>   DW_AT_sibling     : <0xb49f9>
 <2><b49e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b49ea>   DW_AT_type        : <0xb3e92>
 <2><b49ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b49ef>   DW_AT_type        : <0xb3f05>
 <2><b49f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b49f4>   DW_AT_type        : <0xb3eb1>
 <2><b49f8>: Abbrev Number: 0
 <1><b49f9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <b49fa>   DW_AT_external    : 1
    <b49fa>   DW_AT_name        : (indirect string, offset: 0x19e10): memmove
    <b49fe>   DW_AT_decl_file   : 12
    <b49ff>   DW_AT_decl_line   : 47
    <b4a00>   DW_AT_decl_column : 14
    <b4a01>   DW_AT_prototyped  : 1
    <b4a01>   DW_AT_type        : <0xb3e92>
    <b4a05>   DW_AT_declaration : 1
    <b4a05>   DW_AT_sibling     : <0xb4a19>
 <2><b4a09>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4a0a>   DW_AT_type        : <0xb3e92>
 <2><b4a0e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4a0f>   DW_AT_type        : <0xb3f05>
 <2><b4a13>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4a14>   DW_AT_type        : <0xb3eb1>
 <2><b4a18>: Abbrev Number: 0
 <1><b4a19>: Abbrev Number: 18 (DW_TAG_subprogram)
    <b4a1a>   DW_AT_external    : 1
    <b4a1a>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <b4a1e>   DW_AT_decl_file   : 7
    <b4a1f>   DW_AT_decl_line   : 50
    <b4a20>   DW_AT_decl_column : 22
    <b4a21>   DW_AT_prototyped  : 1
    <b4a21>   DW_AT_type        : <0xb3e78>
    <b4a25>   DW_AT_declaration : 1
    <b4a25>   DW_AT_sibling     : <0xb4a2f>
 <2><b4a29>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4a2a>   DW_AT_type        : <0xb3e78>
 <2><b4a2e>: Abbrev Number: 0
 <1><b4a2f>: Abbrev Number: 48 (DW_TAG_subprogram)
    <b4a30>   DW_AT_external    : 1
    <b4a30>   DW_AT_name        : (indirect string, offset: 0x1b56d): fb_FilePutBack
    <b4a34>   DW_AT_decl_file   : 1
    <b4a35>   DW_AT_decl_line   : 57
    <b4a36>   DW_AT_decl_column : 12
    <b4a37>   DW_AT_prototyped  : 1
    <b4a37>   DW_AT_type        : <0xb3e78>
    <b4a3b>   DW_AT_low_pc      : 0x4713f0
    <b4a43>   DW_AT_high_pc     : 0x2e0
    <b4a4b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4a4d>   DW_AT_call_all_calls: 1
    <b4a4d>   DW_AT_sibling     : <0xb4bbd>
 <2><b4a51>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b4a52>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <b4a56>   DW_AT_decl_file   : 1
    <b4a56>   DW_AT_decl_line   : 57
    <b4a56>   DW_AT_decl_column : 32
    <b4a57>   DW_AT_type        : <0xb3e78>
    <b4a5b>   DW_AT_location    : 0x396f1 (location list)
    <b4a5f>   DW_AT_GNU_locviews: 0x396e3
 <2><b4a63>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b4a64>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b4a68>   DW_AT_decl_file   : 1
    <b4a68>   DW_AT_decl_line   : 57
    <b4a68>   DW_AT_decl_column : 50
    <b4a69>   DW_AT_type        : <0xb3f05>
    <b4a6d>   DW_AT_location    : 0x3973c (location list)
    <b4a71>   DW_AT_GNU_locviews: 0x3972e
 <2><b4a75>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b4a76>   DW_AT_name        : (indirect string, offset: 0x1d448): length
    <b4a7a>   DW_AT_decl_file   : 1
    <b4a7a>   DW_AT_decl_line   : 57
    <b4a7a>   DW_AT_decl_column : 63
    <b4a7b>   DW_AT_type        : <0xb3eb1>
    <b4a7f>   DW_AT_location    : 0x39782 (location list)
    <b4a83>   DW_AT_GNU_locviews: 0x39774
 <2><b4a87>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <b4a88>   DW_AT_abstract_origin: <0xb4bbd>
    <b4a8c>   DW_AT_entry_pc    : 0x471433
    <b4a94>   DW_AT_GNU_entry_view: 0
    <b4a95>   DW_AT_ranges      : 0x17ffb
    <b4a99>   DW_AT_call_file   : 1
    <b4a99>   DW_AT_call_line   : 59
    <b4a9a>   DW_AT_call_column : 12
 <3><b4a9b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4a9c>   DW_AT_abstract_origin: <0xb4be4>
    <b4aa0>   DW_AT_location    : 0x397c4 (location list)
    <b4aa4>   DW_AT_GNU_locviews: 0x397ba
 <3><b4aa8>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4aa9>   DW_AT_abstract_origin: <0xb4bd8>
    <b4aad>   DW_AT_location    : 0x397f4 (location list)
    <b4ab1>   DW_AT_GNU_locviews: 0x397e8
 <3><b4ab5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4ab6>   DW_AT_abstract_origin: <0xb4bce>
    <b4aba>   DW_AT_location    : 0x3982a (location list)
    <b4abe>   DW_AT_GNU_locviews: 0x39822
 <3><b4ac2>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <b4ac3>   DW_AT_ranges      : 0x17ffb
 <4><b4ac7>: Abbrev Number: 16 (DW_TAG_variable)
    <b4ac8>   DW_AT_abstract_origin: <0xb4bee>
 <4><b4acc>: Abbrev Number: 16 (DW_TAG_variable)
    <b4acd>   DW_AT_abstract_origin: <0xb4bf9>
 <4><b4ad1>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <b4ad2>   DW_AT_abstract_origin: <0xb4bbd>
    <b4ad6>   DW_AT_entry_pc    : 0x47145f
    <b4ade>   DW_AT_GNU_entry_view: 0
    <b4adf>   DW_AT_ranges      : 0x18015
    <b4ae3>   DW_AT_call_file   : 1
    <b4ae3>   DW_AT_call_line   : 5
    <b4ae4>   DW_AT_call_column : 5
 <5><b4ae5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4ae6>   DW_AT_abstract_origin: <0xb4be4>
    <b4aea>   DW_AT_location    : 0x39877 (location list)
    <b4aee>   DW_AT_GNU_locviews: 0x39847
 <5><b4af2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4af3>   DW_AT_abstract_origin: <0xb4bd8>
    <b4af7>   DW_AT_location    : 0x39959 (location list)
    <b4afb>   DW_AT_GNU_locviews: 0x3994f
 <5><b4aff>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4b00>   DW_AT_abstract_origin: <0xb4bce>
    <b4b04>   DW_AT_location    : 0x39986 (location list)
    <b4b08>   DW_AT_GNU_locviews: 0x39980
 <5><b4b0c>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <b4b0d>   DW_AT_ranges      : 0x18015
 <6><b4b11>: Abbrev Number: 10 (DW_TAG_variable)
    <b4b12>   DW_AT_abstract_origin: <0xb4bee>
    <b4b16>   DW_AT_location    : 0x399a4 (location list)
    <b4b1a>   DW_AT_GNU_locviews: 0x3999c
 <6><b4b1e>: Abbrev Number: 10 (DW_TAG_variable)
    <b4b1f>   DW_AT_abstract_origin: <0xb4bf9>
    <b4b23>   DW_AT_location    : 0x399c7 (location list)
    <b4b27>   DW_AT_GNU_locviews: 0x399c1
 <6><b4b2b>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <b4b2c>   DW_AT_abstract_origin: <0xb4c04>
    <b4b30>   DW_AT_ranges      : 0x1802a
    <b4b34>   DW_AT_sibling     : <0xb4b53>
 <7><b4b38>: Abbrev Number: 10 (DW_TAG_variable)
    <b4b39>   DW_AT_abstract_origin: <0xb4c05>
    <b4b3d>   DW_AT_location    : 0x39a07 (location list)
    <b4b41>   DW_AT_GNU_locviews: 0x399dd
 <7><b4b45>: Abbrev Number: 10 (DW_TAG_variable)
    <b4b46>   DW_AT_abstract_origin: <0xb4c10>
    <b4b4a>   DW_AT_location    : 0x39b02 (location list)
    <b4b4e>   DW_AT_GNU_locviews: 0x39ad8
 <7><b4b52>: Abbrev Number: 0
 <6><b4b53>: Abbrev Number: 17 (DW_TAG_call_site)
    <b4b54>   DW_AT_call_return_pc: 0x47146e
    <b4b5c>   DW_AT_call_origin : <0xb4a19>
    <b4b60>   DW_AT_sibling     : <0xb4b6a>
 <7><b4b64>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4b65>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4b67>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <7><b4b69>: Abbrev Number: 0
 <6><b4b6a>: Abbrev Number: 31 (DW_TAG_call_site)
    <b4b6b>   DW_AT_call_return_pc: 0x471670
    <b4b73>   DW_AT_call_tail_call: 1
    <b4b73>   DW_AT_call_origin : <0xb4a19>
 <6><b4b77>: Abbrev Number: 17 (DW_TAG_call_site)
    <b4b78>   DW_AT_call_return_pc: 0x47168e
    <b4b80>   DW_AT_call_origin : <0xb4d6b>
    <b4b84>   DW_AT_sibling     : <0xb4b9b>
 <7><b4b88>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4b89>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4b8b>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <7><b4b8e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4b8f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b4b91>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <7><b4b94>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4b95>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b4b97>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <7><b4b9a>: Abbrev Number: 0
 <6><b4b9b>: Abbrev Number: 32 (DW_TAG_call_site)
    <b4b9c>   DW_AT_call_return_pc: 0x47169c
    <b4ba4>   DW_AT_call_origin : <0xb49f9>
 <7><b4ba8>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4ba9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4bab>   DW_AT_call_value  : 5 byte block: 7f 0 7d 0 22 	(DW_OP_breg15 (r15): 0; DW_OP_breg13 (r13): 0; DW_OP_plus)
 <7><b4bb1>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4bb2>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b4bb4>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <7><b4bb7>: Abbrev Number: 0
 <6><b4bb8>: Abbrev Number: 0
 <5><b4bb9>: Abbrev Number: 0
 <4><b4bba>: Abbrev Number: 0
 <3><b4bbb>: Abbrev Number: 0
 <2><b4bbc>: Abbrev Number: 0
 <1><b4bbd>: Abbrev Number: 49 (DW_TAG_subprogram)
    <b4bbe>   DW_AT_external    : 1
    <b4bbe>   DW_AT_name        : (indirect string, offset: 0x1b474): fb_FilePutBackEx
    <b4bc2>   DW_AT_decl_file   : 1
    <b4bc3>   DW_AT_decl_line   : 5
    <b4bc4>   DW_AT_decl_column : 5
    <b4bc5>   DW_AT_prototyped  : 1
    <b4bc5>   DW_AT_type        : <0xb3e78>
    <b4bc9>   DW_AT_inline      : 1	(inlined)
    <b4bca>   DW_AT_sibling     : <0xb4c1d>
 <2><b4bce>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <b4bcf>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <b4bd3>   DW_AT_decl_file   : 1
    <b4bd3>   DW_AT_decl_line   : 5
    <b4bd3>   DW_AT_decl_column : 32
    <b4bd4>   DW_AT_type        : <0xb43c8>
 <2><b4bd8>: Abbrev Number: 50 (DW_TAG_formal_parameter)
    <b4bd9>   DW_AT_name        : src
    <b4bdd>   DW_AT_decl_file   : 1
    <b4bde>   DW_AT_decl_line   : 5
    <b4bdf>   DW_AT_decl_column : 52
    <b4be0>   DW_AT_type        : <0xb3f05>
 <2><b4be4>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <b4be5>   DW_AT_name        : (indirect string, offset: 0x1c247): chars
    <b4be9>   DW_AT_decl_file   : 1
    <b4be9>   DW_AT_decl_line   : 5
    <b4be9>   DW_AT_decl_column : 64
    <b4bea>   DW_AT_type        : <0xb3eb1>
 <2><b4bee>: Abbrev Number: 34 (DW_TAG_variable)
    <b4bef>   DW_AT_name        : res
    <b4bf3>   DW_AT_decl_file   : 1
    <b4bf3>   DW_AT_decl_line   : 7
    <b4bf4>   DW_AT_decl_column : 6
    <b4bf5>   DW_AT_type        : <0xb3e78>
 <2><b4bf9>: Abbrev Number: 35 (DW_TAG_variable)
    <b4bfa>   DW_AT_name        : (indirect string, offset: 0x1dd07): bytes
    <b4bfe>   DW_AT_decl_file   : 1
    <b4bfe>   DW_AT_decl_line   : 8
    <b4bff>   DW_AT_decl_column : 9
    <b4c00>   DW_AT_type        : <0xb3eb1>
 <2><b4c04>: Abbrev Number: 51 (DW_TAG_lexical_block)
 <3><b4c05>: Abbrev Number: 34 (DW_TAG_variable)
    <b4c06>   DW_AT_name        : dst
    <b4c0a>   DW_AT_decl_file   : 1
    <b4c0a>   DW_AT_decl_line   : 43
    <b4c0b>   DW_AT_decl_column : 17
    <b4c0c>   DW_AT_type        : <0xb3ff8>
 <3><b4c10>: Abbrev Number: 35 (DW_TAG_variable)
    <b4c11>   DW_AT_name        : (indirect string, offset: 0x1b57c): patch
    <b4c15>   DW_AT_decl_file   : 1
    <b4c15>   DW_AT_decl_line   : 44
    <b4c16>   DW_AT_decl_column : 19
    <b4c17>   DW_AT_type        : <0xb3f0b>
 <3><b4c1b>: Abbrev Number: 0
 <2><b4c1c>: Abbrev Number: 0
 <1><b4c1d>: Abbrev Number: 52 (DW_TAG_subprogram)
    <b4c1e>   DW_AT_abstract_origin: <0xb4bbd>
    <b4c22>   DW_AT_low_pc      : 0x471140
    <b4c2a>   DW_AT_high_pc     : 0x2a2
    <b4c32>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4c34>   DW_AT_call_all_calls: 1
    <b4c34>   DW_AT_sibling     : <0xb4d6b>
 <2><b4c38>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c39>   DW_AT_abstract_origin: <0xb4bce>
    <b4c3d>   DW_AT_location    : 0x39bd7 (location list)
    <b4c41>   DW_AT_GNU_locviews: 0x39bc5
 <2><b4c45>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c46>   DW_AT_abstract_origin: <0xb4bd8>
    <b4c4a>   DW_AT_location    : 0x39c2f (location list)
    <b4c4e>   DW_AT_GNU_locviews: 0x39c1f
 <2><b4c52>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c53>   DW_AT_abstract_origin: <0xb4be4>
    <b4c57>   DW_AT_location    : 0x39c7e (location list)
    <b4c5b>   DW_AT_GNU_locviews: 0x39c6e
 <2><b4c5f>: Abbrev Number: 16 (DW_TAG_variable)
    <b4c60>   DW_AT_abstract_origin: <0xb4bee>
 <2><b4c64>: Abbrev Number: 16 (DW_TAG_variable)
    <b4c65>   DW_AT_abstract_origin: <0xb4bf9>
 <2><b4c69>: Abbrev Number: 53 (DW_TAG_inlined_subroutine)
    <b4c6a>   DW_AT_abstract_origin: <0xb4bbd>
    <b4c6e>   DW_AT_entry_pc    : 0x471172
    <b4c76>   DW_AT_GNU_entry_view: 1
    <b4c77>   DW_AT_ranges      : 0x17fd0
    <b4c7b>   DW_AT_call_file   : 1
    <b4c7c>   DW_AT_call_line   : 5
    <b4c7d>   DW_AT_call_column : 5
    <b4c7e>   DW_AT_sibling     : <0xb4d57>
 <3><b4c82>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c83>   DW_AT_abstract_origin: <0xb4be4>
    <b4c87>   DW_AT_location    : 0x39ced (location list)
    <b4c8b>   DW_AT_GNU_locviews: 0x39cbd
 <3><b4c8f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c90>   DW_AT_abstract_origin: <0xb4bd8>
    <b4c94>   DW_AT_location    : 0x39dca (location list)
    <b4c98>   DW_AT_GNU_locviews: 0x39dc0
 <3><b4c9c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b4c9d>   DW_AT_abstract_origin: <0xb4bce>
    <b4ca1>   DW_AT_location    : 0x39df4 (location list)
    <b4ca5>   DW_AT_GNU_locviews: 0x39dee
 <3><b4ca9>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <b4caa>   DW_AT_ranges      : 0x17fdf
 <4><b4cae>: Abbrev Number: 10 (DW_TAG_variable)
    <b4caf>   DW_AT_abstract_origin: <0xb4bee>
    <b4cb3>   DW_AT_location    : 0x39e11 (location list)
    <b4cb7>   DW_AT_GNU_locviews: 0x39e09
 <4><b4cbb>: Abbrev Number: 10 (DW_TAG_variable)
    <b4cbc>   DW_AT_abstract_origin: <0xb4bf9>
    <b4cc0>   DW_AT_location    : 0x39e31 (location list)
    <b4cc4>   DW_AT_GNU_locviews: 0x39e2b
 <4><b4cc8>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <b4cc9>   DW_AT_abstract_origin: <0xb4c04>
    <b4ccd>   DW_AT_ranges      : 0x17ff1
    <b4cd1>   DW_AT_sibling     : <0xb4cf0>
 <5><b4cd5>: Abbrev Number: 10 (DW_TAG_variable)
    <b4cd6>   DW_AT_abstract_origin: <0xb4c05>
    <b4cda>   DW_AT_location    : 0x39e70 (location list)
    <b4cde>   DW_AT_GNU_locviews: 0x39e46
 <5><b4ce2>: Abbrev Number: 10 (DW_TAG_variable)
    <b4ce3>   DW_AT_abstract_origin: <0xb4c10>
    <b4ce7>   DW_AT_location    : 0x39f6a (location list)
    <b4ceb>   DW_AT_GNU_locviews: 0x39f40
 <5><b4cef>: Abbrev Number: 0
 <4><b4cf0>: Abbrev Number: 17 (DW_TAG_call_site)
    <b4cf1>   DW_AT_call_return_pc: 0x471177
    <b4cf9>   DW_AT_call_origin : <0xb4a19>
    <b4cfd>   DW_AT_sibling     : <0xb4d07>
 <5><b4d01>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d02>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4d04>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><b4d06>: Abbrev Number: 0
 <4><b4d07>: Abbrev Number: 31 (DW_TAG_call_site)
    <b4d08>   DW_AT_call_return_pc: 0x471388
    <b4d10>   DW_AT_call_tail_call: 1
    <b4d10>   DW_AT_call_origin : <0xb4a19>
 <4><b4d14>: Abbrev Number: 17 (DW_TAG_call_site)
    <b4d15>   DW_AT_call_return_pc: 0x47139e
    <b4d1d>   DW_AT_call_origin : <0xb4d6b>
    <b4d21>   DW_AT_sibling     : <0xb4d38>
 <5><b4d25>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d26>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4d28>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><b4d2b>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d2c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b4d2e>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><b4d31>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d32>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b4d34>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><b4d37>: Abbrev Number: 0
 <4><b4d38>: Abbrev Number: 32 (DW_TAG_call_site)
    <b4d39>   DW_AT_call_return_pc: 0x4713ac
    <b4d41>   DW_AT_call_origin : <0xb49f9>
 <5><b4d45>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d46>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4d48>   DW_AT_call_value  : 5 byte block: 7f 0 7c 0 22 	(DW_OP_breg15 (r15): 0; DW_OP_breg12 (r12): 0; DW_OP_plus)
 <5><b4d4e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d4f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b4d51>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><b4d54>: Abbrev Number: 0
 <4><b4d55>: Abbrev Number: 0
 <3><b4d56>: Abbrev Number: 0
 <2><b4d57>: Abbrev Number: 54 (DW_TAG_call_site)
    <b4d58>   DW_AT_call_return_pc: 0x4713e2
    <b4d60>   DW_AT_call_tail_call: 1
    <b4d60>   DW_AT_call_origin : <0xb4a19>
 <3><b4d64>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <b4d65>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b4d67>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><b4d69>: Abbrev Number: 0
 <2><b4d6a>: Abbrev Number: 0
 <1><b4d6b>: Abbrev Number: 55 (DW_TAG_subprogram)
    <b4d6c>   DW_AT_external    : 1
    <b4d6c>   DW_AT_declaration : 1
    <b4d6c>   DW_AT_linkage_name: (indirect string, offset: 0x1a955): memcpy
    <b4d70>   DW_AT_name        : (indirect string, offset: 0x1a94b): __builtin_memcpy
    <b4d74>   DW_AT_decl_file   : 13
    <b4d75>   DW_AT_decl_line   : 0
 <1><b4d76>: Abbrev Number: 0
  Compilation Unit @ offset 0xb4d77:
   Length:        0xbdd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xc879
   Pointer Size:  8
 <0><b4d83>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <b4d84>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <b4d88>   DW_AT_language    : 29	(C11)
    <b4d89>   DW_AT_name        : (indirect line string, offset: 0xd21): src/rtlib/file_reset.c
    <b4d8d>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <b4d91>   DW_AT_low_pc      : 0x4716d0
    <b4d99>   DW_AT_high_pc     : 0x5c
    <b4da1>   DW_AT_stmt_list   : 0x6570b
 <1><b4da5>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4da6>   DW_AT_byte_size   : 1
    <b4da7>   DW_AT_encoding    : 8	(unsigned char)
    <b4da8>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><b4dac>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dad>   DW_AT_byte_size   : 2
    <b4dae>   DW_AT_encoding    : 7	(unsigned)
    <b4daf>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><b4db3>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4db4>   DW_AT_byte_size   : 4
    <b4db5>   DW_AT_encoding    : 7	(unsigned)
    <b4db6>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><b4dba>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dbb>   DW_AT_byte_size   : 8
    <b4dbc>   DW_AT_encoding    : 7	(unsigned)
    <b4dbd>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><b4dc1>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dc2>   DW_AT_byte_size   : 1
    <b4dc3>   DW_AT_encoding    : 6	(signed char)
    <b4dc4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><b4dc8>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dc9>   DW_AT_byte_size   : 2
    <b4dca>   DW_AT_encoding    : 5	(signed)
    <b4dcb>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><b4dcf>: Abbrev Number: 21 (DW_TAG_base_type)
    <b4dd0>   DW_AT_byte_size   : 4
    <b4dd1>   DW_AT_encoding    : 5	(signed)
    <b4dd2>   DW_AT_name        : int
 <1><b4dd6>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dd7>   DW_AT_byte_size   : 8
    <b4dd8>   DW_AT_encoding    : 5	(signed)
    <b4dd9>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><b4ddd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4dde>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <b4de2>   DW_AT_decl_file   : 2
    <b4de3>   DW_AT_decl_line   : 153
    <b4de4>   DW_AT_decl_column : 27
    <b4de5>   DW_AT_type        : <0xb4dd6>
 <1><b4de9>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <b4dea>   DW_AT_byte_size   : 8
 <1><b4deb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4dec>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <b4df0>   DW_AT_decl_file   : 2
    <b4df1>   DW_AT_decl_line   : 194
    <b4df2>   DW_AT_decl_column : 27
    <b4df3>   DW_AT_type        : <0xb4dd6>
 <1><b4df7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4df8>   DW_AT_byte_size   : 8
    <b4df8>   DW_AT_type        : <0xb4dfc>
 <1><b4dfc>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4dfd>   DW_AT_byte_size   : 1
    <b4dfe>   DW_AT_encoding    : 6	(signed char)
    <b4dff>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><b4e03>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4e04>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <b4e08>   DW_AT_decl_file   : 3
    <b4e09>   DW_AT_decl_line   : 209
    <b4e0a>   DW_AT_decl_column : 23
    <b4e0b>   DW_AT_type        : <0xb4dba>
 <1><b4e0f>: Abbrev Number: 14 (DW_TAG_typedef)
    <b4e10>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <b4e14>   DW_AT_decl_file   : 3
    <b4e15>   DW_AT_decl_line   : 321
    <b4e17>   DW_AT_decl_column : 24
    <b4e18>   DW_AT_type        : <0xb4dcf>
 <1><b4e1c>: Abbrev Number: 23 (DW_TAG_const_type)
    <b4e1d>   DW_AT_type        : <0xb4e0f>
 <1><b4e21>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4e22>   DW_AT_byte_size   : 8
    <b4e23>   DW_AT_encoding    : 5	(signed)
    <b4e24>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><b4e28>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4e29>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <b4e2d>   DW_AT_decl_file   : 4
    <b4e2e>   DW_AT_decl_line   : 87
    <b4e2f>   DW_AT_decl_column : 19
    <b4e30>   DW_AT_type        : <0xb4ddd>
 <1><b4e34>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4e35>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <b4e39>   DW_AT_decl_file   : 4
    <b4e3a>   DW_AT_decl_line   : 108
    <b4e3b>   DW_AT_decl_column : 19
    <b4e3c>   DW_AT_type        : <0xb4deb>
 <1><b4e40>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4e41>   DW_AT_byte_size   : 8
    <b4e42>   DW_AT_encoding    : 7	(unsigned)
    <b4e43>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><b4e47>: Abbrev Number: 15 (DW_TAG_array_type)
    <b4e48>   DW_AT_type        : <0xb4dfc>
    <b4e4c>   DW_AT_sibling     : <0xb4e57>
 <2><b4e50>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <b4e51>   DW_AT_type        : <0xb4dba>
    <b4e55>   DW_AT_upper_bound : 3
 <2><b4e56>: Abbrev Number: 0
 <1><b4e57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4e58>   DW_AT_byte_size   : 8
    <b4e58>   DW_AT_type        : <0xb4e5c>
 <1><b4e5c>: Abbrev Number: 25 (DW_TAG_const_type)
 <1><b4e5d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4e5e>   DW_AT_byte_size   : 8
    <b4e5e>   DW_AT_type        : <0xb4df7>
 <1><b4e62>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4e63>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <b4e67>   DW_AT_decl_file   : 5
    <b4e68>   DW_AT_decl_line   : 22
    <b4e69>   DW_AT_decl_column : 15
    <b4e6a>   DW_AT_type        : <0xb4e28>
 <1><b4e6e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4e6f>   DW_AT_byte_size   : 8
    <b4e6f>   DW_AT_type        : <0xb4e73>
 <1><b4e73>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <b4e74>   DW_AT_prototyped  : 1
 <1><b4e74>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b4e75>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <b4e79>   DW_AT_byte_size   : 24
    <b4e7a>   DW_AT_decl_file   : 6
    <b4e7b>   DW_AT_decl_line   : 82
    <b4e7c>   DW_AT_decl_column : 16
    <b4e7d>   DW_AT_sibling     : <0xb4ea9>
 <2><b4e81>: Abbrev Number: 2 (DW_TAG_member)
    <b4e82>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b4e86>   DW_AT_decl_file   : 6
    <b4e87>   DW_AT_decl_line   : 83
    <b4e88>   DW_AT_decl_column : 21
    <b4e89>   DW_AT_type        : <0xb4df7>
    <b4e8d>   DW_AT_data_member_location: 0
 <2><b4e8e>: Abbrev Number: 7 (DW_TAG_member)
    <b4e8f>   DW_AT_name        : len
    <b4e93>   DW_AT_decl_file   : 6
    <b4e94>   DW_AT_decl_line   : 84
    <b4e95>   DW_AT_decl_column : 21
    <b4e96>   DW_AT_type        : <0xb4e34>
    <b4e9a>   DW_AT_data_member_location: 8
 <2><b4e9b>: Abbrev Number: 2 (DW_TAG_member)
    <b4e9c>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b4ea0>   DW_AT_decl_file   : 6
    <b4ea1>   DW_AT_decl_line   : 85
    <b4ea2>   DW_AT_decl_column : 21
    <b4ea3>   DW_AT_type        : <0xb4e34>
    <b4ea7>   DW_AT_data_member_location: 16
 <2><b4ea8>: Abbrev Number: 0
 <1><b4ea9>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4eaa>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <b4eae>   DW_AT_decl_file   : 6
    <b4eaf>   DW_AT_decl_line   : 86
    <b4eb0>   DW_AT_decl_column : 3
    <b4eb1>   DW_AT_type        : <0xb4e74>
 <1><b4eb5>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4eb6>   DW_AT_byte_size   : 8
    <b4eb7>   DW_AT_encoding    : 4	(float)
    <b4eb8>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><b4ebc>: Abbrev Number: 6 (DW_TAG_base_type)
    <b4ebd>   DW_AT_byte_size   : 4
    <b4ebe>   DW_AT_encoding    : 4	(float)
    <b4ebf>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><b4ec3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4ec4>   DW_AT_byte_size   : 8
    <b4ec4>   DW_AT_type        : <0xb4e0f>
 <1><b4ec8>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <b4ec9>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <b4ecd>   DW_AT_encoding    : 7	(unsigned)
    <b4ece>   DW_AT_byte_size   : 4
    <b4ecf>   DW_AT_type        : <0xb4db3>
    <b4ed3>   DW_AT_decl_file   : 7
    <b4ed4>   DW_AT_decl_line   : 25
    <b4ed5>   DW_AT_decl_column : 14
    <b4ed6>   DW_AT_sibling     : <0xb4ef3>
 <2><b4eda>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b4edb>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <b4edf>   DW_AT_const_value : 0
 <2><b4ee0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b4ee1>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <b4ee5>   DW_AT_const_value : 1
 <2><b4ee6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b4ee7>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <b4eeb>   DW_AT_const_value : 2
 <2><b4eec>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b4eed>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <b4ef1>   DW_AT_const_value : 3
 <2><b4ef2>: Abbrev Number: 0
 <1><b4ef3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4ef4>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <b4ef8>   DW_AT_decl_file   : 7
    <b4ef9>   DW_AT_decl_line   : 30
    <b4efa>   DW_AT_decl_column : 3
    <b4efb>   DW_AT_type        : <0xb4ec8>
 <1><b4eff>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4f00>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <b4f04>   DW_AT_decl_file   : 7
    <b4f05>   DW_AT_decl_line   : 54
    <b4f06>   DW_AT_decl_column : 15
    <b4f07>   DW_AT_type        : <0xb4f0b>
 <1><b4f0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4f0c>   DW_AT_byte_size   : 8
    <b4f0c>   DW_AT_type        : <0xb4f10>
 <1><b4f10>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <b4f11>   DW_AT_prototyped  : 1
    <b4f11>   DW_AT_type        : <0xb4dcf>
    <b4f15>   DW_AT_sibling     : <0xb4f24>
 <2><b4f19>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4f1a>   DW_AT_type        : <0xb4f24>
 <2><b4f1e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b4f1f>   DW_AT_type        : <0xb4dcf>
 <2><b4f23>: Abbrev Number: 0
 <1><b4f24>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b4f25>   DW_AT_byte_size   : 8
    <b4f25>   DW_AT_type        : <0xb4f29>
 <1><b4f29>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b4f2a>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <b4f2e>   DW_AT_byte_size   : 80
    <b4f2f>   DW_AT_decl_file   : 7
    <b4f30>   DW_AT_decl_line   : 97
    <b4f31>   DW_AT_decl_column : 16
    <b4f32>   DW_AT_sibling     : <0xb4fed>
 <2><b4f36>: Abbrev Number: 2 (DW_TAG_member)
    <b4f37>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b4f3b>   DW_AT_decl_file   : 7
    <b4f3c>   DW_AT_decl_line   : 98
    <b4f3d>   DW_AT_decl_column : 21
    <b4f3e>   DW_AT_type        : <0xb4dcf>
    <b4f42>   DW_AT_data_member_location: 0
 <2><b4f43>: Abbrev Number: 7 (DW_TAG_member)
    <b4f44>   DW_AT_name        : len
    <b4f48>   DW_AT_decl_file   : 7
    <b4f49>   DW_AT_decl_line   : 99
    <b4f4a>   DW_AT_decl_column : 21
    <b4f4b>   DW_AT_type        : <0xb4dcf>
    <b4f4f>   DW_AT_data_member_location: 4
 <2><b4f50>: Abbrev Number: 2 (DW_TAG_member)
    <b4f51>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <b4f55>   DW_AT_decl_file   : 7
    <b4f56>   DW_AT_decl_line   : 100
    <b4f57>   DW_AT_decl_column : 21
    <b4f58>   DW_AT_type        : <0xb4ef3>
    <b4f5c>   DW_AT_data_member_location: 8
 <2><b4f5d>: Abbrev Number: 2 (DW_TAG_member)
    <b4f5e>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b4f62>   DW_AT_decl_file   : 7
    <b4f63>   DW_AT_decl_line   : 101
    <b4f64>   DW_AT_decl_column : 21
    <b4f65>   DW_AT_type        : <0xb4e62>
    <b4f69>   DW_AT_data_member_location: 16
 <2><b4f6a>: Abbrev Number: 2 (DW_TAG_member)
    <b4f6b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b4f6f>   DW_AT_decl_file   : 7
    <b4f70>   DW_AT_decl_line   : 102
    <b4f71>   DW_AT_decl_column : 21
    <b4f72>   DW_AT_type        : <0xb4dcf>
    <b4f76>   DW_AT_data_member_location: 24
 <2><b4f77>: Abbrev Number: 2 (DW_TAG_member)
    <b4f78>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <b4f7c>   DW_AT_decl_file   : 7
