    <c7cc1>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><c7cc4>: Abbrev Number: 0
 <2><c7cc5>: Abbrev Number: 8 (DW_TAG_call_site)
    <c7cc6>   DW_AT_call_return_pc: 0x4730c8
    <c7cce>   DW_AT_call_origin : <0xc810c>
 <2><c7cd2>: Abbrev Number: 0
 <1><c7cd3>: Abbrev Number: 11 (DW_TAG_array_type)
    <c7cd4>   DW_AT_type        : <0xc64b9>
    <c7cd8>   DW_AT_sibling     : <0xc7ce3>
 <2><c7cdc>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <c7cdd>   DW_AT_type        : <0xc63e1>
    <c7ce1>   DW_AT_upper_bound : 6
 <2><c7ce2>: Abbrev Number: 0
 <1><c7ce3>: Abbrev Number: 64 (DW_TAG_subprogram)
    <c7ce4>   DW_AT_name        : (indirect string, offset: 0x1bb48): keyboard_x11_handler
    <c7ce8>   DW_AT_decl_file   : 1
    <c7ce9>   DW_AT_decl_line   : 220
    <c7cea>   DW_AT_decl_column : 13
    <c7ceb>   DW_AT_prototyped  : 1
    <c7ceb>   DW_AT_inline      : 1	(inlined)
    <c7cec>   DW_AT_sibling     : <0xc7d07>
 <2><c7cf0>: Abbrev Number: 65 (DW_TAG_variable)
    <c7cf1>   DW_AT_name        : (indirect string, offset: 0x1889e): keymap
    <c7cf5>   DW_AT_decl_file   : 1
    <c7cf6>   DW_AT_decl_line   : 222
    <c7cf7>   DW_AT_decl_column : 16
    <c7cf8>   DW_AT_type        : <0xc7d07>
 <2><c7cfc>: Abbrev Number: 66 (DW_TAG_variable)
    <c7cfd>   DW_AT_name        : i
    <c7cff>   DW_AT_decl_file   : 1
    <c7d00>   DW_AT_decl_line   : 223
    <c7d01>   DW_AT_decl_column : 6
    <c7d02>   DW_AT_type        : <0xc63f6>

 <1><c8387>: Abbrev Number: 7 (DW_TAG_base_type)
    <c8388>   DW_AT_byte_size   : 2
    <c8389>   DW_AT_encoding    : 7	(unsigned)
    <c838a>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c838e>: Abbrev Number: 7 (DW_TAG_base_type)
    <c838f>   DW_AT_byte_size   : 4
    <c8390>   DW_AT_encoding    : 7	(unsigned)
    <c8391>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c8395>: Abbrev Number: 7 (DW_TAG_base_type)
    <c8396>   DW_AT_byte_size   : 8
    <c8397>   DW_AT_encoding    : 7	(unsigned)
    <c8398>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c839c>: Abbrev Number: 7 (DW_TAG_base_type)
    <c839d>   DW_AT_byte_size   : 1
    <c839e>   DW_AT_encoding    : 6	(signed char)
    <c839f>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c83a3>: Abbrev Number: 7 (DW_TAG_base_type)
    <c83a4>   DW_AT_byte_size   : 2
    <c83a5>   DW_AT_encoding    : 5	(signed)
    <c83a6>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c83aa>: Abbrev Number: 30 (DW_TAG_base_type)
    <c83ab>   DW_AT_byte_size   : 4
    <c83ac>   DW_AT_encoding    : 5	(signed)
    <c83ad>   DW_AT_name        : int
 <1><c83b1>: Abbrev Number: 7 (DW_TAG_base_type)
    <c83b2>   DW_AT_byte_size   : 8
    <c83b3>   DW_AT_encoding    : 5	(signed)
    <c83b4>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c83b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <c83b9>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c83bd>   DW_AT_decl_file   : 2
    <c83be>   DW_AT_decl_line   : 153
    <c83bf>   DW_AT_decl_column : 27
    <c83c0>   DW_AT_type        : <0xc83b1>
 <1><c83c4>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <c83c5>   DW_AT_byte_size   : 8
 <1><c83c6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c83c7>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <c83cb>   DW_AT_decl_file   : 2
    <c83cc>   DW_AT_decl_line   : 194
    <c83cd>   DW_AT_decl_column : 27
    <c83ce>   DW_AT_type        : <0xc83b1>
 <1><c83d2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c83d3>   DW_AT_byte_size   : 8
    <c83d3>   DW_AT_type        : <0xc83d7>
 <1><c83d7>: Abbrev Number: 7 (DW_TAG_base_type)
    <c83d8>   DW_AT_byte_size   : 1
    <c83d9>   DW_AT_encoding    : 6	(signed char)
    <c83da>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c83de>: Abbrev Number: 17 (DW_TAG_const_type)
    <c83df>   DW_AT_type        : <0xc83d7>
 <1><c83e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <c83e4>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c83e8>   DW_AT_decl_file   : 3
    <c83e9>   DW_AT_decl_line   : 209
    <c83ea>   DW_AT_decl_column : 23
    <c83eb>   DW_AT_type        : <0xc8395>
 <1><c83ef>: Abbrev Number: 18 (DW_TAG_typedef)
    <c83f0>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <c83f4>   DW_AT_decl_file   : 3
    <c83f5>   DW_AT_decl_line   : 321
    <c83f7>   DW_AT_decl_column : 24
    <c83f8>   DW_AT_type        : <0xc83aa>
 <1><c83fc>: Abbrev Number: 17 (DW_TAG_const_type)
    <c83fd>   DW_AT_type        : <0xc83ef>
 <1><c8401>: Abbrev Number: 7 (DW_TAG_base_type)
    <c8402>   DW_AT_byte_size   : 8
    <c8403>   DW_AT_encoding    : 5	(signed)
    <c8404>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c8408>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8409>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <c840d>   DW_AT_decl_file   : 4
    <c840e>   DW_AT_decl_line   : 87
    <c840f>   DW_AT_decl_column : 19
    <c8410>   DW_AT_type        : <0xc83b8>
 <1><c8414>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8415>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <c8419>   DW_AT_decl_file   : 4
    <c841a>   DW_AT_decl_line   : 108
    <c841b>   DW_AT_decl_column : 19
    <c841c>   DW_AT_type        : <0xc83c6>
 <1><c8420>: Abbrev Number: 7 (DW_TAG_base_type)
    <c8421>   DW_AT_byte_size   : 8
    <c8422>   DW_AT_encoding    : 7	(unsigned)
    <c8423>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c8427>: Abbrev Number: 19 (DW_TAG_array_type)
    <c8428>   DW_AT_type        : <0xc83d7>
    <c842c>   DW_AT_sibling     : <0xc8437>
 <2><c8430>: Abbrev Number: 32 (DW_TAG_subrange_type)
    <c8431>   DW_AT_type        : <0xc8395>
    <c8435>   DW_AT_upper_bound : 3
 <2><c8436>: Abbrev Number: 0
 <1><c8437>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8438>   DW_AT_byte_size   : 8
    <c8438>   DW_AT_type        : <0xc843c>
 <1><c843c>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><c843d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c843e>   DW_AT_byte_size   : 8
    <c843e>   DW_AT_type        : <0xc83de>
 <1><c8442>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8443>   DW_AT_byte_size   : 8
    <c8443>   DW_AT_type        : <0xc83d2>
 <1><c8447>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8448>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <c844c>   DW_AT_decl_file   : 5
    <c844d>   DW_AT_decl_line   : 22
    <c844e>   DW_AT_decl_column : 15
    <c844f>   DW_AT_type        : <0xc8408>
 <1><c8453>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8454>   DW_AT_byte_size   : 8
    <c8454>   DW_AT_type        : <0xc8458>
 <1><c8458>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <c8459>   DW_AT_prototyped  : 1
 <1><c8459>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c845a>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <c845e>   DW_AT_byte_size   : 24
    <c845f>   DW_AT_decl_file   : 6
    <c8460>   DW_AT_decl_line   : 82
    <c8461>   DW_AT_decl_column : 16
    <c8462>   DW_AT_sibling     : <0xc848e>
 <2><c8466>: Abbrev Number: 2 (DW_TAG_member)
    <c8467>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <c846b>   DW_AT_decl_file   : 6
    <c846c>   DW_AT_decl_line   : 83
    <c846d>   DW_AT_decl_column : 21
    <c846e>   DW_AT_type        : <0xc83d2>
    <c8472>   DW_AT_data_member_location: 0
 <2><c8473>: Abbrev Number: 9 (DW_TAG_member)
    <c8474>   DW_AT_name        : len
    <c8478>   DW_AT_decl_file   : 6
    <c8479>   DW_AT_decl_line   : 84
    <c847a>   DW_AT_decl_column : 21
    <c847b>   DW_AT_type        : <0xc8414>
    <c847f>   DW_AT_data_member_location: 8
 <2><c8480>: Abbrev Number: 2 (DW_TAG_member)
    <c8481>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c8485>   DW_AT_decl_file   : 6
    <c8486>   DW_AT_decl_line   : 85
    <c8487>   DW_AT_decl_column : 21
    <c8488>   DW_AT_type        : <0xc8414>
    <c848c>   DW_AT_data_member_location: 16
 <2><c848d>: Abbrev Number: 0
 <1><c848e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c848f>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <c8493>   DW_AT_decl_file   : 6
    <c8494>   DW_AT_decl_line   : 86
    <c8495>   DW_AT_decl_column : 3
    <c8496>   DW_AT_type        : <0xc8459>
 <1><c849a>: Abbrev Number: 7 (DW_TAG_base_type)
    <c849b>   DW_AT_byte_size   : 8
    <c849c>   DW_AT_encoding    : 4	(float)
    <c849d>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c84a1>: Abbrev Number: 7 (DW_TAG_base_type)
    <c84a2>   DW_AT_byte_size   : 4
    <c84a3>   DW_AT_encoding    : 4	(float)
    <c84a4>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c84a8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c84a9>   DW_AT_byte_size   : 8
    <c84a9>   DW_AT_type        : <0xc83ef>
 <1><c84ad>: Abbrev Number: 35 (DW_TAG_enumeration_type)
    <c84ae>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <c84b2>   DW_AT_encoding    : 7	(unsigned)
    <c84b3>   DW_AT_byte_size   : 4
    <c84b4>   DW_AT_type        : <0xc838e>
    <c84b8>   DW_AT_decl_file   : 7
    <c84b9>   DW_AT_decl_line   : 25
    <c84ba>   DW_AT_decl_column : 14
    <c84bb>   DW_AT_sibling     : <0xc84d8>
 <2><c84bf>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c84c0>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <c84c4>   DW_AT_const_value : 0
 <2><c84c5>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c84c6>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <c84ca>   DW_AT_const_value : 1
 <2><c84cb>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c84cc>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <c84d0>   DW_AT_const_value : 2
 <2><c84d1>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c84d2>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <c84d6>   DW_AT_const_value : 3
 <2><c84d7>: Abbrev Number: 0
 <1><c84d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <c84d9>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <c84dd>   DW_AT_decl_file   : 7
    <c84de>   DW_AT_decl_line   : 30
    <c84df>   DW_AT_decl_column : 3
    <c84e0>   DW_AT_type        : <0xc84ad>
 <1><c84e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <c84e5>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <c84e9>   DW_AT_decl_file   : 7
    <c84ea>   DW_AT_decl_line   : 54
    <c84eb>   DW_AT_decl_column : 15
    <c84ec>   DW_AT_type        : <0xc84f0>
 <1><c84f0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c84f1>   DW_AT_byte_size   : 8
    <c84f1>   DW_AT_type        : <0xc84f5>
 <1><c84f5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c84f6>   DW_AT_prototyped  : 1
    <c84f6>   DW_AT_type        : <0xc83aa>
    <c84fa>   DW_AT_sibling     : <0xc8509>
 <2><c84fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c84ff>   DW_AT_type        : <0xc8509>
 <2><c8503>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8504>   DW_AT_type        : <0xc83aa>
 <2><c8508>: Abbrev Number: 0
 <1><c8509>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c850a>   DW_AT_byte_size   : 8
    <c850a>   DW_AT_type        : <0xc850e>
 <1><c850e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c850f>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <c8513>   DW_AT_byte_size   : 80
    <c8514>   DW_AT_decl_file   : 7
    <c8515>   DW_AT_decl_line   : 97
    <c8516>   DW_AT_decl_column : 16
    <c8517>   DW_AT_sibling     : <0xc85d2>
 <2><c851b>: Abbrev Number: 2 (DW_TAG_member)
    <c851c>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <c8520>   DW_AT_decl_file   : 7
    <c8521>   DW_AT_decl_line   : 98
    <c8522>   DW_AT_decl_column : 21
    <c8523>   DW_AT_type        : <0xc83aa>
    <c8527>   DW_AT_data_member_location: 0
 <2><c8528>: Abbrev Number: 9 (DW_TAG_member)
    <c8529>   DW_AT_name        : len
    <c852d>   DW_AT_decl_file   : 7
    <c852e>   DW_AT_decl_line   : 99
    <c852f>   DW_AT_decl_column : 21
    <c8530>   DW_AT_type        : <0xc83aa>
    <c8534>   DW_AT_data_member_location: 4
 <2><c8535>: Abbrev Number: 2 (DW_TAG_member)
    <c8536>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <c853a>   DW_AT_decl_file   : 7
    <c853b>   DW_AT_decl_line   : 100
    <c853c>   DW_AT_decl_column : 21
    <c853d>   DW_AT_type        : <0xc84d8>
    <c8541>   DW_AT_data_member_location: 8
 <2><c8542>: Abbrev Number: 2 (DW_TAG_member)
    <c8543>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c8547>   DW_AT_decl_file   : 7
    <c8548>   DW_AT_decl_line   : 101
    <c8549>   DW_AT_decl_column : 21
    <c854a>   DW_AT_type        : <0xc8447>
    <c854e>   DW_AT_data_member_location: 16
 <2><c854f>: Abbrev Number: 2 (DW_TAG_member)
    <c8550>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c8554>   DW_AT_decl_file   : 7
    <c8555>   DW_AT_decl_line   : 102
    <c8556>   DW_AT_decl_column : 21
    <c8557>   DW_AT_type        : <0xc83aa>
    <c855b>   DW_AT_data_member_location: 24
 <2><c855c>: Abbrev Number: 2 (DW_TAG_member)
    <c855d>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <c8561>   DW_AT_decl_file   : 7
    <c8562>   DW_AT_decl_line   : 103
    <c8563>   DW_AT_decl_column : 21
    <c8564>   DW_AT_type        : <0xc83aa>
    <c8568>   DW_AT_data_member_location: 28
 <2><c8569>: Abbrev Number: 2 (DW_TAG_member)
    <c856a>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <c856e>   DW_AT_decl_file   : 7
    <c856f>   DW_AT_decl_line   : 104
    <c8570>   DW_AT_decl_column : 21
    <c8571>   DW_AT_type        : <0xc83aa>
    <c8575>   DW_AT_data_member_location: 32
 <2><c8576>: Abbrev Number: 2 (DW_TAG_member)
    <c8577>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <c857b>   DW_AT_decl_file   : 7
    <c857c>   DW_AT_decl_line   : 105
    <c857d>   DW_AT_decl_column : 21
    <c857e>   DW_AT_type        : <0xc838e>
    <c8582>   DW_AT_data_member_location: 36
 <2><c8583>: Abbrev Number: 2 (DW_TAG_member)
    <c8584>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <c8588>   DW_AT_decl_file   : 7
    <c8589>   DW_AT_decl_line   : 106
    <c858a>   DW_AT_decl_column : 21
    <c858b>   DW_AT_type        : <0xc838e>
    <c858f>   DW_AT_data_member_location: 40
 <2><c8590>: Abbrev Number: 2 (DW_TAG_member)
    <c8591>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <c8595>   DW_AT_decl_file   : 7
    <c8596>   DW_AT_decl_line   : 109
    <c8597>   DW_AT_decl_column : 21
    <c8598>   DW_AT_type        : <0xc8427>
    <c859c>   DW_AT_data_member_location: 44
 <2><c859d>: Abbrev Number: 2 (DW_TAG_member)
    <c859e>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <c85a2>   DW_AT_decl_file   : 7
    <c85a3>   DW_AT_decl_line   : 110
    <c85a4>   DW_AT_decl_column : 21
    <c85a5>   DW_AT_type        : <0xc83e3>
    <c85a9>   DW_AT_data_member_location: 48
 <2><c85aa>: Abbrev Number: 2 (DW_TAG_member)
    <c85ab>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <c85af>   DW_AT_decl_file   : 7
    <c85b0>   DW_AT_decl_line   : 112
    <c85b1>   DW_AT_decl_column : 22
    <c85b2>   DW_AT_type        : <0xc886a>
    <c85b6>   DW_AT_data_member_location: 56
 <2><c85b7>: Abbrev Number: 2 (DW_TAG_member)
    <c85b8>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <c85bc>   DW_AT_decl_file   : 7
    <c85bd>   DW_AT_decl_line   : 114
    <c85be>   DW_AT_decl_column : 14
    <c85bf>   DW_AT_type        : <0xc83c4>
    <c85c3>   DW_AT_data_member_location: 64
 <2><c85c4>: Abbrev Number: 2 (DW_TAG_member)
    <c85c5>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <c85c9>   DW_AT_decl_file   : 7
    <c85ca>   DW_AT_decl_line   : 116
    <c85cb>   DW_AT_decl_column : 22
    <c85cc>   DW_AT_type        : <0xc8509>
    <c85d0>   DW_AT_data_member_location: 72
 <2><c85d1>: Abbrev Number: 0
 <1><c85d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <c85d3>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <c85d7>   DW_AT_decl_file   : 7
    <c85d8>   DW_AT_decl_line   : 59
    <c85d9>   DW_AT_decl_column : 15
    <c85da>   DW_AT_type        : <0xc85de>
 <1><c85de>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c85df>   DW_AT_byte_size   : 8
    <c85df>   DW_AT_type        : <0xc85e3>
 <1><c85e3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c85e4>   DW_AT_prototyped  : 1
    <c85e4>   DW_AT_type        : <0xc83aa>
    <c85e8>   DW_AT_sibling     : <0xc85f2>
 <2><c85ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c85ed>   DW_AT_type        : <0xc8509>
 <2><c85f1>: Abbrev Number: 0
 <1><c85f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <c85f3>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <c85f7>   DW_AT_decl_file   : 7
    <c85f8>   DW_AT_decl_line   : 60
    <c85f9>   DW_AT_decl_column : 15
    <c85fa>   DW_AT_type        : <0xc85de>
 <1><c85fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <c85ff>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <c8603>   DW_AT_decl_file   : 7
    <c8604>   DW_AT_decl_line   : 61
    <c8605>   DW_AT_decl_column : 15
    <c8606>   DW_AT_type        : <0xc860a>
 <1><c860a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c860b>   DW_AT_byte_size   : 8
    <c860b>   DW_AT_type        : <0xc860f>
 <1><c860f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8610>   DW_AT_prototyped  : 1
    <c8610>   DW_AT_type        : <0xc83aa>
    <c8614>   DW_AT_sibling     : <0xc8628>
 <2><c8618>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8619>   DW_AT_type        : <0xc8509>
 <2><c861d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c861e>   DW_AT_type        : <0xc8447>
 <2><c8622>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8623>   DW_AT_type        : <0xc83aa>
 <2><c8627>: Abbrev Number: 0
 <1><c8628>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8629>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <c862d>   DW_AT_decl_file   : 7
    <c862e>   DW_AT_decl_line   : 62
    <c862f>   DW_AT_decl_column : 15
    <c8630>   DW_AT_type        : <0xc8634>
 <1><c8634>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8635>   DW_AT_byte_size   : 8
    <c8635>   DW_AT_type        : <0xc8639>
 <1><c8639>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c863a>   DW_AT_prototyped  : 1
    <c863a>   DW_AT_type        : <0xc83aa>
    <c863e>   DW_AT_sibling     : <0xc864d>
 <2><c8642>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8643>   DW_AT_type        : <0xc8509>
 <2><c8647>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8648>   DW_AT_type        : <0xc864d>
 <2><c864c>: Abbrev Number: 0
 <1><c864d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c864e>   DW_AT_byte_size   : 8
    <c864e>   DW_AT_type        : <0xc8447>
 <1><c8652>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8653>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <c8657>   DW_AT_decl_file   : 7
    <c8658>   DW_AT_decl_line   : 63
    <c8659>   DW_AT_decl_column : 15
    <c865a>   DW_AT_type        : <0xc865e>
 <1><c865e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c865f>   DW_AT_byte_size   : 8
    <c865f>   DW_AT_type        : <0xc8663>
 <1><c8663>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8664>   DW_AT_prototyped  : 1
    <c8664>   DW_AT_type        : <0xc83aa>
    <c8668>   DW_AT_sibling     : <0xc867c>
 <2><c866c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c866d>   DW_AT_type        : <0xc8509>
 <2><c8671>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8672>   DW_AT_type        : <0xc83c4>
 <2><c8676>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8677>   DW_AT_type        : <0xc867c>
 <2><c867b>: Abbrev Number: 0
 <1><c867c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c867d>   DW_AT_byte_size   : 8
    <c867d>   DW_AT_type        : <0xc83e3>
 <1><c8681>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8682>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <c8686>   DW_AT_decl_file   : 7
    <c8687>   DW_AT_decl_line   : 65
    <c8688>   DW_AT_decl_column : 15
    <c8689>   DW_AT_type        : <0xc868d>
 <1><c868d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c868e>   DW_AT_byte_size   : 8
    <c868e>   DW_AT_type        : <0xc8692>
 <1><c8692>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8693>   DW_AT_prototyped  : 1
    <c8693>   DW_AT_type        : <0xc83aa>
    <c8697>   DW_AT_sibling     : <0xc86ab>
 <2><c869b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c869c>   DW_AT_type        : <0xc8509>
 <2><c86a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86a1>   DW_AT_type        : <0xc84a8>
 <2><c86a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86a6>   DW_AT_type        : <0xc867c>
 <2><c86aa>: Abbrev Number: 0
 <1><c86ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <c86ac>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <c86b0>   DW_AT_decl_file   : 7
    <c86b1>   DW_AT_decl_line   : 67
    <c86b2>   DW_AT_decl_column : 15
    <c86b3>   DW_AT_type        : <0xc86b7>
 <1><c86b7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c86b8>   DW_AT_byte_size   : 8
    <c86b8>   DW_AT_type        : <0xc86bc>
 <1><c86bc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c86bd>   DW_AT_prototyped  : 1
    <c86bd>   DW_AT_type        : <0xc83aa>
    <c86c1>   DW_AT_sibling     : <0xc86d5>
 <2><c86c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86c6>   DW_AT_type        : <0xc8509>
 <2><c86ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86cb>   DW_AT_type        : <0xc8437>
 <2><c86cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86d0>   DW_AT_type        : <0xc83e3>
 <2><c86d4>: Abbrev Number: 0
 <1><c86d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c86d6>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <c86da>   DW_AT_decl_file   : 7
    <c86db>   DW_AT_decl_line   : 69
    <c86dc>   DW_AT_decl_column : 15
    <c86dd>   DW_AT_type        : <0xc86e1>
 <1><c86e1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c86e2>   DW_AT_byte_size   : 8
    <c86e2>   DW_AT_type        : <0xc86e6>
 <1><c86e6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c86e7>   DW_AT_prototyped  : 1
    <c86e7>   DW_AT_type        : <0xc83aa>
    <c86eb>   DW_AT_sibling     : <0xc86ff>
 <2><c86ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86f0>   DW_AT_type        : <0xc8509>
 <2><c86f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86f5>   DW_AT_type        : <0xc86ff>
 <2><c86f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c86fa>   DW_AT_type        : <0xc83e3>
 <2><c86fe>: Abbrev Number: 0
 <1><c86ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8700>   DW_AT_byte_size   : 8
    <c8700>   DW_AT_type        : <0xc83fc>
 <1><c8704>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8705>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <c8709>   DW_AT_decl_file   : 7
    <c870a>   DW_AT_decl_line   : 71
    <c870b>   DW_AT_decl_column : 15
    <c870c>   DW_AT_type        : <0xc8710>
 <1><c8710>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8711>   DW_AT_byte_size   : 8
    <c8711>   DW_AT_type        : <0xc8715>
 <1><c8715>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8716>   DW_AT_prototyped  : 1
    <c8716>   DW_AT_type        : <0xc83aa>
    <c871a>   DW_AT_sibling     : <0xc872e>
 <2><c871e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c871f>   DW_AT_type        : <0xc8509>
 <2><c8723>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8724>   DW_AT_type        : <0xc8447>
 <2><c8728>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8729>   DW_AT_type        : <0xc8447>
 <2><c872d>: Abbrev Number: 0
 <1><c872e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c872f>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <c8733>   DW_AT_decl_file   : 7
    <c8734>   DW_AT_decl_line   : 73
    <c8735>   DW_AT_decl_column : 15
    <c8736>   DW_AT_type        : <0xc8710>
 <1><c873a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c873b>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <c873f>   DW_AT_decl_file   : 7
    <c8740>   DW_AT_decl_line   : 75
    <c8741>   DW_AT_decl_column : 15
    <c8742>   DW_AT_type        : <0xc8746>
 <1><c8746>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8747>   DW_AT_byte_size   : 8
    <c8747>   DW_AT_type        : <0xc874b>
 <1><c874b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c874c>   DW_AT_prototyped  : 1
    <c874c>   DW_AT_type        : <0xc83aa>
    <c8750>   DW_AT_sibling     : <0xc875f>
 <2><c8754>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8755>   DW_AT_type        : <0xc8509>
 <2><c8759>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c875a>   DW_AT_type        : <0xc875f>
 <2><c875e>: Abbrev Number: 0
 <1><c875f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8760>   DW_AT_byte_size   : 8
    <c8760>   DW_AT_type        : <0xc848e>
 <1><c8764>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8765>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <c8769>   DW_AT_decl_file   : 7
    <c876a>   DW_AT_decl_line   : 76
    <c876b>   DW_AT_decl_column : 15
    <c876c>   DW_AT_type        : <0xc8770>
 <1><c8770>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8771>   DW_AT_byte_size   : 8
    <c8771>   DW_AT_type        : <0xc8775>
 <1><c8775>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8776>   DW_AT_prototyped  : 1
    <c8776>   DW_AT_type        : <0xc83aa>
    <c877a>   DW_AT_sibling     : <0xc878e>
 <2><c877e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c877f>   DW_AT_type        : <0xc8509>
 <2><c8783>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8784>   DW_AT_type        : <0xc84a8>
 <2><c8788>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8789>   DW_AT_type        : <0xc8414>
 <2><c878d>: Abbrev Number: 0
 <1><c878e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c878f>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <c8793>   DW_AT_decl_file   : 7
    <c8794>   DW_AT_decl_line   : 77
    <c8795>   DW_AT_decl_column : 15
    <c8796>   DW_AT_type        : <0xc85de>
 <1><c879a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c879b>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <c879f>   DW_AT_byte_size   : 112
    <c87a0>   DW_AT_decl_file   : 7
    <c87a1>   DW_AT_decl_line   : 80
    <c87a2>   DW_AT_decl_column : 16
    <c87a3>   DW_AT_sibling     : <0xc885e>
 <2><c87a7>: Abbrev Number: 2 (DW_TAG_member)
    <c87a8>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <c87ac>   DW_AT_decl_file   : 7
    <c87ad>   DW_AT_decl_line   : 81
    <c87ae>   DW_AT_decl_column : 25
    <c87af>   DW_AT_type        : <0xc85d2>
    <c87b3>   DW_AT_data_member_location: 0
 <2><c87b4>: Abbrev Number: 2 (DW_TAG_member)
    <c87b5>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <c87b9>   DW_AT_decl_file   : 7
    <c87ba>   DW_AT_decl_line   : 82
    <c87bb>   DW_AT_decl_column : 25
    <c87bc>   DW_AT_type        : <0xc85f2>
    <c87c0>   DW_AT_data_member_location: 8
 <2><c87c1>: Abbrev Number: 2 (DW_TAG_member)
    <c87c2>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <c87c6>   DW_AT_decl_file   : 7
    <c87c7>   DW_AT_decl_line   : 83
    <c87c8>   DW_AT_decl_column : 25
    <c87c9>   DW_AT_type        : <0xc85fe>
    <c87cd>   DW_AT_data_member_location: 16
 <2><c87ce>: Abbrev Number: 2 (DW_TAG_member)
    <c87cf>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <c87d3>   DW_AT_decl_file   : 7
    <c87d4>   DW_AT_decl_line   : 84
    <c87d5>   DW_AT_decl_column : 25
    <c87d6>   DW_AT_type        : <0xc8628>
    <c87da>   DW_AT_data_member_location: 24
 <2><c87db>: Abbrev Number: 2 (DW_TAG_member)
    <c87dc>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <c87e0>   DW_AT_decl_file   : 7
    <c87e1>   DW_AT_decl_line   : 85
    <c87e2>   DW_AT_decl_column : 25
    <c87e3>   DW_AT_type        : <0xc8652>
    <c87e7>   DW_AT_data_member_location: 32
 <2><c87e8>: Abbrev Number: 2 (DW_TAG_member)
    <c87e9>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <c87ed>   DW_AT_decl_file   : 7
    <c87ee>   DW_AT_decl_line   : 86
    <c87ef>   DW_AT_decl_column : 25
    <c87f0>   DW_AT_type        : <0xc8681>
    <c87f4>   DW_AT_data_member_location: 40
 <2><c87f5>: Abbrev Number: 2 (DW_TAG_member)
    <c87f6>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <c87fa>   DW_AT_decl_file   : 7
    <c87fb>   DW_AT_decl_line   : 87
    <c87fc>   DW_AT_decl_column : 25
    <c87fd>   DW_AT_type        : <0xc86ab>
    <c8801>   DW_AT_data_member_location: 48
 <2><c8802>: Abbrev Number: 2 (DW_TAG_member)
    <c8803>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <c8807>   DW_AT_decl_file   : 7
    <c8808>   DW_AT_decl_line   : 88
    <c8809>   DW_AT_decl_column : 25
    <c880a>   DW_AT_type        : <0xc86d5>
    <c880e>   DW_AT_data_member_location: 56
 <2><c880f>: Abbrev Number: 2 (DW_TAG_member)
    <c8810>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <c8814>   DW_AT_decl_file   : 7
    <c8815>   DW_AT_decl_line   : 89
    <c8816>   DW_AT_decl_column : 25
    <c8817>   DW_AT_type        : <0xc8704>
    <c881b>   DW_AT_data_member_location: 64
 <2><c881c>: Abbrev Number: 2 (DW_TAG_member)
    <c881d>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <c8821>   DW_AT_decl_file   : 7
    <c8822>   DW_AT_decl_line   : 90
    <c8823>   DW_AT_decl_column : 25
    <c8824>   DW_AT_type        : <0xc872e>
    <c8828>   DW_AT_data_member_location: 72
 <2><c8829>: Abbrev Number: 2 (DW_TAG_member)
    <c882a>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <c882e>   DW_AT_decl_file   : 7
    <c882f>   DW_AT_decl_line   : 91
    <c8830>   DW_AT_decl_column : 25
    <c8831>   DW_AT_type        : <0xc873a>
    <c8835>   DW_AT_data_member_location: 80
 <2><c8836>: Abbrev Number: 2 (DW_TAG_member)
    <c8837>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <c883b>   DW_AT_decl_file   : 7
    <c883c>   DW_AT_decl_line   : 92
    <c883d>   DW_AT_decl_column : 25
    <c883e>   DW_AT_type        : <0xc8764>
    <c8842>   DW_AT_data_member_location: 88
 <2><c8843>: Abbrev Number: 2 (DW_TAG_member)
    <c8844>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <c8848>   DW_AT_decl_file   : 7
    <c8849>   DW_AT_decl_line   : 93
    <c884a>   DW_AT_decl_column : 25
    <c884b>   DW_AT_type        : <0xc84e4>
    <c884f>   DW_AT_data_member_location: 96
 <2><c8850>: Abbrev Number: 2 (DW_TAG_member)
    <c8851>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <c8855>   DW_AT_decl_file   : 7
    <c8856>   DW_AT_decl_line   : 94
    <c8857>   DW_AT_decl_column : 25
    <c8858>   DW_AT_type        : <0xc878e>
    <c885c>   DW_AT_data_member_location: 104
 <2><c885d>: Abbrev Number: 0
 <1><c885e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c885f>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <c8863>   DW_AT_decl_file   : 7
    <c8864>   DW_AT_decl_line   : 95
    <c8865>   DW_AT_decl_column : 3
    <c8866>   DW_AT_type        : <0xc879a>
 <1><c886a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c886b>   DW_AT_byte_size   : 8
    <c886b>   DW_AT_type        : <0xc885e>
 <1><c886f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8870>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <c8874>   DW_AT_decl_file   : 7
    <c8875>   DW_AT_decl_line   : 117
    <c8876>   DW_AT_decl_column : 3
    <c8877>   DW_AT_type        : <0xc850e>
 <1><c887b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c887c>   DW_AT_byte_size   : 8
    <c887c>   DW_AT_type        : <0xc886f>
 <1><c8880>: Abbrev Number: 20 (DW_TAG_structure_type)
    <c8881>   DW_AT_byte_size   : 8
    <c8882>   DW_AT_decl_file   : 8
    <c8882>   DW_AT_decl_line   : 4
    <c8883>   DW_AT_decl_column : 3
    <c8883>   DW_AT_sibling     : <0xc88a2>
 <2><c8887>: Abbrev Number: 2 (DW_TAG_member)
    <c8888>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <c888c>   DW_AT_decl_file   : 8
    <c888d>   DW_AT_decl_line   : 5
    <c888e>   DW_AT_decl_column : 8
    <c888f>   DW_AT_type        : <0xc83aa>
    <c8893>   DW_AT_data_member_location: 0
 <2><c8894>: Abbrev Number: 2 (DW_TAG_member)
    <c8895>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <c8899>   DW_AT_decl_file   : 8
    <c889a>   DW_AT_decl_line   : 6
    <c889b>   DW_AT_decl_column : 8
    <c889c>   DW_AT_type        : <0xc83aa>
    <c88a0>   DW_AT_data_member_location: 4
 <2><c88a1>: Abbrev Number: 0
 <1><c88a2>: Abbrev Number: 20 (DW_TAG_structure_type)
    <c88a3>   DW_AT_byte_size   : 16
    <c88a4>   DW_AT_decl_file   : 8
    <c88a4>   DW_AT_decl_line   : 8
    <c88a5>   DW_AT_decl_column : 3
    <c88a5>   DW_AT_sibling     : <0xc88d8>
 <2><c88a9>: Abbrev Number: 9 (DW_TAG_member)
    <c88aa>   DW_AT_name        : x
    <c88ac>   DW_AT_decl_file   : 8
    <c88ad>   DW_AT_decl_line   : 9
    <c88ae>   DW_AT_decl_column : 8
    <c88af>   DW_AT_type        : <0xc83aa>
    <c88b3>   DW_AT_data_member_location: 0
 <2><c88b4>: Abbrev Number: 9 (DW_TAG_member)
    <c88b5>   DW_AT_name        : y
    <c88b7>   DW_AT_decl_file   : 8
    <c88b8>   DW_AT_decl_line   : 9
    <c88b9>   DW_AT_decl_column : 11
    <c88ba>   DW_AT_type        : <0xc83aa>
    <c88be>   DW_AT_data_member_location: 4
 <2><c88bf>: Abbrev Number: 9 (DW_TAG_member)
    <c88c0>   DW_AT_name        : dx
    <c88c3>   DW_AT_decl_file   : 8
    <c88c4>   DW_AT_decl_line   : 10
    <c88c5>   DW_AT_decl_column : 8
    <c88c6>   DW_AT_type        : <0xc83aa>
    <c88ca>   DW_AT_data_member_location: 8
 <2><c88cb>: Abbrev Number: 9 (DW_TAG_member)
    <c88cc>   DW_AT_name        : dy
    <c88cf>   DW_AT_decl_file   : 8
    <c88d0>   DW_AT_decl_line   : 10
    <c88d1>   DW_AT_decl_column : 12
    <c88d2>   DW_AT_type        : <0xc83aa>
    <c88d6>   DW_AT_data_member_location: 12
 <2><c88d7>: Abbrev Number: 0
 <1><c88d8>: Abbrev Number: 36 (DW_TAG_union_type)
    <c88d9>   DW_AT_byte_size   : 16
    <c88da>   DW_AT_decl_file   : 8
    <c88db>   DW_AT_decl_line   : 3
    <c88dc>   DW_AT_decl_column : 2
    <c88dd>   DW_AT_sibling     : <0xc8908>
 <2><c88e1>: Abbrev Number: 21 (DW_TAG_member)
    <c88e2>   DW_AT_type        : <0xc8880>
 <2><c88e6>: Abbrev Number: 21 (DW_TAG_member)
    <c88e7>   DW_AT_type        : <0xc88a2>
 <2><c88eb>: Abbrev Number: 37 (DW_TAG_member)
    <c88ec>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <c88f0>   DW_AT_decl_file   : 8
    <c88f1>   DW_AT_decl_line   : 12
    <c88f2>   DW_AT_decl_column : 7
    <c88f3>   DW_AT_type        : <0xc83aa>
 <2><c88f7>: Abbrev Number: 22 (DW_TAG_member)
    <c88f8>   DW_AT_name        : z
    <c88fa>   DW_AT_decl_file   : 8
    <c88fa>   DW_AT_decl_line   : 13
    <c88fb>   DW_AT_decl_column : 7
    <c88fb>   DW_AT_type        : <0xc83aa>
 <2><c88ff>: Abbrev Number: 22 (DW_TAG_member)
    <c8900>   DW_AT_name        : w
    <c8902>   DW_AT_decl_file   : 8
    <c8902>   DW_AT_decl_line   : 14
    <c8903>   DW_AT_decl_column : 7
    <c8903>   DW_AT_type        : <0xc83aa>
 <2><c8907>: Abbrev Number: 0
 <1><c8908>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c8909>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <c890d>   DW_AT_byte_size   : 20
    <c890e>   DW_AT_decl_file   : 8
    <c890f>   DW_AT_decl_line   : 1
    <c8910>   DW_AT_decl_column : 8
    <c8911>   DW_AT_sibling     : <0xc8929>
 <2><c8915>: Abbrev Number: 2 (DW_TAG_member)
    <c8916>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c891a>   DW_AT_decl_file   : 8
    <c891b>   DW_AT_decl_line   : 2
    <c891c>   DW_AT_decl_column : 6
    <c891d>   DW_AT_type        : <0xc83aa>
    <c8921>   DW_AT_data_member_location: 0
 <2><c8922>: Abbrev Number: 38 (DW_TAG_member)
    <c8923>   DW_AT_type        : <0xc88d8>
    <c8927>   DW_AT_data_member_location: 4
 <2><c8928>: Abbrev Number: 0
 <1><c8929>: Abbrev Number: 3 (DW_TAG_typedef)
    <c892a>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <c892e>   DW_AT_decl_file   : 8
    <c892f>   DW_AT_decl_line   : 18
    <c8930>   DW_AT_decl_column : 23
    <c8931>   DW_AT_type        : <0xc8908>
 <1><c8935>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8936>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <c893a>   DW_AT_decl_file   : 9
    <c893b>   DW_AT_decl_line   : 1
    <c893c>   DW_AT_decl_column : 23
    <c893d>   DW_AT_type        : <0xc8941>
 <1><c8941>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8942>   DW_AT_byte_size   : 8
    <c8942>   DW_AT_type        : <0xc8946>
 <1><c8946>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <c8947>   DW_AT_prototyped  : 1
    <c8947>   DW_AT_type        : <0xc875f>
 <1><c894b>: Abbrev Number: 3 (DW_TAG_typedef)
    <c894c>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <c8950>   DW_AT_decl_file   : 9
    <c8951>   DW_AT_decl_line   : 2
    <c8952>   DW_AT_decl_column : 23
    <c8953>   DW_AT_type        : <0xc8957>
 <1><c8957>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8958>   DW_AT_byte_size   : 8
    <c8958>   DW_AT_type        : <0xc895c>
 <1><c895c>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <c895d>   DW_AT_prototyped  : 1
    <c895d>   DW_AT_type        : <0xc83aa>
 <1><c8961>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8962>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <c8966>   DW_AT_decl_file   : 9
    <c8967>   DW_AT_decl_line   : 3
    <c8968>   DW_AT_decl_column : 23
    <c8969>   DW_AT_type        : <0xc8957>
 <1><c896d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c896e>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <c8972>   DW_AT_decl_file   : 9
    <c8973>   DW_AT_decl_line   : 10
    <c8974>   DW_AT_decl_column : 23
    <c8975>   DW_AT_type        : <0xc8979>
 <1><c8979>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c897a>   DW_AT_byte_size   : 8
    <c897a>   DW_AT_type        : <0xc897e>
 <1><c897e>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <c897f>   DW_AT_prototyped  : 1
    <c897f>   DW_AT_sibling     : <0xc8989>
 <2><c8983>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8984>   DW_AT_type        : <0xc83aa>
 <2><c8988>: Abbrev Number: 0
 <1><c8989>: Abbrev Number: 3 (DW_TAG_typedef)
    <c898a>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <c898e>   DW_AT_decl_file   : 9
    <c898f>   DW_AT_decl_line   : 14
    <c8990>   DW_AT_decl_column : 23
    <c8991>   DW_AT_type        : <0xc8995>
 <1><c8995>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8996>   DW_AT_byte_size   : 8
    <c8996>   DW_AT_type        : <0xc899a>
 <1><c899a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c899b>   DW_AT_prototyped  : 1
    <c899b>   DW_AT_type        : <0xc83aa>
    <c899f>   DW_AT_sibling     : <0xc89b3>
 <2><c89a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c89a4>   DW_AT_type        : <0xc83aa>
 <2><c89a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c89a9>   DW_AT_type        : <0xc83aa>
 <2><c89ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c89ae>   DW_AT_type        : <0xc83aa>
 <2><c89b2>: Abbrev Number: 0
 <1><c89b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <c89b4>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <c89b8>   DW_AT_decl_file   : 9
    <c89b9>   DW_AT_decl_line   : 18
    <c89ba>   DW_AT_decl_column : 23
    <c89bb>   DW_AT_type        : <0xc8995>
 <1><c89bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <c89c0>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <c89c4>   DW_AT_decl_file   : 9
    <c89c5>   DW_AT_decl_line   : 24
    <c89c6>   DW_AT_decl_column : 23
    <c89c7>   DW_AT_type        : <0xc8453>
 <1><c89cb>: Abbrev Number: 3 (DW_TAG_typedef)
    <c89cc>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <c89d0>   DW_AT_decl_file   : 9
    <c89d1>   DW_AT_decl_line   : 28
    <c89d2>   DW_AT_decl_column : 23
    <c89d3>   DW_AT_type        : <0xc89d7>
 <1><c89d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c89d8>   DW_AT_byte_size   : 8
    <c89d8>   DW_AT_type        : <0xc89dc>
 <1><c89dc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c89dd>   DW_AT_prototyped  : 1
    <c89dd>   DW_AT_type        : <0xc83aa>
    <c89e1>   DW_AT_sibling     : <0xc89f0>
 <2><c89e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c89e6>   DW_AT_type        : <0xc83aa>
 <2><c89ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c89eb>   DW_AT_type        : <0xc83aa>
 <2><c89ef>: Abbrev Number: 0
 <1><c89f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c89f1>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <c89f5>   DW_AT_decl_file   : 9
    <c89f6>   DW_AT_decl_line   : 34
    <c89f7>   DW_AT_decl_column : 23
    <c89f8>   DW_AT_type        : <0xc8957>
 <1><c89fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <c89fd>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <c8a01>   DW_AT_decl_file   : 9
    <c8a02>   DW_AT_decl_line   : 35
    <c8a03>   DW_AT_decl_column : 23
    <c8a04>   DW_AT_type        : <0xc8957>
 <1><c8a08>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8a09>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <c8a0d>   DW_AT_decl_file   : 9
    <c8a0e>   DW_AT_decl_line   : 36
    <c8a0f>   DW_AT_decl_column : 23
    <c8a10>   DW_AT_type        : <0xc8a14>
 <1><c8a14>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8a15>   DW_AT_byte_size   : 8
    <c8a15>   DW_AT_type        : <0xc8a19>
 <1><c8a19>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <c8a1a>   DW_AT_prototyped  : 1
    <c8a1a>   DW_AT_sibling     : <0xc8a29>
 <2><c8a1e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a1f>   DW_AT_type        : <0xc8a29>
 <2><c8a23>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a24>   DW_AT_type        : <0xc8a29>
 <2><c8a28>: Abbrev Number: 0
 <1><c8a29>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8a2a>   DW_AT_byte_size   : 8
    <c8a2a>   DW_AT_type        : <0xc83aa>
 <1><c8a2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8a2f>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <c8a33>   DW_AT_decl_file   : 9
    <c8a34>   DW_AT_decl_line   : 37
    <c8a35>   DW_AT_decl_column : 23
    <c8a36>   DW_AT_type        : <0xc8a14>
 <1><c8a3a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8a3b>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <c8a3f>   DW_AT_decl_file   : 9
    <c8a40>   DW_AT_decl_line   : 45
    <c8a41>   DW_AT_decl_column : 24
    <c8a42>   DW_AT_type        : <0xc8a46>
 <1><c8a46>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8a47>   DW_AT_byte_size   : 8
    <c8a47>   DW_AT_type        : <0xc8a4b>
 <1><c8a4b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8a4c>   DW_AT_prototyped  : 1
    <c8a4c>   DW_AT_type        : <0xc838e>
    <c8a50>   DW_AT_sibling     : <0xc8a64>
 <2><c8a54>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a55>   DW_AT_type        : <0xc83aa>
 <2><c8a59>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a5a>   DW_AT_type        : <0xc83aa>
 <2><c8a5e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a5f>   DW_AT_type        : <0xc83aa>
 <2><c8a63>: Abbrev Number: 0
 <1><c8a64>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8a65>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <c8a69>   DW_AT_decl_file   : 9
    <c8a6a>   DW_AT_decl_line   : 48
    <c8a6b>   DW_AT_decl_column : 23
    <c8a6c>   DW_AT_type        : <0xc8a70>
 <1><c8a70>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8a71>   DW_AT_byte_size   : 8
    <c8a71>   DW_AT_type        : <0xc8a75>
 <1><c8a75>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <c8a76>   DW_AT_prototyped  : 1
    <c8a76>   DW_AT_sibling     : <0xc8a8a>
 <2><c8a7a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a7b>   DW_AT_type        : <0xc8437>
 <2><c8a7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a80>   DW_AT_type        : <0xc83e3>
 <2><c8a84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8a85>   DW_AT_type        : <0xc83aa>
 <2><c8a89>: Abbrev Number: 0
 <1><c8a8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8a8b>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <c8a8f>   DW_AT_decl_file   : 9
    <c8a90>   DW_AT_decl_line   : 49
    <c8a91>   DW_AT_decl_column : 23
    <c8a92>   DW_AT_type        : <0xc8a96>
 <1><c8a96>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8a97>   DW_AT_byte_size   : 8
    <c8a97>   DW_AT_type        : <0xc8a9b>
 <1><c8a9b>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <c8a9c>   DW_AT_prototyped  : 1
    <c8a9c>   DW_AT_sibling     : <0xc8ab0>
 <2><c8aa0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8aa1>   DW_AT_type        : <0xc86ff>
 <2><c8aa5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8aa6>   DW_AT_type        : <0xc83e3>
 <2><c8aaa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8aab>   DW_AT_type        : <0xc83aa>
 <2><c8aaf>: Abbrev Number: 0
 <1><c8ab0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8ab1>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <c8ab5>   DW_AT_decl_file   : 9
    <c8ab6>   DW_AT_decl_line   : 51
    <c8ab7>   DW_AT_decl_column : 24
    <c8ab8>   DW_AT_type        : <0xc8abc>
 <1><c8abc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8abd>   DW_AT_byte_size   : 8
    <c8abd>   DW_AT_type        : <0xc8ac1>
 <1><c8ac1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8ac2>   DW_AT_prototyped  : 1
    <c8ac2>   DW_AT_type        : <0xc83d2>
    <c8ac6>   DW_AT_sibling     : <0xc8ad5>
 <2><c8aca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8acb>   DW_AT_type        : <0xc83d2>
 <2><c8acf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ad0>   DW_AT_type        : <0xc8414>
 <2><c8ad4>: Abbrev Number: 0
 <1><c8ad5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8ad6>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <c8ada>   DW_AT_decl_file   : 9
    <c8adb>   DW_AT_decl_line   : 54
    <c8adc>   DW_AT_decl_column : 23
    <c8add>   DW_AT_type        : <0xc8ae1>
 <1><c8ae1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8ae2>   DW_AT_byte_size   : 8
    <c8ae2>   DW_AT_type        : <0xc8ae6>
 <1><c8ae6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8ae7>   DW_AT_prototyped  : 1
    <c8ae7>   DW_AT_type        : <0xc83aa>
    <c8aeb>   DW_AT_sibling     : <0xc8b0e>
 <2><c8aef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8af0>   DW_AT_type        : <0xc875f>
 <2><c8af4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8af5>   DW_AT_type        : <0xc83c4>
 <2><c8af9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8afa>   DW_AT_type        : <0xc8414>
 <2><c8afe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8aff>   DW_AT_type        : <0xc83aa>
 <2><c8b03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b04>   DW_AT_type        : <0xc83aa>
 <2><c8b08>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b09>   DW_AT_type        : <0xc83aa>
 <2><c8b0d>: Abbrev Number: 0
 <1><c8b0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8b0f>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <c8b13>   DW_AT_decl_file   : 9
    <c8b14>   DW_AT_decl_line   : 56
    <c8b15>   DW_AT_decl_column : 23
    <c8b16>   DW_AT_type        : <0xc8b1a>
 <1><c8b1a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8b1b>   DW_AT_byte_size   : 8
    <c8b1b>   DW_AT_type        : <0xc8b1f>
 <1><c8b1f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8b20>   DW_AT_prototyped  : 1
    <c8b20>   DW_AT_type        : <0xc83aa>
    <c8b24>   DW_AT_sibling     : <0xc8b42>
 <2><c8b28>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b29>   DW_AT_type        : <0xc86ff>
 <2><c8b2d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b2e>   DW_AT_type        : <0xc84a8>
 <2><c8b32>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b33>   DW_AT_type        : <0xc8414>
 <2><c8b37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b38>   DW_AT_type        : <0xc83aa>
 <2><c8b3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b3d>   DW_AT_type        : <0xc83aa>
 <2><c8b41>: Abbrev Number: 0
 <1><c8b42>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8b43>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <c8b47>   DW_AT_decl_file   : 9
    <c8b48>   DW_AT_decl_line   : 67
    <c8b49>   DW_AT_decl_column : 23
    <c8b4a>   DW_AT_type        : <0xc8b4e>
 <1><c8b4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8b4f>   DW_AT_byte_size   : 8
    <c8b4f>   DW_AT_type        : <0xc8b53>
 <1><c8b53>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8b54>   DW_AT_prototyped  : 1
    <c8b54>   DW_AT_type        : <0xc83aa>
    <c8b58>   DW_AT_sibling     : <0xc8b62>
 <2><c8b5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b5d>   DW_AT_type        : <0xc83aa>
 <2><c8b61>: Abbrev Number: 0
 <1><c8b62>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8b63>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <c8b67>   DW_AT_decl_file   : 9
    <c8b68>   DW_AT_decl_line   : 68
    <c8b69>   DW_AT_decl_column : 23
    <c8b6a>   DW_AT_type        : <0xc8b6e>
 <1><c8b6e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8b6f>   DW_AT_byte_size   : 8
    <c8b6f>   DW_AT_type        : <0xc8b73>
 <1><c8b73>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8b74>   DW_AT_prototyped  : 1
    <c8b74>   DW_AT_type        : <0xc83aa>
    <c8b78>   DW_AT_sibling     : <0xc8b96>
 <2><c8b7c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b7d>   DW_AT_type        : <0xc8a29>
 <2><c8b81>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b82>   DW_AT_type        : <0xc8a29>
 <2><c8b86>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b87>   DW_AT_type        : <0xc8a29>
 <2><c8b8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b8c>   DW_AT_type        : <0xc8a29>
 <2><c8b90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8b91>   DW_AT_type        : <0xc8a29>
 <2><c8b95>: Abbrev Number: 0
 <1><c8b96>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8b97>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <c8b9b>   DW_AT_decl_file   : 9
    <c8b9c>   DW_AT_decl_line   : 69
    <c8b9d>   DW_AT_decl_column : 23
    <c8b9e>   DW_AT_type        : <0xc8ba2>
 <1><c8ba2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8ba3>   DW_AT_byte_size   : 8
    <c8ba3>   DW_AT_type        : <0xc8ba7>
 <1><c8ba7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8ba8>   DW_AT_prototyped  : 1
    <c8ba8>   DW_AT_type        : <0xc83aa>
    <c8bac>   DW_AT_sibling     : <0xc8bc5>
 <2><c8bb0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8bb1>   DW_AT_type        : <0xc83aa>
 <2><c8bb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8bb6>   DW_AT_type        : <0xc83aa>
 <2><c8bba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8bbb>   DW_AT_type        : <0xc83aa>
 <2><c8bbf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8bc0>   DW_AT_type        : <0xc83aa>
 <2><c8bc4>: Abbrev Number: 0
 <1><c8bc5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8bc6>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <c8bca>   DW_AT_decl_file   : 9
    <c8bcb>   DW_AT_decl_line   : 73
    <c8bcc>   DW_AT_decl_column : 23
    <c8bcd>   DW_AT_type        : <0xc8bd1>
 <1><c8bd1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8bd2>   DW_AT_byte_size   : 8
    <c8bd2>   DW_AT_type        : <0xc8bd6>
 <1><c8bd6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8bd7>   DW_AT_prototyped  : 1
    <c8bd7>   DW_AT_type        : <0xc83aa>
    <c8bdb>   DW_AT_sibling     : <0xc8be5>
 <2><c8bdf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8be0>   DW_AT_type        : <0xc8387>
 <2><c8be4>: Abbrev Number: 0
 <1><c8be5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8be6>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <c8bea>   DW_AT_decl_file   : 9
    <c8beb>   DW_AT_decl_line   : 74
    <c8bec>   DW_AT_decl_column : 23
    <c8bed>   DW_AT_type        : <0xc8bf1>
 <1><c8bf1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8bf2>   DW_AT_byte_size   : 8
    <c8bf2>   DW_AT_type        : <0xc8bf6>
 <1><c8bf6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c8bf7>   DW_AT_prototyped  : 1
    <c8bf7>   DW_AT_type        : <0xc83aa>
    <c8bfb>   DW_AT_sibling     : <0xc8c0a>
 <2><c8bff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8c00>   DW_AT_type        : <0xc8387>
 <2><c8c04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8c05>   DW_AT_type        : <0xc8380>
 <2><c8c09>: Abbrev Number: 0
 <1><c8c0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c0b>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <c8c0f>   DW_AT_decl_file   : 9
    <c8c10>   DW_AT_decl_line   : 80
    <c8c11>   DW_AT_decl_column : 23
    <c8c12>   DW_AT_type        : <0xc8979>
 <1><c8c16>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c17>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <c8c1b>   DW_AT_decl_file   : 9
    <c8c1c>   DW_AT_decl_line   : 83
    <c8c1d>   DW_AT_decl_column : 23
    <c8c1e>   DW_AT_type        : <0xc8b4e>
 <1><c8c22>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c23>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <c8c27>   DW_AT_decl_file   : 9
    <c8c28>   DW_AT_decl_line   : 86
    <c8c29>   DW_AT_decl_column : 23
    <c8c2a>   DW_AT_type        : <0xc89d7>
 <1><c8c2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c2f>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <c8c33>   DW_AT_decl_file   : 9
    <c8c34>   DW_AT_decl_line   : 89
    <c8c35>   DW_AT_decl_column : 23
    <c8c36>   DW_AT_type        : <0xc89d7>
 <1><c8c3a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c3b>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <c8c3f>   DW_AT_decl_file   : 9
    <c8c40>   DW_AT_decl_line   : 91
    <c8c41>   DW_AT_decl_column : 23
    <c8c42>   DW_AT_type        : <0xc8c46>
 <1><c8c46>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8c47>   DW_AT_byte_size   : 8
    <c8c47>   DW_AT_type        : <0xc8c4b>
 <1><c8c4b>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <c8c4c>   DW_AT_prototyped  : 1
    <c8c4c>   DW_AT_sibling     : <0xc8c56>
 <2><c8c50>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8c51>   DW_AT_type        : <0xc8c56>
 <2><c8c55>: Abbrev Number: 0
 <1><c8c56>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c8c57>   DW_AT_byte_size   : 8
    <c8c57>   DW_AT_type        : <0xc8929>
 <1><c8c5b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c8c5c>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <c8c60>   DW_AT_byte_size   : 224
    <c8c61>   DW_AT_decl_file   : 9
    <c8c62>   DW_AT_decl_line   : 93
    <c8c63>   DW_AT_decl_column : 16
    <c8c64>   DW_AT_sibling     : <0xc8dd5>
 <2><c8c68>: Abbrev Number: 2 (DW_TAG_member)
    <c8c69>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <c8c6d>   DW_AT_decl_file   : 9
    <c8c6e>   DW_AT_decl_line   : 94
    <c8c6f>   DW_AT_decl_column : 23
    <c8c70>   DW_AT_type        : <0xc8935>
    <c8c74>   DW_AT_data_member_location: 0
 <2><c8c75>: Abbrev Number: 2 (DW_TAG_member)
    <c8c76>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <c8c7a>   DW_AT_decl_file   : 9
    <c8c7b>   DW_AT_decl_line   : 95
    <c8c7c>   DW_AT_decl_column : 23
    <c8c7d>   DW_AT_type        : <0xc894b>
    <c8c81>   DW_AT_data_member_location: 8
 <2><c8c82>: Abbrev Number: 2 (DW_TAG_member)
    <c8c83>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <c8c87>   DW_AT_decl_file   : 9
    <c8c88>   DW_AT_decl_line   : 96
    <c8c89>   DW_AT_decl_column : 23
    <c8c8a>   DW_AT_type        : <0xc8961>
    <c8c8e>   DW_AT_data_member_location: 16
 <2><c8c8f>: Abbrev Number: 2 (DW_TAG_member)
    <c8c90>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <c8c94>   DW_AT_decl_file   : 9
    <c8c95>   DW_AT_decl_line   : 97
    <c8c96>   DW_AT_decl_column : 23
    <c8c97>   DW_AT_type        : <0xc896d>
    <c8c9b>   DW_AT_data_member_location: 24
 <2><c8c9c>: Abbrev Number: 2 (DW_TAG_member)
    <c8c9d>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <c8ca1>   DW_AT_decl_file   : 9
    <c8ca2>   DW_AT_decl_line   : 98
    <c8ca3>   DW_AT_decl_column : 23
    <c8ca4>   DW_AT_type        : <0xc8989>
    <c8ca8>   DW_AT_data_member_location: 32
 <2><c8ca9>: Abbrev Number: 2 (DW_TAG_member)
    <c8caa>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <c8cae>   DW_AT_decl_file   : 9
    <c8caf>   DW_AT_decl_line   : 99
    <c8cb0>   DW_AT_decl_column : 23
    <c8cb1>   DW_AT_type        : <0xc89b3>
    <c8cb5>   DW_AT_data_member_location: 40
 <2><c8cb6>: Abbrev Number: 2 (DW_TAG_member)
    <c8cb7>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <c8cbb>   DW_AT_decl_file   : 9
    <c8cbc>   DW_AT_decl_line   : 100
    <c8cbd>   DW_AT_decl_column : 23
    <c8cbe>   DW_AT_type        : <0xc89cb>
    <c8cc2>   DW_AT_data_member_location: 48
 <2><c8cc3>: Abbrev Number: 2 (DW_TAG_member)
    <c8cc4>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <c8cc8>   DW_AT_decl_file   : 9
    <c8cc9>   DW_AT_decl_line   : 101
    <c8cca>   DW_AT_decl_column : 23
    <c8ccb>   DW_AT_type        : <0xc89f0>
    <c8ccf>   DW_AT_data_member_location: 56
 <2><c8cd0>: Abbrev Number: 2 (DW_TAG_member)
    <c8cd1>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <c8cd5>   DW_AT_decl_file   : 9
    <c8cd6>   DW_AT_decl_line   : 102
    <c8cd7>   DW_AT_decl_column : 23
    <c8cd8>   DW_AT_type        : <0xc89fc>
    <c8cdc>   DW_AT_data_member_location: 64
 <2><c8cdd>: Abbrev Number: 2 (DW_TAG_member)
    <c8cde>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <c8ce2>   DW_AT_decl_file   : 9
    <c8ce3>   DW_AT_decl_line   : 103
    <c8ce4>   DW_AT_decl_column : 23
    <c8ce5>   DW_AT_type        : <0xc8a08>
    <c8ce9>   DW_AT_data_member_location: 72
 <2><c8cea>: Abbrev Number: 2 (DW_TAG_member)
    <c8ceb>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <c8cef>   DW_AT_decl_file   : 9
    <c8cf0>   DW_AT_decl_line   : 104
    <c8cf1>   DW_AT_decl_column : 23
    <c8cf2>   DW_AT_type        : <0xc8a2e>
    <c8cf6>   DW_AT_data_member_location: 80
 <2><c8cf7>: Abbrev Number: 2 (DW_TAG_member)
    <c8cf8>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <c8cfc>   DW_AT_decl_file   : 9
    <c8cfd>   DW_AT_decl_line   : 105
    <c8cfe>   DW_AT_decl_column : 24
    <c8cff>   DW_AT_type        : <0xc8a64>
    <c8d03>   DW_AT_data_member_location: 88
 <2><c8d04>: Abbrev Number: 2 (DW_TAG_member)
    <c8d05>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <c8d09>   DW_AT_decl_file   : 9
    <c8d0a>   DW_AT_decl_line   : 106
    <c8d0b>   DW_AT_decl_column : 25
    <c8d0c>   DW_AT_type        : <0xc8a8a>
    <c8d10>   DW_AT_data_member_location: 96
 <2><c8d11>: Abbrev Number: 2 (DW_TAG_member)
    <c8d12>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <c8d16>   DW_AT_decl_file   : 9
    <c8d17>   DW_AT_decl_line   : 107
    <c8d18>   DW_AT_decl_column : 23
    <c8d19>   DW_AT_type        : <0xc8ab0>
    <c8d1d>   DW_AT_data_member_location: 104
 <2><c8d1e>: Abbrev Number: 2 (DW_TAG_member)
    <c8d1f>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <c8d23>   DW_AT_decl_file   : 9
    <c8d24>   DW_AT_decl_line   : 108
    <c8d25>   DW_AT_decl_column : 23
    <c8d26>   DW_AT_type        : <0xc8b42>
    <c8d2a>   DW_AT_data_member_location: 112
 <2><c8d2b>: Abbrev Number: 2 (DW_TAG_member)
    <c8d2c>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <c8d30>   DW_AT_decl_file   : 9
    <c8d31>   DW_AT_decl_line   : 109
    <c8d32>   DW_AT_decl_column : 23
    <c8d33>   DW_AT_type        : <0xc8b62>
    <c8d37>   DW_AT_data_member_location: 120
 <2><c8d38>: Abbrev Number: 2 (DW_TAG_member)
    <c8d39>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <c8d3d>   DW_AT_decl_file   : 9
    <c8d3e>   DW_AT_decl_line   : 110
    <c8d3f>   DW_AT_decl_column : 23
    <c8d40>   DW_AT_type        : <0xc8b96>
    <c8d44>   DW_AT_data_member_location: 128
 <2><c8d45>: Abbrev Number: 2 (DW_TAG_member)
    <c8d46>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <c8d4a>   DW_AT_decl_file   : 9
    <c8d4b>   DW_AT_decl_line   : 111
    <c8d4c>   DW_AT_decl_column : 23
    <c8d4d>   DW_AT_type        : <0xc8bc5>
    <c8d51>   DW_AT_data_member_location: 136
 <2><c8d52>: Abbrev Number: 2 (DW_TAG_member)
    <c8d53>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <c8d57>   DW_AT_decl_file   : 9
    <c8d58>   DW_AT_decl_line   : 112
    <c8d59>   DW_AT_decl_column : 23
    <c8d5a>   DW_AT_type        : <0xc8be5>
    <c8d5e>   DW_AT_data_member_location: 144
 <2><c8d5f>: Abbrev Number: 2 (DW_TAG_member)
    <c8d60>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <c8d64>   DW_AT_decl_file   : 9
    <c8d65>   DW_AT_decl_line   : 113
    <c8d66>   DW_AT_decl_column : 25
    <c8d67>   DW_AT_type        : <0xc89bf>
    <c8d6b>   DW_AT_data_member_location: 152
 <2><c8d6c>: Abbrev Number: 2 (DW_TAG_member)
    <c8d6d>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <c8d71>   DW_AT_decl_file   : 9
    <c8d72>   DW_AT_decl_line   : 114
    <c8d73>   DW_AT_decl_column : 24
    <c8d74>   DW_AT_type        : <0xc8ad5>
    <c8d78>   DW_AT_data_member_location: 160
 <2><c8d79>: Abbrev Number: 2 (DW_TAG_member)
    <c8d7a>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <c8d7e>   DW_AT_decl_file   : 9
    <c8d7f>   DW_AT_decl_line   : 115
    <c8d80>   DW_AT_decl_column : 25
    <c8d81>   DW_AT_type        : <0xc8b0e>
    <c8d85>   DW_AT_data_member_location: 168
 <2><c8d86>: Abbrev Number: 2 (DW_TAG_member)
    <c8d87>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <c8d8b>   DW_AT_decl_file   : 9
    <c8d8c>   DW_AT_decl_line   : 116
    <c8d8d>   DW_AT_decl_column : 23
    <c8d8e>   DW_AT_type        : <0xc8a3a>
    <c8d92>   DW_AT_data_member_location: 176
 <2><c8d93>: Abbrev Number: 2 (DW_TAG_member)
    <c8d94>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <c8d98>   DW_AT_decl_file   : 9
    <c8d99>   DW_AT_decl_line   : 117
    <c8d9a>   DW_AT_decl_column : 23
    <c8d9b>   DW_AT_type        : <0xc8c0a>
    <c8d9f>   DW_AT_data_member_location: 184
 <2><c8da0>: Abbrev Number: 2 (DW_TAG_member)
    <c8da1>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <c8da5>   DW_AT_decl_file   : 9
    <c8da6>   DW_AT_decl_line   : 118
    <c8da7>   DW_AT_decl_column : 22
    <c8da8>   DW_AT_type        : <0xc8c16>
    <c8dac>   DW_AT_data_member_location: 192
 <2><c8dad>: Abbrev Number: 2 (DW_TAG_member)
    <c8dae>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <c8db2>   DW_AT_decl_file   : 9
    <c8db3>   DW_AT_decl_line   : 119
    <c8db4>   DW_AT_decl_column : 23
    <c8db5>   DW_AT_type        : <0xc8c22>
    <c8db9>   DW_AT_data_member_location: 200
 <2><c8dba>: Abbrev Number: 2 (DW_TAG_member)
    <c8dbb>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <c8dbf>   DW_AT_decl_file   : 9
    <c8dc0>   DW_AT_decl_line   : 120
    <c8dc1>   DW_AT_decl_column : 22
    <c8dc2>   DW_AT_type        : <0xc8c2e>
    <c8dc6>   DW_AT_data_member_location: 208
 <2><c8dc7>: Abbrev Number: 2 (DW_TAG_member)
    <c8dc8>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <c8dcc>   DW_AT_decl_file   : 9
    <c8dcd>   DW_AT_decl_line   : 121
    <c8dce>   DW_AT_decl_column : 23
    <c8dcf>   DW_AT_type        : <0xc8c3a>
    <c8dd3>   DW_AT_data_member_location: 216
 <2><c8dd4>: Abbrev Number: 0
 <1><c8dd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8dd6>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <c8dda>   DW_AT_decl_file   : 9
    <c8ddb>   DW_AT_decl_line   : 122
    <c8ddc>   DW_AT_decl_column : 3
    <c8ddd>   DW_AT_type        : <0xc8c5b>
 <1><c8de1>: Abbrev Number: 39 (DW_TAG_structure_type)
    <c8de2>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <c8de6>   DW_AT_byte_size   : 20848
    <c8de8>   DW_AT_decl_file   : 10
    <c8de9>   DW_AT_decl_line   : 349
    <c8deb>   DW_AT_decl_column : 16
    <c8dec>   DW_AT_sibling     : <0xc8e61>
 <2><c8df0>: Abbrev Number: 12 (DW_TAG_member)
    <c8df1>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <c8df5>   DW_AT_decl_file   : 10
    <c8df5>   DW_AT_decl_line   : 350
    <c8df7>   DW_AT_decl_column : 18
    <c8df7>   DW_AT_type        : <0xc83aa>
    <c8dfb>   DW_AT_data_member_location: 0
 <2><c8dfc>: Abbrev Number: 12 (DW_TAG_member)
    <c8dfd>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <c8e01>   DW_AT_decl_file   : 10
    <c8e01>   DW_AT_decl_line   : 351
    <c8e03>   DW_AT_decl_column : 18
    <c8e03>   DW_AT_type        : <0xc8442>
    <c8e07>   DW_AT_data_member_location: 8
 <2><c8e08>: Abbrev Number: 12 (DW_TAG_member)
    <c8e09>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <c8e0d>   DW_AT_decl_file   : 10
    <c8e0d>   DW_AT_decl_line   : 352
    <c8e0f>   DW_AT_decl_column : 18
    <c8e0f>   DW_AT_type        : <0xc848e>
    <c8e13>   DW_AT_data_member_location: 16
 <2><c8e14>: Abbrev Number: 12 (DW_TAG_member)
    <c8e15>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <c8e19>   DW_AT_decl_file   : 10
    <c8e19>   DW_AT_decl_line   : 353
    <c8e1b>   DW_AT_decl_column : 18
    <c8e1b>   DW_AT_type        : <0xc83d2>
    <c8e1f>   DW_AT_data_member_location: 40
 <2><c8e20>: Abbrev Number: 12 (DW_TAG_member)
    <c8e21>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <c8e25>   DW_AT_decl_file   : 10
    <c8e25>   DW_AT_decl_line   : 354
    <c8e27>   DW_AT_decl_column : 18
    <c8e27>   DW_AT_type        : <0xc8dd5>
    <c8e2b>   DW_AT_data_member_location: 48
 <2><c8e2c>: Abbrev Number: 14 (DW_TAG_member)
    <c8e2d>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <c8e31>   DW_AT_decl_file   : 10
    <c8e31>   DW_AT_decl_line   : 355
    <c8e33>   DW_AT_decl_column : 18
    <c8e33>   DW_AT_type        : <0xc8e61>
    <c8e37>   DW_AT_data_member_location: 272
 <2><c8e39>: Abbrev Number: 14 (DW_TAG_member)
    <c8e3a>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <c8e3e>   DW_AT_decl_file   : 10
    <c8e3e>   DW_AT_decl_line   : 356
    <c8e40>   DW_AT_decl_column : 18
    <c8e40>   DW_AT_type        : <0xc83aa>
    <c8e44>   DW_AT_data_member_location: 20832
 <2><c8e46>: Abbrev Number: 14 (DW_TAG_member)
    <c8e47>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <c8e4b>   DW_AT_decl_file   : 10
    <c8e4b>   DW_AT_decl_line   : 357
    <c8e4d>   DW_AT_decl_column : 18
    <c8e4d>   DW_AT_type        : <0xc83aa>
    <c8e51>   DW_AT_data_member_location: 20836
 <2><c8e53>: Abbrev Number: 14 (DW_TAG_member)
    <c8e54>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <c8e58>   DW_AT_decl_file   : 10
    <c8e58>   DW_AT_decl_line   : 358
    <c8e5a>   DW_AT_decl_column : 18
    <c8e5a>   DW_AT_type        : <0xc8453>
    <c8e5e>   DW_AT_data_member_location: 20840
 <2><c8e60>: Abbrev Number: 0
 <1><c8e61>: Abbrev Number: 19 (DW_TAG_array_type)
    <c8e62>   DW_AT_type        : <0xc886f>
    <c8e66>   DW_AT_sibling     : <0xc8e72>
 <2><c8e6a>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <c8e6b>   DW_AT_type        : <0xc8395>
    <c8e6f>   DW_AT_upper_bound : 256
 <2><c8e71>: Abbrev Number: 0
 <1><c8e72>: Abbrev Number: 18 (DW_TAG_typedef)
    <c8e73>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <c8e77>   DW_AT_decl_file   : 10
    <c8e78>   DW_AT_decl_line   : 359
    <c8e7a>   DW_AT_decl_column : 3
    <c8e7b>   DW_AT_type        : <0xc8de1>
 <1><c8e7f>: Abbrev Number: 41 (DW_TAG_variable)
    <c8e80>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <c8e84>   DW_AT_decl_file   : 10
    <c8e85>   DW_AT_decl_line   : 361
    <c8e87>   DW_AT_decl_column : 21
    <c8e88>   DW_AT_type        : <0xc8e72>
    <c8e8c>   DW_AT_external    : 1
    <c8e8c>   DW_AT_declaration : 1
 <1><c8e8c>: Abbrev Number: 42 (DW_TAG_subprogram)
    <c8e8d>   DW_AT_external    : 1
    <c8e8d>   DW_AT_name        : (indirect string, offset: 0x1bbe5): fb_hFilePrintBufferEx
    <c8e91>   DW_AT_decl_file   : 7
    <c8e92>   DW_AT_decl_line   : 304
    <c8e94>   DW_AT_decl_column : 21
    <c8e95>   DW_AT_prototyped  : 1
    <c8e95>   DW_AT_type        : <0xc83aa>
    <c8e99>   DW_AT_declaration : 1
    <c8e99>   DW_AT_sibling     : <0xc8ead>
 <2><c8e9d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8e9e>   DW_AT_type        : <0xc887b>
 <2><c8ea2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ea3>   DW_AT_type        : <0xc8437>
 <2><c8ea7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ea8>   DW_AT_type        : <0xc83e3>
 <2><c8eac>: Abbrev Number: 0
 <1><c8ead>: Abbrev Number: 43 (DW_TAG_subprogram)
    <c8eae>   DW_AT_external    : 1
    <c8eae>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <c8eb2>   DW_AT_decl_file   : 6
    <c8eb3>   DW_AT_decl_line   : 111
    <c8eb4>   DW_AT_decl_column : 21
    <c8eb5>   DW_AT_prototyped  : 1
    <c8eb5>   DW_AT_type        : <0xc83aa>
    <c8eb9>   DW_AT_declaration : 1
    <c8eb9>   DW_AT_sibling     : <0xc8ec3>
 <2><c8ebd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ebe>   DW_AT_type        : <0xc875f>
 <2><c8ec2>: Abbrev Number: 0
 <1><c8ec3>: Abbrev Number: 44 (DW_TAG_subprogram)
    <c8ec4>   DW_AT_external    : 1
    <c8ec4>   DW_AT_name        : (indirect string, offset: 0x1bbb6): fb_PrintVoidEx
    <c8ec8>   DW_AT_decl_file   : 11
    <c8ec9>   DW_AT_decl_line   : 97
    <c8eca>   DW_AT_decl_column : 21
    <c8ecb>   DW_AT_prototyped  : 1
    <c8ecb>   DW_AT_declaration : 1
    <c8ecb>   DW_AT_sibling     : <0xc8eda>
 <2><c8ecf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ed0>   DW_AT_type        : <0xc887b>
 <2><c8ed4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c8ed5>   DW_AT_type        : <0xc83aa>
 <2><c8ed9>: Abbrev Number: 0
 <1><c8eda>: Abbrev Number: 45 (DW_TAG_subprogram)
    <c8edb>   DW_AT_external    : 1
    <c8edb>   DW_AT_name        : (indirect string, offset: 0x482): fb_PrintString
    <c8edf>   DW_AT_decl_file   : 1
    <c8ee0>   DW_AT_decl_line   : 34
    <c8ee1>   DW_AT_decl_column : 13
    <c8ee2>   DW_AT_prototyped  : 1
    <c8ee2>   DW_AT_low_pc      : 0x4739c0
    <c8eea>   DW_AT_high_pc     : 0x9a
    <c8ef2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c8ef4>   DW_AT_call_all_calls: 1
    <c8ef4>   DW_AT_sibling     : <0xc8ffe>
 <2><c8ef8>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c8ef9>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <c8efd>   DW_AT_decl_file   : 1
    <c8efd>   DW_AT_decl_line   : 34
    <c8efd>   DW_AT_decl_column : 34
    <c8efe>   DW_AT_type        : <0xc83aa>
    <c8f02>   DW_AT_location    : 0x3baea (location list)
    <c8f06>   DW_AT_GNU_locviews: 0x3bae2
 <2><c8f0a>: Abbrev Number: 46 (DW_TAG_formal_parameter)
    <c8f0b>   DW_AT_name        : s
    <c8f0d>   DW_AT_decl_file   : 1
    <c8f0e>   DW_AT_decl_line   : 34
    <c8f0f>   DW_AT_decl_column : 50
    <c8f10>   DW_AT_type        : <0xc875f>
    <c8f14>   DW_AT_location    : 0x3bb17 (location list)
    <c8f18>   DW_AT_GNU_locviews: 0x3bb0b
 <2><c8f1c>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c8f1d>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <c8f21>   DW_AT_decl_file   : 1
    <c8f21>   DW_AT_decl_line   : 34
    <c8f21>   DW_AT_decl_column : 57
    <c8f22>   DW_AT_type        : <0xc83aa>
    <c8f26>   DW_AT_location    : 0x3bb4e (location list)
    <c8f2a>   DW_AT_GNU_locviews: 0x3bb44
 <2><c8f2e>: Abbrev Number: 47 (DW_TAG_inlined_subroutine)
    <c8f2f>   DW_AT_abstract_origin: <0xc8ffe>
    <c8f33>   DW_AT_entry_pc    : 0x4739f0
    <c8f3b>   DW_AT_GNU_entry_view: 0
    <c8f3c>   DW_AT_ranges      : 0x18178
    <c8f40>   DW_AT_call_file   : 1
    <c8f41>   DW_AT_call_line   : 36
    <c8f42>   DW_AT_call_column : 5
 <3><c8f43>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f44>   DW_AT_abstract_origin: <0xc901f>
    <c8f48>   DW_AT_location    : 0x3bb7c (location list)
    <c8f4c>   DW_AT_GNU_locviews: 0x3bb74
 <3><c8f50>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f51>   DW_AT_abstract_origin: <0xc9016>
    <c8f55>   DW_AT_location    : 0x3bba6 (location list)
    <c8f59>   DW_AT_GNU_locviews: 0x3bb9c
 <3><c8f5d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f5e>   DW_AT_abstract_origin: <0xc900b>
    <c8f62>   DW_AT_location    : 0x3bbd1 (location list)
    <c8f66>   DW_AT_GNU_locviews: 0x3bbcd
 <3><c8f6a>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <c8f6b>   DW_AT_abstract_origin: <0xc902b>
    <c8f6f>   DW_AT_entry_pc    : 0x473a08
    <c8f77>   DW_AT_GNU_entry_view: 0
    <c8f78>   DW_AT_ranges      : 0x18183
    <c8f7c>   DW_AT_call_file   : 1
    <c8f7c>   DW_AT_call_line   : 27
    <c8f7c>   DW_AT_call_column : 9
    <c8f7c>   DW_AT_sibling     : <0xc8fe7>
 <4><c8f80>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f81>   DW_AT_abstract_origin: <0xc9057>
    <c8f85>   DW_AT_location    : 0x3bbe4 (location list)
    <c8f89>   DW_AT_GNU_locviews: 0x3bbe0
 <4><c8f8d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f8e>   DW_AT_abstract_origin: <0xc904c>
    <c8f92>   DW_AT_location    : 0x3bbf9 (location list)
    <c8f96>   DW_AT_GNU_locviews: 0x3bbf3
 <4><c8f9a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8f9b>   DW_AT_abstract_origin: <0xc9043>
    <c8f9f>   DW_AT_location    : 0x3bc19 (location list)
    <c8fa3>   DW_AT_GNU_locviews: 0x3bc15
 <4><c8fa7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c8fa8>   DW_AT_abstract_origin: <0xc9038>
    <c8fac>   DW_AT_location    : 0x3bc2c (location list)
    <c8fb0>   DW_AT_GNU_locviews: 0x3bc28
 <4><c8fb4>: Abbrev Number: 26 (DW_TAG_call_site)
    <c8fb5>   DW_AT_call_return_pc: 0x473a19
    <c8fbd>   DW_AT_call_origin : <0xc8ec3>
    <c8fc1>   DW_AT_sibling     : <0xc8fd2>
 <5><c8fc5>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c8fc6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c8fc8>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><c8fcb>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c8fcc>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c8fce>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><c8fd1>: Abbrev Number: 0
 <4><c8fd2>: Abbrev Number: 27 (DW_TAG_call_site)
    <c8fd3>   DW_AT_call_return_pc: 0x473a38
    <c8fdb>   DW_AT_call_origin : <0xc8e8c>
 <5><c8fdf>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c8fe0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c8fe2>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><c8fe5>: Abbrev Number: 0
 <4><c8fe6>: Abbrev Number: 0
 <3><c8fe7>: Abbrev Number: 28 (DW_TAG_call_site)
    <c8fe8>   DW_AT_call_return_pc: 0x473a26
    <c8ff0>   DW_AT_call_tail_call: 1
    <c8ff0>   DW_AT_call_origin : <0xc8ead>
 <4><c8ff4>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c8ff5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c8ff7>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <4><c8ffb>: Abbrev Number: 0
 <3><c8ffc>: Abbrev Number: 0
 <2><c8ffd>: Abbrev Number: 0
 <1><c8ffe>: Abbrev Number: 48 (DW_TAG_subprogram)
    <c8fff>   DW_AT_external    : 1
    <c8fff>   DW_AT_name        : (indirect string, offset: 0x1bbd4): fb_PrintStringEx
    <c9003>   DW_AT_decl_file   : 1
    <c9004>   DW_AT_decl_line   : 22
    <c9005>   DW_AT_decl_column : 6
    <c9006>   DW_AT_prototyped  : 1
    <c9006>   DW_AT_inline      : 1	(inlined)
    <c9007>   DW_AT_sibling     : <0xc902b>
 <2><c900b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c900c>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <c9010>   DW_AT_decl_file   : 1
    <c9010>   DW_AT_decl_line   : 22
    <c9011>   DW_AT_decl_column : 34
    <c9012>   DW_AT_type        : <0xc887b>
 <2><c9016>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <c9017>   DW_AT_name        : s
    <c9019>   DW_AT_decl_file   : 1
    <c9019>   DW_AT_decl_line   : 22
    <c901a>   DW_AT_decl_column : 52
    <c901b>   DW_AT_type        : <0xc875f>
 <2><c901f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c9020>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <c9024>   DW_AT_decl_file   : 1
    <c9024>   DW_AT_decl_line   : 22
    <c9025>   DW_AT_decl_column : 59
    <c9026>   DW_AT_type        : <0xc83aa>
 <2><c902a>: Abbrev Number: 0
 <1><c902b>: Abbrev Number: 49 (DW_TAG_subprogram)
    <c902c>   DW_AT_name        : (indirect string, offset: 0x1bbc5): fb_hPrintStrEx
    <c9030>   DW_AT_decl_file   : 1
    <c9031>   DW_AT_decl_line   : 6
    <c9032>   DW_AT_decl_column : 13
    <c9033>   DW_AT_prototyped  : 1
    <c9033>   DW_AT_inline      : 1	(inlined)
    <c9034>   DW_AT_sibling     : <0xc9063>
 <2><c9038>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c9039>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <c903d>   DW_AT_decl_file   : 1
    <c903d>   DW_AT_decl_line   : 6
    <c903e>   DW_AT_decl_column : 38
    <c903f>   DW_AT_type        : <0xc887b>
 <2><c9043>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <c9044>   DW_AT_name        : s
    <c9046>   DW_AT_decl_file   : 1
    <c9046>   DW_AT_decl_line   : 6
    <c9047>   DW_AT_decl_column : 58
    <c9048>   DW_AT_type        : <0xc843d>
 <2><c904c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <c904d>   DW_AT_name        : len
    <c9051>   DW_AT_decl_file   : 1
    <c9051>   DW_AT_decl_line   : 6
    <c9052>   DW_AT_decl_column : 68
    <c9053>   DW_AT_type        : <0xc83e3>
 <2><c9057>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c9058>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <c905c>   DW_AT_decl_file   : 1
    <c905c>   DW_AT_decl_line   : 6
    <c905d>   DW_AT_decl_column : 77
    <c905e>   DW_AT_type        : <0xc83aa>
 <2><c9062>: Abbrev Number: 0
 <1><c9063>: Abbrev Number: 50 (DW_TAG_subprogram)
    <c9064>   DW_AT_abstract_origin: <0xc8ffe>
    <c9068>   DW_AT_low_pc      : 0x473960
    <c9070>   DW_AT_high_pc     : 0x59
    <c9078>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c907a>   DW_AT_call_all_calls: 1
 <2><c907a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c907b>   DW_AT_abstract_origin: <0xc900b>
    <c907f>   DW_AT_location    : 0x3bc43 (location list)
    <c9083>   DW_AT_GNU_locviews: 0x3bc3b
 <2><c9087>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c9088>   DW_AT_abstract_origin: <0xc9016>
    <c908c>   DW_AT_location    : 0x3bc66 (location list)
    <c9090>   DW_AT_GNU_locviews: 0x3bc5c
 <2><c9094>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c9095>   DW_AT_abstract_origin: <0xc901f>
    <c9099>   DW_AT_location    : 0x3bc8b (location list)
    <c909d>   DW_AT_GNU_locviews: 0x3bc83
 <2><c90a1>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <c90a2>   DW_AT_abstract_origin: <0xc902b>
    <c90a6>   DW_AT_entry_pc    : 0x473984
    <c90ae>   DW_AT_GNU_entry_view: 0
    <c90af>   DW_AT_ranges      : 0x18171
    <c90b3>   DW_AT_call_file   : 1
    <c90b3>   DW_AT_call_line   : 27
    <c90b3>   DW_AT_call_column : 9
    <c90b3>   DW_AT_sibling     : <0xc9101>
 <3><c90b7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c90b8>   DW_AT_abstract_origin: <0xc9057>
    <c90bc>   DW_AT_location    : 0x3bca7 (location list)
    <c90c0>   DW_AT_GNU_locviews: 0x3bca3
 <3><c90c4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c90c5>   DW_AT_abstract_origin: <0xc904c>
    <c90c9>   DW_AT_location    : 0x3bcb8 (location list)
    <c90cd>   DW_AT_GNU_locviews: 0x3bcb2
 <3><c90d1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c90d2>   DW_AT_abstract_origin: <0xc9043>
    <c90d6>   DW_AT_location    : 0x3bcd2 (location list)
    <c90da>   DW_AT_GNU_locviews: 0x3bcce
 <3><c90de>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c90df>   DW_AT_abstract_origin: <0xc9038>
    <c90e3>   DW_AT_location    : 0x3bce3 (location list)
    <c90e7>   DW_AT_GNU_locviews: 0x3bcdd
 <3><c90eb>: Abbrev Number: 27 (DW_TAG_call_site)
    <c90ec>   DW_AT_call_return_pc: 0x4739b2
    <c90f4>   DW_AT_call_origin : <0xc8e8c>
 <4><c90f8>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c90f9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c90fb>   DW_AT_call_value  : 3 byte block: 91 58 6 	(DW_OP_fbreg: -40; DW_OP_deref)
 <4><c90ff>: Abbrev Number: 0
 <3><c9100>: Abbrev Number: 0
 <2><c9101>: Abbrev Number: 26 (DW_TAG_call_site)
    <c9102>   DW_AT_call_return_pc: 0x473992
    <c910a>   DW_AT_call_origin : <0xc8ec3>
    <c910e>   DW_AT_sibling     : <0xc9119>
 <3><c9112>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c9113>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c9115>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><c9118>: Abbrev Number: 0
 <2><c9119>: Abbrev Number: 28 (DW_TAG_call_site)
    <c911a>   DW_AT_call_return_pc: 0x4739a1
    <c9122>   DW_AT_call_tail_call: 1
    <c9122>   DW_AT_call_origin : <0xc8ead>
 <3><c9126>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <c9127>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c9129>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><c912d>: Abbrev Number: 0
 <2><c912e>: Abbrev Number: 0
 <1><c912f>: Abbrev Number: 0
  Compilation Unit @ offset 0xc9130:
   Length:        0xe20 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x10845
   Pointer Size:  8
 <0><c913c>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <c913d>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c9141>   DW_AT_language    : 29	(C11)
    <c9142>   DW_AT_name        : (indirect line string, offset: 0x10f5): src/rtlib/io_print_fix.c
    <c9146>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c914a>   DW_AT_low_pc      : 0x473a60
    <c9152>   DW_AT_high_pc     : 0xea
    <c915a>   DW_AT_stmt_list   : 0x683fb
 <1><c915e>: Abbrev Number: 7 (DW_TAG_base_type)
    <c915f>   DW_AT_byte_size   : 1
    <c9160>   DW_AT_encoding    : 8	(unsigned char)
    <c9161>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c9165>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9166>   DW_AT_byte_size   : 2
    <c9167>   DW_AT_encoding    : 7	(unsigned)
    <c9168>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c916c>: Abbrev Number: 7 (DW_TAG_base_type)
    <c916d>   DW_AT_byte_size   : 4
    <c916e>   DW_AT_encoding    : 7	(unsigned)
    <c916f>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c9173>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9174>   DW_AT_byte_size   : 8
    <c9175>   DW_AT_encoding    : 7	(unsigned)
    <c9176>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c917a>: Abbrev Number: 7 (DW_TAG_base_type)
    <c917b>   DW_AT_byte_size   : 1
    <c917c>   DW_AT_encoding    : 6	(signed char)
    <c917d>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c9181>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9182>   DW_AT_byte_size   : 2
    <c9183>   DW_AT_encoding    : 5	(signed)
    <c9184>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c9188>: Abbrev Number: 32 (DW_TAG_base_type)
    <c9189>   DW_AT_byte_size   : 4
    <c918a>   DW_AT_encoding    : 5	(signed)
    <c918b>   DW_AT_name        : int
 <1><c918f>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9190>   DW_AT_byte_size   : 8
    <c9191>   DW_AT_encoding    : 5	(signed)
    <c9192>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c9196>: Abbrev Number: 3 (DW_TAG_typedef)
    <c9197>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c919b>   DW_AT_decl_file   : 2
    <c919c>   DW_AT_decl_line   : 153
    <c919d>   DW_AT_decl_column : 27
    <c919e>   DW_AT_type        : <0xc918f>
 <1><c91a2>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <c91a3>   DW_AT_byte_size   : 8
 <1><c91a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <c91a5>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <c91a9>   DW_AT_decl_file   : 2
    <c91aa>   DW_AT_decl_line   : 194
    <c91ab>   DW_AT_decl_column : 27
    <c91ac>   DW_AT_type        : <0xc918f>
 <1><c91b0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c91b1>   DW_AT_byte_size   : 8
    <c91b1>   DW_AT_type        : <0xc91b5>
 <1><c91b5>: Abbrev Number: 7 (DW_TAG_base_type)
    <c91b6>   DW_AT_byte_size   : 1
    <c91b7>   DW_AT_encoding    : 6	(signed char)
    <c91b8>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c91bc>: Abbrev Number: 17 (DW_TAG_const_type)
    <c91bd>   DW_AT_type        : <0xc91b5>
 <1><c91c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c91c2>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c91c6>   DW_AT_decl_file   : 3
    <c91c7>   DW_AT_decl_line   : 209
    <c91c8>   DW_AT_decl_column : 23
    <c91c9>   DW_AT_type        : <0xc9173>
 <1><c91cd>: Abbrev Number: 18 (DW_TAG_typedef)
    <c91ce>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <c91d2>   DW_AT_decl_file   : 3
    <c91d3>   DW_AT_decl_line   : 321
    <c91d5>   DW_AT_decl_column : 24
    <c91d6>   DW_AT_type        : <0xc9188>
 <1><c91da>: Abbrev Number: 17 (DW_TAG_const_type)
    <c91db>   DW_AT_type        : <0xc91cd>
 <1><c91df>: Abbrev Number: 7 (DW_TAG_base_type)
    <c91e0>   DW_AT_byte_size   : 8
    <c91e1>   DW_AT_encoding    : 5	(signed)
    <c91e2>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c91e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c91e7>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <c91eb>   DW_AT_decl_file   : 4
    <c91ec>   DW_AT_decl_line   : 87
    <c91ed>   DW_AT_decl_column : 19
    <c91ee>   DW_AT_type        : <0xc9196>
 <1><c91f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <c91f3>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <c91f7>   DW_AT_decl_file   : 4
    <c91f8>   DW_AT_decl_line   : 108
    <c91f9>   DW_AT_decl_column : 19
    <c91fa>   DW_AT_type        : <0xc91a4>
 <1><c91fe>: Abbrev Number: 7 (DW_TAG_base_type)
    <c91ff>   DW_AT_byte_size   : 8
    <c9200>   DW_AT_encoding    : 7	(unsigned)
    <c9201>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c9205>: Abbrev Number: 19 (DW_TAG_array_type)
    <c9206>   DW_AT_type        : <0xc91b5>
    <c920a>   DW_AT_sibling     : <0xc9215>
 <2><c920e>: Abbrev Number: 34 (DW_TAG_subrange_type)
    <c920f>   DW_AT_type        : <0xc9173>
    <c9213>   DW_AT_upper_bound : 3
 <2><c9214>: Abbrev Number: 0
 <1><c9215>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c9216>   DW_AT_byte_size   : 8
    <c9216>   DW_AT_type        : <0xc921a>
 <1><c921a>: Abbrev Number: 35 (DW_TAG_const_type)
 <1><c921b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c921c>   DW_AT_byte_size   : 8
    <c921c>   DW_AT_type        : <0xc91bc>
 <1><c9220>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c9221>   DW_AT_byte_size   : 8
    <c9221>   DW_AT_type        : <0xc91b0>
 <1><c9225>: Abbrev Number: 3 (DW_TAG_typedef)
    <c9226>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <c922a>   DW_AT_decl_file   : 5
    <c922b>   DW_AT_decl_line   : 22
    <c922c>   DW_AT_decl_column : 15
    <c922d>   DW_AT_type        : <0xc91e6>
 <1><c9231>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c9232>   DW_AT_byte_size   : 8
    <c9232>   DW_AT_type        : <0xc9236>
 <1><c9236>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <c9237>   DW_AT_prototyped  : 1
 <1><c9237>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c9238>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <c923c>   DW_AT_byte_size   : 24
    <c923d>   DW_AT_decl_file   : 6
    <c923e>   DW_AT_decl_line   : 82
    <c923f>   DW_AT_decl_column : 16
    <c9240>   DW_AT_sibling     : <0xc926c>
 <2><c9244>: Abbrev Number: 2 (DW_TAG_member)
    <c9245>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <c9249>   DW_AT_decl_file   : 6
    <c924a>   DW_AT_decl_line   : 83
    <c924b>   DW_AT_decl_column : 21
    <c924c>   DW_AT_type        : <0xc91b0>
    <c9250>   DW_AT_data_member_location: 0
 <2><c9251>: Abbrev Number: 9 (DW_TAG_member)
    <c9252>   DW_AT_name        : len
    <c9256>   DW_AT_decl_file   : 6
    <c9257>   DW_AT_decl_line   : 84
    <c9258>   DW_AT_decl_column : 21
    <c9259>   DW_AT_type        : <0xc91f2>
    <c925d>   DW_AT_data_member_location: 8
 <2><c925e>: Abbrev Number: 2 (DW_TAG_member)
    <c925f>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c9263>   DW_AT_decl_file   : 6
    <c9264>   DW_AT_decl_line   : 85
    <c9265>   DW_AT_decl_column : 21
    <c9266>   DW_AT_type        : <0xc91f2>
    <c926a>   DW_AT_data_member_location: 16
 <2><c926b>: Abbrev Number: 0
 <1><c926c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c926d>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <c9271>   DW_AT_decl_file   : 6
    <c9272>   DW_AT_decl_line   : 86
    <c9273>   DW_AT_decl_column : 3
    <c9274>   DW_AT_type        : <0xc9237>
 <1><c9278>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9279>   DW_AT_byte_size   : 8
    <c927a>   DW_AT_encoding    : 4	(float)
    <c927b>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c927f>: Abbrev Number: 7 (DW_TAG_base_type)
    <c9280>   DW_AT_byte_size   : 4
    <c9281>   DW_AT_encoding    : 4	(float)
    <c9282>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c9286>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c9287>   DW_AT_byte_size   : 8
    <c9287>   DW_AT_type        : <0xc91cd>
 <1><c928b>: Abbrev Number: 37 (DW_TAG_enumeration_type)
    <c928c>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <c9290>   DW_AT_encoding    : 7	(unsigned)
    <c9291>   DW_AT_byte_size   : 4
    <c9292>   DW_AT_type        : <0xc916c>
    <c9296>   DW_AT_decl_file   : 7
    <c9297>   DW_AT_decl_line   : 25
    <c9298>   DW_AT_decl_column : 14
    <c9299>   DW_AT_sibling     : <0xc92b6>
 <2><c929d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c929e>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <c92a2>   DW_AT_const_value : 0
 <2><c92a3>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c92a4>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <c92a8>   DW_AT_const_value : 1
 <2><c92a9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c92aa>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <c92ae>   DW_AT_const_value : 2
 <2><c92af>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c92b0>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <c92b4>   DW_AT_const_value : 3
 <2><c92b5>: Abbrev Number: 0
 <1><c92b6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c92b7>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <c92bb>   DW_AT_decl_file   : 7
    <c92bc>   DW_AT_decl_line   : 30
    <c92bd>   DW_AT_decl_column : 3
    <c92be>   DW_AT_type        : <0xc928b>
 <1><c92c2>: Abbrev Number: 3 (DW_TAG_typedef)
    <c92c3>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <c92c7>   DW_AT_decl_file   : 7
    <c92c8>   DW_AT_decl_line   : 54
    <c92c9>   DW_AT_decl_column : 15
    <c92ca>   DW_AT_type        : <0xc92ce>
 <1><c92ce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c92cf>   DW_AT_byte_size   : 8
    <c92cf>   DW_AT_type        : <0xc92d3>
 <1><c92d3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c92d4>   DW_AT_prototyped  : 1
    <c92d4>   DW_AT_type        : <0xc9188>
    <c92d8>   DW_AT_sibling     : <0xc92e7>
 <2><c92dc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c92dd>   DW_AT_type        : <0xc92e7>
 <2><c92e1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c92e2>   DW_AT_type        : <0xc9188>
 <2><c92e6>: Abbrev Number: 0
 <1><c92e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c92e8>   DW_AT_byte_size   : 8
    <c92e8>   DW_AT_type        : <0xc92ec>
 <1><c92ec>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c92ed>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <c92f1>   DW_AT_byte_size   : 80
    <c92f2>   DW_AT_decl_file   : 7
    <c92f3>   DW_AT_decl_line   : 97
    <c92f4>   DW_AT_decl_column : 16
    <c92f5>   DW_AT_sibling     : <0xc93b0>
 <2><c92f9>: Abbrev Number: 2 (DW_TAG_member)
    <c92fa>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <c92fe>   DW_AT_decl_file   : 7
    <c92ff>   DW_AT_decl_line   : 98
    <c9300>   DW_AT_decl_column : 21
    <c9301>   DW_AT_type        : <0xc9188>
    <c9305>   DW_AT_data_member_location: 0
 <2><c9306>: Abbrev Number: 9 (DW_TAG_member)
    <c9307>   DW_AT_name        : len
    <c930b>   DW_AT_decl_file   : 7
    <c930c>   DW_AT_decl_line   : 99
    <c930d>   DW_AT_decl_column : 21
    <c930e>   DW_AT_type        : <0xc9188>
    <c9312>   DW_AT_data_member_location: 4
 <2><c9313>: Abbrev Number: 2 (DW_TAG_member)
    <c9314>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <c9318>   DW_AT_decl_file   : 7
    <c9319>   DW_AT_decl_line   : 100
    <c931a>   DW_AT_decl_column : 21
    <c931b>   DW_AT_type        : <0xc92b6>
    <c931f>   DW_AT_data_member_location: 8
 <2><c9320>: Abbrev Number: 2 (DW_TAG_member)
    <c9321>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c9325>   DW_AT_decl_file   : 7
    <c9326>   DW_AT_decl_line   : 101
    <c9327>   DW_AT_decl_column : 21
    <c9328>   DW_AT_type        : <0xc9225>
    <c932c>   DW_AT_data_member_location: 16
 <2><c932d>: Abbrev Number: 2 (DW_TAG_member)
    <c932e>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c9332>   DW_AT_decl_file   : 7
    <c9333>   DW_AT_decl_line   : 102
    <c9334>   DW_AT_decl_column : 21
    <c9335>   DW_AT_type        : <0xc9188>
    <c9339>   DW_AT_data_member_location: 24
 <2><c933a>: Abbrev Number: 2 (DW_TAG_member)
    <c933b>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <c933f>   DW_AT_decl_file   : 7
    <c9340>   DW_AT_decl_line   : 103
    <c9341>   DW_AT_decl_column : 21
    <c9342>   DW_AT_type        : <0xc9188>
    <c9346>   DW_AT_data_member_location: 28
 <2><c9347>: Abbrev Number: 2 (DW_TAG_member)
    <c9348>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <c934c>   DW_AT_decl_file   : 7
    <c934d>   DW_AT_decl_line   : 104
    <c934e>   DW_AT_decl_column : 21
    <c934f>   DW_AT_type        : <0xc9188>
    <c9353>   DW_AT_data_member_location: 32
 <2><c9354>: Abbrev Number: 2 (DW_TAG_member)
    <c9355>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <c9359>   DW_AT_decl_file   : 7
    <c935a>   DW_AT_decl_line   : 105
    <c935b>   DW_AT_decl_column : 21
    <c935c>   DW_AT_type        : <0xc916c>
    <c9360>   DW_AT_data_member_location: 36
 <2><c9361>: Abbrev Number: 2 (DW_TAG_member)
    <c9362>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <c9366>   DW_AT_decl_file   : 7
    <c9367>   DW_AT_decl_line   : 106
    <c9368>   DW_AT_decl_column : 21
    <c9369>   DW_AT_type        : <0xc916c>
    <c936d>   DW_AT_data_member_location: 40
 <2><c936e>: Abbrev Number: 2 (DW_TAG_member)
    <c936f>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <c9373>   DW_AT_decl_file   : 7
    <c9374>   DW_AT_decl_line   : 109
    <c9375>   DW_AT_decl_column : 21
    <c9376>   DW_AT_type        : <0xc9205>
    <c937a>   DW_AT_data_member_location: 44
 <2><c937b>: Abbrev Number: 2 (DW_TAG_member)
    <c937c>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <c9380>   DW_AT_decl_file   : 7
    <c9381>   DW_AT_decl_line   : 110
    <c9382>   DW_AT_decl_column : 21
    <c9383>   DW_AT_type        : <0xc91c1>
    <c9387>   DW_AT_data_member_location: 48
 <2><c9388>: Abbrev Number: 2 (DW_TAG_member)
    <c9389>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <c938d>   DW_AT_decl_file   : 7
    <c938e>   DW_AT_decl_line   : 112
    <c938f>   DW_AT_decl_column : 22
    <c9390>   DW_AT_type        : <0xc9648>
    <c9394>   DW_AT_data_member_location: 56
 <2><c9395>: Abbrev Number: 2 (DW_TAG_member)
    <c9396>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <c939a>   DW_AT_decl_file   : 7
    <c939b>   DW_AT_decl_line   : 114
    <c939c>   DW_AT_decl_column : 14
    <c939d>   DW_AT_type        : <0xc91a2>
    <c93a1>   DW_AT_data_member_location: 64
 <2><c93a2>: Abbrev Number: 2 (DW_TAG_member)
    <c93a3>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <c93a7>   DW_AT_decl_file   : 7
    <c93a8>   DW_AT_decl_line   : 116
    <c93a9>   DW_AT_decl_column : 22
    <c93aa>   DW_AT_type        : <0xc92e7>
    <c93ae>   DW_AT_data_member_location: 72
 <2><c93af>: Abbrev Number: 0
 <1><c93b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c93b1>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <c93b5>   DW_AT_decl_file   : 7
    <c93b6>   DW_AT_decl_line   : 59
    <c93b7>   DW_AT_decl_column : 15
    <c93b8>   DW_AT_type        : <0xc93bc>
 <1><c93bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c93bd>   DW_AT_byte_size   : 8
    <c93bd>   DW_AT_type        : <0xc93c1>
 <1><c93c1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c93c2>   DW_AT_prototyped  : 1
    <c93c2>   DW_AT_type        : <0xc9188>
    <c93c6>   DW_AT_sibling     : <0xc93d0>
 <2><c93ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c93cb>   DW_AT_type        : <0xc92e7>
 <2><c93cf>: Abbrev Number: 0
 <1><c93d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c93d1>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <c93d5>   DW_AT_decl_file   : 7
    <c93d6>   DW_AT_decl_line   : 60
    <c93d7>   DW_AT_decl_column : 15
    <c93d8>   DW_AT_type        : <0xc93bc>
 <1><c93dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <c93dd>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <c93e1>   DW_AT_decl_file   : 7
    <c93e2>   DW_AT_decl_line   : 61
    <c93e3>   DW_AT_decl_column : 15
    <c93e4>   DW_AT_type        : <0xc93e8>
 <1><c93e8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c93e9>   DW_AT_byte_size   : 8
    <c93e9>   DW_AT_type        : <0xc93ed>
