    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x8a471
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000461580 0000000000000058 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x8a59f
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    00000000004615e0 000000000000006f 
    0000000000000000 0000000000000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x8a990
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x8b0e3
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000461650 00000000000002a3 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x8b911
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000461900 0000000000000134 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x8c392
  Pointer Size:             8
  Segment Size:             0


    <103>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <105>   DW_AT_call_all_calls: 1
 <2><105>: Abbrev Number: 4 (DW_TAG_call_site)
    <106>   DW_AT_call_return_pc: 0x406105
    <10e>   DW_AT_call_tail_call: 1
    <10e>   DW_AT_call_origin : <0xb9>
 <2><112>: Abbrev Number: 0
 <1><113>: Abbrev Number: 0
  Compilation Unit @ offset 0x114:
   Length:        0x72d9f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x95
   Pointer Size:  8
 <0><120>: Abbrev Number: 78 (DW_TAG_compile_unit)
    <121>   DW_AT_producer    : (indirect string, offset: 0x52b): GNU C17 11.1.0 -m64 -march=x86-64 -mfpmath=sse -msse2 -masm=intel -mcmodel=small -msse2avx -g -O0 -Ofast -O3 -fno-strict-aliasing -frounding-math -fno-math-errno -fwrapv -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables -ffp-contract=fast -foptimize-sibling-calls -foptimize-strlen -fno-inline
    <125>   DW_AT_language    : 29	(C11)
    <126>   DW_AT_name        : (indirect line string, offset: 0x59): c64dvd-glsl.c
    <12a>   DW_AT_comp_dir    : (indirect line string, offset: 0x67): /home/main/project-manhattan
    <12e>   DW_AT_ranges      : 0x1710c
    <132>   DW_AT_low_pc      : 0x0
    <13a>   DW_AT_stmt_list   : 0x61
 <1><13e>: Abbrev Number: 43 (DW_TAG_base_type)
    <13f>   DW_AT_byte_size   : 8
    <140>   DW_AT_encoding    : 4	(float)
    <141>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><145>: Abbrev Number: 43 (DW_TAG_base_type)
    <146>   DW_AT_byte_size   : 4
    <147>   DW_AT_encoding    : 4	(float)
    <148>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><14c>: Abbrev Number: 43 (DW_TAG_base_type)
    <14d>   DW_AT_byte_size   : 8
    <14e>   DW_AT_encoding    : 5	(signed)
    <14f>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><153>: Abbrev Number: 79 (DW_TAG_base_type)
    <154>   DW_AT_byte_size   : 4
    <155>   DW_AT_encoding    : 5	(signed)
    <156>   DW_AT_name        : int
 <1><15a>: Abbrev Number: 26 (DW_TAG_typedef)
    <15b>   DW_AT_name        : (indirect string, offset: 0x141f8): int8
    <15f>   DW_AT_decl_file   : 8
    <160>   DW_AT_decl_line   : 1
    <161>   DW_AT_decl_column : 21
    <162>   DW_AT_type        : <0x166>
 <1><166>: Abbrev Number: 43 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 1
    <168>   DW_AT_encoding    : 6	(signed char)
    <169>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><16d>: Abbrev Number: 26 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0x141f7): uint8
    <172>   DW_AT_decl_file   : 8
    <173>   DW_AT_decl_line   : 2
    <174>   DW_AT_decl_column : 23
    <175>   DW_AT_type        : <0x179>
 <1><179>: Abbrev Number: 43 (DW_TAG_base_type)
    <17a>   DW_AT_byte_size   : 1
    <17b>   DW_AT_encoding    : 8	(unsigned char)
    <17c>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><180>: Abbrev Number: 26 (DW_TAG_typedef)
    <181>   DW_AT_name        : (indirect string, offset: 0x201): int16
    <185>   DW_AT_decl_file   : 8
    <186>   DW_AT_decl_line   : 3
    <187>   DW_AT_decl_column : 22
    <188>   DW_AT_type        : <0x18c>
 <1><18c>: Abbrev Number: 43 (DW_TAG_base_type)
    <18d>   DW_AT_byte_size   : 2
    <18e>   DW_AT_encoding    : 5	(signed)
    <18f>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><193>: Abbrev Number: 26 (DW_TAG_typedef)
    <194>   DW_AT_name        : (indirect string, offset: 0x200): uint16
    <198>   DW_AT_decl_file   : 8
    <199>   DW_AT_decl_line   : 4
    <19a>   DW_AT_decl_column : 24
    <19b>   DW_AT_type        : <0x19f>
 <1><19f>: Abbrev Number: 43 (DW_TAG_base_type)
    <1a0>   DW_AT_byte_size   : 2
    <1a1>   DW_AT_encoding    : 7	(unsigned)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><1a6>: Abbrev Number: 26 (DW_TAG_typedef)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x3c0): int32
    <1ab>   DW_AT_decl_file   : 8
    <1ac>   DW_AT_decl_line   : 5
    <1ad>   DW_AT_decl_column : 20
    <1ae>   DW_AT_type        : <0x153>
 <1><1b2>: Abbrev Number: 26 (DW_TAG_typedef)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x3bf): uint32
    <1b7>   DW_AT_decl_file   : 8
    <1b8>   DW_AT_decl_line   : 6
    <1b9>   DW_AT_decl_column : 22
    <1ba>   DW_AT_type        : <0x1be>
 <1><1be>: Abbrev Number: 43 (DW_TAG_base_type)
    <1bf>   DW_AT_byte_size   : 4
    <1c0>   DW_AT_encoding    : 7	(unsigned)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><1c5>: Abbrev Number: 26 (DW_TAG_typedef)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x7ca): int64
    <1ca>   DW_AT_decl_file   : 8
    <1cb>   DW_AT_decl_line   : 7
    <1cc>   DW_AT_decl_column : 26
    <1cd>   DW_AT_type        : <0x1d1>
 <1><1d1>: Abbrev Number: 43 (DW_TAG_base_type)
    <1d2>   DW_AT_byte_size   : 8
    <1d3>   DW_AT_encoding    : 5	(signed)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><1d8>: Abbrev Number: 26 (DW_TAG_typedef)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x7c9): uint64
    <1dd>   DW_AT_decl_file   : 8
    <1de>   DW_AT_decl_line   : 8
    <1df>   DW_AT_decl_column : 28
    <1e0>   DW_AT_type        : <0x1e4>
 <1><1e4>: Abbrev Number: 43 (DW_TAG_base_type)
    <1e5>   DW_AT_byte_size   : 8
    <1e6>   DW_AT_encoding    : 7	(unsigned)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><1eb>: Abbrev Number: 80 (DW_TAG_structure_type)
    <1ec>   DW_AT_byte_size   : 24
    <1ed>   DW_AT_decl_file   : 8
    <1ee>   DW_AT_decl_line   : 9
    <1ef>   DW_AT_decl_column : 9
    <1f0>   DW_AT_sibling     : <0x21b>
 <2><1f4>: Abbrev Number: 22 (DW_TAG_member)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <1f9>   DW_AT_decl_file   : 8
    <1fa>   DW_AT_decl_line   : 9
    <1fb>   DW_AT_decl_column : 24
    <1fc>   DW_AT_type        : <0x21b>
    <200>   DW_AT_data_member_location: 0
 <2><201>: Abbrev Number: 57 (DW_TAG_member)
    <202>   DW_AT_name        : len
    <206>   DW_AT_decl_file   : 8
    <207>   DW_AT_decl_line   : 9
    <208>   DW_AT_decl_column : 36
    <209>   DW_AT_type        : <0x1c5>
    <20d>   DW_AT_data_member_location: 8
 <2><20d>: Abbrev Number: 22 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <212>   DW_AT_decl_file   : 8
    <213>   DW_AT_decl_line   : 9
    <214>   DW_AT_decl_column : 47
    <215>   DW_AT_type        : <0x1c5>
    <219>   DW_AT_data_member_location: 16
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <21c>   DW_AT_byte_size   : 8
    <21c>   DW_AT_type        : <0x220>
 <1><220>: Abbrev Number: 43 (DW_TAG_base_type)
    <221>   DW_AT_byte_size   : 1
    <222>   DW_AT_encoding    : 6	(signed char)
    <223>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><227>: Abbrev Number: 26 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <22c>   DW_AT_decl_file   : 8
    <22d>   DW_AT_decl_line   : 9
    <22e>   DW_AT_decl_column : 55
    <22f>   DW_AT_type        : <0x1eb>
 <1><233>: Abbrev Number: 26 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0x17866): boolean
    <238>   DW_AT_decl_file   : 8
    <239>   DW_AT_decl_line   : 10
    <23a>   DW_AT_decl_column : 14
    <23b>   DW_AT_type        : <0x15a>
 <1><23f>: Abbrev Number: 54 (DW_TAG_structure_type)
    <240>   DW_AT_name        : (indirect string, offset: 0x113f5): $16__FB_ARRAYDIMTB$
    <244>   DW_AT_byte_size   : 24
    <245>   DW_AT_decl_file   : 8
    <246>   DW_AT_decl_line   : 11
    <247>   DW_AT_decl_column : 8
    <248>   DW_AT_sibling     : <0x274>
 <2><24c>: Abbrev Number: 22 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x8553): ELEMENTS
    <251>   DW_AT_decl_file   : 8
    <252>   DW_AT_decl_line   : 12
    <253>   DW_AT_decl_column : 8
    <254>   DW_AT_type        : <0x1c5>
    <258>   DW_AT_data_member_location: 0
 <2><259>: Abbrev Number: 22 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0x141bf): LBOUND
    <25e>   DW_AT_decl_file   : 8
    <25f>   DW_AT_decl_line   : 13
    <260>   DW_AT_decl_column : 8
    <261>   DW_AT_type        : <0x1c5>
    <265>   DW_AT_data_member_location: 8
 <2><266>: Abbrev Number: 22 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0xd1f2): UBOUND
    <26b>   DW_AT_decl_file   : 8
    <26c>   DW_AT_decl_line   : 14
    <26d>   DW_AT_decl_column : 8
    <26e>   DW_AT_type        : <0x1c5>
    <272>   DW_AT_data_member_location: 16
 <2><273>: Abbrev Number: 0
 <1><274>: Abbrev Number: 23 (DW_TAG_array_type)
    <275>   DW_AT_type        : <0x153>
    <279>   DW_AT_sibling     : <0x284>
 <2><27d>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <27e>   DW_AT_type        : <0x284>
    <282>   DW_AT_upper_bound : 0
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 43 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 8
    <286>   DW_AT_encoding    : 7	(unsigned)
    <287>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><28b>: Abbrev Number: 26 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x5f1f): tmp$83
    <290>   DW_AT_decl_file   : 2
    <291>   DW_AT_decl_line   : 183
    <292>   DW_AT_decl_column : 18
    <293>   DW_AT_type        : <0x297>
 <1><297>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <298>   DW_AT_byte_size   : 8
    <298>   DW_AT_type        : <0x29c>
 <1><29c>: Abbrev Number: 65 (DW_TAG_subroutine_type)
    <29d>   DW_AT_prototyped  : 1
    <29d>   DW_AT_type        : <0x1b2>
    <2a1>   DW_AT_sibling     : <0x2ab>
 <2><2a5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2a6>   DW_AT_type        : <0x1b2>
 <2><2aa>: Abbrev Number: 0
 <1><2ab>: Abbrev Number: 26 (DW_TAG_typedef)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x502e): tmp$12
    <2b0>   DW_AT_decl_file   : 2
    <2b1>   DW_AT_decl_line   : 184
    <2b2>   DW_AT_decl_column : 16
    <2b3>   DW_AT_type        : <0x2b7>
 <1><2b7>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <2b8>   DW_AT_byte_size   : 8
    <2b8>   DW_AT_type        : <0x2bc>
 <1><2bc>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <2bd>   DW_AT_prototyped  : 1
    <2bd>   DW_AT_sibling     : <0x2c7>
 <2><2c1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2c2>   DW_AT_type        : <0x1b2>
 <2><2c6>: Abbrev Number: 0
 <1><2c7>: Abbrev Number: 26 (DW_TAG_typedef)
    <2c8>   DW_AT_name        : (indirect string, offset: 0x6075): tmp$92
    <2cc>   DW_AT_decl_file   : 2
    <2cd>   DW_AT_decl_line   : 185
    <2ce>   DW_AT_decl_column : 16
    <2cf>   DW_AT_type        : <0x2d3>
 <1><2d3>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <2d4>   DW_AT_byte_size   : 8
    <2d4>   DW_AT_type        : <0x2d8>
 <1><2d8>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <2d9>   DW_AT_prototyped  : 1
    <2d9>   DW_AT_sibling     : <0x2f2>
 <2><2dd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2de>   DW_AT_type        : <0x1b2>
 <2><2e2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2e3>   DW_AT_type        : <0x1a6>
 <2><2e7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2e8>   DW_AT_type        : <0x2f2>
 <2><2ec>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2ed>   DW_AT_type        : <0x2fc>
 <2><2f1>: Abbrev Number: 0
 <1><2f2>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <2f3>   DW_AT_byte_size   : 8
    <2f3>   DW_AT_type        : <0x2f7>
 <1><2f7>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <2f8>   DW_AT_byte_size   : 8
    <2f8>   DW_AT_type        : <0x16d>
 <1><2fc>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <2fd>   DW_AT_byte_size   : 8
    <2fd>   DW_AT_type        : <0x1a6>
 <1><301>: Abbrev Number: 26 (DW_TAG_typedef)
    <302>   DW_AT_name        : (indirect string, offset: 0x5d69): tmp$73
    <306>   DW_AT_decl_file   : 2
    <307>   DW_AT_decl_line   : 187
    <308>   DW_AT_decl_column : 16
    <309>   DW_AT_type        : <0x30d>
 <1><30d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <30e>   DW_AT_byte_size   : 8
    <30e>   DW_AT_type        : <0x312>
 <1><312>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <313>   DW_AT_prototyped  : 1
    <313>   DW_AT_sibling     : <0x327>
 <2><317>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <318>   DW_AT_type        : <0x1b2>
 <2><31c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <31d>   DW_AT_type        : <0x1b2>
 <2><321>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <322>   DW_AT_type        : <0x2fc>
 <2><326>: Abbrev Number: 0
 <1><327>: Abbrev Number: 26 (DW_TAG_typedef)
    <328>   DW_AT_name        : (indirect string, offset: 0x5f43): tmp$87
    <32c>   DW_AT_decl_file   : 2
    <32d>   DW_AT_decl_line   : 188
    <32e>   DW_AT_decl_column : 16
    <32f>   DW_AT_type        : <0x333>
 <1><333>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <334>   DW_AT_byte_size   : 8
    <334>   DW_AT_type        : <0x338>
 <1><338>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <339>   DW_AT_prototyped  : 1
    <339>   DW_AT_sibling     : <0x352>
 <2><33d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <33e>   DW_AT_type        : <0x1b2>
 <2><342>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <343>   DW_AT_type        : <0x1a6>
 <2><347>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <348>   DW_AT_type        : <0x2fc>
 <2><34c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <34d>   DW_AT_type        : <0x2f7>
 <2><351>: Abbrev Number: 0
 <1><352>: Abbrev Number: 26 (DW_TAG_typedef)
    <353>   DW_AT_name        : (indirect string, offset: 0x5f18): tmp$82
    <357>   DW_AT_decl_file   : 2
    <358>   DW_AT_decl_line   : 190
    <359>   DW_AT_decl_column : 18
    <35a>   DW_AT_type        : <0x35e>
 <1><35e>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <35f>   DW_AT_byte_size   : 8
    <35f>   DW_AT_type        : <0x363>
 <1><363>: Abbrev Number: 81 (DW_TAG_subroutine_type)
    <364>   DW_AT_prototyped  : 1
    <364>   DW_AT_type        : <0x1b2>
 <1><368>: Abbrev Number: 26 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0x5d62): tmp$72
    <36d>   DW_AT_decl_file   : 2
    <36e>   DW_AT_decl_line   : 192
    <36f>   DW_AT_decl_column : 16
    <370>   DW_AT_type        : <0x374>
 <1><374>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <375>   DW_AT_byte_size   : 8
    <375>   DW_AT_type        : <0x379>
 <1><379>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <37a>   DW_AT_prototyped  : 1
    <37a>   DW_AT_sibling     : <0x389>
 <2><37e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <37f>   DW_AT_type        : <0x1b2>
 <2><383>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <384>   DW_AT_type        : <0x1b2>
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 26 (DW_TAG_typedef)
    <38a>   DW_AT_name        : (indirect string, offset: 0x5f3c): tmp$86
    <38e>   DW_AT_decl_file   : 2
    <38f>   DW_AT_decl_line   : 199
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x395>
 <1><395>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <396>   DW_AT_byte_size   : 8
    <396>   DW_AT_type        : <0x39a>
 <1><39a>: Abbrev Number: 65 (DW_TAG_subroutine_type)
    <39b>   DW_AT_prototyped  : 1
    <39b>   DW_AT_type        : <0x1a6>
    <39f>   DW_AT_sibling     : <0x3ae>
 <2><3a3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3a4>   DW_AT_type        : <0x1b2>
 <2><3a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3a9>   DW_AT_type        : <0x2f7>
 <2><3ad>: Abbrev Number: 0
 <1><3ae>: Abbrev Number: 26 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indirect string, offset: 0x5b8d): tmp$66
    <3b3>   DW_AT_decl_file   : 2
    <3b4>   DW_AT_decl_line   : 201
    <3b5>   DW_AT_decl_column : 16
    <3b6>   DW_AT_type        : <0x3ba>
 <1><3ba>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <3bb>   DW_AT_byte_size   : 8
    <3bb>   DW_AT_type        : <0x3bf>
 <1><3bf>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <3c0>   DW_AT_prototyped  : 1
    <3c0>   DW_AT_sibling     : <0x3cf>
 <2><3c4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3c5>   DW_AT_type        : <0x1a6>
 <2><3c9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3ca>   DW_AT_type        : <0x1a6>
 <2><3ce>: Abbrev Number: 0
 <1><3cf>: Abbrev Number: 26 (DW_TAG_typedef)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x607c): tmp$93
    <3d4>   DW_AT_decl_file   : 2
    <3d5>   DW_AT_decl_line   : 203
    <3d6>   DW_AT_decl_column : 16
    <3d7>   DW_AT_type        : <0x3db>
 <1><3db>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 8
    <3dc>   DW_AT_type        : <0x3e0>
 <1><3e0>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <3e1>   DW_AT_prototyped  : 1
    <3e1>   DW_AT_sibling     : <0x3f0>
 <2><3e5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3e6>   DW_AT_type        : <0x1a6>
 <2><3ea>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <3eb>   DW_AT_type        : <0x145>
 <2><3ef>: Abbrev Number: 0
 <1><3f0>: Abbrev Number: 26 (DW_TAG_typedef)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x608a): tmp$95
    <3f5>   DW_AT_decl_file   : 2
    <3f6>   DW_AT_decl_line   : 205
    <3f7>   DW_AT_decl_column : 16
    <3f8>   DW_AT_type        : <0x3fc>
 <1><3fc>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <3fd>   DW_AT_byte_size   : 8
    <3fd>   DW_AT_type        : <0x401>
 <1><401>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <402>   DW_AT_prototyped  : 1
    <402>   DW_AT_sibling     : <0x41b>
 <2><406>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <407>   DW_AT_type        : <0x1a6>
 <2><40b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <40c>   DW_AT_type        : <0x145>
 <2><410>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <411>   DW_AT_type        : <0x145>
 <2><415>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <416>   DW_AT_type        : <0x145>
 <2><41a>: Abbrev Number: 0
 <1><41b>: Abbrev Number: 26 (DW_TAG_typedef)
    <41c>   DW_AT_name        : (indirect string, offset: 0x60ae): tmp$99
    <420>   DW_AT_decl_file   : 2
    <421>   DW_AT_decl_line   : 206
    <422>   DW_AT_decl_column : 16
    <423>   DW_AT_type        : <0x427>
 <1><427>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <428>   DW_AT_byte_size   : 8
    <428>   DW_AT_type        : <0x42c>
 <1><42c>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <42d>   DW_AT_prototyped  : 1
    <42d>   DW_AT_sibling     : <0x441>
 <2><431>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <432>   DW_AT_type        : <0x1a6>
 <2><436>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <437>   DW_AT_type        : <0x1a6>
 <2><43b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <43c>   DW_AT_type        : <0x441>
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <442>   DW_AT_byte_size   : 8
    <442>   DW_AT_type        : <0x145>
 <1><446>: Abbrev Number: 26 (DW_TAG_typedef)
    <447>   DW_AT_name        : (indirect string, offset: 0x6091): tmp$96
    <44b>   DW_AT_decl_file   : 2
    <44c>   DW_AT_decl_line   : 208
    <44d>   DW_AT_decl_column : 16
    <44e>   DW_AT_type        : <0x452>
 <1><452>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <453>   DW_AT_byte_size   : 8
    <453>   DW_AT_type        : <0x457>
 <1><457>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <458>   DW_AT_prototyped  : 1
    <458>   DW_AT_sibling     : <0x476>
 <2><45c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <45d>   DW_AT_type        : <0x1a6>
 <2><461>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <462>   DW_AT_type        : <0x145>
 <2><466>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <467>   DW_AT_type        : <0x145>
 <2><46b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <46c>   DW_AT_type        : <0x145>
 <2><470>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <471>   DW_AT_type        : <0x145>
 <2><475>: Abbrev Number: 0
 <1><476>: Abbrev Number: 54 (DW_TAG_structure_type)
    <477>   DW_AT_name        : (indirect string, offset: 0x128de): $9SHADERTOY
    <47b>   DW_AT_byte_size   : 32
    <47c>   DW_AT_decl_file   : 2
    <47d>   DW_AT_decl_line   : 209
    <47e>   DW_AT_decl_column : 8
    <47f>   DW_AT_sibling     : <0x4ab>
 <2><483>: Abbrev Number: 22 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0xaec): FRAGMENTSHADER
    <488>   DW_AT_decl_file   : 2
    <489>   DW_AT_decl_line   : 210
    <48a>   DW_AT_decl_column : 9
    <48b>   DW_AT_type        : <0x1b2>
    <48f>   DW_AT_data_member_location: 0
 <2><490>: Abbrev Number: 22 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0xfab): PROGRAMOBJECT
    <495>   DW_AT_decl_file   : 2
    <496>   DW_AT_decl_line   : 211
    <497>   DW_AT_decl_column : 9
    <498>   DW_AT_type        : <0x1b2>
    <49c>   DW_AT_data_member_location: 4
 <2><49d>: Abbrev Number: 22 (DW_TAG_member)
    <49e>   DW_AT_name        : (indirect string, offset: 0x8704): SHADERLOG
    <4a2>   DW_AT_decl_file   : 2
    <4a3>   DW_AT_decl_line   : 212
    <4a4>   DW_AT_decl_column : 11
    <4a5>   DW_AT_type        : <0x227>
    <4a9>   DW_AT_data_member_location: 8
 <2><4aa>: Abbrev Number: 0
 <1><4ab>: Abbrev Number: 82 (DW_TAG_structure_type)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x112b6): $8MEMORY_T
    <4b0>   DW_AT_byte_size   : 0x8083608
    <4b4>   DW_AT_decl_file   : 2
    <4b5>   DW_AT_decl_line   : 224
    <4b6>   DW_AT_decl_column : 8
    <4b7>   DW_AT_sibling     : <0x51f>
 <2><4bb>: Abbrev Number: 22 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xcb2d): MEM64
    <4c0>   DW_AT_decl_file   : 2
    <4c1>   DW_AT_decl_line   : 225
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x51f>
    <4c7>   DW_AT_data_member_location: 0
 <2><4c8>: Abbrev Number: 55 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x680d): KERNAL
    <4cd>   DW_AT_decl_file   : 2
    <4cd>   DW_AT_decl_line   : 226
    <4ce>   DW_AT_decl_column : 9
    <4ce>   DW_AT_type        : <0x532>
    <4d2>   DW_AT_data_member_location: 0x8000000
 <2><4d6>: Abbrev Number: 55 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x3f21): BASIC
    <4db>   DW_AT_decl_file   : 2
    <4db>   DW_AT_decl_line   : 227
    <4dc>   DW_AT_decl_column : 9
    <4dc>   DW_AT_type        : <0x532>
    <4e0>   DW_AT_data_member_location: 0x8020000
 <2><4e4>: Abbrev Number: 55 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x17bd9): CHAR
    <4e9>   DW_AT_decl_file   : 2
    <4e9>   DW_AT_decl_line   : 228
    <4ea>   DW_AT_decl_column : 9
    <4ea>   DW_AT_type        : <0x543>
    <4ee>   DW_AT_data_member_location: 0x8040000
 <2><4f2>: Abbrev Number: 83 (DW_TAG_member)
    <4f3>   DW_AT_name        : COL
    <4f7>   DW_AT_decl_file   : 2
    <4f8>   DW_AT_decl_line   : 229
    <4f9>   DW_AT_decl_column : 9
    <4fa>   DW_AT_type        : <0x554>
    <4fe>   DW_AT_data_member_location: 0x807ff88
 <2><502>: Abbrev Number: 55 (DW_TAG_member)
    <503>   DW_AT_name        : (indirect string, offset: 0xf8d3): SINTABLE
    <507>   DW_AT_decl_file   : 2
    <507>   DW_AT_decl_line   : 230
    <508>   DW_AT_decl_column : 9
    <508>   DW_AT_type        : <0x565>
    <50c>   DW_AT_data_member_location: 0x8081f88
 <2><510>: Abbrev Number: 55 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0xb784): COSTABLE
    <515>   DW_AT_decl_file   : 2
    <515>   DW_AT_decl_line   : 231
    <516>   DW_AT_decl_column : 9
    <516>   DW_AT_type        : <0x565>
    <51a>   DW_AT_data_member_location: 0x8082ac8
 <2><51e>: Abbrev Number: 0
 <1><51f>: Abbrev Number: 23 (DW_TAG_array_type)
    <520>   DW_AT_type        : <0x13e>
    <524>   DW_AT_sibling     : <0x532>
 <2><528>: Abbrev Number: 84 (DW_TAG_subrange_type)
    <529>   DW_AT_type        : <0x284>
    <52d>   DW_AT_upper_bound : 0xffffff
 <2><531>: Abbrev Number: 0
 <1><532>: Abbrev Number: 23 (DW_TAG_array_type)
    <533>   DW_AT_type        : <0x13e>
    <537>   DW_AT_sibling     : <0x543>
 <2><53b>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <53c>   DW_AT_type        : <0x284>
    <540>   DW_AT_upper_bound : 16383
 <2><542>: Abbrev Number: 0
 <1><543>: Abbrev Number: 23 (DW_TAG_array_type)
    <544>   DW_AT_type        : <0x13e>
    <548>   DW_AT_sibling     : <0x554>
 <2><54c>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <54d>   DW_AT_type        : <0x284>
    <551>   DW_AT_upper_bound : 32752
 <2><553>: Abbrev Number: 0
 <1><554>: Abbrev Number: 23 (DW_TAG_array_type)
    <555>   DW_AT_type        : <0x13e>
    <559>   DW_AT_sibling     : <0x565>
 <2><55d>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <55e>   DW_AT_type        : <0x284>
    <562>   DW_AT_upper_bound : 1023
 <2><564>: Abbrev Number: 0
 <1><565>: Abbrev Number: 23 (DW_TAG_array_type)
    <566>   DW_AT_type        : <0x13e>
    <56a>   DW_AT_sibling     : <0x576>
 <2><56e>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <56f>   DW_AT_type        : <0x284>
    <573>   DW_AT_upper_bound : 359
 <2><575>: Abbrev Number: 0
 <1><576>: Abbrev Number: 50 (DW_TAG_structure_type)
    <577>   DW_AT_name        : (indirect string, offset: 0xfa79): $5FLAGS
    <57b>   DW_AT_byte_size   : 1
    <57c>   DW_AT_decl_file   : 1
    <57c>   DW_AT_decl_line   : 457
    <57e>   DW_AT_decl_column : 8
    <57f>   DW_AT_sibling     : <0x591>
 <2><583>: Abbrev Number: 35 (DW_TAG_member)
    <584>   DW_AT_name        : (indirect string, offset: 0x876f): __fb_struct_body
    <588>   DW_AT_decl_file   : 1
    <588>   DW_AT_decl_line   : 458
    <58a>   DW_AT_decl_column : 8
    <58b>   DW_AT_type        : <0x591>
    <58f>   DW_AT_data_member_location: 0
 <2><590>: Abbrev Number: 0
 <1><591>: Abbrev Number: 23 (DW_TAG_array_type)
    <592>   DW_AT_type        : <0x16d>
    <596>   DW_AT_sibling     : <0x5a1>
 <2><59a>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <59b>   DW_AT_type        : <0x284>
    <59f>   DW_AT_upper_bound : 0
 <2><5a0>: Abbrev Number: 0
 <1><5a1>: Abbrev Number: 36 (DW_TAG_union_type)
    <5a2>   DW_AT_byte_size   : 1
    <5a3>   DW_AT_decl_file   : 1
    <5a3>   DW_AT_decl_line   : 482
    <5a5>   DW_AT_decl_column : 14
    <5a6>   DW_AT_sibling     : <0x5c3>
 <2><5aa>: Abbrev Number: 29 (DW_TAG_member)
    <5ab>   DW_AT_name        : ULO
    <5af>   DW_AT_decl_file   : 1
    <5af>   DW_AT_decl_line   : 483
    <5b1>   DW_AT_decl_column : 21
    <5b2>   DW_AT_type        : <0x16d>
 <2><5b6>: Abbrev Number: 29 (DW_TAG_member)
    <5b7>   DW_AT_name        : SLO
    <5bb>   DW_AT_decl_file   : 1
    <5bb>   DW_AT_decl_line   : 484
    <5bd>   DW_AT_decl_column : 20
    <5be>   DW_AT_type        : <0x15a>
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 36 (DW_TAG_union_type)
    <5c4>   DW_AT_byte_size   : 1
    <5c5>   DW_AT_decl_file   : 1
    <5c5>   DW_AT_decl_line   : 486
    <5c7>   DW_AT_decl_column : 14
    <5c8>   DW_AT_sibling     : <0x5e5>
 <2><5cc>: Abbrev Number: 29 (DW_TAG_member)
    <5cd>   DW_AT_name        : UHI
    <5d1>   DW_AT_decl_file   : 1
    <5d1>   DW_AT_decl_line   : 487
    <5d3>   DW_AT_decl_column : 21
    <5d4>   DW_AT_type        : <0x16d>
 <2><5d8>: Abbrev Number: 29 (DW_TAG_member)
    <5d9>   DW_AT_name        : SHI
    <5dd>   DW_AT_decl_file   : 1
    <5dd>   DW_AT_decl_line   : 488
    <5df>   DW_AT_decl_column : 20
    <5e0>   DW_AT_type        : <0x15a>
 <2><5e4>: Abbrev Number: 0
 <1><5e5>: Abbrev Number: 46 (DW_TAG_structure_type)
    <5e6>   DW_AT_byte_size   : 2
    <5e7>   DW_AT_decl_file   : 1
    <5e7>   DW_AT_decl_line   : 481
    <5e9>   DW_AT_decl_column : 13
    <5ea>   DW_AT_sibling     : <0x5fb>
 <2><5ee>: Abbrev Number: 37 (DW_TAG_member)
    <5ef>   DW_AT_type        : <0x5a1>
    <5f3>   DW_AT_data_member_location: 0
 <2><5f4>: Abbrev Number: 37 (DW_TAG_member)
    <5f5>   DW_AT_type        : <0x5c3>
    <5f9>   DW_AT_data_member_location: 1
 <2><5fa>: Abbrev Number: 0
 <1><5fb>: Abbrev Number: 36 (DW_TAG_union_type)
    <5fc>   DW_AT_byte_size   : 2
    <5fd>   DW_AT_decl_file   : 1
    <5fd>   DW_AT_decl_line   : 478
    <5ff>   DW_AT_decl_column : 12
    <600>   DW_AT_sibling     : <0x622>
 <2><604>: Abbrev Number: 29 (DW_TAG_member)
    <605>   DW_AT_name        : U16
    <609>   DW_AT_decl_file   : 1
    <609>   DW_AT_decl_line   : 479
    <60b>   DW_AT_decl_column : 20
    <60c>   DW_AT_type        : <0x193>
 <2><610>: Abbrev Number: 29 (DW_TAG_member)
    <611>   DW_AT_name        : S16
    <615>   DW_AT_decl_file   : 1
    <615>   DW_AT_decl_line   : 480
    <617>   DW_AT_decl_column : 19
    <618>   DW_AT_type        : <0x180>
 <2><61c>: Abbrev Number: 47 (DW_TAG_member)
    <61d>   DW_AT_type        : <0x5e5>
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 46 (DW_TAG_structure_type)
    <623>   DW_AT_byte_size   : 2
    <624>   DW_AT_decl_file   : 1
    <624>   DW_AT_decl_line   : 477
    <626>   DW_AT_decl_column : 11
    <627>   DW_AT_sibling     : <0x632>
 <2><62b>: Abbrev Number: 37 (DW_TAG_member)
    <62c>   DW_AT_type        : <0x5fb>
    <630>   DW_AT_data_member_location: 0
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 36 (DW_TAG_union_type)
    <633>   DW_AT_byte_size   : 4
    <634>   DW_AT_decl_file   : 1
    <634>   DW_AT_decl_line   : 474
    <636>   DW_AT_decl_column : 10
    <637>   DW_AT_sibling     : <0x659>
 <2><63b>: Abbrev Number: 29 (DW_TAG_member)
    <63c>   DW_AT_name        : U32
    <640>   DW_AT_decl_file   : 1
    <640>   DW_AT_decl_line   : 475
    <642>   DW_AT_decl_column : 18
    <643>   DW_AT_type        : <0x1b2>
 <2><647>: Abbrev Number: 29 (DW_TAG_member)
    <648>   DW_AT_name        : S32
    <64c>   DW_AT_decl_file   : 1
    <64c>   DW_AT_decl_line   : 476
    <64e>   DW_AT_decl_column : 17
    <64f>   DW_AT_type        : <0x1a6>
 <2><653>: Abbrev Number: 47 (DW_TAG_member)
    <654>   DW_AT_type        : <0x622>
 <2><658>: Abbrev Number: 0
 <1><659>: Abbrev Number: 46 (DW_TAG_structure_type)
    <65a>   DW_AT_byte_size   : 4
    <65b>   DW_AT_decl_file   : 1
    <65b>   DW_AT_decl_line   : 473
    <65d>   DW_AT_decl_column : 9
    <65e>   DW_AT_sibling     : <0x669>
 <2><662>: Abbrev Number: 37 (DW_TAG_member)
    <663>   DW_AT_type        : <0x632>
    <667>   DW_AT_data_member_location: 0
 <2><668>: Abbrev Number: 0
 <1><669>: Abbrev Number: 36 (DW_TAG_union_type)
    <66a>   DW_AT_byte_size   : 4
    <66b>   DW_AT_decl_file   : 1
    <66b>   DW_AT_decl_line   : 470
    <66d>   DW_AT_decl_column : 8
    <66e>   DW_AT_sibling     : <0x690>
 <2><672>: Abbrev Number: 51 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x9ff5): UFPU32
    <677>   DW_AT_decl_file   : 1
    <677>   DW_AT_decl_line   : 471
    <679>   DW_AT_decl_column : 15
    <67a>   DW_AT_type        : <0x145>
 <2><67e>: Abbrev Number: 51 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x1bbd): SFPU32
    <683>   DW_AT_decl_file   : 1
    <683>   DW_AT_decl_line   : 472
    <685>   DW_AT_decl_column : 15
    <686>   DW_AT_type        : <0x145>
 <2><68a>: Abbrev Number: 47 (DW_TAG_member)
    <68b>   DW_AT_type        : <0x659>
 <2><68f>: Abbrev Number: 0
 <1><690>: Abbrev Number: 46 (DW_TAG_structure_type)
    <691>   DW_AT_byte_size   : 4
    <692>   DW_AT_decl_file   : 1
    <692>   DW_AT_decl_line   : 469
    <694>   DW_AT_decl_column : 7
    <695>   DW_AT_sibling     : <0x6a0>
 <2><699>: Abbrev Number: 37 (DW_TAG_member)
    <69a>   DW_AT_type        : <0x669>
    <69e>   DW_AT_data_member_location: 0
 <2><69f>: Abbrev Number: 0
 <1><6a0>: Abbrev Number: 36 (DW_TAG_union_type)
    <6a1>   DW_AT_byte_size   : 8
    <6a2>   DW_AT_decl_file   : 1
    <6a2>   DW_AT_decl_line   : 466
    <6a4>   DW_AT_decl_column : 6
    <6a5>   DW_AT_sibling     : <0x6c7>
 <2><6a9>: Abbrev Number: 29 (DW_TAG_member)
    <6aa>   DW_AT_name        : U64
    <6ae>   DW_AT_decl_file   : 1
    <6ae>   DW_AT_decl_line   : 467
    <6b0>   DW_AT_decl_column : 14
    <6b1>   DW_AT_type        : <0x1d8>
 <2><6b5>: Abbrev Number: 29 (DW_TAG_member)
    <6b6>   DW_AT_name        : S64
    <6ba>   DW_AT_decl_file   : 1
    <6ba>   DW_AT_decl_line   : 468
    <6bc>   DW_AT_decl_column : 13
    <6bd>   DW_AT_type        : <0x1c5>
 <2><6c1>: Abbrev Number: 47 (DW_TAG_member)
    <6c2>   DW_AT_type        : <0x690>
 <2><6c6>: Abbrev Number: 0
 <1><6c7>: Abbrev Number: 46 (DW_TAG_structure_type)
    <6c8>   DW_AT_byte_size   : 8
    <6c9>   DW_AT_decl_file   : 1
    <6c9>   DW_AT_decl_line   : 465
    <6cb>   DW_AT_decl_column : 5
    <6cc>   DW_AT_sibling     : <0x6d7>
 <2><6d0>: Abbrev Number: 37 (DW_TAG_member)
    <6d1>   DW_AT_type        : <0x6a0>
    <6d5>   DW_AT_data_member_location: 0
 <2><6d6>: Abbrev Number: 0
 <1><6d7>: Abbrev Number: 36 (DW_TAG_union_type)
    <6d8>   DW_AT_byte_size   : 8
    <6d9>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 462
    <6db>   DW_AT_decl_column : 4
    <6dc>   DW_AT_sibling     : <0x6fe>
 <2><6e0>: Abbrev Number: 51 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xa3f9): UFPU64
    <6e5>   DW_AT_decl_file   : 1
    <6e5>   DW_AT_decl_line   : 463
    <6e7>   DW_AT_decl_column : 12
    <6e8>   DW_AT_type        : <0x13e>
 <2><6ec>: Abbrev Number: 51 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x2123): SFPU64
    <6f1>   DW_AT_decl_file   : 1
    <6f1>   DW_AT_decl_line   : 464
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0x13e>
 <2><6f8>: Abbrev Number: 47 (DW_TAG_member)
    <6f9>   DW_AT_type        : <0x6c7>
 <2><6fd>: Abbrev Number: 0
 <1><6fe>: Abbrev Number: 46 (DW_TAG_structure_type)
    <6ff>   DW_AT_byte_size   : 8
    <700>   DW_AT_decl_file   : 1
    <700>   DW_AT_decl_line   : 461
    <702>   DW_AT_decl_column : 3
    <703>   DW_AT_sibling     : <0x70e>
 <2><707>: Abbrev Number: 37 (DW_TAG_member)
    <708>   DW_AT_type        : <0x6d7>
    <70c>   DW_AT_data_member_location: 0
 <2><70d>: Abbrev Number: 0
 <1><70e>: Abbrev Number: 36 (DW_TAG_union_type)
    <70f>   DW_AT_byte_size   : 8
    <710>   DW_AT_decl_file   : 1
    <710>   DW_AT_decl_line   : 458
    <712>   DW_AT_decl_column : 2
    <713>   DW_AT_sibling     : <0x735>
 <2><717>: Abbrev Number: 51 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x57d8): ADR0
    <71c>   DW_AT_decl_file   : 1
    <71c>   DW_AT_decl_line   : 459
    <71e>   DW_AT_decl_column : 9
    <71f>   DW_AT_type        : <0x735>
 <2><723>: Abbrev Number: 51 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x57dd): ADR1
    <728>   DW_AT_decl_file   : 1
    <728>   DW_AT_decl_line   : 460
    <72a>   DW_AT_decl_column : 9
    <72b>   DW_AT_type        : <0x735>
 <2><72f>: Abbrev Number: 47 (DW_TAG_member)
    <730>   DW_AT_type        : <0x6fe>
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 85 (DW_TAG_pointer_type)
    <736>   DW_AT_byte_size   : 8
 <1><737>: Abbrev Number: 50 (DW_TAG_structure_type)
    <738>   DW_AT_name        : (indirect string, offset: 0x1f40): $5MULTI
    <73c>   DW_AT_byte_size   : 8
    <73d>   DW_AT_decl_file   : 1
    <73d>   DW_AT_decl_line   : 457
    <73f>   DW_AT_decl_column : 8
    <740>   DW_AT_sibling     : <0x74b>
 <2><744>: Abbrev Number: 37 (DW_TAG_member)
    <745>   DW_AT_type        : <0x70e>
    <749>   DW_AT_data_member_location: 0
 <2><74a>: Abbrev Number: 0
 <1><74b>: Abbrev Number: 58 (DW_TAG_typedef)
    <74c>   DW_AT_name        : (indirect string, offset: 0xbc8f): tmp$717
    <750>   DW_AT_decl_file   : 1
    <750>   DW_AT_decl_line   : 456
    <752>   DW_AT_decl_column : 16
    <753>   DW_AT_type        : <0x757>
 <1><757>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <758>   DW_AT_byte_size   : 8
    <758>   DW_AT_type        : <0x75c>
 <1><75c>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <75d>   DW_AT_prototyped  : 1
    <75d>   DW_AT_sibling     : <0x767>
 <2><761>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <762>   DW_AT_type        : <0x767>
 <2><766>: Abbrev Number: 0
 <1><767>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <768>   DW_AT_byte_size   : 8
    <768>   DW_AT_type        : <0x76c>
 <1><76c>: Abbrev Number: 86 (DW_TAG_structure_type)
    <76d>   DW_AT_name        : (indirect string, offset: 0x16126): $7CPU6510
    <771>   DW_AT_byte_size   : 14720
    <773>   DW_AT_decl_file   : 1
    <774>   DW_AT_decl_line   : 457
    <776>   DW_AT_decl_column : 8
    <777>   DW_AT_sibling     : <0x7d6>
 <2><77b>: Abbrev Number: 37 (DW_TAG_member)
    <77c>   DW_AT_type        : <0x84e>
    <780>   DW_AT_data_member_location: 0
 <2><781>: Abbrev Number: 37 (DW_TAG_member)
    <782>   DW_AT_type        : <0x86c>
    <786>   DW_AT_data_member_location: 1
 <2><787>: Abbrev Number: 37 (DW_TAG_member)
    <788>   DW_AT_type        : <0x88b>
    <78c>   DW_AT_data_member_location: 2
 <2><78d>: Abbrev Number: 37 (DW_TAG_member)
    <78e>   DW_AT_type        : <0x8aa>
    <792>   DW_AT_data_member_location: 3
 <2><793>: Abbrev Number: 37 (DW_TAG_member)
    <794>   DW_AT_type        : <0x8eb>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 37 (DW_TAG_member)
    <79a>   DW_AT_type        : <0x927>
    <79e>   DW_AT_data_member_location: 6
 <2><79f>: Abbrev Number: 40 (DW_TAG_member)
    <7a0>   DW_AT_name        : MEM
    <7a4>   DW_AT_decl_file   : 1
    <7a4>   DW_AT_decl_line   : 488
    <7a6>   DW_AT_decl_column : 21
    <7a7>   DW_AT_type        : <0x941>
    <7ab>   DW_AT_data_member_location: 8
 <2><7ac>: Abbrev Number: 35 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x133cc): CODE
    <7b1>   DW_AT_decl_file   : 1
    <7b1>   DW_AT_decl_line   : 489
    <7b3>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x7d6>
    <7b8>   DW_AT_data_member_location: 16
 <2><7b9>: Abbrev Number: 35 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x296a): OPCODES
    <7be>   DW_AT_decl_file   : 1
    <7be>   DW_AT_decl_line   : 490
    <7c0>   DW_AT_decl_column : 18
    <7c1>   DW_AT_type        : <0x946>
    <7c5>   DW_AT_data_member_location: 72
 <2><7c6>: Abbrev Number: 87 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x6e86): STRADRMODES
    <7cb>   DW_AT_decl_file   : 1
    <7cc>   DW_AT_decl_line   : 491
    <7ce>   DW_AT_decl_column : 11
    <7cf>   DW_AT_type        : <0x956>
    <7d3>   DW_AT_data_member_location: 14408
 <2><7d5>: Abbrev Number: 0
 <1><7d6>: Abbrev Number: 50 (DW_TAG_structure_type)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x8d52): $6OPCODE
    <7db>   DW_AT_byte_size   : 56
    <7dc>   DW_AT_decl_file   : 1
    <7dc>   DW_AT_decl_line   : 457
    <7de>   DW_AT_decl_column : 8
    <7df>   DW_AT_sibling     : <0x83e>
 <2><7e3>: Abbrev Number: 35 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x133cc): CODE
    <7e8>   DW_AT_decl_file   : 1
    <7e8>   DW_AT_decl_line   : 458
    <7ea>   DW_AT_decl_column : 9
    <7eb>   DW_AT_type        : <0x1d8>
    <7ef>   DW_AT_data_member_location: 0
 <2><7f0>: Abbrev Number: 40 (DW_TAG_member)
    <7f1>   DW_AT_name        : NAM
    <7f5>   DW_AT_decl_file   : 1
    <7f5>   DW_AT_decl_line   : 459
    <7f7>   DW_AT_decl_column : 8
    <7f8>   DW_AT_type        : <0x83e>
    <7fc>   DW_AT_data_member_location: 8
 <2><7fd>: Abbrev Number: 35 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x6746): ADRMODE
    <802>   DW_AT_decl_file   : 1
    <802>   DW_AT_decl_line   : 460
    <804>   DW_AT_decl_column : 9
    <805>   DW_AT_type        : <0x1d8>
    <809>   DW_AT_data_member_location: 16
 <2><80a>: Abbrev Number: 35 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x2107): BYTES
    <80f>   DW_AT_decl_file   : 1
    <80f>   DW_AT_decl_line   : 461
    <811>   DW_AT_decl_column : 9
    <812>   DW_AT_type        : <0x1d8>
    <816>   DW_AT_data_member_location: 24
 <2><817>: Abbrev Number: 35 (DW_TAG_member)
    <818>   DW_AT_name        : (indirect string, offset: 0x912e): TICKS
    <81c>   DW_AT_decl_file   : 1
    <81c>   DW_AT_decl_line   : 462
    <81e>   DW_AT_decl_column : 9
    <81f>   DW_AT_type        : <0x1d8>
    <823>   DW_AT_data_member_location: 32
 <2><824>: Abbrev Number: 40 (DW_TAG_member)
    <825>   DW_AT_name        : OP
    <828>   DW_AT_decl_file   : 1
    <828>   DW_AT_decl_line   : 463
    <82a>   DW_AT_decl_column : 17
    <82b>   DW_AT_type        : <0x737>
    <82f>   DW_AT_data_member_location: 40
 <2><830>: Abbrev Number: 35 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x133ca): DECODE
    <835>   DW_AT_decl_file   : 1
    <835>   DW_AT_decl_line   : 464
    <837>   DW_AT_decl_column : 10
    <838>   DW_AT_type        : <0x74b>
    <83c>   DW_AT_data_member_location: 48
 <2><83d>: Abbrev Number: 0
 <1><83e>: Abbrev Number: 23 (DW_TAG_array_type)
    <83f>   DW_AT_type        : <0x16d>
    <843>   DW_AT_sibling     : <0x84e>
 <2><847>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <848>   DW_AT_type        : <0x284>
    <84c>   DW_AT_upper_bound : 3
 <2><84d>: Abbrev Number: 0
 <1><84e>: Abbrev Number: 36 (DW_TAG_union_type)
    <84f>   DW_AT_byte_size   : 1
    <850>   DW_AT_decl_file   : 1
    <850>   DW_AT_decl_line   : 458
    <852>   DW_AT_decl_column : 2
    <853>   DW_AT_sibling     : <0x86c>
 <2><857>: Abbrev Number: 29 (DW_TAG_member)
    <858>   DW_AT_name        : P
    <85a>   DW_AT_decl_file   : 1
    <85a>   DW_AT_decl_line   : 459
    <85c>   DW_AT_decl_column : 9
    <85d>   DW_AT_type        : <0x16d>
 <2><861>: Abbrev Number: 29 (DW_TAG_member)
    <862>   DW_AT_name        : F
    <864>   DW_AT_decl_file   : 1
    <864>   DW_AT_decl_line   : 460
    <866>   DW_AT_decl_column : 18
    <867>   DW_AT_type        : <0x576>
 <2><86b>: Abbrev Number: 0
 <1><86c>: Abbrev Number: 36 (DW_TAG_union_type)
    <86d>   DW_AT_byte_size   : 1
    <86e>   DW_AT_decl_file   : 1
    <86e>   DW_AT_decl_line   : 462
    <870>   DW_AT_decl_column : 2
    <871>   DW_AT_sibling     : <0x88b>
 <2><875>: Abbrev Number: 29 (DW_TAG_member)
    <876>   DW_AT_name        : A
    <878>   DW_AT_decl_file   : 1
    <878>   DW_AT_decl_line   : 463
    <87a>   DW_AT_decl_column : 9
    <87b>   DW_AT_type        : <0x16d>
 <2><87f>: Abbrev Number: 29 (DW_TAG_member)
    <880>   DW_AT_name        : SA
    <883>   DW_AT_decl_file   : 1
    <883>   DW_AT_decl_line   : 464
    <885>   DW_AT_decl_column : 8
    <886>   DW_AT_type        : <0x15a>
 <2><88a>: Abbrev Number: 0
 <1><88b>: Abbrev Number: 36 (DW_TAG_union_type)
    <88c>   DW_AT_byte_size   : 1
    <88d>   DW_AT_decl_file   : 1
    <88d>   DW_AT_decl_line   : 466
    <88f>   DW_AT_decl_column : 2
    <890>   DW_AT_sibling     : <0x8aa>
 <2><894>: Abbrev Number: 29 (DW_TAG_member)
    <895>   DW_AT_name        : X
    <897>   DW_AT_decl_file   : 1
    <897>   DW_AT_decl_line   : 467
    <899>   DW_AT_decl_column : 9
    <89a>   DW_AT_type        : <0x16d>
 <2><89e>: Abbrev Number: 29 (DW_TAG_member)
    <89f>   DW_AT_name        : SX
    <8a2>   DW_AT_decl_file   : 1
    <8a2>   DW_AT_decl_line   : 468
    <8a4>   DW_AT_decl_column : 8
    <8a5>   DW_AT_type        : <0x15a>
 <2><8a9>: Abbrev Number: 0
 <1><8aa>: Abbrev Number: 36 (DW_TAG_union_type)
    <8ab>   DW_AT_byte_size   : 1
    <8ac>   DW_AT_decl_file   : 1
    <8ac>   DW_AT_decl_line   : 470
    <8ae>   DW_AT_decl_column : 2
    <8af>   DW_AT_sibling     : <0x8c9>
 <2><8b3>: Abbrev Number: 29 (DW_TAG_member)
    <8b4>   DW_AT_name        : Y
    <8b6>   DW_AT_decl_file   : 1
    <8b6>   DW_AT_decl_line   : 471
    <8b8>   DW_AT_decl_column : 9
    <8b9>   DW_AT_type        : <0x16d>
 <2><8bd>: Abbrev Number: 29 (DW_TAG_member)
    <8be>   DW_AT_name        : SY
    <8c1>   DW_AT_decl_file   : 1
    <8c1>   DW_AT_decl_line   : 472
    <8c3>   DW_AT_decl_column : 8
    <8c4>   DW_AT_type        : <0x15a>
 <2><8c8>: Abbrev Number: 0
 <1><8c9>: Abbrev Number: 46 (DW_TAG_structure_type)
    <8ca>   DW_AT_byte_size   : 2
    <8cb>   DW_AT_decl_file   : 1
    <8cb>   DW_AT_decl_line   : 476
    <8cd>   DW_AT_decl_column : 3
    <8ce>   DW_AT_sibling     : <0x8eb>
 <2><8d2>: Abbrev Number: 40 (DW_TAG_member)
    <8d3>   DW_AT_name        : PL
    <8d6>   DW_AT_decl_file   : 1
    <8d6>   DW_AT_decl_line   : 477
    <8d8>   DW_AT_decl_column : 10
    <8d9>   DW_AT_type        : <0x16d>
    <8dd>   DW_AT_data_member_location: 0
 <2><8de>: Abbrev Number: 40 (DW_TAG_member)
    <8df>   DW_AT_name        : PH
    <8e2>   DW_AT_decl_file   : 1
    <8e2>   DW_AT_decl_line   : 478
    <8e4>   DW_AT_decl_column : 10
    <8e5>   DW_AT_type        : <0x16d>
    <8e9>   DW_AT_data_member_location: 1
 <2><8ea>: Abbrev Number: 0
 <1><8eb>: Abbrev Number: 36 (DW_TAG_union_type)
    <8ec>   DW_AT_byte_size   : 2
    <8ed>   DW_AT_decl_file   : 1
    <8ed>   DW_AT_decl_line   : 474
    <8ef>   DW_AT_decl_column : 2
    <8f0>   DW_AT_sibling     : <0x905>
 <2><8f4>: Abbrev Number: 29 (DW_TAG_member)
    <8f5>   DW_AT_name        : PC
    <8f8>   DW_AT_decl_file   : 1
    <8f8>   DW_AT_decl_line   : 475
    <8fa>   DW_AT_decl_column : 10
    <8fb>   DW_AT_type        : <0x193>
 <2><8ff>: Abbrev Number: 47 (DW_TAG_member)
    <900>   DW_AT_type        : <0x8c9>
 <2><904>: Abbrev Number: 0
 <1><905>: Abbrev Number: 46 (DW_TAG_structure_type)
    <906>   DW_AT_byte_size   : 2
    <907>   DW_AT_decl_file   : 1
    <907>   DW_AT_decl_line   : 483
    <909>   DW_AT_decl_column : 3
    <90a>   DW_AT_sibling     : <0x927>
 <2><90e>: Abbrev Number: 40 (DW_TAG_member)
    <90f>   DW_AT_name        : S
    <911>   DW_AT_decl_file   : 1
    <911>   DW_AT_decl_line   : 484
    <913>   DW_AT_decl_column : 10
    <914>   DW_AT_type        : <0x16d>
    <918>   DW_AT_data_member_location: 0
 <2><919>: Abbrev Number: 40 (DW_TAG_member)
    <91a>   DW_AT_name        : MSB
    <91e>   DW_AT_decl_file   : 1
    <91e>   DW_AT_decl_line   : 485
    <920>   DW_AT_decl_column : 10
    <921>   DW_AT_type        : <0x16d>
    <925>   DW_AT_data_member_location: 1
 <2><926>: Abbrev Number: 0
 <1><927>: Abbrev Number: 36 (DW_TAG_union_type)
    <928>   DW_AT_byte_size   : 2
    <929>   DW_AT_decl_file   : 1
    <929>   DW_AT_decl_line   : 481
    <92b>   DW_AT_decl_column : 2
    <92c>   DW_AT_sibling     : <0x941>
 <2><930>: Abbrev Number: 29 (DW_TAG_member)
    <931>   DW_AT_name        : SP
    <934>   DW_AT_decl_file   : 1
    <934>   DW_AT_decl_line   : 482
    <936>   DW_AT_decl_column : 10
    <937>   DW_AT_type        : <0x193>
 <2><93b>: Abbrev Number: 47 (DW_TAG_member)
    <93c>   DW_AT_type        : <0x905>
 <2><940>: Abbrev Number: 0
 <1><941>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <942>   DW_AT_byte_size   : 8
    <942>   DW_AT_type        : <0x4ab>
 <1><946>: Abbrev Number: 23 (DW_TAG_array_type)
    <947>   DW_AT_type        : <0x7d6>
    <94b>   DW_AT_sibling     : <0x956>
 <2><94f>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <950>   DW_AT_type        : <0x284>
    <954>   DW_AT_upper_bound : 255
 <2><955>: Abbrev Number: 0
 <1><956>: Abbrev Number: 23 (DW_TAG_array_type)
    <957>   DW_AT_type        : <0x227>
    <95b>   DW_AT_sibling     : <0x966>
 <2><95f>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <960>   DW_AT_type        : <0x284>
    <964>   DW_AT_upper_bound : 12
 <2><965>: Abbrev Number: 0
 <1><966>: Abbrev Number: 50 (DW_TAG_structure_type)
    <967>   DW_AT_name        : (indirect string, offset: 0x12878): $5C64_T
    <96b>   DW_AT_byte_size   : 16
    <96c>   DW_AT_decl_file   : 1
    <96c>   DW_AT_decl_line   : 457
    <96e>   DW_AT_decl_column : 8
    <96f>   DW_AT_sibling     : <0x98e>
 <2><973>: Abbrev Number: 40 (DW_TAG_member)
    <974>   DW_AT_name        : MEM
    <978>   DW_AT_decl_file   : 1
    <978>   DW_AT_decl_line   : 458
    <97a>   DW_AT_decl_column : 21
    <97b>   DW_AT_type        : <0x941>
    <97f>   DW_AT_data_member_location: 0
 <2><980>: Abbrev Number: 40 (DW_TAG_member)
    <981>   DW_AT_name        : CPU
    <985>   DW_AT_decl_file   : 1
    <985>   DW_AT_decl_line   : 459
    <987>   DW_AT_decl_column : 20
    <988>   DW_AT_type        : <0x767>
    <98c>   DW_AT_data_member_location: 8
 <2><98d>: Abbrev Number: 0
 <1><98e>: Abbrev Number: 50 (DW_TAG_structure_type)
    <98f>   DW_AT_name        : (indirect string, offset: 0xa178): $4VEC3
    <993>   DW_AT_byte_size   : 12
    <994>   DW_AT_decl_file   : 1
    <994>   DW_AT_decl_line   : 457
    <996>   DW_AT_decl_column : 8
    <997>   DW_AT_sibling     : <0x9bd>
 <2><99b>: Abbrev Number: 40 (DW_TAG_member)
    <99c>   DW_AT_name        : X
    <99e>   DW_AT_decl_file   : 1
    <99e>   DW_AT_decl_line   : 458
    <9a0>   DW_AT_decl_column : 8
    <9a1>   DW_AT_type        : <0x145>
    <9a5>   DW_AT_data_member_location: 0
 <2><9a6>: Abbrev Number: 40 (DW_TAG_member)
    <9a7>   DW_AT_name        : Y
    <9a9>   DW_AT_decl_file   : 1
    <9a9>   DW_AT_decl_line   : 459
    <9ab>   DW_AT_decl_column : 8
    <9ac>   DW_AT_type        : <0x145>
    <9b0>   DW_AT_data_member_location: 4
 <2><9b1>: Abbrev Number: 40 (DW_TAG_member)
    <9b2>   DW_AT_name        : Z
    <9b4>   DW_AT_decl_file   : 1
    <9b4>   DW_AT_decl_line   : 460
    <9b6>   DW_AT_decl_column : 8
    <9b7>   DW_AT_type        : <0x145>
    <9bb>   DW_AT_data_member_location: 8
 <2><9bc>: Abbrev Number: 0
 <1><9bd>: Abbrev Number: 54 (DW_TAG_structure_type)
    <9be>   DW_AT_name        : (indirect string, offset: 0x6d01): $7FBARRAYIvE
    <9c2>   DW_AT_byte_size   : 240
    <9c3>   DW_AT_decl_file   : 5
    <9c4>   DW_AT_decl_line   : 25
    <9c5>   DW_AT_decl_column : 8
    <9c6>   DW_AT_sibling     : <0xa25>
 <2><9ca>: Abbrev Number: 22 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x1b994): DATA
    <9cf>   DW_AT_decl_file   : 5
    <9d0>   DW_AT_decl_line   : 26
    <9d1>   DW_AT_decl_column : 8
    <9d2>   DW_AT_type        : <0x735>
    <9d6>   DW_AT_data_member_location: 0
 <2><9d7>: Abbrev Number: 57 (DW_TAG_member)
    <9d8>   DW_AT_name        : PTR
    <9dc>   DW_AT_decl_file   : 5
    <9dd>   DW_AT_decl_line   : 27
    <9de>   DW_AT_decl_column : 8
    <9df>   DW_AT_type        : <0x735>
    <9e3>   DW_AT_data_member_location: 8
 <2><9e3>: Abbrev Number: 22 (DW_TAG_member)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x1c4b7): SIZE
    <9e8>   DW_AT_decl_file   : 5
    <9e9>   DW_AT_decl_line   : 28
    <9ea>   DW_AT_decl_column : 8
    <9eb>   DW_AT_type        : <0x1c5>
    <9ef>   DW_AT_data_member_location: 16
 <2><9f0>: Abbrev Number: 22 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x108ac): ELEMENT_LEN
    <9f5>   DW_AT_decl_file   : 5
    <9f6>   DW_AT_decl_line   : 29
    <9f7>   DW_AT_decl_column : 8
    <9f8>   DW_AT_type        : <0x1c5>
    <9fc>   DW_AT_data_member_location: 24
 <2><9fd>: Abbrev Number: 22 (DW_TAG_member)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x63b3): DIMENSIONS
    <a02>   DW_AT_decl_file   : 5
    <a03>   DW_AT_decl_line   : 30
    <a04>   DW_AT_decl_column : 8
    <a05>   DW_AT_type        : <0x1c5>
    <a09>   DW_AT_data_member_location: 32
 <2><a0a>: Abbrev Number: 22 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0xfa7b): FLAGS
    <a0f>   DW_AT_decl_file   : 5
    <a10>   DW_AT_decl_line   : 31
    <a11>   DW_AT_decl_column : 8
    <a12>   DW_AT_type        : <0x1c5>
    <a16>   DW_AT_data_member_location: 40
 <2><a17>: Abbrev Number: 22 (DW_TAG_member)
    <a18>   DW_AT_name        : (indirect string, offset: 0x1097e): DIMTB
    <a1c>   DW_AT_decl_file   : 5
    <a1d>   DW_AT_decl_line   : 32
    <a1e>   DW_AT_decl_column : 29
    <a1f>   DW_AT_type        : <0xa25>
    <a23>   DW_AT_data_member_location: 48
 <2><a24>: Abbrev Number: 0
 <1><a25>: Abbrev Number: 23 (DW_TAG_array_type)
    <a26>   DW_AT_type        : <0x23f>
    <a2a>   DW_AT_sibling     : <0xa35>
 <2><a2e>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <a2f>   DW_AT_type        : <0x284>
    <a33>   DW_AT_upper_bound : 7
 <2><a34>: Abbrev Number: 0
 <1><a35>: Abbrev Number: 9 (DW_TAG_variable)
    <a36>   DW_AT_name        : (indirect string, offset: 0x130a8): INDEX$
    <a3a>   DW_AT_decl_file   : 1
    <a3b>   DW_AT_decl_line   : 446
    <a3d>   DW_AT_decl_column : 15
    <a3e>   DW_AT_type        : <0x193>
    <a42>   DW_AT_location    : 9 byte block: 3 a0 a6 48 0 0 0 0 0 	(DW_OP_addr: 48a6a0)
 <1><a4c>: Abbrev Number: 16 (DW_TAG_variable)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x6aa0): RVS$
    <a51>   DW_AT_decl_file   : 1
    <a52>   DW_AT_decl_line   : 446
    <a54>   DW_AT_decl_column : 15
    <a55>   DW_AT_type        : <0x193>
 <1><a59>: Abbrev Number: 16 (DW_TAG_variable)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xc6b2): FCOLOR$
    <a5e>   DW_AT_decl_file   : 1
    <a5f>   DW_AT_decl_line   : 446
    <a61>   DW_AT_decl_column : 15
    <a62>   DW_AT_type        : <0x193>
 <1><a66>: Abbrev Number: 16 (DW_TAG_variable)
    <a67>   DW_AT_name        : (indirect string, offset: 0xe4ef): HIBASE$
    <a6b>   DW_AT_decl_file   : 1
    <a6c>   DW_AT_decl_line   : 446
    <a6e>   DW_AT_decl_column : 15
    <a6f>   DW_AT_type        : <0x193>
 <1><a73>: Abbrev Number: 16 (DW_TAG_variable)
    <a74>   DW_AT_name        : (indirect string, offset: 0xe289): SP0X$
    <a78>   DW_AT_decl_file   : 1
    <a79>   DW_AT_decl_line   : 446
    <a7b>   DW_AT_decl_column : 15
    <a7c>   DW_AT_type        : <0x193>
 <1><a80>: Abbrev Number: 16 (DW_TAG_variable)
    <a81>   DW_AT_name        : (indirect string, offset: 0xe371): SP0Y$
    <a85>   DW_AT_decl_file   : 1
    <a86>   DW_AT_decl_line   : 446
    <a88>   DW_AT_decl_column : 15
    <a89>   DW_AT_type        : <0x193>
 <1><a8d>: Abbrev Number: 16 (DW_TAG_variable)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x14062): SP1X$
    <a92>   DW_AT_decl_file   : 1
    <a93>   DW_AT_decl_line   : 446
    <a95>   DW_AT_decl_column : 15
    <a96>   DW_AT_type        : <0x193>
 <1><a9a>: Abbrev Number: 16 (DW_TAG_variable)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x14198): SP1Y$
    <a9f>   DW_AT_decl_file   : 1
    <aa0>   DW_AT_decl_line   : 446
    <aa2>   DW_AT_decl_column : 15
    <aa3>   DW_AT_type        : <0x193>
 <1><aa7>: Abbrev Number: 16 (DW_TAG_variable)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x40f1): SP2X$
    <aac>   DW_AT_decl_file   : 1
    <aad>   DW_AT_decl_line   : 446
    <aaf>   DW_AT_decl_column : 15
    <ab0>   DW_AT_type        : <0x193>
 <1><ab4>: Abbrev Number: 16 (DW_TAG_variable)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x4195): SP2Y$
    <ab9>   DW_AT_decl_file   : 1
    <aba>   DW_AT_decl_line   : 446
    <abc>   DW_AT_decl_column : 15
    <abd>   DW_AT_type        : <0x193>
 <1><ac1>: Abbrev Number: 16 (DW_TAG_variable)
    <ac2>   DW_AT_name        : (indirect string, offset: 0xa294): SP3X$
    <ac6>   DW_AT_decl_file   : 1
    <ac7>   DW_AT_decl_line   : 446
    <ac9>   DW_AT_decl_column : 15
    <aca>   DW_AT_type        : <0x193>
 <1><ace>: Abbrev Number: 16 (DW_TAG_variable)
    <acf>   DW_AT_name        : (indirect string, offset: 0xa3c0): SP3Y$
    <ad3>   DW_AT_decl_file   : 1
    <ad4>   DW_AT_decl_line   : 446
    <ad6>   DW_AT_decl_column : 15
    <ad7>   DW_AT_type        : <0x193>
 <1><adb>: Abbrev Number: 16 (DW_TAG_variable)
    <adc>   DW_AT_name        : (indirect string, offset: 0x10411): SP4X$
    <ae0>   DW_AT_decl_file   : 1
    <ae1>   DW_AT_decl_line   : 446
    <ae3>   DW_AT_decl_column : 15
    <ae4>   DW_AT_type        : <0x193>
 <1><ae8>: Abbrev Number: 16 (DW_TAG_variable)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x10513): SP4Y$
    <aed>   DW_AT_decl_file   : 1
    <aee>   DW_AT_decl_line   : 446
    <af0>   DW_AT_decl_column : 15
    <af1>   DW_AT_type        : <0x193>
 <1><af5>: Abbrev Number: 16 (DW_TAG_variable)
    <af6>   DW_AT_name        : (indirect string, offset: 0x17f): SP5X$
    <afa>   DW_AT_decl_file   : 1
    <afb>   DW_AT_decl_line   : 446
    <afd>   DW_AT_decl_column : 15
    <afe>   DW_AT_type        : <0x193>
 <1><b02>: Abbrev Number: 16 (DW_TAG_variable)
    <b03>   DW_AT_name        : (indirect string, offset: 0x2a5): SP5Y$
    <b07>   DW_AT_decl_file   : 1
    <b08>   DW_AT_decl_line   : 446
    <b0a>   DW_AT_decl_column : 15
    <b0b>   DW_AT_type        : <0x193>
 <1><b0f>: Abbrev Number: 16 (DW_TAG_variable)
    <b10>   DW_AT_name        : (indirect string, offset: 0x645a): SP6X$
    <b14>   DW_AT_decl_file   : 1
    <b15>   DW_AT_decl_line   : 446
    <b17>   DW_AT_decl_column : 15
    <b18>   DW_AT_type        : <0x193>
 <1><b1c>: Abbrev Number: 16 (DW_TAG_variable)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x659b): SP6Y$
    <b21>   DW_AT_decl_file   : 1
    <b22>   DW_AT_decl_line   : 446
    <b24>   DW_AT_decl_column : 15
    <b25>   DW_AT_type        : <0x193>
 <1><b29>: Abbrev Number: 16 (DW_TAG_variable)
    <b2a>   DW_AT_name        : (indirect string, offset: 0xc7e1): SP7X$
    <b2e>   DW_AT_decl_file   : 1
    <b2f>   DW_AT_decl_line   : 446
    <b31>   DW_AT_decl_column : 15
    <b32>   DW_AT_type        : <0x193>
 <1><b36>: Abbrev Number: 16 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0xc924): SP7Y$
    <b3b>   DW_AT_decl_file   : 1
    <b3c>   DW_AT_decl_line   : 446
    <b3e>   DW_AT_decl_column : 15
    <b3f>   DW_AT_type        : <0x193>
 <1><b43>: Abbrev Number: 16 (DW_TAG_variable)
    <b44>   DW_AT_name        : (indirect string, offset: 0x1382): RASTR$
    <b48>   DW_AT_decl_file   : 1
    <b49>   DW_AT_decl_line   : 446
    <b4b>   DW_AT_decl_column : 15
    <b4c>   DW_AT_type        : <0x193>
 <1><b50>: Abbrev Number: 16 (DW_TAG_variable)
    <b51>   DW_AT_name        : (indirect string, offset: 0x10a2e): SPENA$
    <b55>   DW_AT_decl_file   : 1
    <b56>   DW_AT_decl_line   : 446
    <b58>   DW_AT_decl_column : 15
    <b59>   DW_AT_type        : <0x193>
 <1><b5d>: Abbrev Number: 16 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0xba35): VMCSB$
    <b62>   DW_AT_decl_file   : 1
    <b63>   DW_AT_decl_line   : 446
    <b65>   DW_AT_decl_column : 15
    <b66>   DW_AT_type        : <0x193>
 <1><b6a>: Abbrev Number: 16 (DW_TAG_variable)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xabed): EXTCOL$
    <b6f>   DW_AT_decl_file   : 1
    <b70>   DW_AT_decl_line   : 446
    <b72>   DW_AT_decl_column : 15
    <b73>   DW_AT_type        : <0x193>
 <1><b77>: Abbrev Number: 16 (DW_TAG_variable)
    <b78>   DW_AT_name        : (indirect string, offset: 0x12322): BGCOL0$
    <b7c>   DW_AT_decl_file   : 1
    <b7d>   DW_AT_decl_line   : 446
    <b7f>   DW_AT_decl_column : 15
    <b80>   DW_AT_type        : <0x193>
 <1><b84>: Abbrev Number: 16 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x1240f): BGCOL1$
    <b89>   DW_AT_decl_file   : 1
    <b8a>   DW_AT_decl_line   : 446
    <b8c>   DW_AT_decl_column : 15
    <b8d>   DW_AT_type        : <0x193>
 <1><b91>: Abbrev Number: 16 (DW_TAG_variable)
    <b92>   DW_AT_name        : (indirect string, offset: 0x124ee): BGCOL2$
    <b96>   DW_AT_decl_file   : 1
    <b97>   DW_AT_decl_line   : 446
    <b99>   DW_AT_decl_column : 15
    <b9a>   DW_AT_type        : <0x193>
 <1><b9e>: Abbrev Number: 16 (DW_TAG_variable)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x12562): BGCOL3$
    <ba3>   DW_AT_decl_file   : 1
    <ba4>   DW_AT_decl_line   : 446
    <ba6>   DW_AT_decl_column : 15
    <ba7>   DW_AT_type        : <0x193>
 <1><bab>: Abbrev Number: 16 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0xfe5f): SP0COL$
    <bb0>   DW_AT_decl_file   : 1
    <bb1>   DW_AT_decl_line   : 446
    <bb3>   DW_AT_decl_column : 15
    <bb4>   DW_AT_type        : <0x193>
 <1><bb8>: Abbrev Number: 16 (DW_TAG_variable)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x12d88): SP1COL$
    <bbd>   DW_AT_decl_file   : 1
    <bbe>   DW_AT_decl_line   : 446
    <bc0>   DW_AT_decl_column : 15
    <bc1>   DW_AT_type        : <0x193>
 <1><bc5>: Abbrev Number: 16 (DW_TAG_variable)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x423): SP2COL$
    <bca>   DW_AT_decl_file   : 1
    <bcb>   DW_AT_decl_line   : 446
    <bcd>   DW_AT_decl_column : 15
    <bce>   DW_AT_type        : <0x193>
 <1><bd2>: Abbrev Number: 16 (DW_TAG_variable)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x3d38): SP3COL$
    <bd7>   DW_AT_decl_file   : 1
    <bd8>   DW_AT_decl_line   : 446
    <bda>   DW_AT_decl_column : 15
    <bdb>   DW_AT_type        : <0x193>
 <1><bdf>: Abbrev Number: 16 (DW_TAG_variable)
    <be0>   DW_AT_name        : (indirect string, offset: 0x6e7e): SP4COL$
    <be4>   DW_AT_decl_file   : 1
    <be5>   DW_AT_decl_line   : 446
    <be7>   DW_AT_decl_column : 15
    <be8>   DW_AT_type        : <0x193>
 <1><bec>: Abbrev Number: 16 (DW_TAG_variable)
    <bed>   DW_AT_name        : (indirect string, offset: 0xa64c): SP5COL$
    <bf1>   DW_AT_decl_file   : 1
    <bf2>   DW_AT_decl_line   : 446
    <bf4>   DW_AT_decl_column : 15
    <bf5>   DW_AT_type        : <0x193>
 <1><bf9>: Abbrev Number: 16 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xdf80): SP6COL$
    <bfe>   DW_AT_decl_file   : 1
    <bff>   DW_AT_decl_line   : 446
    <c01>   DW_AT_decl_column : 15
    <c02>   DW_AT_type        : <0x193>
 <1><c06>: Abbrev Number: 16 (DW_TAG_variable)
    <c07>   DW_AT_name        : (indirect string, offset: 0x10f86): SP7COL$
    <c0b>   DW_AT_decl_file   : 1
    <c0c>   DW_AT_decl_line   : 446
    <c0e>   DW_AT_decl_column : 15
    <c0f>   DW_AT_type        : <0x193>
 <1><c13>: Abbrev Number: 28 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x67da): SWCH$
    <c18>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 446
    <c1a>   DW_AT_decl_column : 15
    <c1b>   DW_AT_type        : <0x13e>
    <c1f>   DW_AT_external    : 1
    <c1f>   DW_AT_declaration : 1
 <1><c1f>: Abbrev Number: 28 (DW_TAG_variable)
    <c20>   DW_AT_name        : (indirect string, offset: 0xf3da): OFFSET$
    <c24>   DW_AT_decl_file   : 1
    <c24>   DW_AT_decl_line   : 446
    <c26>   DW_AT_decl_column : 15
    <c27>   DW_AT_type        : <0x13e>
    <c2b>   DW_AT_external    : 1
    <c2b>   DW_AT_declaration : 1
 <1><c2b>: Abbrev Number: 28 (DW_TAG_variable)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x12817): IMAGE$
    <c30>   DW_AT_decl_file   : 1
    <c30>   DW_AT_decl_line   : 446
    <c32>   DW_AT_decl_column : 14
    <c33>   DW_AT_type        : <0x735>
    <c37>   DW_AT_external    : 1
    <c37>   DW_AT_declaration : 1
 <1><c37>: Abbrev Number: 28 (DW_TAG_variable)
    <c38>   DW_AT_name        : (indirect string, offset: 0x627e): STRCODE$
    <c3c>   DW_AT_decl_file   : 1
    <c3c>   DW_AT_decl_line   : 446
    <c3e>   DW_AT_decl_column : 17
    <c3f>   DW_AT_type        : <0x227>
    <c43>   DW_AT_external    : 1
    <c43>   DW_AT_declaration : 1
 <1><c43>: Abbrev Number: 28 (DW_TAG_variable)
    <c44>   DW_AT_name        : (indirect string, offset: 0xc8fd): FILENAME$
    <c48>   DW_AT_decl_file   : 1
    <c48>   DW_AT_decl_line   : 446
    <c4a>   DW_AT_decl_column : 17
    <c4b>   DW_AT_type        : <0x227>
    <c4f>   DW_AT_external    : 1
    <c4f>   DW_AT_declaration : 1
 <1><c4f>: Abbrev Number: 9 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0x31aa): GLCREATESHADER$
    <c54>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 446
    <c57>   DW_AT_decl_column : 15
    <c58>   DW_AT_type        : <0x28b>
    <c5c>   DW_AT_location    : 9 byte block: 3 98 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e98)
 <1><c66>: Abbrev Number: 9 (DW_TAG_variable)
    <c67>   DW_AT_name        : (indirect string, offset: 0x56e5): GLDELETESHADER$
    <c6b>   DW_AT_decl_file   : 1
    <c6c>   DW_AT_decl_line   : 446
    <c6e>   DW_AT_decl_column : 15
    <c6f>   DW_AT_type        : <0x2ab>
    <c73>   DW_AT_location    : 9 byte block: 3 90 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e90)
 <1><c7d>: Abbrev Number: 9 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x4444): GLSHADERSOURCE$
    <c82>   DW_AT_decl_file   : 1
    <c83>   DW_AT_decl_line   : 446
    <c85>   DW_AT_decl_column : 15
    <c86>   DW_AT_type        : <0x2c7>
    <c8a>   DW_AT_location    : 9 byte block: 3 88 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e88)
 <1><c94>: Abbrev Number: 9 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0x16203): GLCOMPILESHADER$
    <c99>   DW_AT_decl_file   : 1
    <c9a>   DW_AT_decl_line   : 446
    <c9c>   DW_AT_decl_column : 15
    <c9d>   DW_AT_type        : <0x2ab>
    <ca1>   DW_AT_location    : 9 byte block: 3 80 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e80)
 <1><cab>: Abbrev Number: 9 (DW_TAG_variable)
    <cac>   DW_AT_name        : (indirect string, offset: 0xdc62): GLGETSHADERIV$
    <cb0>   DW_AT_decl_file   : 1
    <cb1>   DW_AT_decl_line   : 446
    <cb3>   DW_AT_decl_column : 15
    <cb4>   DW_AT_type        : <0x301>
    <cb8>   DW_AT_location    : 9 byte block: 3 78 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e78)
 <1><cc2>: Abbrev Number: 9 (DW_TAG_variable)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x2385): GLGETSHADERINFOLOG$
    <cc7>   DW_AT_decl_file   : 1
    <cc8>   DW_AT_decl_line   : 446
    <cca>   DW_AT_decl_column : 15
    <ccb>   DW_AT_type        : <0x327>
    <ccf>   DW_AT_location    : 9 byte block: 3 70 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e70)
 <1><cd9>: Abbrev Number: 9 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0x2f70): GLCREATEPROGRAM$
    <cde>   DW_AT_decl_file   : 1
    <cdf>   DW_AT_decl_line   : 446
    <ce1>   DW_AT_decl_column : 15
    <ce2>   DW_AT_type        : <0x352>
    <ce6>   DW_AT_location    : 9 byte block: 3 68 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e68)
 <1><cf0>: Abbrev Number: 9 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x12216): GLDELETEPROGRAM$
    <cf5>   DW_AT_decl_file   : 1
    <cf6>   DW_AT_decl_line   : 446
    <cf8>   DW_AT_decl_column : 15
    <cf9>   DW_AT_type        : <0x2ab>
    <cfd>   DW_AT_location    : 9 byte block: 3 60 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e60)
 <1><d07>: Abbrev Number: 9 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0x17cf): GLATTACHSHADER$
    <d0c>   DW_AT_decl_file   : 1
    <d0d>   DW_AT_decl_line   : 446
    <d0f>   DW_AT_decl_column : 15
    <d10>   DW_AT_type        : <0x368>
    <d14>   DW_AT_location    : 9 byte block: 3 58 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e58)
 <1><d1e>: Abbrev Number: 9 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x2314): GLDETACHSHADER$
    <d23>   DW_AT_decl_file   : 1
    <d24>   DW_AT_decl_line   : 446
    <d26>   DW_AT_decl_column : 15
    <d27>   DW_AT_type        : <0x368>
    <d2b>   DW_AT_location    : 9 byte block: 3 50 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e50)
 <1><d35>: Abbrev Number: 9 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0xe706): GLLINKPROGRAM$
    <d3a>   DW_AT_decl_file   : 1
    <d3b>   DW_AT_decl_line   : 446
    <d3d>   DW_AT_decl_column : 15
    <d3e>   DW_AT_type        : <0x2ab>
    <d42>   DW_AT_location    : 9 byte block: 3 48 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e48)
 <1><d4c>: Abbrev Number: 9 (DW_TAG_variable)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x2b68): GLGETPROGRAMIV$
    <d51>   DW_AT_decl_file   : 1
    <d52>   DW_AT_decl_line   : 446
    <d54>   DW_AT_decl_column : 15
    <d55>   DW_AT_type        : <0x301>
    <d59>   DW_AT_location    : 9 byte block: 3 40 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e40)
 <1><d63>: Abbrev Number: 9 (DW_TAG_variable)
    <d64>   DW_AT_name        : (indirect string, offset: 0x1114f): GLGETPROGRAMINFOLOG$
    <d68>   DW_AT_decl_file   : 1
    <d69>   DW_AT_decl_line   : 446
    <d6b>   DW_AT_decl_column : 15
    <d6c>   DW_AT_type        : <0x327>
    <d70>   DW_AT_location    : 9 byte block: 3 38 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e38)
 <1><d7a>: Abbrev Number: 9 (DW_TAG_variable)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x6014): GLUSEPROGRAM$
    <d7f>   DW_AT_decl_file   : 1
    <d80>   DW_AT_decl_line   : 446
    <d82>   DW_AT_decl_column : 15
    <d83>   DW_AT_type        : <0x2ab>
    <d87>   DW_AT_location    : 9 byte block: 3 30 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e30)
 <1><d91>: Abbrev Number: 9 (DW_TAG_variable)
    <d92>   DW_AT_name        : (indirect string, offset: 0x6f4a): GLGETUNIFORMLOCATION$
    <d96>   DW_AT_decl_file   : 1
    <d97>   DW_AT_decl_line   : 446
    <d99>   DW_AT_decl_column : 15
    <d9a>   DW_AT_type        : <0x389>
    <d9e>   DW_AT_location    : 9 byte block: 3 28 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e28)
 <1><da8>: Abbrev Number: 9 (DW_TAG_variable)
    <da9>   DW_AT_name        : (indirect string, offset: 0xbf00): GLUNIFORM1F$
    <dad>   DW_AT_decl_file   : 1
    <dae>   DW_AT_decl_line   : 446
    <db0>   DW_AT_decl_column : 15
    <db1>   DW_AT_type        : <0x3cf>
    <db5>   DW_AT_location    : 9 byte block: 3 20 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e20)
 <1><dbf>: Abbrev Number: 58 (DW_TAG_typedef)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x6083): tmp$94
    <dc4>   DW_AT_decl_file   : 1
    <dc4>   DW_AT_decl_line   : 446
    <dc6>   DW_AT_decl_column : 16
    <dc7>   DW_AT_type        : <0xdcb>
 <1><dcb>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <dcc>   DW_AT_byte_size   : 8
    <dcc>   DW_AT_type        : <0xdd0>
 <1><dd0>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <dd1>   DW_AT_prototyped  : 1
    <dd1>   DW_AT_sibling     : <0xde5>
 <2><dd5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd6>   DW_AT_type        : <0x1a6>
 <2><dda>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ddb>   DW_AT_type        : <0x145>
 <2><ddf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <de0>   DW_AT_type        : <0x145>
 <2><de4>: Abbrev Number: 0
 <1><de5>: Abbrev Number: 16 (DW_TAG_variable)
    <de6>   DW_AT_name        : (indirect string, offset: 0x11ceb): GLUNIFORM2F$
    <dea>   DW_AT_decl_file   : 1
    <deb>   DW_AT_decl_line   : 446
    <ded>   DW_AT_decl_column : 15
    <dee>   DW_AT_type        : <0xdbf>
 <1><df2>: Abbrev Number: 9 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0x1db8): GLUNIFORM3F$
    <df7>   DW_AT_decl_file   : 1
    <df8>   DW_AT_decl_line   : 446
    <dfa>   DW_AT_decl_column : 15
    <dfb>   DW_AT_type        : <0x3f0>
    <dff>   DW_AT_location    : 9 byte block: 3 18 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e18)
 <1><e09>: Abbrev Number: 16 (DW_TAG_variable)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x15b77): GLUNIFORM3FV$
    <e0e>   DW_AT_decl_file   : 1
    <e0f>   DW_AT_decl_line   : 446
    <e11>   DW_AT_decl_column : 15
    <e12>   DW_AT_type        : <0x41b>
 <1><e16>: Abbrev Number: 9 (DW_TAG_variable)
    <e17>   DW_AT_name        : (indirect string, offset: 0x7be1): GLUNIFORM4F$
    <e1b>   DW_AT_decl_file   : 1
    <e1c>   DW_AT_decl_line   : 446
    <e1e>   DW_AT_decl_column : 15
    <e1f>   DW_AT_type        : <0x446>
    <e23>   DW_AT_location    : 9 byte block: 3 10 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e10)
 <1><e2d>: Abbrev Number: 16 (DW_TAG_variable)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x7525): GLUNIFORM4FV$
    <e32>   DW_AT_decl_file   : 1
    <e33>   DW_AT_decl_line   : 446
    <e35>   DW_AT_decl_column : 15
    <e36>   DW_AT_type        : <0x41b>
 <1><e3a>: Abbrev Number: 9 (DW_TAG_variable)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xc3d8): GLUNIFORM1I$
    <e3f>   DW_AT_decl_file   : 1
    <e40>   DW_AT_decl_line   : 446
    <e42>   DW_AT_decl_column : 15
    <e43>   DW_AT_type        : <0x3ae>
    <e47>   DW_AT_location    : 9 byte block: 3 8 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e08)
 <1><e51>: Abbrev Number: 41 (DW_TAG_variable)
    <e52>   DW_AT_name        : PC$
    <e56>   DW_AT_decl_file   : 1
    <e56>   DW_AT_decl_line   : 446
    <e58>   DW_AT_decl_column : 15
    <e59>   DW_AT_type        : <0x1d8>
    <e5d>   DW_AT_location    : 9 byte block: 3 0 e 4b 0 0 0 0 0 	(DW_OP_addr: 4b0e00)
 <1><e67>: Abbrev Number: 16 (DW_TAG_variable)
    <e68>   DW_AT_name        : (indirect string, offset: 0x102ee): ADR0$
    <e6c>   DW_AT_decl_file   : 1
    <e6d>   DW_AT_decl_line   : 446
    <e6f>   DW_AT_decl_column : 15
    <e70>   DW_AT_type        : <0x1d8>
 <1><e74>: Abbrev Number: 16 (DW_TAG_variable)
    <e75>   DW_AT_name        : (indirect string, offset: 0x103c3): ADR1$
    <e79>   DW_AT_decl_file   : 1
    <e7a>   DW_AT_decl_line   : 446
    <e7c>   DW_AT_decl_column : 15
    <e7d>   DW_AT_type        : <0x1d8>
 <1><e81>: Abbrev Number: 16 (DW_TAG_variable)
    <e82>   DW_AT_name        : (indirect string, offset: 0x104eb): ADR2$
    <e86>   DW_AT_decl_file   : 1
    <e87>   DW_AT_decl_line   : 446
    <e89>   DW_AT_decl_column : 15
    <e8a>   DW_AT_type        : <0x1d8>
 <1><e8e>: Abbrev Number: 16 (DW_TAG_variable)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x1053d): ADR3$
    <e93>   DW_AT_decl_file   : 1
    <e94>   DW_AT_decl_line   : 446
    <e96>   DW_AT_decl_column : 15
    <e97>   DW_AT_type        : <0x1d8>
 <1><e9b>: Abbrev Number: 16 (DW_TAG_variable)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xe21b): PC_STATUS$
    <ea0>   DW_AT_decl_file   : 1
    <ea1>   DW_AT_decl_line   : 446
    <ea3>   DW_AT_decl_column : 15
    <ea4>   DW_AT_type        : <0x1d8>
 <1><ea8>: Abbrev Number: 32 (DW_TAG_variable)
    <ea9>   DW_AT_name        : R0$
    <ead>   DW_AT_decl_file   : 1
    <ead>   DW_AT_decl_line   : 446
    <eaf>   DW_AT_decl_column : 15
    <eb0>   DW_AT_type        : <0x1b2>
 <1><eb4>: Abbrev Number: 32 (DW_TAG_variable)
    <eb5>   DW_AT_name        : R1$
    <eb9>   DW_AT_decl_file   : 1
    <eb9>   DW_AT_decl_line   : 446
    <ebb>   DW_AT_decl_column : 15
    <ebc>   DW_AT_type        : <0x1b2>
 <1><ec0>: Abbrev Number: 32 (DW_TAG_variable)
    <ec1>   DW_AT_name        : R2$
    <ec5>   DW_AT_decl_file   : 1
    <ec5>   DW_AT_decl_line   : 446
    <ec7>   DW_AT_decl_column : 15
    <ec8>   DW_AT_type        : <0x1b2>
 <1><ecc>: Abbrev Number: 41 (DW_TAG_variable)
    <ecd>   DW_AT_name        : R3$
    <ed1>   DW_AT_decl_file   : 1
    <ed1>   DW_AT_decl_line   : 446
    <ed3>   DW_AT_decl_column : 15
    <ed4>   DW_AT_type        : <0x1b2>
    <ed8>   DW_AT_location    : 9 byte block: 3 f8 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0df8)
 <1><ee2>: Abbrev Number: 32 (DW_TAG_variable)
    <ee3>   DW_AT_name        : R4$
    <ee7>   DW_AT_decl_file   : 1
    <ee7>   DW_AT_decl_line   : 446
    <ee9>   DW_AT_decl_column : 15
    <eea>   DW_AT_type        : <0x1b2>
 <1><eee>: Abbrev Number: 32 (DW_TAG_variable)
    <eef>   DW_AT_name        : R5$
    <ef3>   DW_AT_decl_file   : 1
    <ef3>   DW_AT_decl_line   : 446
    <ef5>   DW_AT_decl_column : 15
    <ef6>   DW_AT_type        : <0x1b2>
 <1><efa>: Abbrev Number: 9 (DW_TAG_variable)
    <efb>   DW_AT_name        : (indirect string, offset: 0x8155): RADIUS$
    <eff>   DW_AT_decl_file   : 1
    <f00>   DW_AT_decl_line   : 446
    <f02>   DW_AT_decl_column : 15
    <f03>   DW_AT_type        : <0x1d8>
    <f07>   DW_AT_location    : 9 byte block: 3 f0 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0df0)
 <1><f11>: Abbrev Number: 16 (DW_TAG_variable)
    <f12>   DW_AT_name        : (indirect string, offset: 0x12648): RED2$
    <f16>   DW_AT_decl_file   : 1
    <f17>   DW_AT_decl_line   : 446
    <f19>   DW_AT_decl_column : 15
    <f1a>   DW_AT_type        : <0x1b2>
 <1><f1e>: Abbrev Number: 16 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x7026): GREEN2$
    <f23>   DW_AT_decl_file   : 1
    <f24>   DW_AT_decl_line   : 446
    <f26>   DW_AT_decl_column : 15
    <f27>   DW_AT_type        : <0x1b2>
 <1><f2b>: Abbrev Number: 16 (DW_TAG_variable)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x52eb): BLUE2$
    <f30>   DW_AT_decl_file   : 1
    <f31>   DW_AT_decl_line   : 446
    <f33>   DW_AT_decl_column : 15
    <f34>   DW_AT_type        : <0x1b2>
 <1><f38>: Abbrev Number: 16 (DW_TAG_variable)
    <f39>   DW_AT_name        : (indirect string, offset: 0x185c): XALPHA2$
    <f3d>   DW_AT_decl_file   : 1
    <f3e>   DW_AT_decl_line   : 446
    <f40>   DW_AT_decl_column : 15
    <f41>   DW_AT_type        : <0x1b2>
 <1><f45>: Abbrev Number: 16 (DW_TAG_variable)
    <f46>   DW_AT_name        : (indirect string, offset: 0x1082d): X_AXIS0$
    <f4a>   DW_AT_decl_file   : 1
    <f4b>   DW_AT_decl_line   : 446
    <f4d>   DW_AT_decl_column : 14
    <f4e>   DW_AT_type        : <0x145>
 <1><f52>: Abbrev Number: 16 (DW_TAG_variable)
    <f53>   DW_AT_name        : (indirect string, offset: 0x69d7): Y_AXIS0$
    <f57>   DW_AT_decl_file   : 1
    <f58>   DW_AT_decl_line   : 446
    <f5a>   DW_AT_decl_column : 14
    <f5b>   DW_AT_type        : <0x145>
 <1><f5f>: Abbrev Number: 16 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0x1299b): Z_AXIS0$
    <f64>   DW_AT_decl_file   : 1
    <f65>   DW_AT_decl_line   : 446
    <f67>   DW_AT_decl_column : 14
    <f68>   DW_AT_type        : <0x145>
 <1><f6c>: Abbrev Number: 16 (DW_TAG_variable)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x12324): COL0$
    <f71>   DW_AT_decl_file   : 1
    <f72>   DW_AT_decl_line   : 446
    <f74>   DW_AT_decl_column : 14
    <f75>   DW_AT_type        : <0x145>
 <1><f79>: Abbrev Number: 16 (DW_TAG_variable)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x12411): COL1$
    <f7e>   DW_AT_decl_file   : 1
    <f7f>   DW_AT_decl_line   : 446
    <f81>   DW_AT_decl_column : 14
    <f82>   DW_AT_type        : <0x145>
 <1><f86>: Abbrev Number: 9 (DW_TAG_variable)
    <f87>   DW_AT_name        : (indirect string, offset: 0xbe4d): CHAR_H$
    <f8b>   DW_AT_decl_file   : 1
    <f8c>   DW_AT_decl_line   : 446
    <f8e>   DW_AT_decl_column : 14
    <f8f>   DW_AT_type        : <0x145>
    <f93>   DW_AT_location    : 9 byte block: 3 9c a6 48 0 0 0 0 0 	(DW_OP_addr: 48a69c)
 <1><f9d>: Abbrev Number: 16 (DW_TAG_variable)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x10984): X_AXIS1$
    <fa2>   DW_AT_decl_file   : 1
    <fa3>   DW_AT_decl_line   : 446
    <fa5>   DW_AT_decl_column : 14
    <fa6>   DW_AT_type        : <0x145>
 <1><faa>: Abbrev Number: 16 (DW_TAG_variable)
    <fab>   DW_AT_name        : (indirect string, offset: 0x6b0e): Y_AXIS1$
    <faf>   DW_AT_decl_file   : 1
    <fb0>   DW_AT_decl_line   : 446
    <fb2>   DW_AT_decl_column : 14
    <fb3>   DW_AT_type        : <0x145>
 <1><fb7>: Abbrev Number: 16 (DW_TAG_variable)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x12b65): Z_AXIS1$
    <fbc>   DW_AT_decl_file   : 1
    <fbd>   DW_AT_decl_line   : 446
    <fbf>   DW_AT_decl_column : 14
    <fc0>   DW_AT_type        : <0x145>
 <1><fc4>: Abbrev Number: 16 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xa963): CHAR_PTR$
    <fc9>   DW_AT_decl_file   : 1
    <fca>   DW_AT_decl_line   : 446
    <fcc>   DW_AT_decl_column : 14
    <fcd>   DW_AT_type        : <0x145>
 <1><fd1>: Abbrev Number: 9 (DW_TAG_variable)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xd04e): CHAR_W$
    <fd6>   DW_AT_decl_file   : 1
    <fd7>   DW_AT_decl_line   : 446
    <fd9>   DW_AT_decl_column : 14
    <fda>   DW_AT_type        : <0x145>
    <fde>   DW_AT_location    : 9 byte block: 3 98 a6 48 0 0 0 0 0 	(DW_OP_addr: 48a698)
 <1><fe8>: Abbrev Number: 9 (DW_TAG_variable)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xa3d8): CHAR_BUFFER$
    <fed>   DW_AT_decl_file   : 1
    <fee>   DW_AT_decl_line   : 446
    <ff0>   DW_AT_decl_column : 15
    <ff1>   DW_AT_type        : <0x1b2>
    <ff5>   DW_AT_location    : 9 byte block: 3 94 a6 48 0 0 0 0 0 	(DW_OP_addr: 48a694)
 <1><fff>: Abbrev Number: 9 (DW_TAG_variable)
    <1000>   DW_AT_name        : (indirect string, offset: 0x2354): BITMASK$
    <1004>   DW_AT_decl_file   : 1
    <1005>   DW_AT_decl_line   : 446
    <1007>   DW_AT_decl_column : 15
    <1008>   DW_AT_type        : <0x1b2>
    <100c>   DW_AT_location    : 9 byte block: 3 90 a6 48 0 0 0 0 0 	(DW_OP_addr: 48a690)
 <1><1016>: Abbrev Number: 9 (DW_TAG_variable)
    <1017>   DW_AT_name        : (indirect string, offset: 0x124b8): PIXEL_SIZE$
    <101b>   DW_AT_decl_file   : 1
    <101c>   DW_AT_decl_line   : 446
    <101e>   DW_AT_decl_column : 15
    <101f>   DW_AT_type        : <0x1b2>
    <1023>   DW_AT_location    : 9 byte block: 3 ec d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0dec)
 <1><102d>: Abbrev Number: 9 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0x1203d): STRING_ADR$
    <1032>   DW_AT_decl_file   : 1
    <1033>   DW_AT_decl_line   : 446
    <1035>   DW_AT_decl_column : 15
    <1036>   DW_AT_type        : <0x1b2>
    <103a>   DW_AT_location    : 9 byte block: 3 e8 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0de8)
 <1><1044>: Abbrev Number: 16 (DW_TAG_variable)
    <1045>   DW_AT_name        : (indirect string, offset: 0x94c): STRING_LEN$
    <1049>   DW_AT_decl_file   : 1
    <104a>   DW_AT_decl_line   : 446
    <104c>   DW_AT_decl_column : 15
    <104d>   DW_AT_type        : <0x1b2>
 <1><1051>: Abbrev Number: 16 (DW_TAG_variable)
    <1052>   DW_AT_name        : (indirect string, offset: 0xa3a1): DRIVER_NAME$
    <1056>   DW_AT_decl_file   : 1
    <1057>   DW_AT_decl_line   : 446
    <1059>   DW_AT_decl_column : 17
    <105a>   DW_AT_type        : <0x227>
 <1><105e>: Abbrev Number: 9 (DW_TAG_variable)
    <105f>   DW_AT_name        : (indirect string, offset: 0xcaaf): STRING_DATA$
    <1063>   DW_AT_decl_file   : 1
    <1064>   DW_AT_decl_line   : 446
    <1066>   DW_AT_decl_column : 17
    <1067>   DW_AT_type        : <0x227>
    <106b>   DW_AT_location    : 9 byte block: 3 d0 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0dd0)
 <1><1075>: Abbrev Number: 16 (DW_TAG_variable)
    <1076>   DW_AT_name        : (indirect string, offset: 0xe451): MOUSE_X$
    <107a>   DW_AT_decl_file   : 1
    <107b>   DW_AT_decl_line   : 446
    <107d>   DW_AT_decl_column : 14
    <107e>   DW_AT_type        : <0x1a6>
 <1><1082>: Abbrev Number: 16 (DW_TAG_variable)
    <1083>   DW_AT_name        : (indirect string, offset: 0xe534): MOUSE_Y$
    <1087>   DW_AT_decl_file   : 1
    <1088>   DW_AT_decl_line   : 446
    <108a>   DW_AT_decl_column : 14
    <108b>   DW_AT_type        : <0x1a6>
 <1><108f>: Abbrev Number: 16 (DW_TAG_variable)
    <1090>   DW_AT_name        : (indirect string, offset: 0xe377): MOUSE_W$
    <1094>   DW_AT_decl_file   : 1
    <1095>   DW_AT_decl_line   : 446
    <1097>   DW_AT_decl_column : 14
    <1098>   DW_AT_type        : <0x1a6>
 <1><109c>: Abbrev Number: 16 (DW_TAG_variable)
    <109d>   DW_AT_name        : (indirect string, offset: 0xc7f8): MOUSE_B$
    <10a1>   DW_AT_decl_file   : 1
    <10a2>   DW_AT_decl_line   : 446
    <10a4>   DW_AT_decl_column : 14
    <10a5>   DW_AT_type        : <0x1a6>
 <1><10a9>: Abbrev Number: 16 (DW_TAG_variable)
    <10aa>   DW_AT_name        : (indirect string, offset: 0xc94d): MOUSE_C$
    <10ae>   DW_AT_decl_file   : 1
    <10af>   DW_AT_decl_line   : 446
    <10b1>   DW_AT_decl_column : 14
    <10b2>   DW_AT_type        : <0x1a6>
 <1><10b6>: Abbrev Number: 16 (DW_TAG_variable)
    <10b7>   DW_AT_name        : (indirect string, offset: 0xe297): MOUSE_V$
    <10bb>   DW_AT_decl_file   : 1
    <10bc>   DW_AT_decl_line   : 446
    <10be>   DW_AT_decl_column : 14
    <10bf>   DW_AT_type        : <0x1a6>
 <1><10c3>: Abbrev Number: 16 (DW_TAG_variable)
    <10c4>   DW_AT_name        : (indirect string, offset: 0xfcf3): JOYSTICK_ID$
    <10c8>   DW_AT_decl_file   : 1
    <10c9>   DW_AT_decl_line   : 446
    <10cb>   DW_AT_decl_column : 15
    <10cc>   DW_AT_type        : <0x1d8>
 <1><10d0>: Abbrev Number: 16 (DW_TAG_variable)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x5d4b): JOYSTICK_B$
    <10d5>   DW_AT_decl_file   : 1
    <10d6>   DW_AT_decl_line   : 446
    <10d8>   DW_AT_decl_column : 15
    <10d9>   DW_AT_type        : <0x1d8>
 <1><10dd>: Abbrev Number: 32 (DW_TAG_variable)
    <10de>   DW_AT_name        : A1$
    <10e2>   DW_AT_decl_file   : 1
    <10e2>   DW_AT_decl_line   : 446
    <10e4>   DW_AT_decl_column : 14
    <10e5>   DW_AT_type        : <0x145>
 <1><10e9>: Abbrev Number: 32 (DW_TAG_variable)
    <10ea>   DW_AT_name        : A2$
    <10ee>   DW_AT_decl_file   : 1
    <10ee>   DW_AT_decl_line   : 446
    <10f0>   DW_AT_decl_column : 14
    <10f1>   DW_AT_type        : <0x145>
 <1><10f5>: Abbrev Number: 32 (DW_TAG_variable)
    <10f6>   DW_AT_name        : A3$
    <10fa>   DW_AT_decl_file   : 1
    <10fa>   DW_AT_decl_line   : 446
    <10fc>   DW_AT_decl_column : 14
    <10fd>   DW_AT_type        : <0x145>
 <1><1101>: Abbrev Number: 32 (DW_TAG_variable)
    <1102>   DW_AT_name        : A4$
    <1106>   DW_AT_decl_file   : 1
    <1106>   DW_AT_decl_line   : 446
    <1108>   DW_AT_decl_column : 14
    <1109>   DW_AT_type        : <0x145>
 <1><110d>: Abbrev Number: 32 (DW_TAG_variable)
    <110e>   DW_AT_name        : A5$
    <1112>   DW_AT_decl_file   : 1
    <1112>   DW_AT_decl_line   : 446
    <1114>   DW_AT_decl_column : 14
    <1115>   DW_AT_type        : <0x145>
 <1><1119>: Abbrev Number: 32 (DW_TAG_variable)
    <111a>   DW_AT_name        : A6$
    <111e>   DW_AT_decl_file   : 1
    <111e>   DW_AT_decl_line   : 446
    <1120>   DW_AT_decl_column : 14
    <1121>   DW_AT_type        : <0x145>
 <1><1125>: Abbrev Number: 32 (DW_TAG_variable)
    <1126>   DW_AT_name        : A7$
    <112a>   DW_AT_decl_file   : 1
    <112a>   DW_AT_decl_line   : 446
    <112c>   DW_AT_decl_column : 14
    <112d>   DW_AT_type        : <0x145>
 <1><1131>: Abbrev Number: 32 (DW_TAG_variable)
    <1132>   DW_AT_name        : A8$
    <1136>   DW_AT_decl_file   : 1
    <1136>   DW_AT_decl_line   : 446
    <1138>   DW_AT_decl_column : 14
    <1139>   DW_AT_type        : <0x145>
 <1><113d>: Abbrev Number: 16 (DW_TAG_variable)
    <113e>   DW_AT_name        : (indirect string, offset: 0xdf48): KEY$
    <1142>   DW_AT_decl_file   : 1
    <1143>   DW_AT_decl_line   : 446
    <1145>   DW_AT_decl_column : 14
    <1146>   DW_AT_type        : <0x16d>
 <1><114a>: Abbrev Number: 23 (DW_TAG_array_type)
    <114b>   DW_AT_type        : <0x227>
    <114f>   DW_AT_sibling     : <0x115b>
 <2><1153>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <1154>   DW_AT_type        : <0x284>
    <1158>   DW_AT_upper_bound : 45055
 <2><115a>: Abbrev Number: 0
 <1><115b>: Abbrev Number: 16 (DW_TAG_variable)
    <115c>   DW_AT_name        : (indirect string, offset: 0x940c): VRAM$
    <1160>   DW_AT_decl_file   : 1
    <1161>   DW_AT_decl_line   : 446
    <1163>   DW_AT_decl_column : 17
    <1164>   DW_AT_type        : <0x114a>
 <1><1168>: Abbrev Number: 16 (DW_TAG_variable)
    <1169>   DW_AT_name        : (indirect string, offset: 0xdf44): GET_KEY$
    <116d>   DW_AT_decl_file   : 1
    <116e>   DW_AT_decl_line   : 446
    <1170>   DW_AT_decl_column : 17
    <1171>   DW_AT_type        : <0x227>
 <1><1175>: Abbrev Number: 9 (DW_TAG_variable)
    <1176>   DW_AT_name        : (indirect string, offset: 0x115f9): GET_DATA$
    <117a>   DW_AT_decl_file   : 1
    <117b>   DW_AT_decl_line   : 446
    <117d>   DW_AT_decl_column : 17
    <117e>   DW_AT_type        : <0x227>
    <1182>   DW_AT_location    : 9 byte block: 3 b0 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0db0)
 <1><118c>: Abbrev Number: 23 (DW_TAG_array_type)
    <118d>   DW_AT_type        : <0x227>
    <1191>   DW_AT_sibling     : <0x119d>
 <2><1195>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <1196>   DW_AT_type        : <0x284>
    <119a>   DW_AT_upper_bound : 10000
 <2><119c>: Abbrev Number: 0
 <1><119d>: Abbrev Number: 16 (DW_TAG_variable)
    <119e>   DW_AT_name        : (indirect string, offset: 0xb42): OLD_DATA$
    <11a2>   DW_AT_decl_file   : 1
    <11a3>   DW_AT_decl_line   : 446
    <11a5>   DW_AT_decl_column : 17
    <11a6>   DW_AT_type        : <0x118c>
 <1><11aa>: Abbrev Number: 16 (DW_TAG_variable)
    <11ab>   DW_AT_name        : (indirect string, offset: 0x21b): REPEAT$
    <11af>   DW_AT_decl_file   : 1
    <11b0>   DW_AT_decl_line   : 446
    <11b2>   DW_AT_decl_column : 14
    <11b3>   DW_AT_type        : <0x180>
 <1><11b7>: Abbrev Number: 41 (DW_TAG_variable)
    <11b8>   DW_AT_name        : I$
    <11bb>   DW_AT_decl_file   : 1
    <11bb>   DW_AT_decl_line   : 446
    <11bd>   DW_AT_decl_column : 14
    <11be>   DW_AT_type        : <0x1c5>
    <11c2>   DW_AT_location    : 9 byte block: 3 a8 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0da8)
 <1><11cc>: Abbrev Number: 9 (DW_TAG_variable)
    <11cd>   DW_AT_name        : (indirect string, offset: 0xedff): EOL$
    <11d1>   DW_AT_decl_file   : 1
    <11d2>   DW_AT_decl_line   : 446
    <11d4>   DW_AT_decl_column : 17
    <11d5>   DW_AT_type        : <0x227>
    <11d9>   DW_AT_location    : 9 byte block: 3 90 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0d90)
 <1><11e3>: Abbrev Number: 23 (DW_TAG_array_type)
    <11e4>   DW_AT_type        : <0x16d>
    <11e8>   DW_AT_sibling     : <0x11f3>
 <2><11ec>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <11ed>   DW_AT_type        : <0x284>
    <11f1>   DW_AT_upper_bound : 15
 <2><11f2>: Abbrev Number: 0
 <1><11f3>: Abbrev Number: 9 (DW_TAG_variable)
    <11f4>   DW_AT_name        : (indirect string, offset: 0x11f1a): NIBBLES$
    <11f8>   DW_AT_decl_file   : 1
    <11f9>   DW_AT_decl_line   : 446
    <11fb>   DW_AT_decl_column : 14
    <11fc>   DW_AT_type        : <0x11e3>
    <1200>   DW_AT_location    : 9 byte block: 3 80 d 4b 0 0 0 0 0 	(DW_OP_addr: 4b0d80)
 <1><120a>: Abbrev Number: 23 (DW_TAG_array_type)
    <120b>   DW_AT_type        : <0x16d>
    <120f>   DW_AT_sibling     : <0x121a>
 <2><1213>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <1214>   DW_AT_type        : <0x284>
    <1218>   DW_AT_upper_bound : 255
 <2><1219>: Abbrev Number: 0
 <1><121a>: Abbrev Number: 9 (DW_TAG_variable)
    <121b>   DW_AT_name        : (indirect string, offset: 0x16148): BYTES$
    <121f>   DW_AT_decl_file   : 1
    <1220>   DW_AT_decl_line   : 446
    <1222>   DW_AT_decl_column : 14
    <1223>   DW_AT_type        : <0x120a>
    <1227>   DW_AT_location    : 9 byte block: 3 80 c 4b 0 0 0 0 0 	(DW_OP_addr: 4b0c80)
 <1><1231>: Abbrev Number: 23 (DW_TAG_array_type)
    <1232>   DW_AT_type        : <0x193>
    <1236>   DW_AT_sibling     : <0x1242>
 <2><123a>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <123b>   DW_AT_type        : <0x284>
    <123f>   DW_AT_upper_bound : 65535
 <2><1241>: Abbrev Number: 0
 <1><1242>: Abbrev Number: 9 (DW_TAG_variable)
    <1243>   DW_AT_name        : (indirect string, offset: 0x7b3b): XWORDS$
    <1247>   DW_AT_decl_file   : 1
    <1248>   DW_AT_decl_line   : 446
    <124a>   DW_AT_decl_column : 15
    <124b>   DW_AT_type        : <0x1231>
    <124f>   DW_AT_location    : 9 byte block: 3 80 c 49 0 0 0 0 0 	(DW_OP_addr: 490c80)
 <1><1259>: Abbrev Number: 41 (DW_TAG_variable)
    <125a>   DW_AT_name        : C$
    <125d>   DW_AT_decl_file   : 1
    <125d>   DW_AT_decl_line   : 446
    <125f>   DW_AT_decl_column : 14
    <1260>   DW_AT_type        : <0x1c5>
    <1264>   DW_AT_location    : 9 byte block: 3 78 c 49 0 0 0 0 0 	(DW_OP_addr: 490c78)
 <1><126e>: Abbrev Number: 41 (DW_TAG_variable)
    <126f>   DW_AT_name        : X$
    <1272>   DW_AT_decl_file   : 1
    <1272>   DW_AT_decl_line   : 446
    <1274>   DW_AT_decl_column : 14
    <1275>   DW_AT_type        : <0x1c5>
    <1279>   DW_AT_location    : 9 byte block: 3 70 c 49 0 0 0 0 0 	(DW_OP_addr: 490c70)
 <1><1283>: Abbrev Number: 41 (DW_TAG_variable)
    <1284>   DW_AT_name        : Y$
    <1287>   DW_AT_decl_file   : 1
    <1287>   DW_AT_decl_line   : 446
    <1289>   DW_AT_decl_column : 14
    <128a>   DW_AT_type        : <0x1c5>
    <128e>   DW_AT_location    : 9 byte block: 3 68 c 49 0 0 0 0 0 	(DW_OP_addr: 490c68)
 <1><1298>: Abbrev Number: 41 (DW_TAG_variable)
    <1299>   DW_AT_name        : XS$
    <129d>   DW_AT_decl_file   : 1
    <129d>   DW_AT_decl_line   : 446
    <129f>   DW_AT_decl_column : 14
    <12a0>   DW_AT_type        : <0x1c5>
    <12a4>   DW_AT_location    : 9 byte block: 3 60 c 49 0 0 0 0 0 	(DW_OP_addr: 490c60)
 <1><12ae>: Abbrev Number: 41 (DW_TAG_variable)
    <12af>   DW_AT_name        : YS$
    <12b3>   DW_AT_decl_file   : 1
    <12b3>   DW_AT_decl_line   : 446
    <12b5>   DW_AT_decl_column : 14
    <12b6>   DW_AT_type        : <0x1c5>
    <12ba>   DW_AT_location    : 9 byte block: 3 58 c 49 0 0 0 0 0 	(DW_OP_addr: 490c58)
 <1><12c4>: Abbrev Number: 16 (DW_TAG_variable)
    <12c5>   DW_AT_name        : (indirect string, offset: 0x28d2): CARY$
    <12c9>   DW_AT_decl_file   : 1
    <12ca>   DW_AT_decl_line   : 446
    <12cc>   DW_AT_decl_column : 14
    <12cd>   DW_AT_type        : <0x1c5>
 <1><12d1>: Abbrev Number: 28 (DW_TAG_variable)
    <12d2>   DW_AT_name        : (indirect string, offset: 0xf3d6): SYS_OFFSET$
    <12d6>   DW_AT_decl_file   : 1
    <12d6>   DW_AT_decl_line   : 446
    <12d8>   DW_AT_decl_column : 15
    <12d9>   DW_AT_type        : <0x13e>
    <12dd>   DW_AT_external    : 1
    <12dd>   DW_AT_declaration : 1
 <1><12dd>: Abbrev Number: 28 (DW_TAG_variable)
    <12de>   DW_AT_name        : (indirect string, offset: 0x10844): STR_LEN$
    <12e2>   DW_AT_decl_file   : 1
    <12e2>   DW_AT_decl_line   : 446
    <12e4>   DW_AT_decl_column : 15
    <12e5>   DW_AT_type        : <0x13e>
    <12e9>   DW_AT_external    : 1
    <12e9>   DW_AT_declaration : 1
 <1><12e9>: Abbrev Number: 28 (DW_TAG_variable)
    <12ea>   DW_AT_name        : (indirect string, offset: 0xffd6): CNT$
    <12ee>   DW_AT_decl_file   : 1
    <12ee>   DW_AT_decl_line   : 446
    <12f0>   DW_AT_decl_column : 15
    <12f1>   DW_AT_type        : <0x13e>
    <12f5>   DW_AT_external    : 1
    <12f5>   DW_AT_declaration : 1
 <1><12f5>: Abbrev Number: 28 (DW_TAG_variable)
    <12f6>   DW_AT_name        : (indirect string, offset: 0x12815): BGIMAGE$
    <12fa>   DW_AT_decl_file   : 1
    <12fa>   DW_AT_decl_line   : 446
    <12fc>   DW_AT_decl_column : 14
    <12fd>   DW_AT_type        : <0x735>
    <1301>   DW_AT_external    : 1
    <1301>   DW_AT_declaration : 1
 <1><1301>: Abbrev Number: 28 (DW_TAG_variable)
    <1302>   DW_AT_name        : (indirect string, offset: 0xd62): FGIMAGE$
    <1306>   DW_AT_decl_file   : 1
    <1306>   DW_AT_decl_line   : 446
    <1308>   DW_AT_decl_column : 14
    <1309>   DW_AT_type        : <0x735>
    <130d>   DW_AT_external    : 1
    <130d>   DW_AT_declaration : 1
 <1><130d>: Abbrev Number: 28 (DW_TAG_variable)
    <130e>   DW_AT_name        : (indirect string, offset: 0x4a32): RASTER$
    <1312>   DW_AT_decl_file   : 1
    <1312>   DW_AT_decl_line   : 446
    <1314>   DW_AT_decl_column : 14
    <1315>   DW_AT_type        : <0x735>
    <1319>   DW_AT_external    : 1
    <1319>   DW_AT_declaration : 1
 <1><1319>: Abbrev Number: 28 (DW_TAG_variable)
    <131a>   DW_AT_name        : (indirect string, offset: 0x23a9): PSCRN$
    <131e>   DW_AT_decl_file   : 1
    <131e>   DW_AT_decl_line   : 446
    <1320>   DW_AT_decl_column : 14
    <1321>   DW_AT_type        : <0x735>
    <1325>   DW_AT_external    : 1
    <1325>   DW_AT_declaration : 1
 <1><1325>: Abbrev Number: 28 (DW_TAG_variable)
    <1326>   DW_AT_name        : (indirect string, offset: 0x78c4): COMPILER$
    <132a>   DW_AT_decl_file   : 1
    <132a>   DW_AT_decl_line   : 446
    <132c>   DW_AT_decl_column : 17
    <132d>   DW_AT_type        : <0x227>
    <1331>   DW_AT_external    : 1
    <1331>   DW_AT_declaration : 1
 <1><1331>: Abbrev Number: 28 (DW_TAG_variable)
    <1332>   DW_AT_name        : (indirect string, offset: 0x4b0f): SCR_W$
    <1336>   DW_AT_decl_file   : 1
    <1336>   DW_AT_decl_line   : 446
    <1338>   DW_AT_decl_column : 15
    <1339>   DW_AT_type        : <0x1d8>
    <133d>   DW_AT_external    : 1
    <133d>   DW_AT_declaration : 1
 <1><133d>: Abbrev Number: 28 (DW_TAG_variable)
    <133e>   DW_AT_name        : (indirect string, offset: 0x3b3f): SCR_H$
    <1342>   DW_AT_decl_file   : 1
    <1342>   DW_AT_decl_line   : 446
    <1344>   DW_AT_decl_column : 15
    <1345>   DW_AT_type        : <0x1d8>
    <1349>   DW_AT_external    : 1
    <1349>   DW_AT_declaration : 1
 <1><1349>: Abbrev Number: 28 (DW_TAG_variable)
    <134a>   DW_AT_name        : (indirect string, offset: 0xa4d7): SCR_POS$
    <134e>   DW_AT_decl_file   : 1
    <134e>   DW_AT_decl_line   : 446
    <1350>   DW_AT_decl_column : 15
    <1351>   DW_AT_type        : <0x1d8>
    <1355>   DW_AT_external    : 1
    <1355>   DW_AT_declaration : 1
 <1><1355>: Abbrev Number: 28 (DW_TAG_variable)
    <1356>   DW_AT_name        : (indirect string, offset: 0x3031): IMGDATA$
    <135a>   DW_AT_decl_file   : 1
    <135a>   DW_AT_decl_line   : 446
    <135c>   DW_AT_decl_column : 15
    <135d>   DW_AT_type        : <0x1d8>
    <1361>   DW_AT_external    : 1
    <1361>   DW_AT_declaration : 1
 <1><1361>: Abbrev Number: 28 (DW_TAG_variable)
    <1362>   DW_AT_name        : (indirect string, offset: 0xcb3d): PITCH$
    <1366>   DW_AT_decl_file   : 1
    <1366>   DW_AT_decl_line   : 446
    <1368>   DW_AT_decl_column : 15
    <1369>   DW_AT_type        : <0x1d8>
    <136d>   DW_AT_external    : 1
    <136d>   DW_AT_declaration : 1
 <1><136d>: Abbrev Number: 28 (DW_TAG_variable)
    <136e>   DW_AT_name        : (indirect string, offset: 0x9709): RENDER$
    <1372>   DW_AT_decl_file   : 1
    <1372>   DW_AT_decl_line   : 446
    <1374>   DW_AT_decl_column : 14
    <1375>   DW_AT_type        : <0x735>
    <1379>   DW_AT_external    : 1
    <1379>   DW_AT_declaration : 1
 <1><1379>: Abbrev Number: 28 (DW_TAG_variable)
    <137a>   DW_AT_name        : (indirect string, offset: 0xe2bd): MSG$
    <137e>   DW_AT_decl_file   : 1
    <137e>   DW_AT_decl_line   : 446
    <1380>   DW_AT_decl_column : 17
    <1381>   DW_AT_type        : <0x227>
    <1385>   DW_AT_external    : 1
    <1385>   DW_AT_declaration : 1
 <1><1385>: Abbrev Number: 41 (DW_TAG_variable)
    <1386>   DW_AT_name        : V$
    <1389>   DW_AT_decl_file   : 1
    <1389>   DW_AT_decl_line   : 446
    <138b>   DW_AT_decl_column : 23
    <138c>   DW_AT_type        : <0x737>
