    <73abd>   DW_AT_data_member_location: 104
 <2><73abe>: Abbrev Number: 2 (DW_TAG_member)
    <73abf>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <73ac3>   DW_AT_decl_file   : 7
    <73ac4>   DW_AT_decl_line   : 72
    <73ac5>   DW_AT_decl_column : 7
    <73ac6>   DW_AT_type        : <0x7391a>
    <73aca>   DW_AT_data_member_location: 112
 <2><73acb>: Abbrev Number: 2 (DW_TAG_member)
    <73acc>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <73ad0>   DW_AT_decl_file   : 7
    <73ad1>   DW_AT_decl_line   : 73
    <73ad2>   DW_AT_decl_column : 7
    <73ad3>   DW_AT_type        : <0x7391a>
    <73ad7>   DW_AT_data_member_location: 116
 <2><73ad8>: Abbrev Number: 2 (DW_TAG_member)
    <73ad9>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <73add>   DW_AT_decl_file   : 7
    <73ade>   DW_AT_decl_line   : 74
    <73adf>   DW_AT_decl_column : 11
    <73ae0>   DW_AT_type        : <0x7393e>
    <73ae4>   DW_AT_data_member_location: 120
 <2><73ae5>: Abbrev Number: 2 (DW_TAG_member)
    <73ae6>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <73aea>   DW_AT_decl_file   : 7
    <73aeb>   DW_AT_decl_line   : 77
    <73aec>   DW_AT_decl_column : 18
    <73aed>   DW_AT_type        : <0x738df>
    <73af1>   DW_AT_data_member_location: 128
 <2><73af2>: Abbrev Number: 2 (DW_TAG_member)
    <73af3>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <73af7>   DW_AT_decl_file   : 7
    <73af8>   DW_AT_decl_line   : 78
    <73af9>   DW_AT_decl_column : 15
    <73afa>   DW_AT_type        : <0x738f4>
    <73afe>   DW_AT_data_member_location: 130
 <2><73aff>: Abbrev Number: 2 (DW_TAG_member)
    <73b00>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <73b04>   DW_AT_decl_file   : 7
    <73b05>   DW_AT_decl_line   : 79
    <73b06>   DW_AT_decl_column : 8
    <73b07>   DW_AT_type        : <0x73ba5>
    <73b0b>   DW_AT_data_member_location: 131
 <2><73b0c>: Abbrev Number: 2 (DW_TAG_member)
    <73b0d>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <73b11>   DW_AT_decl_file   : 7
    <73b12>   DW_AT_decl_line   : 81
    <73b13>   DW_AT_decl_column : 15
    <73b14>   DW_AT_type        : <0x73bb5>
    <73b18>   DW_AT_data_member_location: 136
 <2><73b19>: Abbrev Number: 2 (DW_TAG_member)
    <73b1a>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <73b1e>   DW_AT_decl_file   : 7
    <73b1f>   DW_AT_decl_line   : 89
    <73b20>   DW_AT_decl_column : 13
    <73b21>   DW_AT_type        : <0x7394a>
    <73b25>   DW_AT_data_member_location: 144
 <2><73b26>: Abbrev Number: 2 (DW_TAG_member)
    <73b27>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <73b2b>   DW_AT_decl_file   : 7
    <73b2c>   DW_AT_decl_line   : 91
    <73b2d>   DW_AT_decl_column : 23
    <73b2e>   DW_AT_type        : <0x73bbf>
    <73b32>   DW_AT_data_member_location: 152
 <2><73b33>: Abbrev Number: 2 (DW_TAG_member)
    <73b34>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <73b38>   DW_AT_decl_file   : 7
    <73b39>   DW_AT_decl_line   : 92
    <73b3a>   DW_AT_decl_column : 25
    <73b3b>   DW_AT_type        : <0x73bc9>
    <73b3f>   DW_AT_data_member_location: 160
 <2><73b40>: Abbrev Number: 2 (DW_TAG_member)
    <73b41>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <73b45>   DW_AT_decl_file   : 7
    <73b46>   DW_AT_decl_line   : 93
    <73b47>   DW_AT_decl_column : 20
    <73b48>   DW_AT_type        : <0x73ba0>
    <73b4c>   DW_AT_data_member_location: 168
 <2><73b4d>: Abbrev Number: 2 (DW_TAG_member)
    <73b4e>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <73b52>   DW_AT_decl_file   : 7
    <73b53>   DW_AT_decl_line   : 94
    <73b54>   DW_AT_decl_column : 9
    <73b55>   DW_AT_type        : <0x73956>
    <73b59>   DW_AT_data_member_location: 176
 <2><73b5a>: Abbrev Number: 2 (DW_TAG_member)
    <73b5b>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <73b5f>   DW_AT_decl_file   : 7
    <73b60>   DW_AT_decl_line   : 95
    <73b61>   DW_AT_decl_column : 10
    <73b62>   DW_AT_type        : <0x739a3>
    <73b66>   DW_AT_data_member_location: 184
 <2><73b67>: Abbrev Number: 2 (DW_TAG_member)
    <73b68>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <73b6c>   DW_AT_decl_file   : 7
    <73b6d>   DW_AT_decl_line   : 96
    <73b6e>   DW_AT_decl_column : 7
    <73b6f>   DW_AT_type        : <0x7391a>
    <73b73>   DW_AT_data_member_location: 192
 <2><73b74>: Abbrev Number: 2 (DW_TAG_member)
    <73b75>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <73b79>   DW_AT_decl_file   : 7
    <73b7a>   DW_AT_decl_line   : 98
    <73b7b>   DW_AT_decl_column : 8
    <73b7c>   DW_AT_type        : <0x73bce>
    <73b80>   DW_AT_data_member_location: 196
 <2><73b81>: Abbrev Number: 0
 <1><73b82>: Abbrev Number: 12 (DW_TAG_typedef)
    <73b83>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <73b87>   DW_AT_decl_file   : 8
    <73b88>   DW_AT_decl_line   : 7
    <73b89>   DW_AT_decl_column : 25
    <73b8a>   DW_AT_type        : <0x739fb>
 <1><73b8e>: Abbrev Number: 61 (DW_TAG_typedef)
    <73b8f>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <73b93>   DW_AT_decl_file   : 7
    <73b94>   DW_AT_decl_line   : 43
    <73b95>   DW_AT_decl_column : 14
 <1><73b96>: Abbrev Number: 36 (DW_TAG_structure_type)
    <73b97>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <73b9b>   DW_AT_declaration : 1
 <1><73b9b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73b9c>   DW_AT_byte_size   : 8
    <73b9c>   DW_AT_type        : <0x73b96>
 <1><73ba0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73ba1>   DW_AT_byte_size   : 8
    <73ba1>   DW_AT_type        : <0x739fb>
 <1><73ba5>: Abbrev Number: 20 (DW_TAG_array_type)
    <73ba6>   DW_AT_type        : <0x7396e>
    <73baa>   DW_AT_sibling     : <0x73bb5>
 <2><73bae>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <73baf>   DW_AT_type        : <0x738ed>
    <73bb3>   DW_AT_upper_bound : 0
 <2><73bb4>: Abbrev Number: 0
 <1><73bb5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73bb6>   DW_AT_byte_size   : 8
    <73bb6>   DW_AT_type        : <0x73b8e>
 <1><73bba>: Abbrev Number: 36 (DW_TAG_structure_type)
    <73bbb>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <73bbf>   DW_AT_declaration : 1
 <1><73bbf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73bc0>   DW_AT_byte_size   : 8
    <73bc0>   DW_AT_type        : <0x73bba>
 <1><73bc4>: Abbrev Number: 36 (DW_TAG_structure_type)
    <73bc5>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <73bc9>   DW_AT_declaration : 1
 <1><73bc9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73bca>   DW_AT_byte_size   : 8
    <73bca>   DW_AT_type        : <0x73bc4>
 <1><73bce>: Abbrev Number: 20 (DW_TAG_array_type)
    <73bcf>   DW_AT_type        : <0x7396e>
    <73bd3>   DW_AT_sibling     : <0x73bde>
 <2><73bd7>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <73bd8>   DW_AT_type        : <0x738ed>
    <73bdc>   DW_AT_upper_bound : 19
 <2><73bdd>: Abbrev Number: 0
 <1><73bde>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73bdf>   DW_AT_byte_size   : 8
    <73bdf>   DW_AT_type        : <0x73b82>
 <1><73be3>: Abbrev Number: 41 (DW_TAG_restrict_type)
    <73be4>   DW_AT_type        : <0x73bde>
 <1><73be8>: Abbrev Number: 62 (DW_TAG_enumeration_type)
    <73be9>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <73bed>   DW_AT_encoding    : 7	(unsigned)
    <73bee>   DW_AT_byte_size   : 4
    <73bef>   DW_AT_type        : <0x738e6>
    <73bf3>   DW_AT_decl_file   : 17
    <73bf4>   DW_AT_decl_line   : 1
    <73bf5>   DW_AT_decl_column : 14
    <73bf6>   DW_AT_sibling     : <0x73c6d>
 <2><73bfa>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73bfb>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <73bff>   DW_AT_const_value : 0
 <2><73c00>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c01>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <73c05>   DW_AT_const_value : 1
 <2><73c06>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c07>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <73c0b>   DW_AT_const_value : 2
 <2><73c0c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c0d>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <73c11>   DW_AT_const_value : 3
 <2><73c12>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c13>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <73c17>   DW_AT_const_value : 4
 <2><73c18>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c19>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <73c1d>   DW_AT_const_value : 5
 <2><73c1e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c1f>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <73c23>   DW_AT_const_value : 6
 <2><73c24>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c25>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <73c29>   DW_AT_const_value : 7
 <2><73c2a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c2b>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <73c2f>   DW_AT_const_value : 8
 <2><73c30>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c31>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <73c35>   DW_AT_const_value : 9
 <2><73c36>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c37>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <73c3b>   DW_AT_const_value : 10
 <2><73c3c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c3d>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <73c41>   DW_AT_const_value : 11
 <2><73c42>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c43>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <73c47>   DW_AT_const_value : 12
 <2><73c48>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c49>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <73c4d>   DW_AT_const_value : 13
 <2><73c4e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c4f>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <73c53>   DW_AT_const_value : 14
 <2><73c54>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c55>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <73c59>   DW_AT_const_value : 15
 <2><73c5a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c5b>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <73c5f>   DW_AT_const_value : 16
 <2><73c60>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c61>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <73c65>   DW_AT_const_value : 17
 <2><73c66>: Abbrev Number: 14 (DW_TAG_enumerator)
    <73c67>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <73c6b>   DW_AT_const_value : 18
 <2><73c6c>: Abbrev Number: 0
 <1><73c6d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73c6e>   DW_AT_byte_size   : 8
    <73c6e>   DW_AT_type        : <0x73c72>
 <1><73c72>: Abbrev Number: 63 (DW_TAG_subroutine_type)
    <73c73>   DW_AT_prototyped  : 1
 <1><73c73>: Abbrev Number: 20 (DW_TAG_array_type)
    <73c74>   DW_AT_type        : <0x7396e>
    <73c78>   DW_AT_sibling     : <0x73c84>
 <2><73c7c>: Abbrev Number: 64 (DW_TAG_subrange_type)
    <73c7d>   DW_AT_type        : <0x738ed>
    <73c81>   DW_AT_upper_bound : 1023
 <2><73c83>: Abbrev Number: 0
 <1><73c84>: Abbrev Number: 26 (DW_TAG_structure_type)
    <73c85>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <73c89>   DW_AT_byte_size   : 24
    <73c8a>   DW_AT_decl_file   : 9
    <73c8b>   DW_AT_decl_line   : 82
    <73c8c>   DW_AT_decl_column : 16
    <73c8d>   DW_AT_sibling     : <0x73cb9>
 <2><73c91>: Abbrev Number: 2 (DW_TAG_member)
    <73c92>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <73c96>   DW_AT_decl_file   : 9
    <73c97>   DW_AT_decl_line   : 83
    <73c98>   DW_AT_decl_column : 21
    <73c99>   DW_AT_type        : <0x73969>
    <73c9d>   DW_AT_data_member_location: 0
 <2><73c9e>: Abbrev Number: 18 (DW_TAG_member)
    <73c9f>   DW_AT_name        : len
    <73ca3>   DW_AT_decl_file   : 9
    <73ca4>   DW_AT_decl_line   : 84
    <73ca5>   DW_AT_decl_column : 21
    <73ca6>   DW_AT_type        : <0x739c3>
    <73caa>   DW_AT_data_member_location: 8
 <2><73cab>: Abbrev Number: 2 (DW_TAG_member)
    <73cac>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <73cb0>   DW_AT_decl_file   : 9
    <73cb1>   DW_AT_decl_line   : 85
    <73cb2>   DW_AT_decl_column : 21
    <73cb3>   DW_AT_type        : <0x739c3>
    <73cb7>   DW_AT_data_member_location: 16
 <2><73cb8>: Abbrev Number: 0
 <1><73cb9>: Abbrev Number: 12 (DW_TAG_typedef)
    <73cba>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <73cbe>   DW_AT_decl_file   : 9
    <73cbf>   DW_AT_decl_line   : 86
    <73cc0>   DW_AT_decl_column : 3
    <73cc1>   DW_AT_type        : <0x73c84>
 <1><73cc5>: Abbrev Number: 19 (DW_TAG_base_type)
    <73cc6>   DW_AT_byte_size   : 8
    <73cc7>   DW_AT_encoding    : 4	(float)
    <73cc8>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><73ccc>: Abbrev Number: 19 (DW_TAG_base_type)
    <73ccd>   DW_AT_byte_size   : 4
    <73cce>   DW_AT_encoding    : 4	(float)
    <73ccf>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><73cd3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73cd4>   DW_AT_byte_size   : 8
    <73cd4>   DW_AT_type        : <0x73992>
 <1><73cd8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73cd9>   DW_AT_byte_size   : 8
    <73cd9>   DW_AT_type        : <0x73cb9>
 <1><73cdd>: Abbrev Number: 12 (DW_TAG_typedef)
    <73cde>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <73ce2>   DW_AT_decl_file   : 10
    <73ce3>   DW_AT_decl_line   : 7
    <73ce4>   DW_AT_decl_column : 25
    <73ce5>   DW_AT_type        : <0x73ce9>
 <1><73ce9>: Abbrev Number: 36 (DW_TAG_structure_type)
    <73cea>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <73cee>   DW_AT_declaration : 1
 <1><73cee>: Abbrev Number: 37 (DW_TAG_structure_type)
    <73cef>   DW_AT_byte_size   : 8
    <73cf0>   DW_AT_decl_file   : 11
    <73cf1>   DW_AT_decl_line   : 4
    <73cf2>   DW_AT_decl_column : 3
    <73cf2>   DW_AT_sibling     : <0x73d11>
 <2><73cf6>: Abbrev Number: 2 (DW_TAG_member)
    <73cf7>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <73cfb>   DW_AT_decl_file   : 11
    <73cfc>   DW_AT_decl_line   : 5
    <73cfd>   DW_AT_decl_column : 8
    <73cfe>   DW_AT_type        : <0x7391a>
    <73d02>   DW_AT_data_member_location: 0
 <2><73d03>: Abbrev Number: 2 (DW_TAG_member)
    <73d04>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <73d08>   DW_AT_decl_file   : 11
    <73d09>   DW_AT_decl_line   : 6
    <73d0a>   DW_AT_decl_column : 8
    <73d0b>   DW_AT_type        : <0x7391a>
    <73d0f>   DW_AT_data_member_location: 4
 <2><73d10>: Abbrev Number: 0
 <1><73d11>: Abbrev Number: 37 (DW_TAG_structure_type)
    <73d12>   DW_AT_byte_size   : 16
    <73d13>   DW_AT_decl_file   : 11
    <73d14>   DW_AT_decl_line   : 8
    <73d15>   DW_AT_decl_column : 3
    <73d15>   DW_AT_sibling     : <0x73d48>
 <2><73d19>: Abbrev Number: 18 (DW_TAG_member)
    <73d1a>   DW_AT_name        : x
    <73d1c>   DW_AT_decl_file   : 11
    <73d1d>   DW_AT_decl_line   : 9
    <73d1e>   DW_AT_decl_column : 8
    <73d1f>   DW_AT_type        : <0x7391a>
    <73d23>   DW_AT_data_member_location: 0
 <2><73d24>: Abbrev Number: 18 (DW_TAG_member)
    <73d25>   DW_AT_name        : y
    <73d27>   DW_AT_decl_file   : 11
    <73d28>   DW_AT_decl_line   : 9
    <73d29>   DW_AT_decl_column : 11
    <73d2a>   DW_AT_type        : <0x7391a>
    <73d2e>   DW_AT_data_member_location: 4
 <2><73d2f>: Abbrev Number: 18 (DW_TAG_member)
    <73d30>   DW_AT_name        : dx
    <73d33>   DW_AT_decl_file   : 11
    <73d34>   DW_AT_decl_line   : 10
    <73d35>   DW_AT_decl_column : 8
    <73d36>   DW_AT_type        : <0x7391a>
    <73d3a>   DW_AT_data_member_location: 8
 <2><73d3b>: Abbrev Number: 18 (DW_TAG_member)
    <73d3c>   DW_AT_name        : dy
    <73d3f>   DW_AT_decl_file   : 11
    <73d40>   DW_AT_decl_line   : 10
    <73d41>   DW_AT_decl_column : 12
    <73d42>   DW_AT_type        : <0x7391a>
    <73d46>   DW_AT_data_member_location: 12
 <2><73d47>: Abbrev Number: 0
 <1><73d48>: Abbrev Number: 42 (DW_TAG_union_type)
    <73d49>   DW_AT_byte_size   : 16
    <73d49>   DW_AT_decl_file   : 11
    <73d4a>   DW_AT_decl_line   : 3
    <73d4b>   DW_AT_decl_column : 2
    <73d4b>   DW_AT_sibling     : <0x73d75>
 <2><73d4f>: Abbrev Number: 38 (DW_TAG_member)
    <73d50>   DW_AT_type        : <0x73cee>
 <2><73d54>: Abbrev Number: 38 (DW_TAG_member)
    <73d55>   DW_AT_type        : <0x73d11>
 <2><73d59>: Abbrev Number: 43 (DW_TAG_member)
    <73d5a>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <73d5e>   DW_AT_decl_file   : 11
    <73d5f>   DW_AT_decl_line   : 12
    <73d60>   DW_AT_decl_column : 7
    <73d60>   DW_AT_type        : <0x7391a>
 <2><73d64>: Abbrev Number: 52 (DW_TAG_member)
    <73d65>   DW_AT_name        : z
    <73d67>   DW_AT_decl_file   : 11
    <73d67>   DW_AT_decl_line   : 13
    <73d68>   DW_AT_decl_column : 7
    <73d68>   DW_AT_type        : <0x7391a>
 <2><73d6c>: Abbrev Number: 52 (DW_TAG_member)
    <73d6d>   DW_AT_name        : w
    <73d6f>   DW_AT_decl_file   : 11
    <73d6f>   DW_AT_decl_line   : 14
    <73d70>   DW_AT_decl_column : 7
    <73d70>   DW_AT_type        : <0x7391a>
 <2><73d74>: Abbrev Number: 0
 <1><73d75>: Abbrev Number: 26 (DW_TAG_structure_type)
    <73d76>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <73d7a>   DW_AT_byte_size   : 20
    <73d7b>   DW_AT_decl_file   : 11
    <73d7c>   DW_AT_decl_line   : 1
    <73d7d>   DW_AT_decl_column : 8
    <73d7e>   DW_AT_sibling     : <0x73d96>
 <2><73d82>: Abbrev Number: 2 (DW_TAG_member)
    <73d83>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <73d87>   DW_AT_decl_file   : 11
    <73d88>   DW_AT_decl_line   : 2
    <73d89>   DW_AT_decl_column : 6
    <73d8a>   DW_AT_type        : <0x7391a>
    <73d8e>   DW_AT_data_member_location: 0
 <2><73d8f>: Abbrev Number: 39 (DW_TAG_member)
    <73d90>   DW_AT_type        : <0x73d48>
    <73d94>   DW_AT_data_member_location: 4
 <2><73d95>: Abbrev Number: 0
 <1><73d96>: Abbrev Number: 12 (DW_TAG_typedef)
    <73d97>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <73d9b>   DW_AT_decl_file   : 11
    <73d9c>   DW_AT_decl_line   : 18
    <73d9d>   DW_AT_decl_column : 23
    <73d9e>   DW_AT_type        : <0x73d75>
 <1><73da2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73da3>   DW_AT_byte_size   : 8
    <73da3>   DW_AT_type        : <0x73da7>
 <1><73da7>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <73da8>   DW_AT_prototyped  : 1
    <73da8>   DW_AT_type        : <0x7391a>
    <73dac>   DW_AT_sibling     : <0x73dbb>
 <2><73db0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73db1>   DW_AT_type        : <0x7391a>
 <2><73db5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73db6>   DW_AT_type        : <0x7391a>
 <2><73dba>: Abbrev Number: 0
 <1><73dbb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73dbc>   DW_AT_byte_size   : 8
    <73dbc>   DW_AT_type        : <0x7391a>
 <1><73dc0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73dc1>   DW_AT_byte_size   : 8
    <73dc1>   DW_AT_type        : <0x73dc5>
 <1><73dc5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <73dc6>   DW_AT_prototyped  : 1
    <73dc6>   DW_AT_type        : <0x7391a>
    <73dca>   DW_AT_sibling     : <0x73de8>
 <2><73dce>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73dcf>   DW_AT_type        : <0x73dbb>
 <2><73dd3>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73dd4>   DW_AT_type        : <0x73dbb>
 <2><73dd8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73dd9>   DW_AT_type        : <0x73dbb>
 <2><73ddd>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73dde>   DW_AT_type        : <0x73dbb>
 <2><73de2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73de3>   DW_AT_type        : <0x73dbb>
 <2><73de7>: Abbrev Number: 0
 <1><73de8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73de9>   DW_AT_byte_size   : 8
    <73de9>   DW_AT_type        : <0x73d96>
 <1><73ded>: Abbrev Number: 12 (DW_TAG_typedef)
    <73dee>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <73df2>   DW_AT_decl_file   : 12
    <73df3>   DW_AT_decl_line   : 13
    <73df4>   DW_AT_decl_column : 30
    <73df5>   DW_AT_type        : <0x73df9>
 <1><73df9>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <73dfa>   DW_AT_prototyped  : 1
    <73dfa>   DW_AT_type        : <0x738e6>
    <73dfe>   DW_AT_sibling     : <0x73e12>
 <2><73e02>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e03>   DW_AT_type        : <0x738e6>
 <2><73e07>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e08>   DW_AT_type        : <0x738e6>
 <2><73e0c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e0d>   DW_AT_type        : <0x73956>
 <2><73e11>: Abbrev Number: 0
 <1><73e12>: Abbrev Number: 12 (DW_TAG_typedef)
    <73e13>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <73e17>   DW_AT_decl_file   : 12
    <73e18>   DW_AT_decl_line   : 14
    <73e19>   DW_AT_decl_column : 15
    <73e1a>   DW_AT_type        : <0x73e1e>
 <1><73e1e>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <73e1f>   DW_AT_prototyped  : 1
    <73e1f>   DW_AT_sibling     : <0x73e51>
 <2><73e23>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e24>   DW_AT_type        : <0x73e51>
 <2><73e28>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e29>   DW_AT_type        : <0x73e51>
 <2><73e2d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e2e>   DW_AT_type        : <0x7391a>
 <2><73e32>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e33>   DW_AT_type        : <0x7391a>
 <2><73e37>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e38>   DW_AT_type        : <0x7391a>
 <2><73e3c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e3d>   DW_AT_type        : <0x7391a>
 <2><73e41>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e42>   DW_AT_type        : <0x7391a>
 <2><73e46>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e47>   DW_AT_type        : <0x73e56>
 <2><73e4b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73e4c>   DW_AT_type        : <0x73956>
 <2><73e50>: Abbrev Number: 0
 <1><73e51>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73e52>   DW_AT_byte_size   : 8
    <73e52>   DW_AT_type        : <0x738d3>
 <1><73e56>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <73e57>   DW_AT_byte_size   : 8
    <73e57>   DW_AT_type        : <0x73ded>
 <1><73e5b>: Abbrev Number: 37 (DW_TAG_structure_type)
    <73e5c>   DW_AT_byte_size   : 16
    <73e5d>   DW_AT_decl_file   : 12
    <73e5e>   DW_AT_decl_line   : 26
    <73e5f>   DW_AT_decl_column : 3
    <73e5f>   DW_AT_sibling     : <0x73e98>
 <2><73e63>: Abbrev Number: 2 (DW_TAG_member)
    <73e64>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <73e68>   DW_AT_decl_file   : 12
    <73e69>   DW_AT_decl_line   : 27
    <73e6a>   DW_AT_decl_column : 8
    <73e6b>   DW_AT_type        : <0x7391a>
    <73e6f>   DW_AT_data_member_location: 0
 <2><73e70>: Abbrev Number: 2 (DW_TAG_member)
    <73e71>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <73e75>   DW_AT_decl_file   : 12
    <73e76>   DW_AT_decl_line   : 27
    <73e77>   DW_AT_decl_column : 16
    <73e78>   DW_AT_type        : <0x7391a>
    <73e7c>   DW_AT_data_member_location: 4
 <2><73e7d>: Abbrev Number: 2 (DW_TAG_member)
    <73e7e>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <73e82>   DW_AT_decl_file   : 12
    <73e83>   DW_AT_decl_line   : 27
    <73e84>   DW_AT_decl_column : 24
    <73e85>   DW_AT_type        : <0x7391a>
    <73e89>   DW_AT_data_member_location: 8
 <2><73e8a>: Abbrev Number: 2 (DW_TAG_member)
    <73e8b>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <73e8f>   DW_AT_decl_file   : 12
    <73e90>   DW_AT_decl_line   : 27
    <73e91>   DW_AT_decl_column : 32
    <73e92>   DW_AT_type        : <0x7391a>
    <73e96>   DW_AT_data_member_location: 12
 <2><73e97>: Abbrev Number: 0
 <1><73e98>: Abbrev Number: 42 (DW_TAG_union_type)
    <73e99>   DW_AT_byte_size   : 16
    <73e99>   DW_AT_decl_file   : 12
    <73e9a>   DW_AT_decl_line   : 25
    <73e9b>   DW_AT_decl_column : 2
    <73e9b>   DW_AT_sibling     : <0x73eb0>
 <2><73e9f>: Abbrev Number: 38 (DW_TAG_member)
    <73ea0>   DW_AT_type        : <0x73e5b>
 <2><73ea4>: Abbrev Number: 43 (DW_TAG_member)
    <73ea5>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <73ea9>   DW_AT_decl_file   : 12
    <73eaa>   DW_AT_decl_line   : 29
    <73eab>   DW_AT_decl_column : 7
    <73eab>   DW_AT_type        : <0x73eb0>
 <2><73eaf>: Abbrev Number: 0
 <1><73eb0>: Abbrev Number: 20 (DW_TAG_array_type)
    <73eb1>   DW_AT_type        : <0x7391a>
    <73eb5>   DW_AT_sibling     : <0x73ec0>
 <2><73eb9>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <73eba>   DW_AT_type        : <0x738ed>
    <73ebe>   DW_AT_upper_bound : 3
 <2><73ebf>: Abbrev Number: 0
 <1><73ec0>: Abbrev Number: 37 (DW_TAG_structure_type)
    <73ec1>   DW_AT_byte_size   : 16
    <73ec2>   DW_AT_decl_file   : 12
    <73ec3>   DW_AT_decl_line   : 32
    <73ec4>   DW_AT_decl_column : 3
    <73ec4>   DW_AT_sibling     : <0x73efd>
 <2><73ec8>: Abbrev Number: 2 (DW_TAG_member)
    <73ec9>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <73ecd>   DW_AT_decl_file   : 12
    <73ece>   DW_AT_decl_line   : 33
    <73ecf>   DW_AT_decl_column : 8
    <73ed0>   DW_AT_type        : <0x7391a>
    <73ed4>   DW_AT_data_member_location: 0
 <2><73ed5>: Abbrev Number: 2 (DW_TAG_member)
    <73ed6>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <73eda>   DW_AT_decl_file   : 12
    <73edb>   DW_AT_decl_line   : 33
    <73edc>   DW_AT_decl_column : 20
    <73edd>   DW_AT_type        : <0x7391a>
    <73ee1>   DW_AT_data_member_location: 4
 <2><73ee2>: Abbrev Number: 2 (DW_TAG_member)
    <73ee3>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <73ee7>   DW_AT_decl_file   : 12
    <73ee8>   DW_AT_decl_line   : 33
    <73ee9>   DW_AT_decl_column : 32
    <73eea>   DW_AT_type        : <0x7391a>
    <73eee>   DW_AT_data_member_location: 8
 <2><73eef>: Abbrev Number: 2 (DW_TAG_member)
    <73ef0>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <73ef4>   DW_AT_decl_file   : 12
    <73ef5>   DW_AT_decl_line   : 33
    <73ef6>   DW_AT_decl_column : 44
    <73ef7>   DW_AT_type        : <0x7391a>
    <73efb>   DW_AT_data_member_location: 12
 <2><73efc>: Abbrev Number: 0
 <1><73efd>: Abbrev Number: 42 (DW_TAG_union_type)
    <73efe>   DW_AT_byte_size   : 16
    <73efe>   DW_AT_decl_file   : 12
    <73eff>   DW_AT_decl_line   : 31
    <73f00>   DW_AT_decl_column : 2
    <73f00>   DW_AT_sibling     : <0x73f15>
 <2><73f04>: Abbrev Number: 38 (DW_TAG_member)
    <73f05>   DW_AT_type        : <0x73ec0>
 <2><73f09>: Abbrev Number: 43 (DW_TAG_member)
    <73f0a>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <73f0e>   DW_AT_decl_file   : 12
    <73f0f>   DW_AT_decl_line   : 35
    <73f10>   DW_AT_decl_column : 7
    <73f10>   DW_AT_type        : <0x73eb0>
 <2><73f14>: Abbrev Number: 0
 <1><73f15>: Abbrev Number: 26 (DW_TAG_structure_type)
    <73f16>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <73f1a>   DW_AT_byte_size   : 216
    <73f1b>   DW_AT_decl_file   : 12
    <73f1c>   DW_AT_decl_line   : 16
    <73f1d>   DW_AT_decl_column : 16
    <73f1e>   DW_AT_sibling     : <0x74032>
 <2><73f22>: Abbrev Number: 18 (DW_TAG_member)
    <73f23>   DW_AT_name        : id
    <73f26>   DW_AT_decl_file   : 12
    <73f27>   DW_AT_decl_line   : 17
    <73f28>   DW_AT_decl_column : 6
    <73f29>   DW_AT_type        : <0x7391a>
    <73f2d>   DW_AT_data_member_location: 0
 <2><73f2e>: Abbrev Number: 2 (DW_TAG_member)
    <73f2f>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <73f33>   DW_AT_decl_file   : 12
    <73f34>   DW_AT_decl_line   : 18
    <73f35>   DW_AT_decl_column : 6
    <73f36>   DW_AT_type        : <0x7391a>
    <73f3a>   DW_AT_data_member_location: 4
 <2><73f3b>: Abbrev Number: 2 (DW_TAG_member)
    <73f3c>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <73f40>   DW_AT_decl_file   : 12
    <73f41>   DW_AT_decl_line   : 19
    <73f42>   DW_AT_decl_column : 18
    <73f43>   DW_AT_type        : <0x74032>
    <73f47>   DW_AT_data_member_location: 8
 <2><73f48>: Abbrev Number: 2 (DW_TAG_member)
    <73f49>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <73f4d>   DW_AT_decl_file   : 12
    <73f4e>   DW_AT_decl_line   : 20
    <73f4f>   DW_AT_decl_column : 6
    <73f50>   DW_AT_type        : <0x7391a>
    <73f54>   DW_AT_data_member_location: 16
 <2><73f55>: Abbrev Number: 2 (DW_TAG_member)
    <73f56>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <73f5a>   DW_AT_decl_file   : 12
    <73f5b>   DW_AT_decl_line   : 21
    <73f5c>   DW_AT_decl_column : 6
    <73f5d>   DW_AT_type        : <0x7391a>
    <73f61>   DW_AT_data_member_location: 20
 <2><73f62>: Abbrev Number: 2 (DW_TAG_member)
    <73f63>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <73f67>   DW_AT_decl_file   : 12
    <73f68>   DW_AT_decl_line   : 22
    <73f69>   DW_AT_decl_column : 6
    <73f6a>   DW_AT_type        : <0x7391a>
    <73f6e>   DW_AT_data_member_location: 24
 <2><73f6f>: Abbrev Number: 2 (DW_TAG_member)
    <73f70>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <73f74>   DW_AT_decl_file   : 12
    <73f75>   DW_AT_decl_line   : 23
    <73f76>   DW_AT_decl_column : 8
    <73f77>   DW_AT_type        : <0x73956>
    <73f7b>   DW_AT_data_member_location: 32
 <2><73f7c>: Abbrev Number: 2 (DW_TAG_member)
    <73f7d>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <73f81>   DW_AT_decl_file   : 12
    <73f82>   DW_AT_decl_line   : 24
    <73f83>   DW_AT_decl_column : 8
    <73f84>   DW_AT_type        : <0x73ccc>
    <73f88>   DW_AT_data_member_location: 40
 <2><73f89>: Abbrev Number: 2 (DW_TAG_member)
    <73f8a>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <73f8e>   DW_AT_decl_file   : 12
    <73f8f>   DW_AT_decl_line   : 24
    <73f90>   DW_AT_decl_column : 16
    <73f91>   DW_AT_type        : <0x73ccc>
    <73f95>   DW_AT_data_member_location: 44
 <2><73f96>: Abbrev Number: 39 (DW_TAG_member)
    <73f97>   DW_AT_type        : <0x73e98>
    <73f9b>   DW_AT_data_member_location: 48
 <2><73f9c>: Abbrev Number: 39 (DW_TAG_member)
    <73f9d>   DW_AT_type        : <0x73efd>
    <73fa1>   DW_AT_data_member_location: 64
 <2><73fa2>: Abbrev Number: 2 (DW_TAG_member)
    <73fa3>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <73fa7>   DW_AT_decl_file   : 12
    <73fa8>   DW_AT_decl_line   : 37
    <73fa9>   DW_AT_decl_column : 8
    <73faa>   DW_AT_type        : <0x73ccc>
    <73fae>   DW_AT_data_member_location: 80
 <2><73faf>: Abbrev Number: 2 (DW_TAG_member)
    <73fb0>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <73fb4>   DW_AT_decl_file   : 12
    <73fb5>   DW_AT_decl_line   : 37
    <73fb6>   DW_AT_decl_column : 15
    <73fb7>   DW_AT_type        : <0x73ccc>
    <73fbb>   DW_AT_data_member_location: 84
 <2><73fbc>: Abbrev Number: 2 (DW_TAG_member)
    <73fbd>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <73fc1>   DW_AT_decl_file   : 12
    <73fc2>   DW_AT_decl_line   : 37
    <73fc3>   DW_AT_decl_column : 22
    <73fc4>   DW_AT_type        : <0x73ccc>
    <73fc8>   DW_AT_data_member_location: 88
 <2><73fc9>: Abbrev Number: 2 (DW_TAG_member)
    <73fca>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <73fce>   DW_AT_decl_file   : 12
    <73fcf>   DW_AT_decl_line   : 37
    <73fd0>   DW_AT_decl_column : 29
    <73fd1>   DW_AT_type        : <0x73ccc>
    <73fd5>   DW_AT_data_member_location: 92
 <2><73fd6>: Abbrev Number: 2 (DW_TAG_member)
    <73fd7>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <73fdb>   DW_AT_decl_file   : 12
    <73fdc>   DW_AT_decl_line   : 38
    <73fdd>   DW_AT_decl_column : 15
    <73fde>   DW_AT_type        : <0x738e6>
    <73fe2>   DW_AT_data_member_location: 96
 <2><73fe3>: Abbrev Number: 2 (DW_TAG_member)
    <73fe4>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <73fe8>   DW_AT_decl_file   : 12
    <73fe9>   DW_AT_decl_line   : 38
    <73fea>   DW_AT_decl_column : 25
    <73feb>   DW_AT_type        : <0x738e6>
    <73fef>   DW_AT_data_member_location: 100
 <2><73ff0>: Abbrev Number: 2 (DW_TAG_member)
    <73ff1>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <73ff5>   DW_AT_decl_file   : 12
    <73ff6>   DW_AT_decl_line   : 39
    <73ff7>   DW_AT_decl_column : 9
    <73ff8>   DW_AT_type        : <0x74056>
    <73ffc>   DW_AT_data_member_location: 104
 <2><73ffd>: Abbrev Number: 2 (DW_TAG_member)
    <73ffe>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <74002>   DW_AT_decl_file   : 12
    <74003>   DW_AT_decl_line   : 40
    <74004>   DW_AT_decl_column : 17
    <74005>   DW_AT_type        : <0x74074>
    <74009>   DW_AT_data_member_location: 112
 <2><7400a>: Abbrev Number: 2 (DW_TAG_member)
    <7400b>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <7400f>   DW_AT_decl_file   : 12
    <74010>   DW_AT_decl_line   : 41
    <74011>   DW_AT_decl_column : 10
    <74012>   DW_AT_type        : <0x74092>
    <74016>   DW_AT_data_member_location: 120
 <2><74017>: Abbrev Number: 2 (DW_TAG_member)
    <74018>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <7401c>   DW_AT_decl_file   : 12
    <7401d>   DW_AT_decl_line   : 42
    <7401e>   DW_AT_decl_column : 11
    <7401f>   DW_AT_type        : <0x74097>
    <74023>   DW_AT_data_member_location: 128
 <2><74024>: Abbrev Number: 2 (DW_TAG_member)
    <74025>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <74029>   DW_AT_decl_file   : 12
    <7402a>   DW_AT_decl_line   : 43
    <7402b>   DW_AT_decl_column : 6
    <7402c>   DW_AT_type        : <0x7391a>
    <74030>   DW_AT_data_member_location: 208
 <2><74031>: Abbrev Number: 0
 <1><74032>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74033>   DW_AT_byte_size   : 8
    <74033>   DW_AT_type        : <0x73e51>
 <1><74037>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <74038>   DW_AT_prototyped  : 1
    <74038>   DW_AT_sibling     : <0x74051>
 <2><7403c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7403d>   DW_AT_type        : <0x74051>
 <2><74041>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74042>   DW_AT_type        : <0x7391a>
 <2><74046>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74047>   DW_AT_type        : <0x7391a>
 <2><7404b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7404c>   DW_AT_type        : <0x738e6>
 <2><74050>: Abbrev Number: 0
 <1><74051>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74052>   DW_AT_byte_size   : 8
    <74052>   DW_AT_type        : <0x73f15>
 <1><74056>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74057>   DW_AT_byte_size   : 8
    <74057>   DW_AT_type        : <0x74037>
 <1><7405b>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7405c>   DW_AT_prototyped  : 1
    <7405c>   DW_AT_type        : <0x738e6>
    <74060>   DW_AT_sibling     : <0x74074>
 <2><74064>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74065>   DW_AT_type        : <0x74051>
 <2><74069>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7406a>   DW_AT_type        : <0x7391a>
 <2><7406e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7406f>   DW_AT_type        : <0x7391a>
 <2><74073>: Abbrev Number: 0
 <1><74074>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74075>   DW_AT_byte_size   : 8
    <74075>   DW_AT_type        : <0x7405b>
 <1><74079>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7407a>   DW_AT_prototyped  : 1
    <7407a>   DW_AT_type        : <0x73956>
    <7407e>   DW_AT_sibling     : <0x74092>
 <2><74082>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74083>   DW_AT_type        : <0x73956>
 <2><74087>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74088>   DW_AT_type        : <0x7391a>
 <2><7408c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7408d>   DW_AT_type        : <0x739a3>
 <2><74091>: Abbrev Number: 0
 <1><74092>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74093>   DW_AT_byte_size   : 8
    <74093>   DW_AT_type        : <0x74079>
 <1><74097>: Abbrev Number: 20 (DW_TAG_array_type)
    <74098>   DW_AT_type        : <0x740a7>
    <7409c>   DW_AT_sibling     : <0x740a7>
 <2><740a0>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <740a1>   DW_AT_type        : <0x738ed>
    <740a5>   DW_AT_upper_bound : 9
 <2><740a6>: Abbrev Number: 0
 <1><740a7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <740a8>   DW_AT_byte_size   : 8
    <740a8>   DW_AT_type        : <0x740ac>
 <1><740ac>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <740ad>   DW_AT_byte_size   : 8
    <740ad>   DW_AT_type        : <0x73e12>
 <1><740b1>: Abbrev Number: 12 (DW_TAG_typedef)
    <740b2>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <740b6>   DW_AT_decl_file   : 12
    <740b7>   DW_AT_decl_line   : 44
    <740b8>   DW_AT_decl_column : 3
    <740b9>   DW_AT_type        : <0x73f15>
 <1><740bd>: Abbrev Number: 26 (DW_TAG_structure_type)
    <740be>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <740c2>   DW_AT_byte_size   : 12
    <740c3>   DW_AT_decl_file   : 13
    <740c4>   DW_AT_decl_line   : 139
    <740c5>   DW_AT_decl_column : 16
    <740c6>   DW_AT_sibling     : <0x740ef>
 <2><740ca>: Abbrev Number: 18 (DW_TAG_member)
    <740cb>   DW_AT_name        : ch
    <740ce>   DW_AT_decl_file   : 13
    <740cf>   DW_AT_decl_line   : 140
    <740d0>   DW_AT_decl_column : 14
    <740d1>   DW_AT_type        : <0x739af>
    <740d5>   DW_AT_data_member_location: 0
 <2><740d6>: Abbrev Number: 18 (DW_TAG_member)
    <740d7>   DW_AT_name        : fg
    <740da>   DW_AT_decl_file   : 13
    <740db>   DW_AT_decl_line   : 141
    <740dc>   DW_AT_decl_column : 14
    <740dd>   DW_AT_type        : <0x738e6>
    <740e1>   DW_AT_data_member_location: 4
 <2><740e2>: Abbrev Number: 18 (DW_TAG_member)
    <740e3>   DW_AT_name        : bg
    <740e6>   DW_AT_decl_file   : 13
    <740e7>   DW_AT_decl_line   : 141
    <740e8>   DW_AT_decl_column : 18
    <740e9>   DW_AT_type        : <0x738e6>
    <740ed>   DW_AT_data_member_location: 8
 <2><740ee>: Abbrev Number: 0
 <1><740ef>: Abbrev Number: 12 (DW_TAG_typedef)
    <740f0>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <740f4>   DW_AT_decl_file   : 13
    <740f5>   DW_AT_decl_line   : 142
    <740f6>   DW_AT_decl_column : 3
    <740f7>   DW_AT_type        : <0x740bd>
 <1><740fb>: Abbrev Number: 26 (DW_TAG_structure_type)
    <740fc>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <74100>   DW_AT_byte_size   : 208
    <74101>   DW_AT_decl_file   : 13
    <74102>   DW_AT_decl_line   : 144
    <74103>   DW_AT_decl_column : 16
    <74104>   DW_AT_sibling     : <0x742be>
 <2><74108>: Abbrev Number: 18 (DW_TAG_member)
    <74109>   DW_AT_name        : id
    <7410c>   DW_AT_decl_file   : 13
    <7410d>   DW_AT_decl_line   : 146
    <7410e>   DW_AT_decl_column : 6
    <7410f>   DW_AT_type        : <0x7391a>
    <74113>   DW_AT_data_member_location: 0
 <2><74114>: Abbrev Number: 2 (DW_TAG_member)
    <74115>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <74119>   DW_AT_decl_file   : 13
    <7411a>   DW_AT_decl_line   : 147
    <7411b>   DW_AT_decl_column : 9
    <7411c>   DW_AT_type        : <0x7391a>
    <74120>   DW_AT_data_member_location: 4
 <2><74121>: Abbrev Number: 2 (DW_TAG_member)
    <74122>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <74126>   DW_AT_decl_file   : 13
    <74127>   DW_AT_decl_line   : 148
    <74128>   DW_AT_decl_column : 21
    <74129>   DW_AT_type        : <0x74032>
    <7412d>   DW_AT_data_member_location: 8
 <2><7412e>: Abbrev Number: 2 (DW_TAG_member)
    <7412f>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <74133>   DW_AT_decl_file   : 13
    <74134>   DW_AT_decl_line   : 149
    <74135>   DW_AT_decl_column : 9
    <74136>   DW_AT_type        : <0x7391a>
    <7413a>   DW_AT_data_member_location: 16
 <2><7413b>: Abbrev Number: 2 (DW_TAG_member)
    <7413c>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <74140>   DW_AT_decl_file   : 13
    <74141>   DW_AT_decl_line   : 150
    <74142>   DW_AT_decl_column : 9
    <74143>   DW_AT_type        : <0x7391a>
    <74147>   DW_AT_data_member_location: 20
 <2><74148>: Abbrev Number: 2 (DW_TAG_member)
    <74149>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <7414d>   DW_AT_decl_file   : 13
    <7414e>   DW_AT_decl_line   : 151
    <7414f>   DW_AT_decl_column : 20
    <74150>   DW_AT_type        : <0x73e51>
    <74154>   DW_AT_data_member_location: 24
 <2><74155>: Abbrev Number: 18 (DW_TAG_member)
    <74156>   DW_AT_name        : w
    <74158>   DW_AT_decl_file   : 13
    <74159>   DW_AT_decl_line   : 152
    <7415a>   DW_AT_decl_column : 9
    <7415b>   DW_AT_type        : <0x7391a>
    <7415f>   DW_AT_data_member_location: 32
 <2><74160>: Abbrev Number: 18 (DW_TAG_member)
    <74161>   DW_AT_name        : h
    <74163>   DW_AT_decl_file   : 13
    <74164>   DW_AT_decl_line   : 152
    <74165>   DW_AT_decl_column : 12
    <74166>   DW_AT_type        : <0x7391a>
    <7416a>   DW_AT_data_member_location: 36
 <2><7416b>: Abbrev Number: 2 (DW_TAG_member)
    <7416c>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <74170>   DW_AT_decl_file   : 13
    <74171>   DW_AT_decl_line   : 153
    <74172>   DW_AT_decl_column : 9
    <74173>   DW_AT_type        : <0x7391a>
    <74177>   DW_AT_data_member_location: 40
 <2><74178>: Abbrev Number: 18 (DW_TAG_member)
    <74179>   DW_AT_name        : bpp
    <7417d>   DW_AT_decl_file   : 13
    <7417e>   DW_AT_decl_line   : 154
    <7417f>   DW_AT_decl_column : 9
    <74180>   DW_AT_type        : <0x7391a>
    <74184>   DW_AT_data_member_location: 44
 <2><74185>: Abbrev Number: 2 (DW_TAG_member)
    <74186>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7418a>   DW_AT_decl_file   : 13
    <7418b>   DW_AT_decl_line   : 155
    <7418c>   DW_AT_decl_column : 9
    <7418d>   DW_AT_type        : <0x7391a>
    <74191>   DW_AT_data_member_location: 48
 <2><74192>: Abbrev Number: 2 (DW_TAG_member)
    <74193>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <74197>   DW_AT_decl_file   : 13
    <74198>   DW_AT_decl_line   : 156
    <74199>   DW_AT_decl_column : 19
    <7419a>   DW_AT_type        : <0x742be>
    <7419e>   DW_AT_data_member_location: 56
 <2><7419f>: Abbrev Number: 2 (DW_TAG_member)
    <741a0>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <741a4>   DW_AT_decl_file   : 13
    <741a5>   DW_AT_decl_line   : 157
    <741a6>   DW_AT_decl_column : 19
    <741a7>   DW_AT_type        : <0x742be>
    <741ab>   DW_AT_data_member_location: 64
 <2><741ac>: Abbrev Number: 2 (DW_TAG_member)
    <741ad>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <741b1>   DW_AT_decl_file   : 13
    <741b2>   DW_AT_decl_line   : 158
    <741b3>   DW_AT_decl_column : 20
    <741b4>   DW_AT_type        : <0x73e51>
    <741b8>   DW_AT_data_member_location: 72
 <2><741b9>: Abbrev Number: 2 (DW_TAG_member)
    <741ba>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <741be>   DW_AT_decl_file   : 13
    <741bf>   DW_AT_decl_line   : 159
    <741c0>   DW_AT_decl_column : 11
    <741c1>   DW_AT_type        : <0x73969>
    <741c5>   DW_AT_data_member_location: 80
 <2><741c6>: Abbrev Number: 2 (DW_TAG_member)
    <741c7>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <741cb>   DW_AT_decl_file   : 13
    <741cc>   DW_AT_decl_line   : 160
    <741cd>   DW_AT_decl_column : 29
    <741ce>   DW_AT_type        : <0x7438c>
    <741d2>   DW_AT_data_member_location: 88
 <2><741d3>: Abbrev Number: 2 (DW_TAG_member)
    <741d4>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <741d8>   DW_AT_decl_file   : 13
    <741d9>   DW_AT_decl_line   : 161
    <741da>   DW_AT_decl_column : 9
    <741db>   DW_AT_type        : <0x7391a>
    <741df>   DW_AT_data_member_location: 96
 <2><741e0>: Abbrev Number: 2 (DW_TAG_member)
    <741e1>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <741e5>   DW_AT_decl_file   : 13
    <741e6>   DW_AT_decl_line   : 162
    <741e7>   DW_AT_decl_column : 27
    <741e8>   DW_AT_type        : <0x743be>
    <741ec>   DW_AT_data_member_location: 104
 <2><741ed>: Abbrev Number: 2 (DW_TAG_member)
    <741ee>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <741f2>   DW_AT_decl_file   : 13
    <741f3>   DW_AT_decl_line   : 163
    <741f4>   DW_AT_decl_column : 9
    <741f5>   DW_AT_type        : <0x7391a>
    <741f9>   DW_AT_data_member_location: 112
 <2><741fa>: Abbrev Number: 2 (DW_TAG_member)
    <741fb>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <741ff>   DW_AT_decl_file   : 13
    <74200>   DW_AT_decl_line   : 164
    <74201>   DW_AT_decl_column : 9
    <74202>   DW_AT_type        : <0x7391a>
    <74206>   DW_AT_data_member_location: 116
 <2><74207>: Abbrev Number: 2 (DW_TAG_member)
    <74208>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <7420c>   DW_AT_decl_file   : 13
    <7420d>   DW_AT_decl_line   : 164
    <7420e>   DW_AT_decl_column : 19
    <7420f>   DW_AT_type        : <0x7391a>
    <74213>   DW_AT_data_member_location: 120
 <2><74214>: Abbrev Number: 2 (DW_TAG_member)
    <74215>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <74219>   DW_AT_decl_file   : 13
    <7421a>   DW_AT_decl_line   : 165
    <7421b>   DW_AT_decl_column : 24
    <7421c>   DW_AT_type        : <0x743f9>
    <74220>   DW_AT_data_member_location: 128
 <2><74221>: Abbrev Number: 2 (DW_TAG_member)
    <74222>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <74226>   DW_AT_decl_file   : 13
    <74227>   DW_AT_decl_line   : 166
    <74228>   DW_AT_decl_column : 9
    <74229>   DW_AT_type        : <0x7391a>
    <7422d>   DW_AT_data_member_location: 136
 <2><7422e>: Abbrev Number: 2 (DW_TAG_member)
    <7422f>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <74233>   DW_AT_decl_file   : 13
    <74234>   DW_AT_decl_line   : 166
    <74235>   DW_AT_decl_column : 17
    <74236>   DW_AT_type        : <0x7391a>
    <7423a>   DW_AT_data_member_location: 140
 <2><7423b>: Abbrev Number: 2 (DW_TAG_member)
    <7423c>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <74240>   DW_AT_decl_file   : 13
    <74241>   DW_AT_decl_line   : 167
    <74242>   DW_AT_decl_column : 11
    <74243>   DW_AT_type        : <0x73ccc>
    <74247>   DW_AT_data_member_location: 144
 <2><74248>: Abbrev Number: 18 (DW_TAG_member)
    <74249>   DW_AT_name        : key
    <7424d>   DW_AT_decl_file   : 13
    <7424e>   DW_AT_decl_line   : 168
    <7424f>   DW_AT_decl_column : 11
    <74250>   DW_AT_type        : <0x73969>
    <74254>   DW_AT_data_member_location: 152
 <2><74255>: Abbrev Number: 2 (DW_TAG_member)
    <74256>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <7425a>   DW_AT_decl_file   : 13
    <7425b>   DW_AT_decl_line   : 169
    <7425c>   DW_AT_decl_column : 6
    <7425d>   DW_AT_type        : <0x7391a>
    <74261>   DW_AT_data_member_location: 160
 <2><74262>: Abbrev Number: 2 (DW_TAG_member)
    <74263>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <74267>   DW_AT_decl_file   : 13
    <74268>   DW_AT_decl_line   : 170
    <74269>   DW_AT_decl_column : 18
    <7426a>   DW_AT_type        : <0x743fe>
    <7426e>   DW_AT_data_member_location: 168
 <2><7426f>: Abbrev Number: 2 (DW_TAG_member)
    <74270>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <74274>   DW_AT_decl_file   : 13
    <74275>   DW_AT_decl_line   : 171
    <74276>   DW_AT_decl_column : 12
    <74277>   DW_AT_type        : <0x73de8>
    <7427b>   DW_AT_data_member_location: 176
 <2><7427c>: Abbrev Number: 2 (DW_TAG_member)
    <7427d>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <74281>   DW_AT_decl_file   : 13
    <74282>   DW_AT_decl_line   : 172
    <74283>   DW_AT_decl_column : 9
    <74284>   DW_AT_type        : <0x7391a>
    <74288>   DW_AT_data_member_location: 184
 <2><74289>: Abbrev Number: 2 (DW_TAG_member)
    <7428a>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <7428e>   DW_AT_decl_file   : 13
    <7428f>   DW_AT_decl_line   : 172
    <74290>   DW_AT_decl_column : 21
    <74291>   DW_AT_type        : <0x7391a>
    <74295>   DW_AT_data_member_location: 188
 <2><74296>: Abbrev Number: 2 (DW_TAG_member)
    <74297>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <7429b>   DW_AT_decl_file   : 13
    <7429c>   DW_AT_decl_line   : 173
    <7429d>   DW_AT_decl_column : 11
    <7429e>   DW_AT_type        : <0x74408>
    <742a2>   DW_AT_data_member_location: 192
 <2><742a3>: Abbrev Number: 2 (DW_TAG_member)
    <742a4>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <742a8>   DW_AT_decl_file   : 13
    <742a9>   DW_AT_decl_line   : 174
    <742aa>   DW_AT_decl_column : 15
    <742ab>   DW_AT_type        : <0x73921>
    <742af>   DW_AT_data_member_location: 200
 <2><742b0>: Abbrev Number: 2 (DW_TAG_member)
    <742b1>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <742b5>   DW_AT_decl_file   : 13
    <742b6>   DW_AT_decl_line   : 175
    <742b7>   DW_AT_decl_column : 6
    <742b8>   DW_AT_type        : <0x7391a>
    <742bc>   DW_AT_data_member_location: 204
 <2><742bd>: Abbrev Number: 0
 <1><742be>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <742bf>   DW_AT_byte_size   : 8
    <742bf>   DW_AT_type        : <0x738e6>
 <1><742c3>: Abbrev Number: 26 (DW_TAG_structure_type)
    <742c4>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <742c8>   DW_AT_byte_size   : 112
    <742c9>   DW_AT_decl_file   : 13
    <742ca>   DW_AT_decl_line   : 178
    <742cb>   DW_AT_decl_column : 16
    <742cc>   DW_AT_sibling     : <0x74387>
 <2><742d0>: Abbrev Number: 2 (DW_TAG_member)
    <742d1>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <742d5>   DW_AT_decl_file   : 13
    <742d6>   DW_AT_decl_line   : 188
    <742d7>   DW_AT_decl_column : 8
    <742d8>   DW_AT_type        : <0x73969>
    <742dc>   DW_AT_data_member_location: 0
 <2><742dd>: Abbrev Number: 2 (DW_TAG_member)
    <742de>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <742e2>   DW_AT_decl_file   : 13
    <742e3>   DW_AT_decl_line   : 208
    <742e4>   DW_AT_decl_column : 8
    <742e5>   DW_AT_type        : <0x74441>
    <742e9>   DW_AT_data_member_location: 8
 <2><742ea>: Abbrev Number: 2 (DW_TAG_member)
    <742eb>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <742ef>   DW_AT_decl_file   : 13
    <742f0>   DW_AT_decl_line   : 222
    <742f1>   DW_AT_decl_column : 9
    <742f2>   DW_AT_type        : <0x73c6d>
    <742f6>   DW_AT_data_member_location: 16
 <2><742f7>: Abbrev Number: 2 (DW_TAG_member)
    <742f8>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <742fc>   DW_AT_decl_file   : 13
    <742fd>   DW_AT_decl_line   : 231
    <742fe>   DW_AT_decl_column : 9
    <742ff>   DW_AT_type        : <0x73c6d>
    <74303>   DW_AT_data_member_location: 24
 <2><74304>: Abbrev Number: 2 (DW_TAG_member)
    <74305>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <74309>   DW_AT_decl_file   : 13
    <7430a>   DW_AT_decl_line   : 239
    <7430b>   DW_AT_decl_column : 9
    <7430c>   DW_AT_type        : <0x73c6d>
    <74310>   DW_AT_data_member_location: 32
 <2><74311>: Abbrev Number: 2 (DW_TAG_member)
    <74312>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <74316>   DW_AT_decl_file   : 13
    <74317>   DW_AT_decl_line   : 248
    <74318>   DW_AT_decl_column : 9
    <74319>   DW_AT_type        : <0x74460>
    <7431d>   DW_AT_data_member_location: 40
 <2><7431e>: Abbrev Number: 16 (DW_TAG_member)
    <7431f>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <74323>   DW_AT_decl_file   : 13
    <74323>   DW_AT_decl_line   : 258
    <74325>   DW_AT_decl_column : 9
    <74326>   DW_AT_type        : <0x73c6d>
    <7432a>   DW_AT_data_member_location: 48
 <2><7432b>: Abbrev Number: 16 (DW_TAG_member)
    <7432c>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <74330>   DW_AT_decl_file   : 13
    <74330>   DW_AT_decl_line   : 274
    <74332>   DW_AT_decl_column : 8
    <74333>   DW_AT_type        : <0x73dc0>
    <74337>   DW_AT_data_member_location: 56
 <2><74338>: Abbrev Number: 16 (DW_TAG_member)
    <74339>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <7433d>   DW_AT_decl_file   : 13
    <7433d>   DW_AT_decl_line   : 285
    <7433f>   DW_AT_decl_column : 9
    <74340>   DW_AT_type        : <0x74460>
    <74344>   DW_AT_data_member_location: 64
 <2><74345>: Abbrev Number: 16 (DW_TAG_member)
    <74346>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <7434a>   DW_AT_decl_file   : 13
    <7434a>   DW_AT_decl_line   : 293
    <7434c>   DW_AT_decl_column : 9
    <7434d>   DW_AT_type        : <0x74470>
    <74351>   DW_AT_data_member_location: 72
 <2><74352>: Abbrev Number: 16 (DW_TAG_member)
    <74353>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <74357>   DW_AT_decl_file   : 13
    <74357>   DW_AT_decl_line   : 301
    <74359>   DW_AT_decl_column : 8
    <7435a>   DW_AT_type        : <0x73da2>
    <7435e>   DW_AT_data_member_location: 80
 <2><7435f>: Abbrev Number: 16 (DW_TAG_member)
    <74360>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <74364>   DW_AT_decl_file   : 13
    <74364>   DW_AT_decl_line   : 314
    <74366>   DW_AT_decl_column : 9
    <74367>   DW_AT_type        : <0x74489>
    <7436b>   DW_AT_data_member_location: 88
 <2><7436c>: Abbrev Number: 16 (DW_TAG_member)
    <7436d>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <74371>   DW_AT_decl_file   : 13
    <74371>   DW_AT_decl_line   : 321
    <74373>   DW_AT_decl_column : 9
    <74374>   DW_AT_type        : <0x73c6d>
    <74378>   DW_AT_data_member_location: 96
 <2><74379>: Abbrev Number: 16 (DW_TAG_member)
    <7437a>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <7437e>   DW_AT_decl_file   : 13
    <7437e>   DW_AT_decl_line   : 328
    <74380>   DW_AT_decl_column : 9
    <74381>   DW_AT_type        : <0x73c6d>
    <74385>   DW_AT_data_member_location: 104
 <2><74386>: Abbrev Number: 0
 <1><74387>: Abbrev Number: 24 (DW_TAG_const_type)
    <74388>   DW_AT_type        : <0x742c3>
 <1><7438c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7438d>   DW_AT_byte_size   : 8
    <7438d>   DW_AT_type        : <0x74387>
 <1><74391>: Abbrev Number: 44 (DW_TAG_structure_type)
    <74392>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <74396>   DW_AT_byte_size   : 16
    <74397>   DW_AT_decl_file   : 13
    <74397>   DW_AT_decl_line   : 331
    <74399>   DW_AT_decl_column : 16
    <7439a>   DW_AT_sibling     : <0x743b9>
 <2><7439e>: Abbrev Number: 16 (DW_TAG_member)
    <7439f>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <743a3>   DW_AT_decl_file   : 13
    <743a3>   DW_AT_decl_line   : 333
    <743a5>   DW_AT_decl_column : 12
    <743a6>   DW_AT_type        : <0x73926>
    <743aa>   DW_AT_data_member_location: 0
 <2><743ab>: Abbrev Number: 16 (DW_TAG_member)
    <743ac>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <743b0>   DW_AT_decl_file   : 13
    <743b0>   DW_AT_decl_line   : 334
    <743b2>   DW_AT_decl_column : 23
    <743b3>   DW_AT_type        : <0x7448e>
    <743b7>   DW_AT_data_member_location: 8
 <2><743b8>: Abbrev Number: 0
 <1><743b9>: Abbrev Number: 24 (DW_TAG_const_type)
    <743ba>   DW_AT_type        : <0x74391>
 <1><743be>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <743bf>   DW_AT_byte_size   : 8
    <743bf>   DW_AT_type        : <0x743b9>
 <1><743c3>: Abbrev Number: 44 (DW_TAG_structure_type)
    <743c4>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <743c8>   DW_AT_byte_size   : 16
    <743c9>   DW_AT_decl_file   : 13
    <743c9>   DW_AT_decl_line   : 337
    <743cb>   DW_AT_decl_column : 16
    <743cc>   DW_AT_sibling     : <0x743f4>
 <2><743d0>: Abbrev Number: 40 (DW_TAG_member)
    <743d1>   DW_AT_name        : w
    <743d3>   DW_AT_decl_file   : 13
    <743d3>   DW_AT_decl_line   : 339
    <743d5>   DW_AT_decl_column : 15
    <743d6>   DW_AT_type        : <0x73926>
    <743da>   DW_AT_data_member_location: 0
 <2><743db>: Abbrev Number: 40 (DW_TAG_member)
    <743dc>   DW_AT_name        : h
    <743de>   DW_AT_decl_file   : 13
    <743de>   DW_AT_decl_line   : 340
    <743e0>   DW_AT_decl_column : 15
    <743e1>   DW_AT_type        : <0x73926>
    <743e5>   DW_AT_data_member_location: 4
 <2><743e6>: Abbrev Number: 16 (DW_TAG_member)
    <743e7>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <743eb>   DW_AT_decl_file   : 13
    <743eb>   DW_AT_decl_line   : 341
    <743ed>   DW_AT_decl_column : 23
    <743ee>   DW_AT_type        : <0x7448e>
    <743f2>   DW_AT_data_member_location: 8
 <2><743f3>: Abbrev Number: 0
 <1><743f4>: Abbrev Number: 24 (DW_TAG_const_type)
    <743f5>   DW_AT_type        : <0x743c3>
 <1><743f9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <743fa>   DW_AT_byte_size   : 8
    <743fa>   DW_AT_type        : <0x743f4>
 <1><743fe>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <743ff>   DW_AT_byte_size   : 8
    <743ff>   DW_AT_type        : <0x74403>
 <1><74403>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74404>   DW_AT_byte_size   : 8
    <74404>   DW_AT_type        : <0x740ef>
 <1><74408>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74409>   DW_AT_byte_size   : 8
    <74409>   DW_AT_type        : <0x73cdd>
 <1><7440d>: Abbrev Number: 12 (DW_TAG_typedef)
    <7440e>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <74412>   DW_AT_decl_file   : 13
    <74413>   DW_AT_decl_line   : 176
    <74414>   DW_AT_decl_column : 3
    <74415>   DW_AT_type        : <0x740fb>
 <1><74419>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7441a>   DW_AT_prototyped  : 1
    <7441a>   DW_AT_type        : <0x7391a>
    <7441e>   DW_AT_sibling     : <0x74441>
 <2><74422>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74423>   DW_AT_type        : <0x73969>
 <2><74427>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74428>   DW_AT_type        : <0x7391a>
 <2><7442c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7442d>   DW_AT_type        : <0x7391a>
 <2><74431>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74432>   DW_AT_type        : <0x7391a>
 <2><74436>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74437>   DW_AT_type        : <0x7391a>
 <2><7443b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7443c>   DW_AT_type        : <0x7391a>
 <2><74440>: Abbrev Number: 0
 <1><74441>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74442>   DW_AT_byte_size   : 8
    <74442>   DW_AT_type        : <0x74419>
 <1><74446>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <74447>   DW_AT_prototyped  : 1
    <74447>   DW_AT_sibling     : <0x74460>
 <2><7444b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7444c>   DW_AT_type        : <0x7391a>
 <2><74450>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74451>   DW_AT_type        : <0x7391a>
 <2><74455>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74456>   DW_AT_type        : <0x7391a>
 <2><7445a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7445b>   DW_AT_type        : <0x7391a>
 <2><7445f>: Abbrev Number: 0
 <1><74460>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74461>   DW_AT_byte_size   : 8
    <74461>   DW_AT_type        : <0x74446>
 <1><74465>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <74466>   DW_AT_prototyped  : 1
    <74466>   DW_AT_sibling     : <0x74470>
 <2><7446a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7446b>   DW_AT_type        : <0x73969>
 <2><7446f>: Abbrev Number: 0
 <1><74470>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74471>   DW_AT_byte_size   : 8
    <74471>   DW_AT_type        : <0x74465>
 <1><74475>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <74476>   DW_AT_prototyped  : 1
    <74476>   DW_AT_type        : <0x73dbb>
    <7447a>   DW_AT_sibling     : <0x74489>
 <2><7447e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7447f>   DW_AT_type        : <0x7391a>
 <2><74483>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74484>   DW_AT_type        : <0x73dbb>
 <2><74488>: Abbrev Number: 0
 <1><74489>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7448a>   DW_AT_byte_size   : 8
    <7448a>   DW_AT_type        : <0x74475>
 <1><7448e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7448f>   DW_AT_byte_size   : 8
    <7448f>   DW_AT_type        : <0x738da>
 <1><74493>: Abbrev Number: 65 (DW_TAG_structure_type)
    <74494>   DW_AT_byte_size   : 4
    <74495>   DW_AT_decl_file   : 13
    <74496>   DW_AT_decl_line   : 346
    <74498>   DW_AT_decl_column : 3
    <74499>   DW_AT_sibling     : <0x744c9>
 <2><7449d>: Abbrev Number: 66 (DW_TAG_member)
    <7449e>   DW_AT_name        : bpp
    <744a2>   DW_AT_decl_file   : 13
    <744a3>   DW_AT_decl_line   : 347
    <744a5>   DW_AT_decl_column : 19
    <744a6>   DW_AT_type        : <0x738df>
    <744aa>   DW_AT_bit_size    : 3
    <744ab>   DW_AT_data_bit_offset: 0
 <2><744ac>: Abbrev Number: 67 (DW_TAG_member)
    <744ad>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <744b1>   DW_AT_decl_file   : 13
    <744b2>   DW_AT_decl_line   : 348
    <744b4>   DW_AT_decl_column : 19
    <744b5>   DW_AT_type        : <0x738df>
    <744b9>   DW_AT_bit_size    : 13
    <744ba>   DW_AT_data_bit_offset: 3
 <2><744bb>: Abbrev Number: 16 (DW_TAG_member)
    <744bc>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <744c0>   DW_AT_decl_file   : 13
    <744c0>   DW_AT_decl_line   : 349
    <744c2>   DW_AT_decl_column : 19
    <744c3>   DW_AT_type        : <0x738df>
    <744c7>   DW_AT_data_member_location: 2
 <2><744c8>: Abbrev Number: 0
 <1><744c9>: Abbrev Number: 68 (DW_TAG_union_type)
    <744ca>   DW_AT_byte_size   : 4
    <744cb>   DW_AT_decl_file   : 13
    <744cc>   DW_AT_decl_line   : 345
    <744ce>   DW_AT_decl_column : 2
    <744cf>   DW_AT_sibling     : <0x744ee>
 <2><744d3>: Abbrev Number: 69 (DW_TAG_member)
    <744d4>   DW_AT_name        : old
    <744d8>   DW_AT_decl_file   : 13
    <744d9>   DW_AT_decl_line   : 350
    <744db>   DW_AT_decl_column : 5
    <744dc>   DW_AT_type        : <0x74493>
 <2><744e0>: Abbrev Number: 70 (DW_TAG_member)
    <744e1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <744e5>   DW_AT_decl_file   : 13
    <744e6>   DW_AT_decl_line   : 351
    <744e8>   DW_AT_decl_column : 16
    <744e9>   DW_AT_type        : <0x738e6>
 <2><744ed>: Abbrev Number: 0
 <1><744ee>: Abbrev Number: 44 (DW_TAG_structure_type)
    <744ef>   DW_AT_name        : (indirect string, offset: 0x16c84): _PUT_HEADER
    <744f3>   DW_AT_byte_size   : 32
    <744f4>   DW_AT_decl_file   : 13
    <744f4>   DW_AT_decl_line   : 344
    <744f6>   DW_AT_decl_column : 8
    <744f7>   DW_AT_sibling     : <0x7455d>
 <2><744fb>: Abbrev Number: 39 (DW_TAG_member)
    <744fc>   DW_AT_type        : <0x744c9>
    <74500>   DW_AT_data_member_location: 0
 <2><74501>: Abbrev Number: 40 (DW_TAG_member)
    <74502>   DW_AT_name        : bpp
    <74506>   DW_AT_decl_file   : 13
    <74506>   DW_AT_decl_line   : 353
    <74508>   DW_AT_decl_column : 6
    <74509>   DW_AT_type        : <0x7391a>
    <7450d>   DW_AT_data_member_location: 4
 <2><7450e>: Abbrev Number: 16 (DW_TAG_member)
    <7450f>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <74513>   DW_AT_decl_file   : 13
    <74513>   DW_AT_decl_line   : 354
    <74515>   DW_AT_decl_column : 15
    <74516>   DW_AT_type        : <0x738e6>
    <7451a>   DW_AT_data_member_location: 8
 <2><7451b>: Abbrev Number: 16 (DW_TAG_member)
    <7451c>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <74520>   DW_AT_decl_file   : 13
    <74520>   DW_AT_decl_line   : 355
    <74522>   DW_AT_decl_column : 15
    <74523>   DW_AT_type        : <0x738e6>
    <74527>   DW_AT_data_member_location: 12
 <2><74528>: Abbrev Number: 16 (DW_TAG_member)
    <74529>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7452d>   DW_AT_decl_file   : 13
    <7452d>   DW_AT_decl_line   : 356
    <7452f>   DW_AT_decl_column : 15
    <74530>   DW_AT_type        : <0x738e6>
    <74534>   DW_AT_data_member_location: 16
 <2><74535>: Abbrev Number: 40 (DW_TAG_member)
    <74536>   DW_AT_name        : tex
    <7453a>   DW_AT_decl_file   : 13
    <7453a>   DW_AT_decl_line   : 357
    <7453c>   DW_AT_decl_column : 15
    <7453d>   DW_AT_type        : <0x738e6>
    <74541>   DW_AT_data_member_location: 20
 <2><74542>: Abbrev Number: 16 (DW_TAG_member)
    <74543>   DW_AT_name        : (indirect string, offset: 0x1d25a): _reserved
    <74547>   DW_AT_decl_file   : 13
    <74547>   DW_AT_decl_line   : 358
    <74549>   DW_AT_decl_column : 7
    <7454a>   DW_AT_type        : <0x739d6>
    <7454e>   DW_AT_data_member_location: 24
 <2><7454f>: Abbrev Number: 16 (DW_TAG_member)
    <74550>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <74554>   DW_AT_decl_file   : 13
    <74554>   DW_AT_decl_line   : 359
    <74556>   DW_AT_decl_column : 16
    <74557>   DW_AT_type        : <0x7455d>
    <7455b>   DW_AT_data_member_location: 32
 <2><7455c>: Abbrev Number: 0
 <1><7455d>: Abbrev Number: 20 (DW_TAG_array_type)
    <7455e>   DW_AT_type        : <0x738d3>
    <74562>   DW_AT_sibling     : <0x7456d>
 <2><74566>: Abbrev Number: 71 (DW_TAG_subrange_type)
    <74567>   DW_AT_type        : <0x738ed>
    <7456b>   DW_AT_count       : 0
 <2><7456c>: Abbrev Number: 0
 <1><7456d>: Abbrev Number: 51 (DW_TAG_typedef)
    <7456e>   DW_AT_name        : (indirect string, offset: 0x16c85): PUT_HEADER
    <74572>   DW_AT_decl_file   : 13
    <74573>   DW_AT_decl_line   : 361
    <74575>   DW_AT_decl_column : 28
    <74576>   DW_AT_type        : <0x744ee>
 <1><7457a>: Abbrev Number: 45 (DW_TAG_variable)
    <7457b>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <7457f>   DW_AT_decl_file   : 13
    <7457f>   DW_AT_decl_line   : 364
    <74581>   DW_AT_decl_column : 15
    <74582>   DW_AT_type        : <0x74586>
    <74586>   DW_AT_external    : 1
    <74586>   DW_AT_declaration : 1
 <1><74586>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <74587>   DW_AT_byte_size   : 8
    <74587>   DW_AT_type        : <0x7440d>
 <1><7458b>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7458c>   DW_AT_prototyped  : 1
    <7458c>   DW_AT_type        : <0x73956>
    <74590>   DW_AT_sibling     : <0x745a4>
 <2><74594>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74595>   DW_AT_type        : <0x73956>
 <2><74599>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7459a>   DW_AT_type        : <0x739e6>
 <2><7459e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7459f>   DW_AT_type        : <0x739a3>
 <2><745a3>: Abbrev Number: 0
 <1><745a4>: Abbrev Number: 45 (DW_TAG_variable)
    <745a5>   DW_AT_name        : (indirect string, offset: 0x16bb1): fb_hMemCpy
    <745a9>   DW_AT_decl_file   : 13
    <745a9>   DW_AT_decl_line   : 368
    <745ab>   DW_AT_decl_column : 16
    <745ac>   DW_AT_type        : <0x745b0>
    <745b0>   DW_AT_external    : 1
    <745b0>   DW_AT_declaration : 1
 <1><745b0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <745b1>   DW_AT_byte_size   : 8
    <745b1>   DW_AT_type        : <0x7458b>
 <1><745b5>: Abbrev Number: 45 (DW_TAG_variable)
    <745b6>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <745ba>   DW_AT_decl_file   : 13
    <745ba>   DW_AT_decl_line   : 369
    <745bc>   DW_AT_decl_column : 16
    <745bd>   DW_AT_type        : <0x74092>
    <745c1>   DW_AT_external    : 1
    <745c1>   DW_AT_declaration : 1
 <1><745c1>: Abbrev Number: 12 (DW_TAG_typedef)
    <745c2>   DW_AT_name        : (indirect string, offset: 0x16cc2): FBGFX_BLOAD_IMAGE_CONVERT
    <745c6>   DW_AT_decl_file   : 1
    <745c7>   DW_AT_decl_line   : 31
    <745c8>   DW_AT_decl_column : 16
    <745c9>   DW_AT_type        : <0x745cd>
 <1><745cd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <745ce>   DW_AT_byte_size   : 8
    <745ce>   DW_AT_type        : <0x745d2>
 <1><745d2>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <745d3>   DW_AT_prototyped  : 1
    <745d3>   DW_AT_sibling     : <0x745f6>
 <2><745d7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745d8>   DW_AT_type        : <0x7448e>
 <2><745dc>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745dd>   DW_AT_type        : <0x73e51>
 <2><745e1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745e2>   DW_AT_type        : <0x7391a>
 <2><745e6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745e7>   DW_AT_type        : <0x745f6>
 <2><745eb>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745ec>   DW_AT_type        : <0x739ec>
 <2><745f0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745f1>   DW_AT_type        : <0x739ec>
 <2><745f5>: Abbrev Number: 0
 <1><745f6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <745f7>   DW_AT_byte_size   : 8
    <745f7>   DW_AT_type        : <0x7399e>
 <1><745fb>: Abbrev Number: 21 (DW_TAG_subprogram)
    <745fc>   DW_AT_external    : 1
    <745fc>   DW_AT_name        : (indirect string, offset: 0x16a91): fb_image_convert_8to8
    <74600>   DW_AT_decl_file   : 13
    <74601>   DW_AT_decl_line   : 523
    <74603>   DW_AT_decl_column : 6
    <74604>   DW_AT_prototyped  : 1
    <74604>   DW_AT_declaration : 1
    <74604>   DW_AT_sibling     : <0x74618>
 <2><74608>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74609>   DW_AT_type        : <0x7448e>
 <2><7460d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7460e>   DW_AT_type        : <0x73e51>
 <2><74612>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74613>   DW_AT_type        : <0x7391a>
 <2><74617>: Abbrev Number: 0
 <1><74618>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74619>   DW_AT_external    : 1
    <74619>   DW_AT_name        : (indirect string, offset: 0x169d0): fb_image_convert_8to16
    <7461d>   DW_AT_decl_file   : 13
    <7461e>   DW_AT_decl_line   : 524
    <74620>   DW_AT_decl_column : 6
    <74621>   DW_AT_prototyped  : 1
    <74621>   DW_AT_declaration : 1
    <74621>   DW_AT_sibling     : <0x74635>
 <2><74625>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74626>   DW_AT_type        : <0x7448e>
 <2><7462a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7462b>   DW_AT_type        : <0x73e51>
 <2><7462f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74630>   DW_AT_type        : <0x7391a>
 <2><74634>: Abbrev Number: 0
 <1><74635>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74636>   DW_AT_external    : 1
    <74636>   DW_AT_name        : (indirect string, offset: 0x16a26): fb_image_convert_8to32
    <7463a>   DW_AT_decl_file   : 13
    <7463b>   DW_AT_decl_line   : 525
    <7463d>   DW_AT_decl_column : 6
    <7463e>   DW_AT_prototyped  : 1
    <7463e>   DW_AT_declaration : 1
    <7463e>   DW_AT_sibling     : <0x74652>
 <2><74642>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74643>   DW_AT_type        : <0x7448e>
 <2><74647>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74648>   DW_AT_type        : <0x73e51>
 <2><7464c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7464d>   DW_AT_type        : <0x7391a>
 <2><74651>: Abbrev Number: 0
 <1><74652>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74653>   DW_AT_external    : 1
    <74653>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <74657>   DW_AT_decl_file   : 14
    <74658>   DW_AT_decl_line   : 565
    <7465a>   DW_AT_decl_column : 13
    <7465b>   DW_AT_prototyped  : 1
    <7465b>   DW_AT_declaration : 1
    <7465b>   DW_AT_sibling     : <0x74665>
 <2><7465f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74660>   DW_AT_type        : <0x73956>
 <2><74664>: Abbrev Number: 0
 <1><74665>: Abbrev Number: 29 (DW_TAG_subprogram)
    <74666>   DW_AT_external    : 1
    <74666>   DW_AT_name        : (indirect string, offset: 0xe63c): malloc
    <7466a>   DW_AT_decl_file   : 14
    <7466b>   DW_AT_decl_line   : 539
    <7466d>   DW_AT_decl_column : 14
    <7466e>   DW_AT_prototyped  : 1
    <7466e>   DW_AT_type        : <0x73956>
    <74672>   DW_AT_declaration : 1
    <74672>   DW_AT_sibling     : <0x7467c>
 <2><74676>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74677>   DW_AT_type        : <0x739a3>
 <2><7467b>: Abbrev Number: 0
 <1><7467c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7467d>   DW_AT_external    : 1
    <7467d>   DW_AT_name        : (indirect string, offset: 0x16b62): fseek
    <74681>   DW_AT_decl_file   : 15
    <74682>   DW_AT_decl_line   : 689
    <74684>   DW_AT_decl_column : 12
    <74685>   DW_AT_prototyped  : 1
    <74685>   DW_AT_type        : <0x7391a>
    <74689>   DW_AT_declaration : 1
    <74689>   DW_AT_sibling     : <0x7469d>
 <2><7468d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7468e>   DW_AT_type        : <0x73bde>
 <2><74692>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74693>   DW_AT_type        : <0x73937>
 <2><74697>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74698>   DW_AT_type        : <0x7391a>
 <2><7469c>: Abbrev Number: 0
 <1><7469d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <7469e>   DW_AT_external    : 1
    <7469e>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <746a2>   DW_AT_decl_file   : 13
    <746a3>   DW_AT_decl_line   : 470
    <746a5>   DW_AT_decl_column : 20
    <746a6>   DW_AT_prototyped  : 1
    <746a6>   DW_AT_declaration : 1
    <746a6>   DW_AT_sibling     : <0x746b5>
 <2><746aa>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746ab>   DW_AT_type        : <0x7391a>
 <2><746af>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746b0>   DW_AT_type        : <0x7391a>
 <2><746b4>: Abbrev Number: 0
 <1><746b5>: Abbrev Number: 53 (DW_TAG_subprogram)
    <746b6>   DW_AT_external    : 1
    <746b6>   DW_AT_name        : (indirect string, offset: 0x16bec): fb_hRestorePalette
    <746ba>   DW_AT_decl_file   : 13
    <746ba>   DW_AT_decl_line   : 406
    <746bc>   DW_AT_decl_column : 13
    <746bd>   DW_AT_prototyped  : 1
    <746bd>   DW_AT_declaration : 1
 <1><746bd>: Abbrev Number: 29 (DW_TAG_subprogram)
    <746be>   DW_AT_external    : 1
    <746be>   DW_AT_name        : (indirect string, offset: 0x16bd4): feof
    <746c2>   DW_AT_decl_file   : 15
    <746c3>   DW_AT_decl_line   : 764
    <746c5>   DW_AT_decl_column : 12
    <746c6>   DW_AT_prototyped  : 1
    <746c6>   DW_AT_type        : <0x7391a>
    <746ca>   DW_AT_declaration : 1
    <746ca>   DW_AT_sibling     : <0x746d4>
 <2><746ce>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746cf>   DW_AT_type        : <0x73bde>
 <2><746d3>: Abbrev Number: 0
 <1><746d4>: Abbrev Number: 29 (DW_TAG_subprogram)
    <746d5>   DW_AT_external    : 1
    <746d5>   DW_AT_name        : (indirect string, offset: 0x16d3d): fread
    <746d9>   DW_AT_decl_file   : 15
    <746da>   DW_AT_decl_line   : 651
    <746dc>   DW_AT_decl_column : 15
    <746dd>   DW_AT_prototyped  : 1
    <746dd>   DW_AT_type        : <0x739a3>
    <746e1>   DW_AT_declaration : 1
    <746e1>   DW_AT_sibling     : <0x746fa>
 <2><746e5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746e6>   DW_AT_type        : <0x73958>
 <2><746ea>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746eb>   DW_AT_type        : <0x739a3>
 <2><746ef>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746f0>   DW_AT_type        : <0x739a3>
 <2><746f4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <746f5>   DW_AT_type        : <0x73be3>
 <2><746f9>: Abbrev Number: 0
 <1><746fa>: Abbrev Number: 53 (DW_TAG_subprogram)
    <746fb>   DW_AT_external    : 1
    <746fb>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <746ff>   DW_AT_decl_file   : 13
    <746ff>   DW_AT_decl_line   : 469
    <74701>   DW_AT_decl_column : 20
    <74702>   DW_AT_prototyped  : 1
    <74702>   DW_AT_declaration : 1
 <1><74702>: Abbrev Number: 46 (DW_TAG_subprogram)
    <74703>   DW_AT_external    : 1
    <74703>   DW_AT_name        : (indirect string, offset: 0x169b2): fclose
    <74707>   DW_AT_decl_file   : 15
    <74708>   DW_AT_decl_line   : 213
    <74709>   DW_AT_decl_column : 12
    <7470a>   DW_AT_prototyped  : 1
    <7470a>   DW_AT_type        : <0x7391a>
    <7470e>   DW_AT_declaration : 1
    <7470e>   DW_AT_sibling     : <0x74718>
 <2><74712>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74713>   DW_AT_type        : <0x73bde>
 <2><74717>: Abbrev Number: 0
 <1><74718>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74719>   DW_AT_external    : 1
    <74719>   DW_AT_name        : (indirect string, offset: 0x16ca3): rewind
    <7471d>   DW_AT_decl_file   : 15
    <7471e>   DW_AT_decl_line   : 699
    <74720>   DW_AT_decl_column : 13
    <74721>   DW_AT_prototyped  : 1
    <74721>   DW_AT_declaration : 1
    <74721>   DW_AT_sibling     : <0x7472b>
 <2><74725>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74726>   DW_AT_type        : <0x73bde>
 <2><7472a>: Abbrev Number: 0
 <1><7472b>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7472c>   DW_AT_external    : 1
    <7472c>   DW_AT_name        : (indirect string, offset: 0x167e1): fgetc
    <74730>   DW_AT_decl_file   : 15
    <74731>   DW_AT_decl_line   : 489
    <74733>   DW_AT_decl_column : 12
    <74734>   DW_AT_prototyped  : 1
    <74734>   DW_AT_type        : <0x7391a>
    <74738>   DW_AT_declaration : 1
    <74738>   DW_AT_sibling     : <0x74742>
 <2><7473c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7473d>   DW_AT_type        : <0x73bde>
 <2><74741>: Abbrev Number: 0
 <1><74742>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74743>   DW_AT_external    : 1
    <74743>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <74747>   DW_AT_decl_file   : 13
    <74748>   DW_AT_decl_line   : 410
    <7474a>   DW_AT_decl_column : 13
    <7474b>   DW_AT_prototyped  : 1
    <7474b>   DW_AT_declaration : 1
    <7474b>   DW_AT_sibling     : <0x7475a>
 <2><7474f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74750>   DW_AT_type        : <0x7475a>
 <2><74754>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74755>   DW_AT_type        : <0x738e6>
 <2><74759>: Abbrev Number: 0
 <1><7475a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7475b>   DW_AT_byte_size   : 8
    <7475b>   DW_AT_type        : <0x740b1>
 <1><7475f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <74760>   DW_AT_external    : 1
    <74760>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <74764>   DW_AT_decl_file   : 13
    <74765>   DW_AT_decl_line   : 409
    <74767>   DW_AT_decl_column : 13
    <74768>   DW_AT_prototyped  : 1
    <74768>   DW_AT_declaration : 1
    <74768>   DW_AT_sibling     : <0x74777>
 <2><7476c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7476d>   DW_AT_type        : <0x7475a>
 <2><74771>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74772>   DW_AT_type        : <0x73956>
 <2><74776>: Abbrev Number: 0
 <1><74777>: Abbrev Number: 46 (DW_TAG_subprogram)
    <74778>   DW_AT_external    : 1
    <74778>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <7477c>   DW_AT_decl_file   : 9
    <7477d>   DW_AT_decl_line   : 111
    <7477e>   DW_AT_decl_column : 21
    <7477f>   DW_AT_prototyped  : 1
    <7477f>   DW_AT_type        : <0x7391a>
    <74783>   DW_AT_declaration : 1
    <74783>   DW_AT_sibling     : <0x7478d>
 <2><74787>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74788>   DW_AT_type        : <0x73cd8>
 <2><7478c>: Abbrev Number: 0
 <1><7478d>: Abbrev Number: 72 (DW_TAG_subprogram)
    <7478e>   DW_AT_external    : 1
    <7478e>   DW_AT_name        : (indirect string, offset: 0x16c90): fopen
    <74792>   DW_AT_decl_file   : 15
    <74793>   DW_AT_decl_line   : 257
    <74795>   DW_AT_decl_column : 14
    <74796>   DW_AT_linkage_name: (indirect string, offset: 0x168c0): fopen64
    <7479a>   DW_AT_prototyped  : 1
    <7479a>   DW_AT_type        : <0x73bde>
    <7479e>   DW_AT_declaration : 1
    <7479e>   DW_AT_sibling     : <0x747ad>
 <2><747a2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747a3>   DW_AT_type        : <0x739f6>
 <2><747a7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747a8>   DW_AT_type        : <0x739f6>
 <2><747ac>: Abbrev Number: 0
 <1><747ad>: Abbrev Number: 21 (DW_TAG_subprogram)
    <747ae>   DW_AT_external    : 1
    <747ae>   DW_AT_name        : (indirect string, offset: 0x167e7): fb_hConvertPath
    <747b2>   DW_AT_decl_file   : 16
    <747b3>   DW_AT_decl_line   : 309
    <747b5>   DW_AT_decl_column : 21
    <747b6>   DW_AT_prototyped  : 1
    <747b6>   DW_AT_declaration : 1
    <747b6>   DW_AT_sibling     : <0x747c0>
 <2><747ba>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747bb>   DW_AT_type        : <0x73969>
 <2><747bf>: Abbrev Number: 0
 <1><747c0>: Abbrev Number: 29 (DW_TAG_subprogram)
    <747c1>   DW_AT_external    : 1
    <747c1>   DW_AT_name        : (indirect string, offset: 0x16afe): snprintf
    <747c5>   DW_AT_decl_file   : 15
    <747c6>   DW_AT_decl_line   : 354
    <747c8>   DW_AT_decl_column : 12
    <747c9>   DW_AT_prototyped  : 1
    <747c9>   DW_AT_type        : <0x7391a>
    <747cd>   DW_AT_declaration : 1
    <747cd>   DW_AT_sibling     : <0x747e2>
 <2><747d1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747d2>   DW_AT_type        : <0x73969>
 <2><747d6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747d7>   DW_AT_type        : <0x739a3>
 <2><747db>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747dc>   DW_AT_type        : <0x739f1>
 <2><747e0>: Abbrev Number: 73 (DW_TAG_unspecified_parameters)
 <2><747e1>: Abbrev Number: 0
 <1><747e2>: Abbrev Number: 74 (DW_TAG_subprogram)
    <747e3>   DW_AT_external    : 1
    <747e3>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <747e7>   DW_AT_decl_file   : 13
    <747e8>   DW_AT_decl_line   : 396
    <747ea>   DW_AT_decl_column : 19
    <747eb>   DW_AT_prototyped  : 1
    <747eb>   DW_AT_type        : <0x7475a>
    <747ef>   DW_AT_declaration : 1
 <1><747ef>: Abbrev Number: 46 (DW_TAG_subprogram)
    <747f0>   DW_AT_external    : 1
    <747f0>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <747f4>   DW_AT_decl_file   : 17
    <747f5>   DW_AT_decl_line   : 50
    <747f6>   DW_AT_decl_column : 22
    <747f7>   DW_AT_prototyped  : 1
    <747f7>   DW_AT_type        : <0x7391a>
    <747fb>   DW_AT_declaration : 1
    <747fb>   DW_AT_sibling     : <0x74805>
 <2><747ff>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74800>   DW_AT_type        : <0x7391a>
 <2><74804>: Abbrev Number: 0
 <1><74805>: Abbrev Number: 54 (DW_TAG_subprogram)
    <74806>   DW_AT_external    : 1
    <74806>   DW_AT_name        : (indirect string, offset: 0x16c37): fb_GfxBloadQB
    <7480a>   DW_AT_decl_file   : 1
    <7480a>   DW_AT_decl_line   : 558
    <7480c>   DW_AT_decl_column : 12
    <7480c>   DW_AT_prototyped  : 1
    <7480c>   DW_AT_type        : <0x7391a>
    <74810>   DW_AT_low_pc      : 0x4590e0
    <74818>   DW_AT_high_pc     : 0x7
    <74820>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <74822>   DW_AT_call_all_calls: 1
    <74822>   DW_AT_sibling     : <0x7488b>
 <2><74826>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <74827>   DW_AT_name        : (indirect string, offset: 0x1d471): filename
    <7482b>   DW_AT_decl_file   : 1
    <7482b>   DW_AT_decl_line   : 558
    <7482d>   DW_AT_decl_column : 36
    <7482e>   DW_AT_type        : <0x73cd8>
    <74832>   DW_AT_location    : 0x15bb5 (location list)
    <74836>   DW_AT_GNU_locviews: 0x15bb1
 <2><7483a>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <7483b>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <7483f>   DW_AT_decl_file   : 1
    <7483f>   DW_AT_decl_line   : 558
    <74841>   DW_AT_decl_column : 52
    <74842>   DW_AT_type        : <0x73956>
    <74846>   DW_AT_location    : 0x15bcf (location list)
    <7484a>   DW_AT_GNU_locviews: 0x15bcb
 <2><7484e>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <7484f>   DW_AT_name        : pal
    <74853>   DW_AT_decl_file   : 1
    <74853>   DW_AT_decl_line   : 558
    <74855>   DW_AT_decl_column : 64
    <74856>   DW_AT_type        : <0x73956>
    <7485a>   DW_AT_location    : 0x15be9 (location list)
    <7485e>   DW_AT_GNU_locviews: 0x15be5
 <2><74862>: Abbrev Number: 33 (DW_TAG_call_site)
    <74863>   DW_AT_call_return_pc: 0x4590e7
    <7486b>   DW_AT_call_tail_call: 1
    <7486b>   DW_AT_call_origin : <0x74911>
 <3><7486f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <74870>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <74872>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><74876>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <74877>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <74879>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><7487d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7487e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <74880>   DW_AT_call_value  : 3 byte block: a3 1 51 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)))
 <3><74884>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <74885>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <74887>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><74889>: Abbrev Number: 0
 <2><7488a>: Abbrev Number: 0
 <1><7488b>: Abbrev Number: 54 (DW_TAG_subprogram)
    <7488c>   DW_AT_external    : 1
    <7488c>   DW_AT_name        : (indirect string, offset: 0x1627d): fb_GfxBload
    <74890>   DW_AT_decl_file   : 1
    <74890>   DW_AT_decl_line   : 553
    <74892>   DW_AT_decl_column : 12
    <74892>   DW_AT_prototyped  : 1
    <74892>   DW_AT_type        : <0x7391a>
    <74896>   DW_AT_low_pc      : 0x4590d0
    <7489e>   DW_AT_high_pc     : 0xa
    <748a6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <748a8>   DW_AT_call_all_calls: 1
    <748a8>   DW_AT_sibling     : <0x74911>
 <2><748ac>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <748ad>   DW_AT_name        : (indirect string, offset: 0x1d471): filename
    <748b1>   DW_AT_decl_file   : 1
    <748b1>   DW_AT_decl_line   : 553
    <748b3>   DW_AT_decl_column : 34
    <748b4>   DW_AT_type        : <0x73cd8>
    <748b8>   DW_AT_location    : 0x15c03 (location list)
    <748bc>   DW_AT_GNU_locviews: 0x15bff
 <2><748c0>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <748c1>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <748c5>   DW_AT_decl_file   : 1
    <748c5>   DW_AT_decl_line   : 553
    <748c7>   DW_AT_decl_column : 50
    <748c8>   DW_AT_type        : <0x73956>
    <748cc>   DW_AT_location    : 0x15c1d (location list)
    <748d0>   DW_AT_GNU_locviews: 0x15c19
 <2><748d4>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <748d5>   DW_AT_name        : pal
    <748d9>   DW_AT_decl_file   : 1
    <748d9>   DW_AT_decl_line   : 553
    <748db>   DW_AT_decl_column : 62
    <748dc>   DW_AT_type        : <0x73956>
    <748e0>   DW_AT_location    : 0x15c37 (location list)
    <748e4>   DW_AT_GNU_locviews: 0x15c33
 <2><748e8>: Abbrev Number: 33 (DW_TAG_call_site)
    <748e9>   DW_AT_call_return_pc: 0x4590da
    <748f1>   DW_AT_call_tail_call: 1
    <748f1>   DW_AT_call_origin : <0x74911>
 <3><748f5>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <748f6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <748f8>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><748fc>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <748fd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <748ff>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><74903>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <74904>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <74906>   DW_AT_call_value  : 3 byte block: a3 1 51 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)))
 <3><7490a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7490b>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7490d>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><7490f>: Abbrev Number: 0
 <2><74910>: Abbrev Number: 0
 <1><74911>: Abbrev Number: 75 (DW_TAG_subprogram)
    <74912>   DW_AT_name        : (indirect string, offset: 0x16be2): gfx_bload
    <74916>   DW_AT_decl_file   : 1
    <74917>   DW_AT_decl_line   : 459
    <74919>   DW_AT_decl_column : 12
    <7491a>   DW_AT_prototyped  : 1
    <7491a>   DW_AT_type        : <0x7391a>
    <7491e>   DW_AT_low_pc      : 0x457ee0
    <74926>   DW_AT_high_pc     : 0x11b6
    <7492e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <74930>   DW_AT_call_all_calls: 1
    <74930>   DW_AT_sibling     : <0x75cb2>
 <2><74934>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <74935>   DW_AT_name        : (indirect string, offset: 0x1d471): filename
    <74939>   DW_AT_decl_file   : 1
    <74939>   DW_AT_decl_line   : 459
    <7493b>   DW_AT_decl_column : 32
    <7493c>   DW_AT_type        : <0x73cd8>
    <74940>   DW_AT_location    : 0x15c71 (location list)
    <74944>   DW_AT_GNU_locviews: 0x15c4d
 <2><74948>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <74949>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <7494d>   DW_AT_decl_file   : 1
    <7494d>   DW_AT_decl_line   : 459
    <7494f>   DW_AT_decl_column : 48
    <74950>   DW_AT_type        : <0x73956>
    <74954>   DW_AT_location    : 0x15d64 (location list)
    <74958>   DW_AT_GNU_locviews: 0x15d26
 <2><7495c>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <7495d>   DW_AT_name        : pal
    <74961>   DW_AT_decl_file   : 1
    <74961>   DW_AT_decl_line   : 459
    <74963>   DW_AT_decl_column : 60
    <74964>   DW_AT_type        : <0x73956>
    <74968>   DW_AT_location    : 0x15ecf (location list)
    <7496c>   DW_AT_GNU_locviews: 0x15eb7
 <2><74970>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <74971>   DW_AT_name        : (indirect string, offset: 0x16c96): usenewheader
    <74975>   DW_AT_decl_file   : 1
    <74975>   DW_AT_decl_line   : 459
    <74977>   DW_AT_decl_column : 69
    <74978>   DW_AT_type        : <0x7391a>
    <7497c>   DW_AT_location    : 0x15f8f (location list)
    <74980>   DW_AT_GNU_locviews: 0x15f57
 <2><74984>: Abbrev Number: 48 (DW_TAG_variable)
    <74985>   DW_AT_name        : f
    <74987>   DW_AT_decl_file   : 1
    <74987>   DW_AT_decl_line   : 461
    <74989>   DW_AT_decl_column : 8
    <7498a>   DW_AT_type        : <0x73bde>
    <7498e>   DW_AT_location    : 0x160cd (location list)
    <74992>   DW_AT_GNU_locviews: 0x160b5
 <2><74996>: Abbrev Number: 34 (DW_TAG_variable)
    <74997>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7499b>   DW_AT_decl_file   : 1
    <7499b>   DW_AT_decl_line   : 462
    <7499d>   DW_AT_decl_column : 13
    <7499e>   DW_AT_type        : <0x7475a>
    <749a2>   DW_AT_location    : 0x1615e (location list)
    <749a6>   DW_AT_GNU_locviews: 0x1613a
 <2><749aa>: Abbrev Number: 48 (DW_TAG_variable)
    <749ab>   DW_AT_name        : id
    <749ae>   DW_AT_decl_file   : 1
    <749ae>   DW_AT_decl_line   : 463
    <749b0>   DW_AT_decl_column : 16
    <749b1>   DW_AT_type        : <0x738d3>
    <749b5>   DW_AT_location    : 0x16209 (location list)
    <749b9>   DW_AT_GNU_locviews: 0x16201
 <2><749bd>: Abbrev Number: 34 (DW_TAG_variable)
    <749be>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <749c2>   DW_AT_decl_file   : 1
    <749c2>   DW_AT_decl_line   : 464
    <749c4>   DW_AT_decl_column : 15
    <749c5>   DW_AT_type        : <0x738e6>
    <749c9>   DW_AT_location    : 0x1623e (location list)
    <749cd>   DW_AT_GNU_locviews: 0x1622e
 <2><749d1>: Abbrev Number: 34 (DW_TAG_variable)
    <749d2>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <749d6>   DW_AT_decl_file   : 1
    <749d6>   DW_AT_decl_line   : 464
    <749d8>   DW_AT_decl_column : 23
    <749d9>   DW_AT_type        : <0x742be>
    <749dd>   DW_AT_location    : 0x162d1 (location list)
    <749e1>   DW_AT_GNU_locviews: 0x162b7
 <2><749e5>: Abbrev Number: 34 (DW_TAG_variable)
    <749e6>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <749ea>   DW_AT_decl_file   : 1
    <749ea>   DW_AT_decl_line   : 464
    <749ec>   DW_AT_decl_column : 38
    <749ed>   DW_AT_type        : <0x738e6>
    <749f1>   DW_AT_location    : 0x16370 (location list)
    <749f5>   DW_AT_GNU_locviews: 0x1635e
 <2><749f9>: Abbrev Number: 76 (DW_TAG_variable)
    <749fa>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <749fe>   DW_AT_decl_file   : 1
    <749ff>   DW_AT_decl_line   : 465
    <74a01>   DW_AT_decl_column : 7
    <74a02>   DW_AT_type        : <0x73c73>
    <74a06>   DW_AT_location    : 3 byte block: 91 b0 77 	(DW_OP_fbreg: -1104)
 <2><74a0a>: Abbrev Number: 48 (DW_TAG_variable)
    <74a0b>   DW_AT_name        : i
    <74a0d>   DW_AT_decl_file   : 1
    <74a0d>   DW_AT_decl_line   : 466
    <74a0f>   DW_AT_decl_column : 6
    <74a10>   DW_AT_type        : <0x7391a>
    <74a14>   DW_AT_location    : 0x163f3 (location list)
    <74a18>   DW_AT_GNU_locviews: 0x163e7
 <2><74a1c>: Abbrev Number: 34 (DW_TAG_variable)
    <74a1d>   DW_AT_name        : (indirect string, offset: 0x1a7da): result
    <74a21>   DW_AT_decl_file   : 1
    <74a21>   DW_AT_decl_line   : 466
    <74a23>   DW_AT_decl_column : 9
    <74a24>   DW_AT_type        : <0x7391a>
    <74a28>   DW_AT_location    : 0x1644a (location list)
    <74a2c>   DW_AT_GNU_locviews: 0x16430
 <2><74a30>: Abbrev Number: 77 (DW_TAG_inlined_subroutine)
    <74a31>   DW_AT_abstract_origin: <0x75cb2>
    <74a35>   DW_AT_entry_pc    : 0x458128
    <74a3d>   DW_AT_GNU_entry_view: 1
    <74a3f>   DW_AT_ranges      : 0x17130
    <74a43>   DW_AT_call_file   : 1
    <74a44>   DW_AT_call_line   : 509
    <74a46>   DW_AT_call_column : 13
    <74a47>   DW_AT_sibling     : <0x7588a>
 <3><74a4b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74a4c>   DW_AT_abstract_origin: <0x75cec>
    <74a50>   DW_AT_location    : 0x164e8 (location list)
    <74a54>   DW_AT_GNU_locviews: 0x164c4
 <3><74a58>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74a59>   DW_AT_abstract_origin: <0x75ce1>
    <74a5d>   DW_AT_location    : 0x165b2 (location list)
    <74a61>   DW_AT_GNU_locviews: 0x165a8
 <3><74a65>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74a66>   DW_AT_abstract_origin: <0x75cd6>
    <74a6a>   DW_AT_location    : 0x165f8 (location list)
    <74a6e>   DW_AT_GNU_locviews: 0x165ea
 <3><74a72>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74a73>   DW_AT_abstract_origin: <0x75ccd>
    <74a77>   DW_AT_location    : 0x16658 (location list)
    <74a7b>   DW_AT_GNU_locviews: 0x16646
 <3><74a7f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74a80>   DW_AT_abstract_origin: <0x75cc2>
    <74a84>   DW_AT_location    : 0x166c4 (location list)
    <74a88>   DW_AT_GNU_locviews: 0x166aa
 <3><74a8c>: Abbrev Number: 78 (DW_TAG_lexical_block)
    <74a8d>   DW_AT_ranges      : 0x17130
 <4><74a91>: Abbrev Number: 15 (DW_TAG_variable)
    <74a92>   DW_AT_abstract_origin: <0x75cf7>
    <74a96>   DW_AT_location    : 3 byte block: 91 c6 6e 	(DW_OP_fbreg: -2234)
 <4><74a9a>: Abbrev Number: 15 (DW_TAG_variable)
    <74a9b>   DW_AT_abstract_origin: <0x75d02>
    <74a9f>   DW_AT_location    : 3 byte block: 91 d4 6e 	(DW_OP_fbreg: -2220)
 <4><74aa3>: Abbrev Number: 15 (DW_TAG_variable)
    <74aa4>   DW_AT_abstract_origin: <0x75d0d>
    <74aa8>   DW_AT_location    : 3 byte block: 91 c8 6e 	(DW_OP_fbreg: -2232)
 <4><74aac>: Abbrev Number: 15 (DW_TAG_variable)
    <74aad>   DW_AT_abstract_origin: <0x75d18>
    <74ab1>   DW_AT_location    : 3 byte block: 91 ca 6e 	(DW_OP_fbreg: -2230)
 <4><74ab5>: Abbrev Number: 15 (DW_TAG_variable)
    <74ab6>   DW_AT_abstract_origin: <0x75d23>
    <74aba>   DW_AT_location    : 3 byte block: 91 d8 6e 	(DW_OP_fbreg: -2216)
 <4><74abe>: Abbrev Number: 15 (DW_TAG_variable)
    <74abf>   DW_AT_abstract_origin: <0x75d2e>
    <74ac3>   DW_AT_location    : 3 byte block: 91 dc 6e 	(DW_OP_fbreg: -2212)
 <4><74ac7>: Abbrev Number: 15 (DW_TAG_variable)
    <74ac8>   DW_AT_abstract_origin: <0x75d39>
    <74acc>   DW_AT_location    : 3 byte block: 91 e0 6e 	(DW_OP_fbreg: -2208)
 <4><74ad0>: Abbrev Number: 15 (DW_TAG_variable)
    <74ad1>   DW_AT_abstract_origin: <0x75d44>
    <74ad5>   DW_AT_location    : 3 byte block: 91 cc 6e 	(DW_OP_fbreg: -2228)
 <4><74ad9>: Abbrev Number: 15 (DW_TAG_variable)
    <74ada>   DW_AT_abstract_origin: <0x75d4f>
    <74ade>   DW_AT_location    : 3 byte block: 91 e4 6e 	(DW_OP_fbreg: -2204)
 <4><74ae2>: Abbrev Number: 15 (DW_TAG_variable)
    <74ae3>   DW_AT_abstract_origin: <0x75d5a>
    <74ae7>   DW_AT_location    : 3 byte block: 91 ce 6e 	(DW_OP_fbreg: -2226)
 <4><74aeb>: Abbrev Number: 15 (DW_TAG_variable)
    <74aec>   DW_AT_abstract_origin: <0x75d65>
    <74af0>   DW_AT_location    : 3 byte block: 91 d0 6e 	(DW_OP_fbreg: -2224)
 <4><74af4>: Abbrev Number: 15 (DW_TAG_variable)
    <74af5>   DW_AT_abstract_origin: <0x75d70>
    <74af9>   DW_AT_location    : 3 byte block: 91 d2 6e 	(DW_OP_fbreg: -2222)
 <4><74afd>: Abbrev Number: 15 (DW_TAG_variable)
    <74afe>   DW_AT_abstract_origin: <0x75d7b>
    <74b02>   DW_AT_location    : 3 byte block: 91 e8 6e 	(DW_OP_fbreg: -2200)
 <4><74b06>: Abbrev Number: 15 (DW_TAG_variable)
    <74b07>   DW_AT_abstract_origin: <0x75d86>
    <74b0b>   DW_AT_location    : 3 byte block: 91 ec 6e 	(DW_OP_fbreg: -2196)
 <4><74b0f>: Abbrev Number: 7 (DW_TAG_variable)
    <74b10>   DW_AT_abstract_origin: <0x75d91>
    <74b14>   DW_AT_location    : 0x1674a (location list)
    <74b18>   DW_AT_GNU_locviews: 0x1673a
 <4><74b1c>: Abbrev Number: 7 (DW_TAG_variable)
    <74b1d>   DW_AT_abstract_origin: <0x75d9c>
    <74b21>   DW_AT_location    : 0x167b3 (location list)
    <74b25>   DW_AT_GNU_locviews: 0x1679f
 <4><74b29>: Abbrev Number: 7 (DW_TAG_variable)
    <74b2a>   DW_AT_abstract_origin: <0x75da7>
    <74b2e>   DW_AT_location    : 0x16828 (location list)
    <74b32>   DW_AT_GNU_locviews: 0x1681a
 <4><74b36>: Abbrev Number: 7 (DW_TAG_variable)
    <74b37>   DW_AT_abstract_origin: <0x75db2>
    <74b3b>   DW_AT_location    : 0x16870 (location list)
