 <2><f4857>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4858>   DW_AT_type        : <0xf4862>
 <2><f485c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f485d>   DW_AT_type        : <0xf4370>
 <2><f4861>: Abbrev Number: 0
 <1><f4862>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4863>   DW_AT_byte_size   : 8
    <f4863>   DW_AT_type        : <0xf4389>
 <1><f4867>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4868>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <f486c>   DW_AT_decl_file   : 9
    <f486d>   DW_AT_decl_line   : 71
    <f486e>   DW_AT_decl_column : 15
    <f486f>   DW_AT_type        : <0xf4873>
 <1><f4873>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4874>   DW_AT_byte_size   : 8
    <f4874>   DW_AT_type        : <0xf4878>
 <1><f4878>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <f4879>   DW_AT_prototyped  : 1
    <f4879>   DW_AT_type        : <0xf4330>
    <f487d>   DW_AT_sibling     : <0xf4891>
 <2><f4881>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4882>   DW_AT_type        : <0xf466d>
 <2><f4886>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4887>   DW_AT_type        : <0xf45b2>
 <2><f488b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f488c>   DW_AT_type        : <0xf45b2>
 <2><f4890>: Abbrev Number: 0
 <1><f4891>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4892>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <f4896>   DW_AT_decl_file   : 9
    <f4897>   DW_AT_decl_line   : 73
    <f4898>   DW_AT_decl_column : 15
    <f4899>   DW_AT_type        : <0xf4873>
 <1><f489d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f489e>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <f48a2>   DW_AT_decl_file   : 9
    <f48a3>   DW_AT_decl_line   : 75
    <f48a4>   DW_AT_decl_column : 15
    <f48a5>   DW_AT_type        : <0xf48a9>
 <1><f48a9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f48aa>   DW_AT_byte_size   : 8
    <f48aa>   DW_AT_type        : <0xf48ae>
 <1><f48ae>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <f48af>   DW_AT_prototyped  : 1
    <f48af>   DW_AT_type        : <0xf4330>
    <f48b3>   DW_AT_sibling     : <0xf48c2>
 <2><f48b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48b8>   DW_AT_type        : <0xf466d>
 <2><f48bc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48bd>   DW_AT_type        : <0xf48c2>
 <2><f48c1>: Abbrev Number: 0
 <1><f48c2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f48c3>   DW_AT_byte_size   : 8
    <f48c3>   DW_AT_type        : <0xf45f2>
 <1><f48c7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f48c8>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <f48cc>   DW_AT_decl_file   : 9
    <f48cd>   DW_AT_decl_line   : 76
    <f48ce>   DW_AT_decl_column : 15
    <f48cf>   DW_AT_type        : <0xf48d3>
 <1><f48d3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f48d4>   DW_AT_byte_size   : 8
    <f48d4>   DW_AT_type        : <0xf48d8>
 <1><f48d8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <f48d9>   DW_AT_prototyped  : 1
    <f48d9>   DW_AT_type        : <0xf4330>
    <f48dd>   DW_AT_sibling     : <0xf48f1>
 <2><f48e1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48e2>   DW_AT_type        : <0xf466d>
 <2><f48e6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48e7>   DW_AT_type        : <0xf460c>
 <2><f48eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48ec>   DW_AT_type        : <0xf43a1>
 <2><f48f0>: Abbrev Number: 0
 <1><f48f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f48f2>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <f48f6>   DW_AT_decl_file   : 9
    <f48f7>   DW_AT_decl_line   : 77
    <f48f8>   DW_AT_decl_column : 15
    <f48f9>   DW_AT_type        : <0xf4741>
 <1><f48fd>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f48fe>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <f4902>   DW_AT_byte_size   : 112
    <f4903>   DW_AT_decl_file   : 9
    <f4904>   DW_AT_decl_line   : 80
    <f4905>   DW_AT_decl_column : 16
    <f4906>   DW_AT_sibling     : <0xf49c1>
 <2><f490a>: Abbrev Number: 1 (DW_TAG_member)
    <f490b>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <f490f>   DW_AT_decl_file   : 9
    <f4910>   DW_AT_decl_line   : 81
    <f4911>   DW_AT_decl_column : 25
    <f4912>   DW_AT_type        : <0xf4735>
    <f4916>   DW_AT_data_member_location: 0
 <2><f4917>: Abbrev Number: 1 (DW_TAG_member)
    <f4918>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <f491c>   DW_AT_decl_file   : 9
    <f491d>   DW_AT_decl_line   : 82
    <f491e>   DW_AT_decl_column : 25
    <f491f>   DW_AT_type        : <0xf4755>
    <f4923>   DW_AT_data_member_location: 8
 <2><f4924>: Abbrev Number: 1 (DW_TAG_member)
    <f4925>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <f4929>   DW_AT_decl_file   : 9
    <f492a>   DW_AT_decl_line   : 83
    <f492b>   DW_AT_decl_column : 25
    <f492c>   DW_AT_type        : <0xf4761>
    <f4930>   DW_AT_data_member_location: 16
 <2><f4931>: Abbrev Number: 1 (DW_TAG_member)
    <f4932>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <f4936>   DW_AT_decl_file   : 9
    <f4937>   DW_AT_decl_line   : 84
    <f4938>   DW_AT_decl_column : 25
    <f4939>   DW_AT_type        : <0xf478b>
    <f493d>   DW_AT_data_member_location: 24
 <2><f493e>: Abbrev Number: 1 (DW_TAG_member)
    <f493f>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <f4943>   DW_AT_decl_file   : 9
    <f4944>   DW_AT_decl_line   : 85
    <f4945>   DW_AT_decl_column : 25
    <f4946>   DW_AT_type        : <0xf47b5>
    <f494a>   DW_AT_data_member_location: 32
 <2><f494b>: Abbrev Number: 1 (DW_TAG_member)
    <f494c>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <f4950>   DW_AT_decl_file   : 9
    <f4951>   DW_AT_decl_line   : 86
    <f4952>   DW_AT_decl_column : 25
    <f4953>   DW_AT_type        : <0xf47e4>
    <f4957>   DW_AT_data_member_location: 40
 <2><f4958>: Abbrev Number: 1 (DW_TAG_member)
    <f4959>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <f495d>   DW_AT_decl_file   : 9
    <f495e>   DW_AT_decl_line   : 87
    <f495f>   DW_AT_decl_column : 25
    <f4960>   DW_AT_type        : <0xf480e>
    <f4964>   DW_AT_data_member_location: 48
 <2><f4965>: Abbrev Number: 1 (DW_TAG_member)
    <f4966>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <f496a>   DW_AT_decl_file   : 9
    <f496b>   DW_AT_decl_line   : 88
    <f496c>   DW_AT_decl_column : 25
    <f496d>   DW_AT_type        : <0xf4838>
    <f4971>   DW_AT_data_member_location: 56
 <2><f4972>: Abbrev Number: 1 (DW_TAG_member)
    <f4973>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <f4977>   DW_AT_decl_file   : 9
    <f4978>   DW_AT_decl_line   : 89
    <f4979>   DW_AT_decl_column : 25
    <f497a>   DW_AT_type        : <0xf4867>
    <f497e>   DW_AT_data_member_location: 64
 <2><f497f>: Abbrev Number: 1 (DW_TAG_member)
    <f4980>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <f4984>   DW_AT_decl_file   : 9
    <f4985>   DW_AT_decl_line   : 90
    <f4986>   DW_AT_decl_column : 25
    <f4987>   DW_AT_type        : <0xf4891>
    <f498b>   DW_AT_data_member_location: 72
 <2><f498c>: Abbrev Number: 1 (DW_TAG_member)
    <f498d>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <f4991>   DW_AT_decl_file   : 9
    <f4992>   DW_AT_decl_line   : 91
    <f4993>   DW_AT_decl_column : 25
    <f4994>   DW_AT_type        : <0xf489d>
    <f4998>   DW_AT_data_member_location: 80
 <2><f4999>: Abbrev Number: 1 (DW_TAG_member)
    <f499a>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <f499e>   DW_AT_decl_file   : 9
    <f499f>   DW_AT_decl_line   : 92
    <f49a0>   DW_AT_decl_column : 25
    <f49a1>   DW_AT_type        : <0xf48c7>
    <f49a5>   DW_AT_data_member_location: 88
 <2><f49a6>: Abbrev Number: 1 (DW_TAG_member)
    <f49a7>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <f49ab>   DW_AT_decl_file   : 9
    <f49ac>   DW_AT_decl_line   : 93
    <f49ad>   DW_AT_decl_column : 25
    <f49ae>   DW_AT_type        : <0xf4648>
    <f49b2>   DW_AT_data_member_location: 96
 <2><f49b3>: Abbrev Number: 1 (DW_TAG_member)
    <f49b4>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <f49b8>   DW_AT_decl_file   : 9
    <f49b9>   DW_AT_decl_line   : 94
    <f49ba>   DW_AT_decl_column : 25
    <f49bb>   DW_AT_type        : <0xf48f1>
    <f49bf>   DW_AT_data_member_location: 104
 <2><f49c0>: Abbrev Number: 0
 <1><f49c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f49c2>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <f49c6>   DW_AT_decl_file   : 9
    <f49c7>   DW_AT_decl_line   : 95
    <f49c8>   DW_AT_decl_column : 3
    <f49c9>   DW_AT_type        : <0xf48fd>
 <1><f49cd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f49ce>   DW_AT_byte_size   : 8
    <f49ce>   DW_AT_type        : <0xf49c1>
 <1><f49d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f49d3>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <f49d7>   DW_AT_decl_file   : 9
    <f49d8>   DW_AT_decl_line   : 117
    <f49d9>   DW_AT_decl_column : 3
    <f49da>   DW_AT_type        : <0xf4672>
 <1><f49de>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f49df>   DW_AT_byte_size   : 8
    <f49df>   DW_AT_type        : <0xf49d2>
 <1><f49e3>: Abbrev Number: 12 (DW_TAG_subprogram)
    <f49e4>   DW_AT_external    : 1
    <f49e4>   DW_AT_name        : (indirect string, offset: 0x1dc5b): ungetc
    <f49e8>   DW_AT_decl_file   : 10
    <f49e8>   DW_AT_decl_line   : 644
    <f49ea>   DW_AT_decl_column : 12
    <f49ea>   DW_AT_prototyped  : 1
    <f49ea>   DW_AT_type        : <0xf4330>
    <f49ee>   DW_AT_declaration : 1
    <f49ee>   DW_AT_sibling     : <0xf49fd>
 <2><f49f2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49f3>   DW_AT_type        : <0xf4330>
 <2><f49f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49f8>   DW_AT_type        : <0xf45ad>
 <2><f49fc>: Abbrev Number: 0
 <1><f49fd>: Abbrev Number: 12 (DW_TAG_subprogram)
    <f49fe>   DW_AT_external    : 1
    <f49fe>   DW_AT_name        : (indirect string, offset: 0x167e2): getc
    <f4a02>   DW_AT_decl_file   : 10
    <f4a02>   DW_AT_decl_line   : 490
    <f4a04>   DW_AT_decl_column : 12
    <f4a04>   DW_AT_prototyped  : 1
    <f4a04>   DW_AT_type        : <0xf4330>
    <f4a08>   DW_AT_declaration : 1
    <f4a08>   DW_AT_sibling     : <0xf4a12>
 <2><f4a0c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a0d>   DW_AT_type        : <0xf45ad>
 <2><f4a11>: Abbrev Number: 0
 <1><f4a12>: Abbrev Number: 12 (DW_TAG_subprogram)
    <f4a13>   DW_AT_external    : 1
    <f4a13>   DW_AT_name        : (indirect string, offset: 0x16bd4): feof
    <f4a17>   DW_AT_decl_file   : 10
    <f4a17>   DW_AT_decl_line   : 764
    <f4a19>   DW_AT_decl_column : 12
    <f4a19>   DW_AT_prototyped  : 1
    <f4a19>   DW_AT_type        : <0xf4330>
    <f4a1d>   DW_AT_declaration : 1
    <f4a1d>   DW_AT_sibling     : <0xf4a27>
 <2><f4a21>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a22>   DW_AT_type        : <0xf45ad>
 <2><f4a26>: Abbrev Number: 0
 <1><f4a27>: Abbrev Number: 25 (DW_TAG_subprogram)
    <f4a28>   DW_AT_external    : 1
    <f4a28>   DW_AT_name        : (indirect string, offset: 0x1d6a4): ftello
    <f4a2c>   DW_AT_decl_file   : 10
    <f4a2d>   DW_AT_decl_line   : 723
    <f4a2f>   DW_AT_decl_column : 18
    <f4a30>   DW_AT_linkage_name: (indirect string, offset: 0x1d691): ftello64
    <f4a34>   DW_AT_prototyped  : 1
    <f4a34>   DW_AT_type        : <0xf434a>
    <f4a38>   DW_AT_declaration : 1
    <f4a38>   DW_AT_sibling     : <0xf4a42>
 <2><f4a3c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a3d>   DW_AT_type        : <0xf45ad>
 <2><f4a41>: Abbrev Number: 0
 <1><f4a42>: Abbrev Number: 26 (DW_TAG_subprogram)
    <f4a43>   DW_AT_external    : 1
    <f4a43>   DW_AT_name        : (indirect string, offset: 0x1d53a): fb_DevFileEof
    <f4a47>   DW_AT_decl_file   : 1
    <f4a48>   DW_AT_decl_line   : 5
    <f4a49>   DW_AT_decl_column : 5
    <f4a4a>   DW_AT_prototyped  : 1
    <f4a4a>   DW_AT_type        : <0xf4330>
    <f4a4e>   DW_AT_low_pc      : 0x47b9b0
    <f4a56>   DW_AT_high_pc     : 0x77
    <f4a5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4a60>   DW_AT_call_all_calls: 1
 <2><f4a60>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <f4a61>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <f4a65>   DW_AT_decl_file   : 1
    <f4a66>   DW_AT_decl_line   : 5
    <f4a67>   DW_AT_decl_column : 29
    <f4a68>   DW_AT_type        : <0xf49de>
    <f4a6c>   DW_AT_location    : 0x44fbf (location list)
    <f4a70>   DW_AT_GNU_locviews: 0x44fb1
 <2><f4a74>: Abbrev Number: 13 (DW_TAG_variable)
    <f4a75>   DW_AT_name        : fp
    <f4a78>   DW_AT_decl_file   : 1
    <f4a78>   DW_AT_decl_line   : 7
    <f4a79>   DW_AT_decl_column : 11
    <f4a7a>   DW_AT_type        : <0xf45ad>
    <f4a7e>   DW_AT_location    : 0x44ff4 (location list)
    <f4a82>   DW_AT_GNU_locviews: 0x44fec
 <2><f4a86>: Abbrev Number: 13 (DW_TAG_variable)
    <f4a87>   DW_AT_name        : eof
    <f4a8b>   DW_AT_decl_file   : 1
    <f4a8b>   DW_AT_decl_line   : 18
    <f4a8c>   DW_AT_decl_column : 6
    <f4a8d>   DW_AT_type        : <0xf4330>
    <f4a91>   DW_AT_location    : 0x45013 (location list)
    <f4a95>   DW_AT_GNU_locviews: 0x45009
 <2><f4a99>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <f4a9a>   DW_AT_low_pc      : 0x47ba00
    <f4aa2>   DW_AT_high_pc     : 0x1c
    <f4aaa>   DW_AT_sibling     : <0xf4aec>
 <3><f4aae>: Abbrev Number: 13 (DW_TAG_variable)
    <f4aaf>   DW_AT_name        : c
    <f4ab1>   DW_AT_decl_file   : 1
    <f4ab1>   DW_AT_decl_line   : 38
    <f4ab2>   DW_AT_decl_column : 8
    <f4ab3>   DW_AT_type        : <0xf4330>
    <f4ab7>   DW_AT_location    : 0x4503d (location list)
    <f4abb>   DW_AT_GNU_locviews: 0x4503b
 <3><f4abf>: Abbrev Number: 16 (DW_TAG_call_site)
    <f4ac0>   DW_AT_call_return_pc: 0x47ba0a
    <f4ac8>   DW_AT_call_origin : <0xf49fd>
    <f4acc>   DW_AT_sibling     : <0xf4ad7>
 <4><f4ad0>: Abbrev Number: 14 (DW_TAG_call_site_parameter)
    <f4ad1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4ad3>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><f4ad6>: Abbrev Number: 0
 <3><f4ad7>: Abbrev Number: 29 (DW_TAG_call_site)
    <f4ad8>   DW_AT_call_return_pc: 0x47ba1c
    <f4ae0>   DW_AT_call_origin : <0xf49e3>
 <4><f4ae4>: Abbrev Number: 14 (DW_TAG_call_site_parameter)
    <f4ae5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4ae7>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><f4aea>: Abbrev Number: 0
 <3><f4aeb>: Abbrev Number: 0
 <2><f4aec>: Abbrev Number: 16 (DW_TAG_call_site)
    <f4aed>   DW_AT_call_return_pc: 0x47b9cf
    <f4af5>   DW_AT_call_origin : <0xf4a12>
    <f4af9>   DW_AT_sibling     : <0xf4b04>
 <3><f4afd>: Abbrev Number: 14 (DW_TAG_call_site_parameter)
    <f4afe>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4b00>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4b03>: Abbrev Number: 0
 <2><f4b04>: Abbrev Number: 30 (DW_TAG_call_site)
    <f4b05>   DW_AT_call_return_pc: 0x47b9e5
    <f4b0d>   DW_AT_call_origin : <0xf4a27>
 <2><f4b11>: Abbrev Number: 0
 <1><f4b12>: Abbrev Number: 0
  Compilation Unit @ offset 0xf4b13:
   Length:        0x847 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1af81
   Pointer Size:  8
 <0><f4b1f>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <f4b20>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <f4b24>   DW_AT_language    : 29	(C11)
    <f4b25>   DW_AT_name        : (indirect line string, offset: 0x1aab): src/rtlib/dev_file_flush.c
    <f4b29>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <f4b2d>   DW_AT_low_pc      : 0x47ba30
    <f4b35>   DW_AT_high_pc     : 0x4a
    <f4b3d>   DW_AT_stmt_list   : 0x718dc
 <1><f4b41>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b42>   DW_AT_byte_size   : 1
    <f4b43>   DW_AT_encoding    : 8	(unsigned char)
    <f4b44>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f4b48>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b49>   DW_AT_byte_size   : 2
    <f4b4a>   DW_AT_encoding    : 7	(unsigned)
    <f4b4b>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f4b4f>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b50>   DW_AT_byte_size   : 4
    <f4b51>   DW_AT_encoding    : 7	(unsigned)
    <f4b52>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f4b56>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b57>   DW_AT_byte_size   : 8
    <f4b58>   DW_AT_encoding    : 7	(unsigned)
    <f4b59>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f4b5d>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b5e>   DW_AT_byte_size   : 1
    <f4b5f>   DW_AT_encoding    : 6	(signed char)
    <f4b60>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f4b64>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b65>   DW_AT_byte_size   : 2
    <f4b66>   DW_AT_encoding    : 5	(signed)
    <f4b67>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f4b6b>: Abbrev Number: 18 (DW_TAG_base_type)
    <f4b6c>   DW_AT_byte_size   : 4
    <f4b6d>   DW_AT_encoding    : 5	(signed)
    <f4b6e>   DW_AT_name        : int
 <1><f4b72>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4b73>   DW_AT_byte_size   : 8
    <f4b74>   DW_AT_encoding    : 5	(signed)
    <f4b75>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f4b79>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4b7a>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <f4b7e>   DW_AT_decl_file   : 2
    <f4b7f>   DW_AT_decl_line   : 152
    <f4b80>   DW_AT_decl_column : 25
    <f4b81>   DW_AT_type        : <0xf4b72>
 <1><f4b85>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4b86>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f4b8a>   DW_AT_decl_file   : 2
    <f4b8b>   DW_AT_decl_line   : 153
    <f4b8c>   DW_AT_decl_column : 27
    <f4b8d>   DW_AT_type        : <0xf4b72>
 <1><f4b91>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <f4b92>   DW_AT_byte_size   : 8
 <1><f4b93>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4b94>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <f4b98>   DW_AT_decl_file   : 2
    <f4b99>   DW_AT_decl_line   : 194
    <f4b9a>   DW_AT_decl_column : 27
    <f4b9b>   DW_AT_type        : <0xf4b72>
 <1><f4b9f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4ba0>   DW_AT_byte_size   : 8
    <f4ba0>   DW_AT_type        : <0xf4ba4>
 <1><f4ba4>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4ba5>   DW_AT_byte_size   : 1
    <f4ba6>   DW_AT_encoding    : 6	(signed char)
    <f4ba7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f4bab>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4bac>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f4bb0>   DW_AT_decl_file   : 3
    <f4bb1>   DW_AT_decl_line   : 209
    <f4bb2>   DW_AT_decl_column : 23
    <f4bb3>   DW_AT_type        : <0xf4b56>
 <1><f4bb7>: Abbrev Number: 20 (DW_TAG_typedef)
    <f4bb8>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <f4bbc>   DW_AT_decl_file   : 3
    <f4bbd>   DW_AT_decl_line   : 321
    <f4bbf>   DW_AT_decl_column : 24
    <f4bc0>   DW_AT_type        : <0xf4b6b>
 <1><f4bc4>: Abbrev Number: 21 (DW_TAG_const_type)
    <f4bc5>   DW_AT_type        : <0xf4bb7>
 <1><f4bc9>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4bca>   DW_AT_byte_size   : 8
    <f4bcb>   DW_AT_encoding    : 5	(signed)
    <f4bcc>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f4bd0>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4bd1>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <f4bd5>   DW_AT_decl_file   : 4
    <f4bd6>   DW_AT_decl_line   : 87
    <f4bd7>   DW_AT_decl_column : 19
    <f4bd8>   DW_AT_type        : <0xf4b85>
 <1><f4bdc>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4bdd>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <f4be1>   DW_AT_decl_file   : 4
    <f4be2>   DW_AT_decl_line   : 108
    <f4be3>   DW_AT_decl_column : 19
    <f4be4>   DW_AT_type        : <0xf4b93>
 <1><f4be8>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4be9>   DW_AT_byte_size   : 8
    <f4bea>   DW_AT_encoding    : 7	(unsigned)
    <f4beb>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f4bef>: Abbrev Number: 9 (DW_TAG_array_type)
    <f4bf0>   DW_AT_type        : <0xf4ba4>
    <f4bf4>   DW_AT_sibling     : <0xf4bff>
 <2><f4bf8>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f4bf9>   DW_AT_type        : <0xf4b56>
    <f4bfd>   DW_AT_upper_bound : 3
 <2><f4bfe>: Abbrev Number: 0
 <1><f4bff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4c00>   DW_AT_byte_size   : 8
    <f4c00>   DW_AT_type        : <0xf4c04>
 <1><f4c04>: Abbrev Number: 22 (DW_TAG_const_type)
 <1><f4c05>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f4c06>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <f4c0a>   DW_AT_byte_size   : 216
    <f4c0b>   DW_AT_decl_file   : 5
    <f4c0c>   DW_AT_decl_line   : 49
    <f4c0d>   DW_AT_decl_column : 8
    <f4c0e>   DW_AT_sibling     : <0xf4d8c>
 <2><f4c12>: Abbrev Number: 1 (DW_TAG_member)
    <f4c13>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <f4c17>   DW_AT_decl_file   : 5
    <f4c18>   DW_AT_decl_line   : 51
    <f4c19>   DW_AT_decl_column : 7
    <f4c1a>   DW_AT_type        : <0xf4b6b>
    <f4c1e>   DW_AT_data_member_location: 0
 <2><f4c1f>: Abbrev Number: 1 (DW_TAG_member)
    <f4c20>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <f4c24>   DW_AT_decl_file   : 5
    <f4c25>   DW_AT_decl_line   : 54
    <f4c26>   DW_AT_decl_column : 9
    <f4c27>   DW_AT_type        : <0xf4b9f>
    <f4c2b>   DW_AT_data_member_location: 8
 <2><f4c2c>: Abbrev Number: 1 (DW_TAG_member)
    <f4c2d>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <f4c31>   DW_AT_decl_file   : 5
    <f4c32>   DW_AT_decl_line   : 55
    <f4c33>   DW_AT_decl_column : 9
    <f4c34>   DW_AT_type        : <0xf4b9f>
    <f4c38>   DW_AT_data_member_location: 16
 <2><f4c39>: Abbrev Number: 1 (DW_TAG_member)
    <f4c3a>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <f4c3e>   DW_AT_decl_file   : 5
    <f4c3f>   DW_AT_decl_line   : 56
    <f4c40>   DW_AT_decl_column : 9
    <f4c41>   DW_AT_type        : <0xf4b9f>
    <f4c45>   DW_AT_data_member_location: 24
 <2><f4c46>: Abbrev Number: 1 (DW_TAG_member)
    <f4c47>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <f4c4b>   DW_AT_decl_file   : 5
    <f4c4c>   DW_AT_decl_line   : 57
    <f4c4d>   DW_AT_decl_column : 9
    <f4c4e>   DW_AT_type        : <0xf4b9f>
    <f4c52>   DW_AT_data_member_location: 32
 <2><f4c53>: Abbrev Number: 1 (DW_TAG_member)
    <f4c54>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <f4c58>   DW_AT_decl_file   : 5
    <f4c59>   DW_AT_decl_line   : 58
    <f4c5a>   DW_AT_decl_column : 9
    <f4c5b>   DW_AT_type        : <0xf4b9f>
    <f4c5f>   DW_AT_data_member_location: 40
 <2><f4c60>: Abbrev Number: 1 (DW_TAG_member)
    <f4c61>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <f4c65>   DW_AT_decl_file   : 5
    <f4c66>   DW_AT_decl_line   : 59
    <f4c67>   DW_AT_decl_column : 9
    <f4c68>   DW_AT_type        : <0xf4b9f>
    <f4c6c>   DW_AT_data_member_location: 48
 <2><f4c6d>: Abbrev Number: 1 (DW_TAG_member)
    <f4c6e>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <f4c72>   DW_AT_decl_file   : 5
    <f4c73>   DW_AT_decl_line   : 60
    <f4c74>   DW_AT_decl_column : 9
    <f4c75>   DW_AT_type        : <0xf4b9f>
    <f4c79>   DW_AT_data_member_location: 56
 <2><f4c7a>: Abbrev Number: 1 (DW_TAG_member)
    <f4c7b>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <f4c7f>   DW_AT_decl_file   : 5
    <f4c80>   DW_AT_decl_line   : 61
    <f4c81>   DW_AT_decl_column : 9
    <f4c82>   DW_AT_type        : <0xf4b9f>
    <f4c86>   DW_AT_data_member_location: 64
 <2><f4c87>: Abbrev Number: 1 (DW_TAG_member)
    <f4c88>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <f4c8c>   DW_AT_decl_file   : 5
    <f4c8d>   DW_AT_decl_line   : 64
    <f4c8e>   DW_AT_decl_column : 9
    <f4c8f>   DW_AT_type        : <0xf4b9f>
    <f4c93>   DW_AT_data_member_location: 72
 <2><f4c94>: Abbrev Number: 1 (DW_TAG_member)
    <f4c95>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <f4c99>   DW_AT_decl_file   : 5
    <f4c9a>   DW_AT_decl_line   : 65
    <f4c9b>   DW_AT_decl_column : 9
    <f4c9c>   DW_AT_type        : <0xf4b9f>
    <f4ca0>   DW_AT_data_member_location: 80
 <2><f4ca1>: Abbrev Number: 1 (DW_TAG_member)
    <f4ca2>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <f4ca6>   DW_AT_decl_file   : 5
    <f4ca7>   DW_AT_decl_line   : 66
    <f4ca8>   DW_AT_decl_column : 9
    <f4ca9>   DW_AT_type        : <0xf4b9f>
    <f4cad>   DW_AT_data_member_location: 88
 <2><f4cae>: Abbrev Number: 1 (DW_TAG_member)
    <f4caf>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <f4cb3>   DW_AT_decl_file   : 5
    <f4cb4>   DW_AT_decl_line   : 68
    <f4cb5>   DW_AT_decl_column : 22
    <f4cb6>   DW_AT_type        : <0xf4da5>
    <f4cba>   DW_AT_data_member_location: 96
 <2><f4cbb>: Abbrev Number: 1 (DW_TAG_member)
    <f4cbc>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <f4cc0>   DW_AT_decl_file   : 5
    <f4cc1>   DW_AT_decl_line   : 70
    <f4cc2>   DW_AT_decl_column : 20
    <f4cc3>   DW_AT_type        : <0xf4daa>
    <f4cc7>   DW_AT_data_member_location: 104
 <2><f4cc8>: Abbrev Number: 1 (DW_TAG_member)
    <f4cc9>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <f4ccd>   DW_AT_decl_file   : 5
    <f4cce>   DW_AT_decl_line   : 72
    <f4ccf>   DW_AT_decl_column : 7
    <f4cd0>   DW_AT_type        : <0xf4b6b>
    <f4cd4>   DW_AT_data_member_location: 112
 <2><f4cd5>: Abbrev Number: 1 (DW_TAG_member)
    <f4cd6>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <f4cda>   DW_AT_decl_file   : 5
    <f4cdb>   DW_AT_decl_line   : 73
    <f4cdc>   DW_AT_decl_column : 7
    <f4cdd>   DW_AT_type        : <0xf4b6b>
    <f4ce1>   DW_AT_data_member_location: 116
 <2><f4ce2>: Abbrev Number: 1 (DW_TAG_member)
    <f4ce3>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <f4ce7>   DW_AT_decl_file   : 5
    <f4ce8>   DW_AT_decl_line   : 74
    <f4ce9>   DW_AT_decl_column : 11
    <f4cea>   DW_AT_type        : <0xf4b79>
    <f4cee>   DW_AT_data_member_location: 120
 <2><f4cef>: Abbrev Number: 1 (DW_TAG_member)
    <f4cf0>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <f4cf4>   DW_AT_decl_file   : 5
    <f4cf5>   DW_AT_decl_line   : 77
    <f4cf6>   DW_AT_decl_column : 18
    <f4cf7>   DW_AT_type        : <0xf4b48>
    <f4cfb>   DW_AT_data_member_location: 128
 <2><f4cfc>: Abbrev Number: 1 (DW_TAG_member)
    <f4cfd>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <f4d01>   DW_AT_decl_file   : 5
    <f4d02>   DW_AT_decl_line   : 78
    <f4d03>   DW_AT_decl_column : 15
    <f4d04>   DW_AT_type        : <0xf4b5d>
    <f4d08>   DW_AT_data_member_location: 130
 <2><f4d09>: Abbrev Number: 1 (DW_TAG_member)
    <f4d0a>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <f4d0e>   DW_AT_decl_file   : 5
    <f4d0f>   DW_AT_decl_line   : 79
    <f4d10>   DW_AT_decl_column : 8
    <f4d11>   DW_AT_type        : <0xf4daf>
    <f4d15>   DW_AT_data_member_location: 131
 <2><f4d16>: Abbrev Number: 1 (DW_TAG_member)
    <f4d17>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <f4d1b>   DW_AT_decl_file   : 5
    <f4d1c>   DW_AT_decl_line   : 81
    <f4d1d>   DW_AT_decl_column : 15
    <f4d1e>   DW_AT_type        : <0xf4dbf>
    <f4d22>   DW_AT_data_member_location: 136
 <2><f4d23>: Abbrev Number: 1 (DW_TAG_member)
    <f4d24>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <f4d28>   DW_AT_decl_file   : 5
    <f4d29>   DW_AT_decl_line   : 89
    <f4d2a>   DW_AT_decl_column : 13
    <f4d2b>   DW_AT_type        : <0xf4b85>
    <f4d2f>   DW_AT_data_member_location: 144
 <2><f4d30>: Abbrev Number: 1 (DW_TAG_member)
    <f4d31>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <f4d35>   DW_AT_decl_file   : 5
    <f4d36>   DW_AT_decl_line   : 91
    <f4d37>   DW_AT_decl_column : 23
    <f4d38>   DW_AT_type        : <0xf4dc9>
    <f4d3c>   DW_AT_data_member_location: 152
 <2><f4d3d>: Abbrev Number: 1 (DW_TAG_member)
    <f4d3e>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <f4d42>   DW_AT_decl_file   : 5
    <f4d43>   DW_AT_decl_line   : 92
    <f4d44>   DW_AT_decl_column : 25
    <f4d45>   DW_AT_type        : <0xf4dd3>
    <f4d49>   DW_AT_data_member_location: 160
 <2><f4d4a>: Abbrev Number: 1 (DW_TAG_member)
    <f4d4b>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <f4d4f>   DW_AT_decl_file   : 5
    <f4d50>   DW_AT_decl_line   : 93
    <f4d51>   DW_AT_decl_column : 20
    <f4d52>   DW_AT_type        : <0xf4daa>
    <f4d56>   DW_AT_data_member_location: 168
 <2><f4d57>: Abbrev Number: 1 (DW_TAG_member)
    <f4d58>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <f4d5c>   DW_AT_decl_file   : 5
    <f4d5d>   DW_AT_decl_line   : 94
    <f4d5e>   DW_AT_decl_column : 9
    <f4d5f>   DW_AT_type        : <0xf4b91>
    <f4d63>   DW_AT_data_member_location: 176
 <2><f4d64>: Abbrev Number: 1 (DW_TAG_member)
    <f4d65>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <f4d69>   DW_AT_decl_file   : 5
    <f4d6a>   DW_AT_decl_line   : 95
    <f4d6b>   DW_AT_decl_column : 10
    <f4d6c>   DW_AT_type        : <0xf4bab>
    <f4d70>   DW_AT_data_member_location: 184
 <2><f4d71>: Abbrev Number: 1 (DW_TAG_member)
    <f4d72>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <f4d76>   DW_AT_decl_file   : 5
    <f4d77>   DW_AT_decl_line   : 96
    <f4d78>   DW_AT_decl_column : 7
    <f4d79>   DW_AT_type        : <0xf4b6b>
    <f4d7d>   DW_AT_data_member_location: 192
 <2><f4d7e>: Abbrev Number: 1 (DW_TAG_member)
    <f4d7f>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <f4d83>   DW_AT_decl_file   : 5
    <f4d84>   DW_AT_decl_line   : 98
    <f4d85>   DW_AT_decl_column : 8
    <f4d86>   DW_AT_type        : <0xf4dd8>
    <f4d8a>   DW_AT_data_member_location: 196
 <2><f4d8b>: Abbrev Number: 0
 <1><f4d8c>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4d8d>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <f4d91>   DW_AT_decl_file   : 6
    <f4d92>   DW_AT_decl_line   : 7
    <f4d93>   DW_AT_decl_column : 25
    <f4d94>   DW_AT_type        : <0xf4c05>
 <1><f4d98>: Abbrev Number: 23 (DW_TAG_typedef)
    <f4d99>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <f4d9d>   DW_AT_decl_file   : 5
    <f4d9e>   DW_AT_decl_line   : 43
    <f4d9f>   DW_AT_decl_column : 14
 <1><f4da0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f4da1>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <f4da5>   DW_AT_declaration : 1
 <1><f4da5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4da6>   DW_AT_byte_size   : 8
    <f4da6>   DW_AT_type        : <0xf4da0>
 <1><f4daa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4dab>   DW_AT_byte_size   : 8
    <f4dab>   DW_AT_type        : <0xf4c05>
 <1><f4daf>: Abbrev Number: 9 (DW_TAG_array_type)
    <f4db0>   DW_AT_type        : <0xf4ba4>
    <f4db4>   DW_AT_sibling     : <0xf4dbf>
 <2><f4db8>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f4db9>   DW_AT_type        : <0xf4b56>
    <f4dbd>   DW_AT_upper_bound : 0
 <2><f4dbe>: Abbrev Number: 0
 <1><f4dbf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4dc0>   DW_AT_byte_size   : 8
    <f4dc0>   DW_AT_type        : <0xf4d98>
 <1><f4dc4>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f4dc5>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <f4dc9>   DW_AT_declaration : 1
 <1><f4dc9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4dca>   DW_AT_byte_size   : 8
    <f4dca>   DW_AT_type        : <0xf4dc4>
 <1><f4dce>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f4dcf>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <f4dd3>   DW_AT_declaration : 1
 <1><f4dd3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4dd4>   DW_AT_byte_size   : 8
    <f4dd4>   DW_AT_type        : <0xf4dce>
 <1><f4dd8>: Abbrev Number: 9 (DW_TAG_array_type)
    <f4dd9>   DW_AT_type        : <0xf4ba4>
    <f4ddd>   DW_AT_sibling     : <0xf4de8>
 <2><f4de1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f4de2>   DW_AT_type        : <0xf4b56>
    <f4de6>   DW_AT_upper_bound : 19
 <2><f4de7>: Abbrev Number: 0
 <1><f4de8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4de9>   DW_AT_byte_size   : 8
    <f4de9>   DW_AT_type        : <0xf4d8c>
 <1><f4ded>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4dee>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <f4df2>   DW_AT_decl_file   : 7
    <f4df3>   DW_AT_decl_line   : 22
    <f4df4>   DW_AT_decl_column : 15
    <f4df5>   DW_AT_type        : <0xf4bd0>
 <1><f4df9>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <f4dfa>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <f4dfe>   DW_AT_encoding    : 7	(void)
    <f4dfe>   DW_AT_byte_size   : 4
    <f4dfe>   DW_AT_type        : <0xf4b4f>
    <f4e02>   DW_AT_decl_file   : 9
    <f4e03>   DW_AT_decl_line   : 1
    <f4e04>   DW_AT_decl_column : 14
    <f4e04>   DW_AT_sibling     : <0xf4e7b>
 <2><f4e08>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e09>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <f4e0d>   DW_AT_const_value : 0
 <2><f4e0e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e0f>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <f4e13>   DW_AT_const_value : 1
 <2><f4e14>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e15>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <f4e19>   DW_AT_const_value : 2
 <2><f4e1a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e1b>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <f4e1f>   DW_AT_const_value : 3
 <2><f4e20>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e21>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <f4e25>   DW_AT_const_value : 4
 <2><f4e26>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e27>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <f4e2b>   DW_AT_const_value : 5
 <2><f4e2c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e2d>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <f4e31>   DW_AT_const_value : 6
 <2><f4e32>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e33>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <f4e37>   DW_AT_const_value : 7
 <2><f4e38>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e39>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <f4e3d>   DW_AT_const_value : 8
 <2><f4e3e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e3f>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <f4e43>   DW_AT_const_value : 9
 <2><f4e44>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e45>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <f4e49>   DW_AT_const_value : 10
 <2><f4e4a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e4b>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <f4e4f>   DW_AT_const_value : 11
 <2><f4e50>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e51>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <f4e55>   DW_AT_const_value : 12
 <2><f4e56>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e57>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <f4e5b>   DW_AT_const_value : 13
 <2><f4e5c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e5d>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <f4e61>   DW_AT_const_value : 14
 <2><f4e62>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e63>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <f4e67>   DW_AT_const_value : 15
 <2><f4e68>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e69>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <f4e6d>   DW_AT_const_value : 16
 <2><f4e6e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e6f>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <f4e73>   DW_AT_const_value : 17
 <2><f4e74>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4e75>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <f4e79>   DW_AT_const_value : 18
 <2><f4e7a>: Abbrev Number: 0
 <1><f4e7b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f4e7c>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <f4e80>   DW_AT_byte_size   : 24
    <f4e81>   DW_AT_decl_file   : 8
    <f4e82>   DW_AT_decl_line   : 82
    <f4e83>   DW_AT_decl_column : 16
    <f4e84>   DW_AT_sibling     : <0xf4eaf>
 <2><f4e88>: Abbrev Number: 1 (DW_TAG_member)
    <f4e89>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <f4e8d>   DW_AT_decl_file   : 8
    <f4e8e>   DW_AT_decl_line   : 83
    <f4e8f>   DW_AT_decl_column : 21
    <f4e90>   DW_AT_type        : <0xf4b9f>
    <f4e94>   DW_AT_data_member_location: 0
 <2><f4e95>: Abbrev Number: 14 (DW_TAG_member)
    <f4e96>   DW_AT_name        : len
    <f4e9a>   DW_AT_decl_file   : 8
    <f4e9b>   DW_AT_decl_line   : 84
    <f4e9c>   DW_AT_decl_column : 21
    <f4e9c>   DW_AT_type        : <0xf4bdc>
    <f4ea0>   DW_AT_data_member_location: 8
 <2><f4ea1>: Abbrev Number: 1 (DW_TAG_member)
    <f4ea2>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f4ea6>   DW_AT_decl_file   : 8
    <f4ea7>   DW_AT_decl_line   : 85
    <f4ea8>   DW_AT_decl_column : 21
    <f4ea9>   DW_AT_type        : <0xf4bdc>
    <f4ead>   DW_AT_data_member_location: 16
 <2><f4eae>: Abbrev Number: 0
 <1><f4eaf>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4eb0>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <f4eb4>   DW_AT_decl_file   : 8
    <f4eb5>   DW_AT_decl_line   : 86
    <f4eb6>   DW_AT_decl_column : 3
    <f4eb7>   DW_AT_type        : <0xf4e7b>
 <1><f4ebb>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4ebc>   DW_AT_byte_size   : 8
    <f4ebd>   DW_AT_encoding    : 4	(float)
    <f4ebe>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><f4ec2>: Abbrev Number: 6 (DW_TAG_base_type)
    <f4ec3>   DW_AT_byte_size   : 4
    <f4ec4>   DW_AT_encoding    : 4	(float)
    <f4ec5>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><f4ec9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4eca>   DW_AT_byte_size   : 8
    <f4eca>   DW_AT_type        : <0xf4bb7>
 <1><f4ece>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <f4ecf>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <f4ed3>   DW_AT_encoding    : 7	(void)
    <f4ed3>   DW_AT_byte_size   : 4
    <f4ed3>   DW_AT_type        : <0xf4b4f>
    <f4ed7>   DW_AT_decl_file   : 10
    <f4ed8>   DW_AT_decl_line   : 25
    <f4ed9>   DW_AT_decl_column : 14
    <f4ed9>   DW_AT_sibling     : <0xf4ef6>
 <2><f4edd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4ede>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <f4ee2>   DW_AT_const_value : 0
 <2><f4ee3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4ee4>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <f4ee8>   DW_AT_const_value : 1
 <2><f4ee9>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4eea>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <f4eee>   DW_AT_const_value : 2
 <2><f4eef>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f4ef0>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <f4ef4>   DW_AT_const_value : 3
 <2><f4ef5>: Abbrev Number: 0
 <1><f4ef6>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4ef7>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <f4efb>   DW_AT_decl_file   : 10
    <f4efc>   DW_AT_decl_line   : 30
    <f4efd>   DW_AT_decl_column : 3
    <f4efe>   DW_AT_type        : <0xf4ece>
 <1><f4f02>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4f03>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <f4f07>   DW_AT_decl_file   : 10
    <f4f08>   DW_AT_decl_line   : 54
    <f4f09>   DW_AT_decl_column : 15
    <f4f0a>   DW_AT_type        : <0xf4f0e>
 <1><f4f0e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4f0f>   DW_AT_byte_size   : 8
    <f4f0f>   DW_AT_type        : <0xf4f13>
 <1><f4f13>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f4f14>   DW_AT_prototyped  : 1
    <f4f14>   DW_AT_type        : <0xf4b6b>
    <f4f18>   DW_AT_sibling     : <0xf4f27>
 <2><f4f1c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4f1d>   DW_AT_type        : <0xf4f27>
 <2><f4f21>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4f22>   DW_AT_type        : <0xf4b6b>
 <2><f4f26>: Abbrev Number: 0
 <1><f4f27>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4f28>   DW_AT_byte_size   : 8
    <f4f28>   DW_AT_type        : <0xf4f2c>
 <1><f4f2c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f4f2d>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <f4f31>   DW_AT_byte_size   : 80
    <f4f32>   DW_AT_decl_file   : 10
    <f4f33>   DW_AT_decl_line   : 97
    <f4f34>   DW_AT_decl_column : 16
    <f4f35>   DW_AT_sibling     : <0xf4fef>
 <2><f4f39>: Abbrev Number: 1 (DW_TAG_member)
    <f4f3a>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <f4f3e>   DW_AT_decl_file   : 10
    <f4f3f>   DW_AT_decl_line   : 98
    <f4f40>   DW_AT_decl_column : 21
    <f4f41>   DW_AT_type        : <0xf4b6b>
    <f4f45>   DW_AT_data_member_location: 0
 <2><f4f46>: Abbrev Number: 14 (DW_TAG_member)
    <f4f47>   DW_AT_name        : len
    <f4f4b>   DW_AT_decl_file   : 10
    <f4f4c>   DW_AT_decl_line   : 99
    <f4f4d>   DW_AT_decl_column : 21
    <f4f4d>   DW_AT_type        : <0xf4b6b>
    <f4f51>   DW_AT_data_member_location: 4
 <2><f4f52>: Abbrev Number: 1 (DW_TAG_member)
    <f4f53>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <f4f57>   DW_AT_decl_file   : 10
    <f4f58>   DW_AT_decl_line   : 100
    <f4f59>   DW_AT_decl_column : 21
    <f4f5a>   DW_AT_type        : <0xf4ef6>
    <f4f5e>   DW_AT_data_member_location: 8
 <2><f4f5f>: Abbrev Number: 1 (DW_TAG_member)
    <f4f60>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f4f64>   DW_AT_decl_file   : 10
    <f4f65>   DW_AT_decl_line   : 101
    <f4f66>   DW_AT_decl_column : 21
    <f4f67>   DW_AT_type        : <0xf4ded>
    <f4f6b>   DW_AT_data_member_location: 16
 <2><f4f6c>: Abbrev Number: 1 (DW_TAG_member)
    <f4f6d>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f4f71>   DW_AT_decl_file   : 10
    <f4f72>   DW_AT_decl_line   : 102
    <f4f73>   DW_AT_decl_column : 21
    <f4f74>   DW_AT_type        : <0xf4b6b>
    <f4f78>   DW_AT_data_member_location: 24
 <2><f4f79>: Abbrev Number: 1 (DW_TAG_member)
    <f4f7a>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <f4f7e>   DW_AT_decl_file   : 10
    <f4f7f>   DW_AT_decl_line   : 103
    <f4f80>   DW_AT_decl_column : 21
    <f4f81>   DW_AT_type        : <0xf4b6b>
    <f4f85>   DW_AT_data_member_location: 28
 <2><f4f86>: Abbrev Number: 1 (DW_TAG_member)
    <f4f87>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <f4f8b>   DW_AT_decl_file   : 10
    <f4f8c>   DW_AT_decl_line   : 104
    <f4f8d>   DW_AT_decl_column : 21
    <f4f8e>   DW_AT_type        : <0xf4b6b>
    <f4f92>   DW_AT_data_member_location: 32
 <2><f4f93>: Abbrev Number: 1 (DW_TAG_member)
    <f4f94>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <f4f98>   DW_AT_decl_file   : 10
    <f4f99>   DW_AT_decl_line   : 105
    <f4f9a>   DW_AT_decl_column : 21
    <f4f9b>   DW_AT_type        : <0xf4b4f>
    <f4f9f>   DW_AT_data_member_location: 36
 <2><f4fa0>: Abbrev Number: 1 (DW_TAG_member)
    <f4fa1>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <f4fa5>   DW_AT_decl_file   : 10
    <f4fa6>   DW_AT_decl_line   : 106
    <f4fa7>   DW_AT_decl_column : 21
    <f4fa8>   DW_AT_type        : <0xf4b4f>
    <f4fac>   DW_AT_data_member_location: 40
 <2><f4fad>: Abbrev Number: 1 (DW_TAG_member)
    <f4fae>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <f4fb2>   DW_AT_decl_file   : 10
    <f4fb3>   DW_AT_decl_line   : 109
    <f4fb4>   DW_AT_decl_column : 21
    <f4fb5>   DW_AT_type        : <0xf4bef>
    <f4fb9>   DW_AT_data_member_location: 44
 <2><f4fba>: Abbrev Number: 1 (DW_TAG_member)
    <f4fbb>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <f4fbf>   DW_AT_decl_file   : 10
    <f4fc0>   DW_AT_decl_line   : 110
    <f4fc1>   DW_AT_decl_column : 21
    <f4fc2>   DW_AT_type        : <0xf4bab>
    <f4fc6>   DW_AT_data_member_location: 48
 <2><f4fc7>: Abbrev Number: 1 (DW_TAG_member)
    <f4fc8>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f4fcc>   DW_AT_decl_file   : 10
    <f4fcd>   DW_AT_decl_line   : 112
    <f4fce>   DW_AT_decl_column : 22
    <f4fcf>   DW_AT_type        : <0xf5287>
    <f4fd3>   DW_AT_data_member_location: 56
 <2><f4fd4>: Abbrev Number: 1 (DW_TAG_member)
    <f4fd5>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <f4fd9>   DW_AT_decl_file   : 10
    <f4fda>   DW_AT_decl_line   : 114
    <f4fdb>   DW_AT_decl_column : 14
    <f4fdc>   DW_AT_type        : <0xf4b91>
    <f4fe0>   DW_AT_data_member_location: 64
 <2><f4fe1>: Abbrev Number: 1 (DW_TAG_member)
    <f4fe2>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <f4fe6>   DW_AT_decl_file   : 10
    <f4fe7>   DW_AT_decl_line   : 116
    <f4fe8>   DW_AT_decl_column : 22
    <f4fe9>   DW_AT_type        : <0xf4f27>
    <f4fed>   DW_AT_data_member_location: 72
 <2><f4fee>: Abbrev Number: 0
 <1><f4fef>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4ff0>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <f4ff4>   DW_AT_decl_file   : 10
    <f4ff5>   DW_AT_decl_line   : 59
    <f4ff6>   DW_AT_decl_column : 15
    <f4ff7>   DW_AT_type        : <0xf4ffb>
 <1><f4ffb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f4ffc>   DW_AT_byte_size   : 8
    <f4ffc>   DW_AT_type        : <0xf5000>
 <1><f5000>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5001>   DW_AT_prototyped  : 1
    <f5001>   DW_AT_type        : <0xf4b6b>
    <f5005>   DW_AT_sibling     : <0xf500f>
 <2><f5009>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f500a>   DW_AT_type        : <0xf4f27>
 <2><f500e>: Abbrev Number: 0
 <1><f500f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5010>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <f5014>   DW_AT_decl_file   : 10
    <f5015>   DW_AT_decl_line   : 60
    <f5016>   DW_AT_decl_column : 15
    <f5017>   DW_AT_type        : <0xf4ffb>
 <1><f501b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f501c>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <f5020>   DW_AT_decl_file   : 10
    <f5021>   DW_AT_decl_line   : 61
    <f5022>   DW_AT_decl_column : 15
    <f5023>   DW_AT_type        : <0xf5027>
 <1><f5027>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5028>   DW_AT_byte_size   : 8
    <f5028>   DW_AT_type        : <0xf502c>
 <1><f502c>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f502d>   DW_AT_prototyped  : 1
    <f502d>   DW_AT_type        : <0xf4b6b>
    <f5031>   DW_AT_sibling     : <0xf5045>
 <2><f5035>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5036>   DW_AT_type        : <0xf4f27>
 <2><f503a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f503b>   DW_AT_type        : <0xf4ded>
 <2><f503f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5040>   DW_AT_type        : <0xf4b6b>
 <2><f5044>: Abbrev Number: 0
 <1><f5045>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5046>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <f504a>   DW_AT_decl_file   : 10
    <f504b>   DW_AT_decl_line   : 62
    <f504c>   DW_AT_decl_column : 15
    <f504d>   DW_AT_type        : <0xf5051>
 <1><f5051>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5052>   DW_AT_byte_size   : 8
    <f5052>   DW_AT_type        : <0xf5056>
 <1><f5056>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5057>   DW_AT_prototyped  : 1
    <f5057>   DW_AT_type        : <0xf4b6b>
    <f505b>   DW_AT_sibling     : <0xf506a>
 <2><f505f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5060>   DW_AT_type        : <0xf4f27>
 <2><f5064>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5065>   DW_AT_type        : <0xf506a>
 <2><f5069>: Abbrev Number: 0
 <1><f506a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f506b>   DW_AT_byte_size   : 8
    <f506b>   DW_AT_type        : <0xf4ded>
 <1><f506f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5070>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <f5074>   DW_AT_decl_file   : 10
    <f5075>   DW_AT_decl_line   : 63
    <f5076>   DW_AT_decl_column : 15
    <f5077>   DW_AT_type        : <0xf507b>
 <1><f507b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f507c>   DW_AT_byte_size   : 8
    <f507c>   DW_AT_type        : <0xf5080>
 <1><f5080>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5081>   DW_AT_prototyped  : 1
    <f5081>   DW_AT_type        : <0xf4b6b>
    <f5085>   DW_AT_sibling     : <0xf5099>
 <2><f5089>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f508a>   DW_AT_type        : <0xf4f27>
 <2><f508e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f508f>   DW_AT_type        : <0xf4b91>
 <2><f5093>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5094>   DW_AT_type        : <0xf5099>
 <2><f5098>: Abbrev Number: 0
 <1><f5099>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f509a>   DW_AT_byte_size   : 8
    <f509a>   DW_AT_type        : <0xf4bab>
 <1><f509e>: Abbrev Number: 4 (DW_TAG_typedef)
    <f509f>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <f50a3>   DW_AT_decl_file   : 10
    <f50a4>   DW_AT_decl_line   : 65
    <f50a5>   DW_AT_decl_column : 15
    <f50a6>   DW_AT_type        : <0xf50aa>
 <1><f50aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f50ab>   DW_AT_byte_size   : 8
    <f50ab>   DW_AT_type        : <0xf50af>
 <1><f50af>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f50b0>   DW_AT_prototyped  : 1
    <f50b0>   DW_AT_type        : <0xf4b6b>
    <f50b4>   DW_AT_sibling     : <0xf50c8>
 <2><f50b8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50b9>   DW_AT_type        : <0xf4f27>
 <2><f50bd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50be>   DW_AT_type        : <0xf4ec9>
 <2><f50c2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50c3>   DW_AT_type        : <0xf5099>
 <2><f50c7>: Abbrev Number: 0
 <1><f50c8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f50c9>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <f50cd>   DW_AT_decl_file   : 10
    <f50ce>   DW_AT_decl_line   : 67
    <f50cf>   DW_AT_decl_column : 15
    <f50d0>   DW_AT_type        : <0xf50d4>
 <1><f50d4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f50d5>   DW_AT_byte_size   : 8
    <f50d5>   DW_AT_type        : <0xf50d9>
 <1><f50d9>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f50da>   DW_AT_prototyped  : 1
    <f50da>   DW_AT_type        : <0xf4b6b>
    <f50de>   DW_AT_sibling     : <0xf50f2>
 <2><f50e2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50e3>   DW_AT_type        : <0xf4f27>
 <2><f50e7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50e8>   DW_AT_type        : <0xf4bff>
 <2><f50ec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50ed>   DW_AT_type        : <0xf4bab>
 <2><f50f1>: Abbrev Number: 0
 <1><f50f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f50f3>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <f50f7>   DW_AT_decl_file   : 10
    <f50f8>   DW_AT_decl_line   : 69
    <f50f9>   DW_AT_decl_column : 15
    <f50fa>   DW_AT_type        : <0xf50fe>
 <1><f50fe>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f50ff>   DW_AT_byte_size   : 8
    <f50ff>   DW_AT_type        : <0xf5103>
 <1><f5103>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5104>   DW_AT_prototyped  : 1
    <f5104>   DW_AT_type        : <0xf4b6b>
    <f5108>   DW_AT_sibling     : <0xf511c>
 <2><f510c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f510d>   DW_AT_type        : <0xf4f27>
 <2><f5111>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5112>   DW_AT_type        : <0xf511c>
 <2><f5116>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5117>   DW_AT_type        : <0xf4bab>
 <2><f511b>: Abbrev Number: 0
 <1><f511c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f511d>   DW_AT_byte_size   : 8
    <f511d>   DW_AT_type        : <0xf4bc4>
 <1><f5121>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5122>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <f5126>   DW_AT_decl_file   : 10
    <f5127>   DW_AT_decl_line   : 71
    <f5128>   DW_AT_decl_column : 15
    <f5129>   DW_AT_type        : <0xf512d>
 <1><f512d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f512e>   DW_AT_byte_size   : 8
    <f512e>   DW_AT_type        : <0xf5132>
 <1><f5132>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5133>   DW_AT_prototyped  : 1
    <f5133>   DW_AT_type        : <0xf4b6b>
    <f5137>   DW_AT_sibling     : <0xf514b>
 <2><f513b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f513c>   DW_AT_type        : <0xf4f27>
 <2><f5140>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5141>   DW_AT_type        : <0xf4ded>
 <2><f5145>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5146>   DW_AT_type        : <0xf4ded>
 <2><f514a>: Abbrev Number: 0
 <1><f514b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f514c>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <f5150>   DW_AT_decl_file   : 10
    <f5151>   DW_AT_decl_line   : 73
    <f5152>   DW_AT_decl_column : 15
    <f5153>   DW_AT_type        : <0xf512d>
 <1><f5157>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5158>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <f515c>   DW_AT_decl_file   : 10
    <f515d>   DW_AT_decl_line   : 75
    <f515e>   DW_AT_decl_column : 15
    <f515f>   DW_AT_type        : <0xf5163>
 <1><f5163>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5164>   DW_AT_byte_size   : 8
    <f5164>   DW_AT_type        : <0xf5168>
 <1><f5168>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5169>   DW_AT_prototyped  : 1
    <f5169>   DW_AT_type        : <0xf4b6b>
    <f516d>   DW_AT_sibling     : <0xf517c>
 <2><f5171>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5172>   DW_AT_type        : <0xf4f27>
 <2><f5176>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5177>   DW_AT_type        : <0xf517c>
 <2><f517b>: Abbrev Number: 0
 <1><f517c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f517d>   DW_AT_byte_size   : 8
    <f517d>   DW_AT_type        : <0xf4eaf>
 <1><f5181>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5182>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <f5186>   DW_AT_decl_file   : 10
    <f5187>   DW_AT_decl_line   : 76
    <f5188>   DW_AT_decl_column : 15
    <f5189>   DW_AT_type        : <0xf518d>
 <1><f518d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f518e>   DW_AT_byte_size   : 8
    <f518e>   DW_AT_type        : <0xf5192>
 <1><f5192>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5193>   DW_AT_prototyped  : 1
    <f5193>   DW_AT_type        : <0xf4b6b>
    <f5197>   DW_AT_sibling     : <0xf51ab>
 <2><f519b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f519c>   DW_AT_type        : <0xf4f27>
 <2><f51a0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f51a1>   DW_AT_type        : <0xf4ec9>
 <2><f51a5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f51a6>   DW_AT_type        : <0xf4bdc>
 <2><f51aa>: Abbrev Number: 0
 <1><f51ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <f51ac>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <f51b0>   DW_AT_decl_file   : 10
    <f51b1>   DW_AT_decl_line   : 77
    <f51b2>   DW_AT_decl_column : 15
    <f51b3>   DW_AT_type        : <0xf4ffb>
 <1><f51b7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f51b8>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <f51bc>   DW_AT_byte_size   : 112
    <f51bd>   DW_AT_decl_file   : 10
    <f51be>   DW_AT_decl_line   : 80
    <f51bf>   DW_AT_decl_column : 16
    <f51c0>   DW_AT_sibling     : <0xf527b>
 <2><f51c4>: Abbrev Number: 1 (DW_TAG_member)
    <f51c5>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <f51c9>   DW_AT_decl_file   : 10
    <f51ca>   DW_AT_decl_line   : 81
    <f51cb>   DW_AT_decl_column : 25
    <f51cc>   DW_AT_type        : <0xf4fef>
    <f51d0>   DW_AT_data_member_location: 0
 <2><f51d1>: Abbrev Number: 1 (DW_TAG_member)
    <f51d2>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <f51d6>   DW_AT_decl_file   : 10
    <f51d7>   DW_AT_decl_line   : 82
    <f51d8>   DW_AT_decl_column : 25
    <f51d9>   DW_AT_type        : <0xf500f>
    <f51dd>   DW_AT_data_member_location: 8
 <2><f51de>: Abbrev Number: 1 (DW_TAG_member)
    <f51df>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <f51e3>   DW_AT_decl_file   : 10
    <f51e4>   DW_AT_decl_line   : 83
    <f51e5>   DW_AT_decl_column : 25
    <f51e6>   DW_AT_type        : <0xf501b>
    <f51ea>   DW_AT_data_member_location: 16
 <2><f51eb>: Abbrev Number: 1 (DW_TAG_member)
    <f51ec>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <f51f0>   DW_AT_decl_file   : 10
    <f51f1>   DW_AT_decl_line   : 84
    <f51f2>   DW_AT_decl_column : 25
    <f51f3>   DW_AT_type        : <0xf5045>
    <f51f7>   DW_AT_data_member_location: 24
 <2><f51f8>: Abbrev Number: 1 (DW_TAG_member)
    <f51f9>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <f51fd>   DW_AT_decl_file   : 10
    <f51fe>   DW_AT_decl_line   : 85
    <f51ff>   DW_AT_decl_column : 25
    <f5200>   DW_AT_type        : <0xf506f>
    <f5204>   DW_AT_data_member_location: 32
 <2><f5205>: Abbrev Number: 1 (DW_TAG_member)
    <f5206>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <f520a>   DW_AT_decl_file   : 10
    <f520b>   DW_AT_decl_line   : 86
    <f520c>   DW_AT_decl_column : 25
    <f520d>   DW_AT_type        : <0xf509e>
    <f5211>   DW_AT_data_member_location: 40
 <2><f5212>: Abbrev Number: 1 (DW_TAG_member)
    <f5213>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <f5217>   DW_AT_decl_file   : 10
    <f5218>   DW_AT_decl_line   : 87
    <f5219>   DW_AT_decl_column : 25
    <f521a>   DW_AT_type        : <0xf50c8>
    <f521e>   DW_AT_data_member_location: 48
 <2><f521f>: Abbrev Number: 1 (DW_TAG_member)
    <f5220>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <f5224>   DW_AT_decl_file   : 10
    <f5225>   DW_AT_decl_line   : 88
    <f5226>   DW_AT_decl_column : 25
    <f5227>   DW_AT_type        : <0xf50f2>
    <f522b>   DW_AT_data_member_location: 56
 <2><f522c>: Abbrev Number: 1 (DW_TAG_member)
    <f522d>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <f5231>   DW_AT_decl_file   : 10
    <f5232>   DW_AT_decl_line   : 89
    <f5233>   DW_AT_decl_column : 25
    <f5234>   DW_AT_type        : <0xf5121>
    <f5238>   DW_AT_data_member_location: 64
 <2><f5239>: Abbrev Number: 1 (DW_TAG_member)
    <f523a>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <f523e>   DW_AT_decl_file   : 10
    <f523f>   DW_AT_decl_line   : 90
    <f5240>   DW_AT_decl_column : 25
    <f5241>   DW_AT_type        : <0xf514b>
    <f5245>   DW_AT_data_member_location: 72
 <2><f5246>: Abbrev Number: 1 (DW_TAG_member)
    <f5247>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <f524b>   DW_AT_decl_file   : 10
    <f524c>   DW_AT_decl_line   : 91
    <f524d>   DW_AT_decl_column : 25
    <f524e>   DW_AT_type        : <0xf5157>
    <f5252>   DW_AT_data_member_location: 80
 <2><f5253>: Abbrev Number: 1 (DW_TAG_member)
    <f5254>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <f5258>   DW_AT_decl_file   : 10
    <f5259>   DW_AT_decl_line   : 92
    <f525a>   DW_AT_decl_column : 25
    <f525b>   DW_AT_type        : <0xf5181>
    <f525f>   DW_AT_data_member_location: 88
 <2><f5260>: Abbrev Number: 1 (DW_TAG_member)
    <f5261>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <f5265>   DW_AT_decl_file   : 10
    <f5266>   DW_AT_decl_line   : 93
    <f5267>   DW_AT_decl_column : 25
    <f5268>   DW_AT_type        : <0xf4f02>
    <f526c>   DW_AT_data_member_location: 96
 <2><f526d>: Abbrev Number: 1 (DW_TAG_member)
    <f526e>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <f5272>   DW_AT_decl_file   : 10
    <f5273>   DW_AT_decl_line   : 94
    <f5274>   DW_AT_decl_column : 25
    <f5275>   DW_AT_type        : <0xf51ab>
    <f5279>   DW_AT_data_member_location: 104
 <2><f527a>: Abbrev Number: 0
 <1><f527b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f527c>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <f5280>   DW_AT_decl_file   : 10
    <f5281>   DW_AT_decl_line   : 95
    <f5282>   DW_AT_decl_column : 3
    <f5283>   DW_AT_type        : <0xf51b7>
 <1><f5287>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5288>   DW_AT_byte_size   : 8
    <f5288>   DW_AT_type        : <0xf527b>
 <1><f528c>: Abbrev Number: 4 (DW_TAG_typedef)
    <f528d>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <f5291>   DW_AT_decl_file   : 10
    <f5292>   DW_AT_decl_line   : 117
    <f5293>   DW_AT_decl_column : 3
    <f5294>   DW_AT_type        : <0xf4f2c>
 <1><f5298>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5299>   DW_AT_byte_size   : 8
    <f5299>   DW_AT_type        : <0xf528c>
 <1><f529d>: Abbrev Number: 15 (DW_TAG_subprogram)
    <f529e>   DW_AT_external    : 1
    <f529e>   DW_AT_name        : (indirect string, offset: 0x1bca1): fflush
    <f52a2>   DW_AT_decl_file   : 11
    <f52a3>   DW_AT_decl_line   : 218
    <f52a4>   DW_AT_decl_column : 12
    <f52a5>   DW_AT_prototyped  : 1
    <f52a5>   DW_AT_type        : <0xf4b6b>
    <f52a9>   DW_AT_declaration : 1
    <f52a9>   DW_AT_sibling     : <0xf52b3>
 <2><f52ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f52ae>   DW_AT_type        : <0xf4de8>
 <2><f52b2>: Abbrev Number: 0
 <1><f52b3>: Abbrev Number: 15 (DW_TAG_subprogram)
    <f52b4>   DW_AT_external    : 1
    <f52b4>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <f52b8>   DW_AT_decl_file   : 9
    <f52b9>   DW_AT_decl_line   : 50
    <f52ba>   DW_AT_decl_column : 22
    <f52bb>   DW_AT_prototyped  : 1
    <f52bb>   DW_AT_type        : <0xf4b6b>
    <f52bf>   DW_AT_declaration : 1
    <f52bf>   DW_AT_sibling     : <0xf52c9>
 <2><f52c3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f52c4>   DW_AT_type        : <0xf4b6b>
 <2><f52c8>: Abbrev Number: 0
 <1><f52c9>: Abbrev Number: 24 (DW_TAG_subprogram)
    <f52ca>   DW_AT_external    : 1
    <f52ca>   DW_AT_name        : (indirect string, offset: 0x1d5dc): fb_DevFileFlush
    <f52ce>   DW_AT_decl_file   : 1
    <f52cf>   DW_AT_decl_line   : 5
    <f52d0>   DW_AT_decl_column : 5
    <f52d1>   DW_AT_prototyped  : 1
    <f52d1>   DW_AT_type        : <0xf4b6b>
    <f52d5>   DW_AT_low_pc      : 0x47ba30
    <f52dd>   DW_AT_high_pc     : 0x4a
    <f52e5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f52e7>   DW_AT_call_all_calls: 1
 <2><f52e7>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <f52e8>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <f52ec>   DW_AT_decl_file   : 1
    <f52ed>   DW_AT_decl_line   : 5
    <f52ee>   DW_AT_decl_column : 31
    <f52ef>   DW_AT_type        : <0xf5298>
    <f52f3>   DW_AT_location    : 0x45053 (location list)
    <f52f7>   DW_AT_GNU_locviews: 0x4504f
 <2><f52fb>: Abbrev Number: 26 (DW_TAG_variable)
    <f52fc>   DW_AT_name        : fp
    <f52ff>   DW_AT_decl_file   : 1
    <f5300>   DW_AT_decl_line   : 7
    <f5301>   DW_AT_decl_column : 8
    <f5302>   DW_AT_type        : <0xf4de8>
    <f5306>   DW_AT_location    : 0x45067 (location list)
    <f530a>   DW_AT_GNU_locviews: 0x45061
 <2><f530e>: Abbrev Number: 27 (DW_TAG_call_site)
    <f530f>   DW_AT_call_return_pc: 0x47ba42
    <f5317>   DW_AT_call_origin : <0xf529d>
 <2><f531b>: Abbrev Number: 16 (DW_TAG_call_site)
    <f531c>   DW_AT_call_return_pc: 0x47ba51
    <f5324>   DW_AT_call_tail_call: 1
    <f5324>   DW_AT_call_origin : <0xf52b3>
    <f5328>   DW_AT_sibling     : <0xf5332>
 <3><f532c>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f532d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f532f>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><f5331>: Abbrev Number: 0
 <2><f5332>: Abbrev Number: 16 (DW_TAG_call_site)
    <f5333>   DW_AT_call_return_pc: 0x47ba66
    <f533b>   DW_AT_call_tail_call: 1
    <f533b>   DW_AT_call_origin : <0xf52b3>
    <f533f>   DW_AT_sibling     : <0xf5349>
 <3><f5343>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f5344>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f5346>   DW_AT_call_value  : 1 byte block: 33 	(DW_OP_lit3)
 <3><f5348>: Abbrev Number: 0
 <2><f5349>: Abbrev Number: 28 (DW_TAG_call_site)
    <f534a>   DW_AT_call_return_pc: 0x47ba7a
    <f5352>   DW_AT_call_tail_call: 1
    <f5352>   DW_AT_call_origin : <0xf52b3>
 <3><f5356>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f5357>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f5359>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><f535b>: Abbrev Number: 0
 <2><f535c>: Abbrev Number: 0
 <1><f535d>: Abbrev Number: 0
  Compilation Unit @ offset 0xf535e:
   Length:        0x865 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1b0fb
   Pointer Size:  8
 <0><f536a>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <f536b>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <f536f>   DW_AT_language    : 29	(C11)
    <f5370>   DW_AT_name        : (indirect line string, offset: 0x1ac6): src/rtlib/dev_file_lock.c
    <f5374>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <f5378>   DW_AT_low_pc      : 0x47ba80
    <f5380>   DW_AT_high_pc     : 0x22
    <f5388>   DW_AT_stmt_list   : 0x719cd
 <1><f538c>: Abbrev Number: 6 (DW_TAG_base_type)
    <f538d>   DW_AT_byte_size   : 1
    <f538e>   DW_AT_encoding    : 8	(unsigned char)
    <f538f>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f5393>: Abbrev Number: 6 (DW_TAG_base_type)
    <f5394>   DW_AT_byte_size   : 2
    <f5395>   DW_AT_encoding    : 7	(unsigned)
    <f5396>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f539a>: Abbrev Number: 6 (DW_TAG_base_type)
    <f539b>   DW_AT_byte_size   : 4
    <f539c>   DW_AT_encoding    : 7	(unsigned)
    <f539d>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f53a1>: Abbrev Number: 6 (DW_TAG_base_type)
    <f53a2>   DW_AT_byte_size   : 8
    <f53a3>   DW_AT_encoding    : 7	(unsigned)
    <f53a4>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f53a8>: Abbrev Number: 6 (DW_TAG_base_type)
    <f53a9>   DW_AT_byte_size   : 1
    <f53aa>   DW_AT_encoding    : 6	(signed char)
    <f53ab>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f53af>: Abbrev Number: 6 (DW_TAG_base_type)
    <f53b0>   DW_AT_byte_size   : 2
    <f53b1>   DW_AT_encoding    : 5	(signed)
    <f53b2>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f53b6>: Abbrev Number: 17 (DW_TAG_base_type)
    <f53b7>   DW_AT_byte_size   : 4
    <f53b8>   DW_AT_encoding    : 5	(signed)
    <f53b9>   DW_AT_name        : int
 <1><f53bd>: Abbrev Number: 6 (DW_TAG_base_type)
    <f53be>   DW_AT_byte_size   : 8
    <f53bf>   DW_AT_encoding    : 5	(signed)
    <f53c0>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f53c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <f53c5>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <f53c9>   DW_AT_decl_file   : 2
    <f53ca>   DW_AT_decl_line   : 152
    <f53cb>   DW_AT_decl_column : 25
    <f53cc>   DW_AT_type        : <0xf53bd>
 <1><f53d0>: Abbrev Number: 4 (DW_TAG_typedef)
    <f53d1>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f53d5>   DW_AT_decl_file   : 2
    <f53d6>   DW_AT_decl_line   : 153
    <f53d7>   DW_AT_decl_column : 27
    <f53d8>   DW_AT_type        : <0xf53bd>
 <1><f53dc>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <f53dd>   DW_AT_byte_size   : 8
 <1><f53de>: Abbrev Number: 4 (DW_TAG_typedef)
    <f53df>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <f53e3>   DW_AT_decl_file   : 2
    <f53e4>   DW_AT_decl_line   : 194
    <f53e5>   DW_AT_decl_column : 27
    <f53e6>   DW_AT_type        : <0xf53bd>
 <1><f53ea>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f53eb>   DW_AT_byte_size   : 8
    <f53eb>   DW_AT_type        : <0xf53ef>
 <1><f53ef>: Abbrev Number: 6 (DW_TAG_base_type)
    <f53f0>   DW_AT_byte_size   : 1
    <f53f1>   DW_AT_encoding    : 6	(signed char)
    <f53f2>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f53f6>: Abbrev Number: 4 (DW_TAG_typedef)
    <f53f7>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f53fb>   DW_AT_decl_file   : 3
    <f53fc>   DW_AT_decl_line   : 209
    <f53fd>   DW_AT_decl_column : 23
    <f53fe>   DW_AT_type        : <0xf53a1>
 <1><f5402>: Abbrev Number: 19 (DW_TAG_typedef)
    <f5403>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <f5407>   DW_AT_decl_file   : 3
    <f5408>   DW_AT_decl_line   : 321
    <f540a>   DW_AT_decl_column : 24
    <f540b>   DW_AT_type        : <0xf53b6>
 <1><f540f>: Abbrev Number: 20 (DW_TAG_const_type)
    <f5410>   DW_AT_type        : <0xf5402>
 <1><f5414>: Abbrev Number: 6 (DW_TAG_base_type)
    <f5415>   DW_AT_byte_size   : 8
    <f5416>   DW_AT_encoding    : 5	(signed)
    <f5417>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f541b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f541c>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <f5420>   DW_AT_decl_file   : 4
    <f5421>   DW_AT_decl_line   : 87
    <f5422>   DW_AT_decl_column : 19
    <f5423>   DW_AT_type        : <0xf53d0>
 <1><f5427>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5428>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <f542c>   DW_AT_decl_file   : 4
    <f542d>   DW_AT_decl_line   : 108
    <f542e>   DW_AT_decl_column : 19
    <f542f>   DW_AT_type        : <0xf53de>
 <1><f5433>: Abbrev Number: 6 (DW_TAG_base_type)
    <f5434>   DW_AT_byte_size   : 8
    <f5435>   DW_AT_encoding    : 7	(unsigned)
    <f5436>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f543a>: Abbrev Number: 9 (DW_TAG_array_type)
    <f543b>   DW_AT_type        : <0xf53ef>
    <f543f>   DW_AT_sibling     : <0xf544a>
 <2><f5443>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f5444>   DW_AT_type        : <0xf53a1>
    <f5448>   DW_AT_upper_bound : 3
 <2><f5449>: Abbrev Number: 0
 <1><f544a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f544b>   DW_AT_byte_size   : 8
    <f544b>   DW_AT_type        : <0xf544f>
 <1><f544f>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><f5450>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f5451>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <f5455>   DW_AT_byte_size   : 216
    <f5456>   DW_AT_decl_file   : 5
    <f5457>   DW_AT_decl_line   : 49
    <f5458>   DW_AT_decl_column : 8
    <f5459>   DW_AT_sibling     : <0xf55d7>
 <2><f545d>: Abbrev Number: 1 (DW_TAG_member)
    <f545e>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <f5462>   DW_AT_decl_file   : 5
    <f5463>   DW_AT_decl_line   : 51
    <f5464>   DW_AT_decl_column : 7
    <f5465>   DW_AT_type        : <0xf53b6>
    <f5469>   DW_AT_data_member_location: 0
 <2><f546a>: Abbrev Number: 1 (DW_TAG_member)
    <f546b>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <f546f>   DW_AT_decl_file   : 5
    <f5470>   DW_AT_decl_line   : 54
    <f5471>   DW_AT_decl_column : 9
    <f5472>   DW_AT_type        : <0xf53ea>
    <f5476>   DW_AT_data_member_location: 8
 <2><f5477>: Abbrev Number: 1 (DW_TAG_member)
    <f5478>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <f547c>   DW_AT_decl_file   : 5
    <f547d>   DW_AT_decl_line   : 55
    <f547e>   DW_AT_decl_column : 9
    <f547f>   DW_AT_type        : <0xf53ea>
    <f5483>   DW_AT_data_member_location: 16
 <2><f5484>: Abbrev Number: 1 (DW_TAG_member)
    <f5485>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <f5489>   DW_AT_decl_file   : 5
    <f548a>   DW_AT_decl_line   : 56
    <f548b>   DW_AT_decl_column : 9
    <f548c>   DW_AT_type        : <0xf53ea>
    <f5490>   DW_AT_data_member_location: 24
 <2><f5491>: Abbrev Number: 1 (DW_TAG_member)
    <f5492>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <f5496>   DW_AT_decl_file   : 5
    <f5497>   DW_AT_decl_line   : 57
    <f5498>   DW_AT_decl_column : 9
    <f5499>   DW_AT_type        : <0xf53ea>
    <f549d>   DW_AT_data_member_location: 32
 <2><f549e>: Abbrev Number: 1 (DW_TAG_member)
    <f549f>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <f54a3>   DW_AT_decl_file   : 5
    <f54a4>   DW_AT_decl_line   : 58
    <f54a5>   DW_AT_decl_column : 9
    <f54a6>   DW_AT_type        : <0xf53ea>
    <f54aa>   DW_AT_data_member_location: 40
 <2><f54ab>: Abbrev Number: 1 (DW_TAG_member)
    <f54ac>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <f54b0>   DW_AT_decl_file   : 5
    <f54b1>   DW_AT_decl_line   : 59
    <f54b2>   DW_AT_decl_column : 9
    <f54b3>   DW_AT_type        : <0xf53ea>
    <f54b7>   DW_AT_data_member_location: 48
 <2><f54b8>: Abbrev Number: 1 (DW_TAG_member)
    <f54b9>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <f54bd>   DW_AT_decl_file   : 5
    <f54be>   DW_AT_decl_line   : 60
    <f54bf>   DW_AT_decl_column : 9
    <f54c0>   DW_AT_type        : <0xf53ea>
    <f54c4>   DW_AT_data_member_location: 56
 <2><f54c5>: Abbrev Number: 1 (DW_TAG_member)
    <f54c6>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <f54ca>   DW_AT_decl_file   : 5
    <f54cb>   DW_AT_decl_line   : 61
    <f54cc>   DW_AT_decl_column : 9
    <f54cd>   DW_AT_type        : <0xf53ea>
    <f54d1>   DW_AT_data_member_location: 64
 <2><f54d2>: Abbrev Number: 1 (DW_TAG_member)
    <f54d3>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <f54d7>   DW_AT_decl_file   : 5
    <f54d8>   DW_AT_decl_line   : 64
    <f54d9>   DW_AT_decl_column : 9
    <f54da>   DW_AT_type        : <0xf53ea>
    <f54de>   DW_AT_data_member_location: 72
 <2><f54df>: Abbrev Number: 1 (DW_TAG_member)
    <f54e0>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <f54e4>   DW_AT_decl_file   : 5
    <f54e5>   DW_AT_decl_line   : 65
    <f54e6>   DW_AT_decl_column : 9
    <f54e7>   DW_AT_type        : <0xf53ea>
    <f54eb>   DW_AT_data_member_location: 80
 <2><f54ec>: Abbrev Number: 1 (DW_TAG_member)
    <f54ed>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <f54f1>   DW_AT_decl_file   : 5
    <f54f2>   DW_AT_decl_line   : 66
    <f54f3>   DW_AT_decl_column : 9
    <f54f4>   DW_AT_type        : <0xf53ea>
    <f54f8>   DW_AT_data_member_location: 88
 <2><f54f9>: Abbrev Number: 1 (DW_TAG_member)
    <f54fa>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <f54fe>   DW_AT_decl_file   : 5
    <f54ff>   DW_AT_decl_line   : 68
    <f5500>   DW_AT_decl_column : 22
    <f5501>   DW_AT_type        : <0xf55f0>
    <f5505>   DW_AT_data_member_location: 96
 <2><f5506>: Abbrev Number: 1 (DW_TAG_member)
    <f5507>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <f550b>   DW_AT_decl_file   : 5
    <f550c>   DW_AT_decl_line   : 70
    <f550d>   DW_AT_decl_column : 20
    <f550e>   DW_AT_type        : <0xf55f5>
    <f5512>   DW_AT_data_member_location: 104
 <2><f5513>: Abbrev Number: 1 (DW_TAG_member)
    <f5514>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <f5518>   DW_AT_decl_file   : 5
    <f5519>   DW_AT_decl_line   : 72
    <f551a>   DW_AT_decl_column : 7
    <f551b>   DW_AT_type        : <0xf53b6>
    <f551f>   DW_AT_data_member_location: 112
 <2><f5520>: Abbrev Number: 1 (DW_TAG_member)
    <f5521>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <f5525>   DW_AT_decl_file   : 5
    <f5526>   DW_AT_decl_line   : 73
    <f5527>   DW_AT_decl_column : 7
    <f5528>   DW_AT_type        : <0xf53b6>
    <f552c>   DW_AT_data_member_location: 116
 <2><f552d>: Abbrev Number: 1 (DW_TAG_member)
    <f552e>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <f5532>   DW_AT_decl_file   : 5
    <f5533>   DW_AT_decl_line   : 74
    <f5534>   DW_AT_decl_column : 11
    <f5535>   DW_AT_type        : <0xf53c4>
    <f5539>   DW_AT_data_member_location: 120
 <2><f553a>: Abbrev Number: 1 (DW_TAG_member)
    <f553b>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <f553f>   DW_AT_decl_file   : 5
    <f5540>   DW_AT_decl_line   : 77
    <f5541>   DW_AT_decl_column : 18
    <f5542>   DW_AT_type        : <0xf5393>
    <f5546>   DW_AT_data_member_location: 128
 <2><f5547>: Abbrev Number: 1 (DW_TAG_member)
    <f5548>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <f554c>   DW_AT_decl_file   : 5
    <f554d>   DW_AT_decl_line   : 78
    <f554e>   DW_AT_decl_column : 15
    <f554f>   DW_AT_type        : <0xf53a8>
    <f5553>   DW_AT_data_member_location: 130
 <2><f5554>: Abbrev Number: 1 (DW_TAG_member)
    <f5555>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <f5559>   DW_AT_decl_file   : 5
    <f555a>   DW_AT_decl_line   : 79
    <f555b>   DW_AT_decl_column : 8
    <f555c>   DW_AT_type        : <0xf55fa>
    <f5560>   DW_AT_data_member_location: 131
 <2><f5561>: Abbrev Number: 1 (DW_TAG_member)
    <f5562>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <f5566>   DW_AT_decl_file   : 5
    <f5567>   DW_AT_decl_line   : 81
    <f5568>   DW_AT_decl_column : 15
    <f5569>   DW_AT_type        : <0xf560a>
    <f556d>   DW_AT_data_member_location: 136
 <2><f556e>: Abbrev Number: 1 (DW_TAG_member)
    <f556f>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <f5573>   DW_AT_decl_file   : 5
    <f5574>   DW_AT_decl_line   : 89
    <f5575>   DW_AT_decl_column : 13
    <f5576>   DW_AT_type        : <0xf53d0>
    <f557a>   DW_AT_data_member_location: 144
 <2><f557b>: Abbrev Number: 1 (DW_TAG_member)
    <f557c>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <f5580>   DW_AT_decl_file   : 5
    <f5581>   DW_AT_decl_line   : 91
    <f5582>   DW_AT_decl_column : 23
    <f5583>   DW_AT_type        : <0xf5614>
    <f5587>   DW_AT_data_member_location: 152
 <2><f5588>: Abbrev Number: 1 (DW_TAG_member)
    <f5589>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <f558d>   DW_AT_decl_file   : 5
    <f558e>   DW_AT_decl_line   : 92
    <f558f>   DW_AT_decl_column : 25
    <f5590>   DW_AT_type        : <0xf561e>
    <f5594>   DW_AT_data_member_location: 160
 <2><f5595>: Abbrev Number: 1 (DW_TAG_member)
    <f5596>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <f559a>   DW_AT_decl_file   : 5
    <f559b>   DW_AT_decl_line   : 93
    <f559c>   DW_AT_decl_column : 20
    <f559d>   DW_AT_type        : <0xf55f5>
    <f55a1>   DW_AT_data_member_location: 168
 <2><f55a2>: Abbrev Number: 1 (DW_TAG_member)
    <f55a3>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <f55a7>   DW_AT_decl_file   : 5
    <f55a8>   DW_AT_decl_line   : 94
    <f55a9>   DW_AT_decl_column : 9
    <f55aa>   DW_AT_type        : <0xf53dc>
    <f55ae>   DW_AT_data_member_location: 176
 <2><f55af>: Abbrev Number: 1 (DW_TAG_member)
    <f55b0>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <f55b4>   DW_AT_decl_file   : 5
    <f55b5>   DW_AT_decl_line   : 95
    <f55b6>   DW_AT_decl_column : 10
    <f55b7>   DW_AT_type        : <0xf53f6>
    <f55bb>   DW_AT_data_member_location: 184
 <2><f55bc>: Abbrev Number: 1 (DW_TAG_member)
    <f55bd>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <f55c1>   DW_AT_decl_file   : 5
    <f55c2>   DW_AT_decl_line   : 96
    <f55c3>   DW_AT_decl_column : 7
    <f55c4>   DW_AT_type        : <0xf53b6>
    <f55c8>   DW_AT_data_member_location: 192
 <2><f55c9>: Abbrev Number: 1 (DW_TAG_member)
    <f55ca>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <f55ce>   DW_AT_decl_file   : 5
    <f55cf>   DW_AT_decl_line   : 98
    <f55d0>   DW_AT_decl_column : 8
    <f55d1>   DW_AT_type        : <0xf5623>
    <f55d5>   DW_AT_data_member_location: 196
 <2><f55d6>: Abbrev Number: 0
 <1><f55d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <f55d8>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <f55dc>   DW_AT_decl_file   : 6
    <f55dd>   DW_AT_decl_line   : 7
    <f55de>   DW_AT_decl_column : 25
    <f55df>   DW_AT_type        : <0xf5450>
 <1><f55e3>: Abbrev Number: 22 (DW_TAG_typedef)
    <f55e4>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <f55e8>   DW_AT_decl_file   : 5
    <f55e9>   DW_AT_decl_line   : 43
    <f55ea>   DW_AT_decl_column : 14
 <1><f55eb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f55ec>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <f55f0>   DW_AT_declaration : 1
 <1><f55f0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f55f1>   DW_AT_byte_size   : 8
    <f55f1>   DW_AT_type        : <0xf55eb>
 <1><f55f5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f55f6>   DW_AT_byte_size   : 8
    <f55f6>   DW_AT_type        : <0xf5450>
 <1><f55fa>: Abbrev Number: 9 (DW_TAG_array_type)
    <f55fb>   DW_AT_type        : <0xf53ef>
    <f55ff>   DW_AT_sibling     : <0xf560a>
 <2><f5603>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f5604>   DW_AT_type        : <0xf53a1>
    <f5608>   DW_AT_upper_bound : 0
 <2><f5609>: Abbrev Number: 0
 <1><f560a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f560b>   DW_AT_byte_size   : 8
    <f560b>   DW_AT_type        : <0xf55e3>
 <1><f560f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f5610>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <f5614>   DW_AT_declaration : 1
 <1><f5614>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5615>   DW_AT_byte_size   : 8
    <f5615>   DW_AT_type        : <0xf560f>
 <1><f5619>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f561a>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <f561e>   DW_AT_declaration : 1
 <1><f561e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f561f>   DW_AT_byte_size   : 8
    <f561f>   DW_AT_type        : <0xf5619>
 <1><f5623>: Abbrev Number: 9 (DW_TAG_array_type)
    <f5624>   DW_AT_type        : <0xf53ef>
    <f5628>   DW_AT_sibling     : <0xf5633>
 <2><f562c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f562d>   DW_AT_type        : <0xf53a1>
    <f5631>   DW_AT_upper_bound : 19
 <2><f5632>: Abbrev Number: 0
 <1><f5633>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5634>   DW_AT_byte_size   : 8
    <f5634>   DW_AT_type        : <0xf55d7>
 <1><f5638>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5639>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <f563d>   DW_AT_decl_file   : 7
    <f563e>   DW_AT_decl_line   : 22
    <f563f>   DW_AT_decl_column : 15
    <f5640>   DW_AT_type        : <0xf541b>
 <1><f5644>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <f5645>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <f5649>   DW_AT_encoding    : 7	(void)
    <f5649>   DW_AT_byte_size   : 4
    <f5649>   DW_AT_type        : <0xf539a>
    <f564d>   DW_AT_decl_file   : 9
    <f564e>   DW_AT_decl_line   : 1
    <f564f>   DW_AT_decl_column : 14
    <f564f>   DW_AT_sibling     : <0xf56c6>
 <2><f5653>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5654>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <f5658>   DW_AT_const_value : 0
 <2><f5659>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f565a>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <f565e>   DW_AT_const_value : 1
 <2><f565f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5660>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <f5664>   DW_AT_const_value : 2
 <2><f5665>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5666>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <f566a>   DW_AT_const_value : 3
 <2><f566b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f566c>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <f5670>   DW_AT_const_value : 4
 <2><f5671>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5672>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <f5676>   DW_AT_const_value : 5
 <2><f5677>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5678>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <f567c>   DW_AT_const_value : 6
 <2><f567d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f567e>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <f5682>   DW_AT_const_value : 7
 <2><f5683>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5684>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <f5688>   DW_AT_const_value : 8
 <2><f5689>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f568a>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <f568e>   DW_AT_const_value : 9
 <2><f568f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5690>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <f5694>   DW_AT_const_value : 10
 <2><f5695>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5696>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <f569a>   DW_AT_const_value : 11
 <2><f569b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f569c>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <f56a0>   DW_AT_const_value : 12
 <2><f56a1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56a2>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <f56a6>   DW_AT_const_value : 13
 <2><f56a7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56a8>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <f56ac>   DW_AT_const_value : 14
 <2><f56ad>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56ae>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <f56b2>   DW_AT_const_value : 15
 <2><f56b3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56b4>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <f56b8>   DW_AT_const_value : 16
 <2><f56b9>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56ba>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <f56be>   DW_AT_const_value : 17
 <2><f56bf>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f56c0>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <f56c4>   DW_AT_const_value : 18
 <2><f56c5>: Abbrev Number: 0
 <1><f56c6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f56c7>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <f56cb>   DW_AT_byte_size   : 24
    <f56cc>   DW_AT_decl_file   : 8
    <f56cd>   DW_AT_decl_line   : 82
    <f56ce>   DW_AT_decl_column : 16
    <f56cf>   DW_AT_sibling     : <0xf56fa>
 <2><f56d3>: Abbrev Number: 1 (DW_TAG_member)
    <f56d4>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <f56d8>   DW_AT_decl_file   : 8
    <f56d9>   DW_AT_decl_line   : 83
    <f56da>   DW_AT_decl_column : 21
    <f56db>   DW_AT_type        : <0xf53ea>
    <f56df>   DW_AT_data_member_location: 0
 <2><f56e0>: Abbrev Number: 15 (DW_TAG_member)
    <f56e1>   DW_AT_name        : len
    <f56e5>   DW_AT_decl_file   : 8
    <f56e6>   DW_AT_decl_line   : 84
    <f56e7>   DW_AT_decl_column : 21
    <f56e7>   DW_AT_type        : <0xf5427>
    <f56eb>   DW_AT_data_member_location: 8
 <2><f56ec>: Abbrev Number: 1 (DW_TAG_member)
    <f56ed>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f56f1>   DW_AT_decl_file   : 8
    <f56f2>   DW_AT_decl_line   : 85
    <f56f3>   DW_AT_decl_column : 21
    <f56f4>   DW_AT_type        : <0xf5427>
    <f56f8>   DW_AT_data_member_location: 16
 <2><f56f9>: Abbrev Number: 0
 <1><f56fa>: Abbrev Number: 4 (DW_TAG_typedef)
    <f56fb>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <f56ff>   DW_AT_decl_file   : 8
    <f5700>   DW_AT_decl_line   : 86
    <f5701>   DW_AT_decl_column : 3
    <f5702>   DW_AT_type        : <0xf56c6>
 <1><f5706>: Abbrev Number: 6 (DW_TAG_base_type)
    <f5707>   DW_AT_byte_size   : 8
    <f5708>   DW_AT_encoding    : 4	(float)
    <f5709>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><f570d>: Abbrev Number: 6 (DW_TAG_base_type)
    <f570e>   DW_AT_byte_size   : 4
    <f570f>   DW_AT_encoding    : 4	(float)
    <f5710>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><f5714>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5715>   DW_AT_byte_size   : 8
    <f5715>   DW_AT_type        : <0xf5402>
 <1><f5719>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <f571a>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <f571e>   DW_AT_encoding    : 7	(void)
    <f571e>   DW_AT_byte_size   : 4
    <f571e>   DW_AT_type        : <0xf539a>
    <f5722>   DW_AT_decl_file   : 10
    <f5723>   DW_AT_decl_line   : 25
    <f5724>   DW_AT_decl_column : 14
    <f5724>   DW_AT_sibling     : <0xf5741>
 <2><f5728>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5729>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <f572d>   DW_AT_const_value : 0
 <2><f572e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f572f>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <f5733>   DW_AT_const_value : 1
 <2><f5734>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f5735>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <f5739>   DW_AT_const_value : 2
 <2><f573a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <f573b>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <f573f>   DW_AT_const_value : 3
 <2><f5740>: Abbrev Number: 0
 <1><f5741>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5742>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <f5746>   DW_AT_decl_file   : 10
    <f5747>   DW_AT_decl_line   : 30
    <f5748>   DW_AT_decl_column : 3
    <f5749>   DW_AT_type        : <0xf5719>
 <1><f574d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f574e>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <f5752>   DW_AT_decl_file   : 10
    <f5753>   DW_AT_decl_line   : 54
    <f5754>   DW_AT_decl_column : 15
    <f5755>   DW_AT_type        : <0xf5759>
 <1><f5759>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f575a>   DW_AT_byte_size   : 8
    <f575a>   DW_AT_type        : <0xf575e>
 <1><f575e>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f575f>   DW_AT_prototyped  : 1
    <f575f>   DW_AT_type        : <0xf53b6>
    <f5763>   DW_AT_sibling     : <0xf5772>
 <2><f5767>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5768>   DW_AT_type        : <0xf5772>
 <2><f576c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f576d>   DW_AT_type        : <0xf53b6>
 <2><f5771>: Abbrev Number: 0
 <1><f5772>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5773>   DW_AT_byte_size   : 8
    <f5773>   DW_AT_type        : <0xf5777>
 <1><f5777>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f5778>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <f577c>   DW_AT_byte_size   : 80
    <f577d>   DW_AT_decl_file   : 10
    <f577e>   DW_AT_decl_line   : 97
    <f577f>   DW_AT_decl_column : 16
    <f5780>   DW_AT_sibling     : <0xf583a>
 <2><f5784>: Abbrev Number: 1 (DW_TAG_member)
    <f5785>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <f5789>   DW_AT_decl_file   : 10
    <f578a>   DW_AT_decl_line   : 98
    <f578b>   DW_AT_decl_column : 21
    <f578c>   DW_AT_type        : <0xf53b6>
    <f5790>   DW_AT_data_member_location: 0
 <2><f5791>: Abbrev Number: 15 (DW_TAG_member)
    <f5792>   DW_AT_name        : len
    <f5796>   DW_AT_decl_file   : 10
    <f5797>   DW_AT_decl_line   : 99
    <f5798>   DW_AT_decl_column : 21
    <f5798>   DW_AT_type        : <0xf53b6>
    <f579c>   DW_AT_data_member_location: 4
 <2><f579d>: Abbrev Number: 1 (DW_TAG_member)
    <f579e>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <f57a2>   DW_AT_decl_file   : 10
    <f57a3>   DW_AT_decl_line   : 100
    <f57a4>   DW_AT_decl_column : 21
    <f57a5>   DW_AT_type        : <0xf5741>
    <f57a9>   DW_AT_data_member_location: 8
 <2><f57aa>: Abbrev Number: 1 (DW_TAG_member)
    <f57ab>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f57af>   DW_AT_decl_file   : 10
    <f57b0>   DW_AT_decl_line   : 101
    <f57b1>   DW_AT_decl_column : 21
    <f57b2>   DW_AT_type        : <0xf5638>
    <f57b6>   DW_AT_data_member_location: 16
 <2><f57b7>: Abbrev Number: 1 (DW_TAG_member)
    <f57b8>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f57bc>   DW_AT_decl_file   : 10
    <f57bd>   DW_AT_decl_line   : 102
    <f57be>   DW_AT_decl_column : 21
    <f57bf>   DW_AT_type        : <0xf53b6>
    <f57c3>   DW_AT_data_member_location: 24
 <2><f57c4>: Abbrev Number: 1 (DW_TAG_member)
    <f57c5>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <f57c9>   DW_AT_decl_file   : 10
    <f57ca>   DW_AT_decl_line   : 103
    <f57cb>   DW_AT_decl_column : 21
    <f57cc>   DW_AT_type        : <0xf53b6>
    <f57d0>   DW_AT_data_member_location: 28
 <2><f57d1>: Abbrev Number: 1 (DW_TAG_member)
    <f57d2>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <f57d6>   DW_AT_decl_file   : 10
    <f57d7>   DW_AT_decl_line   : 104
    <f57d8>   DW_AT_decl_column : 21
    <f57d9>   DW_AT_type        : <0xf53b6>
    <f57dd>   DW_AT_data_member_location: 32
 <2><f57de>: Abbrev Number: 1 (DW_TAG_member)
    <f57df>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <f57e3>   DW_AT_decl_file   : 10
    <f57e4>   DW_AT_decl_line   : 105
    <f57e5>   DW_AT_decl_column : 21
    <f57e6>   DW_AT_type        : <0xf539a>
    <f57ea>   DW_AT_data_member_location: 36
 <2><f57eb>: Abbrev Number: 1 (DW_TAG_member)
    <f57ec>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <f57f0>   DW_AT_decl_file   : 10
    <f57f1>   DW_AT_decl_line   : 106
    <f57f2>   DW_AT_decl_column : 21
    <f57f3>   DW_AT_type        : <0xf539a>
    <f57f7>   DW_AT_data_member_location: 40
 <2><f57f8>: Abbrev Number: 1 (DW_TAG_member)
    <f57f9>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <f57fd>   DW_AT_decl_file   : 10
    <f57fe>   DW_AT_decl_line   : 109
    <f57ff>   DW_AT_decl_column : 21
    <f5800>   DW_AT_type        : <0xf543a>
    <f5804>   DW_AT_data_member_location: 44
 <2><f5805>: Abbrev Number: 1 (DW_TAG_member)
    <f5806>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <f580a>   DW_AT_decl_file   : 10
    <f580b>   DW_AT_decl_line   : 110
    <f580c>   DW_AT_decl_column : 21
    <f580d>   DW_AT_type        : <0xf53f6>
    <f5811>   DW_AT_data_member_location: 48
 <2><f5812>: Abbrev Number: 1 (DW_TAG_member)
    <f5813>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f5817>   DW_AT_decl_file   : 10
    <f5818>   DW_AT_decl_line   : 112
    <f5819>   DW_AT_decl_column : 22
    <f581a>   DW_AT_type        : <0xf5ad2>
    <f581e>   DW_AT_data_member_location: 56
 <2><f581f>: Abbrev Number: 1 (DW_TAG_member)
    <f5820>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <f5824>   DW_AT_decl_file   : 10
    <f5825>   DW_AT_decl_line   : 114
    <f5826>   DW_AT_decl_column : 14
    <f5827>   DW_AT_type        : <0xf53dc>
    <f582b>   DW_AT_data_member_location: 64
 <2><f582c>: Abbrev Number: 1 (DW_TAG_member)
    <f582d>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <f5831>   DW_AT_decl_file   : 10
    <f5832>   DW_AT_decl_line   : 116
    <f5833>   DW_AT_decl_column : 22
    <f5834>   DW_AT_type        : <0xf5772>
    <f5838>   DW_AT_data_member_location: 72
 <2><f5839>: Abbrev Number: 0
 <1><f583a>: Abbrev Number: 4 (DW_TAG_typedef)
    <f583b>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <f583f>   DW_AT_decl_file   : 10
    <f5840>   DW_AT_decl_line   : 59
    <f5841>   DW_AT_decl_column : 15
    <f5842>   DW_AT_type        : <0xf5846>
 <1><f5846>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5847>   DW_AT_byte_size   : 8
    <f5847>   DW_AT_type        : <0xf584b>
 <1><f584b>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f584c>   DW_AT_prototyped  : 1
    <f584c>   DW_AT_type        : <0xf53b6>
    <f5850>   DW_AT_sibling     : <0xf585a>
 <2><f5854>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f5855>   DW_AT_type        : <0xf5772>
 <2><f5859>: Abbrev Number: 0
 <1><f585a>: Abbrev Number: 4 (DW_TAG_typedef)
    <f585b>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <f585f>   DW_AT_decl_file   : 10
    <f5860>   DW_AT_decl_line   : 60
    <f5861>   DW_AT_decl_column : 15
    <f5862>   DW_AT_type        : <0xf5846>
 <1><f5866>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5867>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <f586b>   DW_AT_decl_file   : 10
    <f586c>   DW_AT_decl_line   : 61
    <f586d>   DW_AT_decl_column : 15
    <f586e>   DW_AT_type        : <0xf5872>
 <1><f5872>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f5873>   DW_AT_byte_size   : 8
    <f5873>   DW_AT_type        : <0xf5877>
 <1><f5877>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <f5878>   DW_AT_prototyped  : 1
