 <2><9b748>: Abbrev Number: 0
 <1><9b749>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9b74a>   DW_AT_external    : 1
    <9b74a>   DW_AT_name        : (indirect string, offset: 0x19293): fb_hX11WaitVSync
    <9b74e>   DW_AT_decl_file   : 12
    <9b74e>   DW_AT_decl_line   : 52
    <9b74f>   DW_AT_decl_column : 13
    <9b74f>   DW_AT_prototyped  : 1
    <9b74f>   DW_AT_declaration : 1
 <1><9b74f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <9b750>   DW_AT_external    : 1
    <9b750>   DW_AT_name        : (indirect string, offset: 0x18c30): fb_hX11SetPalette
    <9b754>   DW_AT_decl_file   : 12
    <9b755>   DW_AT_decl_line   : 51
    <9b756>   DW_AT_decl_column : 13
    <9b756>   DW_AT_prototyped  : 1
    <9b756>   DW_AT_declaration : 1
    <9b756>   DW_AT_sibling     : <0x9b76f>
 <2><9b75a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b75b>   DW_AT_type        : <0x98dc7>
 <2><9b75f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b760>   DW_AT_type        : <0x98dc7>
 <2><9b764>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b765>   DW_AT_type        : <0x98dc7>
 <2><9b769>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b76a>   DW_AT_type        : <0x98dc7>
 <2><9b76e>: Abbrev Number: 0
 <1><9b76f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9b770>   DW_AT_external    : 1
    <9b770>   DW_AT_name        : (indirect string, offset: 0x197ec): fb_hX11Unlock
    <9b774>   DW_AT_decl_file   : 12
    <9b774>   DW_AT_decl_line   : 50

    <9c0ad>   DW_AT_decl_file   : 2
    <9c0ae>   DW_AT_decl_line   : 321
    <9c0b0>   DW_AT_decl_column : 24
    <9c0b1>   DW_AT_type        : <0x9c084>
 <1><9c0b5>: Abbrev Number: 5 (DW_TAG_base_type)
    <9c0b6>   DW_AT_byte_size   : 8
    <9c0b7>   DW_AT_encoding    : 5	(signed)
    <9c0b8>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><9c0bc>: Abbrev Number: 5 (DW_TAG_base_type)
    <9c0bd>   DW_AT_byte_size   : 8
    <9c0be>   DW_AT_encoding    : 7	(unsigned)
    <9c0bf>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9c0c3>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <9c0c4>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <9c0c8>   DW_AT_encoding    : 7	(unsigned)
    <9c0c9>   DW_AT_byte_size   : 4
    <9c0ca>   DW_AT_type        : <0x9c068>
    <9c0ce>   DW_AT_decl_file   : 6
    <9c0cf>   DW_AT_decl_line   : 1
    <9c0d0>   DW_AT_decl_column : 14
    <9c0d1>   DW_AT_sibling     : <0x9c148>
 <2><9c0d5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0d6>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <9c0da>   DW_AT_const_value : 0
 <2><9c0db>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0dc>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <9c0e0>   DW_AT_const_value : 1
 <2><9c0e1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0e2>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <9c0e6>   DW_AT_const_value : 2
 <2><9c0e7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0e8>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <9c0ec>   DW_AT_const_value : 3
 <2><9c0ed>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0ee>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <9c0f2>   DW_AT_const_value : 4
 <2><9c0f3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0f4>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <9c0f8>   DW_AT_const_value : 5
 <2><9c0f9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c0fa>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <9c0fe>   DW_AT_const_value : 6
 <2><9c0ff>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c100>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <9c104>   DW_AT_const_value : 7
 <2><9c105>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c106>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <9c10a>   DW_AT_const_value : 8
 <2><9c10b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c10c>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <9c110>   DW_AT_const_value : 9
 <2><9c111>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c112>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <9c116>   DW_AT_const_value : 10
 <2><9c117>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c118>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <9c11c>   DW_AT_const_value : 11
 <2><9c11d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c11e>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <9c122>   DW_AT_const_value : 12
 <2><9c123>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c124>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <9c128>   DW_AT_const_value : 13
 <2><9c129>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c12a>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <9c12e>   DW_AT_const_value : 14
 <2><9c12f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c130>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <9c134>   DW_AT_const_value : 15
 <2><9c135>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c136>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <9c13a>   DW_AT_const_value : 16
 <2><9c13b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c13c>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <9c140>   DW_AT_const_value : 17
 <2><9c141>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c142>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <9c146>   DW_AT_const_value : 18
 <2><9c147>: Abbrev Number: 0
 <1><9c148>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c149>   DW_AT_byte_size   : 8
    <9c149>   DW_AT_type        : <0x9c14d>
 <1><9c14d>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <9c14e>   DW_AT_prototyped  : 1
 <1><9c14e>: Abbrev Number: 5 (DW_TAG_base_type)
    <9c14f>   DW_AT_byte_size   : 8
    <9c150>   DW_AT_encoding    : 4	(float)
    <9c151>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9c155>: Abbrev Number: 5 (DW_TAG_base_type)
    <9c156>   DW_AT_byte_size   : 4
    <9c157>   DW_AT_encoding    : 4	(float)
    <9c158>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9c15c>: Abbrev Number: 10 (DW_TAG_typedef)
    <9c15d>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <9c161>   DW_AT_decl_file   : 3
    <9c162>   DW_AT_decl_line   : 7
    <9c163>   DW_AT_decl_column : 25
    <9c164>   DW_AT_type        : <0x9c168>
 <1><9c168>: Abbrev Number: 30 (DW_TAG_structure_type)
    <9c169>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <9c16d>   DW_AT_declaration : 1
 <1><9c16d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9c16e>   DW_AT_byte_size   : 8
    <9c16f>   DW_AT_decl_file   : 4
    <9c16f>   DW_AT_decl_line   : 4
    <9c170>   DW_AT_decl_column : 3
    <9c170>   DW_AT_sibling     : <0x9c18f>
 <2><9c174>: Abbrev Number: 1 (DW_TAG_member)
    <9c175>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9c179>   DW_AT_decl_file   : 4
    <9c17a>   DW_AT_decl_line   : 5
    <9c17b>   DW_AT_decl_column : 8
    <9c17c>   DW_AT_type        : <0x9c084>
    <9c180>   DW_AT_data_member_location: 0
 <2><9c181>: Abbrev Number: 1 (DW_TAG_member)
    <9c182>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9c186>   DW_AT_decl_file   : 4
    <9c187>   DW_AT_decl_line   : 6
    <9c188>   DW_AT_decl_column : 8
    <9c189>   DW_AT_type        : <0x9c084>
    <9c18d>   DW_AT_data_member_location: 4
 <2><9c18e>: Abbrev Number: 0
 <1><9c18f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9c190>   DW_AT_byte_size   : 16
    <9c191>   DW_AT_decl_file   : 4
    <9c191>   DW_AT_decl_line   : 8
    <9c192>   DW_AT_decl_column : 3
    <9c192>   DW_AT_sibling     : <0x9c1c5>
 <2><9c196>: Abbrev Number: 6 (DW_TAG_member)
    <9c197>   DW_AT_name        : x
    <9c199>   DW_AT_decl_file   : 4
    <9c19a>   DW_AT_decl_line   : 9
    <9c19b>   DW_AT_decl_column : 8
    <9c19c>   DW_AT_type        : <0x9c084>
    <9c1a0>   DW_AT_data_member_location: 0
 <2><9c1a1>: Abbrev Number: 6 (DW_TAG_member)
    <9c1a2>   DW_AT_name        : y
    <9c1a4>   DW_AT_decl_file   : 4
    <9c1a5>   DW_AT_decl_line   : 9
    <9c1a6>   DW_AT_decl_column : 11
    <9c1a7>   DW_AT_type        : <0x9c084>
    <9c1ab>   DW_AT_data_member_location: 4
 <2><9c1ac>: Abbrev Number: 6 (DW_TAG_member)
    <9c1ad>   DW_AT_name        : dx
    <9c1b0>   DW_AT_decl_file   : 4
    <9c1b1>   DW_AT_decl_line   : 10
    <9c1b2>   DW_AT_decl_column : 8
    <9c1b3>   DW_AT_type        : <0x9c084>
    <9c1b7>   DW_AT_data_member_location: 8
 <2><9c1b8>: Abbrev Number: 6 (DW_TAG_member)
    <9c1b9>   DW_AT_name        : dy
    <9c1bc>   DW_AT_decl_file   : 4
    <9c1bd>   DW_AT_decl_line   : 10
    <9c1be>   DW_AT_decl_column : 12
    <9c1bf>   DW_AT_type        : <0x9c084>
    <9c1c3>   DW_AT_data_member_location: 12
 <2><9c1c4>: Abbrev Number: 0
 <1><9c1c5>: Abbrev Number: 31 (DW_TAG_union_type)
    <9c1c6>   DW_AT_byte_size   : 16
    <9c1c7>   DW_AT_decl_file   : 4
    <9c1c8>   DW_AT_decl_line   : 3
    <9c1c9>   DW_AT_decl_column : 2
    <9c1ca>   DW_AT_sibling     : <0x9c1f5>
 <2><9c1ce>: Abbrev Number: 17 (DW_TAG_member)
    <9c1cf>   DW_AT_type        : <0x9c16d>
 <2><9c1d3>: Abbrev Number: 17 (DW_TAG_member)
    <9c1d4>   DW_AT_type        : <0x9c18f>
 <2><9c1d8>: Abbrev Number: 32 (DW_TAG_member)
    <9c1d9>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <9c1dd>   DW_AT_decl_file   : 4
    <9c1de>   DW_AT_decl_line   : 12
    <9c1df>   DW_AT_decl_column : 7
    <9c1e0>   DW_AT_type        : <0x9c084>
 <2><9c1e4>: Abbrev Number: 18 (DW_TAG_member)
    <9c1e5>   DW_AT_name        : z
    <9c1e7>   DW_AT_decl_file   : 4
    <9c1e7>   DW_AT_decl_line   : 13
    <9c1e8>   DW_AT_decl_column : 7
    <9c1e8>   DW_AT_type        : <0x9c084>
 <2><9c1ec>: Abbrev Number: 18 (DW_TAG_member)
    <9c1ed>   DW_AT_name        : w
    <9c1ef>   DW_AT_decl_file   : 4
    <9c1ef>   DW_AT_decl_line   : 14
    <9c1f0>   DW_AT_decl_column : 7
    <9c1f0>   DW_AT_type        : <0x9c084>
 <2><9c1f4>: Abbrev Number: 0
 <1><9c1f5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c1f6>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <9c1fa>   DW_AT_byte_size   : 20
    <9c1fb>   DW_AT_decl_file   : 4
    <9c1fc>   DW_AT_decl_line   : 1
    <9c1fd>   DW_AT_decl_column : 8
    <9c1fe>   DW_AT_sibling     : <0x9c216>
 <2><9c202>: Abbrev Number: 1 (DW_TAG_member)
    <9c203>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9c207>   DW_AT_decl_file   : 4
    <9c208>   DW_AT_decl_line   : 2
    <9c209>   DW_AT_decl_column : 6
    <9c20a>   DW_AT_type        : <0x9c084>
    <9c20e>   DW_AT_data_member_location: 0
 <2><9c20f>: Abbrev Number: 33 (DW_TAG_member)
    <9c210>   DW_AT_type        : <0x9c1c5>
    <9c214>   DW_AT_data_member_location: 4
 <2><9c215>: Abbrev Number: 0
 <1><9c216>: Abbrev Number: 10 (DW_TAG_typedef)
    <9c217>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <9c21b>   DW_AT_decl_file   : 4
    <9c21c>   DW_AT_decl_line   : 18
    <9c21d>   DW_AT_decl_column : 23
    <9c21e>   DW_AT_type        : <0x9c1f5>
 <1><9c222>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c223>   DW_AT_byte_size   : 8
    <9c223>   DW_AT_type        : <0x9c227>
 <1><9c227>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <9c228>   DW_AT_prototyped  : 1
    <9c228>   DW_AT_type        : <0x9c084>
    <9c22c>   DW_AT_sibling     : <0x9c23b>
 <2><9c230>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c231>   DW_AT_type        : <0x9c084>
 <2><9c235>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c236>   DW_AT_type        : <0x9c084>
 <2><9c23a>: Abbrev Number: 0
 <1><9c23b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c23c>   DW_AT_byte_size   : 8
    <9c23c>   DW_AT_type        : <0x9c084>
 <1><9c240>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c241>   DW_AT_byte_size   : 8
    <9c241>   DW_AT_type        : <0x9c245>
 <1><9c245>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <9c246>   DW_AT_prototyped  : 1
    <9c246>   DW_AT_type        : <0x9c084>
    <9c24a>   DW_AT_sibling     : <0x9c268>
 <2><9c24e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c24f>   DW_AT_type        : <0x9c23b>
 <2><9c253>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c254>   DW_AT_type        : <0x9c23b>
 <2><9c258>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c259>   DW_AT_type        : <0x9c23b>
 <2><9c25d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c25e>   DW_AT_type        : <0x9c23b>
 <2><9c262>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c263>   DW_AT_type        : <0x9c23b>
 <2><9c267>: Abbrev Number: 0
 <1><9c268>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c269>   DW_AT_byte_size   : 8
    <9c269>   DW_AT_type        : <0x9c216>
 <1><9c26d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c26e>   DW_AT_byte_size   : 8
    <9c26e>   DW_AT_type        : <0x9c055>
 <1><9c272>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c273>   DW_AT_byte_size   : 8
    <9c273>   DW_AT_type        : <0x9c26d>
 <1><9c277>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c278>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <9c27c>   DW_AT_byte_size   : 12
    <9c27d>   DW_AT_decl_file   : 5
    <9c27e>   DW_AT_decl_line   : 139
    <9c27f>   DW_AT_decl_column : 16
    <9c280>   DW_AT_sibling     : <0x9c2a9>
 <2><9c284>: Abbrev Number: 6 (DW_TAG_member)
    <9c285>   DW_AT_name        : ch
    <9c288>   DW_AT_decl_file   : 5
    <9c289>   DW_AT_decl_line   : 140
    <9c28a>   DW_AT_decl_column : 14
    <9c28b>   DW_AT_type        : <0x9c0a8>
    <9c28f>   DW_AT_data_member_location: 0
 <2><9c290>: Abbrev Number: 6 (DW_TAG_member)
    <9c291>   DW_AT_name        : fg
    <9c294>   DW_AT_decl_file   : 5
    <9c295>   DW_AT_decl_line   : 141
    <9c296>   DW_AT_decl_column : 14
    <9c297>   DW_AT_type        : <0x9c068>
    <9c29b>   DW_AT_data_member_location: 4
 <2><9c29c>: Abbrev Number: 6 (DW_TAG_member)
    <9c29d>   DW_AT_name        : bg
    <9c2a0>   DW_AT_decl_file   : 5
    <9c2a1>   DW_AT_decl_line   : 141
    <9c2a2>   DW_AT_decl_column : 18
    <9c2a3>   DW_AT_type        : <0x9c068>
    <9c2a7>   DW_AT_data_member_location: 8
 <2><9c2a8>: Abbrev Number: 0
 <1><9c2a9>: Abbrev Number: 10 (DW_TAG_typedef)
    <9c2aa>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <9c2ae>   DW_AT_decl_file   : 5
    <9c2af>   DW_AT_decl_line   : 142
    <9c2b0>   DW_AT_decl_column : 3
    <9c2b1>   DW_AT_type        : <0x9c277>
 <1><9c2b5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c2b6>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9c2ba>   DW_AT_byte_size   : 208
    <9c2bb>   DW_AT_decl_file   : 5
    <9c2bc>   DW_AT_decl_line   : 144
    <9c2bd>   DW_AT_decl_column : 16
    <9c2be>   DW_AT_sibling     : <0x9c478>
 <2><9c2c2>: Abbrev Number: 6 (DW_TAG_member)
    <9c2c3>   DW_AT_name        : id
    <9c2c6>   DW_AT_decl_file   : 5
    <9c2c7>   DW_AT_decl_line   : 146
    <9c2c8>   DW_AT_decl_column : 6
    <9c2c9>   DW_AT_type        : <0x9c084>
    <9c2cd>   DW_AT_data_member_location: 0
 <2><9c2ce>: Abbrev Number: 1 (DW_TAG_member)
    <9c2cf>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <9c2d3>   DW_AT_decl_file   : 5
    <9c2d4>   DW_AT_decl_line   : 147
    <9c2d5>   DW_AT_decl_column : 9
    <9c2d6>   DW_AT_type        : <0x9c084>
    <9c2da>   DW_AT_data_member_location: 4
 <2><9c2db>: Abbrev Number: 1 (DW_TAG_member)
    <9c2dc>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <9c2e0>   DW_AT_decl_file   : 5
    <9c2e1>   DW_AT_decl_line   : 148
    <9c2e2>   DW_AT_decl_column : 21
    <9c2e3>   DW_AT_type        : <0x9c272>
    <9c2e7>   DW_AT_data_member_location: 8
 <2><9c2e8>: Abbrev Number: 1 (DW_TAG_member)
    <9c2e9>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <9c2ed>   DW_AT_decl_file   : 5
    <9c2ee>   DW_AT_decl_line   : 149
    <9c2ef>   DW_AT_decl_column : 9
    <9c2f0>   DW_AT_type        : <0x9c084>
    <9c2f4>   DW_AT_data_member_location: 16
 <2><9c2f5>: Abbrev Number: 1 (DW_TAG_member)
    <9c2f6>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <9c2fa>   DW_AT_decl_file   : 5
    <9c2fb>   DW_AT_decl_line   : 150
    <9c2fc>   DW_AT_decl_column : 9
    <9c2fd>   DW_AT_type        : <0x9c084>
    <9c301>   DW_AT_data_member_location: 20
 <2><9c302>: Abbrev Number: 1 (DW_TAG_member)
    <9c303>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <9c307>   DW_AT_decl_file   : 5
    <9c308>   DW_AT_decl_line   : 151
    <9c309>   DW_AT_decl_column : 20
    <9c30a>   DW_AT_type        : <0x9c26d>
    <9c30e>   DW_AT_data_member_location: 24
 <2><9c30f>: Abbrev Number: 6 (DW_TAG_member)
    <9c310>   DW_AT_name        : w
    <9c312>   DW_AT_decl_file   : 5
    <9c313>   DW_AT_decl_line   : 152
    <9c314>   DW_AT_decl_column : 9
    <9c315>   DW_AT_type        : <0x9c084>
    <9c319>   DW_AT_data_member_location: 32
 <2><9c31a>: Abbrev Number: 6 (DW_TAG_member)
    <9c31b>   DW_AT_name        : h
    <9c31d>   DW_AT_decl_file   : 5
    <9c31e>   DW_AT_decl_line   : 152
    <9c31f>   DW_AT_decl_column : 12
    <9c320>   DW_AT_type        : <0x9c084>
    <9c324>   DW_AT_data_member_location: 36
 <2><9c325>: Abbrev Number: 1 (DW_TAG_member)
    <9c326>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <9c32a>   DW_AT_decl_file   : 5
    <9c32b>   DW_AT_decl_line   : 153
    <9c32c>   DW_AT_decl_column : 9
    <9c32d>   DW_AT_type        : <0x9c084>
    <9c331>   DW_AT_data_member_location: 40
 <2><9c332>: Abbrev Number: 6 (DW_TAG_member)
    <9c333>   DW_AT_name        : bpp
    <9c337>   DW_AT_decl_file   : 5
    <9c338>   DW_AT_decl_line   : 154
    <9c339>   DW_AT_decl_column : 9
    <9c33a>   DW_AT_type        : <0x9c084>
    <9c33e>   DW_AT_data_member_location: 44
 <2><9c33f>: Abbrev Number: 1 (DW_TAG_member)
    <9c340>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <9c344>   DW_AT_decl_file   : 5
    <9c345>   DW_AT_decl_line   : 155
    <9c346>   DW_AT_decl_column : 9
    <9c347>   DW_AT_type        : <0x9c084>
    <9c34b>   DW_AT_data_member_location: 48
 <2><9c34c>: Abbrev Number: 1 (DW_TAG_member)
    <9c34d>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <9c351>   DW_AT_decl_file   : 5
    <9c352>   DW_AT_decl_line   : 156
    <9c353>   DW_AT_decl_column : 19
    <9c354>   DW_AT_type        : <0x9c478>
    <9c358>   DW_AT_data_member_location: 56
 <2><9c359>: Abbrev Number: 1 (DW_TAG_member)
    <9c35a>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <9c35e>   DW_AT_decl_file   : 5
    <9c35f>   DW_AT_decl_line   : 157
    <9c360>   DW_AT_decl_column : 19
    <9c361>   DW_AT_type        : <0x9c478>
    <9c365>   DW_AT_data_member_location: 64
 <2><9c366>: Abbrev Number: 1 (DW_TAG_member)
    <9c367>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <9c36b>   DW_AT_decl_file   : 5
    <9c36c>   DW_AT_decl_line   : 158
    <9c36d>   DW_AT_decl_column : 20
    <9c36e>   DW_AT_type        : <0x9c26d>
    <9c372>   DW_AT_data_member_location: 72
 <2><9c373>: Abbrev Number: 1 (DW_TAG_member)
    <9c374>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <9c378>   DW_AT_decl_file   : 5
    <9c379>   DW_AT_decl_line   : 159
    <9c37a>   DW_AT_decl_column : 11
    <9c37b>   DW_AT_type        : <0x9c09c>
    <9c37f>   DW_AT_data_member_location: 80
 <2><9c380>: Abbrev Number: 1 (DW_TAG_member)
    <9c381>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <9c385>   DW_AT_decl_file   : 5
    <9c386>   DW_AT_decl_line   : 160
    <9c387>   DW_AT_decl_column : 29
    <9c388>   DW_AT_type        : <0x9c546>
    <9c38c>   DW_AT_data_member_location: 88
 <2><9c38d>: Abbrev Number: 1 (DW_TAG_member)
    <9c38e>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <9c392>   DW_AT_decl_file   : 5
    <9c393>   DW_AT_decl_line   : 161
    <9c394>   DW_AT_decl_column : 9
    <9c395>   DW_AT_type        : <0x9c084>
    <9c399>   DW_AT_data_member_location: 96
 <2><9c39a>: Abbrev Number: 1 (DW_TAG_member)
    <9c39b>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <9c39f>   DW_AT_decl_file   : 5
    <9c3a0>   DW_AT_decl_line   : 162
    <9c3a1>   DW_AT_decl_column : 27
    <9c3a2>   DW_AT_type        : <0x9c576>
    <9c3a6>   DW_AT_data_member_location: 104
 <2><9c3a7>: Abbrev Number: 1 (DW_TAG_member)
    <9c3a8>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <9c3ac>   DW_AT_decl_file   : 5
    <9c3ad>   DW_AT_decl_line   : 163
    <9c3ae>   DW_AT_decl_column : 9
    <9c3af>   DW_AT_type        : <0x9c084>
    <9c3b3>   DW_AT_data_member_location: 112
 <2><9c3b4>: Abbrev Number: 1 (DW_TAG_member)
    <9c3b5>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <9c3b9>   DW_AT_decl_file   : 5
    <9c3ba>   DW_AT_decl_line   : 164
    <9c3bb>   DW_AT_decl_column : 9
    <9c3bc>   DW_AT_type        : <0x9c084>
    <9c3c0>   DW_AT_data_member_location: 116
 <2><9c3c1>: Abbrev Number: 1 (DW_TAG_member)
    <9c3c2>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <9c3c6>   DW_AT_decl_file   : 5
    <9c3c7>   DW_AT_decl_line   : 164
    <9c3c8>   DW_AT_decl_column : 19
    <9c3c9>   DW_AT_type        : <0x9c084>
    <9c3cd>   DW_AT_data_member_location: 120
 <2><9c3ce>: Abbrev Number: 1 (DW_TAG_member)
    <9c3cf>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <9c3d3>   DW_AT_decl_file   : 5
    <9c3d4>   DW_AT_decl_line   : 165
    <9c3d5>   DW_AT_decl_column : 24
    <9c3d6>   DW_AT_type        : <0x9c5ad>
    <9c3da>   DW_AT_data_member_location: 128
 <2><9c3db>: Abbrev Number: 1 (DW_TAG_member)
    <9c3dc>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <9c3e0>   DW_AT_decl_file   : 5
    <9c3e1>   DW_AT_decl_line   : 166
    <9c3e2>   DW_AT_decl_column : 9
    <9c3e3>   DW_AT_type        : <0x9c084>
    <9c3e7>   DW_AT_data_member_location: 136
 <2><9c3e8>: Abbrev Number: 1 (DW_TAG_member)
    <9c3e9>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <9c3ed>   DW_AT_decl_file   : 5
    <9c3ee>   DW_AT_decl_line   : 166
    <9c3ef>   DW_AT_decl_column : 17
    <9c3f0>   DW_AT_type        : <0x9c084>
    <9c3f4>   DW_AT_data_member_location: 140
 <2><9c3f5>: Abbrev Number: 1 (DW_TAG_member)
    <9c3f6>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <9c3fa>   DW_AT_decl_file   : 5
    <9c3fb>   DW_AT_decl_line   : 167
    <9c3fc>   DW_AT_decl_column : 11
    <9c3fd>   DW_AT_type        : <0x9c155>
    <9c401>   DW_AT_data_member_location: 144
 <2><9c402>: Abbrev Number: 6 (DW_TAG_member)
    <9c403>   DW_AT_name        : key
    <9c407>   DW_AT_decl_file   : 5
    <9c408>   DW_AT_decl_line   : 168
    <9c409>   DW_AT_decl_column : 11
    <9c40a>   DW_AT_type        : <0x9c09c>
    <9c40e>   DW_AT_data_member_location: 152
 <2><9c40f>: Abbrev Number: 1 (DW_TAG_member)
    <9c410>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <9c414>   DW_AT_decl_file   : 5
    <9c415>   DW_AT_decl_line   : 169
    <9c416>   DW_AT_decl_column : 6
    <9c417>   DW_AT_type        : <0x9c084>
    <9c41b>   DW_AT_data_member_location: 160
 <2><9c41c>: Abbrev Number: 1 (DW_TAG_member)
    <9c41d>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <9c421>   DW_AT_decl_file   : 5
    <9c422>   DW_AT_decl_line   : 170
    <9c423>   DW_AT_decl_column : 18
    <9c424>   DW_AT_type        : <0x9c5b2>
    <9c428>   DW_AT_data_member_location: 168
 <2><9c429>: Abbrev Number: 1 (DW_TAG_member)
    <9c42a>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <9c42e>   DW_AT_decl_file   : 5
    <9c42f>   DW_AT_decl_line   : 171
    <9c430>   DW_AT_decl_column : 12
    <9c431>   DW_AT_type        : <0x9c268>
    <9c435>   DW_AT_data_member_location: 176
 <2><9c436>: Abbrev Number: 1 (DW_TAG_member)
    <9c437>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <9c43b>   DW_AT_decl_file   : 5
    <9c43c>   DW_AT_decl_line   : 172
    <9c43d>   DW_AT_decl_column : 9
    <9c43e>   DW_AT_type        : <0x9c084>
    <9c442>   DW_AT_data_member_location: 184
 <2><9c443>: Abbrev Number: 1 (DW_TAG_member)
    <9c444>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <9c448>   DW_AT_decl_file   : 5
    <9c449>   DW_AT_decl_line   : 172
    <9c44a>   DW_AT_decl_column : 21
    <9c44b>   DW_AT_type        : <0x9c084>
    <9c44f>   DW_AT_data_member_location: 188
 <2><9c450>: Abbrev Number: 1 (DW_TAG_member)
    <9c451>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <9c455>   DW_AT_decl_file   : 5
    <9c456>   DW_AT_decl_line   : 173
    <9c457>   DW_AT_decl_column : 11
    <9c458>   DW_AT_type        : <0x9c5bc>
    <9c45c>   DW_AT_data_member_location: 192
 <2><9c45d>: Abbrev Number: 1 (DW_TAG_member)
    <9c45e>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <9c462>   DW_AT_decl_file   : 5
    <9c463>   DW_AT_decl_line   : 174
    <9c464>   DW_AT_decl_column : 15
    <9c465>   DW_AT_type        : <0x9c08b>
    <9c469>   DW_AT_data_member_location: 200
 <2><9c46a>: Abbrev Number: 1 (DW_TAG_member)
    <9c46b>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <9c46f>   DW_AT_decl_file   : 5
    <9c470>   DW_AT_decl_line   : 175
    <9c471>   DW_AT_decl_column : 6
    <9c472>   DW_AT_type        : <0x9c084>
    <9c476>   DW_AT_data_member_location: 204
 <2><9c477>: Abbrev Number: 0
 <1><9c478>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c479>   DW_AT_byte_size   : 8
    <9c479>   DW_AT_type        : <0x9c068>
 <1><9c47d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c47e>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <9c482>   DW_AT_byte_size   : 112
    <9c483>   DW_AT_decl_file   : 5
    <9c484>   DW_AT_decl_line   : 178
    <9c485>   DW_AT_decl_column : 16
    <9c486>   DW_AT_sibling     : <0x9c541>
 <2><9c48a>: Abbrev Number: 1 (DW_TAG_member)
    <9c48b>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <9c48f>   DW_AT_decl_file   : 5
    <9c490>   DW_AT_decl_line   : 188
    <9c491>   DW_AT_decl_column : 8
    <9c492>   DW_AT_type        : <0x9c09c>
    <9c496>   DW_AT_data_member_location: 0
 <2><9c497>: Abbrev Number: 1 (DW_TAG_member)
    <9c498>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <9c49c>   DW_AT_decl_file   : 5
    <9c49d>   DW_AT_decl_line   : 208
    <9c49e>   DW_AT_decl_column : 8
    <9c49f>   DW_AT_type        : <0x9c5f5>
    <9c4a3>   DW_AT_data_member_location: 8
 <2><9c4a4>: Abbrev Number: 1 (DW_TAG_member)
    <9c4a5>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <9c4a9>   DW_AT_decl_file   : 5
    <9c4aa>   DW_AT_decl_line   : 222
    <9c4ab>   DW_AT_decl_column : 9
    <9c4ac>   DW_AT_type        : <0x9c148>
    <9c4b0>   DW_AT_data_member_location: 16
 <2><9c4b1>: Abbrev Number: 1 (DW_TAG_member)
    <9c4b2>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <9c4b6>   DW_AT_decl_file   : 5
    <9c4b7>   DW_AT_decl_line   : 231
    <9c4b8>   DW_AT_decl_column : 9
    <9c4b9>   DW_AT_type        : <0x9c148>
    <9c4bd>   DW_AT_data_member_location: 24
 <2><9c4be>: Abbrev Number: 1 (DW_TAG_member)
    <9c4bf>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <9c4c3>   DW_AT_decl_file   : 5
    <9c4c4>   DW_AT_decl_line   : 239
    <9c4c5>   DW_AT_decl_column : 9
    <9c4c6>   DW_AT_type        : <0x9c148>
    <9c4ca>   DW_AT_data_member_location: 32
 <2><9c4cb>: Abbrev Number: 1 (DW_TAG_member)
    <9c4cc>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <9c4d0>   DW_AT_decl_file   : 5
    <9c4d1>   DW_AT_decl_line   : 248
    <9c4d2>   DW_AT_decl_column : 9
    <9c4d3>   DW_AT_type        : <0x9c614>
    <9c4d7>   DW_AT_data_member_location: 40
 <2><9c4d8>: Abbrev Number: 7 (DW_TAG_member)
    <9c4d9>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <9c4dd>   DW_AT_decl_file   : 5
    <9c4dd>   DW_AT_decl_line   : 258
    <9c4df>   DW_AT_decl_column : 9
    <9c4e0>   DW_AT_type        : <0x9c148>
    <9c4e4>   DW_AT_data_member_location: 48
 <2><9c4e5>: Abbrev Number: 7 (DW_TAG_member)
    <9c4e6>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <9c4ea>   DW_AT_decl_file   : 5
    <9c4ea>   DW_AT_decl_line   : 274
    <9c4ec>   DW_AT_decl_column : 8
    <9c4ed>   DW_AT_type        : <0x9c240>
    <9c4f1>   DW_AT_data_member_location: 56
 <2><9c4f2>: Abbrev Number: 7 (DW_TAG_member)
    <9c4f3>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <9c4f7>   DW_AT_decl_file   : 5
    <9c4f7>   DW_AT_decl_line   : 285
    <9c4f9>   DW_AT_decl_column : 9
    <9c4fa>   DW_AT_type        : <0x9c614>
    <9c4fe>   DW_AT_data_member_location: 64
 <2><9c4ff>: Abbrev Number: 7 (DW_TAG_member)
    <9c500>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <9c504>   DW_AT_decl_file   : 5
    <9c504>   DW_AT_decl_line   : 293
    <9c506>   DW_AT_decl_column : 9
    <9c507>   DW_AT_type        : <0x9c624>
    <9c50b>   DW_AT_data_member_location: 72
 <2><9c50c>: Abbrev Number: 7 (DW_TAG_member)
    <9c50d>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <9c511>   DW_AT_decl_file   : 5
    <9c511>   DW_AT_decl_line   : 301
    <9c513>   DW_AT_decl_column : 8
    <9c514>   DW_AT_type        : <0x9c222>
    <9c518>   DW_AT_data_member_location: 80
 <2><9c519>: Abbrev Number: 7 (DW_TAG_member)
    <9c51a>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <9c51e>   DW_AT_decl_file   : 5
    <9c51e>   DW_AT_decl_line   : 314
    <9c520>   DW_AT_decl_column : 9
    <9c521>   DW_AT_type        : <0x9c63d>
    <9c525>   DW_AT_data_member_location: 88
 <2><9c526>: Abbrev Number: 7 (DW_TAG_member)
    <9c527>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <9c52b>   DW_AT_decl_file   : 5
    <9c52b>   DW_AT_decl_line   : 321
    <9c52d>   DW_AT_decl_column : 9
    <9c52e>   DW_AT_type        : <0x9c148>
    <9c532>   DW_AT_data_member_location: 96
 <2><9c533>: Abbrev Number: 7 (DW_TAG_member)
    <9c534>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <9c538>   DW_AT_decl_file   : 5
    <9c538>   DW_AT_decl_line   : 328
    <9c53a>   DW_AT_decl_column : 9
    <9c53b>   DW_AT_type        : <0x9c148>
    <9c53f>   DW_AT_data_member_location: 104
 <2><9c540>: Abbrev Number: 0
 <1><9c541>: Abbrev Number: 9 (DW_TAG_const_type)
    <9c542>   DW_AT_type        : <0x9c47d>
 <1><9c546>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c547>   DW_AT_byte_size   : 8
    <9c547>   DW_AT_type        : <0x9c541>
 <1><9c54b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <9c54c>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <9c550>   DW_AT_byte_size   : 16
    <9c550>   DW_AT_decl_file   : 5
    <9c550>   DW_AT_decl_line   : 331
    <9c552>   DW_AT_decl_column : 16
    <9c552>   DW_AT_sibling     : <0x9c571>
 <2><9c556>: Abbrev Number: 7 (DW_TAG_member)
    <9c557>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <9c55b>   DW_AT_decl_file   : 5
    <9c55b>   DW_AT_decl_line   : 333
    <9c55d>   DW_AT_decl_column : 12
    <9c55e>   DW_AT_type        : <0x9c090>
    <9c562>   DW_AT_data_member_location: 0
 <2><9c563>: Abbrev Number: 7 (DW_TAG_member)
    <9c564>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9c568>   DW_AT_decl_file   : 5
    <9c568>   DW_AT_decl_line   : 334
    <9c56a>   DW_AT_decl_column : 23
    <9c56b>   DW_AT_type        : <0x9c642>
    <9c56f>   DW_AT_data_member_location: 8
 <2><9c570>: Abbrev Number: 0
 <1><9c571>: Abbrev Number: 9 (DW_TAG_const_type)
    <9c572>   DW_AT_type        : <0x9c54b>
 <1><9c576>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c577>   DW_AT_byte_size   : 8
    <9c577>   DW_AT_type        : <0x9c571>
 <1><9c57b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <9c57c>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <9c580>   DW_AT_byte_size   : 16
    <9c580>   DW_AT_decl_file   : 5
    <9c580>   DW_AT_decl_line   : 337
    <9c582>   DW_AT_decl_column : 16
    <9c582>   DW_AT_sibling     : <0x9c5a8>
 <2><9c586>: Abbrev Number: 20 (DW_TAG_member)
    <9c587>   DW_AT_name        : w
    <9c589>   DW_AT_decl_file   : 5
    <9c589>   DW_AT_decl_line   : 339
    <9c58b>   DW_AT_decl_column : 15
    <9c58b>   DW_AT_type        : <0x9c090>
    <9c58f>   DW_AT_data_member_location: 0
 <2><9c590>: Abbrev Number: 20 (DW_TAG_member)
    <9c591>   DW_AT_name        : h
    <9c593>   DW_AT_decl_file   : 5
    <9c593>   DW_AT_decl_line   : 340
    <9c595>   DW_AT_decl_column : 15
    <9c595>   DW_AT_type        : <0x9c090>
    <9c599>   DW_AT_data_member_location: 4
 <2><9c59a>: Abbrev Number: 7 (DW_TAG_member)
    <9c59b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9c59f>   DW_AT_decl_file   : 5
    <9c59f>   DW_AT_decl_line   : 341
    <9c5a1>   DW_AT_decl_column : 23
    <9c5a2>   DW_AT_type        : <0x9c642>
    <9c5a6>   DW_AT_data_member_location: 8
 <2><9c5a7>: Abbrev Number: 0
 <1><9c5a8>: Abbrev Number: 9 (DW_TAG_const_type)
    <9c5a9>   DW_AT_type        : <0x9c57b>
 <1><9c5ad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c5ae>   DW_AT_byte_size   : 8
    <9c5ae>   DW_AT_type        : <0x9c5a8>
 <1><9c5b2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c5b3>   DW_AT_byte_size   : 8
    <9c5b3>   DW_AT_type        : <0x9c5b7>
 <1><9c5b7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c5b8>   DW_AT_byte_size   : 8
    <9c5b8>   DW_AT_type        : <0x9c2a9>
 <1><9c5bc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c5bd>   DW_AT_byte_size   : 8
    <9c5bd>   DW_AT_type        : <0x9c15c>
 <1><9c5c1>: Abbrev Number: 10 (DW_TAG_typedef)
    <9c5c2>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9c5c6>   DW_AT_decl_file   : 5
    <9c5c7>   DW_AT_decl_line   : 176
    <9c5c8>   DW_AT_decl_column : 3
    <9c5c9>   DW_AT_type        : <0x9c2b5>
 <1><9c5cd>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <9c5ce>   DW_AT_prototyped  : 1
    <9c5ce>   DW_AT_type        : <0x9c084>
    <9c5d2>   DW_AT_sibling     : <0x9c5f5>
 <2><9c5d6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5d7>   DW_AT_type        : <0x9c09c>
 <2><9c5db>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5dc>   DW_AT_type        : <0x9c084>
 <2><9c5e0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5e1>   DW_AT_type        : <0x9c084>
 <2><9c5e5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5e6>   DW_AT_type        : <0x9c084>
 <2><9c5ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5eb>   DW_AT_type        : <0x9c084>
 <2><9c5ef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c5f0>   DW_AT_type        : <0x9c084>
 <2><9c5f4>: Abbrev Number: 0
 <1><9c5f5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c5f6>   DW_AT_byte_size   : 8
    <9c5f6>   DW_AT_type        : <0x9c5cd>
 <1><9c5fa>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <9c5fb>   DW_AT_prototyped  : 1
    <9c5fb>   DW_AT_sibling     : <0x9c614>
 <2><9c5ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c600>   DW_AT_type        : <0x9c084>
 <2><9c604>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c605>   DW_AT_type        : <0x9c084>
 <2><9c609>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c60a>   DW_AT_type        : <0x9c084>
 <2><9c60e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c60f>   DW_AT_type        : <0x9c084>
 <2><9c613>: Abbrev Number: 0
 <1><9c614>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c615>   DW_AT_byte_size   : 8
    <9c615>   DW_AT_type        : <0x9c5fa>
 <1><9c619>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <9c61a>   DW_AT_prototyped  : 1
    <9c61a>   DW_AT_sibling     : <0x9c624>
 <2><9c61e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c61f>   DW_AT_type        : <0x9c09c>
 <2><9c623>: Abbrev Number: 0
 <1><9c624>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c625>   DW_AT_byte_size   : 8
    <9c625>   DW_AT_type        : <0x9c619>
 <1><9c629>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <9c62a>   DW_AT_prototyped  : 1
    <9c62a>   DW_AT_type        : <0x9c23b>
    <9c62e>   DW_AT_sibling     : <0x9c63d>
 <2><9c632>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c633>   DW_AT_type        : <0x9c084>
 <2><9c637>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c638>   DW_AT_type        : <0x9c23b>
 <2><9c63c>: Abbrev Number: 0
 <1><9c63d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c63e>   DW_AT_byte_size   : 8
    <9c63e>   DW_AT_type        : <0x9c629>
 <1><9c642>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c643>   DW_AT_byte_size   : 8
    <9c643>   DW_AT_type        : <0x9c05c>
 <1><9c647>: Abbrev Number: 34 (DW_TAG_variable)
    <9c648>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <9c64c>   DW_AT_decl_file   : 5
    <9c64d>   DW_AT_decl_line   : 364
    <9c64f>   DW_AT_decl_column : 15
    <9c650>   DW_AT_type        : <0x9c654>
    <9c654>   DW_AT_external    : 1
    <9c654>   DW_AT_declaration : 1
 <1><9c654>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9c655>   DW_AT_byte_size   : 8
    <9c655>   DW_AT_type        : <0x9c5c1>
 <1><9c659>: Abbrev Number: 35 (DW_TAG_subprogram)
    <9c65a>   DW_AT_external    : 1
    <9c65a>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <9c65e>   DW_AT_decl_file   : 6
    <9c65f>   DW_AT_decl_line   : 50
    <9c660>   DW_AT_decl_column : 22
    <9c661>   DW_AT_prototyped  : 1
    <9c661>   DW_AT_type        : <0x9c084>
    <9c665>   DW_AT_declaration : 1
    <9c665>   DW_AT_sibling     : <0x9c66f>
 <2><9c669>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c66a>   DW_AT_type        : <0x9c084>
 <2><9c66e>: Abbrev Number: 0
 <1><9c66f>: Abbrev Number: 36 (DW_TAG_subprogram)
    <9c670>   DW_AT_external    : 1
    <9c670>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <9c674>   DW_AT_decl_file   : 5
    <9c675>   DW_AT_decl_line   : 470
    <9c677>   DW_AT_decl_column : 20
    <9c678>   DW_AT_prototyped  : 1
    <9c678>   DW_AT_declaration : 1
    <9c678>   DW_AT_sibling     : <0x9c687>
 <2><9c67c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c67d>   DW_AT_type        : <0x9c084>
 <2><9c681>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c682>   DW_AT_type        : <0x9c084>
 <2><9c686>: Abbrev Number: 0
 <1><9c687>: Abbrev Number: 37 (DW_TAG_subprogram)
    <9c688>   DW_AT_external    : 1
    <9c688>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <9c68c>   DW_AT_decl_file   : 5
    <9c68d>   DW_AT_decl_line   : 469
    <9c68f>   DW_AT_decl_column : 20
    <9c690>   DW_AT_prototyped  : 1
    <9c690>   DW_AT_declaration : 1
 <1><9c690>: Abbrev Number: 38 (DW_TAG_subprogram)
    <9c691>   DW_AT_external    : 1
    <9c691>   DW_AT_name        : (indirect string, offset: 0x18281): fb_GfxGetMouse
    <9c695>   DW_AT_decl_file   : 1
    <9c696>   DW_AT_decl_line   : 5
    <9c697>   DW_AT_decl_column : 5
    <9c698>   DW_AT_prototyped  : 1
    <9c698>   DW_AT_type        : <0x9c084>
    <9c69c>   DW_AT_low_pc      : 0x467ac0
    <9c6a4>   DW_AT_high_pc     : 0xfe
    <9c6ac>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9c6ae>   DW_AT_call_all_calls: 1
    <9c6ae>   DW_AT_sibling     : <0x9c7d5>
 <2><9c6b2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9c6b3>   DW_AT_name        : x
    <9c6b5>   DW_AT_decl_file   : 1
    <9c6b5>   DW_AT_decl_line   : 5
    <9c6b5>   DW_AT_decl_column : 25
    <9c6b6>   DW_AT_type        : <0x9c23b>
    <9c6ba>   DW_AT_location    : 0x2dbec (location list)
    <9c6be>   DW_AT_GNU_locviews: 0x2dbe4
 <2><9c6c2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9c6c3>   DW_AT_name        : y
    <9c6c5>   DW_AT_decl_file   : 1
    <9c6c5>   DW_AT_decl_line   : 5
    <9c6c5>   DW_AT_decl_column : 33
    <9c6c6>   DW_AT_type        : <0x9c23b>
    <9c6ca>   DW_AT_location    : 0x2dc11 (location list)
    <9c6ce>   DW_AT_GNU_locviews: 0x2dc09
 <2><9c6d2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9c6d3>   DW_AT_name        : z
    <9c6d5>   DW_AT_decl_file   : 1
    <9c6d5>   DW_AT_decl_line   : 5
    <9c6d5>   DW_AT_decl_column : 41
    <9c6d6>   DW_AT_type        : <0x9c23b>
    <9c6da>   DW_AT_location    : 0x2dc36 (location list)
    <9c6de>   DW_AT_GNU_locviews: 0x2dc2e
 <2><9c6e2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9c6e3>   DW_AT_name        : (indirect string, offset: 0x192ee): buttons
    <9c6e7>   DW_AT_decl_file   : 1
    <9c6e7>   DW_AT_decl_line   : 5
    <9c6e7>   DW_AT_decl_column : 49
    <9c6e8>   DW_AT_type        : <0x9c23b>
    <9c6ec>   DW_AT_location    : 0x2dc68 (location list)
    <9c6f0>   DW_AT_GNU_locviews: 0x2dc60
 <2><9c6f4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9c6f5>   DW_AT_name        : (indirect string, offset: 0x19429): clip
    <9c6f9>   DW_AT_decl_file   : 1
    <9c6f9>   DW_AT_decl_line   : 5
    <9c6f9>   DW_AT_decl_column : 63
    <9c6fa>   DW_AT_type        : <0x9c23b>
    <9c6fe>   DW_AT_location    : 0x2dc9a (location list)
    <9c702>   DW_AT_GNU_locviews: 0x2dc92
 <2><9c706>: Abbrev Number: 39 (DW_TAG_variable)
    <9c707>   DW_AT_name        : (indirect string, offset: 0x1a710): failure
    <9c70b>   DW_AT_decl_file   : 1
    <9c70c>   DW_AT_decl_line   : 7
    <9c70d>   DW_AT_decl_column : 6
    <9c70e>   DW_AT_type        : <0x9c084>
    <9c712>   DW_AT_location    : 0x2dccc (location list)
    <9c716>   DW_AT_GNU_locviews: 0x2dcc4
 <2><9c71a>: Abbrev Number: 14 (DW_TAG_variable)
    <9c71b>   DW_AT_name        : (indirect string, offset: 0x1a6fc): temp_z
    <9c71f>   DW_AT_decl_file   : 1
    <9c71f>   DW_AT_decl_line   : 8
    <9c71f>   DW_AT_decl_column : 6
    <9c720>   DW_AT_type        : <0x9c084>
    <9c724>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><9c728>: Abbrev Number: 14 (DW_TAG_variable)
    <9c729>   DW_AT_name        : (indirect string, offset: 0x1a703): temp_buttons
    <9c72d>   DW_AT_decl_file   : 1
    <9c72d>   DW_AT_decl_line   : 8
    <9c72d>   DW_AT_decl_column : 14
    <9c72e>   DW_AT_type        : <0x9c084>
    <9c732>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><9c736>: Abbrev Number: 14 (DW_TAG_variable)
    <9c737>   DW_AT_name        : (indirect string, offset: 0x1a6f2): temp_clip
    <9c73b>   DW_AT_decl_file   : 1
    <9c73b>   DW_AT_decl_line   : 8
    <9c73b>   DW_AT_decl_column : 28
    <9c73c>   DW_AT_type        : <0x9c084>
    <9c740>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><9c744>: Abbrev Number: 23 (DW_TAG_call_site)
    <9c745>   DW_AT_call_return_pc: 0x467b2d
    <9c74d>   DW_AT_call_origin : <0x9c687>
 <2><9c751>: Abbrev Number: 40 (DW_TAG_call_site)
    <9c752>   DW_AT_call_return_pc: 0x467b4a
    <9c75a>   DW_AT_sibling     : <0x9c77d>
 <3><9c75e>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c75f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9c761>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><9c764>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c765>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9c767>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><9c76a>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c76b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <9c76d>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><9c770>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c771>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <9c773>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><9c776>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c777>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <9c779>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><9c77c>: Abbrev Number: 0
 <2><9c77d>: Abbrev Number: 15 (DW_TAG_call_site)
    <9c77e>   DW_AT_call_return_pc: 0x467b59
    <9c786>   DW_AT_call_origin : <0x9c66f>
    <9c78a>   DW_AT_sibling     : <0x9c799>
 <3><9c78e>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c78f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9c791>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><9c793>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c794>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9c796>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><9c798>: Abbrev Number: 0
 <2><9c799>: Abbrev Number: 15 (DW_TAG_call_site)
    <9c79a>   DW_AT_call_return_pc: 0x467b8c
    <9c7a2>   DW_AT_call_origin : <0x9c659>
    <9c7a6>   DW_AT_sibling     : <0x9c7b0>
 <3><9c7aa>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c7ab>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9c7ad>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><9c7af>: Abbrev Number: 0
 <2><9c7b0>: Abbrev Number: 15 (DW_TAG_call_site)
    <9c7b1>   DW_AT_call_return_pc: 0x467bb7
    <9c7b9>   DW_AT_call_origin : <0x9c659>
    <9c7bd>   DW_AT_sibling     : <0x9c7c7>
 <3><9c7c1>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <9c7c2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9c7c4>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><9c7c6>: Abbrev Number: 0
 <2><9c7c7>: Abbrev Number: 23 (DW_TAG_call_site)
    <9c7c8>   DW_AT_call_return_pc: 0x467bbe
    <9c7d0>   DW_AT_call_origin : <0x9c7d5>
 <2><9c7d4>: Abbrev Number: 0
 <1><9c7d5>: Abbrev Number: 41 (DW_TAG_subprogram)
    <9c7d6>   DW_AT_external    : 1
    <9c7d6>   DW_AT_declaration : 1
    <9c7d6>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <9c7da>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><9c7de>: Abbrev Number: 0
  Compilation Unit @ offset 0x9c7df:
   Length:        0x13e0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x76c6
   Pointer Size:  8
 <0><9c7eb>: Abbrev Number: 36 (DW_TAG_compile_unit)
    <9c7ec>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <9c7f0>   DW_AT_language    : 29	(C11)
    <9c7f1>   DW_AT_name        : (indirect line string, offset: 0x92f): src/gfxlib2/gfx_inkey.c
    <9c7f5>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <9c7f9>   DW_AT_low_pc      : 0x467bc0
    <9c801>   DW_AT_high_pc     : 0x213
    <9c809>   DW_AT_stmt_list   : 0x5c478
 <1><9c80d>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c80e>   DW_AT_byte_size   : 1
    <9c80f>   DW_AT_encoding    : 8	(unsigned char)
    <9c810>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><9c814>: Abbrev Number: 15 (DW_TAG_const_type)
    <9c815>   DW_AT_type        : <0x9c80d>
 <1><9c819>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c81a>   DW_AT_byte_size   : 2
    <9c81b>   DW_AT_encoding    : 7	(unsigned)
    <9c81c>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><9c820>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c821>   DW_AT_byte_size   : 4
    <9c822>   DW_AT_encoding    : 7	(unsigned)
    <9c823>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><9c827>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c828>   DW_AT_byte_size   : 8
    <9c829>   DW_AT_encoding    : 7	(unsigned)
    <9c82a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><9c82e>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c82f>   DW_AT_byte_size   : 1
    <9c830>   DW_AT_encoding    : 6	(signed char)
    <9c831>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><9c835>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c836>   DW_AT_byte_size   : 2
    <9c837>   DW_AT_encoding    : 5	(signed)
    <9c838>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><9c83c>: Abbrev Number: 37 (DW_TAG_base_type)
    <9c83d>   DW_AT_byte_size   : 4
    <9c83e>   DW_AT_encoding    : 5	(signed)
    <9c83f>   DW_AT_name        : int
 <1><9c843>: Abbrev Number: 38 (DW_TAG_volatile_type)
    <9c844>   DW_AT_type        : <0x9c83c>
 <1><9c848>: Abbrev Number: 15 (DW_TAG_const_type)
    <9c849>   DW_AT_type        : <0x9c83c>
 <1><9c84d>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c84e>   DW_AT_byte_size   : 8
    <9c84f>   DW_AT_encoding    : 5	(signed)
    <9c850>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9c854>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c855>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <9c859>   DW_AT_decl_file   : 2
    <9c85a>   DW_AT_decl_line   : 153
    <9c85b>   DW_AT_decl_column : 27
    <9c85c>   DW_AT_type        : <0x9c84d>
 <1><9c860>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <9c861>   DW_AT_byte_size   : 8
 <1><9c862>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c863>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <9c867>   DW_AT_decl_file   : 2
    <9c868>   DW_AT_decl_line   : 194
    <9c869>   DW_AT_decl_column : 27
    <9c86a>   DW_AT_type        : <0x9c84d>
 <1><9c86e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c86f>   DW_AT_byte_size   : 8
    <9c86f>   DW_AT_type        : <0x9c873>
 <1><9c873>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c874>   DW_AT_byte_size   : 1
    <9c875>   DW_AT_encoding    : 6	(signed char)
    <9c876>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><9c87a>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c87b>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <9c87f>   DW_AT_decl_file   : 3
    <9c880>   DW_AT_decl_line   : 209
    <9c881>   DW_AT_decl_column : 23
    <9c882>   DW_AT_type        : <0x9c827>
 <1><9c886>: Abbrev Number: 25 (DW_TAG_typedef)
    <9c887>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <9c88b>   DW_AT_decl_file   : 3
    <9c88c>   DW_AT_decl_line   : 321
    <9c88e>   DW_AT_decl_column : 24
    <9c88f>   DW_AT_type        : <0x9c83c>
 <1><9c893>: Abbrev Number: 15 (DW_TAG_const_type)
    <9c894>   DW_AT_type        : <0x9c886>
 <1><9c898>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c899>   DW_AT_byte_size   : 8
    <9c89a>   DW_AT_encoding    : 5	(signed)
    <9c89b>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><9c89f>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c8a0>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <9c8a4>   DW_AT_decl_file   : 4
    <9c8a5>   DW_AT_decl_line   : 87
    <9c8a6>   DW_AT_decl_column : 19
    <9c8a7>   DW_AT_type        : <0x9c854>
 <1><9c8ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c8ac>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <9c8b0>   DW_AT_decl_file   : 4
    <9c8b1>   DW_AT_decl_line   : 108
    <9c8b2>   DW_AT_decl_column : 19
    <9c8b3>   DW_AT_type        : <0x9c862>
 <1><9c8b7>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c8b8>   DW_AT_byte_size   : 8
    <9c8b9>   DW_AT_encoding    : 7	(unsigned)
    <9c8ba>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9c8be>: Abbrev Number: 23 (DW_TAG_array_type)
    <9c8bf>   DW_AT_type        : <0x9c873>
    <9c8c3>   DW_AT_sibling     : <0x9c8ce>
 <2><9c8c7>: Abbrev Number: 26 (DW_TAG_subrange_type)
    <9c8c8>   DW_AT_type        : <0x9c827>
    <9c8cc>   DW_AT_upper_bound : 3
 <2><9c8cd>: Abbrev Number: 0
 <1><9c8ce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c8cf>   DW_AT_byte_size   : 8
    <9c8cf>   DW_AT_type        : <0x9c8d3>
 <1><9c8d3>: Abbrev Number: 40 (DW_TAG_const_type)
 <1><9c8d4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c8d5>   DW_AT_byte_size   : 8
    <9c8d5>   DW_AT_type        : <0x9c86e>
 <1><9c8d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c8da>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <9c8de>   DW_AT_decl_file   : 5
    <9c8df>   DW_AT_decl_line   : 22
    <9c8e0>   DW_AT_decl_column : 15
    <9c8e1>   DW_AT_type        : <0x9c89f>
 <1><9c8e5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c8e6>   DW_AT_byte_size   : 8
    <9c8e6>   DW_AT_type        : <0x9c8ea>
 <1><9c8ea>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <9c8eb>   DW_AT_prototyped  : 1
 <1><9c8eb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c8ec>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <9c8f0>   DW_AT_byte_size   : 24
    <9c8f1>   DW_AT_decl_file   : 6
    <9c8f2>   DW_AT_decl_line   : 82
    <9c8f3>   DW_AT_decl_column : 16
    <9c8f4>   DW_AT_sibling     : <0x9c920>
 <2><9c8f8>: Abbrev Number: 1 (DW_TAG_member)
    <9c8f9>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9c8fd>   DW_AT_decl_file   : 6
    <9c8fe>   DW_AT_decl_line   : 83
    <9c8ff>   DW_AT_decl_column : 21
    <9c900>   DW_AT_type        : <0x9c86e>
    <9c904>   DW_AT_data_member_location: 0
 <2><9c905>: Abbrev Number: 8 (DW_TAG_member)
    <9c906>   DW_AT_name        : len
    <9c90a>   DW_AT_decl_file   : 6
    <9c90b>   DW_AT_decl_line   : 84
    <9c90c>   DW_AT_decl_column : 21
    <9c90d>   DW_AT_type        : <0x9c8ab>
    <9c911>   DW_AT_data_member_location: 8
 <2><9c912>: Abbrev Number: 1 (DW_TAG_member)
    <9c913>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <9c917>   DW_AT_decl_file   : 6
    <9c918>   DW_AT_decl_line   : 85
    <9c919>   DW_AT_decl_column : 21
    <9c91a>   DW_AT_type        : <0x9c8ab>
    <9c91e>   DW_AT_data_member_location: 16
 <2><9c91f>: Abbrev Number: 0
 <1><9c920>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c921>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <9c925>   DW_AT_decl_file   : 6
    <9c926>   DW_AT_decl_line   : 86
    <9c927>   DW_AT_decl_column : 3
    <9c928>   DW_AT_type        : <0x9c8eb>
 <1><9c92c>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c92d>   DW_AT_byte_size   : 8
    <9c92e>   DW_AT_encoding    : 4	(float)
    <9c92f>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9c933>: Abbrev Number: 10 (DW_TAG_base_type)
    <9c934>   DW_AT_byte_size   : 4
    <9c935>   DW_AT_encoding    : 4	(float)
    <9c936>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9c93a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c93b>   DW_AT_byte_size   : 8
    <9c93b>   DW_AT_type        : <0x9c886>
 <1><9c93f>: Abbrev Number: 42 (DW_TAG_enumeration_type)
    <9c940>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <9c944>   DW_AT_encoding    : 7	(unsigned)
    <9c945>   DW_AT_byte_size   : 4
    <9c946>   DW_AT_type        : <0x9c820>
    <9c94a>   DW_AT_decl_file   : 7
    <9c94b>   DW_AT_decl_line   : 25
    <9c94c>   DW_AT_decl_column : 14
    <9c94d>   DW_AT_sibling     : <0x9c96a>
 <2><9c951>: Abbrev Number: 9 (DW_TAG_enumerator)
    <9c952>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <9c956>   DW_AT_const_value : 0
 <2><9c957>: Abbrev Number: 9 (DW_TAG_enumerator)
    <9c958>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <9c95c>   DW_AT_const_value : 1
 <2><9c95d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <9c95e>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <9c962>   DW_AT_const_value : 2
 <2><9c963>: Abbrev Number: 9 (DW_TAG_enumerator)
    <9c964>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <9c968>   DW_AT_const_value : 3
 <2><9c969>: Abbrev Number: 0
 <1><9c96a>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c96b>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <9c96f>   DW_AT_decl_file   : 7
    <9c970>   DW_AT_decl_line   : 30
    <9c971>   DW_AT_decl_column : 3
    <9c972>   DW_AT_type        : <0x9c93f>
 <1><9c976>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c977>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <9c97b>   DW_AT_decl_file   : 7
    <9c97c>   DW_AT_decl_line   : 54
    <9c97d>   DW_AT_decl_column : 15
    <9c97e>   DW_AT_type        : <0x9c982>
 <1><9c982>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c983>   DW_AT_byte_size   : 8
    <9c983>   DW_AT_type        : <0x9c987>
 <1><9c987>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9c988>   DW_AT_prototyped  : 1
    <9c988>   DW_AT_type        : <0x9c83c>
    <9c98c>   DW_AT_sibling     : <0x9c99b>
 <2><9c990>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c991>   DW_AT_type        : <0x9c99b>
 <2><9c995>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c996>   DW_AT_type        : <0x9c83c>
 <2><9c99a>: Abbrev Number: 0
 <1><9c99b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9c99c>   DW_AT_byte_size   : 8
    <9c99c>   DW_AT_type        : <0x9c9a0>
 <1><9c9a0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9c9a1>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <9c9a5>   DW_AT_byte_size   : 80
    <9c9a6>   DW_AT_decl_file   : 7
    <9c9a7>   DW_AT_decl_line   : 97
    <9c9a8>   DW_AT_decl_column : 16
    <9c9a9>   DW_AT_sibling     : <0x9ca64>
 <2><9c9ad>: Abbrev Number: 1 (DW_TAG_member)
    <9c9ae>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <9c9b2>   DW_AT_decl_file   : 7
    <9c9b3>   DW_AT_decl_line   : 98
    <9c9b4>   DW_AT_decl_column : 21
    <9c9b5>   DW_AT_type        : <0x9c83c>
    <9c9b9>   DW_AT_data_member_location: 0
 <2><9c9ba>: Abbrev Number: 8 (DW_TAG_member)
    <9c9bb>   DW_AT_name        : len
    <9c9bf>   DW_AT_decl_file   : 7
    <9c9c0>   DW_AT_decl_line   : 99
    <9c9c1>   DW_AT_decl_column : 21
    <9c9c2>   DW_AT_type        : <0x9c83c>
    <9c9c6>   DW_AT_data_member_location: 4
 <2><9c9c7>: Abbrev Number: 1 (DW_TAG_member)
    <9c9c8>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <9c9cc>   DW_AT_decl_file   : 7
    <9c9cd>   DW_AT_decl_line   : 100
    <9c9ce>   DW_AT_decl_column : 21
    <9c9cf>   DW_AT_type        : <0x9c96a>
    <9c9d3>   DW_AT_data_member_location: 8
 <2><9c9d4>: Abbrev Number: 1 (DW_TAG_member)
    <9c9d5>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <9c9d9>   DW_AT_decl_file   : 7
    <9c9da>   DW_AT_decl_line   : 101
    <9c9db>   DW_AT_decl_column : 21
    <9c9dc>   DW_AT_type        : <0x9c8d9>
    <9c9e0>   DW_AT_data_member_location: 16
 <2><9c9e1>: Abbrev Number: 1 (DW_TAG_member)
    <9c9e2>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9c9e6>   DW_AT_decl_file   : 7
    <9c9e7>   DW_AT_decl_line   : 102
    <9c9e8>   DW_AT_decl_column : 21
    <9c9e9>   DW_AT_type        : <0x9c83c>
    <9c9ed>   DW_AT_data_member_location: 24
 <2><9c9ee>: Abbrev Number: 1 (DW_TAG_member)
    <9c9ef>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <9c9f3>   DW_AT_decl_file   : 7
    <9c9f4>   DW_AT_decl_line   : 103
    <9c9f5>   DW_AT_decl_column : 21
    <9c9f6>   DW_AT_type        : <0x9c83c>
    <9c9fa>   DW_AT_data_member_location: 28
 <2><9c9fb>: Abbrev Number: 1 (DW_TAG_member)
    <9c9fc>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <9ca00>   DW_AT_decl_file   : 7
    <9ca01>   DW_AT_decl_line   : 104
    <9ca02>   DW_AT_decl_column : 21
    <9ca03>   DW_AT_type        : <0x9c83c>
    <9ca07>   DW_AT_data_member_location: 32
 <2><9ca08>: Abbrev Number: 1 (DW_TAG_member)
    <9ca09>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <9ca0d>   DW_AT_decl_file   : 7
    <9ca0e>   DW_AT_decl_line   : 105
    <9ca0f>   DW_AT_decl_column : 21
    <9ca10>   DW_AT_type        : <0x9c820>
    <9ca14>   DW_AT_data_member_location: 36
 <2><9ca15>: Abbrev Number: 1 (DW_TAG_member)
    <9ca16>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <9ca1a>   DW_AT_decl_file   : 7
    <9ca1b>   DW_AT_decl_line   : 106
    <9ca1c>   DW_AT_decl_column : 21
    <9ca1d>   DW_AT_type        : <0x9c820>
    <9ca21>   DW_AT_data_member_location: 40
 <2><9ca22>: Abbrev Number: 1 (DW_TAG_member)
    <9ca23>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <9ca27>   DW_AT_decl_file   : 7
    <9ca28>   DW_AT_decl_line   : 109
    <9ca29>   DW_AT_decl_column : 21
    <9ca2a>   DW_AT_type        : <0x9c8be>
    <9ca2e>   DW_AT_data_member_location: 44
 <2><9ca2f>: Abbrev Number: 1 (DW_TAG_member)
    <9ca30>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <9ca34>   DW_AT_decl_file   : 7
    <9ca35>   DW_AT_decl_line   : 110
    <9ca36>   DW_AT_decl_column : 21
    <9ca37>   DW_AT_type        : <0x9c87a>
    <9ca3b>   DW_AT_data_member_location: 48
 <2><9ca3c>: Abbrev Number: 1 (DW_TAG_member)
    <9ca3d>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <9ca41>   DW_AT_decl_file   : 7
    <9ca42>   DW_AT_decl_line   : 112
    <9ca43>   DW_AT_decl_column : 22
    <9ca44>   DW_AT_type        : <0x9ccfc>
    <9ca48>   DW_AT_data_member_location: 56
 <2><9ca49>: Abbrev Number: 1 (DW_TAG_member)
    <9ca4a>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <9ca4e>   DW_AT_decl_file   : 7
    <9ca4f>   DW_AT_decl_line   : 114
    <9ca50>   DW_AT_decl_column : 14
    <9ca51>   DW_AT_type        : <0x9c860>
    <9ca55>   DW_AT_data_member_location: 64
 <2><9ca56>: Abbrev Number: 1 (DW_TAG_member)
    <9ca57>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <9ca5b>   DW_AT_decl_file   : 7
    <9ca5c>   DW_AT_decl_line   : 116
    <9ca5d>   DW_AT_decl_column : 22
    <9ca5e>   DW_AT_type        : <0x9c99b>
    <9ca62>   DW_AT_data_member_location: 72
 <2><9ca63>: Abbrev Number: 0
 <1><9ca64>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ca65>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <9ca69>   DW_AT_decl_file   : 7
    <9ca6a>   DW_AT_decl_line   : 59
    <9ca6b>   DW_AT_decl_column : 15
    <9ca6c>   DW_AT_type        : <0x9ca70>
 <1><9ca70>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ca71>   DW_AT_byte_size   : 8
    <9ca71>   DW_AT_type        : <0x9ca75>
 <1><9ca75>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9ca76>   DW_AT_prototyped  : 1
    <9ca76>   DW_AT_type        : <0x9c83c>
    <9ca7a>   DW_AT_sibling     : <0x9ca84>
 <2><9ca7e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ca7f>   DW_AT_type        : <0x9c99b>
 <2><9ca83>: Abbrev Number: 0
 <1><9ca84>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ca85>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <9ca89>   DW_AT_decl_file   : 7
    <9ca8a>   DW_AT_decl_line   : 60
    <9ca8b>   DW_AT_decl_column : 15
    <9ca8c>   DW_AT_type        : <0x9ca70>
 <1><9ca90>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ca91>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <9ca95>   DW_AT_decl_file   : 7
    <9ca96>   DW_AT_decl_line   : 61
    <9ca97>   DW_AT_decl_column : 15
    <9ca98>   DW_AT_type        : <0x9ca9c>
 <1><9ca9c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ca9d>   DW_AT_byte_size   : 8
    <9ca9d>   DW_AT_type        : <0x9caa1>
 <1><9caa1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9caa2>   DW_AT_prototyped  : 1
    <9caa2>   DW_AT_type        : <0x9c83c>
    <9caa6>   DW_AT_sibling     : <0x9caba>
 <2><9caaa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9caab>   DW_AT_type        : <0x9c99b>
 <2><9caaf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cab0>   DW_AT_type        : <0x9c8d9>
 <2><9cab4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cab5>   DW_AT_type        : <0x9c83c>
 <2><9cab9>: Abbrev Number: 0
 <1><9caba>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cabb>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <9cabf>   DW_AT_decl_file   : 7
    <9cac0>   DW_AT_decl_line   : 62
    <9cac1>   DW_AT_decl_column : 15
    <9cac2>   DW_AT_type        : <0x9cac6>
 <1><9cac6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cac7>   DW_AT_byte_size   : 8
    <9cac7>   DW_AT_type        : <0x9cacb>
 <1><9cacb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cacc>   DW_AT_prototyped  : 1
    <9cacc>   DW_AT_type        : <0x9c83c>
    <9cad0>   DW_AT_sibling     : <0x9cadf>
 <2><9cad4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cad5>   DW_AT_type        : <0x9c99b>
 <2><9cad9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cada>   DW_AT_type        : <0x9cadf>
 <2><9cade>: Abbrev Number: 0
 <1><9cadf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cae0>   DW_AT_byte_size   : 8
    <9cae0>   DW_AT_type        : <0x9c8d9>
 <1><9cae4>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cae5>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <9cae9>   DW_AT_decl_file   : 7
    <9caea>   DW_AT_decl_line   : 63
    <9caeb>   DW_AT_decl_column : 15
    <9caec>   DW_AT_type        : <0x9caf0>
 <1><9caf0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9caf1>   DW_AT_byte_size   : 8
    <9caf1>   DW_AT_type        : <0x9caf5>
 <1><9caf5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9caf6>   DW_AT_prototyped  : 1
    <9caf6>   DW_AT_type        : <0x9c83c>
    <9cafa>   DW_AT_sibling     : <0x9cb0e>
 <2><9cafe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9caff>   DW_AT_type        : <0x9c99b>
 <2><9cb03>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb04>   DW_AT_type        : <0x9c860>
 <2><9cb08>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb09>   DW_AT_type        : <0x9cb0e>
 <2><9cb0d>: Abbrev Number: 0
 <1><9cb0e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cb0f>   DW_AT_byte_size   : 8
    <9cb0f>   DW_AT_type        : <0x9c87a>
 <1><9cb13>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cb14>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <9cb18>   DW_AT_decl_file   : 7
    <9cb19>   DW_AT_decl_line   : 65
    <9cb1a>   DW_AT_decl_column : 15
    <9cb1b>   DW_AT_type        : <0x9cb1f>
 <1><9cb1f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cb20>   DW_AT_byte_size   : 8
    <9cb20>   DW_AT_type        : <0x9cb24>
 <1><9cb24>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cb25>   DW_AT_prototyped  : 1
    <9cb25>   DW_AT_type        : <0x9c83c>
    <9cb29>   DW_AT_sibling     : <0x9cb3d>
 <2><9cb2d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb2e>   DW_AT_type        : <0x9c99b>
 <2><9cb32>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb33>   DW_AT_type        : <0x9c93a>
 <2><9cb37>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb38>   DW_AT_type        : <0x9cb0e>
 <2><9cb3c>: Abbrev Number: 0
 <1><9cb3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cb3e>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <9cb42>   DW_AT_decl_file   : 7
    <9cb43>   DW_AT_decl_line   : 67
    <9cb44>   DW_AT_decl_column : 15
    <9cb45>   DW_AT_type        : <0x9cb49>
 <1><9cb49>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cb4a>   DW_AT_byte_size   : 8
    <9cb4a>   DW_AT_type        : <0x9cb4e>
 <1><9cb4e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cb4f>   DW_AT_prototyped  : 1
    <9cb4f>   DW_AT_type        : <0x9c83c>
    <9cb53>   DW_AT_sibling     : <0x9cb67>
 <2><9cb57>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb58>   DW_AT_type        : <0x9c99b>
 <2><9cb5c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb5d>   DW_AT_type        : <0x9c8ce>
 <2><9cb61>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb62>   DW_AT_type        : <0x9c87a>
 <2><9cb66>: Abbrev Number: 0
 <1><9cb67>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cb68>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <9cb6c>   DW_AT_decl_file   : 7
    <9cb6d>   DW_AT_decl_line   : 69
    <9cb6e>   DW_AT_decl_column : 15
    <9cb6f>   DW_AT_type        : <0x9cb73>
 <1><9cb73>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cb74>   DW_AT_byte_size   : 8
    <9cb74>   DW_AT_type        : <0x9cb78>
 <1><9cb78>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cb79>   DW_AT_prototyped  : 1
    <9cb79>   DW_AT_type        : <0x9c83c>
    <9cb7d>   DW_AT_sibling     : <0x9cb91>
 <2><9cb81>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb82>   DW_AT_type        : <0x9c99b>
 <2><9cb86>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb87>   DW_AT_type        : <0x9cb91>
 <2><9cb8b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cb8c>   DW_AT_type        : <0x9c87a>
 <2><9cb90>: Abbrev Number: 0
 <1><9cb91>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cb92>   DW_AT_byte_size   : 8
    <9cb92>   DW_AT_type        : <0x9c893>
 <1><9cb96>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cb97>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <9cb9b>   DW_AT_decl_file   : 7
    <9cb9c>   DW_AT_decl_line   : 71
    <9cb9d>   DW_AT_decl_column : 15
    <9cb9e>   DW_AT_type        : <0x9cba2>
 <1><9cba2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cba3>   DW_AT_byte_size   : 8
    <9cba3>   DW_AT_type        : <0x9cba7>
 <1><9cba7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cba8>   DW_AT_prototyped  : 1
    <9cba8>   DW_AT_type        : <0x9c83c>
    <9cbac>   DW_AT_sibling     : <0x9cbc0>
 <2><9cbb0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cbb1>   DW_AT_type        : <0x9c99b>
 <2><9cbb5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cbb6>   DW_AT_type        : <0x9c8d9>
 <2><9cbba>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cbbb>   DW_AT_type        : <0x9c8d9>
 <2><9cbbf>: Abbrev Number: 0
 <1><9cbc0>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cbc1>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <9cbc5>   DW_AT_decl_file   : 7
    <9cbc6>   DW_AT_decl_line   : 73
    <9cbc7>   DW_AT_decl_column : 15
    <9cbc8>   DW_AT_type        : <0x9cba2>
 <1><9cbcc>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cbcd>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <9cbd1>   DW_AT_decl_file   : 7
    <9cbd2>   DW_AT_decl_line   : 75
    <9cbd3>   DW_AT_decl_column : 15
    <9cbd4>   DW_AT_type        : <0x9cbd8>
 <1><9cbd8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cbd9>   DW_AT_byte_size   : 8
    <9cbd9>   DW_AT_type        : <0x9cbdd>
 <1><9cbdd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cbde>   DW_AT_prototyped  : 1
    <9cbde>   DW_AT_type        : <0x9c83c>
    <9cbe2>   DW_AT_sibling     : <0x9cbf1>
 <2><9cbe6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cbe7>   DW_AT_type        : <0x9c99b>
 <2><9cbeb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cbec>   DW_AT_type        : <0x9cbf1>
 <2><9cbf0>: Abbrev Number: 0
 <1><9cbf1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cbf2>   DW_AT_byte_size   : 8
    <9cbf2>   DW_AT_type        : <0x9c920>
 <1><9cbf6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cbf7>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <9cbfb>   DW_AT_decl_file   : 7
    <9cbfc>   DW_AT_decl_line   : 76
    <9cbfd>   DW_AT_decl_column : 15
    <9cbfe>   DW_AT_type        : <0x9cc02>
 <1><9cc02>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cc03>   DW_AT_byte_size   : 8
    <9cc03>   DW_AT_type        : <0x9cc07>
 <1><9cc07>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cc08>   DW_AT_prototyped  : 1
    <9cc08>   DW_AT_type        : <0x9c83c>
    <9cc0c>   DW_AT_sibling     : <0x9cc20>
 <2><9cc10>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cc11>   DW_AT_type        : <0x9c99b>
 <2><9cc15>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cc16>   DW_AT_type        : <0x9c93a>
 <2><9cc1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cc1b>   DW_AT_type        : <0x9c8ab>
 <2><9cc1f>: Abbrev Number: 0
 <1><9cc20>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cc21>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <9cc25>   DW_AT_decl_file   : 7
    <9cc26>   DW_AT_decl_line   : 77
    <9cc27>   DW_AT_decl_column : 15
    <9cc28>   DW_AT_type        : <0x9ca70>
 <1><9cc2c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9cc2d>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <9cc31>   DW_AT_byte_size   : 112
    <9cc32>   DW_AT_decl_file   : 7
    <9cc33>   DW_AT_decl_line   : 80
    <9cc34>   DW_AT_decl_column : 16
    <9cc35>   DW_AT_sibling     : <0x9ccf0>
 <2><9cc39>: Abbrev Number: 1 (DW_TAG_member)
    <9cc3a>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <9cc3e>   DW_AT_decl_file   : 7
    <9cc3f>   DW_AT_decl_line   : 81
    <9cc40>   DW_AT_decl_column : 25
    <9cc41>   DW_AT_type        : <0x9ca64>
    <9cc45>   DW_AT_data_member_location: 0
 <2><9cc46>: Abbrev Number: 1 (DW_TAG_member)
    <9cc47>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <9cc4b>   DW_AT_decl_file   : 7
    <9cc4c>   DW_AT_decl_line   : 82
    <9cc4d>   DW_AT_decl_column : 25
    <9cc4e>   DW_AT_type        : <0x9ca84>
    <9cc52>   DW_AT_data_member_location: 8
 <2><9cc53>: Abbrev Number: 1 (DW_TAG_member)
    <9cc54>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <9cc58>   DW_AT_decl_file   : 7
    <9cc59>   DW_AT_decl_line   : 83
    <9cc5a>   DW_AT_decl_column : 25
    <9cc5b>   DW_AT_type        : <0x9ca90>
    <9cc5f>   DW_AT_data_member_location: 16
 <2><9cc60>: Abbrev Number: 1 (DW_TAG_member)
    <9cc61>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <9cc65>   DW_AT_decl_file   : 7
    <9cc66>   DW_AT_decl_line   : 84
    <9cc67>   DW_AT_decl_column : 25
    <9cc68>   DW_AT_type        : <0x9caba>
    <9cc6c>   DW_AT_data_member_location: 24
 <2><9cc6d>: Abbrev Number: 1 (DW_TAG_member)
    <9cc6e>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <9cc72>   DW_AT_decl_file   : 7
    <9cc73>   DW_AT_decl_line   : 85
    <9cc74>   DW_AT_decl_column : 25
    <9cc75>   DW_AT_type        : <0x9cae4>
    <9cc79>   DW_AT_data_member_location: 32
 <2><9cc7a>: Abbrev Number: 1 (DW_TAG_member)
    <9cc7b>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <9cc7f>   DW_AT_decl_file   : 7
    <9cc80>   DW_AT_decl_line   : 86
    <9cc81>   DW_AT_decl_column : 25
    <9cc82>   DW_AT_type        : <0x9cb13>
    <9cc86>   DW_AT_data_member_location: 40
 <2><9cc87>: Abbrev Number: 1 (DW_TAG_member)
    <9cc88>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <9cc8c>   DW_AT_decl_file   : 7
    <9cc8d>   DW_AT_decl_line   : 87
    <9cc8e>   DW_AT_decl_column : 25
    <9cc8f>   DW_AT_type        : <0x9cb3d>
    <9cc93>   DW_AT_data_member_location: 48
 <2><9cc94>: Abbrev Number: 1 (DW_TAG_member)
    <9cc95>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <9cc99>   DW_AT_decl_file   : 7
    <9cc9a>   DW_AT_decl_line   : 88
    <9cc9b>   DW_AT_decl_column : 25
    <9cc9c>   DW_AT_type        : <0x9cb67>
    <9cca0>   DW_AT_data_member_location: 56
 <2><9cca1>: Abbrev Number: 1 (DW_TAG_member)
    <9cca2>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <9cca6>   DW_AT_decl_file   : 7
    <9cca7>   DW_AT_decl_line   : 89
    <9cca8>   DW_AT_decl_column : 25
    <9cca9>   DW_AT_type        : <0x9cb96>
    <9ccad>   DW_AT_data_member_location: 64
 <2><9ccae>: Abbrev Number: 1 (DW_TAG_member)
    <9ccaf>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <9ccb3>   DW_AT_decl_file   : 7
    <9ccb4>   DW_AT_decl_line   : 90
    <9ccb5>   DW_AT_decl_column : 25
    <9ccb6>   DW_AT_type        : <0x9cbc0>
    <9ccba>   DW_AT_data_member_location: 72
 <2><9ccbb>: Abbrev Number: 1 (DW_TAG_member)
    <9ccbc>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <9ccc0>   DW_AT_decl_file   : 7
    <9ccc1>   DW_AT_decl_line   : 91
    <9ccc2>   DW_AT_decl_column : 25
    <9ccc3>   DW_AT_type        : <0x9cbcc>
    <9ccc7>   DW_AT_data_member_location: 80
 <2><9ccc8>: Abbrev Number: 1 (DW_TAG_member)
    <9ccc9>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <9cccd>   DW_AT_decl_file   : 7
    <9ccce>   DW_AT_decl_line   : 92
    <9cccf>   DW_AT_decl_column : 25
    <9ccd0>   DW_AT_type        : <0x9cbf6>
    <9ccd4>   DW_AT_data_member_location: 88
 <2><9ccd5>: Abbrev Number: 1 (DW_TAG_member)
    <9ccd6>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <9ccda>   DW_AT_decl_file   : 7
    <9ccdb>   DW_AT_decl_line   : 93
    <9ccdc>   DW_AT_decl_column : 25
    <9ccdd>   DW_AT_type        : <0x9c976>
    <9cce1>   DW_AT_data_member_location: 96
 <2><9cce2>: Abbrev Number: 1 (DW_TAG_member)
    <9cce3>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <9cce7>   DW_AT_decl_file   : 7
    <9cce8>   DW_AT_decl_line   : 94
    <9cce9>   DW_AT_decl_column : 25
    <9ccea>   DW_AT_type        : <0x9cc20>
    <9ccee>   DW_AT_data_member_location: 104
 <2><9ccef>: Abbrev Number: 0
 <1><9ccf0>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ccf1>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <9ccf5>   DW_AT_decl_file   : 7
    <9ccf6>   DW_AT_decl_line   : 95
    <9ccf7>   DW_AT_decl_column : 3
    <9ccf8>   DW_AT_type        : <0x9cc2c>
 <1><9ccfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ccfd>   DW_AT_byte_size   : 8
    <9ccfd>   DW_AT_type        : <0x9ccf0>
 <1><9cd01>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cd02>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <9cd06>   DW_AT_decl_file   : 7
    <9cd07>   DW_AT_decl_line   : 117
    <9cd08>   DW_AT_decl_column : 3
    <9cd09>   DW_AT_type        : <0x9c9a0>
 <1><9cd0d>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cd0e>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <9cd12>   DW_AT_decl_file   : 8
    <9cd13>   DW_AT_decl_line   : 7
    <9cd14>   DW_AT_decl_column : 25
    <9cd15>   DW_AT_type        : <0x9cd19>
 <1><9cd19>: Abbrev Number: 43 (DW_TAG_structure_type)
    <9cd1a>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <9cd1e>   DW_AT_declaration : 1
 <1><9cd1e>: Abbrev Number: 27 (DW_TAG_structure_type)
    <9cd1f>   DW_AT_byte_size   : 8
    <9cd20>   DW_AT_decl_file   : 9
    <9cd20>   DW_AT_decl_line   : 4
    <9cd21>   DW_AT_decl_column : 3
    <9cd21>   DW_AT_sibling     : <0x9cd40>
 <2><9cd25>: Abbrev Number: 1 (DW_TAG_member)
    <9cd26>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9cd2a>   DW_AT_decl_file   : 9
    <9cd2b>   DW_AT_decl_line   : 5
    <9cd2c>   DW_AT_decl_column : 8
    <9cd2d>   DW_AT_type        : <0x9c83c>
    <9cd31>   DW_AT_data_member_location: 0
 <2><9cd32>: Abbrev Number: 1 (DW_TAG_member)
    <9cd33>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9cd37>   DW_AT_decl_file   : 9
    <9cd38>   DW_AT_decl_line   : 6
    <9cd39>   DW_AT_decl_column : 8
    <9cd3a>   DW_AT_type        : <0x9c83c>
    <9cd3e>   DW_AT_data_member_location: 4
 <2><9cd3f>: Abbrev Number: 0
 <1><9cd40>: Abbrev Number: 27 (DW_TAG_structure_type)
    <9cd41>   DW_AT_byte_size   : 16
    <9cd42>   DW_AT_decl_file   : 9
    <9cd42>   DW_AT_decl_line   : 8
    <9cd43>   DW_AT_decl_column : 3
    <9cd43>   DW_AT_sibling     : <0x9cd76>
 <2><9cd47>: Abbrev Number: 8 (DW_TAG_member)
    <9cd48>   DW_AT_name        : x
    <9cd4a>   DW_AT_decl_file   : 9
    <9cd4b>   DW_AT_decl_line   : 9
    <9cd4c>   DW_AT_decl_column : 8
    <9cd4d>   DW_AT_type        : <0x9c83c>
    <9cd51>   DW_AT_data_member_location: 0
 <2><9cd52>: Abbrev Number: 8 (DW_TAG_member)
    <9cd53>   DW_AT_name        : y
    <9cd55>   DW_AT_decl_file   : 9
    <9cd56>   DW_AT_decl_line   : 9
    <9cd57>   DW_AT_decl_column : 11
    <9cd58>   DW_AT_type        : <0x9c83c>
    <9cd5c>   DW_AT_data_member_location: 4
 <2><9cd5d>: Abbrev Number: 8 (DW_TAG_member)
    <9cd5e>   DW_AT_name        : dx
    <9cd61>   DW_AT_decl_file   : 9
    <9cd62>   DW_AT_decl_line   : 10
    <9cd63>   DW_AT_decl_column : 8
    <9cd64>   DW_AT_type        : <0x9c83c>
    <9cd68>   DW_AT_data_member_location: 8
 <2><9cd69>: Abbrev Number: 8 (DW_TAG_member)
    <9cd6a>   DW_AT_name        : dy
    <9cd6d>   DW_AT_decl_file   : 9
    <9cd6e>   DW_AT_decl_line   : 10
    <9cd6f>   DW_AT_decl_column : 12
    <9cd70>   DW_AT_type        : <0x9c83c>
    <9cd74>   DW_AT_data_member_location: 12
 <2><9cd75>: Abbrev Number: 0
 <1><9cd76>: Abbrev Number: 44 (DW_TAG_union_type)
    <9cd77>   DW_AT_byte_size   : 16
    <9cd78>   DW_AT_decl_file   : 9
    <9cd79>   DW_AT_decl_line   : 3
    <9cd7a>   DW_AT_decl_column : 2
    <9cd7b>   DW_AT_sibling     : <0x9cda6>
 <2><9cd7f>: Abbrev Number: 28 (DW_TAG_member)
    <9cd80>   DW_AT_type        : <0x9cd1e>
 <2><9cd84>: Abbrev Number: 28 (DW_TAG_member)
    <9cd85>   DW_AT_type        : <0x9cd40>
 <2><9cd89>: Abbrev Number: 45 (DW_TAG_member)
    <9cd8a>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <9cd8e>   DW_AT_decl_file   : 9
    <9cd8f>   DW_AT_decl_line   : 12
    <9cd90>   DW_AT_decl_column : 7
    <9cd91>   DW_AT_type        : <0x9c83c>
 <2><9cd95>: Abbrev Number: 29 (DW_TAG_member)
    <9cd96>   DW_AT_name        : z
    <9cd98>   DW_AT_decl_file   : 9
    <9cd98>   DW_AT_decl_line   : 13
    <9cd99>   DW_AT_decl_column : 7
    <9cd99>   DW_AT_type        : <0x9c83c>
 <2><9cd9d>: Abbrev Number: 29 (DW_TAG_member)
    <9cd9e>   DW_AT_name        : w
    <9cda0>   DW_AT_decl_file   : 9
    <9cda0>   DW_AT_decl_line   : 14
    <9cda1>   DW_AT_decl_column : 7
    <9cda1>   DW_AT_type        : <0x9c83c>
 <2><9cda5>: Abbrev Number: 0
 <1><9cda6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9cda7>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <9cdab>   DW_AT_byte_size   : 20
    <9cdac>   DW_AT_decl_file   : 9
    <9cdad>   DW_AT_decl_line   : 1
    <9cdae>   DW_AT_decl_column : 8
    <9cdaf>   DW_AT_sibling     : <0x9cdc7>
 <2><9cdb3>: Abbrev Number: 1 (DW_TAG_member)
    <9cdb4>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9cdb8>   DW_AT_decl_file   : 9
    <9cdb9>   DW_AT_decl_line   : 2
    <9cdba>   DW_AT_decl_column : 6
    <9cdbb>   DW_AT_type        : <0x9c83c>
    <9cdbf>   DW_AT_data_member_location: 0
 <2><9cdc0>: Abbrev Number: 46 (DW_TAG_member)
    <9cdc1>   DW_AT_type        : <0x9cd76>
    <9cdc5>   DW_AT_data_member_location: 4
 <2><9cdc6>: Abbrev Number: 0
 <1><9cdc7>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cdc8>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <9cdcc>   DW_AT_decl_file   : 9
    <9cdcd>   DW_AT_decl_line   : 18
    <9cdce>   DW_AT_decl_column : 23
    <9cdcf>   DW_AT_type        : <0x9cda6>
 <1><9cdd3>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cdd4>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <9cdd8>   DW_AT_decl_file   : 10
    <9cdd9>   DW_AT_decl_line   : 1
    <9cdda>   DW_AT_decl_column : 23
    <9cddb>   DW_AT_type        : <0x9cddf>
 <1><9cddf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cde0>   DW_AT_byte_size   : 8
    <9cde0>   DW_AT_type        : <0x9cde4>
 <1><9cde4>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <9cde5>   DW_AT_prototyped  : 1
    <9cde5>   DW_AT_type        : <0x9cbf1>
 <1><9cde9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cdea>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <9cdee>   DW_AT_decl_file   : 10
    <9cdef>   DW_AT_decl_line   : 2
    <9cdf0>   DW_AT_decl_column : 23
    <9cdf1>   DW_AT_type        : <0x9cdf5>
 <1><9cdf5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cdf6>   DW_AT_byte_size   : 8
    <9cdf6>   DW_AT_type        : <0x9cdfa>
 <1><9cdfa>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <9cdfb>   DW_AT_prototyped  : 1
    <9cdfb>   DW_AT_type        : <0x9c83c>
 <1><9cdff>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce00>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <9ce04>   DW_AT_decl_file   : 10
    <9ce05>   DW_AT_decl_line   : 3
    <9ce06>   DW_AT_decl_column : 23
    <9ce07>   DW_AT_type        : <0x9cdf5>
 <1><9ce0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce0c>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <9ce10>   DW_AT_decl_file   : 10
    <9ce11>   DW_AT_decl_line   : 10
    <9ce12>   DW_AT_decl_column : 23
    <9ce13>   DW_AT_type        : <0x9ce17>
 <1><9ce17>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ce18>   DW_AT_byte_size   : 8
    <9ce18>   DW_AT_type        : <0x9ce1c>
 <1><9ce1c>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9ce1d>   DW_AT_prototyped  : 1
    <9ce1d>   DW_AT_sibling     : <0x9ce27>
 <2><9ce21>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce22>   DW_AT_type        : <0x9c83c>
 <2><9ce26>: Abbrev Number: 0
 <1><9ce27>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce28>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <9ce2c>   DW_AT_decl_file   : 10
    <9ce2d>   DW_AT_decl_line   : 14
    <9ce2e>   DW_AT_decl_column : 23
    <9ce2f>   DW_AT_type        : <0x9ce33>
 <1><9ce33>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ce34>   DW_AT_byte_size   : 8
    <9ce34>   DW_AT_type        : <0x9ce38>
 <1><9ce38>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9ce39>   DW_AT_prototyped  : 1
    <9ce39>   DW_AT_type        : <0x9c83c>
    <9ce3d>   DW_AT_sibling     : <0x9ce51>
 <2><9ce41>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce42>   DW_AT_type        : <0x9c83c>
 <2><9ce46>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce47>   DW_AT_type        : <0x9c83c>
 <2><9ce4b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce4c>   DW_AT_type        : <0x9c83c>
 <2><9ce50>: Abbrev Number: 0
 <1><9ce51>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce52>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <9ce56>   DW_AT_decl_file   : 10
    <9ce57>   DW_AT_decl_line   : 18
    <9ce58>   DW_AT_decl_column : 23
    <9ce59>   DW_AT_type        : <0x9ce33>
 <1><9ce5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce5e>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <9ce62>   DW_AT_decl_file   : 10
    <9ce63>   DW_AT_decl_line   : 24
    <9ce64>   DW_AT_decl_column : 23
    <9ce65>   DW_AT_type        : <0x9c8e5>
 <1><9ce69>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce6a>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <9ce6e>   DW_AT_decl_file   : 10
    <9ce6f>   DW_AT_decl_line   : 28
    <9ce70>   DW_AT_decl_column : 23
    <9ce71>   DW_AT_type        : <0x9ce75>
 <1><9ce75>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ce76>   DW_AT_byte_size   : 8
    <9ce76>   DW_AT_type        : <0x9ce7a>
 <1><9ce7a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9ce7b>   DW_AT_prototyped  : 1
    <9ce7b>   DW_AT_type        : <0x9c83c>
    <9ce7f>   DW_AT_sibling     : <0x9ce8e>
 <2><9ce83>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce84>   DW_AT_type        : <0x9c83c>
 <2><9ce88>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ce89>   DW_AT_type        : <0x9c83c>
 <2><9ce8d>: Abbrev Number: 0
 <1><9ce8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce8f>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <9ce93>   DW_AT_decl_file   : 10
    <9ce94>   DW_AT_decl_line   : 34
    <9ce95>   DW_AT_decl_column : 23
    <9ce96>   DW_AT_type        : <0x9cdf5>
 <1><9ce9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce9b>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <9ce9f>   DW_AT_decl_file   : 10
    <9cea0>   DW_AT_decl_line   : 35
    <9cea1>   DW_AT_decl_column : 23
    <9cea2>   DW_AT_type        : <0x9cdf5>
 <1><9cea6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cea7>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <9ceab>   DW_AT_decl_file   : 10
    <9ceac>   DW_AT_decl_line   : 36
    <9cead>   DW_AT_decl_column : 23
    <9ceae>   DW_AT_type        : <0x9ceb2>
 <1><9ceb2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9ceb3>   DW_AT_byte_size   : 8
    <9ceb3>   DW_AT_type        : <0x9ceb7>
 <1><9ceb7>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9ceb8>   DW_AT_prototyped  : 1
    <9ceb8>   DW_AT_sibling     : <0x9cec7>
 <2><9cebc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cebd>   DW_AT_type        : <0x9cec7>
 <2><9cec1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cec2>   DW_AT_type        : <0x9cec7>
 <2><9cec6>: Abbrev Number: 0
 <1><9cec7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cec8>   DW_AT_byte_size   : 8
    <9cec8>   DW_AT_type        : <0x9c83c>
 <1><9cecc>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cecd>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <9ced1>   DW_AT_decl_file   : 10
    <9ced2>   DW_AT_decl_line   : 37
    <9ced3>   DW_AT_decl_column : 23
    <9ced4>   DW_AT_type        : <0x9ceb2>
 <1><9ced8>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ced9>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <9cedd>   DW_AT_decl_file   : 10
    <9cede>   DW_AT_decl_line   : 45
    <9cedf>   DW_AT_decl_column : 24
    <9cee0>   DW_AT_type        : <0x9cee4>
 <1><9cee4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cee5>   DW_AT_byte_size   : 8
    <9cee5>   DW_AT_type        : <0x9cee9>
 <1><9cee9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9ceea>   DW_AT_prototyped  : 1
    <9ceea>   DW_AT_type        : <0x9c820>
    <9ceee>   DW_AT_sibling     : <0x9cf02>
 <2><9cef2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cef3>   DW_AT_type        : <0x9c83c>
 <2><9cef7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cef8>   DW_AT_type        : <0x9c83c>
 <2><9cefc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cefd>   DW_AT_type        : <0x9c83c>
 <2><9cf01>: Abbrev Number: 0
 <1><9cf02>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cf03>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <9cf07>   DW_AT_decl_file   : 10
    <9cf08>   DW_AT_decl_line   : 48
    <9cf09>   DW_AT_decl_column : 23
    <9cf0a>   DW_AT_type        : <0x9cf0e>
 <1><9cf0e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cf0f>   DW_AT_byte_size   : 8
    <9cf0f>   DW_AT_type        : <0x9cf13>
 <1><9cf13>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9cf14>   DW_AT_prototyped  : 1
    <9cf14>   DW_AT_sibling     : <0x9cf28>
 <2><9cf18>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf19>   DW_AT_type        : <0x9c8ce>
 <2><9cf1d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf1e>   DW_AT_type        : <0x9c87a>
 <2><9cf22>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf23>   DW_AT_type        : <0x9c83c>
 <2><9cf27>: Abbrev Number: 0
 <1><9cf28>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cf29>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <9cf2d>   DW_AT_decl_file   : 10
    <9cf2e>   DW_AT_decl_line   : 49
    <9cf2f>   DW_AT_decl_column : 23
    <9cf30>   DW_AT_type        : <0x9cf34>
 <1><9cf34>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cf35>   DW_AT_byte_size   : 8
    <9cf35>   DW_AT_type        : <0x9cf39>
 <1><9cf39>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9cf3a>   DW_AT_prototyped  : 1
    <9cf3a>   DW_AT_sibling     : <0x9cf4e>
 <2><9cf3e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf3f>   DW_AT_type        : <0x9cb91>
 <2><9cf43>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf44>   DW_AT_type        : <0x9c87a>
 <2><9cf48>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf49>   DW_AT_type        : <0x9c83c>
 <2><9cf4d>: Abbrev Number: 0
 <1><9cf4e>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cf4f>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <9cf53>   DW_AT_decl_file   : 10
    <9cf54>   DW_AT_decl_line   : 51
    <9cf55>   DW_AT_decl_column : 24
    <9cf56>   DW_AT_type        : <0x9cf5a>
 <1><9cf5a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cf5b>   DW_AT_byte_size   : 8
    <9cf5b>   DW_AT_type        : <0x9cf5f>
 <1><9cf5f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cf60>   DW_AT_prototyped  : 1
    <9cf60>   DW_AT_type        : <0x9c86e>
    <9cf64>   DW_AT_sibling     : <0x9cf73>
 <2><9cf68>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf69>   DW_AT_type        : <0x9c86e>
 <2><9cf6d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf6e>   DW_AT_type        : <0x9c8ab>
 <2><9cf72>: Abbrev Number: 0
 <1><9cf73>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cf74>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <9cf78>   DW_AT_decl_file   : 10
    <9cf79>   DW_AT_decl_line   : 54
    <9cf7a>   DW_AT_decl_column : 23
    <9cf7b>   DW_AT_type        : <0x9cf7f>
 <1><9cf7f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cf80>   DW_AT_byte_size   : 8
    <9cf80>   DW_AT_type        : <0x9cf84>
 <1><9cf84>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cf85>   DW_AT_prototyped  : 1
    <9cf85>   DW_AT_type        : <0x9c83c>
    <9cf89>   DW_AT_sibling     : <0x9cfac>
 <2><9cf8d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf8e>   DW_AT_type        : <0x9cbf1>
 <2><9cf92>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf93>   DW_AT_type        : <0x9c860>
 <2><9cf97>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf98>   DW_AT_type        : <0x9c8ab>
 <2><9cf9c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cf9d>   DW_AT_type        : <0x9c83c>
 <2><9cfa1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfa2>   DW_AT_type        : <0x9c83c>
 <2><9cfa6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfa7>   DW_AT_type        : <0x9c83c>
 <2><9cfab>: Abbrev Number: 0
 <1><9cfac>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cfad>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <9cfb1>   DW_AT_decl_file   : 10
    <9cfb2>   DW_AT_decl_line   : 56
    <9cfb3>   DW_AT_decl_column : 23
    <9cfb4>   DW_AT_type        : <0x9cfb8>
 <1><9cfb8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cfb9>   DW_AT_byte_size   : 8
    <9cfb9>   DW_AT_type        : <0x9cfbd>
 <1><9cfbd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cfbe>   DW_AT_prototyped  : 1
    <9cfbe>   DW_AT_type        : <0x9c83c>
    <9cfc2>   DW_AT_sibling     : <0x9cfe0>
 <2><9cfc6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfc7>   DW_AT_type        : <0x9cb91>
 <2><9cfcb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfcc>   DW_AT_type        : <0x9c93a>
 <2><9cfd0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfd1>   DW_AT_type        : <0x9c8ab>
 <2><9cfd5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfd6>   DW_AT_type        : <0x9c83c>
 <2><9cfda>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cfdb>   DW_AT_type        : <0x9c83c>
 <2><9cfdf>: Abbrev Number: 0
 <1><9cfe0>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cfe1>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <9cfe5>   DW_AT_decl_file   : 10
    <9cfe6>   DW_AT_decl_line   : 67
    <9cfe7>   DW_AT_decl_column : 23
    <9cfe8>   DW_AT_type        : <0x9cfec>
 <1><9cfec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9cfed>   DW_AT_byte_size   : 8
    <9cfed>   DW_AT_type        : <0x9cff1>
 <1><9cff1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9cff2>   DW_AT_prototyped  : 1
    <9cff2>   DW_AT_type        : <0x9c83c>
    <9cff6>   DW_AT_sibling     : <0x9d000>
 <2><9cffa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9cffb>   DW_AT_type        : <0x9c83c>
 <2><9cfff>: Abbrev Number: 0
 <1><9d000>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d001>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <9d005>   DW_AT_decl_file   : 10
    <9d006>   DW_AT_decl_line   : 68
    <9d007>   DW_AT_decl_column : 23
    <9d008>   DW_AT_type        : <0x9d00c>
 <1><9d00c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d00d>   DW_AT_byte_size   : 8
    <9d00d>   DW_AT_type        : <0x9d011>
 <1><9d011>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9d012>   DW_AT_prototyped  : 1
    <9d012>   DW_AT_type        : <0x9c83c>
    <9d016>   DW_AT_sibling     : <0x9d034>
 <2><9d01a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d01b>   DW_AT_type        : <0x9cec7>
 <2><9d01f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d020>   DW_AT_type        : <0x9cec7>
 <2><9d024>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d025>   DW_AT_type        : <0x9cec7>
 <2><9d029>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d02a>   DW_AT_type        : <0x9cec7>
 <2><9d02e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d02f>   DW_AT_type        : <0x9cec7>
 <2><9d033>: Abbrev Number: 0
 <1><9d034>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d035>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <9d039>   DW_AT_decl_file   : 10
    <9d03a>   DW_AT_decl_line   : 69
    <9d03b>   DW_AT_decl_column : 23
    <9d03c>   DW_AT_type        : <0x9d040>
 <1><9d040>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d041>   DW_AT_byte_size   : 8
    <9d041>   DW_AT_type        : <0x9d045>
 <1><9d045>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9d046>   DW_AT_prototyped  : 1
    <9d046>   DW_AT_type        : <0x9c83c>
    <9d04a>   DW_AT_sibling     : <0x9d063>
 <2><9d04e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d04f>   DW_AT_type        : <0x9c83c>
 <2><9d053>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d054>   DW_AT_type        : <0x9c83c>
 <2><9d058>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d059>   DW_AT_type        : <0x9c83c>
 <2><9d05d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d05e>   DW_AT_type        : <0x9c83c>
 <2><9d062>: Abbrev Number: 0
 <1><9d063>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d064>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <9d068>   DW_AT_decl_file   : 10
    <9d069>   DW_AT_decl_line   : 73
    <9d06a>   DW_AT_decl_column : 23
    <9d06b>   DW_AT_type        : <0x9d06f>
 <1><9d06f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d070>   DW_AT_byte_size   : 8
    <9d070>   DW_AT_type        : <0x9d074>
 <1><9d074>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9d075>   DW_AT_prototyped  : 1
    <9d075>   DW_AT_type        : <0x9c83c>
    <9d079>   DW_AT_sibling     : <0x9d083>
 <2><9d07d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d07e>   DW_AT_type        : <0x9c819>
 <2><9d082>: Abbrev Number: 0
 <1><9d083>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d084>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <9d088>   DW_AT_decl_file   : 10
    <9d089>   DW_AT_decl_line   : 74
    <9d08a>   DW_AT_decl_column : 23
    <9d08b>   DW_AT_type        : <0x9d08f>
 <1><9d08f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d090>   DW_AT_byte_size   : 8
    <9d090>   DW_AT_type        : <0x9d094>
 <1><9d094>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <9d095>   DW_AT_prototyped  : 1
    <9d095>   DW_AT_type        : <0x9c83c>
    <9d099>   DW_AT_sibling     : <0x9d0a8>
 <2><9d09d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d09e>   DW_AT_type        : <0x9c819>
 <2><9d0a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9d0a3>   DW_AT_type        : <0x9c80d>
 <2><9d0a7>: Abbrev Number: 0
 <1><9d0a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d0a9>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
