 <1><c028d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c028e>   DW_AT_prototyped  : 1
    <c028e>   DW_AT_type        : <0xbff2c>
    <c0292>   DW_AT_sibling     : <0xc02a6>
 <2><c0296>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0297>   DW_AT_type        : <0xc0081>
 <2><c029b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c029c>   DW_AT_type        : <0xbffbf>
 <2><c02a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c02a1>   DW_AT_type        : <0xbffbf>
 <2><c02a5>: Abbrev Number: 0
 <1><c02a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c02a7>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <c02ab>   DW_AT_decl_file   : 7
    <c02ac>   DW_AT_decl_line   : 73
    <c02ad>   DW_AT_decl_column : 15
    <c02ae>   DW_AT_type        : <0xc0288>
 <1><c02b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <c02b3>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <c02b7>   DW_AT_decl_file   : 7
    <c02b8>   DW_AT_decl_line   : 75
    <c02b9>   DW_AT_decl_column : 15
    <c02ba>   DW_AT_type        : <0xc02be>
 <1><c02be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c02bf>   DW_AT_byte_size   : 8
    <c02bf>   DW_AT_type        : <0xc02c3>
 <1><c02c3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c02c4>   DW_AT_prototyped  : 1
    <c02c4>   DW_AT_type        : <0xbff2c>
    <c02c8>   DW_AT_sibling     : <0xc02d7>
 <2><c02cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c02cd>   DW_AT_type        : <0xc0081>
 <2><c02d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c02d2>   DW_AT_type        : <0xc02d7>
 <2><c02d6>: Abbrev Number: 0
 <1><c02d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c02d8>   DW_AT_byte_size   : 8
    <c02d8>   DW_AT_type        : <0xc0006>
 <1><c02dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <c02dd>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <c02e1>   DW_AT_decl_file   : 7
    <c02e2>   DW_AT_decl_line   : 76
    <c02e3>   DW_AT_decl_column : 15
    <c02e4>   DW_AT_type        : <0xc02e8>
 <1><c02e8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c02e9>   DW_AT_byte_size   : 8
    <c02e9>   DW_AT_type        : <0xc02ed>
 <1><c02ed>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c02ee>   DW_AT_prototyped  : 1
    <c02ee>   DW_AT_type        : <0xbff2c>
    <c02f2>   DW_AT_sibling     : <0xc0306>
 <2><c02f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c02f7>   DW_AT_type        : <0xc0081>
 <2><c02fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c02fc>   DW_AT_type        : <0xc0020>
 <2><c0300>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0301>   DW_AT_type        : <0xbff91>
 <2><c0305>: Abbrev Number: 0
 <1><c0306>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0307>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <c030b>   DW_AT_decl_file   : 7
    <c030c>   DW_AT_decl_line   : 77
    <c030d>   DW_AT_decl_column : 15
    <c030e>   DW_AT_type        : <0xc0156>
 <1><c0312>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c0313>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <c0317>   DW_AT_byte_size   : 112
    <c0318>   DW_AT_decl_file   : 7
    <c0319>   DW_AT_decl_line   : 80
    <c031a>   DW_AT_decl_column : 16
    <c031b>   DW_AT_sibling     : <0xc03d6>
 <2><c031f>: Abbrev Number: 2 (DW_TAG_member)
    <c0320>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <c0324>   DW_AT_decl_file   : 7
    <c0325>   DW_AT_decl_line   : 81
    <c0326>   DW_AT_decl_column : 25
    <c0327>   DW_AT_type        : <0xc014a>
    <c032b>   DW_AT_data_member_location: 0
 <2><c032c>: Abbrev Number: 2 (DW_TAG_member)
    <c032d>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <c0331>   DW_AT_decl_file   : 7
    <c0332>   DW_AT_decl_line   : 82
    <c0333>   DW_AT_decl_column : 25
    <c0334>   DW_AT_type        : <0xc016a>
    <c0338>   DW_AT_data_member_location: 8
 <2><c0339>: Abbrev Number: 2 (DW_TAG_member)
    <c033a>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <c033e>   DW_AT_decl_file   : 7
    <c033f>   DW_AT_decl_line   : 83
    <c0340>   DW_AT_decl_column : 25
    <c0341>   DW_AT_type        : <0xc0176>
    <c0345>   DW_AT_data_member_location: 16
 <2><c0346>: Abbrev Number: 2 (DW_TAG_member)
    <c0347>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <c034b>   DW_AT_decl_file   : 7
    <c034c>   DW_AT_decl_line   : 84
    <c034d>   DW_AT_decl_column : 25
    <c034e>   DW_AT_type        : <0xc01a0>
    <c0352>   DW_AT_data_member_location: 24
 <2><c0353>: Abbrev Number: 2 (DW_TAG_member)
    <c0354>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <c0358>   DW_AT_decl_file   : 7
    <c0359>   DW_AT_decl_line   : 85
    <c035a>   DW_AT_decl_column : 25
    <c035b>   DW_AT_type        : <0xc01ca>
    <c035f>   DW_AT_data_member_location: 32
 <2><c0360>: Abbrev Number: 2 (DW_TAG_member)
    <c0361>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <c0365>   DW_AT_decl_file   : 7
    <c0366>   DW_AT_decl_line   : 86
    <c0367>   DW_AT_decl_column : 25
    <c0368>   DW_AT_type        : <0xc01f9>
    <c036c>   DW_AT_data_member_location: 40
 <2><c036d>: Abbrev Number: 2 (DW_TAG_member)
    <c036e>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <c0372>   DW_AT_decl_file   : 7
    <c0373>   DW_AT_decl_line   : 87
    <c0374>   DW_AT_decl_column : 25
    <c0375>   DW_AT_type        : <0xc0223>
    <c0379>   DW_AT_data_member_location: 48
 <2><c037a>: Abbrev Number: 2 (DW_TAG_member)
    <c037b>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <c037f>   DW_AT_decl_file   : 7
    <c0380>   DW_AT_decl_line   : 88
    <c0381>   DW_AT_decl_column : 25
    <c0382>   DW_AT_type        : <0xc024d>
    <c0386>   DW_AT_data_member_location: 56
 <2><c0387>: Abbrev Number: 2 (DW_TAG_member)
    <c0388>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <c038c>   DW_AT_decl_file   : 7
    <c038d>   DW_AT_decl_line   : 89
    <c038e>   DW_AT_decl_column : 25
    <c038f>   DW_AT_type        : <0xc027c>
    <c0393>   DW_AT_data_member_location: 64
 <2><c0394>: Abbrev Number: 2 (DW_TAG_member)
    <c0395>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <c0399>   DW_AT_decl_file   : 7
    <c039a>   DW_AT_decl_line   : 90
    <c039b>   DW_AT_decl_column : 25
    <c039c>   DW_AT_type        : <0xc02a6>
    <c03a0>   DW_AT_data_member_location: 72
 <2><c03a1>: Abbrev Number: 2 (DW_TAG_member)
    <c03a2>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <c03a6>   DW_AT_decl_file   : 7
    <c03a7>   DW_AT_decl_line   : 91
    <c03a8>   DW_AT_decl_column : 25
    <c03a9>   DW_AT_type        : <0xc02b2>
    <c03ad>   DW_AT_data_member_location: 80
 <2><c03ae>: Abbrev Number: 2 (DW_TAG_member)
    <c03af>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <c03b3>   DW_AT_decl_file   : 7
    <c03b4>   DW_AT_decl_line   : 92
    <c03b5>   DW_AT_decl_column : 25
    <c03b6>   DW_AT_type        : <0xc02dc>
    <c03ba>   DW_AT_data_member_location: 88
 <2><c03bb>: Abbrev Number: 2 (DW_TAG_member)
    <c03bc>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <c03c0>   DW_AT_decl_file   : 7
    <c03c1>   DW_AT_decl_line   : 93
    <c03c2>   DW_AT_decl_column : 25
    <c03c3>   DW_AT_type        : <0xc005c>
    <c03c7>   DW_AT_data_member_location: 96
 <2><c03c8>: Abbrev Number: 2 (DW_TAG_member)
    <c03c9>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <c03cd>   DW_AT_decl_file   : 7
    <c03ce>   DW_AT_decl_line   : 94
    <c03cf>   DW_AT_decl_column : 25
    <c03d0>   DW_AT_type        : <0xc0306>
    <c03d4>   DW_AT_data_member_location: 104
 <2><c03d5>: Abbrev Number: 0
 <1><c03d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c03d7>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <c03db>   DW_AT_decl_file   : 7
    <c03dc>   DW_AT_decl_line   : 95
    <c03dd>   DW_AT_decl_column : 3
    <c03de>   DW_AT_type        : <0xc0312>
 <1><c03e2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c03e3>   DW_AT_byte_size   : 8
    <c03e3>   DW_AT_type        : <0xc03d6>
 <1><c03e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <c03e8>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <c03ec>   DW_AT_decl_file   : 7
    <c03ed>   DW_AT_decl_line   : 117
    <c03ee>   DW_AT_decl_column : 3
    <c03ef>   DW_AT_type        : <0xc0086>
 <1><c03f3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c03f4>   DW_AT_byte_size   : 8
    <c03f5>   DW_AT_decl_file   : 8
    <c03f5>   DW_AT_decl_line   : 4
    <c03f6>   DW_AT_decl_column : 3
    <c03f6>   DW_AT_sibling     : <0xc0415>
 <2><c03fa>: Abbrev Number: 2 (DW_TAG_member)
    <c03fb>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <c03ff>   DW_AT_decl_file   : 8
    <c0400>   DW_AT_decl_line   : 5
    <c0401>   DW_AT_decl_column : 8
    <c0402>   DW_AT_type        : <0xbff2c>
    <c0406>   DW_AT_data_member_location: 0
 <2><c0407>: Abbrev Number: 2 (DW_TAG_member)
    <c0408>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <c040c>   DW_AT_decl_file   : 8
    <c040d>   DW_AT_decl_line   : 6
    <c040e>   DW_AT_decl_column : 8
    <c040f>   DW_AT_type        : <0xbff2c>
    <c0413>   DW_AT_data_member_location: 4
 <2><c0414>: Abbrev Number: 0
 <1><c0415>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c0416>   DW_AT_byte_size   : 16
    <c0417>   DW_AT_decl_file   : 8
    <c0417>   DW_AT_decl_line   : 8
    <c0418>   DW_AT_decl_column : 3
    <c0418>   DW_AT_sibling     : <0xc044b>
 <2><c041c>: Abbrev Number: 7 (DW_TAG_member)
    <c041d>   DW_AT_name        : x
    <c041f>   DW_AT_decl_file   : 8
    <c0420>   DW_AT_decl_line   : 9
    <c0421>   DW_AT_decl_column : 8
    <c0422>   DW_AT_type        : <0xbff2c>
    <c0426>   DW_AT_data_member_location: 0
 <2><c0427>: Abbrev Number: 7 (DW_TAG_member)
    <c0428>   DW_AT_name        : y
    <c042a>   DW_AT_decl_file   : 8
    <c042b>   DW_AT_decl_line   : 9
    <c042c>   DW_AT_decl_column : 11
    <c042d>   DW_AT_type        : <0xbff2c>
    <c0431>   DW_AT_data_member_location: 4
 <2><c0432>: Abbrev Number: 7 (DW_TAG_member)
    <c0433>   DW_AT_name        : dx
    <c0436>   DW_AT_decl_file   : 8
    <c0437>   DW_AT_decl_line   : 10
    <c0438>   DW_AT_decl_column : 8
    <c0439>   DW_AT_type        : <0xbff2c>
    <c043d>   DW_AT_data_member_location: 8
 <2><c043e>: Abbrev Number: 7 (DW_TAG_member)
    <c043f>   DW_AT_name        : dy
    <c0442>   DW_AT_decl_file   : 8
    <c0443>   DW_AT_decl_line   : 10
    <c0444>   DW_AT_decl_column : 12
    <c0445>   DW_AT_type        : <0xbff2c>
    <c0449>   DW_AT_data_member_location: 12
 <2><c044a>: Abbrev Number: 0
 <1><c044b>: Abbrev Number: 27 (DW_TAG_union_type)
    <c044c>   DW_AT_byte_size   : 16
    <c044d>   DW_AT_decl_file   : 8
    <c044e>   DW_AT_decl_line   : 3
    <c044f>   DW_AT_decl_column : 2
    <c0450>   DW_AT_sibling     : <0xc047b>
 <2><c0454>: Abbrev Number: 16 (DW_TAG_member)
    <c0455>   DW_AT_type        : <0xc03f3>
 <2><c0459>: Abbrev Number: 16 (DW_TAG_member)
    <c045a>   DW_AT_type        : <0xc0415>
 <2><c045e>: Abbrev Number: 28 (DW_TAG_member)
    <c045f>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <c0463>   DW_AT_decl_file   : 8
    <c0464>   DW_AT_decl_line   : 12
    <c0465>   DW_AT_decl_column : 7
    <c0466>   DW_AT_type        : <0xbff2c>
 <2><c046a>: Abbrev Number: 17 (DW_TAG_member)
    <c046b>   DW_AT_name        : z
    <c046d>   DW_AT_decl_file   : 8
    <c046d>   DW_AT_decl_line   : 13
    <c046e>   DW_AT_decl_column : 7
    <c046e>   DW_AT_type        : <0xbff2c>
 <2><c0472>: Abbrev Number: 17 (DW_TAG_member)
    <c0473>   DW_AT_name        : w
    <c0475>   DW_AT_decl_file   : 8
    <c0475>   DW_AT_decl_line   : 14
    <c0476>   DW_AT_decl_column : 7
    <c0476>   DW_AT_type        : <0xbff2c>
 <2><c047a>: Abbrev Number: 0
 <1><c047b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c047c>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <c0480>   DW_AT_byte_size   : 20
    <c0481>   DW_AT_decl_file   : 8
    <c0482>   DW_AT_decl_line   : 1
    <c0483>   DW_AT_decl_column : 8
    <c0484>   DW_AT_sibling     : <0xc049c>
 <2><c0488>: Abbrev Number: 2 (DW_TAG_member)
    <c0489>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c048d>   DW_AT_decl_file   : 8
    <c048e>   DW_AT_decl_line   : 2
    <c048f>   DW_AT_decl_column : 6
    <c0490>   DW_AT_type        : <0xbff2c>
    <c0494>   DW_AT_data_member_location: 0
 <2><c0495>: Abbrev Number: 29 (DW_TAG_member)
    <c0496>   DW_AT_type        : <0xc044b>
    <c049a>   DW_AT_data_member_location: 4
 <2><c049b>: Abbrev Number: 0
 <1><c049c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c049d>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <c04a1>   DW_AT_decl_file   : 8
    <c04a2>   DW_AT_decl_line   : 18
    <c04a3>   DW_AT_decl_column : 23
    <c04a4>   DW_AT_type        : <0xc047b>
 <1><c04a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <c04a9>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <c04ad>   DW_AT_decl_file   : 9
    <c04ae>   DW_AT_decl_line   : 1
    <c04af>   DW_AT_decl_column : 23
    <c04b0>   DW_AT_type        : <0xc04b4>
 <1><c04b4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c04b5>   DW_AT_byte_size   : 8
    <c04b5>   DW_AT_type        : <0xc04b9>
 <1><c04b9>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <c04ba>   DW_AT_prototyped  : 1
    <c04ba>   DW_AT_type        : <0xc02d7>
 <1><c04be>: Abbrev Number: 3 (DW_TAG_typedef)
    <c04bf>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <c04c3>   DW_AT_decl_file   : 9
    <c04c4>   DW_AT_decl_line   : 2
    <c04c5>   DW_AT_decl_column : 23
    <c04c6>   DW_AT_type        : <0xc04ca>
 <1><c04ca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c04cb>   DW_AT_byte_size   : 8
    <c04cb>   DW_AT_type        : <0xc04cf>
 <1><c04cf>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <c04d0>   DW_AT_prototyped  : 1
    <c04d0>   DW_AT_type        : <0xbff2c>
 <1><c04d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <c04d5>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <c04d9>   DW_AT_decl_file   : 9
    <c04da>   DW_AT_decl_line   : 3
    <c04db>   DW_AT_decl_column : 23
    <c04dc>   DW_AT_type        : <0xc04ca>
 <1><c04e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c04e1>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <c04e5>   DW_AT_decl_file   : 9
    <c04e6>   DW_AT_decl_line   : 10
    <c04e7>   DW_AT_decl_column : 23
    <c04e8>   DW_AT_type        : <0xc04ec>
 <1><c04ec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c04ed>   DW_AT_byte_size   : 8
    <c04ed>   DW_AT_type        : <0xc04f1>
 <1><c04f1>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c04f2>   DW_AT_prototyped  : 1
    <c04f2>   DW_AT_sibling     : <0xc04fc>
 <2><c04f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c04f7>   DW_AT_type        : <0xbff2c>
 <2><c04fb>: Abbrev Number: 0
 <1><c04fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <c04fd>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <c0501>   DW_AT_decl_file   : 9
    <c0502>   DW_AT_decl_line   : 14
    <c0503>   DW_AT_decl_column : 23
    <c0504>   DW_AT_type        : <0xc0508>
 <1><c0508>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0509>   DW_AT_byte_size   : 8
    <c0509>   DW_AT_type        : <0xc050d>
 <1><c050d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c050e>   DW_AT_prototyped  : 1
    <c050e>   DW_AT_type        : <0xbff2c>
    <c0512>   DW_AT_sibling     : <0xc0526>
 <2><c0516>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0517>   DW_AT_type        : <0xbff2c>
 <2><c051b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c051c>   DW_AT_type        : <0xbff2c>
 <2><c0520>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0521>   DW_AT_type        : <0xbff2c>
 <2><c0525>: Abbrev Number: 0
 <1><c0526>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0527>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <c052b>   DW_AT_decl_file   : 9
    <c052c>   DW_AT_decl_line   : 18
    <c052d>   DW_AT_decl_column : 23
    <c052e>   DW_AT_type        : <0xc0508>
 <1><c0532>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0533>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <c0537>   DW_AT_decl_file   : 9
    <c0538>   DW_AT_decl_line   : 24
    <c0539>   DW_AT_decl_column : 23
    <c053a>   DW_AT_type        : <0xbffcb>
 <1><c053e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c053f>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <c0543>   DW_AT_decl_file   : 9
    <c0544>   DW_AT_decl_line   : 28
    <c0545>   DW_AT_decl_column : 23
    <c0546>   DW_AT_type        : <0xc054a>
 <1><c054a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c054b>   DW_AT_byte_size   : 8
    <c054b>   DW_AT_type        : <0xc054f>
 <1><c054f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0550>   DW_AT_prototyped  : 1
    <c0550>   DW_AT_type        : <0xbff2c>
    <c0554>   DW_AT_sibling     : <0xc0563>
 <2><c0558>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0559>   DW_AT_type        : <0xbff2c>
 <2><c055d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c055e>   DW_AT_type        : <0xbff2c>
 <2><c0562>: Abbrev Number: 0
 <1><c0563>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0564>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <c0568>   DW_AT_decl_file   : 9
    <c0569>   DW_AT_decl_line   : 34
    <c056a>   DW_AT_decl_column : 23
    <c056b>   DW_AT_type        : <0xc04ca>
 <1><c056f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0570>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <c0574>   DW_AT_decl_file   : 9
    <c0575>   DW_AT_decl_line   : 35
    <c0576>   DW_AT_decl_column : 23
    <c0577>   DW_AT_type        : <0xc04ca>
 <1><c057b>: Abbrev Number: 3 (DW_TAG_typedef)
    <c057c>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <c0580>   DW_AT_decl_file   : 9
    <c0581>   DW_AT_decl_line   : 36
    <c0582>   DW_AT_decl_column : 23
    <c0583>   DW_AT_type        : <0xc0587>
 <1><c0587>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0588>   DW_AT_byte_size   : 8
    <c0588>   DW_AT_type        : <0xc058c>
 <1><c058c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c058d>   DW_AT_prototyped  : 1
    <c058d>   DW_AT_sibling     : <0xc059c>
 <2><c0591>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0592>   DW_AT_type        : <0xc059c>
 <2><c0596>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0597>   DW_AT_type        : <0xc059c>
 <2><c059b>: Abbrev Number: 0
 <1><c059c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c059d>   DW_AT_byte_size   : 8
    <c059d>   DW_AT_type        : <0xbff2c>
 <1><c05a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c05a2>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <c05a6>   DW_AT_decl_file   : 9
    <c05a7>   DW_AT_decl_line   : 37
    <c05a8>   DW_AT_decl_column : 23
    <c05a9>   DW_AT_type        : <0xc0587>
 <1><c05ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <c05ae>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <c05b2>   DW_AT_decl_file   : 9
    <c05b3>   DW_AT_decl_line   : 45
    <c05b4>   DW_AT_decl_column : 24
    <c05b5>   DW_AT_type        : <0xc05b9>
 <1><c05b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c05ba>   DW_AT_byte_size   : 8
    <c05ba>   DW_AT_type        : <0xc05be>
 <1><c05be>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c05bf>   DW_AT_prototyped  : 1
    <c05bf>   DW_AT_type        : <0xbff10>
    <c05c3>   DW_AT_sibling     : <0xc05d7>
 <2><c05c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05c8>   DW_AT_type        : <0xbff2c>
 <2><c05cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05cd>   DW_AT_type        : <0xbff2c>
 <2><c05d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05d2>   DW_AT_type        : <0xbff2c>
 <2><c05d6>: Abbrev Number: 0
 <1><c05d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <c05d8>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <c05dc>   DW_AT_decl_file   : 9
    <c05dd>   DW_AT_decl_line   : 48
    <c05de>   DW_AT_decl_column : 23
    <c05df>   DW_AT_type        : <0xc05e3>
 <1><c05e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c05e4>   DW_AT_byte_size   : 8
    <c05e4>   DW_AT_type        : <0xc05e8>
 <1><c05e8>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c05e9>   DW_AT_prototyped  : 1
    <c05e9>   DW_AT_sibling     : <0xc05fd>
 <2><c05ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05ee>   DW_AT_type        : <0xbffb4>
 <2><c05f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05f3>   DW_AT_type        : <0xbff60>
 <2><c05f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c05f8>   DW_AT_type        : <0xbff2c>
 <2><c05fc>: Abbrev Number: 0
 <1><c05fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <c05fe>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <c0602>   DW_AT_decl_file   : 9
    <c0603>   DW_AT_decl_line   : 49
    <c0604>   DW_AT_decl_column : 23
    <c0605>   DW_AT_type        : <0xc0609>
 <1><c0609>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c060a>   DW_AT_byte_size   : 8
    <c060a>   DW_AT_type        : <0xc060e>
 <1><c060e>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c060f>   DW_AT_prototyped  : 1
    <c060f>   DW_AT_sibling     : <0xc0623>
 <2><c0613>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0614>   DW_AT_type        : <0xc0277>
 <2><c0618>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0619>   DW_AT_type        : <0xbff60>
 <2><c061d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c061e>   DW_AT_type        : <0xbff2c>
 <2><c0622>: Abbrev Number: 0
 <1><c0623>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0624>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <c0628>   DW_AT_decl_file   : 9
    <c0629>   DW_AT_decl_line   : 51
    <c062a>   DW_AT_decl_column : 24
    <c062b>   DW_AT_type        : <0xc062f>
 <1><c062f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0630>   DW_AT_byte_size   : 8
    <c0630>   DW_AT_type        : <0xc0634>
 <1><c0634>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0635>   DW_AT_prototyped  : 1
    <c0635>   DW_AT_type        : <0xbff54>
    <c0639>   DW_AT_sibling     : <0xc0648>
 <2><c063d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c063e>   DW_AT_type        : <0xbff54>
 <2><c0642>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0643>   DW_AT_type        : <0xbff91>
 <2><c0647>: Abbrev Number: 0
 <1><c0648>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0649>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <c064d>   DW_AT_decl_file   : 9
    <c064e>   DW_AT_decl_line   : 54
    <c064f>   DW_AT_decl_column : 23
    <c0650>   DW_AT_type        : <0xc0654>
 <1><c0654>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0655>   DW_AT_byte_size   : 8
    <c0655>   DW_AT_type        : <0xc0659>
 <1><c0659>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c065a>   DW_AT_prototyped  : 1
    <c065a>   DW_AT_type        : <0xbff2c>
    <c065e>   DW_AT_sibling     : <0xc0681>
 <2><c0662>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0663>   DW_AT_type        : <0xc02d7>
 <2><c0667>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0668>   DW_AT_type        : <0xbff46>
 <2><c066c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c066d>   DW_AT_type        : <0xbff91>
 <2><c0671>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0672>   DW_AT_type        : <0xbff2c>
 <2><c0676>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0677>   DW_AT_type        : <0xbff2c>
 <2><c067b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c067c>   DW_AT_type        : <0xbff2c>
 <2><c0680>: Abbrev Number: 0
 <1><c0681>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0682>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <c0686>   DW_AT_decl_file   : 9
    <c0687>   DW_AT_decl_line   : 56
    <c0688>   DW_AT_decl_column : 23
    <c0689>   DW_AT_type        : <0xc068d>
 <1><c068d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c068e>   DW_AT_byte_size   : 8
    <c068e>   DW_AT_type        : <0xc0692>
 <1><c0692>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0693>   DW_AT_prototyped  : 1
    <c0693>   DW_AT_type        : <0xbff2c>
    <c0697>   DW_AT_sibling     : <0xc06b5>
 <2><c069b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c069c>   DW_AT_type        : <0xc0277>
 <2><c06a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06a1>   DW_AT_type        : <0xc0020>
 <2><c06a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06a6>   DW_AT_type        : <0xbff91>
 <2><c06aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06ab>   DW_AT_type        : <0xbff2c>
 <2><c06af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06b0>   DW_AT_type        : <0xbff2c>
 <2><c06b4>: Abbrev Number: 0
 <1><c06b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c06b6>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <c06ba>   DW_AT_decl_file   : 9
    <c06bb>   DW_AT_decl_line   : 67
    <c06bc>   DW_AT_decl_column : 23
    <c06bd>   DW_AT_type        : <0xc06c1>
 <1><c06c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c06c2>   DW_AT_byte_size   : 8
    <c06c2>   DW_AT_type        : <0xc06c6>
 <1><c06c6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c06c7>   DW_AT_prototyped  : 1
    <c06c7>   DW_AT_type        : <0xbff2c>
    <c06cb>   DW_AT_sibling     : <0xc06d5>
 <2><c06cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06d0>   DW_AT_type        : <0xbff2c>
 <2><c06d4>: Abbrev Number: 0
 <1><c06d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c06d6>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <c06da>   DW_AT_decl_file   : 9
    <c06db>   DW_AT_decl_line   : 68
    <c06dc>   DW_AT_decl_column : 23
    <c06dd>   DW_AT_type        : <0xc06e1>
 <1><c06e1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c06e2>   DW_AT_byte_size   : 8
    <c06e2>   DW_AT_type        : <0xc06e6>
 <1><c06e6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c06e7>   DW_AT_prototyped  : 1
    <c06e7>   DW_AT_type        : <0xbff2c>
    <c06eb>   DW_AT_sibling     : <0xc0709>
 <2><c06ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06f0>   DW_AT_type        : <0xc059c>
 <2><c06f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06f5>   DW_AT_type        : <0xc059c>
 <2><c06f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06fa>   DW_AT_type        : <0xc059c>
 <2><c06fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c06ff>   DW_AT_type        : <0xc059c>
 <2><c0703>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0704>   DW_AT_type        : <0xc059c>
 <2><c0708>: Abbrev Number: 0
 <1><c0709>: Abbrev Number: 3 (DW_TAG_typedef)
    <c070a>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <c070e>   DW_AT_decl_file   : 9
    <c070f>   DW_AT_decl_line   : 69
    <c0710>   DW_AT_decl_column : 23
    <c0711>   DW_AT_type        : <0xc0715>
 <1><c0715>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0716>   DW_AT_byte_size   : 8
    <c0716>   DW_AT_type        : <0xc071a>
 <1><c071a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c071b>   DW_AT_prototyped  : 1
    <c071b>   DW_AT_type        : <0xbff2c>
    <c071f>   DW_AT_sibling     : <0xc0738>
 <2><c0723>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0724>   DW_AT_type        : <0xbff2c>
 <2><c0728>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0729>   DW_AT_type        : <0xbff2c>
 <2><c072d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c072e>   DW_AT_type        : <0xbff2c>
 <2><c0732>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0733>   DW_AT_type        : <0xbff2c>
 <2><c0737>: Abbrev Number: 0
 <1><c0738>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0739>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <c073d>   DW_AT_decl_file   : 9
    <c073e>   DW_AT_decl_line   : 73
    <c073f>   DW_AT_decl_column : 23
    <c0740>   DW_AT_type        : <0xc0744>
 <1><c0744>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0745>   DW_AT_byte_size   : 8
    <c0745>   DW_AT_type        : <0xc0749>
 <1><c0749>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c074a>   DW_AT_prototyped  : 1
    <c074a>   DW_AT_type        : <0xbff2c>
    <c074e>   DW_AT_sibling     : <0xc0758>
 <2><c0752>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0753>   DW_AT_type        : <0xbff09>
 <2><c0757>: Abbrev Number: 0
 <1><c0758>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0759>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <c075d>   DW_AT_decl_file   : 9
    <c075e>   DW_AT_decl_line   : 74
    <c075f>   DW_AT_decl_column : 23
    <c0760>   DW_AT_type        : <0xc0764>
 <1><c0764>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0765>   DW_AT_byte_size   : 8
    <c0765>   DW_AT_type        : <0xc0769>
 <1><c0769>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c076a>   DW_AT_prototyped  : 1
    <c076a>   DW_AT_type        : <0xbff2c>
    <c076e>   DW_AT_sibling     : <0xc077d>
 <2><c0772>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0773>   DW_AT_type        : <0xbff09>
 <2><c0777>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0778>   DW_AT_type        : <0xbff02>
 <2><c077c>: Abbrev Number: 0
 <1><c077d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c077e>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <c0782>   DW_AT_decl_file   : 9
    <c0783>   DW_AT_decl_line   : 80
    <c0784>   DW_AT_decl_column : 23
    <c0785>   DW_AT_type        : <0xc04ec>
 <1><c0789>: Abbrev Number: 3 (DW_TAG_typedef)
    <c078a>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <c078e>   DW_AT_decl_file   : 9
    <c078f>   DW_AT_decl_line   : 83
    <c0790>   DW_AT_decl_column : 23
    <c0791>   DW_AT_type        : <0xc06c1>
 <1><c0795>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0796>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <c079a>   DW_AT_decl_file   : 9
    <c079b>   DW_AT_decl_line   : 86
    <c079c>   DW_AT_decl_column : 23
    <c079d>   DW_AT_type        : <0xc054a>
 <1><c07a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c07a2>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <c07a6>   DW_AT_decl_file   : 9
    <c07a7>   DW_AT_decl_line   : 89
    <c07a8>   DW_AT_decl_column : 23
    <c07a9>   DW_AT_type        : <0xc054a>
 <1><c07ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <c07ae>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <c07b2>   DW_AT_decl_file   : 9
    <c07b3>   DW_AT_decl_line   : 91
    <c07b4>   DW_AT_decl_column : 23
    <c07b5>   DW_AT_type        : <0xc07b9>
 <1><c07b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c07ba>   DW_AT_byte_size   : 8
    <c07ba>   DW_AT_type        : <0xc07be>
 <1><c07be>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c07bf>   DW_AT_prototyped  : 1
    <c07bf>   DW_AT_sibling     : <0xc07c9>
 <2><c07c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c07c4>   DW_AT_type        : <0xc07c9>
 <2><c07c8>: Abbrev Number: 0
 <1><c07c9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c07ca>   DW_AT_byte_size   : 8
    <c07ca>   DW_AT_type        : <0xc049c>
 <1><c07ce>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c07cf>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <c07d3>   DW_AT_byte_size   : 224
    <c07d4>   DW_AT_decl_file   : 9
    <c07d5>   DW_AT_decl_line   : 93
    <c07d6>   DW_AT_decl_column : 16
    <c07d7>   DW_AT_sibling     : <0xc0948>
 <2><c07db>: Abbrev Number: 2 (DW_TAG_member)
    <c07dc>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <c07e0>   DW_AT_decl_file   : 9
    <c07e1>   DW_AT_decl_line   : 94
    <c07e2>   DW_AT_decl_column : 23
    <c07e3>   DW_AT_type        : <0xc04a8>
    <c07e7>   DW_AT_data_member_location: 0
 <2><c07e8>: Abbrev Number: 2 (DW_TAG_member)
    <c07e9>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <c07ed>   DW_AT_decl_file   : 9
    <c07ee>   DW_AT_decl_line   : 95
    <c07ef>   DW_AT_decl_column : 23
    <c07f0>   DW_AT_type        : <0xc04be>
    <c07f4>   DW_AT_data_member_location: 8
 <2><c07f5>: Abbrev Number: 2 (DW_TAG_member)
    <c07f6>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <c07fa>   DW_AT_decl_file   : 9
    <c07fb>   DW_AT_decl_line   : 96
    <c07fc>   DW_AT_decl_column : 23
    <c07fd>   DW_AT_type        : <0xc04d4>
    <c0801>   DW_AT_data_member_location: 16
 <2><c0802>: Abbrev Number: 2 (DW_TAG_member)
    <c0803>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <c0807>   DW_AT_decl_file   : 9
    <c0808>   DW_AT_decl_line   : 97
    <c0809>   DW_AT_decl_column : 23
    <c080a>   DW_AT_type        : <0xc04e0>
    <c080e>   DW_AT_data_member_location: 24
 <2><c080f>: Abbrev Number: 2 (DW_TAG_member)
    <c0810>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <c0814>   DW_AT_decl_file   : 9
    <c0815>   DW_AT_decl_line   : 98
    <c0816>   DW_AT_decl_column : 23
    <c0817>   DW_AT_type        : <0xc04fc>
    <c081b>   DW_AT_data_member_location: 32
 <2><c081c>: Abbrev Number: 2 (DW_TAG_member)
    <c081d>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <c0821>   DW_AT_decl_file   : 9
    <c0822>   DW_AT_decl_line   : 99
    <c0823>   DW_AT_decl_column : 23
    <c0824>   DW_AT_type        : <0xc0526>
    <c0828>   DW_AT_data_member_location: 40
 <2><c0829>: Abbrev Number: 2 (DW_TAG_member)
    <c082a>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <c082e>   DW_AT_decl_file   : 9
    <c082f>   DW_AT_decl_line   : 100
    <c0830>   DW_AT_decl_column : 23
    <c0831>   DW_AT_type        : <0xc053e>
    <c0835>   DW_AT_data_member_location: 48
 <2><c0836>: Abbrev Number: 2 (DW_TAG_member)
    <c0837>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <c083b>   DW_AT_decl_file   : 9
    <c083c>   DW_AT_decl_line   : 101
    <c083d>   DW_AT_decl_column : 23
    <c083e>   DW_AT_type        : <0xc0563>
    <c0842>   DW_AT_data_member_location: 56
 <2><c0843>: Abbrev Number: 2 (DW_TAG_member)
    <c0844>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <c0848>   DW_AT_decl_file   : 9
    <c0849>   DW_AT_decl_line   : 102
    <c084a>   DW_AT_decl_column : 23
    <c084b>   DW_AT_type        : <0xc056f>
    <c084f>   DW_AT_data_member_location: 64
 <2><c0850>: Abbrev Number: 2 (DW_TAG_member)
    <c0851>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <c0855>   DW_AT_decl_file   : 9
    <c0856>   DW_AT_decl_line   : 103
    <c0857>   DW_AT_decl_column : 23
    <c0858>   DW_AT_type        : <0xc057b>
    <c085c>   DW_AT_data_member_location: 72
 <2><c085d>: Abbrev Number: 2 (DW_TAG_member)
    <c085e>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <c0862>   DW_AT_decl_file   : 9
    <c0863>   DW_AT_decl_line   : 104
    <c0864>   DW_AT_decl_column : 23
    <c0865>   DW_AT_type        : <0xc05a1>
    <c0869>   DW_AT_data_member_location: 80
 <2><c086a>: Abbrev Number: 2 (DW_TAG_member)
    <c086b>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <c086f>   DW_AT_decl_file   : 9
    <c0870>   DW_AT_decl_line   : 105
    <c0871>   DW_AT_decl_column : 24
    <c0872>   DW_AT_type        : <0xc05d7>
    <c0876>   DW_AT_data_member_location: 88
 <2><c0877>: Abbrev Number: 2 (DW_TAG_member)
    <c0878>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <c087c>   DW_AT_decl_file   : 9
    <c087d>   DW_AT_decl_line   : 106
    <c087e>   DW_AT_decl_column : 25
    <c087f>   DW_AT_type        : <0xc05fd>
    <c0883>   DW_AT_data_member_location: 96
 <2><c0884>: Abbrev Number: 2 (DW_TAG_member)
    <c0885>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <c0889>   DW_AT_decl_file   : 9
    <c088a>   DW_AT_decl_line   : 107
    <c088b>   DW_AT_decl_column : 23
    <c088c>   DW_AT_type        : <0xc0623>
    <c0890>   DW_AT_data_member_location: 104
 <2><c0891>: Abbrev Number: 2 (DW_TAG_member)
    <c0892>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <c0896>   DW_AT_decl_file   : 9
    <c0897>   DW_AT_decl_line   : 108
    <c0898>   DW_AT_decl_column : 23
    <c0899>   DW_AT_type        : <0xc06b5>
    <c089d>   DW_AT_data_member_location: 112
 <2><c089e>: Abbrev Number: 2 (DW_TAG_member)
    <c089f>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <c08a3>   DW_AT_decl_file   : 9
    <c08a4>   DW_AT_decl_line   : 109
    <c08a5>   DW_AT_decl_column : 23
    <c08a6>   DW_AT_type        : <0xc06d5>
    <c08aa>   DW_AT_data_member_location: 120
 <2><c08ab>: Abbrev Number: 2 (DW_TAG_member)
    <c08ac>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <c08b0>   DW_AT_decl_file   : 9
    <c08b1>   DW_AT_decl_line   : 110
    <c08b2>   DW_AT_decl_column : 23
    <c08b3>   DW_AT_type        : <0xc0709>
    <c08b7>   DW_AT_data_member_location: 128
 <2><c08b8>: Abbrev Number: 2 (DW_TAG_member)
    <c08b9>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <c08bd>   DW_AT_decl_file   : 9
    <c08be>   DW_AT_decl_line   : 111
    <c08bf>   DW_AT_decl_column : 23
    <c08c0>   DW_AT_type        : <0xc0738>
    <c08c4>   DW_AT_data_member_location: 136
 <2><c08c5>: Abbrev Number: 2 (DW_TAG_member)
    <c08c6>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <c08ca>   DW_AT_decl_file   : 9
    <c08cb>   DW_AT_decl_line   : 112
    <c08cc>   DW_AT_decl_column : 23
    <c08cd>   DW_AT_type        : <0xc0758>
    <c08d1>   DW_AT_data_member_location: 144
 <2><c08d2>: Abbrev Number: 2 (DW_TAG_member)
    <c08d3>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <c08d7>   DW_AT_decl_file   : 9
    <c08d8>   DW_AT_decl_line   : 113
    <c08d9>   DW_AT_decl_column : 25
    <c08da>   DW_AT_type        : <0xc0532>
    <c08de>   DW_AT_data_member_location: 152
 <2><c08df>: Abbrev Number: 2 (DW_TAG_member)
    <c08e0>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <c08e4>   DW_AT_decl_file   : 9
    <c08e5>   DW_AT_decl_line   : 114
    <c08e6>   DW_AT_decl_column : 24
    <c08e7>   DW_AT_type        : <0xc0648>
    <c08eb>   DW_AT_data_member_location: 160
 <2><c08ec>: Abbrev Number: 2 (DW_TAG_member)
    <c08ed>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <c08f1>   DW_AT_decl_file   : 9
    <c08f2>   DW_AT_decl_line   : 115
    <c08f3>   DW_AT_decl_column : 25
    <c08f4>   DW_AT_type        : <0xc0681>
    <c08f8>   DW_AT_data_member_location: 168
 <2><c08f9>: Abbrev Number: 2 (DW_TAG_member)
    <c08fa>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <c08fe>   DW_AT_decl_file   : 9
    <c08ff>   DW_AT_decl_line   : 116
    <c0900>   DW_AT_decl_column : 23
    <c0901>   DW_AT_type        : <0xc05ad>
    <c0905>   DW_AT_data_member_location: 176
 <2><c0906>: Abbrev Number: 2 (DW_TAG_member)
    <c0907>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <c090b>   DW_AT_decl_file   : 9
    <c090c>   DW_AT_decl_line   : 117
    <c090d>   DW_AT_decl_column : 23
    <c090e>   DW_AT_type        : <0xc077d>
    <c0912>   DW_AT_data_member_location: 184
 <2><c0913>: Abbrev Number: 2 (DW_TAG_member)
    <c0914>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <c0918>   DW_AT_decl_file   : 9
    <c0919>   DW_AT_decl_line   : 118
    <c091a>   DW_AT_decl_column : 22
    <c091b>   DW_AT_type        : <0xc0789>
    <c091f>   DW_AT_data_member_location: 192
 <2><c0920>: Abbrev Number: 2 (DW_TAG_member)
    <c0921>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <c0925>   DW_AT_decl_file   : 9
    <c0926>   DW_AT_decl_line   : 119
    <c0927>   DW_AT_decl_column : 23
    <c0928>   DW_AT_type        : <0xc0795>
    <c092c>   DW_AT_data_member_location: 200
 <2><c092d>: Abbrev Number: 2 (DW_TAG_member)
    <c092e>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <c0932>   DW_AT_decl_file   : 9
    <c0933>   DW_AT_decl_line   : 120
    <c0934>   DW_AT_decl_column : 22
    <c0935>   DW_AT_type        : <0xc07a1>
    <c0939>   DW_AT_data_member_location: 208
 <2><c093a>: Abbrev Number: 2 (DW_TAG_member)
    <c093b>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <c093f>   DW_AT_decl_file   : 9
    <c0940>   DW_AT_decl_line   : 121
    <c0941>   DW_AT_decl_column : 23
    <c0942>   DW_AT_type        : <0xc07ad>
    <c0946>   DW_AT_data_member_location: 216
 <2><c0947>: Abbrev Number: 0
 <1><c0948>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0949>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <c094d>   DW_AT_decl_file   : 9
    <c094e>   DW_AT_decl_line   : 122
    <c094f>   DW_AT_decl_column : 3
    <c0950>   DW_AT_type        : <0xc07ce>
 <1><c0954>: Abbrev Number: 30 (DW_TAG_structure_type)
    <c0955>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <c0959>   DW_AT_byte_size   : 20848
    <c095b>   DW_AT_decl_file   : 10
    <c095c>   DW_AT_decl_line   : 349
    <c095e>   DW_AT_decl_column : 16
    <c095f>   DW_AT_sibling     : <0xc09d4>
 <2><c0963>: Abbrev Number: 10 (DW_TAG_member)
    <c0964>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <c0968>   DW_AT_decl_file   : 10
    <c0968>   DW_AT_decl_line   : 350
    <c096a>   DW_AT_decl_column : 18
    <c096a>   DW_AT_type        : <0xbff2c>
    <c096e>   DW_AT_data_member_location: 0
 <2><c096f>: Abbrev Number: 10 (DW_TAG_member)
    <c0970>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <c0974>   DW_AT_decl_file   : 10
    <c0974>   DW_AT_decl_line   : 351
    <c0976>   DW_AT_decl_column : 18
    <c0976>   DW_AT_type        : <0xbffba>
    <c097a>   DW_AT_data_member_location: 8
 <2><c097b>: Abbrev Number: 10 (DW_TAG_member)
    <c097c>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <c0980>   DW_AT_decl_file   : 10
    <c0980>   DW_AT_decl_line   : 352
    <c0982>   DW_AT_decl_column : 18
    <c0982>   DW_AT_type        : <0xc0006>
    <c0986>   DW_AT_data_member_location: 16
 <2><c0987>: Abbrev Number: 10 (DW_TAG_member)
    <c0988>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <c098c>   DW_AT_decl_file   : 10
    <c098c>   DW_AT_decl_line   : 353
    <c098e>   DW_AT_decl_column : 18
    <c098e>   DW_AT_type        : <0xbff54>
    <c0992>   DW_AT_data_member_location: 40
 <2><c0993>: Abbrev Number: 10 (DW_TAG_member)
    <c0994>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <c0998>   DW_AT_decl_file   : 10
    <c0998>   DW_AT_decl_line   : 354
    <c099a>   DW_AT_decl_column : 18
    <c099a>   DW_AT_type        : <0xc0948>
    <c099e>   DW_AT_data_member_location: 48
 <2><c099f>: Abbrev Number: 12 (DW_TAG_member)
    <c09a0>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <c09a4>   DW_AT_decl_file   : 10
    <c09a4>   DW_AT_decl_line   : 355
    <c09a6>   DW_AT_decl_column : 18
    <c09a6>   DW_AT_type        : <0xc09d4>
    <c09aa>   DW_AT_data_member_location: 272
 <2><c09ac>: Abbrev Number: 12 (DW_TAG_member)
    <c09ad>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <c09b1>   DW_AT_decl_file   : 10
    <c09b1>   DW_AT_decl_line   : 356
    <c09b3>   DW_AT_decl_column : 18
    <c09b3>   DW_AT_type        : <0xbff2c>
    <c09b7>   DW_AT_data_member_location: 20832
 <2><c09b9>: Abbrev Number: 12 (DW_TAG_member)
    <c09ba>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <c09be>   DW_AT_decl_file   : 10
    <c09be>   DW_AT_decl_line   : 357
    <c09c0>   DW_AT_decl_column : 18
    <c09c0>   DW_AT_type        : <0xbff2c>
    <c09c4>   DW_AT_data_member_location: 20836
 <2><c09c6>: Abbrev Number: 12 (DW_TAG_member)
    <c09c7>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <c09cb>   DW_AT_decl_file   : 10
    <c09cb>   DW_AT_decl_line   : 358
    <c09cd>   DW_AT_decl_column : 18
    <c09cd>   DW_AT_type        : <0xbffcb>
    <c09d1>   DW_AT_data_member_location: 20840
 <2><c09d3>: Abbrev Number: 0
 <1><c09d4>: Abbrev Number: 14 (DW_TAG_array_type)
    <c09d5>   DW_AT_type        : <0xc03e7>
    <c09d9>   DW_AT_sibling     : <0xc09e5>
 <2><c09dd>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <c09de>   DW_AT_type        : <0xbff17>
    <c09e2>   DW_AT_upper_bound : 256
 <2><c09e4>: Abbrev Number: 0
 <1><c09e5>: Abbrev Number: 13 (DW_TAG_typedef)
    <c09e6>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <c09ea>   DW_AT_decl_file   : 10
    <c09eb>   DW_AT_decl_line   : 359
    <c09ed>   DW_AT_decl_column : 3
    <c09ee>   DW_AT_type        : <0xc0954>
 <1><c09f2>: Abbrev Number: 32 (DW_TAG_variable)
    <c09f3>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <c09f7>   DW_AT_decl_file   : 10
    <c09f8>   DW_AT_decl_line   : 361
    <c09fa>   DW_AT_decl_column : 21
    <c09fb>   DW_AT_type        : <0xc09e5>
    <c09ff>   DW_AT_external    : 1
    <c09ff>   DW_AT_declaration : 1
 <1><c09ff>: Abbrev Number: 33 (DW_TAG_subprogram)
    <c0a00>   DW_AT_external    : 1
    <c0a00>   DW_AT_name        : (indirect string, offset: 0x1b712): fb_ConsoleSleep
    <c0a04>   DW_AT_decl_file   : 11
    <c0a05>   DW_AT_decl_line   : 89
    <c0a06>   DW_AT_decl_column : 21
    <c0a07>   DW_AT_prototyped  : 1
    <c0a07>   DW_AT_declaration : 1
    <c0a07>   DW_AT_sibling     : <0xc0a11>
 <2><c0a0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0a0c>   DW_AT_type        : <0xbff2c>
 <2><c0a10>: Abbrev Number: 0
 <1><c0a11>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c0a12>   DW_AT_external    : 1
    <c0a12>   DW_AT_name        : (indirect string, offset: 0x72f9): fb_Sleep
    <c0a16>   DW_AT_decl_file   : 1
    <c0a17>   DW_AT_decl_line   : 6
    <c0a18>   DW_AT_decl_column : 13
    <c0a19>   DW_AT_prototyped  : 1
    <c0a19>   DW_AT_low_pc      : 0x471f80
    <c0a21>   DW_AT_high_pc     : 0x15
    <c0a29>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c0a2b>   DW_AT_call_all_calls: 1
 <2><c0a2b>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <c0a2c>   DW_AT_name        : (indirect string, offset: 0x184a7): msecs
    <c0a30>   DW_AT_decl_file   : 1
    <c0a31>   DW_AT_decl_line   : 6
    <c0a32>   DW_AT_decl_column : 28
    <c0a33>   DW_AT_type        : <0xbff2c>
    <c0a37>   DW_AT_location    : 0x3ac17 (location list)
    <c0a3b>   DW_AT_GNU_locviews: 0x3ac0f
 <2><c0a3f>: Abbrev Number: 36 (DW_TAG_variable)
    <c0a40>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <c0a44>   DW_AT_decl_file   : 1
    <c0a45>   DW_AT_decl_line   : 8
    <c0a46>   DW_AT_decl_column : 18
    <c0a47>   DW_AT_type        : <0xc077d>
    <c0a4b>   DW_AT_location    : 0x3ac36 (location list)
    <c0a4f>   DW_AT_GNU_locviews: 0x3ac32
 <2><c0a53>: Abbrev Number: 37 (DW_TAG_call_site)
    <c0a54>   DW_AT_call_return_pc: 0x471f8e
    <c0a5c>   DW_AT_call_tail_call: 1
    <c0a5c>   DW_AT_sibling     : <0xc0a68>
 <3><c0a60>: Abbrev Number: 38 (DW_TAG_call_site_parameter)
    <c0a61>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c0a63>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><c0a67>: Abbrev Number: 0
 <2><c0a68>: Abbrev Number: 39 (DW_TAG_call_site)
    <c0a69>   DW_AT_call_return_pc: 0x471f95
    <c0a71>   DW_AT_call_tail_call: 1
    <c0a71>   DW_AT_call_origin : <0xc09ff>
 <2><c0a75>: Abbrev Number: 0
 <1><c0a76>: Abbrev Number: 0
  Compilation Unit @ offset 0xc0a77:
   Length:        0xc09 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xebc2
   Pointer Size:  8
 <0><c0a83>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <c0a84>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c0a88>   DW_AT_language    : 29	(C11)
    <c0a89>   DW_AT_name        : (indirect line string, offset: 0xed4): src/rtlib/hook_width.c
    <c0a8d>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c0a91>   DW_AT_low_pc      : 0x471fa0
    <c0a99>   DW_AT_high_pc     : 0x57
    <c0aa1>   DW_AT_stmt_list   : 0x66870
 <1><c0aa5>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0aa6>   DW_AT_byte_size   : 1
    <c0aa7>   DW_AT_encoding    : 8	(unsigned char)
    <c0aa8>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c0aac>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0aad>   DW_AT_byte_size   : 2
    <c0aae>   DW_AT_encoding    : 7	(unsigned)
    <c0aaf>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c0ab3>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0ab4>   DW_AT_byte_size   : 4
    <c0ab5>   DW_AT_encoding    : 7	(unsigned)
    <c0ab6>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c0aba>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0abb>   DW_AT_byte_size   : 8
    <c0abc>   DW_AT_encoding    : 7	(unsigned)
    <c0abd>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c0ac1>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0ac2>   DW_AT_byte_size   : 1
    <c0ac3>   DW_AT_encoding    : 6	(signed char)
    <c0ac4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c0ac8>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0ac9>   DW_AT_byte_size   : 2
    <c0aca>   DW_AT_encoding    : 5	(signed)
    <c0acb>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c0acf>: Abbrev Number: 24 (DW_TAG_base_type)
    <c0ad0>   DW_AT_byte_size   : 4
    <c0ad1>   DW_AT_encoding    : 5	(signed)
    <c0ad2>   DW_AT_name        : int
 <1><c0ad6>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0ad7>   DW_AT_byte_size   : 8
    <c0ad8>   DW_AT_encoding    : 5	(signed)
    <c0ad9>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c0add>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0ade>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c0ae2>   DW_AT_decl_file   : 2
    <c0ae3>   DW_AT_decl_line   : 153
    <c0ae4>   DW_AT_decl_column : 27
    <c0ae5>   DW_AT_type        : <0xc0ad6>
 <1><c0ae9>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <c0aea>   DW_AT_byte_size   : 8
 <1><c0aeb>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0aec>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <c0af0>   DW_AT_decl_file   : 2
    <c0af1>   DW_AT_decl_line   : 194
    <c0af2>   DW_AT_decl_column : 27
    <c0af3>   DW_AT_type        : <0xc0ad6>
 <1><c0af7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0af8>   DW_AT_byte_size   : 8
    <c0af8>   DW_AT_type        : <0xc0afc>
 <1><c0afc>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0afd>   DW_AT_byte_size   : 1
    <c0afe>   DW_AT_encoding    : 6	(signed char)
    <c0aff>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c0b03>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0b04>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c0b08>   DW_AT_decl_file   : 3
    <c0b09>   DW_AT_decl_line   : 209
    <c0b0a>   DW_AT_decl_column : 23
    <c0b0b>   DW_AT_type        : <0xc0aba>
 <1><c0b0f>: Abbrev Number: 14 (DW_TAG_typedef)
    <c0b10>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <c0b14>   DW_AT_decl_file   : 3
    <c0b15>   DW_AT_decl_line   : 321
    <c0b17>   DW_AT_decl_column : 24
    <c0b18>   DW_AT_type        : <0xc0acf>
 <1><c0b1c>: Abbrev Number: 26 (DW_TAG_const_type)
    <c0b1d>   DW_AT_type        : <0xc0b0f>
 <1><c0b21>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0b22>   DW_AT_byte_size   : 8
    <c0b23>   DW_AT_encoding    : 5	(signed)
    <c0b24>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c0b28>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0b29>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <c0b2d>   DW_AT_decl_file   : 4
    <c0b2e>   DW_AT_decl_line   : 87
    <c0b2f>   DW_AT_decl_column : 19
    <c0b30>   DW_AT_type        : <0xc0add>
 <1><c0b34>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0b35>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <c0b39>   DW_AT_decl_file   : 4
    <c0b3a>   DW_AT_decl_line   : 108
    <c0b3b>   DW_AT_decl_column : 19
    <c0b3c>   DW_AT_type        : <0xc0aeb>
 <1><c0b40>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0b41>   DW_AT_byte_size   : 8
    <c0b42>   DW_AT_encoding    : 7	(unsigned)
    <c0b43>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c0b47>: Abbrev Number: 15 (DW_TAG_array_type)
    <c0b48>   DW_AT_type        : <0xc0afc>
    <c0b4c>   DW_AT_sibling     : <0xc0b57>
 <2><c0b50>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <c0b51>   DW_AT_type        : <0xc0aba>
    <c0b55>   DW_AT_upper_bound : 3
 <2><c0b56>: Abbrev Number: 0
 <1><c0b57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0b58>   DW_AT_byte_size   : 8
    <c0b58>   DW_AT_type        : <0xc0b5c>
 <1><c0b5c>: Abbrev Number: 28 (DW_TAG_const_type)
 <1><c0b5d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0b5e>   DW_AT_byte_size   : 8
    <c0b5e>   DW_AT_type        : <0xc0af7>
 <1><c0b62>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0b63>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <c0b67>   DW_AT_decl_file   : 5
    <c0b68>   DW_AT_decl_line   : 22
    <c0b69>   DW_AT_decl_column : 15
    <c0b6a>   DW_AT_type        : <0xc0b28>
 <1><c0b6e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0b6f>   DW_AT_byte_size   : 8
    <c0b6f>   DW_AT_type        : <0xc0b73>
 <1><c0b73>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <c0b74>   DW_AT_prototyped  : 1
 <1><c0b74>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c0b75>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <c0b79>   DW_AT_byte_size   : 24
    <c0b7a>   DW_AT_decl_file   : 6
    <c0b7b>   DW_AT_decl_line   : 82
    <c0b7c>   DW_AT_decl_column : 16
    <c0b7d>   DW_AT_sibling     : <0xc0ba9>
 <2><c0b81>: Abbrev Number: 2 (DW_TAG_member)
    <c0b82>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <c0b86>   DW_AT_decl_file   : 6
    <c0b87>   DW_AT_decl_line   : 83
    <c0b88>   DW_AT_decl_column : 21
    <c0b89>   DW_AT_type        : <0xc0af7>
    <c0b8d>   DW_AT_data_member_location: 0
 <2><c0b8e>: Abbrev Number: 7 (DW_TAG_member)
    <c0b8f>   DW_AT_name        : len
    <c0b93>   DW_AT_decl_file   : 6
    <c0b94>   DW_AT_decl_line   : 84
    <c0b95>   DW_AT_decl_column : 21
    <c0b96>   DW_AT_type        : <0xc0b34>
    <c0b9a>   DW_AT_data_member_location: 8
 <2><c0b9b>: Abbrev Number: 2 (DW_TAG_member)
    <c0b9c>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c0ba0>   DW_AT_decl_file   : 6
    <c0ba1>   DW_AT_decl_line   : 85
    <c0ba2>   DW_AT_decl_column : 21
    <c0ba3>   DW_AT_type        : <0xc0b34>
    <c0ba7>   DW_AT_data_member_location: 16
 <2><c0ba8>: Abbrev Number: 0
 <1><c0ba9>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0baa>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <c0bae>   DW_AT_decl_file   : 6
    <c0baf>   DW_AT_decl_line   : 86
    <c0bb0>   DW_AT_decl_column : 3
    <c0bb1>   DW_AT_type        : <0xc0b74>
 <1><c0bb5>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0bb6>   DW_AT_byte_size   : 8
    <c0bb7>   DW_AT_encoding    : 4	(float)
    <c0bb8>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c0bbc>: Abbrev Number: 6 (DW_TAG_base_type)
    <c0bbd>   DW_AT_byte_size   : 4
    <c0bbe>   DW_AT_encoding    : 4	(float)
    <c0bbf>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c0bc3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0bc4>   DW_AT_byte_size   : 8
    <c0bc4>   DW_AT_type        : <0xc0b0f>
 <1><c0bc8>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <c0bc9>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <c0bcd>   DW_AT_encoding    : 7	(unsigned)
    <c0bce>   DW_AT_byte_size   : 4
    <c0bcf>   DW_AT_type        : <0xc0ab3>
    <c0bd3>   DW_AT_decl_file   : 7
    <c0bd4>   DW_AT_decl_line   : 25
    <c0bd5>   DW_AT_decl_column : 14
    <c0bd6>   DW_AT_sibling     : <0xc0bf3>
 <2><c0bda>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c0bdb>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <c0bdf>   DW_AT_const_value : 0
 <2><c0be0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c0be1>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <c0be5>   DW_AT_const_value : 1
 <2><c0be6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c0be7>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <c0beb>   DW_AT_const_value : 2
 <2><c0bec>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c0bed>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <c0bf1>   DW_AT_const_value : 3
 <2><c0bf2>: Abbrev Number: 0
 <1><c0bf3>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0bf4>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <c0bf8>   DW_AT_decl_file   : 7
    <c0bf9>   DW_AT_decl_line   : 30
    <c0bfa>   DW_AT_decl_column : 3
    <c0bfb>   DW_AT_type        : <0xc0bc8>
 <1><c0bff>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0c00>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <c0c04>   DW_AT_decl_file   : 7
    <c0c05>   DW_AT_decl_line   : 54
    <c0c06>   DW_AT_decl_column : 15
    <c0c07>   DW_AT_type        : <0xc0c0b>
 <1><c0c0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0c0c>   DW_AT_byte_size   : 8
    <c0c0c>   DW_AT_type        : <0xc0c10>
 <1><c0c10>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0c11>   DW_AT_prototyped  : 1
    <c0c11>   DW_AT_type        : <0xc0acf>
    <c0c15>   DW_AT_sibling     : <0xc0c24>
 <2><c0c19>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0c1a>   DW_AT_type        : <0xc0c24>
 <2><c0c1e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0c1f>   DW_AT_type        : <0xc0acf>
 <2><c0c23>: Abbrev Number: 0
 <1><c0c24>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0c25>   DW_AT_byte_size   : 8
    <c0c25>   DW_AT_type        : <0xc0c29>
 <1><c0c29>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c0c2a>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <c0c2e>   DW_AT_byte_size   : 80
    <c0c2f>   DW_AT_decl_file   : 7
    <c0c30>   DW_AT_decl_line   : 97
    <c0c31>   DW_AT_decl_column : 16
    <c0c32>   DW_AT_sibling     : <0xc0ced>
 <2><c0c36>: Abbrev Number: 2 (DW_TAG_member)
    <c0c37>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <c0c3b>   DW_AT_decl_file   : 7
    <c0c3c>   DW_AT_decl_line   : 98
    <c0c3d>   DW_AT_decl_column : 21
    <c0c3e>   DW_AT_type        : <0xc0acf>
    <c0c42>   DW_AT_data_member_location: 0
 <2><c0c43>: Abbrev Number: 7 (DW_TAG_member)
    <c0c44>   DW_AT_name        : len
    <c0c48>   DW_AT_decl_file   : 7
    <c0c49>   DW_AT_decl_line   : 99
    <c0c4a>   DW_AT_decl_column : 21
    <c0c4b>   DW_AT_type        : <0xc0acf>
    <c0c4f>   DW_AT_data_member_location: 4
 <2><c0c50>: Abbrev Number: 2 (DW_TAG_member)
    <c0c51>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <c0c55>   DW_AT_decl_file   : 7
    <c0c56>   DW_AT_decl_line   : 100
    <c0c57>   DW_AT_decl_column : 21
    <c0c58>   DW_AT_type        : <0xc0bf3>
    <c0c5c>   DW_AT_data_member_location: 8
 <2><c0c5d>: Abbrev Number: 2 (DW_TAG_member)
    <c0c5e>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c0c62>   DW_AT_decl_file   : 7
    <c0c63>   DW_AT_decl_line   : 101
    <c0c64>   DW_AT_decl_column : 21
    <c0c65>   DW_AT_type        : <0xc0b62>
    <c0c69>   DW_AT_data_member_location: 16
 <2><c0c6a>: Abbrev Number: 2 (DW_TAG_member)
    <c0c6b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c0c6f>   DW_AT_decl_file   : 7
    <c0c70>   DW_AT_decl_line   : 102
    <c0c71>   DW_AT_decl_column : 21
    <c0c72>   DW_AT_type        : <0xc0acf>
    <c0c76>   DW_AT_data_member_location: 24
 <2><c0c77>: Abbrev Number: 2 (DW_TAG_member)
    <c0c78>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <c0c7c>   DW_AT_decl_file   : 7
    <c0c7d>   DW_AT_decl_line   : 103
    <c0c7e>   DW_AT_decl_column : 21
    <c0c7f>   DW_AT_type        : <0xc0acf>
    <c0c83>   DW_AT_data_member_location: 28
 <2><c0c84>: Abbrev Number: 2 (DW_TAG_member)
    <c0c85>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <c0c89>   DW_AT_decl_file   : 7
    <c0c8a>   DW_AT_decl_line   : 104
    <c0c8b>   DW_AT_decl_column : 21
    <c0c8c>   DW_AT_type        : <0xc0acf>
    <c0c90>   DW_AT_data_member_location: 32
 <2><c0c91>: Abbrev Number: 2 (DW_TAG_member)
    <c0c92>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <c0c96>   DW_AT_decl_file   : 7
    <c0c97>   DW_AT_decl_line   : 105
    <c0c98>   DW_AT_decl_column : 21
    <c0c99>   DW_AT_type        : <0xc0ab3>
    <c0c9d>   DW_AT_data_member_location: 36
 <2><c0c9e>: Abbrev Number: 2 (DW_TAG_member)
    <c0c9f>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <c0ca3>   DW_AT_decl_file   : 7
    <c0ca4>   DW_AT_decl_line   : 106
    <c0ca5>   DW_AT_decl_column : 21
    <c0ca6>   DW_AT_type        : <0xc0ab3>
    <c0caa>   DW_AT_data_member_location: 40
 <2><c0cab>: Abbrev Number: 2 (DW_TAG_member)
    <c0cac>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <c0cb0>   DW_AT_decl_file   : 7
    <c0cb1>   DW_AT_decl_line   : 109
    <c0cb2>   DW_AT_decl_column : 21
    <c0cb3>   DW_AT_type        : <0xc0b47>
    <c0cb7>   DW_AT_data_member_location: 44
 <2><c0cb8>: Abbrev Number: 2 (DW_TAG_member)
    <c0cb9>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <c0cbd>   DW_AT_decl_file   : 7
    <c0cbe>   DW_AT_decl_line   : 110
    <c0cbf>   DW_AT_decl_column : 21
    <c0cc0>   DW_AT_type        : <0xc0b03>
    <c0cc4>   DW_AT_data_member_location: 48
 <2><c0cc5>: Abbrev Number: 2 (DW_TAG_member)
    <c0cc6>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <c0cca>   DW_AT_decl_file   : 7
    <c0ccb>   DW_AT_decl_line   : 112
    <c0ccc>   DW_AT_decl_column : 22
    <c0ccd>   DW_AT_type        : <0xc0f85>
    <c0cd1>   DW_AT_data_member_location: 56
 <2><c0cd2>: Abbrev Number: 2 (DW_TAG_member)
    <c0cd3>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <c0cd7>   DW_AT_decl_file   : 7
    <c0cd8>   DW_AT_decl_line   : 114
    <c0cd9>   DW_AT_decl_column : 14
    <c0cda>   DW_AT_type        : <0xc0ae9>
    <c0cde>   DW_AT_data_member_location: 64
 <2><c0cdf>: Abbrev Number: 2 (DW_TAG_member)
    <c0ce0>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <c0ce4>   DW_AT_decl_file   : 7
    <c0ce5>   DW_AT_decl_line   : 116
    <c0ce6>   DW_AT_decl_column : 22
    <c0ce7>   DW_AT_type        : <0xc0c24>
    <c0ceb>   DW_AT_data_member_location: 72
 <2><c0cec>: Abbrev Number: 0
 <1><c0ced>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0cee>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <c0cf2>   DW_AT_decl_file   : 7
    <c0cf3>   DW_AT_decl_line   : 59
    <c0cf4>   DW_AT_decl_column : 15
    <c0cf5>   DW_AT_type        : <0xc0cf9>
 <1><c0cf9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0cfa>   DW_AT_byte_size   : 8
    <c0cfa>   DW_AT_type        : <0xc0cfe>
 <1><c0cfe>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0cff>   DW_AT_prototyped  : 1
    <c0cff>   DW_AT_type        : <0xc0acf>
    <c0d03>   DW_AT_sibling     : <0xc0d0d>
 <2><c0d07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d08>   DW_AT_type        : <0xc0c24>
 <2><c0d0c>: Abbrev Number: 0
 <1><c0d0d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0d0e>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <c0d12>   DW_AT_decl_file   : 7
    <c0d13>   DW_AT_decl_line   : 60
    <c0d14>   DW_AT_decl_column : 15
    <c0d15>   DW_AT_type        : <0xc0cf9>
 <1><c0d19>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0d1a>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <c0d1e>   DW_AT_decl_file   : 7
    <c0d1f>   DW_AT_decl_line   : 61
    <c0d20>   DW_AT_decl_column : 15
    <c0d21>   DW_AT_type        : <0xc0d25>
 <1><c0d25>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0d26>   DW_AT_byte_size   : 8
    <c0d26>   DW_AT_type        : <0xc0d2a>
 <1><c0d2a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0d2b>   DW_AT_prototyped  : 1
    <c0d2b>   DW_AT_type        : <0xc0acf>
    <c0d2f>   DW_AT_sibling     : <0xc0d43>
 <2><c0d33>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d34>   DW_AT_type        : <0xc0c24>
 <2><c0d38>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d39>   DW_AT_type        : <0xc0b62>
 <2><c0d3d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d3e>   DW_AT_type        : <0xc0acf>
 <2><c0d42>: Abbrev Number: 0
 <1><c0d43>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0d44>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <c0d48>   DW_AT_decl_file   : 7
    <c0d49>   DW_AT_decl_line   : 62
    <c0d4a>   DW_AT_decl_column : 15
    <c0d4b>   DW_AT_type        : <0xc0d4f>
 <1><c0d4f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0d50>   DW_AT_byte_size   : 8
    <c0d50>   DW_AT_type        : <0xc0d54>
 <1><c0d54>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0d55>   DW_AT_prototyped  : 1
    <c0d55>   DW_AT_type        : <0xc0acf>
    <c0d59>   DW_AT_sibling     : <0xc0d68>
 <2><c0d5d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d5e>   DW_AT_type        : <0xc0c24>
 <2><c0d62>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d63>   DW_AT_type        : <0xc0d68>
 <2><c0d67>: Abbrev Number: 0
 <1><c0d68>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0d69>   DW_AT_byte_size   : 8
    <c0d69>   DW_AT_type        : <0xc0b62>
 <1><c0d6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0d6e>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <c0d72>   DW_AT_decl_file   : 7
    <c0d73>   DW_AT_decl_line   : 63
    <c0d74>   DW_AT_decl_column : 15
    <c0d75>   DW_AT_type        : <0xc0d79>
 <1><c0d79>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0d7a>   DW_AT_byte_size   : 8
    <c0d7a>   DW_AT_type        : <0xc0d7e>
 <1><c0d7e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0d7f>   DW_AT_prototyped  : 1
    <c0d7f>   DW_AT_type        : <0xc0acf>
    <c0d83>   DW_AT_sibling     : <0xc0d97>
 <2><c0d87>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d88>   DW_AT_type        : <0xc0c24>
 <2><c0d8c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d8d>   DW_AT_type        : <0xc0ae9>
 <2><c0d91>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0d92>   DW_AT_type        : <0xc0d97>
 <2><c0d96>: Abbrev Number: 0
 <1><c0d97>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0d98>   DW_AT_byte_size   : 8
    <c0d98>   DW_AT_type        : <0xc0b03>
 <1><c0d9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0d9d>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <c0da1>   DW_AT_decl_file   : 7
    <c0da2>   DW_AT_decl_line   : 65
    <c0da3>   DW_AT_decl_column : 15
    <c0da4>   DW_AT_type        : <0xc0da8>
 <1><c0da8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0da9>   DW_AT_byte_size   : 8
    <c0da9>   DW_AT_type        : <0xc0dad>
 <1><c0dad>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0dae>   DW_AT_prototyped  : 1
    <c0dae>   DW_AT_type        : <0xc0acf>
    <c0db2>   DW_AT_sibling     : <0xc0dc6>
 <2><c0db6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0db7>   DW_AT_type        : <0xc0c24>
 <2><c0dbb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0dbc>   DW_AT_type        : <0xc0bc3>
 <2><c0dc0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0dc1>   DW_AT_type        : <0xc0d97>
 <2><c0dc5>: Abbrev Number: 0
 <1><c0dc6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0dc7>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <c0dcb>   DW_AT_decl_file   : 7
    <c0dcc>   DW_AT_decl_line   : 67
    <c0dcd>   DW_AT_decl_column : 15
    <c0dce>   DW_AT_type        : <0xc0dd2>
 <1><c0dd2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0dd3>   DW_AT_byte_size   : 8
    <c0dd3>   DW_AT_type        : <0xc0dd7>
 <1><c0dd7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0dd8>   DW_AT_prototyped  : 1
    <c0dd8>   DW_AT_type        : <0xc0acf>
    <c0ddc>   DW_AT_sibling     : <0xc0df0>
 <2><c0de0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0de1>   DW_AT_type        : <0xc0c24>
 <2><c0de5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0de6>   DW_AT_type        : <0xc0b57>
 <2><c0dea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0deb>   DW_AT_type        : <0xc0b03>
 <2><c0def>: Abbrev Number: 0
 <1><c0df0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0df1>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <c0df5>   DW_AT_decl_file   : 7
    <c0df6>   DW_AT_decl_line   : 69
    <c0df7>   DW_AT_decl_column : 15
    <c0df8>   DW_AT_type        : <0xc0dfc>
 <1><c0dfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0dfd>   DW_AT_byte_size   : 8
    <c0dfd>   DW_AT_type        : <0xc0e01>
 <1><c0e01>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0e02>   DW_AT_prototyped  : 1
    <c0e02>   DW_AT_type        : <0xc0acf>
    <c0e06>   DW_AT_sibling     : <0xc0e1a>
 <2><c0e0a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e0b>   DW_AT_type        : <0xc0c24>
 <2><c0e0f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e10>   DW_AT_type        : <0xc0e1a>
 <2><c0e14>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e15>   DW_AT_type        : <0xc0b03>
 <2><c0e19>: Abbrev Number: 0
 <1><c0e1a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0e1b>   DW_AT_byte_size   : 8
    <c0e1b>   DW_AT_type        : <0xc0b1c>
 <1><c0e1f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0e20>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <c0e24>   DW_AT_decl_file   : 7
    <c0e25>   DW_AT_decl_line   : 71
    <c0e26>   DW_AT_decl_column : 15
    <c0e27>   DW_AT_type        : <0xc0e2b>
 <1><c0e2b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0e2c>   DW_AT_byte_size   : 8
    <c0e2c>   DW_AT_type        : <0xc0e30>
 <1><c0e30>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0e31>   DW_AT_prototyped  : 1
    <c0e31>   DW_AT_type        : <0xc0acf>
    <c0e35>   DW_AT_sibling     : <0xc0e49>
 <2><c0e39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e3a>   DW_AT_type        : <0xc0c24>
 <2><c0e3e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e3f>   DW_AT_type        : <0xc0b62>
 <2><c0e43>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e44>   DW_AT_type        : <0xc0b62>
 <2><c0e48>: Abbrev Number: 0
 <1><c0e49>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0e4a>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <c0e4e>   DW_AT_decl_file   : 7
    <c0e4f>   DW_AT_decl_line   : 73
    <c0e50>   DW_AT_decl_column : 15
    <c0e51>   DW_AT_type        : <0xc0e2b>
 <1><c0e55>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0e56>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <c0e5a>   DW_AT_decl_file   : 7
    <c0e5b>   DW_AT_decl_line   : 75
    <c0e5c>   DW_AT_decl_column : 15
    <c0e5d>   DW_AT_type        : <0xc0e61>
 <1><c0e61>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0e62>   DW_AT_byte_size   : 8
    <c0e62>   DW_AT_type        : <0xc0e66>
 <1><c0e66>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0e67>   DW_AT_prototyped  : 1
    <c0e67>   DW_AT_type        : <0xc0acf>
    <c0e6b>   DW_AT_sibling     : <0xc0e7a>
 <2><c0e6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e70>   DW_AT_type        : <0xc0c24>
 <2><c0e74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e75>   DW_AT_type        : <0xc0e7a>
 <2><c0e79>: Abbrev Number: 0
 <1><c0e7a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0e7b>   DW_AT_byte_size   : 8
    <c0e7b>   DW_AT_type        : <0xc0ba9>
 <1><c0e7f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0e80>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <c0e84>   DW_AT_decl_file   : 7
    <c0e85>   DW_AT_decl_line   : 76
    <c0e86>   DW_AT_decl_column : 15
    <c0e87>   DW_AT_type        : <0xc0e8b>
 <1><c0e8b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0e8c>   DW_AT_byte_size   : 8
    <c0e8c>   DW_AT_type        : <0xc0e90>
 <1><c0e90>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c0e91>   DW_AT_prototyped  : 1
    <c0e91>   DW_AT_type        : <0xc0acf>
    <c0e95>   DW_AT_sibling     : <0xc0ea9>
 <2><c0e99>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e9a>   DW_AT_type        : <0xc0c24>
 <2><c0e9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0e9f>   DW_AT_type        : <0xc0bc3>
 <2><c0ea3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0ea4>   DW_AT_type        : <0xc0b34>
 <2><c0ea8>: Abbrev Number: 0
 <1><c0ea9>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0eaa>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <c0eae>   DW_AT_decl_file   : 7
    <c0eaf>   DW_AT_decl_line   : 77
    <c0eb0>   DW_AT_decl_column : 15
    <c0eb1>   DW_AT_type        : <0xc0cf9>
 <1><c0eb5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c0eb6>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <c0eba>   DW_AT_byte_size   : 112
    <c0ebb>   DW_AT_decl_file   : 7
    <c0ebc>   DW_AT_decl_line   : 80
    <c0ebd>   DW_AT_decl_column : 16
    <c0ebe>   DW_AT_sibling     : <0xc0f79>
 <2><c0ec2>: Abbrev Number: 2 (DW_TAG_member)
    <c0ec3>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <c0ec7>   DW_AT_decl_file   : 7
    <c0ec8>   DW_AT_decl_line   : 81
    <c0ec9>   DW_AT_decl_column : 25
    <c0eca>   DW_AT_type        : <0xc0ced>
    <c0ece>   DW_AT_data_member_location: 0
 <2><c0ecf>: Abbrev Number: 2 (DW_TAG_member)
    <c0ed0>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <c0ed4>   DW_AT_decl_file   : 7
    <c0ed5>   DW_AT_decl_line   : 82
    <c0ed6>   DW_AT_decl_column : 25
    <c0ed7>   DW_AT_type        : <0xc0d0d>
    <c0edb>   DW_AT_data_member_location: 8
 <2><c0edc>: Abbrev Number: 2 (DW_TAG_member)
    <c0edd>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <c0ee1>   DW_AT_decl_file   : 7
    <c0ee2>   DW_AT_decl_line   : 83
    <c0ee3>   DW_AT_decl_column : 25
    <c0ee4>   DW_AT_type        : <0xc0d19>
    <c0ee8>   DW_AT_data_member_location: 16
 <2><c0ee9>: Abbrev Number: 2 (DW_TAG_member)
    <c0eea>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <c0eee>   DW_AT_decl_file   : 7
    <c0eef>   DW_AT_decl_line   : 84
    <c0ef0>   DW_AT_decl_column : 25
    <c0ef1>   DW_AT_type        : <0xc0d43>
    <c0ef5>   DW_AT_data_member_location: 24
 <2><c0ef6>: Abbrev Number: 2 (DW_TAG_member)
    <c0ef7>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <c0efb>   DW_AT_decl_file   : 7
    <c0efc>   DW_AT_decl_line   : 85
    <c0efd>   DW_AT_decl_column : 25
    <c0efe>   DW_AT_type        : <0xc0d6d>
    <c0f02>   DW_AT_data_member_location: 32
 <2><c0f03>: Abbrev Number: 2 (DW_TAG_member)
    <c0f04>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <c0f08>   DW_AT_decl_file   : 7
    <c0f09>   DW_AT_decl_line   : 86
    <c0f0a>   DW_AT_decl_column : 25
    <c0f0b>   DW_AT_type        : <0xc0d9c>
    <c0f0f>   DW_AT_data_member_location: 40
 <2><c0f10>: Abbrev Number: 2 (DW_TAG_member)
    <c0f11>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <c0f15>   DW_AT_decl_file   : 7
    <c0f16>   DW_AT_decl_line   : 87
    <c0f17>   DW_AT_decl_column : 25
    <c0f18>   DW_AT_type        : <0xc0dc6>
    <c0f1c>   DW_AT_data_member_location: 48
 <2><c0f1d>: Abbrev Number: 2 (DW_TAG_member)
    <c0f1e>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <c0f22>   DW_AT_decl_file   : 7
    <c0f23>   DW_AT_decl_line   : 88
    <c0f24>   DW_AT_decl_column : 25
    <c0f25>   DW_AT_type        : <0xc0df0>
    <c0f29>   DW_AT_data_member_location: 56
 <2><c0f2a>: Abbrev Number: 2 (DW_TAG_member)
    <c0f2b>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <c0f2f>   DW_AT_decl_file   : 7
    <c0f30>   DW_AT_decl_line   : 89
    <c0f31>   DW_AT_decl_column : 25
    <c0f32>   DW_AT_type        : <0xc0e1f>
    <c0f36>   DW_AT_data_member_location: 64
 <2><c0f37>: Abbrev Number: 2 (DW_TAG_member)
    <c0f38>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <c0f3c>   DW_AT_decl_file   : 7
    <c0f3d>   DW_AT_decl_line   : 90
    <c0f3e>   DW_AT_decl_column : 25
    <c0f3f>   DW_AT_type        : <0xc0e49>
    <c0f43>   DW_AT_data_member_location: 72
 <2><c0f44>: Abbrev Number: 2 (DW_TAG_member)
    <c0f45>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <c0f49>   DW_AT_decl_file   : 7
    <c0f4a>   DW_AT_decl_line   : 91
    <c0f4b>   DW_AT_decl_column : 25
    <c0f4c>   DW_AT_type        : <0xc0e55>
    <c0f50>   DW_AT_data_member_location: 80
 <2><c0f51>: Abbrev Number: 2 (DW_TAG_member)
    <c0f52>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <c0f56>   DW_AT_decl_file   : 7
    <c0f57>   DW_AT_decl_line   : 92
    <c0f58>   DW_AT_decl_column : 25
    <c0f59>   DW_AT_type        : <0xc0e7f>
    <c0f5d>   DW_AT_data_member_location: 88
 <2><c0f5e>: Abbrev Number: 2 (DW_TAG_member)
    <c0f5f>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <c0f63>   DW_AT_decl_file   : 7
    <c0f64>   DW_AT_decl_line   : 93
    <c0f65>   DW_AT_decl_column : 25
    <c0f66>   DW_AT_type        : <0xc0bff>
    <c0f6a>   DW_AT_data_member_location: 96
 <2><c0f6b>: Abbrev Number: 2 (DW_TAG_member)
    <c0f6c>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <c0f70>   DW_AT_decl_file   : 7
    <c0f71>   DW_AT_decl_line   : 94
    <c0f72>   DW_AT_decl_column : 25
    <c0f73>   DW_AT_type        : <0xc0ea9>
    <c0f77>   DW_AT_data_member_location: 104
 <2><c0f78>: Abbrev Number: 0
 <1><c0f79>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0f7a>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <c0f7e>   DW_AT_decl_file   : 7
    <c0f7f>   DW_AT_decl_line   : 95
    <c0f80>   DW_AT_decl_column : 3
    <c0f81>   DW_AT_type        : <0xc0eb5>
 <1><c0f85>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0f86>   DW_AT_byte_size   : 8
    <c0f86>   DW_AT_type        : <0xc0f79>
 <1><c0f8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0f8b>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <c0f8f>   DW_AT_decl_file   : 7
    <c0f90>   DW_AT_decl_line   : 117
    <c0f91>   DW_AT_decl_column : 3
    <c0f92>   DW_AT_type        : <0xc0c29>
 <1><c0f96>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c0f97>   DW_AT_byte_size   : 8
    <c0f98>   DW_AT_decl_file   : 8
    <c0f98>   DW_AT_decl_line   : 4
    <c0f99>   DW_AT_decl_column : 3
    <c0f99>   DW_AT_sibling     : <0xc0fb8>
 <2><c0f9d>: Abbrev Number: 2 (DW_TAG_member)
    <c0f9e>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <c0fa2>   DW_AT_decl_file   : 8
    <c0fa3>   DW_AT_decl_line   : 5
    <c0fa4>   DW_AT_decl_column : 8
    <c0fa5>   DW_AT_type        : <0xc0acf>
    <c0fa9>   DW_AT_data_member_location: 0
 <2><c0faa>: Abbrev Number: 2 (DW_TAG_member)
    <c0fab>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <c0faf>   DW_AT_decl_file   : 8
    <c0fb0>   DW_AT_decl_line   : 6
    <c0fb1>   DW_AT_decl_column : 8
    <c0fb2>   DW_AT_type        : <0xc0acf>
    <c0fb6>   DW_AT_data_member_location: 4
 <2><c0fb7>: Abbrev Number: 0
 <1><c0fb8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c0fb9>   DW_AT_byte_size   : 16
    <c0fba>   DW_AT_decl_file   : 8
    <c0fba>   DW_AT_decl_line   : 8
    <c0fbb>   DW_AT_decl_column : 3
    <c0fbb>   DW_AT_sibling     : <0xc0fee>
 <2><c0fbf>: Abbrev Number: 7 (DW_TAG_member)
    <c0fc0>   DW_AT_name        : x
    <c0fc2>   DW_AT_decl_file   : 8
    <c0fc3>   DW_AT_decl_line   : 9
    <c0fc4>   DW_AT_decl_column : 8
    <c0fc5>   DW_AT_type        : <0xc0acf>
    <c0fc9>   DW_AT_data_member_location: 0
 <2><c0fca>: Abbrev Number: 7 (DW_TAG_member)
    <c0fcb>   DW_AT_name        : y
    <c0fcd>   DW_AT_decl_file   : 8
    <c0fce>   DW_AT_decl_line   : 9
    <c0fcf>   DW_AT_decl_column : 11
    <c0fd0>   DW_AT_type        : <0xc0acf>
    <c0fd4>   DW_AT_data_member_location: 4
 <2><c0fd5>: Abbrev Number: 7 (DW_TAG_member)
    <c0fd6>   DW_AT_name        : dx
    <c0fd9>   DW_AT_decl_file   : 8
    <c0fda>   DW_AT_decl_line   : 10
    <c0fdb>   DW_AT_decl_column : 8
    <c0fdc>   DW_AT_type        : <0xc0acf>
    <c0fe0>   DW_AT_data_member_location: 8
 <2><c0fe1>: Abbrev Number: 7 (DW_TAG_member)
    <c0fe2>   DW_AT_name        : dy
    <c0fe5>   DW_AT_decl_file   : 8
    <c0fe6>   DW_AT_decl_line   : 10
    <c0fe7>   DW_AT_decl_column : 12
    <c0fe8>   DW_AT_type        : <0xc0acf>
    <c0fec>   DW_AT_data_member_location: 12
 <2><c0fed>: Abbrev Number: 0
 <1><c0fee>: Abbrev Number: 31 (DW_TAG_union_type)
    <c0fef>   DW_AT_byte_size   : 16
    <c0ff0>   DW_AT_decl_file   : 8
    <c0ff1>   DW_AT_decl_line   : 3
    <c0ff2>   DW_AT_decl_column : 2
    <c0ff3>   DW_AT_sibling     : <0xc101e>
 <2><c0ff7>: Abbrev Number: 17 (DW_TAG_member)
    <c0ff8>   DW_AT_type        : <0xc0f96>
 <2><c0ffc>: Abbrev Number: 17 (DW_TAG_member)
    <c0ffd>   DW_AT_type        : <0xc0fb8>
 <2><c1001>: Abbrev Number: 32 (DW_TAG_member)
    <c1002>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <c1006>   DW_AT_decl_file   : 8
    <c1007>   DW_AT_decl_line   : 12
    <c1008>   DW_AT_decl_column : 7
    <c1009>   DW_AT_type        : <0xc0acf>
 <2><c100d>: Abbrev Number: 18 (DW_TAG_member)
    <c100e>   DW_AT_name        : z
    <c1010>   DW_AT_decl_file   : 8
    <c1010>   DW_AT_decl_line   : 13
    <c1011>   DW_AT_decl_column : 7
    <c1011>   DW_AT_type        : <0xc0acf>
 <2><c1015>: Abbrev Number: 18 (DW_TAG_member)
    <c1016>   DW_AT_name        : w
    <c1018>   DW_AT_decl_file   : 8
    <c1018>   DW_AT_decl_line   : 14
    <c1019>   DW_AT_decl_column : 7
    <c1019>   DW_AT_type        : <0xc0acf>
 <2><c101d>: Abbrev Number: 0
 <1><c101e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c101f>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <c1023>   DW_AT_byte_size   : 20
    <c1024>   DW_AT_decl_file   : 8
    <c1025>   DW_AT_decl_line   : 1
    <c1026>   DW_AT_decl_column : 8
    <c1027>   DW_AT_sibling     : <0xc103f>
 <2><c102b>: Abbrev Number: 2 (DW_TAG_member)
    <c102c>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <c1030>   DW_AT_decl_file   : 8
    <c1031>   DW_AT_decl_line   : 2
    <c1032>   DW_AT_decl_column : 6
    <c1033>   DW_AT_type        : <0xc0acf>
    <c1037>   DW_AT_data_member_location: 0
 <2><c1038>: Abbrev Number: 33 (DW_TAG_member)
    <c1039>   DW_AT_type        : <0xc0fee>
    <c103d>   DW_AT_data_member_location: 4
 <2><c103e>: Abbrev Number: 0
 <1><c103f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1040>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <c1044>   DW_AT_decl_file   : 8
    <c1045>   DW_AT_decl_line   : 18
    <c1046>   DW_AT_decl_column : 23
    <c1047>   DW_AT_type        : <0xc101e>
 <1><c104b>: Abbrev Number: 3 (DW_TAG_typedef)
    <c104c>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <c1050>   DW_AT_decl_file   : 9
    <c1051>   DW_AT_decl_line   : 1
    <c1052>   DW_AT_decl_column : 23
    <c1053>   DW_AT_type        : <0xc1057>
 <1><c1057>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1058>   DW_AT_byte_size   : 8
    <c1058>   DW_AT_type        : <0xc105c>
 <1><c105c>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c105d>   DW_AT_prototyped  : 1
    <c105d>   DW_AT_type        : <0xc0e7a>
 <1><c1061>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1062>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <c1066>   DW_AT_decl_file   : 9
    <c1067>   DW_AT_decl_line   : 2
    <c1068>   DW_AT_decl_column : 23
    <c1069>   DW_AT_type        : <0xc106d>
 <1><c106d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c106e>   DW_AT_byte_size   : 8
    <c106e>   DW_AT_type        : <0xc1072>
 <1><c1072>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c1073>   DW_AT_prototyped  : 1
    <c1073>   DW_AT_type        : <0xc0acf>
 <1><c1077>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1078>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <c107c>   DW_AT_decl_file   : 9
    <c107d>   DW_AT_decl_line   : 3
    <c107e>   DW_AT_decl_column : 23
    <c107f>   DW_AT_type        : <0xc106d>
 <1><c1083>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1084>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <c1088>   DW_AT_decl_file   : 9
    <c1089>   DW_AT_decl_line   : 10
    <c108a>   DW_AT_decl_column : 23
    <c108b>   DW_AT_type        : <0xc108f>
 <1><c108f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1090>   DW_AT_byte_size   : 8
    <c1090>   DW_AT_type        : <0xc1094>
 <1><c1094>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c1095>   DW_AT_prototyped  : 1
    <c1095>   DW_AT_sibling     : <0xc109f>
 <2><c1099>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c109a>   DW_AT_type        : <0xc0acf>
 <2><c109e>: Abbrev Number: 0
 <1><c109f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c10a0>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <c10a4>   DW_AT_decl_file   : 9
    <c10a5>   DW_AT_decl_line   : 14
    <c10a6>   DW_AT_decl_column : 23
    <c10a7>   DW_AT_type        : <0xc10ab>
 <1><c10ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c10ac>   DW_AT_byte_size   : 8
    <c10ac>   DW_AT_type        : <0xc10b0>
 <1><c10b0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c10b1>   DW_AT_prototyped  : 1
    <c10b1>   DW_AT_type        : <0xc0acf>
    <c10b5>   DW_AT_sibling     : <0xc10c9>
 <2><c10b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c10ba>   DW_AT_type        : <0xc0acf>
 <2><c10be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c10bf>   DW_AT_type        : <0xc0acf>
 <2><c10c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c10c4>   DW_AT_type        : <0xc0acf>
 <2><c10c8>: Abbrev Number: 0
 <1><c10c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <c10ca>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <c10ce>   DW_AT_decl_file   : 9
    <c10cf>   DW_AT_decl_line   : 18
    <c10d0>   DW_AT_decl_column : 23
    <c10d1>   DW_AT_type        : <0xc10ab>
 <1><c10d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <c10d6>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <c10da>   DW_AT_decl_file   : 9
    <c10db>   DW_AT_decl_line   : 24
    <c10dc>   DW_AT_decl_column : 23
    <c10dd>   DW_AT_type        : <0xc0b6e>
 <1><c10e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c10e2>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <c10e6>   DW_AT_decl_file   : 9
    <c10e7>   DW_AT_decl_line   : 28
    <c10e8>   DW_AT_decl_column : 23
    <c10e9>   DW_AT_type        : <0xc10ed>
 <1><c10ed>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c10ee>   DW_AT_byte_size   : 8
    <c10ee>   DW_AT_type        : <0xc10f2>
 <1><c10f2>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c10f3>   DW_AT_prototyped  : 1
    <c10f3>   DW_AT_type        : <0xc0acf>
    <c10f7>   DW_AT_sibling     : <0xc1106>
 <2><c10fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c10fc>   DW_AT_type        : <0xc0acf>
 <2><c1100>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1101>   DW_AT_type        : <0xc0acf>
 <2><c1105>: Abbrev Number: 0
 <1><c1106>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1107>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <c110b>   DW_AT_decl_file   : 9
    <c110c>   DW_AT_decl_line   : 34
    <c110d>   DW_AT_decl_column : 23
    <c110e>   DW_AT_type        : <0xc106d>
 <1><c1112>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1113>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <c1117>   DW_AT_decl_file   : 9
    <c1118>   DW_AT_decl_line   : 35
    <c1119>   DW_AT_decl_column : 23
    <c111a>   DW_AT_type        : <0xc106d>
 <1><c111e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c111f>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <c1123>   DW_AT_decl_file   : 9
    <c1124>   DW_AT_decl_line   : 36
    <c1125>   DW_AT_decl_column : 23
    <c1126>   DW_AT_type        : <0xc112a>
 <1><c112a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c112b>   DW_AT_byte_size   : 8
    <c112b>   DW_AT_type        : <0xc112f>
 <1><c112f>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c1130>   DW_AT_prototyped  : 1
    <c1130>   DW_AT_sibling     : <0xc113f>
 <2><c1134>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1135>   DW_AT_type        : <0xc113f>
 <2><c1139>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c113a>   DW_AT_type        : <0xc113f>
 <2><c113e>: Abbrev Number: 0
 <1><c113f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1140>   DW_AT_byte_size   : 8
    <c1140>   DW_AT_type        : <0xc0acf>
 <1><c1144>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1145>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <c1149>   DW_AT_decl_file   : 9
    <c114a>   DW_AT_decl_line   : 37
    <c114b>   DW_AT_decl_column : 23
    <c114c>   DW_AT_type        : <0xc112a>
 <1><c1150>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1151>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <c1155>   DW_AT_decl_file   : 9
    <c1156>   DW_AT_decl_line   : 45
    <c1157>   DW_AT_decl_column : 24
    <c1158>   DW_AT_type        : <0xc115c>
 <1><c115c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c115d>   DW_AT_byte_size   : 8
    <c115d>   DW_AT_type        : <0xc1161>
 <1><c1161>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c1162>   DW_AT_prototyped  : 1
    <c1162>   DW_AT_type        : <0xc0ab3>
    <c1166>   DW_AT_sibling     : <0xc117a>
 <2><c116a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c116b>   DW_AT_type        : <0xc0acf>
 <2><c116f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1170>   DW_AT_type        : <0xc0acf>
 <2><c1174>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1175>   DW_AT_type        : <0xc0acf>
 <2><c1179>: Abbrev Number: 0
 <1><c117a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c117b>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <c117f>   DW_AT_decl_file   : 9
    <c1180>   DW_AT_decl_line   : 48
    <c1181>   DW_AT_decl_column : 23
    <c1182>   DW_AT_type        : <0xc1186>
 <1><c1186>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1187>   DW_AT_byte_size   : 8
    <c1187>   DW_AT_type        : <0xc118b>
 <1><c118b>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c118c>   DW_AT_prototyped  : 1
    <c118c>   DW_AT_sibling     : <0xc11a0>
 <2><c1190>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1191>   DW_AT_type        : <0xc0b57>
 <2><c1195>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1196>   DW_AT_type        : <0xc0b03>
 <2><c119a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c119b>   DW_AT_type        : <0xc0acf>
 <2><c119f>: Abbrev Number: 0
 <1><c11a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c11a1>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <c11a5>   DW_AT_decl_file   : 9
    <c11a6>   DW_AT_decl_line   : 49
    <c11a7>   DW_AT_decl_column : 23
    <c11a8>   DW_AT_type        : <0xc11ac>
 <1><c11ac>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c11ad>   DW_AT_byte_size   : 8
    <c11ad>   DW_AT_type        : <0xc11b1>
 <1><c11b1>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <c11b2>   DW_AT_prototyped  : 1
    <c11b2>   DW_AT_sibling     : <0xc11c6>
 <2><c11b6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c11b7>   DW_AT_type        : <0xc0e1a>
 <2><c11bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c11bc>   DW_AT_type        : <0xc0b03>
 <2><c11c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c11c1>   DW_AT_type        : <0xc0acf>
 <2><c11c5>: Abbrev Number: 0
 <1><c11c6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c11c7>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <c11cb>   DW_AT_decl_file   : 9
    <c11cc>   DW_AT_decl_line   : 51
    <c11cd>   DW_AT_decl_column : 24
    <c11ce>   DW_AT_type        : <0xc11d2>
 <1><c11d2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c11d3>   DW_AT_byte_size   : 8
    <c11d3>   DW_AT_type        : <0xc11d7>
 <1><c11d7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c11d8>   DW_AT_prototyped  : 1
    <c11d8>   DW_AT_type        : <0xc0af7>
    <c11dc>   DW_AT_sibling     : <0xc11eb>
 <2><c11e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c11e1>   DW_AT_type        : <0xc0af7>
 <2><c11e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c11e6>   DW_AT_type        : <0xc0b34>
 <2><c11ea>: Abbrev Number: 0
 <1><c11eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <c11ec>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <c11f0>   DW_AT_decl_file   : 9
    <c11f1>   DW_AT_decl_line   : 54
    <c11f2>   DW_AT_decl_column : 23
    <c11f3>   DW_AT_type        : <0xc11f7>
 <1><c11f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c11f8>   DW_AT_byte_size   : 8
    <c11f8>   DW_AT_type        : <0xc11fc>
 <1><c11fc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c11fd>   DW_AT_prototyped  : 1
    <c11fd>   DW_AT_type        : <0xc0acf>
    <c1201>   DW_AT_sibling     : <0xc1224>
 <2><c1205>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1206>   DW_AT_type        : <0xc0e7a>
 <2><c120a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c120b>   DW_AT_type        : <0xc0ae9>
 <2><c120f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1210>   DW_AT_type        : <0xc0b34>
 <2><c1214>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1215>   DW_AT_type        : <0xc0acf>
 <2><c1219>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c121a>   DW_AT_type        : <0xc0acf>
 <2><c121e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c121f>   DW_AT_type        : <0xc0acf>
 <2><c1223>: Abbrev Number: 0
 <1><c1224>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1225>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <c1229>   DW_AT_decl_file   : 9
    <c122a>   DW_AT_decl_line   : 56
    <c122b>   DW_AT_decl_column : 23
    <c122c>   DW_AT_type        : <0xc1230>
 <1><c1230>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1231>   DW_AT_byte_size   : 8
    <c1231>   DW_AT_type        : <0xc1235>
 <1><c1235>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c1236>   DW_AT_prototyped  : 1
    <c1236>   DW_AT_type        : <0xc0acf>
    <c123a>   DW_AT_sibling     : <0xc1258>
 <2><c123e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c123f>   DW_AT_type        : <0xc0e1a>
 <2><c1243>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1244>   DW_AT_type        : <0xc0bc3>
 <2><c1248>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1249>   DW_AT_type        : <0xc0b34>
 <2><c124d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c124e>   DW_AT_type        : <0xc0acf>
 <2><c1252>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1253>   DW_AT_type        : <0xc0acf>
 <2><c1257>: Abbrev Number: 0
 <1><c1258>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1259>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <c125d>   DW_AT_decl_file   : 9
    <c125e>   DW_AT_decl_line   : 67
    <c125f>   DW_AT_decl_column : 23
    <c1260>   DW_AT_type        : <0xc1264>
 <1><c1264>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1265>   DW_AT_byte_size   : 8
    <c1265>   DW_AT_type        : <0xc1269>
 <1><c1269>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c126a>   DW_AT_prototyped  : 1
    <c126a>   DW_AT_type        : <0xc0acf>
    <c126e>   DW_AT_sibling     : <0xc1278>
 <2><c1272>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1273>   DW_AT_type        : <0xc0acf>
 <2><c1277>: Abbrev Number: 0
 <1><c1278>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1279>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <c127d>   DW_AT_decl_file   : 9
    <c127e>   DW_AT_decl_line   : 68
    <c127f>   DW_AT_decl_column : 23
    <c1280>   DW_AT_type        : <0xc1284>
 <1><c1284>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c1285>   DW_AT_byte_size   : 8
    <c1285>   DW_AT_type        : <0xc1289>
 <1><c1289>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c128a>   DW_AT_prototyped  : 1
    <c128a>   DW_AT_type        : <0xc0acf>
    <c128e>   DW_AT_sibling     : <0xc12ac>
 <2><c1292>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1293>   DW_AT_type        : <0xc113f>
 <2><c1297>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c1298>   DW_AT_type        : <0xc113f>
 <2><c129c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c129d>   DW_AT_type        : <0xc113f>
 <2><c12a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12a2>   DW_AT_type        : <0xc113f>
 <2><c12a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12a7>   DW_AT_type        : <0xc113f>
 <2><c12ab>: Abbrev Number: 0
 <1><c12ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <c12ad>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <c12b1>   DW_AT_decl_file   : 9
    <c12b2>   DW_AT_decl_line   : 69
    <c12b3>   DW_AT_decl_column : 23
    <c12b4>   DW_AT_type        : <0xc12b8>
 <1><c12b8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c12b9>   DW_AT_byte_size   : 8
    <c12b9>   DW_AT_type        : <0xc12bd>
 <1><c12bd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c12be>   DW_AT_prototyped  : 1
    <c12be>   DW_AT_type        : <0xc0acf>
    <c12c2>   DW_AT_sibling     : <0xc12db>
 <2><c12c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12c7>   DW_AT_type        : <0xc0acf>
 <2><c12cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12cc>   DW_AT_type        : <0xc0acf>
 <2><c12d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12d1>   DW_AT_type        : <0xc0acf>
 <2><c12d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12d6>   DW_AT_type        : <0xc0acf>
 <2><c12da>: Abbrev Number: 0
 <1><c12db>: Abbrev Number: 3 (DW_TAG_typedef)
    <c12dc>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <c12e0>   DW_AT_decl_file   : 9
    <c12e1>   DW_AT_decl_line   : 73
    <c12e2>   DW_AT_decl_column : 23
    <c12e3>   DW_AT_type        : <0xc12e7>
 <1><c12e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c12e8>   DW_AT_byte_size   : 8
    <c12e8>   DW_AT_type        : <0xc12ec>
 <1><c12ec>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <c12ed>   DW_AT_prototyped  : 1
    <c12ed>   DW_AT_type        : <0xc0acf>
    <c12f1>   DW_AT_sibling     : <0xc12fb>
 <2><c12f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c12f6>   DW_AT_type        : <0xc0aac>
 <2><c12fa>: Abbrev Number: 0
 <1><c12fb>: Abbrev Number: 3 (DW_TAG_typedef)
    <c12fc>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <c1300>   DW_AT_decl_file   : 9
    <c1301>   DW_AT_decl_line   : 74
    <c1302>   DW_AT_decl_column : 23
    <c1303>   DW_AT_type        : <0xc1307>
