 <2><d7c2c>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d7c2d>   DW_AT_type        : <0xd7b96>
    <d7c31>   DW_AT_upper_bound : 3
 <2><d7c32>: Abbrev Number: 0
 <1><d7c33>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7c34>   DW_AT_byte_size   : 8
    <d7c34>   DW_AT_type        : <0xd7c38>
 <1><d7c38>: Abbrev Number: 29 (DW_TAG_const_type)
 <1><d7c39>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7c3a>   DW_AT_byte_size   : 8
    <d7c3a>   DW_AT_type        : <0xd7bd3>
 <1><d7c3e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7c3f>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <d7c43>   DW_AT_decl_file   : 5
    <d7c44>   DW_AT_decl_line   : 22
    <d7c45>   DW_AT_decl_column : 15
    <d7c46>   DW_AT_type        : <0xd7c04>
 <1><d7c4a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7c4b>   DW_AT_byte_size   : 8
    <d7c4b>   DW_AT_type        : <0xd7c4f>
 <1><d7c4f>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <d7c50>   DW_AT_prototyped  : 1
 <1><d7c50>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d7c51>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <d7c55>   DW_AT_byte_size   : 24
    <d7c56>   DW_AT_decl_file   : 6
    <d7c57>   DW_AT_decl_line   : 82
    <d7c58>   DW_AT_decl_column : 16
    <d7c59>   DW_AT_sibling     : <0xd7c85>
 <2><d7c5d>: Abbrev Number: 2 (DW_TAG_member)
    <d7c5e>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <d7c62>   DW_AT_decl_file   : 6
    <d7c63>   DW_AT_decl_line   : 83
    <d7c64>   DW_AT_decl_column : 21
    <d7c65>   DW_AT_type        : <0xd7bd3>
    <d7c69>   DW_AT_data_member_location: 0
 <2><d7c6a>: Abbrev Number: 7 (DW_TAG_member)
    <d7c6b>   DW_AT_name        : len
    <d7c6f>   DW_AT_decl_file   : 6
    <d7c70>   DW_AT_decl_line   : 84
    <d7c71>   DW_AT_decl_column : 21
    <d7c72>   DW_AT_type        : <0xd7c10>
    <d7c76>   DW_AT_data_member_location: 8
 <2><d7c77>: Abbrev Number: 2 (DW_TAG_member)
    <d7c78>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d7c7c>   DW_AT_decl_file   : 6
    <d7c7d>   DW_AT_decl_line   : 85
    <d7c7e>   DW_AT_decl_column : 21
    <d7c7f>   DW_AT_type        : <0xd7c10>
    <d7c83>   DW_AT_data_member_location: 16
 <2><d7c84>: Abbrev Number: 0
 <1><d7c85>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7c86>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <d7c8a>   DW_AT_decl_file   : 6
    <d7c8b>   DW_AT_decl_line   : 86
    <d7c8c>   DW_AT_decl_column : 3
    <d7c8d>   DW_AT_type        : <0xd7c50>
 <1><d7c91>: Abbrev Number: 6 (DW_TAG_base_type)
    <d7c92>   DW_AT_byte_size   : 8
    <d7c93>   DW_AT_encoding    : 4	(float)
    <d7c94>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d7c98>: Abbrev Number: 6 (DW_TAG_base_type)
    <d7c99>   DW_AT_byte_size   : 4
    <d7c9a>   DW_AT_encoding    : 4	(float)
    <d7c9b>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d7c9f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7ca0>   DW_AT_byte_size   : 8
    <d7ca0>   DW_AT_type        : <0xd7beb>
 <1><d7ca4>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <d7ca5>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <d7ca9>   DW_AT_encoding    : 7	(unsigned)
    <d7caa>   DW_AT_byte_size   : 4
    <d7cab>   DW_AT_type        : <0xd7b8f>
    <d7caf>   DW_AT_decl_file   : 7
    <d7cb0>   DW_AT_decl_line   : 25
    <d7cb1>   DW_AT_decl_column : 14
    <d7cb2>   DW_AT_sibling     : <0xd7ccf>
 <2><d7cb6>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7cb7>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <d7cbb>   DW_AT_const_value : 0
 <2><d7cbc>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7cbd>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <d7cc1>   DW_AT_const_value : 1
 <2><d7cc2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7cc3>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <d7cc7>   DW_AT_const_value : 2
 <2><d7cc8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7cc9>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <d7ccd>   DW_AT_const_value : 3
 <2><d7cce>: Abbrev Number: 0
 <1><d7ccf>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7cd0>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <d7cd4>   DW_AT_decl_file   : 7
    <d7cd5>   DW_AT_decl_line   : 30
    <d7cd6>   DW_AT_decl_column : 3
    <d7cd7>   DW_AT_type        : <0xd7ca4>
 <1><d7cdb>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7cdc>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <d7ce0>   DW_AT_decl_file   : 7
    <d7ce1>   DW_AT_decl_line   : 54
    <d7ce2>   DW_AT_decl_column : 15
    <d7ce3>   DW_AT_type        : <0xd7ce7>
 <1><d7ce7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7ce8>   DW_AT_byte_size   : 8
    <d7ce8>   DW_AT_type        : <0xd7cec>
 <1><d7cec>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7ced>   DW_AT_prototyped  : 1
    <d7ced>   DW_AT_type        : <0xd7bab>
    <d7cf1>   DW_AT_sibling     : <0xd7d00>
 <2><d7cf5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7cf6>   DW_AT_type        : <0xd7d00>
 <2><d7cfa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7cfb>   DW_AT_type        : <0xd7bab>
 <2><d7cff>: Abbrev Number: 0
 <1><d7d00>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7d01>   DW_AT_byte_size   : 8
    <d7d01>   DW_AT_type        : <0xd7d05>
 <1><d7d05>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d7d06>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <d7d0a>   DW_AT_byte_size   : 80
    <d7d0b>   DW_AT_decl_file   : 7
    <d7d0c>   DW_AT_decl_line   : 97
    <d7d0d>   DW_AT_decl_column : 16
    <d7d0e>   DW_AT_sibling     : <0xd7dc9>
 <2><d7d12>: Abbrev Number: 2 (DW_TAG_member)
    <d7d13>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <d7d17>   DW_AT_decl_file   : 7
    <d7d18>   DW_AT_decl_line   : 98
    <d7d19>   DW_AT_decl_column : 21
    <d7d1a>   DW_AT_type        : <0xd7bab>
    <d7d1e>   DW_AT_data_member_location: 0
 <2><d7d1f>: Abbrev Number: 7 (DW_TAG_member)
    <d7d20>   DW_AT_name        : len
    <d7d24>   DW_AT_decl_file   : 7
    <d7d25>   DW_AT_decl_line   : 99
    <d7d26>   DW_AT_decl_column : 21
    <d7d27>   DW_AT_type        : <0xd7bab>
    <d7d2b>   DW_AT_data_member_location: 4
 <2><d7d2c>: Abbrev Number: 2 (DW_TAG_member)
    <d7d2d>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <d7d31>   DW_AT_decl_file   : 7
    <d7d32>   DW_AT_decl_line   : 100
    <d7d33>   DW_AT_decl_column : 21
    <d7d34>   DW_AT_type        : <0xd7ccf>
    <d7d38>   DW_AT_data_member_location: 8
 <2><d7d39>: Abbrev Number: 2 (DW_TAG_member)
    <d7d3a>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d7d3e>   DW_AT_decl_file   : 7
    <d7d3f>   DW_AT_decl_line   : 101
    <d7d40>   DW_AT_decl_column : 21
    <d7d41>   DW_AT_type        : <0xd7c3e>
    <d7d45>   DW_AT_data_member_location: 16
 <2><d7d46>: Abbrev Number: 2 (DW_TAG_member)
    <d7d47>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <d7d4b>   DW_AT_decl_file   : 7
    <d7d4c>   DW_AT_decl_line   : 102
    <d7d4d>   DW_AT_decl_column : 21
    <d7d4e>   DW_AT_type        : <0xd7bab>
    <d7d52>   DW_AT_data_member_location: 24
 <2><d7d53>: Abbrev Number: 2 (DW_TAG_member)
    <d7d54>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <d7d58>   DW_AT_decl_file   : 7
    <d7d59>   DW_AT_decl_line   : 103
    <d7d5a>   DW_AT_decl_column : 21
    <d7d5b>   DW_AT_type        : <0xd7bab>
    <d7d5f>   DW_AT_data_member_location: 28
 <2><d7d60>: Abbrev Number: 2 (DW_TAG_member)
    <d7d61>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <d7d65>   DW_AT_decl_file   : 7
    <d7d66>   DW_AT_decl_line   : 104
    <d7d67>   DW_AT_decl_column : 21
    <d7d68>   DW_AT_type        : <0xd7bab>
    <d7d6c>   DW_AT_data_member_location: 32
 <2><d7d6d>: Abbrev Number: 2 (DW_TAG_member)
    <d7d6e>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <d7d72>   DW_AT_decl_file   : 7
    <d7d73>   DW_AT_decl_line   : 105
    <d7d74>   DW_AT_decl_column : 21
    <d7d75>   DW_AT_type        : <0xd7b8f>
    <d7d79>   DW_AT_data_member_location: 36
 <2><d7d7a>: Abbrev Number: 2 (DW_TAG_member)
    <d7d7b>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <d7d7f>   DW_AT_decl_file   : 7
    <d7d80>   DW_AT_decl_line   : 106
    <d7d81>   DW_AT_decl_column : 21
    <d7d82>   DW_AT_type        : <0xd7b8f>
    <d7d86>   DW_AT_data_member_location: 40
 <2><d7d87>: Abbrev Number: 2 (DW_TAG_member)
    <d7d88>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <d7d8c>   DW_AT_decl_file   : 7
    <d7d8d>   DW_AT_decl_line   : 109
    <d7d8e>   DW_AT_decl_column : 21
    <d7d8f>   DW_AT_type        : <0xd7c23>
    <d7d93>   DW_AT_data_member_location: 44
 <2><d7d94>: Abbrev Number: 2 (DW_TAG_member)
    <d7d95>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <d7d99>   DW_AT_decl_file   : 7
    <d7d9a>   DW_AT_decl_line   : 110
    <d7d9b>   DW_AT_decl_column : 21
    <d7d9c>   DW_AT_type        : <0xd7bdf>
    <d7da0>   DW_AT_data_member_location: 48
 <2><d7da1>: Abbrev Number: 2 (DW_TAG_member)
    <d7da2>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <d7da6>   DW_AT_decl_file   : 7
    <d7da7>   DW_AT_decl_line   : 112
    <d7da8>   DW_AT_decl_column : 22
    <d7da9>   DW_AT_type        : <0xd8061>
    <d7dad>   DW_AT_data_member_location: 56
 <2><d7dae>: Abbrev Number: 2 (DW_TAG_member)
    <d7daf>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <d7db3>   DW_AT_decl_file   : 7
    <d7db4>   DW_AT_decl_line   : 114
    <d7db5>   DW_AT_decl_column : 14
    <d7db6>   DW_AT_type        : <0xd7bc5>
    <d7dba>   DW_AT_data_member_location: 64
 <2><d7dbb>: Abbrev Number: 2 (DW_TAG_member)
    <d7dbc>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <d7dc0>   DW_AT_decl_file   : 7
    <d7dc1>   DW_AT_decl_line   : 116
    <d7dc2>   DW_AT_decl_column : 22
    <d7dc3>   DW_AT_type        : <0xd7d00>
    <d7dc7>   DW_AT_data_member_location: 72
 <2><d7dc8>: Abbrev Number: 0
 <1><d7dc9>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7dca>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <d7dce>   DW_AT_decl_file   : 7
    <d7dcf>   DW_AT_decl_line   : 59
    <d7dd0>   DW_AT_decl_column : 15
    <d7dd1>   DW_AT_type        : <0xd7dd5>
 <1><d7dd5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7dd6>   DW_AT_byte_size   : 8
    <d7dd6>   DW_AT_type        : <0xd7dda>
 <1><d7dda>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7ddb>   DW_AT_prototyped  : 1
    <d7ddb>   DW_AT_type        : <0xd7bab>
    <d7ddf>   DW_AT_sibling     : <0xd7de9>
 <2><d7de3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7de4>   DW_AT_type        : <0xd7d00>
 <2><d7de8>: Abbrev Number: 0
 <1><d7de9>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7dea>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <d7dee>   DW_AT_decl_file   : 7
    <d7def>   DW_AT_decl_line   : 60
    <d7df0>   DW_AT_decl_column : 15
    <d7df1>   DW_AT_type        : <0xd7dd5>
 <1><d7df5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7df6>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <d7dfa>   DW_AT_decl_file   : 7
    <d7dfb>   DW_AT_decl_line   : 61
    <d7dfc>   DW_AT_decl_column : 15
    <d7dfd>   DW_AT_type        : <0xd7e01>
 <1><d7e01>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e02>   DW_AT_byte_size   : 8
    <d7e02>   DW_AT_type        : <0xd7e06>
 <1><d7e06>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7e07>   DW_AT_prototyped  : 1
    <d7e07>   DW_AT_type        : <0xd7bab>
    <d7e0b>   DW_AT_sibling     : <0xd7e1f>
 <2><d7e0f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e10>   DW_AT_type        : <0xd7d00>
 <2><d7e14>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e15>   DW_AT_type        : <0xd7c3e>
 <2><d7e19>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e1a>   DW_AT_type        : <0xd7bab>
 <2><d7e1e>: Abbrev Number: 0
 <1><d7e1f>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7e20>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <d7e24>   DW_AT_decl_file   : 7
    <d7e25>   DW_AT_decl_line   : 62
    <d7e26>   DW_AT_decl_column : 15
    <d7e27>   DW_AT_type        : <0xd7e2b>
 <1><d7e2b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e2c>   DW_AT_byte_size   : 8
    <d7e2c>   DW_AT_type        : <0xd7e30>
 <1><d7e30>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7e31>   DW_AT_prototyped  : 1
    <d7e31>   DW_AT_type        : <0xd7bab>
    <d7e35>   DW_AT_sibling     : <0xd7e44>
 <2><d7e39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e3a>   DW_AT_type        : <0xd7d00>
 <2><d7e3e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e3f>   DW_AT_type        : <0xd7e44>
 <2><d7e43>: Abbrev Number: 0
 <1><d7e44>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e45>   DW_AT_byte_size   : 8
    <d7e45>   DW_AT_type        : <0xd7c3e>
 <1><d7e49>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7e4a>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <d7e4e>   DW_AT_decl_file   : 7
    <d7e4f>   DW_AT_decl_line   : 63
    <d7e50>   DW_AT_decl_column : 15
    <d7e51>   DW_AT_type        : <0xd7e55>
 <1><d7e55>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e56>   DW_AT_byte_size   : 8
    <d7e56>   DW_AT_type        : <0xd7e5a>
 <1><d7e5a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7e5b>   DW_AT_prototyped  : 1
    <d7e5b>   DW_AT_type        : <0xd7bab>
    <d7e5f>   DW_AT_sibling     : <0xd7e73>
 <2><d7e63>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e64>   DW_AT_type        : <0xd7d00>
 <2><d7e68>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e69>   DW_AT_type        : <0xd7bc5>
 <2><d7e6d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e6e>   DW_AT_type        : <0xd7e73>
 <2><d7e72>: Abbrev Number: 0
 <1><d7e73>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e74>   DW_AT_byte_size   : 8
    <d7e74>   DW_AT_type        : <0xd7bdf>
 <1><d7e78>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7e79>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <d7e7d>   DW_AT_decl_file   : 7
    <d7e7e>   DW_AT_decl_line   : 65
    <d7e7f>   DW_AT_decl_column : 15
    <d7e80>   DW_AT_type        : <0xd7e84>
 <1><d7e84>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7e85>   DW_AT_byte_size   : 8
    <d7e85>   DW_AT_type        : <0xd7e89>
 <1><d7e89>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7e8a>   DW_AT_prototyped  : 1
    <d7e8a>   DW_AT_type        : <0xd7bab>
    <d7e8e>   DW_AT_sibling     : <0xd7ea2>
 <2><d7e92>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e93>   DW_AT_type        : <0xd7d00>
 <2><d7e97>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e98>   DW_AT_type        : <0xd7c9f>
 <2><d7e9c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7e9d>   DW_AT_type        : <0xd7e73>
 <2><d7ea1>: Abbrev Number: 0
 <1><d7ea2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7ea3>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <d7ea7>   DW_AT_decl_file   : 7
    <d7ea8>   DW_AT_decl_line   : 67
    <d7ea9>   DW_AT_decl_column : 15
    <d7eaa>   DW_AT_type        : <0xd7eae>
 <1><d7eae>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7eaf>   DW_AT_byte_size   : 8
    <d7eaf>   DW_AT_type        : <0xd7eb3>
 <1><d7eb3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7eb4>   DW_AT_prototyped  : 1
    <d7eb4>   DW_AT_type        : <0xd7bab>
    <d7eb8>   DW_AT_sibling     : <0xd7ecc>
 <2><d7ebc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7ebd>   DW_AT_type        : <0xd7d00>
 <2><d7ec1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7ec2>   DW_AT_type        : <0xd7c33>
 <2><d7ec6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7ec7>   DW_AT_type        : <0xd7bdf>
 <2><d7ecb>: Abbrev Number: 0
 <1><d7ecc>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7ecd>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <d7ed1>   DW_AT_decl_file   : 7
    <d7ed2>   DW_AT_decl_line   : 69
    <d7ed3>   DW_AT_decl_column : 15
    <d7ed4>   DW_AT_type        : <0xd7ed8>
 <1><d7ed8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7ed9>   DW_AT_byte_size   : 8
    <d7ed9>   DW_AT_type        : <0xd7edd>
 <1><d7edd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7ede>   DW_AT_prototyped  : 1
    <d7ede>   DW_AT_type        : <0xd7bab>
    <d7ee2>   DW_AT_sibling     : <0xd7ef6>
 <2><d7ee6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7ee7>   DW_AT_type        : <0xd7d00>
 <2><d7eeb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7eec>   DW_AT_type        : <0xd7ef6>
 <2><d7ef0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7ef1>   DW_AT_type        : <0xd7bdf>
 <2><d7ef5>: Abbrev Number: 0
 <1><d7ef6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7ef7>   DW_AT_byte_size   : 8
    <d7ef7>   DW_AT_type        : <0xd7bf8>
 <1><d7efb>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7efc>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <d7f00>   DW_AT_decl_file   : 7
    <d7f01>   DW_AT_decl_line   : 71
    <d7f02>   DW_AT_decl_column : 15
    <d7f03>   DW_AT_type        : <0xd7f07>
 <1><d7f07>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7f08>   DW_AT_byte_size   : 8
    <d7f08>   DW_AT_type        : <0xd7f0c>
 <1><d7f0c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7f0d>   DW_AT_prototyped  : 1
    <d7f0d>   DW_AT_type        : <0xd7bab>
    <d7f11>   DW_AT_sibling     : <0xd7f25>
 <2><d7f15>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f16>   DW_AT_type        : <0xd7d00>
 <2><d7f1a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f1b>   DW_AT_type        : <0xd7c3e>
 <2><d7f1f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f20>   DW_AT_type        : <0xd7c3e>
 <2><d7f24>: Abbrev Number: 0
 <1><d7f25>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7f26>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <d7f2a>   DW_AT_decl_file   : 7
    <d7f2b>   DW_AT_decl_line   : 73
    <d7f2c>   DW_AT_decl_column : 15
    <d7f2d>   DW_AT_type        : <0xd7f07>
 <1><d7f31>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7f32>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <d7f36>   DW_AT_decl_file   : 7
    <d7f37>   DW_AT_decl_line   : 75
    <d7f38>   DW_AT_decl_column : 15
    <d7f39>   DW_AT_type        : <0xd7f3d>
 <1><d7f3d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7f3e>   DW_AT_byte_size   : 8
    <d7f3e>   DW_AT_type        : <0xd7f42>
 <1><d7f42>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7f43>   DW_AT_prototyped  : 1
    <d7f43>   DW_AT_type        : <0xd7bab>
    <d7f47>   DW_AT_sibling     : <0xd7f56>
 <2><d7f4b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f4c>   DW_AT_type        : <0xd7d00>
 <2><d7f50>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f51>   DW_AT_type        : <0xd7f56>
 <2><d7f55>: Abbrev Number: 0
 <1><d7f56>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7f57>   DW_AT_byte_size   : 8
    <d7f57>   DW_AT_type        : <0xd7c85>
 <1><d7f5b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7f5c>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <d7f60>   DW_AT_decl_file   : 7
    <d7f61>   DW_AT_decl_line   : 76
    <d7f62>   DW_AT_decl_column : 15
    <d7f63>   DW_AT_type        : <0xd7f67>
 <1><d7f67>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d7f68>   DW_AT_byte_size   : 8
    <d7f68>   DW_AT_type        : <0xd7f6c>
 <1><d7f6c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d7f6d>   DW_AT_prototyped  : 1
    <d7f6d>   DW_AT_type        : <0xd7bab>
    <d7f71>   DW_AT_sibling     : <0xd7f85>
 <2><d7f75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f76>   DW_AT_type        : <0xd7d00>
 <2><d7f7a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f7b>   DW_AT_type        : <0xd7c9f>
 <2><d7f7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d7f80>   DW_AT_type        : <0xd7c10>
 <2><d7f84>: Abbrev Number: 0
 <1><d7f85>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7f86>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <d7f8a>   DW_AT_decl_file   : 7
    <d7f8b>   DW_AT_decl_line   : 77
    <d7f8c>   DW_AT_decl_column : 15
    <d7f8d>   DW_AT_type        : <0xd7dd5>
 <1><d7f91>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d7f92>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <d7f96>   DW_AT_byte_size   : 112
    <d7f97>   DW_AT_decl_file   : 7
    <d7f98>   DW_AT_decl_line   : 80
    <d7f99>   DW_AT_decl_column : 16
    <d7f9a>   DW_AT_sibling     : <0xd8055>
 <2><d7f9e>: Abbrev Number: 2 (DW_TAG_member)
    <d7f9f>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <d7fa3>   DW_AT_decl_file   : 7
    <d7fa4>   DW_AT_decl_line   : 81
    <d7fa5>   DW_AT_decl_column : 25
    <d7fa6>   DW_AT_type        : <0xd7dc9>
    <d7faa>   DW_AT_data_member_location: 0
 <2><d7fab>: Abbrev Number: 2 (DW_TAG_member)
    <d7fac>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <d7fb0>   DW_AT_decl_file   : 7
    <d7fb1>   DW_AT_decl_line   : 82
    <d7fb2>   DW_AT_decl_column : 25
    <d7fb3>   DW_AT_type        : <0xd7de9>
    <d7fb7>   DW_AT_data_member_location: 8
 <2><d7fb8>: Abbrev Number: 2 (DW_TAG_member)
    <d7fb9>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <d7fbd>   DW_AT_decl_file   : 7
    <d7fbe>   DW_AT_decl_line   : 83
    <d7fbf>   DW_AT_decl_column : 25
    <d7fc0>   DW_AT_type        : <0xd7df5>
    <d7fc4>   DW_AT_data_member_location: 16
 <2><d7fc5>: Abbrev Number: 2 (DW_TAG_member)
    <d7fc6>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <d7fca>   DW_AT_decl_file   : 7
    <d7fcb>   DW_AT_decl_line   : 84
    <d7fcc>   DW_AT_decl_column : 25
    <d7fcd>   DW_AT_type        : <0xd7e1f>
    <d7fd1>   DW_AT_data_member_location: 24
 <2><d7fd2>: Abbrev Number: 2 (DW_TAG_member)
    <d7fd3>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <d7fd7>   DW_AT_decl_file   : 7
    <d7fd8>   DW_AT_decl_line   : 85
    <d7fd9>   DW_AT_decl_column : 25
    <d7fda>   DW_AT_type        : <0xd7e49>
    <d7fde>   DW_AT_data_member_location: 32
 <2><d7fdf>: Abbrev Number: 2 (DW_TAG_member)
    <d7fe0>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <d7fe4>   DW_AT_decl_file   : 7
    <d7fe5>   DW_AT_decl_line   : 86
    <d7fe6>   DW_AT_decl_column : 25
    <d7fe7>   DW_AT_type        : <0xd7e78>
    <d7feb>   DW_AT_data_member_location: 40
 <2><d7fec>: Abbrev Number: 2 (DW_TAG_member)
    <d7fed>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <d7ff1>   DW_AT_decl_file   : 7
    <d7ff2>   DW_AT_decl_line   : 87
    <d7ff3>   DW_AT_decl_column : 25
    <d7ff4>   DW_AT_type        : <0xd7ea2>
    <d7ff8>   DW_AT_data_member_location: 48
 <2><d7ff9>: Abbrev Number: 2 (DW_TAG_member)
    <d7ffa>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <d7ffe>   DW_AT_decl_file   : 7
    <d7fff>   DW_AT_decl_line   : 88
    <d8000>   DW_AT_decl_column : 25
    <d8001>   DW_AT_type        : <0xd7ecc>
    <d8005>   DW_AT_data_member_location: 56
 <2><d8006>: Abbrev Number: 2 (DW_TAG_member)
    <d8007>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <d800b>   DW_AT_decl_file   : 7
    <d800c>   DW_AT_decl_line   : 89
    <d800d>   DW_AT_decl_column : 25
    <d800e>   DW_AT_type        : <0xd7efb>
    <d8012>   DW_AT_data_member_location: 64
 <2><d8013>: Abbrev Number: 2 (DW_TAG_member)
    <d8014>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <d8018>   DW_AT_decl_file   : 7
    <d8019>   DW_AT_decl_line   : 90
    <d801a>   DW_AT_decl_column : 25
    <d801b>   DW_AT_type        : <0xd7f25>
    <d801f>   DW_AT_data_member_location: 72
 <2><d8020>: Abbrev Number: 2 (DW_TAG_member)
    <d8021>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <d8025>   DW_AT_decl_file   : 7
    <d8026>   DW_AT_decl_line   : 91
    <d8027>   DW_AT_decl_column : 25
    <d8028>   DW_AT_type        : <0xd7f31>
    <d802c>   DW_AT_data_member_location: 80
 <2><d802d>: Abbrev Number: 2 (DW_TAG_member)
    <d802e>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <d8032>   DW_AT_decl_file   : 7
    <d8033>   DW_AT_decl_line   : 92
    <d8034>   DW_AT_decl_column : 25
    <d8035>   DW_AT_type        : <0xd7f5b>
    <d8039>   DW_AT_data_member_location: 88
 <2><d803a>: Abbrev Number: 2 (DW_TAG_member)
    <d803b>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <d803f>   DW_AT_decl_file   : 7
    <d8040>   DW_AT_decl_line   : 93
    <d8041>   DW_AT_decl_column : 25
    <d8042>   DW_AT_type        : <0xd7cdb>
    <d8046>   DW_AT_data_member_location: 96
 <2><d8047>: Abbrev Number: 2 (DW_TAG_member)
    <d8048>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <d804c>   DW_AT_decl_file   : 7
    <d804d>   DW_AT_decl_line   : 94
    <d804e>   DW_AT_decl_column : 25
    <d804f>   DW_AT_type        : <0xd7f85>
    <d8053>   DW_AT_data_member_location: 104
 <2><d8054>: Abbrev Number: 0
 <1><d8055>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8056>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <d805a>   DW_AT_decl_file   : 7
    <d805b>   DW_AT_decl_line   : 95
    <d805c>   DW_AT_decl_column : 3
    <d805d>   DW_AT_type        : <0xd7f91>
 <1><d8061>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8062>   DW_AT_byte_size   : 8
    <d8062>   DW_AT_type        : <0xd8055>
 <1><d8066>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8067>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <d806b>   DW_AT_decl_file   : 7
    <d806c>   DW_AT_decl_line   : 117
    <d806d>   DW_AT_decl_column : 3
    <d806e>   DW_AT_type        : <0xd7d05>
 <1><d8072>: Abbrev Number: 16 (DW_TAG_array_type)
    <d8073>   DW_AT_type        : <0xd7bd8>
    <d8077>   DW_AT_sibling     : <0xd8082>
 <2><d807b>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d807c>   DW_AT_type        : <0xd7b96>
    <d8080>   DW_AT_upper_bound : 15
 <2><d8081>: Abbrev Number: 0
 <1><d8082>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d8083>   DW_AT_byte_size   : 8
    <d8084>   DW_AT_decl_file   : 8
    <d8084>   DW_AT_decl_line   : 4
    <d8085>   DW_AT_decl_column : 3
    <d8085>   DW_AT_sibling     : <0xd80a4>
 <2><d8089>: Abbrev Number: 2 (DW_TAG_member)
    <d808a>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <d808e>   DW_AT_decl_file   : 8
    <d808f>   DW_AT_decl_line   : 5
    <d8090>   DW_AT_decl_column : 8
    <d8091>   DW_AT_type        : <0xd7bab>
    <d8095>   DW_AT_data_member_location: 0
 <2><d8096>: Abbrev Number: 2 (DW_TAG_member)
    <d8097>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <d809b>   DW_AT_decl_file   : 8
    <d809c>   DW_AT_decl_line   : 6
    <d809d>   DW_AT_decl_column : 8
    <d809e>   DW_AT_type        : <0xd7bab>
    <d80a2>   DW_AT_data_member_location: 4
 <2><d80a3>: Abbrev Number: 0
 <1><d80a4>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d80a5>   DW_AT_byte_size   : 16
    <d80a6>   DW_AT_decl_file   : 8
    <d80a6>   DW_AT_decl_line   : 8
    <d80a7>   DW_AT_decl_column : 3
    <d80a7>   DW_AT_sibling     : <0xd80da>
 <2><d80ab>: Abbrev Number: 7 (DW_TAG_member)
    <d80ac>   DW_AT_name        : x
    <d80ae>   DW_AT_decl_file   : 8
    <d80af>   DW_AT_decl_line   : 9
    <d80b0>   DW_AT_decl_column : 8
    <d80b1>   DW_AT_type        : <0xd7bab>
    <d80b5>   DW_AT_data_member_location: 0
 <2><d80b6>: Abbrev Number: 7 (DW_TAG_member)
    <d80b7>   DW_AT_name        : y
    <d80b9>   DW_AT_decl_file   : 8
    <d80ba>   DW_AT_decl_line   : 9
    <d80bb>   DW_AT_decl_column : 11
    <d80bc>   DW_AT_type        : <0xd7bab>
    <d80c0>   DW_AT_data_member_location: 4
 <2><d80c1>: Abbrev Number: 7 (DW_TAG_member)
    <d80c2>   DW_AT_name        : dx
    <d80c5>   DW_AT_decl_file   : 8
    <d80c6>   DW_AT_decl_line   : 10
    <d80c7>   DW_AT_decl_column : 8
    <d80c8>   DW_AT_type        : <0xd7bab>
    <d80cc>   DW_AT_data_member_location: 8
 <2><d80cd>: Abbrev Number: 7 (DW_TAG_member)
    <d80ce>   DW_AT_name        : dy
    <d80d1>   DW_AT_decl_file   : 8
    <d80d2>   DW_AT_decl_line   : 10
    <d80d3>   DW_AT_decl_column : 12
    <d80d4>   DW_AT_type        : <0xd7bab>
    <d80d8>   DW_AT_data_member_location: 12
 <2><d80d9>: Abbrev Number: 0
 <1><d80da>: Abbrev Number: 32 (DW_TAG_union_type)
    <d80db>   DW_AT_byte_size   : 16
    <d80dc>   DW_AT_decl_file   : 8
    <d80dd>   DW_AT_decl_line   : 3
    <d80de>   DW_AT_decl_column : 2
    <d80df>   DW_AT_sibling     : <0xd810a>
 <2><d80e3>: Abbrev Number: 20 (DW_TAG_member)
    <d80e4>   DW_AT_type        : <0xd8082>
 <2><d80e8>: Abbrev Number: 20 (DW_TAG_member)
    <d80e9>   DW_AT_type        : <0xd80a4>
 <2><d80ed>: Abbrev Number: 33 (DW_TAG_member)
    <d80ee>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <d80f2>   DW_AT_decl_file   : 8
    <d80f3>   DW_AT_decl_line   : 12
    <d80f4>   DW_AT_decl_column : 7
    <d80f5>   DW_AT_type        : <0xd7bab>
 <2><d80f9>: Abbrev Number: 21 (DW_TAG_member)
    <d80fa>   DW_AT_name        : z
    <d80fc>   DW_AT_decl_file   : 8
    <d80fc>   DW_AT_decl_line   : 13
    <d80fd>   DW_AT_decl_column : 7
    <d80fd>   DW_AT_type        : <0xd7bab>
 <2><d8101>: Abbrev Number: 21 (DW_TAG_member)
    <d8102>   DW_AT_name        : w
    <d8104>   DW_AT_decl_file   : 8
    <d8104>   DW_AT_decl_line   : 14
    <d8105>   DW_AT_decl_column : 7
    <d8105>   DW_AT_type        : <0xd7bab>
 <2><d8109>: Abbrev Number: 0
 <1><d810a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d810b>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <d810f>   DW_AT_byte_size   : 20
    <d8110>   DW_AT_decl_file   : 8
    <d8111>   DW_AT_decl_line   : 1
    <d8112>   DW_AT_decl_column : 8
    <d8113>   DW_AT_sibling     : <0xd812b>
 <2><d8117>: Abbrev Number: 2 (DW_TAG_member)
    <d8118>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <d811c>   DW_AT_decl_file   : 8
    <d811d>   DW_AT_decl_line   : 2
    <d811e>   DW_AT_decl_column : 6
    <d811f>   DW_AT_type        : <0xd7bab>
    <d8123>   DW_AT_data_member_location: 0
 <2><d8124>: Abbrev Number: 34 (DW_TAG_member)
    <d8125>   DW_AT_type        : <0xd80da>
    <d8129>   DW_AT_data_member_location: 4
 <2><d812a>: Abbrev Number: 0
 <1><d812b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d812c>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <d8130>   DW_AT_decl_file   : 8
    <d8131>   DW_AT_decl_line   : 18
    <d8132>   DW_AT_decl_column : 23
    <d8133>   DW_AT_type        : <0xd810a>
 <1><d8137>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8138>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <d813c>   DW_AT_decl_file   : 9
    <d813d>   DW_AT_decl_line   : 1
    <d813e>   DW_AT_decl_column : 23
    <d813f>   DW_AT_type        : <0xd8143>
 <1><d8143>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8144>   DW_AT_byte_size   : 8
    <d8144>   DW_AT_type        : <0xd8148>
 <1><d8148>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <d8149>   DW_AT_prototyped  : 1
    <d8149>   DW_AT_type        : <0xd7f56>
 <1><d814d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d814e>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <d8152>   DW_AT_decl_file   : 9
    <d8153>   DW_AT_decl_line   : 2
    <d8154>   DW_AT_decl_column : 23
    <d8155>   DW_AT_type        : <0xd8159>
 <1><d8159>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d815a>   DW_AT_byte_size   : 8
    <d815a>   DW_AT_type        : <0xd815e>
 <1><d815e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <d815f>   DW_AT_prototyped  : 1
    <d815f>   DW_AT_type        : <0xd7bab>
 <1><d8163>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8164>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <d8168>   DW_AT_decl_file   : 9
    <d8169>   DW_AT_decl_line   : 3
    <d816a>   DW_AT_decl_column : 23
    <d816b>   DW_AT_type        : <0xd8159>
 <1><d816f>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8170>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <d8174>   DW_AT_decl_file   : 9
    <d8175>   DW_AT_decl_line   : 10
    <d8176>   DW_AT_decl_column : 23
    <d8177>   DW_AT_type        : <0xd817b>
 <1><d817b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d817c>   DW_AT_byte_size   : 8
    <d817c>   DW_AT_type        : <0xd8180>
 <1><d8180>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d8181>   DW_AT_prototyped  : 1
    <d8181>   DW_AT_sibling     : <0xd818b>
 <2><d8185>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8186>   DW_AT_type        : <0xd7bab>
 <2><d818a>: Abbrev Number: 0
 <1><d818b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d818c>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <d8190>   DW_AT_decl_file   : 9
    <d8191>   DW_AT_decl_line   : 14
    <d8192>   DW_AT_decl_column : 23
    <d8193>   DW_AT_type        : <0xd8197>
 <1><d8197>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8198>   DW_AT_byte_size   : 8
    <d8198>   DW_AT_type        : <0xd819c>
 <1><d819c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d819d>   DW_AT_prototyped  : 1
    <d819d>   DW_AT_type        : <0xd7bab>
    <d81a1>   DW_AT_sibling     : <0xd81b5>
 <2><d81a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d81a6>   DW_AT_type        : <0xd7bab>
 <2><d81aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d81ab>   DW_AT_type        : <0xd7bab>
 <2><d81af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d81b0>   DW_AT_type        : <0xd7bab>
 <2><d81b4>: Abbrev Number: 0
 <1><d81b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d81b6>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <d81ba>   DW_AT_decl_file   : 9
    <d81bb>   DW_AT_decl_line   : 18
    <d81bc>   DW_AT_decl_column : 23
    <d81bd>   DW_AT_type        : <0xd8197>
 <1><d81c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <d81c2>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <d81c6>   DW_AT_decl_file   : 9
    <d81c7>   DW_AT_decl_line   : 24
    <d81c8>   DW_AT_decl_column : 23
    <d81c9>   DW_AT_type        : <0xd7c4a>
 <1><d81cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <d81ce>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <d81d2>   DW_AT_decl_file   : 9
    <d81d3>   DW_AT_decl_line   : 28
    <d81d4>   DW_AT_decl_column : 23
    <d81d5>   DW_AT_type        : <0xd81d9>
 <1><d81d9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d81da>   DW_AT_byte_size   : 8
    <d81da>   DW_AT_type        : <0xd81de>
 <1><d81de>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d81df>   DW_AT_prototyped  : 1
    <d81df>   DW_AT_type        : <0xd7bab>
    <d81e3>   DW_AT_sibling     : <0xd81f2>
 <2><d81e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d81e8>   DW_AT_type        : <0xd7bab>
 <2><d81ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d81ed>   DW_AT_type        : <0xd7bab>
 <2><d81f1>: Abbrev Number: 0
 <1><d81f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d81f3>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <d81f7>   DW_AT_decl_file   : 9
    <d81f8>   DW_AT_decl_line   : 34
    <d81f9>   DW_AT_decl_column : 23
    <d81fa>   DW_AT_type        : <0xd8159>
 <1><d81fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <d81ff>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <d8203>   DW_AT_decl_file   : 9
    <d8204>   DW_AT_decl_line   : 35
    <d8205>   DW_AT_decl_column : 23
    <d8206>   DW_AT_type        : <0xd8159>
 <1><d820a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d820b>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <d820f>   DW_AT_decl_file   : 9
    <d8210>   DW_AT_decl_line   : 36
    <d8211>   DW_AT_decl_column : 23
    <d8212>   DW_AT_type        : <0xd8216>
 <1><d8216>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8217>   DW_AT_byte_size   : 8
    <d8217>   DW_AT_type        : <0xd821b>
 <1><d821b>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d821c>   DW_AT_prototyped  : 1
    <d821c>   DW_AT_sibling     : <0xd822b>
 <2><d8220>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8221>   DW_AT_type        : <0xd822b>
 <2><d8225>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8226>   DW_AT_type        : <0xd822b>
 <2><d822a>: Abbrev Number: 0
 <1><d822b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d822c>   DW_AT_byte_size   : 8
    <d822c>   DW_AT_type        : <0xd7bab>
 <1><d8230>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8231>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <d8235>   DW_AT_decl_file   : 9
    <d8236>   DW_AT_decl_line   : 37
    <d8237>   DW_AT_decl_column : 23
    <d8238>   DW_AT_type        : <0xd8216>
 <1><d823c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d823d>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <d8241>   DW_AT_decl_file   : 9
    <d8242>   DW_AT_decl_line   : 45
    <d8243>   DW_AT_decl_column : 24
    <d8244>   DW_AT_type        : <0xd8248>
 <1><d8248>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8249>   DW_AT_byte_size   : 8
    <d8249>   DW_AT_type        : <0xd824d>
 <1><d824d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d824e>   DW_AT_prototyped  : 1
    <d824e>   DW_AT_type        : <0xd7b8f>
    <d8252>   DW_AT_sibling     : <0xd8266>
 <2><d8256>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8257>   DW_AT_type        : <0xd7bab>
 <2><d825b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d825c>   DW_AT_type        : <0xd7bab>
 <2><d8260>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8261>   DW_AT_type        : <0xd7bab>
 <2><d8265>: Abbrev Number: 0
 <1><d8266>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8267>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <d826b>   DW_AT_decl_file   : 9
    <d826c>   DW_AT_decl_line   : 48
    <d826d>   DW_AT_decl_column : 23
    <d826e>   DW_AT_type        : <0xd8272>
 <1><d8272>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8273>   DW_AT_byte_size   : 8
    <d8273>   DW_AT_type        : <0xd8277>
 <1><d8277>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d8278>   DW_AT_prototyped  : 1
    <d8278>   DW_AT_sibling     : <0xd828c>
 <2><d827c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d827d>   DW_AT_type        : <0xd7c33>
 <2><d8281>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8282>   DW_AT_type        : <0xd7bdf>
 <2><d8286>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8287>   DW_AT_type        : <0xd7bab>
 <2><d828b>: Abbrev Number: 0
 <1><d828c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d828d>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <d8291>   DW_AT_decl_file   : 9
    <d8292>   DW_AT_decl_line   : 49
    <d8293>   DW_AT_decl_column : 23
    <d8294>   DW_AT_type        : <0xd8298>
 <1><d8298>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8299>   DW_AT_byte_size   : 8
    <d8299>   DW_AT_type        : <0xd829d>
 <1><d829d>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d829e>   DW_AT_prototyped  : 1
    <d829e>   DW_AT_sibling     : <0xd82b2>
 <2><d82a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82a3>   DW_AT_type        : <0xd7ef6>
 <2><d82a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82a8>   DW_AT_type        : <0xd7bdf>
 <2><d82ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82ad>   DW_AT_type        : <0xd7bab>
 <2><d82b1>: Abbrev Number: 0
 <1><d82b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d82b3>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <d82b7>   DW_AT_decl_file   : 9
    <d82b8>   DW_AT_decl_line   : 51
    <d82b9>   DW_AT_decl_column : 24
    <d82ba>   DW_AT_type        : <0xd82be>
 <1><d82be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d82bf>   DW_AT_byte_size   : 8
    <d82bf>   DW_AT_type        : <0xd82c3>
 <1><d82c3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d82c4>   DW_AT_prototyped  : 1
    <d82c4>   DW_AT_type        : <0xd7bd3>
    <d82c8>   DW_AT_sibling     : <0xd82d7>
 <2><d82cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82cd>   DW_AT_type        : <0xd7bd3>
 <2><d82d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82d2>   DW_AT_type        : <0xd7c10>
 <2><d82d6>: Abbrev Number: 0
 <1><d82d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <d82d8>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <d82dc>   DW_AT_decl_file   : 9
    <d82dd>   DW_AT_decl_line   : 54
    <d82de>   DW_AT_decl_column : 23
    <d82df>   DW_AT_type        : <0xd82e3>
 <1><d82e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d82e4>   DW_AT_byte_size   : 8
    <d82e4>   DW_AT_type        : <0xd82e8>
 <1><d82e8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d82e9>   DW_AT_prototyped  : 1
    <d82e9>   DW_AT_type        : <0xd7bab>
    <d82ed>   DW_AT_sibling     : <0xd8310>
 <2><d82f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82f2>   DW_AT_type        : <0xd7f56>
 <2><d82f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82f7>   DW_AT_type        : <0xd7bc5>
 <2><d82fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d82fc>   DW_AT_type        : <0xd7c10>
 <2><d8300>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8301>   DW_AT_type        : <0xd7bab>
 <2><d8305>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8306>   DW_AT_type        : <0xd7bab>
 <2><d830a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d830b>   DW_AT_type        : <0xd7bab>
 <2><d830f>: Abbrev Number: 0
 <1><d8310>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8311>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <d8315>   DW_AT_decl_file   : 9
    <d8316>   DW_AT_decl_line   : 56
    <d8317>   DW_AT_decl_column : 23
    <d8318>   DW_AT_type        : <0xd831c>
 <1><d831c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d831d>   DW_AT_byte_size   : 8
    <d831d>   DW_AT_type        : <0xd8321>
 <1><d8321>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8322>   DW_AT_prototyped  : 1
    <d8322>   DW_AT_type        : <0xd7bab>
    <d8326>   DW_AT_sibling     : <0xd8344>
 <2><d832a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d832b>   DW_AT_type        : <0xd7ef6>
 <2><d832f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8330>   DW_AT_type        : <0xd7c9f>
 <2><d8334>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8335>   DW_AT_type        : <0xd7c10>
 <2><d8339>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d833a>   DW_AT_type        : <0xd7bab>
 <2><d833e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d833f>   DW_AT_type        : <0xd7bab>
 <2><d8343>: Abbrev Number: 0
 <1><d8344>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8345>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <d8349>   DW_AT_decl_file   : 9
    <d834a>   DW_AT_decl_line   : 67
    <d834b>   DW_AT_decl_column : 23
    <d834c>   DW_AT_type        : <0xd8350>
 <1><d8350>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8351>   DW_AT_byte_size   : 8
    <d8351>   DW_AT_type        : <0xd8355>
 <1><d8355>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8356>   DW_AT_prototyped  : 1
    <d8356>   DW_AT_type        : <0xd7bab>
    <d835a>   DW_AT_sibling     : <0xd8364>
 <2><d835e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d835f>   DW_AT_type        : <0xd7bab>
 <2><d8363>: Abbrev Number: 0
 <1><d8364>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8365>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <d8369>   DW_AT_decl_file   : 9
    <d836a>   DW_AT_decl_line   : 68
    <d836b>   DW_AT_decl_column : 23
    <d836c>   DW_AT_type        : <0xd8370>
 <1><d8370>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8371>   DW_AT_byte_size   : 8
    <d8371>   DW_AT_type        : <0xd8375>
 <1><d8375>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8376>   DW_AT_prototyped  : 1
    <d8376>   DW_AT_type        : <0xd7bab>
    <d837a>   DW_AT_sibling     : <0xd8398>
 <2><d837e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d837f>   DW_AT_type        : <0xd822b>
 <2><d8383>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8384>   DW_AT_type        : <0xd822b>
 <2><d8388>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8389>   DW_AT_type        : <0xd822b>
 <2><d838d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d838e>   DW_AT_type        : <0xd822b>
 <2><d8392>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8393>   DW_AT_type        : <0xd822b>
 <2><d8397>: Abbrev Number: 0
 <1><d8398>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8399>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <d839d>   DW_AT_decl_file   : 9
    <d839e>   DW_AT_decl_line   : 69
    <d839f>   DW_AT_decl_column : 23
    <d83a0>   DW_AT_type        : <0xd83a4>
 <1><d83a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d83a5>   DW_AT_byte_size   : 8
    <d83a5>   DW_AT_type        : <0xd83a9>
 <1><d83a9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d83aa>   DW_AT_prototyped  : 1
    <d83aa>   DW_AT_type        : <0xd7bab>
    <d83ae>   DW_AT_sibling     : <0xd83c7>
 <2><d83b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d83b3>   DW_AT_type        : <0xd7bab>
 <2><d83b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d83b8>   DW_AT_type        : <0xd7bab>
 <2><d83bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d83bd>   DW_AT_type        : <0xd7bab>
 <2><d83c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d83c2>   DW_AT_type        : <0xd7bab>
 <2><d83c6>: Abbrev Number: 0
 <1><d83c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <d83c8>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <d83cc>   DW_AT_decl_file   : 9
    <d83cd>   DW_AT_decl_line   : 73
    <d83ce>   DW_AT_decl_column : 23
    <d83cf>   DW_AT_type        : <0xd83d3>
 <1><d83d3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d83d4>   DW_AT_byte_size   : 8
    <d83d4>   DW_AT_type        : <0xd83d8>
 <1><d83d8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d83d9>   DW_AT_prototyped  : 1
    <d83d9>   DW_AT_type        : <0xd7bab>
    <d83dd>   DW_AT_sibling     : <0xd83e7>
 <2><d83e1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d83e2>   DW_AT_type        : <0xd7b88>
 <2><d83e6>: Abbrev Number: 0
 <1><d83e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <d83e8>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <d83ec>   DW_AT_decl_file   : 9
    <d83ed>   DW_AT_decl_line   : 74
    <d83ee>   DW_AT_decl_column : 23
    <d83ef>   DW_AT_type        : <0xd83f3>
 <1><d83f3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d83f4>   DW_AT_byte_size   : 8
    <d83f4>   DW_AT_type        : <0xd83f8>
 <1><d83f8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d83f9>   DW_AT_prototyped  : 1
    <d83f9>   DW_AT_type        : <0xd7bab>
    <d83fd>   DW_AT_sibling     : <0xd840c>
 <2><d8401>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8402>   DW_AT_type        : <0xd7b88>
 <2><d8406>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8407>   DW_AT_type        : <0xd7b81>
 <2><d840b>: Abbrev Number: 0
 <1><d840c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d840d>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <d8411>   DW_AT_decl_file   : 9
    <d8412>   DW_AT_decl_line   : 80
    <d8413>   DW_AT_decl_column : 23
    <d8414>   DW_AT_type        : <0xd817b>
 <1><d8418>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8419>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <d841d>   DW_AT_decl_file   : 9
    <d841e>   DW_AT_decl_line   : 83
    <d841f>   DW_AT_decl_column : 23
    <d8420>   DW_AT_type        : <0xd8350>
 <1><d8424>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8425>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <d8429>   DW_AT_decl_file   : 9
    <d842a>   DW_AT_decl_line   : 86
    <d842b>   DW_AT_decl_column : 23
    <d842c>   DW_AT_type        : <0xd81d9>
 <1><d8430>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8431>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <d8435>   DW_AT_decl_file   : 9
    <d8436>   DW_AT_decl_line   : 89
    <d8437>   DW_AT_decl_column : 23
    <d8438>   DW_AT_type        : <0xd81d9>
 <1><d843c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d843d>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <d8441>   DW_AT_decl_file   : 9
    <d8442>   DW_AT_decl_line   : 91
    <d8443>   DW_AT_decl_column : 23
    <d8444>   DW_AT_type        : <0xd8448>
 <1><d8448>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8449>   DW_AT_byte_size   : 8
    <d8449>   DW_AT_type        : <0xd844d>
 <1><d844d>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d844e>   DW_AT_prototyped  : 1
    <d844e>   DW_AT_sibling     : <0xd8458>
 <2><d8452>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8453>   DW_AT_type        : <0xd8458>
 <2><d8457>: Abbrev Number: 0
 <1><d8458>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8459>   DW_AT_byte_size   : 8
    <d8459>   DW_AT_type        : <0xd812b>
 <1><d845d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d845e>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <d8462>   DW_AT_byte_size   : 224
    <d8463>   DW_AT_decl_file   : 9
    <d8464>   DW_AT_decl_line   : 93
    <d8465>   DW_AT_decl_column : 16
    <d8466>   DW_AT_sibling     : <0xd85d7>
 <2><d846a>: Abbrev Number: 2 (DW_TAG_member)
    <d846b>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <d846f>   DW_AT_decl_file   : 9
    <d8470>   DW_AT_decl_line   : 94
    <d8471>   DW_AT_decl_column : 23
    <d8472>   DW_AT_type        : <0xd8137>
    <d8476>   DW_AT_data_member_location: 0
 <2><d8477>: Abbrev Number: 2 (DW_TAG_member)
    <d8478>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <d847c>   DW_AT_decl_file   : 9
    <d847d>   DW_AT_decl_line   : 95
    <d847e>   DW_AT_decl_column : 23
    <d847f>   DW_AT_type        : <0xd814d>
    <d8483>   DW_AT_data_member_location: 8
 <2><d8484>: Abbrev Number: 2 (DW_TAG_member)
    <d8485>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <d8489>   DW_AT_decl_file   : 9
    <d848a>   DW_AT_decl_line   : 96
    <d848b>   DW_AT_decl_column : 23
    <d848c>   DW_AT_type        : <0xd8163>
    <d8490>   DW_AT_data_member_location: 16
 <2><d8491>: Abbrev Number: 2 (DW_TAG_member)
    <d8492>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <d8496>   DW_AT_decl_file   : 9
    <d8497>   DW_AT_decl_line   : 97
    <d8498>   DW_AT_decl_column : 23
    <d8499>   DW_AT_type        : <0xd816f>
    <d849d>   DW_AT_data_member_location: 24
 <2><d849e>: Abbrev Number: 2 (DW_TAG_member)
    <d849f>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <d84a3>   DW_AT_decl_file   : 9
    <d84a4>   DW_AT_decl_line   : 98
    <d84a5>   DW_AT_decl_column : 23
    <d84a6>   DW_AT_type        : <0xd818b>
    <d84aa>   DW_AT_data_member_location: 32
 <2><d84ab>: Abbrev Number: 2 (DW_TAG_member)
    <d84ac>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <d84b0>   DW_AT_decl_file   : 9
    <d84b1>   DW_AT_decl_line   : 99
    <d84b2>   DW_AT_decl_column : 23
    <d84b3>   DW_AT_type        : <0xd81b5>
    <d84b7>   DW_AT_data_member_location: 40
 <2><d84b8>: Abbrev Number: 2 (DW_TAG_member)
    <d84b9>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <d84bd>   DW_AT_decl_file   : 9
    <d84be>   DW_AT_decl_line   : 100
    <d84bf>   DW_AT_decl_column : 23
    <d84c0>   DW_AT_type        : <0xd81cd>
    <d84c4>   DW_AT_data_member_location: 48
 <2><d84c5>: Abbrev Number: 2 (DW_TAG_member)
    <d84c6>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <d84ca>   DW_AT_decl_file   : 9
    <d84cb>   DW_AT_decl_line   : 101
    <d84cc>   DW_AT_decl_column : 23
    <d84cd>   DW_AT_type        : <0xd81f2>
    <d84d1>   DW_AT_data_member_location: 56
 <2><d84d2>: Abbrev Number: 2 (DW_TAG_member)
    <d84d3>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <d84d7>   DW_AT_decl_file   : 9
    <d84d8>   DW_AT_decl_line   : 102
    <d84d9>   DW_AT_decl_column : 23
    <d84da>   DW_AT_type        : <0xd81fe>
    <d84de>   DW_AT_data_member_location: 64
 <2><d84df>: Abbrev Number: 2 (DW_TAG_member)
    <d84e0>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <d84e4>   DW_AT_decl_file   : 9
    <d84e5>   DW_AT_decl_line   : 103
    <d84e6>   DW_AT_decl_column : 23
    <d84e7>   DW_AT_type        : <0xd820a>
    <d84eb>   DW_AT_data_member_location: 72
 <2><d84ec>: Abbrev Number: 2 (DW_TAG_member)
    <d84ed>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <d84f1>   DW_AT_decl_file   : 9
    <d84f2>   DW_AT_decl_line   : 104
    <d84f3>   DW_AT_decl_column : 23
    <d84f4>   DW_AT_type        : <0xd8230>
    <d84f8>   DW_AT_data_member_location: 80
 <2><d84f9>: Abbrev Number: 2 (DW_TAG_member)
    <d84fa>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <d84fe>   DW_AT_decl_file   : 9
    <d84ff>   DW_AT_decl_line   : 105
    <d8500>   DW_AT_decl_column : 24
    <d8501>   DW_AT_type        : <0xd8266>
    <d8505>   DW_AT_data_member_location: 88
 <2><d8506>: Abbrev Number: 2 (DW_TAG_member)
    <d8507>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <d850b>   DW_AT_decl_file   : 9
    <d850c>   DW_AT_decl_line   : 106
    <d850d>   DW_AT_decl_column : 25
    <d850e>   DW_AT_type        : <0xd828c>
    <d8512>   DW_AT_data_member_location: 96
 <2><d8513>: Abbrev Number: 2 (DW_TAG_member)
    <d8514>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <d8518>   DW_AT_decl_file   : 9
    <d8519>   DW_AT_decl_line   : 107
    <d851a>   DW_AT_decl_column : 23
    <d851b>   DW_AT_type        : <0xd82b2>
    <d851f>   DW_AT_data_member_location: 104
 <2><d8520>: Abbrev Number: 2 (DW_TAG_member)
    <d8521>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <d8525>   DW_AT_decl_file   : 9
    <d8526>   DW_AT_decl_line   : 108
    <d8527>   DW_AT_decl_column : 23
    <d8528>   DW_AT_type        : <0xd8344>
    <d852c>   DW_AT_data_member_location: 112
 <2><d852d>: Abbrev Number: 2 (DW_TAG_member)
    <d852e>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <d8532>   DW_AT_decl_file   : 9
    <d8533>   DW_AT_decl_line   : 109
    <d8534>   DW_AT_decl_column : 23
    <d8535>   DW_AT_type        : <0xd8364>
    <d8539>   DW_AT_data_member_location: 120
 <2><d853a>: Abbrev Number: 2 (DW_TAG_member)
    <d853b>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <d853f>   DW_AT_decl_file   : 9
    <d8540>   DW_AT_decl_line   : 110
    <d8541>   DW_AT_decl_column : 23
    <d8542>   DW_AT_type        : <0xd8398>
    <d8546>   DW_AT_data_member_location: 128
 <2><d8547>: Abbrev Number: 2 (DW_TAG_member)
    <d8548>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <d854c>   DW_AT_decl_file   : 9
    <d854d>   DW_AT_decl_line   : 111
    <d854e>   DW_AT_decl_column : 23
    <d854f>   DW_AT_type        : <0xd83c7>
    <d8553>   DW_AT_data_member_location: 136
 <2><d8554>: Abbrev Number: 2 (DW_TAG_member)
    <d8555>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <d8559>   DW_AT_decl_file   : 9
    <d855a>   DW_AT_decl_line   : 112
    <d855b>   DW_AT_decl_column : 23
    <d855c>   DW_AT_type        : <0xd83e7>
    <d8560>   DW_AT_data_member_location: 144
 <2><d8561>: Abbrev Number: 2 (DW_TAG_member)
    <d8562>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <d8566>   DW_AT_decl_file   : 9
    <d8567>   DW_AT_decl_line   : 113
    <d8568>   DW_AT_decl_column : 25
    <d8569>   DW_AT_type        : <0xd81c1>
    <d856d>   DW_AT_data_member_location: 152
 <2><d856e>: Abbrev Number: 2 (DW_TAG_member)
    <d856f>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <d8573>   DW_AT_decl_file   : 9
    <d8574>   DW_AT_decl_line   : 114
    <d8575>   DW_AT_decl_column : 24
    <d8576>   DW_AT_type        : <0xd82d7>
    <d857a>   DW_AT_data_member_location: 160
 <2><d857b>: Abbrev Number: 2 (DW_TAG_member)
    <d857c>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <d8580>   DW_AT_decl_file   : 9
    <d8581>   DW_AT_decl_line   : 115
    <d8582>   DW_AT_decl_column : 25
    <d8583>   DW_AT_type        : <0xd8310>
    <d8587>   DW_AT_data_member_location: 168
 <2><d8588>: Abbrev Number: 2 (DW_TAG_member)
    <d8589>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <d858d>   DW_AT_decl_file   : 9
    <d858e>   DW_AT_decl_line   : 116
    <d858f>   DW_AT_decl_column : 23
    <d8590>   DW_AT_type        : <0xd823c>
    <d8594>   DW_AT_data_member_location: 176
 <2><d8595>: Abbrev Number: 2 (DW_TAG_member)
    <d8596>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <d859a>   DW_AT_decl_file   : 9
    <d859b>   DW_AT_decl_line   : 117
    <d859c>   DW_AT_decl_column : 23
    <d859d>   DW_AT_type        : <0xd840c>
    <d85a1>   DW_AT_data_member_location: 184
 <2><d85a2>: Abbrev Number: 2 (DW_TAG_member)
    <d85a3>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <d85a7>   DW_AT_decl_file   : 9
    <d85a8>   DW_AT_decl_line   : 118
    <d85a9>   DW_AT_decl_column : 22
    <d85aa>   DW_AT_type        : <0xd8418>
    <d85ae>   DW_AT_data_member_location: 192
 <2><d85af>: Abbrev Number: 2 (DW_TAG_member)
    <d85b0>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <d85b4>   DW_AT_decl_file   : 9
    <d85b5>   DW_AT_decl_line   : 119
    <d85b6>   DW_AT_decl_column : 23
    <d85b7>   DW_AT_type        : <0xd8424>
    <d85bb>   DW_AT_data_member_location: 200
 <2><d85bc>: Abbrev Number: 2 (DW_TAG_member)
    <d85bd>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <d85c1>   DW_AT_decl_file   : 9
    <d85c2>   DW_AT_decl_line   : 120
    <d85c3>   DW_AT_decl_column : 22
    <d85c4>   DW_AT_type        : <0xd8430>
    <d85c8>   DW_AT_data_member_location: 208
 <2><d85c9>: Abbrev Number: 2 (DW_TAG_member)
    <d85ca>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <d85ce>   DW_AT_decl_file   : 9
    <d85cf>   DW_AT_decl_line   : 121
    <d85d0>   DW_AT_decl_column : 23
    <d85d1>   DW_AT_type        : <0xd843c>
    <d85d5>   DW_AT_data_member_location: 216
 <2><d85d6>: Abbrev Number: 0
 <1><d85d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <d85d8>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <d85dc>   DW_AT_decl_file   : 9
    <d85dd>   DW_AT_decl_line   : 122
    <d85de>   DW_AT_decl_column : 3
    <d85df>   DW_AT_type        : <0xd845d>
 <1><d85e3>: Abbrev Number: 35 (DW_TAG_structure_type)
    <d85e4>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <d85e8>   DW_AT_byte_size   : 20848
    <d85ea>   DW_AT_decl_file   : 10
    <d85eb>   DW_AT_decl_line   : 349
    <d85ed>   DW_AT_decl_column : 16
    <d85ee>   DW_AT_sibling     : <0xd8663>
 <2><d85f2>: Abbrev Number: 11 (DW_TAG_member)
    <d85f3>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <d85f7>   DW_AT_decl_file   : 10
    <d85f7>   DW_AT_decl_line   : 350
    <d85f9>   DW_AT_decl_column : 18
    <d85f9>   DW_AT_type        : <0xd7bab>
    <d85fd>   DW_AT_data_member_location: 0
 <2><d85fe>: Abbrev Number: 11 (DW_TAG_member)
    <d85ff>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <d8603>   DW_AT_decl_file   : 10
    <d8603>   DW_AT_decl_line   : 351
    <d8605>   DW_AT_decl_column : 18
    <d8605>   DW_AT_type        : <0xd7c39>
    <d8609>   DW_AT_data_member_location: 8
 <2><d860a>: Abbrev Number: 11 (DW_TAG_member)
    <d860b>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <d860f>   DW_AT_decl_file   : 10
    <d860f>   DW_AT_decl_line   : 352
    <d8611>   DW_AT_decl_column : 18
    <d8611>   DW_AT_type        : <0xd7c85>
    <d8615>   DW_AT_data_member_location: 16
 <2><d8616>: Abbrev Number: 11 (DW_TAG_member)
    <d8617>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <d861b>   DW_AT_decl_file   : 10
    <d861b>   DW_AT_decl_line   : 353
    <d861d>   DW_AT_decl_column : 18
    <d861d>   DW_AT_type        : <0xd7bd3>
    <d8621>   DW_AT_data_member_location: 40
 <2><d8622>: Abbrev Number: 11 (DW_TAG_member)
    <d8623>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <d8627>   DW_AT_decl_file   : 10
    <d8627>   DW_AT_decl_line   : 354
    <d8629>   DW_AT_decl_column : 18
    <d8629>   DW_AT_type        : <0xd85d7>
    <d862d>   DW_AT_data_member_location: 48
 <2><d862e>: Abbrev Number: 13 (DW_TAG_member)
    <d862f>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <d8633>   DW_AT_decl_file   : 10
    <d8633>   DW_AT_decl_line   : 355
    <d8635>   DW_AT_decl_column : 18
    <d8635>   DW_AT_type        : <0xd8663>
    <d8639>   DW_AT_data_member_location: 272
 <2><d863b>: Abbrev Number: 13 (DW_TAG_member)
    <d863c>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <d8640>   DW_AT_decl_file   : 10
    <d8640>   DW_AT_decl_line   : 356
    <d8642>   DW_AT_decl_column : 18
    <d8642>   DW_AT_type        : <0xd7bab>
    <d8646>   DW_AT_data_member_location: 20832
 <2><d8648>: Abbrev Number: 13 (DW_TAG_member)
    <d8649>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <d864d>   DW_AT_decl_file   : 10
    <d864d>   DW_AT_decl_line   : 357
    <d864f>   DW_AT_decl_column : 18
    <d864f>   DW_AT_type        : <0xd7bab>
    <d8653>   DW_AT_data_member_location: 20836
 <2><d8655>: Abbrev Number: 13 (DW_TAG_member)
    <d8656>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <d865a>   DW_AT_decl_file   : 10
    <d865a>   DW_AT_decl_line   : 358
    <d865c>   DW_AT_decl_column : 18
    <d865c>   DW_AT_type        : <0xd7c4a>
    <d8660>   DW_AT_data_member_location: 20840
 <2><d8662>: Abbrev Number: 0
 <1><d8663>: Abbrev Number: 16 (DW_TAG_array_type)
    <d8664>   DW_AT_type        : <0xd8066>
    <d8668>   DW_AT_sibling     : <0xd8674>
 <2><d866c>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <d866d>   DW_AT_type        : <0xd7b96>
    <d8671>   DW_AT_upper_bound : 256
 <2><d8673>: Abbrev Number: 0
 <1><d8674>: Abbrev Number: 17 (DW_TAG_typedef)
    <d8675>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <d8679>   DW_AT_decl_file   : 10
    <d867a>   DW_AT_decl_line   : 359
    <d867c>   DW_AT_decl_column : 3
    <d867d>   DW_AT_type        : <0xd85e3>
 <1><d8681>: Abbrev Number: 37 (DW_TAG_variable)
    <d8682>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <d8686>   DW_AT_decl_file   : 10
    <d8687>   DW_AT_decl_line   : 361
    <d8689>   DW_AT_decl_column : 21
    <d868a>   DW_AT_type        : <0xd8674>
    <d868e>   DW_AT_external    : 1
    <d868e>   DW_AT_declaration : 1
 <1><d868e>: Abbrev Number: 38 (DW_TAG_variable)
    <d868f>   DW_AT_name        : (indirect string, offset: 0x1c149): hex_table
    <d8693>   DW_AT_decl_file   : 1
    <d8694>   DW_AT_decl_line   : 5
    <d8695>   DW_AT_decl_column : 13
    <d8696>   DW_AT_type        : <0xd8072>
    <d869a>   DW_AT_location    : 9 byte block: 3 40 49 48 0 0 0 0 0 	(DW_OP_addr: 484940)
 <1><d86a4>: Abbrev Number: 39 (DW_TAG_subprogram)
    <d86a5>   DW_AT_external    : 1
    <d86a5>   DW_AT_name        : (indirect string, offset: 0x1beac): fb_hStrAllocTemp
    <d86a9>   DW_AT_decl_file   : 6
    <d86aa>   DW_AT_decl_line   : 109
    <d86ab>   DW_AT_decl_column : 21
    <d86ac>   DW_AT_prototyped  : 1
    <d86ac>   DW_AT_type        : <0xd7f56>
    <d86b0>   DW_AT_declaration : 1
    <d86b0>   DW_AT_sibling     : <0xd86bf>
 <2><d86b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d86b5>   DW_AT_type        : <0xd7f56>
 <2><d86b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d86ba>   DW_AT_type        : <0xd7c10>
 <2><d86be>: Abbrev Number: 0
 <1><d86bf>: Abbrev Number: 40 (DW_TAG_subprogram)
    <d86c0>   DW_AT_external    : 1
    <d86c0>   DW_AT_name        : (indirect string, offset: 0x33f): fb_HEX_l
    <d86c4>   DW_AT_decl_file   : 1
    <d86c5>   DW_AT_decl_line   : 42
    <d86c6>   DW_AT_decl_column : 18
    <d86c7>   DW_AT_prototyped  : 1
    <d86c7>   DW_AT_type        : <0xd7f56>
    <d86cb>   DW_AT_low_pc      : 0x476d40
    <d86d3>   DW_AT_high_pc     : 0xa7
    <d86db>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d86dd>   DW_AT_call_all_calls: 1
    <d86dd>   DW_AT_sibling     : <0xd8766>
 <2><d86e1>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <d86e2>   DW_AT_name        : num
    <d86e6>   DW_AT_decl_file   : 1
    <d86e7>   DW_AT_decl_line   : 42
    <d86e8>   DW_AT_decl_column : 48
    <d86e9>   DW_AT_type        : <0xd7c1c>
    <d86ed>   DW_AT_location    : 0x3f94e (location list)
    <d86f1>   DW_AT_GNU_locviews: 0x3f942
 <2><d86f5>: Abbrev Number: 42 (DW_TAG_inlined_subroutine)
    <d86f6>   DW_AT_abstract_origin: <0xd8766>
    <d86fa>   DW_AT_entry_pc    : 0x476d40
    <d8702>   DW_AT_GNU_entry_view: 2
    <d8703>   DW_AT_ranges      : 0x18580
    <d8707>   DW_AT_call_file   : 1
    <d8708>   DW_AT_call_line   : 44
    <d8709>   DW_AT_call_column : 9
 <3><d870a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d870b>   DW_AT_abstract_origin: <0xd8783>
    <d870f>   DW_AT_location    : 0x3f987 (location list)
    <d8713>   DW_AT_GNU_locviews: 0x3f97f
 <3><d8717>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d8718>   DW_AT_abstract_origin: <0xd8777>
    <d871c>   DW_AT_location    : 0x3f9b2 (location list)
    <d8720>   DW_AT_GNU_locviews: 0x3f9a6
 <3><d8724>: Abbrev Number: 43 (DW_TAG_lexical_block)
    <d8725>   DW_AT_ranges      : 0x18580
 <4><d8729>: Abbrev Number: 8 (DW_TAG_variable)
    <d872a>   DW_AT_abstract_origin: <0xd878f>
    <d872e>   DW_AT_location    : 0x3f9df (location list)
    <d8732>   DW_AT_GNU_locviews: 0x3f9dd
 <4><d8736>: Abbrev Number: 8 (DW_TAG_variable)
    <d8737>   DW_AT_abstract_origin: <0xd8798>
    <d873b>   DW_AT_location    : 0x3f9f1 (location list)
    <d873f>   DW_AT_GNU_locviews: 0x3f9e7
 <4><d8743>: Abbrev Number: 8 (DW_TAG_variable)
    <d8744>   DW_AT_abstract_origin: <0xd87a1>
    <d8748>   DW_AT_location    : 0x3fa27 (location list)
    <d874c>   DW_AT_GNU_locviews: 0x3fa1d
 <4><d8750>: Abbrev Number: 23 (DW_TAG_call_site)
    <d8751>   DW_AT_call_return_pc: 0x476d6e
    <d8759>   DW_AT_call_origin : <0xd86a4>
 <5><d875d>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <d875e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d8760>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><d8762>: Abbrev Number: 0
 <4><d8763>: Abbrev Number: 0
 <3><d8764>: Abbrev Number: 0
 <2><d8765>: Abbrev Number: 0
 <1><d8766>: Abbrev Number: 44 (DW_TAG_subprogram)
    <d8767>   DW_AT_external    : 1
    <d8767>   DW_AT_name        : (indirect string, offset: 0x1c111): fb_HEXEx_l
    <d876b>   DW_AT_decl_file   : 1
    <d876c>   DW_AT_decl_line   : 7
    <d876d>   DW_AT_decl_column : 18
    <d876e>   DW_AT_prototyped  : 1
    <d876e>   DW_AT_type        : <0xd7f56>
    <d8772>   DW_AT_inline      : 1	(inlined)
    <d8773>   DW_AT_sibling     : <0xd87ae>
 <2><d8777>: Abbrev Number: 45 (DW_TAG_formal_parameter)
    <d8778>   DW_AT_name        : num
    <d877c>   DW_AT_decl_file   : 1
    <d877d>   DW_AT_decl_line   : 7
    <d877e>   DW_AT_decl_column : 50
    <d877f>   DW_AT_type        : <0xd7c1c>
 <2><d8783>: Abbrev Number: 46 (DW_TAG_formal_parameter)
    <d8784>   DW_AT_name        : (indirect string, offset: 0x1c139): digits
    <d8788>   DW_AT_decl_file   : 1
    <d8789>   DW_AT_decl_line   : 7
    <d878a>   DW_AT_decl_column : 59
    <d878b>   DW_AT_type        : <0xd7bab>
 <2><d878f>: Abbrev Number: 24 (DW_TAG_variable)
    <d8790>   DW_AT_name        : s
    <d8792>   DW_AT_decl_file   : 1
    <d8792>   DW_AT_decl_line   : 9
    <d8793>   DW_AT_decl_column : 12
    <d8794>   DW_AT_type        : <0xd7f56>
 <2><d8798>: Abbrev Number: 24 (DW_TAG_variable)
    <d8799>   DW_AT_name        : i
    <d879b>   DW_AT_decl_file   : 1
    <d879b>   DW_AT_decl_line   : 10
    <d879c>   DW_AT_decl_column : 6
    <d879d>   DW_AT_type        : <0xd7bab>
 <2><d87a1>: Abbrev Number: 47 (DW_TAG_variable)
    <d87a2>   DW_AT_name        : (indirect string, offset: 0x1c153): num2
    <d87a6>   DW_AT_decl_file   : 1
    <d87a7>   DW_AT_decl_line   : 11
    <d87a8>   DW_AT_decl_column : 21
    <d87a9>   DW_AT_type        : <0xd7c1c>
 <2><d87ad>: Abbrev Number: 0
 <1><d87ae>: Abbrev Number: 48 (DW_TAG_subprogram)
    <d87af>   DW_AT_abstract_origin: <0xd8766>
    <d87b3>   DW_AT_low_pc      : 0x476c80
    <d87bb>   DW_AT_high_pc     : 0xb5
    <d87c3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d87c5>   DW_AT_call_all_calls: 1
 <2><d87c5>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d87c6>   DW_AT_abstract_origin: <0xd8777>
    <d87ca>   DW_AT_location    : 0x3fa5d (location list)
    <d87ce>   DW_AT_GNU_locviews: 0x3fa4f
 <2><d87d2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d87d3>   DW_AT_abstract_origin: <0xd8783>
    <d87d7>   DW_AT_location    : 0x3fa93 (location list)
    <d87db>   DW_AT_GNU_locviews: 0x3fa89
 <2><d87df>: Abbrev Number: 8 (DW_TAG_variable)
    <d87e0>   DW_AT_abstract_origin: <0xd878f>
    <d87e4>   DW_AT_location    : 0x3fab6 (location list)
    <d87e8>   DW_AT_GNU_locviews: 0x3fab2
 <2><d87ec>: Abbrev Number: 8 (DW_TAG_variable)
    <d87ed>   DW_AT_abstract_origin: <0xd8798>
    <d87f1>   DW_AT_location    : 0x3facb (location list)
    <d87f5>   DW_AT_GNU_locviews: 0x3fac3
 <2><d87f9>: Abbrev Number: 8 (DW_TAG_variable)
    <d87fa>   DW_AT_abstract_origin: <0xd87a1>
    <d87fe>   DW_AT_location    : 0x3faee (location list)
    <d8802>   DW_AT_GNU_locviews: 0x3fae4
 <2><d8806>: Abbrev Number: 49 (DW_TAG_call_site)
    <d8807>   DW_AT_call_return_pc: 0x476c99
    <d880f>   DW_AT_call_origin : <0xd86a4>
    <d8813>   DW_AT_sibling     : <0xd881d>
 <3><d8817>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <d8818>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d881a>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><d881c>: Abbrev Number: 0
 <2><d881d>: Abbrev Number: 23 (DW_TAG_call_site)
    <d881e>   DW_AT_call_return_pc: 0x476d13
    <d8826>   DW_AT_call_origin : <0xd86a4>
 <3><d882a>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <d882b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d882d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><d882f>: Abbrev Number: 15 (DW_TAG_call_site_parameter)
    <d8830>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d8832>   DW_AT_call_value  : 8 byte block: 76 0 8 20 24 8 20 26 	(DW_OP_breg6 (rbp): 0; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <3><d883b>: Abbrev Number: 0
 <2><d883c>: Abbrev Number: 0
 <1><d883d>: Abbrev Number: 0
  Compilation Unit @ offset 0xd883e:
   Length:        0x164 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x144f5
   Pointer Size:  8
 <0><d884a>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <d884b>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d884f>   DW_AT_language    : 29	(C11)
    <d8850>   DW_AT_name        : (indirect line string, offset: 0x1419): src/rtlib/str_hskip.c
    <d8854>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d8858>   DW_AT_low_pc      : 0x476df0
    <d8860>   DW_AT_high_pc     : 0x81
    <d8868>   DW_AT_stmt_list   : 0x6bdbc
 <1><d886c>: Abbrev Number: 1 (DW_TAG_base_type)
    <d886d>   DW_AT_byte_size   : 1
    <d886e>   DW_AT_encoding    : 8	(unsigned char)
    <d886f>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d8873>: Abbrev Number: 1 (DW_TAG_base_type)
    <d8874>   DW_AT_byte_size   : 2
    <d8875>   DW_AT_encoding    : 7	(unsigned)
    <d8876>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d887a>: Abbrev Number: 1 (DW_TAG_base_type)
    <d887b>   DW_AT_byte_size   : 4
    <d887c>   DW_AT_encoding    : 7	(unsigned)
    <d887d>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d8881>: Abbrev Number: 1 (DW_TAG_base_type)
    <d8882>   DW_AT_byte_size   : 8
    <d8883>   DW_AT_encoding    : 7	(unsigned)
    <d8884>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d8888>: Abbrev Number: 1 (DW_TAG_base_type)
    <d8889>   DW_AT_byte_size   : 1
    <d888a>   DW_AT_encoding    : 6	(signed char)
    <d888b>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d888f>: Abbrev Number: 1 (DW_TAG_base_type)
    <d8890>   DW_AT_byte_size   : 2
    <d8891>   DW_AT_encoding    : 5	(signed)
    <d8892>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d8896>: Abbrev Number: 7 (DW_TAG_base_type)
    <d8897>   DW_AT_byte_size   : 4
    <d8898>   DW_AT_encoding    : 5	(signed)
    <d8899>   DW_AT_name        : int
 <1><d889d>: Abbrev Number: 1 (DW_TAG_base_type)
    <d889e>   DW_AT_byte_size   : 8
    <d889f>   DW_AT_encoding    : 5	(signed)
    <d88a0>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d88a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <d88a5>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <d88a9>   DW_AT_decl_file   : 2
    <d88aa>   DW_AT_decl_line   : 194
    <d88ab>   DW_AT_decl_column : 27
    <d88ac>   DW_AT_type        : <0xd889d>
 <1><d88b0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d88b1>   DW_AT_byte_size   : 8
    <d88b2>   DW_AT_type        : <0xd88b6>
 <1><d88b6>: Abbrev Number: 1 (DW_TAG_base_type)
    <d88b7>   DW_AT_byte_size   : 1
    <d88b8>   DW_AT_encoding    : 6	(signed char)
    <d88b9>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d88bd>: Abbrev Number: 1 (DW_TAG_base_type)
    <d88be>   DW_AT_byte_size   : 8
    <d88bf>   DW_AT_encoding    : 5	(signed)
    <d88c0>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d88c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <d88c5>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <d88c9>   DW_AT_decl_file   : 3
    <d88ca>   DW_AT_decl_line   : 108
    <d88cb>   DW_AT_decl_column : 19
    <d88cc>   DW_AT_type        : <0xd88a4>
 <1><d88d0>: Abbrev Number: 1 (DW_TAG_base_type)
    <d88d1>   DW_AT_byte_size   : 8
    <d88d2>   DW_AT_encoding    : 7	(unsigned)
    <d88d3>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d88d7>: Abbrev Number: 1 (DW_TAG_base_type)
    <d88d8>   DW_AT_byte_size   : 8
    <d88d9>   DW_AT_encoding    : 4	(float)
    <d88da>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d88de>: Abbrev Number: 1 (DW_TAG_base_type)
    <d88df>   DW_AT_byte_size   : 4
    <d88e0>   DW_AT_encoding    : 4	(float)
    <d88e1>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d88e5>: Abbrev Number: 9 (DW_TAG_subprogram)
    <d88e6>   DW_AT_external    : 1
    <d88e6>   DW_AT_name        : (indirect string, offset: 0x1c158): fb_hStrSkipCharRev
    <d88ea>   DW_AT_decl_file   : 1
    <d88eb>   DW_AT_decl_line   : 14
    <d88ec>   DW_AT_decl_column : 14
    <d88ed>   DW_AT_prototyped  : 1
    <d88ed>   DW_AT_type        : <0xd88b0>
    <d88f1>   DW_AT_low_pc      : 0x476e30
    <d88f9>   DW_AT_high_pc     : 0x41
    <d8901>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d8903>   DW_AT_call_all_calls: 1
    <d8903>   DW_AT_sibling     : <0xd8947>
 <2><d8907>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8908>   DW_AT_name        : s
    <d890a>   DW_AT_decl_file   : 1
    <d890a>   DW_AT_decl_line   : 14
    <d890b>   DW_AT_decl_column : 40
    <d890c>   DW_AT_type        : <0xd88b0>
    <d8910>   DW_AT_location    : 0x3fb27 (location list)
    <d8914>   DW_AT_GNU_locviews: 0x3fb1f
 <2><d8918>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8919>   DW_AT_name        : len
    <d891d>   DW_AT_decl_file   : 1
    <d891d>   DW_AT_decl_line   : 14
    <d891e>   DW_AT_decl_column : 51
    <d891f>   DW_AT_type        : <0xd88c4>
    <d8923>   DW_AT_location    : 0x3fb51 (location list)
    <d8927>   DW_AT_GNU_locviews: 0x3fb43
 <2><d892b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d892c>   DW_AT_name        : c
    <d892e>   DW_AT_decl_file   : 1
    <d892e>   DW_AT_decl_line   : 14
    <d892f>   DW_AT_decl_column : 60
    <d8930>   DW_AT_type        : <0xd8896>
    <d8934>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
 <2><d8936>: Abbrev Number: 5 (DW_TAG_variable)
    <d8937>   DW_AT_name        : p
    <d8939>   DW_AT_decl_file   : 1
    <d8939>   DW_AT_decl_line   : 16
    <d893a>   DW_AT_decl_column : 8
    <d893a>   DW_AT_type        : <0xd88b0>
    <d893e>   DW_AT_location    : 0x3fb94 (location list)
    <d8942>   DW_AT_GNU_locviews: 0x3fb8e
 <2><d8946>: Abbrev Number: 0
 <1><d8947>: Abbrev Number: 10 (DW_TAG_subprogram)
    <d8948>   DW_AT_external    : 1
    <d8948>   DW_AT_name        : (indirect string, offset: 0x1bf91): fb_hStrSkipChar
    <d894c>   DW_AT_decl_file   : 1
    <d894d>   DW_AT_decl_line   : 3
    <d894e>   DW_AT_decl_column : 14
    <d894f>   DW_AT_prototyped  : 1
    <d894f>   DW_AT_type        : <0xd88b0>
    <d8953>   DW_AT_low_pc      : 0x476df0
    <d895b>   DW_AT_high_pc     : 0x33
    <d8963>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d8965>   DW_AT_call_all_calls: 1
 <2><d8965>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8966>   DW_AT_name        : s
    <d8968>   DW_AT_decl_file   : 1
    <d8968>   DW_AT_decl_line   : 3
    <d8969>   DW_AT_decl_column : 37
    <d896a>   DW_AT_type        : <0xd88b0>
    <d896e>   DW_AT_location    : 0x3fbb2 (location list)
    <d8972>   DW_AT_GNU_locviews: 0x3fbac
 <2><d8976>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8977>   DW_AT_name        : len
    <d897b>   DW_AT_decl_file   : 1
    <d897b>   DW_AT_decl_line   : 3
    <d897c>   DW_AT_decl_column : 48
    <d897d>   DW_AT_type        : <0xd88c4>
    <d8981>   DW_AT_location    : 0x3fbd0 (location list)
    <d8985>   DW_AT_GNU_locviews: 0x3fbc2
 <2><d8989>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d898a>   DW_AT_name        : c
    <d898c>   DW_AT_decl_file   : 1
    <d898c>   DW_AT_decl_line   : 3
    <d898d>   DW_AT_decl_column : 57
    <d898e>   DW_AT_type        : <0xd8896>
    <d8992>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
 <2><d8994>: Abbrev Number: 5 (DW_TAG_variable)
    <d8995>   DW_AT_name        : p
    <d8997>   DW_AT_decl_file   : 1
    <d8997>   DW_AT_decl_line   : 5
    <d8998>   DW_AT_decl_column : 8
    <d8998>   DW_AT_type        : <0xd88b0>
    <d899c>   DW_AT_location    : 0x3fc1c (location list)
    <d89a0>   DW_AT_GNU_locviews: 0x3fc18
 <2><d89a4>: Abbrev Number: 0
 <1><d89a5>: Abbrev Number: 0
  Compilation Unit @ offset 0xd89a6:
   Length:        0xd5a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x145ac
   Pointer Size:  8
 <0><d89b2>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <d89b3>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d89b7>   DW_AT_language    : 29	(C11)
    <d89b8>   DW_AT_name        : (indirect line string, offset: 0x142f): src/rtlib/str_lcase.c
    <d89bc>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d89c0>   DW_AT_low_pc      : 0x476e80
    <d89c8>   DW_AT_high_pc     : 0x532
    <d89d0>   DW_AT_stmt_list   : 0x6be81
 <1><d89d4>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89d5>   DW_AT_byte_size   : 1
    <d89d6>   DW_AT_encoding    : 8	(unsigned char)
    <d89d7>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d89db>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89dc>   DW_AT_byte_size   : 2
    <d89dd>   DW_AT_encoding    : 7	(unsigned)
    <d89de>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d89e2>: Abbrev Number: 15 (DW_TAG_const_type)
    <d89e3>   DW_AT_type        : <0xd89db>
 <1><d89e7>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89e8>   DW_AT_byte_size   : 4
    <d89e9>   DW_AT_encoding    : 7	(unsigned)
    <d89ea>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d89ee>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89ef>   DW_AT_byte_size   : 8
    <d89f0>   DW_AT_encoding    : 7	(unsigned)
    <d89f1>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d89f5>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89f6>   DW_AT_byte_size   : 1
    <d89f7>   DW_AT_encoding    : 6	(signed char)
    <d89f8>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d89fc>: Abbrev Number: 6 (DW_TAG_base_type)
    <d89fd>   DW_AT_byte_size   : 2
    <d89fe>   DW_AT_encoding    : 5	(signed)
    <d89ff>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d8a03>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a04>   DW_AT_name        : (indirect string, offset: 0x16d51): __int32_t
    <d8a08>   DW_AT_decl_file   : 3
    <d8a09>   DW_AT_decl_line   : 41
    <d8a0a>   DW_AT_decl_column : 20
    <d8a0b>   DW_AT_type        : <0xd8a14>
 <1><d8a0f>: Abbrev Number: 15 (DW_TAG_const_type)
    <d8a10>   DW_AT_type        : <0xd8a03>
 <1><d8a14>: Abbrev Number: 27 (DW_TAG_base_type)
    <d8a15>   DW_AT_byte_size   : 4
    <d8a16>   DW_AT_encoding    : 5	(signed)
    <d8a17>   DW_AT_name        : int
 <1><d8a1b>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8a1c>   DW_AT_byte_size   : 8
    <d8a1d>   DW_AT_encoding    : 5	(signed)
    <d8a1e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d8a22>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a23>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <d8a27>   DW_AT_decl_file   : 3
    <d8a28>   DW_AT_decl_line   : 153
    <d8a29>   DW_AT_decl_column : 27
    <d8a2a>   DW_AT_type        : <0xd8a1b>
 <1><d8a2e>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <d8a2f>   DW_AT_byte_size   : 8
 <1><d8a30>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a31>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <d8a35>   DW_AT_decl_file   : 3
    <d8a36>   DW_AT_decl_line   : 194
    <d8a37>   DW_AT_decl_column : 27
    <d8a38>   DW_AT_type        : <0xd8a1b>
 <1><d8a3c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8a3d>   DW_AT_byte_size   : 8
    <d8a3d>   DW_AT_type        : <0xd8a41>
 <1><d8a41>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8a42>   DW_AT_byte_size   : 1
    <d8a43>   DW_AT_encoding    : 6	(signed char)
    <d8a44>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d8a48>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a49>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <d8a4d>   DW_AT_decl_file   : 4
    <d8a4e>   DW_AT_decl_line   : 209
    <d8a4f>   DW_AT_decl_column : 23
    <d8a50>   DW_AT_type        : <0xd89ee>
 <1><d8a54>: Abbrev Number: 17 (DW_TAG_typedef)
    <d8a55>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <d8a59>   DW_AT_decl_file   : 4
    <d8a5a>   DW_AT_decl_line   : 321
    <d8a5c>   DW_AT_decl_column : 24
    <d8a5d>   DW_AT_type        : <0xd8a14>
 <1><d8a61>: Abbrev Number: 15 (DW_TAG_const_type)
    <d8a62>   DW_AT_type        : <0xd8a54>
 <1><d8a66>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8a67>   DW_AT_byte_size   : 8
    <d8a68>   DW_AT_encoding    : 5	(signed)
    <d8a69>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d8a6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a6e>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <d8a72>   DW_AT_decl_file   : 5
    <d8a73>   DW_AT_decl_line   : 87
    <d8a74>   DW_AT_decl_column : 19
    <d8a75>   DW_AT_type        : <0xd8a22>
 <1><d8a79>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8a7a>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <d8a7e>   DW_AT_decl_file   : 5
    <d8a7f>   DW_AT_decl_line   : 108
    <d8a80>   DW_AT_decl_column : 19
    <d8a81>   DW_AT_type        : <0xd8a30>
 <1><d8a85>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8a86>   DW_AT_byte_size   : 8
    <d8a87>   DW_AT_encoding    : 7	(unsigned)
    <d8a88>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d8a8c>: Abbrev Number: 18 (DW_TAG_array_type)
    <d8a8d>   DW_AT_type        : <0xd8a41>
    <d8a91>   DW_AT_sibling     : <0xd8a9c>
 <2><d8a95>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <d8a96>   DW_AT_type        : <0xd89ee>
    <d8a9a>   DW_AT_upper_bound : 3
 <2><d8a9b>: Abbrev Number: 0
 <1><d8a9c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8a9d>   DW_AT_byte_size   : 8
    <d8a9d>   DW_AT_type        : <0xd8aa1>
 <1><d8aa1>: Abbrev Number: 30 (DW_TAG_const_type)
 <1><d8aa2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8aa3>   DW_AT_byte_size   : 8
    <d8aa3>   DW_AT_type        : <0xd89e2>
 <1><d8aa7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8aa8>   DW_AT_byte_size   : 8
    <d8aa8>   DW_AT_type        : <0xd8a3c>
 <1><d8aac>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8aad>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <d8ab1>   DW_AT_decl_file   : 6
    <d8ab2>   DW_AT_decl_line   : 22
    <d8ab3>   DW_AT_decl_column : 15
    <d8ab4>   DW_AT_type        : <0xd8a6d>
 <1><d8ab8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8ab9>   DW_AT_byte_size   : 8
    <d8ab9>   DW_AT_type        : <0xd8a0f>
 <1><d8abd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8abe>   DW_AT_byte_size   : 8
    <d8abe>   DW_AT_type        : <0xd8ac2>
 <1><d8ac2>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <d8ac3>   DW_AT_prototyped  : 1
 <1><d8ac3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d8ac4>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <d8ac8>   DW_AT_byte_size   : 24
    <d8ac9>   DW_AT_decl_file   : 7
    <d8aca>   DW_AT_decl_line   : 82
    <d8acb>   DW_AT_decl_column : 16
    <d8acc>   DW_AT_sibling     : <0xd8af8>
 <2><d8ad0>: Abbrev Number: 2 (DW_TAG_member)
    <d8ad1>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <d8ad5>   DW_AT_decl_file   : 7
    <d8ad6>   DW_AT_decl_line   : 83
    <d8ad7>   DW_AT_decl_column : 21
    <d8ad8>   DW_AT_type        : <0xd8a3c>
    <d8adc>   DW_AT_data_member_location: 0
 <2><d8add>: Abbrev Number: 9 (DW_TAG_member)
    <d8ade>   DW_AT_name        : len
    <d8ae2>   DW_AT_decl_file   : 7
    <d8ae3>   DW_AT_decl_line   : 84
    <d8ae4>   DW_AT_decl_column : 21
    <d8ae5>   DW_AT_type        : <0xd8a79>
    <d8ae9>   DW_AT_data_member_location: 8
 <2><d8aea>: Abbrev Number: 2 (DW_TAG_member)
    <d8aeb>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d8aef>   DW_AT_decl_file   : 7
    <d8af0>   DW_AT_decl_line   : 85
    <d8af1>   DW_AT_decl_column : 21
    <d8af2>   DW_AT_type        : <0xd8a79>
    <d8af6>   DW_AT_data_member_location: 16
 <2><d8af7>: Abbrev Number: 0
 <1><d8af8>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8af9>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <d8afd>   DW_AT_decl_file   : 7
    <d8afe>   DW_AT_decl_line   : 86
    <d8aff>   DW_AT_decl_column : 3
    <d8b00>   DW_AT_type        : <0xd8ac3>
 <1><d8b04>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8b05>   DW_AT_byte_size   : 8
    <d8b06>   DW_AT_encoding    : 4	(float)
    <d8b07>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d8b0b>: Abbrev Number: 6 (DW_TAG_base_type)
    <d8b0c>   DW_AT_byte_size   : 4
    <d8b0d>   DW_AT_encoding    : 4	(float)
    <d8b0e>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d8b12>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8b13>   DW_AT_byte_size   : 8
    <d8b13>   DW_AT_type        : <0xd8a54>
 <1><d8b17>: Abbrev Number: 32 (DW_TAG_enumeration_type)
    <d8b18>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <d8b1c>   DW_AT_encoding    : 7	(unsigned)
    <d8b1d>   DW_AT_byte_size   : 4
    <d8b1e>   DW_AT_type        : <0xd89e7>
    <d8b22>   DW_AT_decl_file   : 8
    <d8b23>   DW_AT_decl_line   : 25
    <d8b24>   DW_AT_decl_column : 14
    <d8b25>   DW_AT_sibling     : <0xd8b42>
 <2><d8b29>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d8b2a>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <d8b2e>   DW_AT_const_value : 0
 <2><d8b2f>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d8b30>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <d8b34>   DW_AT_const_value : 1
 <2><d8b35>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d8b36>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <d8b3a>   DW_AT_const_value : 2
 <2><d8b3b>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d8b3c>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <d8b40>   DW_AT_const_value : 3
 <2><d8b41>: Abbrev Number: 0
 <1><d8b42>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8b43>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <d8b47>   DW_AT_decl_file   : 8
    <d8b48>   DW_AT_decl_line   : 30
    <d8b49>   DW_AT_decl_column : 3
    <d8b4a>   DW_AT_type        : <0xd8b17>
 <1><d8b4e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8b4f>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <d8b53>   DW_AT_decl_file   : 8
    <d8b54>   DW_AT_decl_line   : 54
    <d8b55>   DW_AT_decl_column : 15
    <d8b56>   DW_AT_type        : <0xd8b5a>
 <1><d8b5a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8b5b>   DW_AT_byte_size   : 8
    <d8b5b>   DW_AT_type        : <0xd8b5f>
 <1><d8b5f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8b60>   DW_AT_prototyped  : 1
    <d8b60>   DW_AT_type        : <0xd8a14>
    <d8b64>   DW_AT_sibling     : <0xd8b73>
 <2><d8b68>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8b69>   DW_AT_type        : <0xd8b73>
 <2><d8b6d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8b6e>   DW_AT_type        : <0xd8a14>
 <2><d8b72>: Abbrev Number: 0
 <1><d8b73>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8b74>   DW_AT_byte_size   : 8
    <d8b74>   DW_AT_type        : <0xd8b78>
 <1><d8b78>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d8b79>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <d8b7d>   DW_AT_byte_size   : 80
    <d8b7e>   DW_AT_decl_file   : 8
    <d8b7f>   DW_AT_decl_line   : 97
    <d8b80>   DW_AT_decl_column : 16
    <d8b81>   DW_AT_sibling     : <0xd8c3c>
 <2><d8b85>: Abbrev Number: 2 (DW_TAG_member)
    <d8b86>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <d8b8a>   DW_AT_decl_file   : 8
    <d8b8b>   DW_AT_decl_line   : 98
    <d8b8c>   DW_AT_decl_column : 21
    <d8b8d>   DW_AT_type        : <0xd8a14>
    <d8b91>   DW_AT_data_member_location: 0
 <2><d8b92>: Abbrev Number: 9 (DW_TAG_member)
    <d8b93>   DW_AT_name        : len
    <d8b97>   DW_AT_decl_file   : 8
    <d8b98>   DW_AT_decl_line   : 99
    <d8b99>   DW_AT_decl_column : 21
    <d8b9a>   DW_AT_type        : <0xd8a14>
    <d8b9e>   DW_AT_data_member_location: 4
 <2><d8b9f>: Abbrev Number: 2 (DW_TAG_member)
    <d8ba0>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <d8ba4>   DW_AT_decl_file   : 8
    <d8ba5>   DW_AT_decl_line   : 100
    <d8ba6>   DW_AT_decl_column : 21
    <d8ba7>   DW_AT_type        : <0xd8b42>
    <d8bab>   DW_AT_data_member_location: 8
 <2><d8bac>: Abbrev Number: 2 (DW_TAG_member)
    <d8bad>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d8bb1>   DW_AT_decl_file   : 8
    <d8bb2>   DW_AT_decl_line   : 101
    <d8bb3>   DW_AT_decl_column : 21
    <d8bb4>   DW_AT_type        : <0xd8aac>
    <d8bb8>   DW_AT_data_member_location: 16
 <2><d8bb9>: Abbrev Number: 2 (DW_TAG_member)
    <d8bba>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <d8bbe>   DW_AT_decl_file   : 8
    <d8bbf>   DW_AT_decl_line   : 102
    <d8bc0>   DW_AT_decl_column : 21
    <d8bc1>   DW_AT_type        : <0xd8a14>
    <d8bc5>   DW_AT_data_member_location: 24
 <2><d8bc6>: Abbrev Number: 2 (DW_TAG_member)
    <d8bc7>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <d8bcb>   DW_AT_decl_file   : 8
    <d8bcc>   DW_AT_decl_line   : 103
    <d8bcd>   DW_AT_decl_column : 21
    <d8bce>   DW_AT_type        : <0xd8a14>
    <d8bd2>   DW_AT_data_member_location: 28
 <2><d8bd3>: Abbrev Number: 2 (DW_TAG_member)
    <d8bd4>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <d8bd8>   DW_AT_decl_file   : 8
    <d8bd9>   DW_AT_decl_line   : 104
    <d8bda>   DW_AT_decl_column : 21
    <d8bdb>   DW_AT_type        : <0xd8a14>
    <d8bdf>   DW_AT_data_member_location: 32
 <2><d8be0>: Abbrev Number: 2 (DW_TAG_member)
    <d8be1>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <d8be5>   DW_AT_decl_file   : 8
    <d8be6>   DW_AT_decl_line   : 105
    <d8be7>   DW_AT_decl_column : 21
    <d8be8>   DW_AT_type        : <0xd89e7>
    <d8bec>   DW_AT_data_member_location: 36
 <2><d8bed>: Abbrev Number: 2 (DW_TAG_member)
    <d8bee>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <d8bf2>   DW_AT_decl_file   : 8
    <d8bf3>   DW_AT_decl_line   : 106
    <d8bf4>   DW_AT_decl_column : 21
    <d8bf5>   DW_AT_type        : <0xd89e7>
    <d8bf9>   DW_AT_data_member_location: 40
 <2><d8bfa>: Abbrev Number: 2 (DW_TAG_member)
    <d8bfb>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <d8bff>   DW_AT_decl_file   : 8
    <d8c00>   DW_AT_decl_line   : 109
    <d8c01>   DW_AT_decl_column : 21
    <d8c02>   DW_AT_type        : <0xd8a8c>
    <d8c06>   DW_AT_data_member_location: 44
 <2><d8c07>: Abbrev Number: 2 (DW_TAG_member)
    <d8c08>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <d8c0c>   DW_AT_decl_file   : 8
    <d8c0d>   DW_AT_decl_line   : 110
    <d8c0e>   DW_AT_decl_column : 21
    <d8c0f>   DW_AT_type        : <0xd8a48>
    <d8c13>   DW_AT_data_member_location: 48
 <2><d8c14>: Abbrev Number: 2 (DW_TAG_member)
    <d8c15>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <d8c19>   DW_AT_decl_file   : 8
    <d8c1a>   DW_AT_decl_line   : 112
    <d8c1b>   DW_AT_decl_column : 22
    <d8c1c>   DW_AT_type        : <0xd8ed4>
    <d8c20>   DW_AT_data_member_location: 56
 <2><d8c21>: Abbrev Number: 2 (DW_TAG_member)
    <d8c22>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <d8c26>   DW_AT_decl_file   : 8
    <d8c27>   DW_AT_decl_line   : 114
    <d8c28>   DW_AT_decl_column : 14
    <d8c29>   DW_AT_type        : <0xd8a2e>
    <d8c2d>   DW_AT_data_member_location: 64
 <2><d8c2e>: Abbrev Number: 2 (DW_TAG_member)
    <d8c2f>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <d8c33>   DW_AT_decl_file   : 8
    <d8c34>   DW_AT_decl_line   : 116
    <d8c35>   DW_AT_decl_column : 22
    <d8c36>   DW_AT_type        : <0xd8b73>
    <d8c3a>   DW_AT_data_member_location: 72
 <2><d8c3b>: Abbrev Number: 0
 <1><d8c3c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8c3d>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <d8c41>   DW_AT_decl_file   : 8
    <d8c42>   DW_AT_decl_line   : 59
    <d8c43>   DW_AT_decl_column : 15
    <d8c44>   DW_AT_type        : <0xd8c48>
 <1><d8c48>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8c49>   DW_AT_byte_size   : 8
    <d8c49>   DW_AT_type        : <0xd8c4d>
 <1><d8c4d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8c4e>   DW_AT_prototyped  : 1
    <d8c4e>   DW_AT_type        : <0xd8a14>
    <d8c52>   DW_AT_sibling     : <0xd8c5c>
 <2><d8c56>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8c57>   DW_AT_type        : <0xd8b73>
 <2><d8c5b>: Abbrev Number: 0
 <1><d8c5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8c5d>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <d8c61>   DW_AT_decl_file   : 8
    <d8c62>   DW_AT_decl_line   : 60
    <d8c63>   DW_AT_decl_column : 15
    <d8c64>   DW_AT_type        : <0xd8c48>
 <1><d8c68>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8c69>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <d8c6d>   DW_AT_decl_file   : 8
    <d8c6e>   DW_AT_decl_line   : 61
    <d8c6f>   DW_AT_decl_column : 15
    <d8c70>   DW_AT_type        : <0xd8c74>
 <1><d8c74>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8c75>   DW_AT_byte_size   : 8
    <d8c75>   DW_AT_type        : <0xd8c79>
 <1><d8c79>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8c7a>   DW_AT_prototyped  : 1
    <d8c7a>   DW_AT_type        : <0xd8a14>
    <d8c7e>   DW_AT_sibling     : <0xd8c92>
 <2><d8c82>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8c83>   DW_AT_type        : <0xd8b73>
 <2><d8c87>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8c88>   DW_AT_type        : <0xd8aac>
 <2><d8c8c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8c8d>   DW_AT_type        : <0xd8a14>
 <2><d8c91>: Abbrev Number: 0
 <1><d8c92>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8c93>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <d8c97>   DW_AT_decl_file   : 8
    <d8c98>   DW_AT_decl_line   : 62
    <d8c99>   DW_AT_decl_column : 15
    <d8c9a>   DW_AT_type        : <0xd8c9e>
 <1><d8c9e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8c9f>   DW_AT_byte_size   : 8
    <d8c9f>   DW_AT_type        : <0xd8ca3>
 <1><d8ca3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8ca4>   DW_AT_prototyped  : 1
    <d8ca4>   DW_AT_type        : <0xd8a14>
    <d8ca8>   DW_AT_sibling     : <0xd8cb7>
 <2><d8cac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8cad>   DW_AT_type        : <0xd8b73>
 <2><d8cb1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8cb2>   DW_AT_type        : <0xd8cb7>
 <2><d8cb6>: Abbrev Number: 0
 <1><d8cb7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8cb8>   DW_AT_byte_size   : 8
    <d8cb8>   DW_AT_type        : <0xd8aac>
 <1><d8cbc>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8cbd>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <d8cc1>   DW_AT_decl_file   : 8
    <d8cc2>   DW_AT_decl_line   : 63
    <d8cc3>   DW_AT_decl_column : 15
    <d8cc4>   DW_AT_type        : <0xd8cc8>
 <1><d8cc8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8cc9>   DW_AT_byte_size   : 8
    <d8cc9>   DW_AT_type        : <0xd8ccd>
 <1><d8ccd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d8cce>   DW_AT_prototyped  : 1
    <d8cce>   DW_AT_type        : <0xd8a14>
    <d8cd2>   DW_AT_sibling     : <0xd8ce6>
 <2><d8cd6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8cd7>   DW_AT_type        : <0xd8b73>
 <2><d8cdb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8cdc>   DW_AT_type        : <0xd8a2e>
 <2><d8ce0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d8ce1>   DW_AT_type        : <0xd8ce6>
 <2><d8ce5>: Abbrev Number: 0
 <1><d8ce6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d8ce7>   DW_AT_byte_size   : 8
    <d8ce7>   DW_AT_type        : <0xd8a48>
 <1><d8ceb>: Abbrev Number: 3 (DW_TAG_typedef)
