    <da484>   DW_AT_decl_file   : 1
    <da484>   DW_AT_decl_line   : 5
    <da484>   DW_AT_decl_column : 67
    <da485>   DW_AT_type        : <0xd9978>
    <da489>   DW_AT_location    : 0x40418 (location list)
    <da48d>   DW_AT_GNU_locviews: 0x40410
 <2><da491>: Abbrev Number: 39 (DW_TAG_variable)
    <da492>   DW_AT_name        : dst
    <da496>   DW_AT_decl_file   : 1
    <da497>   DW_AT_decl_line   : 7
    <da498>   DW_AT_decl_column : 16
    <da499>   DW_AT_type        : <0xd9cbe>
    <da49d>   DW_AT_location    : 0x4043a (location list)
    <da4a1>   DW_AT_GNU_locviews: 0x40432
 <2><da4a5>: Abbrev Number: 40 (DW_TAG_variable)
    <da4a6>   DW_AT_name        : (indirect string, offset: 0x1be2c): src_len
    <da4aa>   DW_AT_decl_file   : 1
    <da4ab>   DW_AT_decl_line   : 8
    <da4ac>   DW_AT_decl_column : 10
    <da4ad>   DW_AT_type        : <0xd9978>
    <da4b1>   DW_AT_location    : 0x40458 (location list)
    <da4b5>   DW_AT_GNU_locviews: 0x40456
 <2><da4b9>: Abbrev Number: 22 (DW_TAG_call_site)
    <da4ba>   DW_AT_call_return_pc: 0x477479
    <da4c2>   DW_AT_call_origin : <0xda41c>
    <da4c6>   DW_AT_sibling     : <0xda4d7>
 <3><da4ca>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <da4cb>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <da4cd>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><da4cf>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <da4d0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))

 <1><da545>: Abbrev Number: 6 (DW_TAG_base_type)
    <da546>   DW_AT_byte_size   : 1
    <da547>   DW_AT_encoding    : 8	(unsigned char)
    <da548>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><da54c>: Abbrev Number: 6 (DW_TAG_base_type)
    <da54d>   DW_AT_byte_size   : 2
    <da54e>   DW_AT_encoding    : 7	(unsigned)
    <da54f>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><da553>: Abbrev Number: 6 (DW_TAG_base_type)
    <da554>   DW_AT_byte_size   : 4
    <da555>   DW_AT_encoding    : 7	(unsigned)
    <da556>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><da55a>: Abbrev Number: 6 (DW_TAG_base_type)
    <da55b>   DW_AT_byte_size   : 8
    <da55c>   DW_AT_encoding    : 7	(unsigned)
    <da55d>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><da561>: Abbrev Number: 6 (DW_TAG_base_type)
    <da562>   DW_AT_byte_size   : 1
    <da563>   DW_AT_encoding    : 6	(signed char)
    <da564>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><da568>: Abbrev Number: 6 (DW_TAG_base_type)
    <da569>   DW_AT_byte_size   : 2
    <da56a>   DW_AT_encoding    : 5	(signed)
    <da56b>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><da56f>: Abbrev Number: 22 (DW_TAG_base_type)
    <da570>   DW_AT_byte_size   : 4
    <da571>   DW_AT_encoding    : 5	(signed)
    <da572>   DW_AT_name        : int
 <1><da576>: Abbrev Number: 6 (DW_TAG_base_type)
    <da577>   DW_AT_byte_size   : 8
    <da578>   DW_AT_encoding    : 5	(signed)
    <da579>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><da57d>: Abbrev Number: 3 (DW_TAG_typedef)
    <da57e>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <da582>   DW_AT_decl_file   : 2
    <da583>   DW_AT_decl_line   : 153
    <da584>   DW_AT_decl_column : 27
    <da585>   DW_AT_type        : <0xda576>
 <1><da589>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <da58a>   DW_AT_byte_size   : 8
 <1><da58b>: Abbrev Number: 3 (DW_TAG_typedef)
    <da58c>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <da590>   DW_AT_decl_file   : 2
    <da591>   DW_AT_decl_line   : 194
    <da592>   DW_AT_decl_column : 27
    <da593>   DW_AT_type        : <0xda576>
 <1><da597>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da598>   DW_AT_byte_size   : 8
    <da598>   DW_AT_type        : <0xda59c>
 <1><da59c>: Abbrev Number: 6 (DW_TAG_base_type)
    <da59d>   DW_AT_byte_size   : 1
    <da59e>   DW_AT_encoding    : 6	(signed char)
    <da59f>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><da5a3>: Abbrev Number: 3 (DW_TAG_typedef)
    <da5a4>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <da5a8>   DW_AT_decl_file   : 3
    <da5a9>   DW_AT_decl_line   : 209
    <da5aa>   DW_AT_decl_column : 23
    <da5ab>   DW_AT_type        : <0xda55a>
 <1><da5af>: Abbrev Number: 14 (DW_TAG_typedef)
    <da5b0>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <da5b4>   DW_AT_decl_file   : 3
    <da5b5>   DW_AT_decl_line   : 321
    <da5b7>   DW_AT_decl_column : 24
    <da5b8>   DW_AT_type        : <0xda56f>
 <1><da5bc>: Abbrev Number: 24 (DW_TAG_const_type)
    <da5bd>   DW_AT_type        : <0xda5af>
 <1><da5c1>: Abbrev Number: 6 (DW_TAG_base_type)
    <da5c2>   DW_AT_byte_size   : 8
    <da5c3>   DW_AT_encoding    : 5	(signed)
    <da5c4>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><da5c8>: Abbrev Number: 3 (DW_TAG_typedef)
    <da5c9>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <da5cd>   DW_AT_decl_file   : 4
    <da5ce>   DW_AT_decl_line   : 87
    <da5cf>   DW_AT_decl_column : 19
    <da5d0>   DW_AT_type        : <0xda57d>
 <1><da5d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <da5d5>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <da5d9>   DW_AT_decl_file   : 4
    <da5da>   DW_AT_decl_line   : 108
    <da5db>   DW_AT_decl_column : 19
    <da5dc>   DW_AT_type        : <0xda58b>
 <1><da5e0>: Abbrev Number: 6 (DW_TAG_base_type)
    <da5e1>   DW_AT_byte_size   : 8
    <da5e2>   DW_AT_encoding    : 7	(unsigned)
    <da5e3>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><da5e7>: Abbrev Number: 15 (DW_TAG_array_type)
    <da5e8>   DW_AT_type        : <0xda59c>
    <da5ec>   DW_AT_sibling     : <0xda5f7>
 <2><da5f0>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <da5f1>   DW_AT_type        : <0xda55a>
    <da5f5>   DW_AT_upper_bound : 3
 <2><da5f6>: Abbrev Number: 0
 <1><da5f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da5f8>   DW_AT_byte_size   : 8
    <da5f8>   DW_AT_type        : <0xda5fc>
 <1><da5fc>: Abbrev Number: 26 (DW_TAG_const_type)
 <1><da5fd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da5fe>   DW_AT_byte_size   : 8
    <da5fe>   DW_AT_type        : <0xda597>
 <1><da602>: Abbrev Number: 3 (DW_TAG_typedef)
    <da603>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <da607>   DW_AT_decl_file   : 5
    <da608>   DW_AT_decl_line   : 22
    <da609>   DW_AT_decl_column : 15
    <da60a>   DW_AT_type        : <0xda5c8>
 <1><da60e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da60f>   DW_AT_byte_size   : 8
    <da60f>   DW_AT_type        : <0xda613>
 <1><da613>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <da614>   DW_AT_prototyped  : 1
 <1><da614>: Abbrev Number: 8 (DW_TAG_structure_type)
    <da615>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <da619>   DW_AT_byte_size   : 24
    <da61a>   DW_AT_decl_file   : 6
    <da61b>   DW_AT_decl_line   : 82
    <da61c>   DW_AT_decl_column : 16
    <da61d>   DW_AT_sibling     : <0xda649>
 <2><da621>: Abbrev Number: 2 (DW_TAG_member)
    <da622>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <da626>   DW_AT_decl_file   : 6
    <da627>   DW_AT_decl_line   : 83
    <da628>   DW_AT_decl_column : 21
    <da629>   DW_AT_type        : <0xda597>
    <da62d>   DW_AT_data_member_location: 0
 <2><da62e>: Abbrev Number: 7 (DW_TAG_member)
    <da62f>   DW_AT_name        : len
    <da633>   DW_AT_decl_file   : 6
    <da634>   DW_AT_decl_line   : 84
    <da635>   DW_AT_decl_column : 21
    <da636>   DW_AT_type        : <0xda5d4>
    <da63a>   DW_AT_data_member_location: 8
 <2><da63b>: Abbrev Number: 2 (DW_TAG_member)
    <da63c>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <da640>   DW_AT_decl_file   : 6
    <da641>   DW_AT_decl_line   : 85
    <da642>   DW_AT_decl_column : 21
    <da643>   DW_AT_type        : <0xda5d4>
    <da647>   DW_AT_data_member_location: 16
 <2><da648>: Abbrev Number: 0
 <1><da649>: Abbrev Number: 3 (DW_TAG_typedef)
    <da64a>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <da64e>   DW_AT_decl_file   : 6
    <da64f>   DW_AT_decl_line   : 86
    <da650>   DW_AT_decl_column : 3
    <da651>   DW_AT_type        : <0xda614>
 <1><da655>: Abbrev Number: 6 (DW_TAG_base_type)
    <da656>   DW_AT_byte_size   : 8
    <da657>   DW_AT_encoding    : 4	(float)
    <da658>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><da65c>: Abbrev Number: 6 (DW_TAG_base_type)
    <da65d>   DW_AT_byte_size   : 4
    <da65e>   DW_AT_encoding    : 4	(float)
    <da65f>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><da663>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da664>   DW_AT_byte_size   : 8
    <da664>   DW_AT_type        : <0xda5af>
 <1><da668>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <da669>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <da66d>   DW_AT_encoding    : 7	(unsigned)
    <da66e>   DW_AT_byte_size   : 4
    <da66f>   DW_AT_type        : <0xda553>
    <da673>   DW_AT_decl_file   : 7
    <da674>   DW_AT_decl_line   : 25
    <da675>   DW_AT_decl_column : 14
    <da676>   DW_AT_sibling     : <0xda693>
 <2><da67a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da67b>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <da67f>   DW_AT_const_value : 0
 <2><da680>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da681>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <da685>   DW_AT_const_value : 1
 <2><da686>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da687>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <da68b>   DW_AT_const_value : 2
 <2><da68c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da68d>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <da691>   DW_AT_const_value : 3
 <2><da692>: Abbrev Number: 0
 <1><da693>: Abbrev Number: 3 (DW_TAG_typedef)
    <da694>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <da698>   DW_AT_decl_file   : 7
    <da699>   DW_AT_decl_line   : 30
    <da69a>   DW_AT_decl_column : 3
    <da69b>   DW_AT_type        : <0xda668>
 <1><da69f>: Abbrev Number: 3 (DW_TAG_typedef)
    <da6a0>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <da6a4>   DW_AT_decl_file   : 7
    <da6a5>   DW_AT_decl_line   : 54
    <da6a6>   DW_AT_decl_column : 15
    <da6a7>   DW_AT_type        : <0xda6ab>
 <1><da6ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da6ac>   DW_AT_byte_size   : 8
    <da6ac>   DW_AT_type        : <0xda6b0>
 <1><da6b0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da6b1>   DW_AT_prototyped  : 1
    <da6b1>   DW_AT_type        : <0xda56f>
    <da6b5>   DW_AT_sibling     : <0xda6c4>
 <2><da6b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da6ba>   DW_AT_type        : <0xda6c4>
 <2><da6be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da6bf>   DW_AT_type        : <0xda56f>
 <2><da6c3>: Abbrev Number: 0
 <1><da6c4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da6c5>   DW_AT_byte_size   : 8
    <da6c5>   DW_AT_type        : <0xda6c9>
 <1><da6c9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <da6ca>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <da6ce>   DW_AT_byte_size   : 80
    <da6cf>   DW_AT_decl_file   : 7
    <da6d0>   DW_AT_decl_line   : 97
    <da6d1>   DW_AT_decl_column : 16
    <da6d2>   DW_AT_sibling     : <0xda78d>
 <2><da6d6>: Abbrev Number: 2 (DW_TAG_member)
    <da6d7>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <da6db>   DW_AT_decl_file   : 7
    <da6dc>   DW_AT_decl_line   : 98
    <da6dd>   DW_AT_decl_column : 21
    <da6de>   DW_AT_type        : <0xda56f>
    <da6e2>   DW_AT_data_member_location: 0
 <2><da6e3>: Abbrev Number: 7 (DW_TAG_member)
    <da6e4>   DW_AT_name        : len
    <da6e8>   DW_AT_decl_file   : 7
    <da6e9>   DW_AT_decl_line   : 99
    <da6ea>   DW_AT_decl_column : 21
    <da6eb>   DW_AT_type        : <0xda56f>
    <da6ef>   DW_AT_data_member_location: 4
 <2><da6f0>: Abbrev Number: 2 (DW_TAG_member)
    <da6f1>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <da6f5>   DW_AT_decl_file   : 7
    <da6f6>   DW_AT_decl_line   : 100
    <da6f7>   DW_AT_decl_column : 21
    <da6f8>   DW_AT_type        : <0xda693>
    <da6fc>   DW_AT_data_member_location: 8
 <2><da6fd>: Abbrev Number: 2 (DW_TAG_member)
    <da6fe>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <da702>   DW_AT_decl_file   : 7
    <da703>   DW_AT_decl_line   : 101
    <da704>   DW_AT_decl_column : 21
    <da705>   DW_AT_type        : <0xda602>
    <da709>   DW_AT_data_member_location: 16
 <2><da70a>: Abbrev Number: 2 (DW_TAG_member)
    <da70b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <da70f>   DW_AT_decl_file   : 7
    <da710>   DW_AT_decl_line   : 102
    <da711>   DW_AT_decl_column : 21
    <da712>   DW_AT_type        : <0xda56f>
    <da716>   DW_AT_data_member_location: 24
 <2><da717>: Abbrev Number: 2 (DW_TAG_member)
    <da718>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <da71c>   DW_AT_decl_file   : 7
    <da71d>   DW_AT_decl_line   : 103
    <da71e>   DW_AT_decl_column : 21
    <da71f>   DW_AT_type        : <0xda56f>
    <da723>   DW_AT_data_member_location: 28
 <2><da724>: Abbrev Number: 2 (DW_TAG_member)
    <da725>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <da729>   DW_AT_decl_file   : 7
    <da72a>   DW_AT_decl_line   : 104
    <da72b>   DW_AT_decl_column : 21
    <da72c>   DW_AT_type        : <0xda56f>
    <da730>   DW_AT_data_member_location: 32
 <2><da731>: Abbrev Number: 2 (DW_TAG_member)
    <da732>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <da736>   DW_AT_decl_file   : 7
    <da737>   DW_AT_decl_line   : 105
    <da738>   DW_AT_decl_column : 21
    <da739>   DW_AT_type        : <0xda553>
    <da73d>   DW_AT_data_member_location: 36
 <2><da73e>: Abbrev Number: 2 (DW_TAG_member)
    <da73f>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <da743>   DW_AT_decl_file   : 7
    <da744>   DW_AT_decl_line   : 106
    <da745>   DW_AT_decl_column : 21
    <da746>   DW_AT_type        : <0xda553>
    <da74a>   DW_AT_data_member_location: 40
 <2><da74b>: Abbrev Number: 2 (DW_TAG_member)
    <da74c>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <da750>   DW_AT_decl_file   : 7
    <da751>   DW_AT_decl_line   : 109
    <da752>   DW_AT_decl_column : 21
    <da753>   DW_AT_type        : <0xda5e7>
    <da757>   DW_AT_data_member_location: 44
 <2><da758>: Abbrev Number: 2 (DW_TAG_member)
    <da759>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <da75d>   DW_AT_decl_file   : 7
    <da75e>   DW_AT_decl_line   : 110
    <da75f>   DW_AT_decl_column : 21
    <da760>   DW_AT_type        : <0xda5a3>
    <da764>   DW_AT_data_member_location: 48
 <2><da765>: Abbrev Number: 2 (DW_TAG_member)
    <da766>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <da76a>   DW_AT_decl_file   : 7
    <da76b>   DW_AT_decl_line   : 112
    <da76c>   DW_AT_decl_column : 22
    <da76d>   DW_AT_type        : <0xdaa25>
    <da771>   DW_AT_data_member_location: 56
 <2><da772>: Abbrev Number: 2 (DW_TAG_member)
    <da773>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <da777>   DW_AT_decl_file   : 7
    <da778>   DW_AT_decl_line   : 114
    <da779>   DW_AT_decl_column : 14
    <da77a>   DW_AT_type        : <0xda589>
    <da77e>   DW_AT_data_member_location: 64
 <2><da77f>: Abbrev Number: 2 (DW_TAG_member)
    <da780>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <da784>   DW_AT_decl_file   : 7
    <da785>   DW_AT_decl_line   : 116
    <da786>   DW_AT_decl_column : 22
    <da787>   DW_AT_type        : <0xda6c4>
    <da78b>   DW_AT_data_member_location: 72
 <2><da78c>: Abbrev Number: 0
 <1><da78d>: Abbrev Number: 3 (DW_TAG_typedef)
    <da78e>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <da792>   DW_AT_decl_file   : 7
    <da793>   DW_AT_decl_line   : 59
    <da794>   DW_AT_decl_column : 15
    <da795>   DW_AT_type        : <0xda799>
 <1><da799>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da79a>   DW_AT_byte_size   : 8
    <da79a>   DW_AT_type        : <0xda79e>
 <1><da79e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da79f>   DW_AT_prototyped  : 1
    <da79f>   DW_AT_type        : <0xda56f>
    <da7a3>   DW_AT_sibling     : <0xda7ad>
 <2><da7a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da7a8>   DW_AT_type        : <0xda6c4>
 <2><da7ac>: Abbrev Number: 0
 <1><da7ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <da7ae>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <da7b2>   DW_AT_decl_file   : 7
    <da7b3>   DW_AT_decl_line   : 60
    <da7b4>   DW_AT_decl_column : 15
    <da7b5>   DW_AT_type        : <0xda799>
 <1><da7b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <da7ba>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <da7be>   DW_AT_decl_file   : 7
    <da7bf>   DW_AT_decl_line   : 61
    <da7c0>   DW_AT_decl_column : 15
    <da7c1>   DW_AT_type        : <0xda7c5>
 <1><da7c5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da7c6>   DW_AT_byte_size   : 8
    <da7c6>   DW_AT_type        : <0xda7ca>
 <1><da7ca>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da7cb>   DW_AT_prototyped  : 1
    <da7cb>   DW_AT_type        : <0xda56f>
    <da7cf>   DW_AT_sibling     : <0xda7e3>
 <2><da7d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da7d4>   DW_AT_type        : <0xda6c4>
 <2><da7d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da7d9>   DW_AT_type        : <0xda602>
 <2><da7dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da7de>   DW_AT_type        : <0xda56f>
 <2><da7e2>: Abbrev Number: 0
 <1><da7e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <da7e4>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <da7e8>   DW_AT_decl_file   : 7
    <da7e9>   DW_AT_decl_line   : 62
    <da7ea>   DW_AT_decl_column : 15
    <da7eb>   DW_AT_type        : <0xda7ef>
 <1><da7ef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da7f0>   DW_AT_byte_size   : 8
    <da7f0>   DW_AT_type        : <0xda7f4>
 <1><da7f4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da7f5>   DW_AT_prototyped  : 1
    <da7f5>   DW_AT_type        : <0xda56f>
    <da7f9>   DW_AT_sibling     : <0xda808>
 <2><da7fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da7fe>   DW_AT_type        : <0xda6c4>
 <2><da802>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da803>   DW_AT_type        : <0xda808>
 <2><da807>: Abbrev Number: 0
 <1><da808>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da809>   DW_AT_byte_size   : 8
    <da809>   DW_AT_type        : <0xda602>
 <1><da80d>: Abbrev Number: 3 (DW_TAG_typedef)
    <da80e>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <da812>   DW_AT_decl_file   : 7
    <da813>   DW_AT_decl_line   : 63
    <da814>   DW_AT_decl_column : 15
    <da815>   DW_AT_type        : <0xda819>
 <1><da819>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da81a>   DW_AT_byte_size   : 8
    <da81a>   DW_AT_type        : <0xda81e>
 <1><da81e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da81f>   DW_AT_prototyped  : 1
    <da81f>   DW_AT_type        : <0xda56f>
    <da823>   DW_AT_sibling     : <0xda837>
 <2><da827>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da828>   DW_AT_type        : <0xda6c4>
 <2><da82c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da82d>   DW_AT_type        : <0xda589>
 <2><da831>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da832>   DW_AT_type        : <0xda837>
 <2><da836>: Abbrev Number: 0
 <1><da837>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da838>   DW_AT_byte_size   : 8
    <da838>   DW_AT_type        : <0xda5a3>
 <1><da83c>: Abbrev Number: 3 (DW_TAG_typedef)
    <da83d>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <da841>   DW_AT_decl_file   : 7
    <da842>   DW_AT_decl_line   : 65
    <da843>   DW_AT_decl_column : 15
    <da844>   DW_AT_type        : <0xda848>
 <1><da848>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da849>   DW_AT_byte_size   : 8
    <da849>   DW_AT_type        : <0xda84d>
 <1><da84d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da84e>   DW_AT_prototyped  : 1
    <da84e>   DW_AT_type        : <0xda56f>
    <da852>   DW_AT_sibling     : <0xda866>
 <2><da856>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da857>   DW_AT_type        : <0xda6c4>
 <2><da85b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da85c>   DW_AT_type        : <0xda663>
 <2><da860>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da861>   DW_AT_type        : <0xda837>
 <2><da865>: Abbrev Number: 0
 <1><da866>: Abbrev Number: 3 (DW_TAG_typedef)
    <da867>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <da86b>   DW_AT_decl_file   : 7
    <da86c>   DW_AT_decl_line   : 67
    <da86d>   DW_AT_decl_column : 15
    <da86e>   DW_AT_type        : <0xda872>
 <1><da872>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da873>   DW_AT_byte_size   : 8
    <da873>   DW_AT_type        : <0xda877>
 <1><da877>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da878>   DW_AT_prototyped  : 1
    <da878>   DW_AT_type        : <0xda56f>
    <da87c>   DW_AT_sibling     : <0xda890>
 <2><da880>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da881>   DW_AT_type        : <0xda6c4>
 <2><da885>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da886>   DW_AT_type        : <0xda5f7>
 <2><da88a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da88b>   DW_AT_type        : <0xda5a3>
 <2><da88f>: Abbrev Number: 0
 <1><da890>: Abbrev Number: 3 (DW_TAG_typedef)
    <da891>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <da895>   DW_AT_decl_file   : 7
    <da896>   DW_AT_decl_line   : 69
    <da897>   DW_AT_decl_column : 15
    <da898>   DW_AT_type        : <0xda89c>
 <1><da89c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da89d>   DW_AT_byte_size   : 8
    <da89d>   DW_AT_type        : <0xda8a1>
 <1><da8a1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da8a2>   DW_AT_prototyped  : 1
    <da8a2>   DW_AT_type        : <0xda56f>
    <da8a6>   DW_AT_sibling     : <0xda8ba>
 <2><da8aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8ab>   DW_AT_type        : <0xda6c4>
 <2><da8af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8b0>   DW_AT_type        : <0xda8ba>
 <2><da8b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8b5>   DW_AT_type        : <0xda5a3>
 <2><da8b9>: Abbrev Number: 0
 <1><da8ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da8bb>   DW_AT_byte_size   : 8
    <da8bb>   DW_AT_type        : <0xda5bc>
 <1><da8bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <da8c0>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <da8c4>   DW_AT_decl_file   : 7
    <da8c5>   DW_AT_decl_line   : 71
    <da8c6>   DW_AT_decl_column : 15
    <da8c7>   DW_AT_type        : <0xda8cb>
 <1><da8cb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da8cc>   DW_AT_byte_size   : 8
    <da8cc>   DW_AT_type        : <0xda8d0>
 <1><da8d0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da8d1>   DW_AT_prototyped  : 1
    <da8d1>   DW_AT_type        : <0xda56f>
    <da8d5>   DW_AT_sibling     : <0xda8e9>
 <2><da8d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8da>   DW_AT_type        : <0xda6c4>
 <2><da8de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8df>   DW_AT_type        : <0xda602>
 <2><da8e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da8e4>   DW_AT_type        : <0xda602>
 <2><da8e8>: Abbrev Number: 0
 <1><da8e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <da8ea>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <da8ee>   DW_AT_decl_file   : 7
    <da8ef>   DW_AT_decl_line   : 73
    <da8f0>   DW_AT_decl_column : 15
    <da8f1>   DW_AT_type        : <0xda8cb>
 <1><da8f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <da8f6>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <da8fa>   DW_AT_decl_file   : 7
    <da8fb>   DW_AT_decl_line   : 75
    <da8fc>   DW_AT_decl_column : 15
    <da8fd>   DW_AT_type        : <0xda901>
 <1><da901>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da902>   DW_AT_byte_size   : 8
    <da902>   DW_AT_type        : <0xda906>
 <1><da906>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da907>   DW_AT_prototyped  : 1
    <da907>   DW_AT_type        : <0xda56f>
    <da90b>   DW_AT_sibling     : <0xda91a>
 <2><da90f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da910>   DW_AT_type        : <0xda6c4>
 <2><da914>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da915>   DW_AT_type        : <0xda91a>
 <2><da919>: Abbrev Number: 0
 <1><da91a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da91b>   DW_AT_byte_size   : 8
    <da91b>   DW_AT_type        : <0xda649>
 <1><da91f>: Abbrev Number: 3 (DW_TAG_typedef)
    <da920>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <da924>   DW_AT_decl_file   : 7
    <da925>   DW_AT_decl_line   : 76
    <da926>   DW_AT_decl_column : 15
    <da927>   DW_AT_type        : <0xda92b>
 <1><da92b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da92c>   DW_AT_byte_size   : 8
    <da92c>   DW_AT_type        : <0xda930>
 <1><da930>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <da931>   DW_AT_prototyped  : 1
    <da931>   DW_AT_type        : <0xda56f>
    <da935>   DW_AT_sibling     : <0xda949>
 <2><da939>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da93a>   DW_AT_type        : <0xda6c4>
 <2><da93e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da93f>   DW_AT_type        : <0xda663>
 <2><da943>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <da944>   DW_AT_type        : <0xda5d4>
 <2><da948>: Abbrev Number: 0
 <1><da949>: Abbrev Number: 3 (DW_TAG_typedef)
    <da94a>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <da94e>   DW_AT_decl_file   : 7
    <da94f>   DW_AT_decl_line   : 77
    <da950>   DW_AT_decl_column : 15
    <da951>   DW_AT_type        : <0xda799>
 <1><da955>: Abbrev Number: 8 (DW_TAG_structure_type)
    <da956>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <da95a>   DW_AT_byte_size   : 112
    <da95b>   DW_AT_decl_file   : 7
    <da95c>   DW_AT_decl_line   : 80
    <da95d>   DW_AT_decl_column : 16
    <da95e>   DW_AT_sibling     : <0xdaa19>
 <2><da962>: Abbrev Number: 2 (DW_TAG_member)
    <da963>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <da967>   DW_AT_decl_file   : 7
    <da968>   DW_AT_decl_line   : 81
    <da969>   DW_AT_decl_column : 25
    <da96a>   DW_AT_type        : <0xda78d>
    <da96e>   DW_AT_data_member_location: 0
 <2><da96f>: Abbrev Number: 2 (DW_TAG_member)
    <da970>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <da974>   DW_AT_decl_file   : 7
    <da975>   DW_AT_decl_line   : 82
    <da976>   DW_AT_decl_column : 25
    <da977>   DW_AT_type        : <0xda7ad>
    <da97b>   DW_AT_data_member_location: 8
 <2><da97c>: Abbrev Number: 2 (DW_TAG_member)
    <da97d>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <da981>   DW_AT_decl_file   : 7
    <da982>   DW_AT_decl_line   : 83
    <da983>   DW_AT_decl_column : 25
    <da984>   DW_AT_type        : <0xda7b9>
    <da988>   DW_AT_data_member_location: 16
 <2><da989>: Abbrev Number: 2 (DW_TAG_member)
    <da98a>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <da98e>   DW_AT_decl_file   : 7
    <da98f>   DW_AT_decl_line   : 84
    <da990>   DW_AT_decl_column : 25
    <da991>   DW_AT_type        : <0xda7e3>
    <da995>   DW_AT_data_member_location: 24
 <2><da996>: Abbrev Number: 2 (DW_TAG_member)
    <da997>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <da99b>   DW_AT_decl_file   : 7
    <da99c>   DW_AT_decl_line   : 85
    <da99d>   DW_AT_decl_column : 25
    <da99e>   DW_AT_type        : <0xda80d>
    <da9a2>   DW_AT_data_member_location: 32
 <2><da9a3>: Abbrev Number: 2 (DW_TAG_member)
    <da9a4>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <da9a8>   DW_AT_decl_file   : 7
    <da9a9>   DW_AT_decl_line   : 86
    <da9aa>   DW_AT_decl_column : 25
    <da9ab>   DW_AT_type        : <0xda83c>
    <da9af>   DW_AT_data_member_location: 40
 <2><da9b0>: Abbrev Number: 2 (DW_TAG_member)
    <da9b1>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <da9b5>   DW_AT_decl_file   : 7
    <da9b6>   DW_AT_decl_line   : 87
    <da9b7>   DW_AT_decl_column : 25
    <da9b8>   DW_AT_type        : <0xda866>
    <da9bc>   DW_AT_data_member_location: 48
 <2><da9bd>: Abbrev Number: 2 (DW_TAG_member)
    <da9be>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <da9c2>   DW_AT_decl_file   : 7
    <da9c3>   DW_AT_decl_line   : 88
    <da9c4>   DW_AT_decl_column : 25
    <da9c5>   DW_AT_type        : <0xda890>
    <da9c9>   DW_AT_data_member_location: 56
 <2><da9ca>: Abbrev Number: 2 (DW_TAG_member)
    <da9cb>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <da9cf>   DW_AT_decl_file   : 7
    <da9d0>   DW_AT_decl_line   : 89
    <da9d1>   DW_AT_decl_column : 25
    <da9d2>   DW_AT_type        : <0xda8bf>
    <da9d6>   DW_AT_data_member_location: 64
 <2><da9d7>: Abbrev Number: 2 (DW_TAG_member)
    <da9d8>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <da9dc>   DW_AT_decl_file   : 7
    <da9dd>   DW_AT_decl_line   : 90
    <da9de>   DW_AT_decl_column : 25
    <da9df>   DW_AT_type        : <0xda8e9>
    <da9e3>   DW_AT_data_member_location: 72
 <2><da9e4>: Abbrev Number: 2 (DW_TAG_member)
    <da9e5>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <da9e9>   DW_AT_decl_file   : 7
    <da9ea>   DW_AT_decl_line   : 91
    <da9eb>   DW_AT_decl_column : 25
    <da9ec>   DW_AT_type        : <0xda8f5>
    <da9f0>   DW_AT_data_member_location: 80
 <2><da9f1>: Abbrev Number: 2 (DW_TAG_member)
    <da9f2>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <da9f6>   DW_AT_decl_file   : 7
    <da9f7>   DW_AT_decl_line   : 92
    <da9f8>   DW_AT_decl_column : 25
    <da9f9>   DW_AT_type        : <0xda91f>
    <da9fd>   DW_AT_data_member_location: 88
 <2><da9fe>: Abbrev Number: 2 (DW_TAG_member)
    <da9ff>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <daa03>   DW_AT_decl_file   : 7
    <daa04>   DW_AT_decl_line   : 93
    <daa05>   DW_AT_decl_column : 25
    <daa06>   DW_AT_type        : <0xda69f>
    <daa0a>   DW_AT_data_member_location: 96
 <2><daa0b>: Abbrev Number: 2 (DW_TAG_member)
    <daa0c>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <daa10>   DW_AT_decl_file   : 7
    <daa11>   DW_AT_decl_line   : 94
    <daa12>   DW_AT_decl_column : 25
    <daa13>   DW_AT_type        : <0xda949>
    <daa17>   DW_AT_data_member_location: 104
 <2><daa18>: Abbrev Number: 0
 <1><daa19>: Abbrev Number: 3 (DW_TAG_typedef)
    <daa1a>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <daa1e>   DW_AT_decl_file   : 7
    <daa1f>   DW_AT_decl_line   : 95
    <daa20>   DW_AT_decl_column : 3
    <daa21>   DW_AT_type        : <0xda955>
 <1><daa25>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <daa26>   DW_AT_byte_size   : 8
    <daa26>   DW_AT_type        : <0xdaa19>
 <1><daa2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <daa2b>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <daa2f>   DW_AT_decl_file   : 7
    <daa30>   DW_AT_decl_line   : 117
    <daa31>   DW_AT_decl_column : 3
    <daa32>   DW_AT_type        : <0xda6c9>
 <1><daa36>: Abbrev Number: 16 (DW_TAG_structure_type)
    <daa37>   DW_AT_byte_size   : 8
    <daa38>   DW_AT_decl_file   : 8
    <daa38>   DW_AT_decl_line   : 4
    <daa39>   DW_AT_decl_column : 3
    <daa39>   DW_AT_sibling     : <0xdaa58>
 <2><daa3d>: Abbrev Number: 2 (DW_TAG_member)
    <daa3e>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <daa42>   DW_AT_decl_file   : 8
    <daa43>   DW_AT_decl_line   : 5
    <daa44>   DW_AT_decl_column : 8
    <daa45>   DW_AT_type        : <0xda56f>
    <daa49>   DW_AT_data_member_location: 0
 <2><daa4a>: Abbrev Number: 2 (DW_TAG_member)
    <daa4b>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <daa4f>   DW_AT_decl_file   : 8
    <daa50>   DW_AT_decl_line   : 6
    <daa51>   DW_AT_decl_column : 8
    <daa52>   DW_AT_type        : <0xda56f>
    <daa56>   DW_AT_data_member_location: 4
 <2><daa57>: Abbrev Number: 0
 <1><daa58>: Abbrev Number: 16 (DW_TAG_structure_type)
    <daa59>   DW_AT_byte_size   : 16
    <daa5a>   DW_AT_decl_file   : 8
    <daa5a>   DW_AT_decl_line   : 8
    <daa5b>   DW_AT_decl_column : 3
    <daa5b>   DW_AT_sibling     : <0xdaa8e>
 <2><daa5f>: Abbrev Number: 7 (DW_TAG_member)
    <daa60>   DW_AT_name        : x
    <daa62>   DW_AT_decl_file   : 8
    <daa63>   DW_AT_decl_line   : 9
    <daa64>   DW_AT_decl_column : 8
    <daa65>   DW_AT_type        : <0xda56f>
    <daa69>   DW_AT_data_member_location: 0
 <2><daa6a>: Abbrev Number: 7 (DW_TAG_member)
    <daa6b>   DW_AT_name        : y
    <daa6d>   DW_AT_decl_file   : 8
    <daa6e>   DW_AT_decl_line   : 9
    <daa6f>   DW_AT_decl_column : 11
    <daa70>   DW_AT_type        : <0xda56f>
    <daa74>   DW_AT_data_member_location: 4
 <2><daa75>: Abbrev Number: 7 (DW_TAG_member)
    <daa76>   DW_AT_name        : dx
    <daa79>   DW_AT_decl_file   : 8
    <daa7a>   DW_AT_decl_line   : 10
    <daa7b>   DW_AT_decl_column : 8
    <daa7c>   DW_AT_type        : <0xda56f>
    <daa80>   DW_AT_data_member_location: 8
 <2><daa81>: Abbrev Number: 7 (DW_TAG_member)
    <daa82>   DW_AT_name        : dy
    <daa85>   DW_AT_decl_file   : 8
    <daa86>   DW_AT_decl_line   : 10
    <daa87>   DW_AT_decl_column : 12
    <daa88>   DW_AT_type        : <0xda56f>
    <daa8c>   DW_AT_data_member_location: 12
 <2><daa8d>: Abbrev Number: 0
 <1><daa8e>: Abbrev Number: 29 (DW_TAG_union_type)
    <daa8f>   DW_AT_byte_size   : 16
    <daa90>   DW_AT_decl_file   : 8
    <daa91>   DW_AT_decl_line   : 3
    <daa92>   DW_AT_decl_column : 2
    <daa93>   DW_AT_sibling     : <0xdaabe>
 <2><daa97>: Abbrev Number: 17 (DW_TAG_member)
    <daa98>   DW_AT_type        : <0xdaa36>
 <2><daa9c>: Abbrev Number: 17 (DW_TAG_member)
    <daa9d>   DW_AT_type        : <0xdaa58>
 <2><daaa1>: Abbrev Number: 30 (DW_TAG_member)
    <daaa2>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <daaa6>   DW_AT_decl_file   : 8
    <daaa7>   DW_AT_decl_line   : 12
    <daaa8>   DW_AT_decl_column : 7
    <daaa9>   DW_AT_type        : <0xda56f>
 <2><daaad>: Abbrev Number: 18 (DW_TAG_member)
    <daaae>   DW_AT_name        : z
    <daab0>   DW_AT_decl_file   : 8
    <daab0>   DW_AT_decl_line   : 13
    <daab1>   DW_AT_decl_column : 7
    <daab1>   DW_AT_type        : <0xda56f>
 <2><daab5>: Abbrev Number: 18 (DW_TAG_member)
    <daab6>   DW_AT_name        : w
    <daab8>   DW_AT_decl_file   : 8
    <daab8>   DW_AT_decl_line   : 14
    <daab9>   DW_AT_decl_column : 7
    <daab9>   DW_AT_type        : <0xda56f>
 <2><daabd>: Abbrev Number: 0
 <1><daabe>: Abbrev Number: 8 (DW_TAG_structure_type)
    <daabf>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <daac3>   DW_AT_byte_size   : 20
    <daac4>   DW_AT_decl_file   : 8
    <daac5>   DW_AT_decl_line   : 1
    <daac6>   DW_AT_decl_column : 8
    <daac7>   DW_AT_sibling     : <0xdaadf>
 <2><daacb>: Abbrev Number: 2 (DW_TAG_member)
    <daacc>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <daad0>   DW_AT_decl_file   : 8
    <daad1>   DW_AT_decl_line   : 2
    <daad2>   DW_AT_decl_column : 6
    <daad3>   DW_AT_type        : <0xda56f>
    <daad7>   DW_AT_data_member_location: 0
 <2><daad8>: Abbrev Number: 31 (DW_TAG_member)
    <daad9>   DW_AT_type        : <0xdaa8e>
    <daadd>   DW_AT_data_member_location: 4
 <2><daade>: Abbrev Number: 0
 <1><daadf>: Abbrev Number: 3 (DW_TAG_typedef)
    <daae0>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <daae4>   DW_AT_decl_file   : 8
    <daae5>   DW_AT_decl_line   : 18
    <daae6>   DW_AT_decl_column : 23
    <daae7>   DW_AT_type        : <0xdaabe>
 <1><daaeb>: Abbrev Number: 3 (DW_TAG_typedef)
    <daaec>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <daaf0>   DW_AT_decl_file   : 9
    <daaf1>   DW_AT_decl_line   : 1
    <daaf2>   DW_AT_decl_column : 23
    <daaf3>   DW_AT_type        : <0xdaaf7>
 <1><daaf7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <daaf8>   DW_AT_byte_size   : 8
    <daaf8>   DW_AT_type        : <0xdaafc>
 <1><daafc>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <daafd>   DW_AT_prototyped  : 1
    <daafd>   DW_AT_type        : <0xda91a>
 <1><dab01>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab02>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <dab06>   DW_AT_decl_file   : 9
    <dab07>   DW_AT_decl_line   : 2
    <dab08>   DW_AT_decl_column : 23
    <dab09>   DW_AT_type        : <0xdab0d>
 <1><dab0d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dab0e>   DW_AT_byte_size   : 8
    <dab0e>   DW_AT_type        : <0xdab12>
 <1><dab12>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <dab13>   DW_AT_prototyped  : 1
    <dab13>   DW_AT_type        : <0xda56f>
 <1><dab17>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab18>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <dab1c>   DW_AT_decl_file   : 9
    <dab1d>   DW_AT_decl_line   : 3
    <dab1e>   DW_AT_decl_column : 23
    <dab1f>   DW_AT_type        : <0xdab0d>
 <1><dab23>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab24>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <dab28>   DW_AT_decl_file   : 9
    <dab29>   DW_AT_decl_line   : 10
    <dab2a>   DW_AT_decl_column : 23
    <dab2b>   DW_AT_type        : <0xdab2f>
 <1><dab2f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dab30>   DW_AT_byte_size   : 8
    <dab30>   DW_AT_type        : <0xdab34>
 <1><dab34>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dab35>   DW_AT_prototyped  : 1
    <dab35>   DW_AT_sibling     : <0xdab3f>
 <2><dab39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dab3a>   DW_AT_type        : <0xda56f>
 <2><dab3e>: Abbrev Number: 0
 <1><dab3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab40>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <dab44>   DW_AT_decl_file   : 9
    <dab45>   DW_AT_decl_line   : 14
    <dab46>   DW_AT_decl_column : 23
    <dab47>   DW_AT_type        : <0xdab4b>
 <1><dab4b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dab4c>   DW_AT_byte_size   : 8
    <dab4c>   DW_AT_type        : <0xdab50>
 <1><dab50>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dab51>   DW_AT_prototyped  : 1
    <dab51>   DW_AT_type        : <0xda56f>
    <dab55>   DW_AT_sibling     : <0xdab69>
 <2><dab59>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dab5a>   DW_AT_type        : <0xda56f>
 <2><dab5e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dab5f>   DW_AT_type        : <0xda56f>
 <2><dab63>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dab64>   DW_AT_type        : <0xda56f>
 <2><dab68>: Abbrev Number: 0
 <1><dab69>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab6a>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <dab6e>   DW_AT_decl_file   : 9
    <dab6f>   DW_AT_decl_line   : 18
    <dab70>   DW_AT_decl_column : 23
    <dab71>   DW_AT_type        : <0xdab4b>
 <1><dab75>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab76>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <dab7a>   DW_AT_decl_file   : 9
    <dab7b>   DW_AT_decl_line   : 24
    <dab7c>   DW_AT_decl_column : 23
    <dab7d>   DW_AT_type        : <0xda60e>
 <1><dab81>: Abbrev Number: 3 (DW_TAG_typedef)
    <dab82>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <dab86>   DW_AT_decl_file   : 9
    <dab87>   DW_AT_decl_line   : 28
    <dab88>   DW_AT_decl_column : 23
    <dab89>   DW_AT_type        : <0xdab8d>
 <1><dab8d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dab8e>   DW_AT_byte_size   : 8
    <dab8e>   DW_AT_type        : <0xdab92>
 <1><dab92>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dab93>   DW_AT_prototyped  : 1
    <dab93>   DW_AT_type        : <0xda56f>
    <dab97>   DW_AT_sibling     : <0xdaba6>
 <2><dab9b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dab9c>   DW_AT_type        : <0xda56f>
 <2><daba0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <daba1>   DW_AT_type        : <0xda56f>
 <2><daba5>: Abbrev Number: 0
 <1><daba6>: Abbrev Number: 3 (DW_TAG_typedef)
    <daba7>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <dabab>   DW_AT_decl_file   : 9
    <dabac>   DW_AT_decl_line   : 34
    <dabad>   DW_AT_decl_column : 23
    <dabae>   DW_AT_type        : <0xdab0d>
 <1><dabb2>: Abbrev Number: 3 (DW_TAG_typedef)
    <dabb3>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <dabb7>   DW_AT_decl_file   : 9
    <dabb8>   DW_AT_decl_line   : 35
    <dabb9>   DW_AT_decl_column : 23
    <dabba>   DW_AT_type        : <0xdab0d>
 <1><dabbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <dabbf>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <dabc3>   DW_AT_decl_file   : 9
    <dabc4>   DW_AT_decl_line   : 36
    <dabc5>   DW_AT_decl_column : 23
    <dabc6>   DW_AT_type        : <0xdabca>
 <1><dabca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dabcb>   DW_AT_byte_size   : 8
    <dabcb>   DW_AT_type        : <0xdabcf>
 <1><dabcf>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dabd0>   DW_AT_prototyped  : 1
    <dabd0>   DW_AT_sibling     : <0xdabdf>
 <2><dabd4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dabd5>   DW_AT_type        : <0xdabdf>
 <2><dabd9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dabda>   DW_AT_type        : <0xdabdf>
 <2><dabde>: Abbrev Number: 0
 <1><dabdf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dabe0>   DW_AT_byte_size   : 8
    <dabe0>   DW_AT_type        : <0xda56f>
 <1><dabe4>: Abbrev Number: 3 (DW_TAG_typedef)
    <dabe5>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <dabe9>   DW_AT_decl_file   : 9
    <dabea>   DW_AT_decl_line   : 37
    <dabeb>   DW_AT_decl_column : 23
    <dabec>   DW_AT_type        : <0xdabca>
 <1><dabf0>: Abbrev Number: 3 (DW_TAG_typedef)
    <dabf1>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <dabf5>   DW_AT_decl_file   : 9
    <dabf6>   DW_AT_decl_line   : 45
    <dabf7>   DW_AT_decl_column : 24
    <dabf8>   DW_AT_type        : <0xdabfc>
 <1><dabfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dabfd>   DW_AT_byte_size   : 8
    <dabfd>   DW_AT_type        : <0xdac01>
 <1><dac01>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dac02>   DW_AT_prototyped  : 1
    <dac02>   DW_AT_type        : <0xda553>
    <dac06>   DW_AT_sibling     : <0xdac1a>
 <2><dac0a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac0b>   DW_AT_type        : <0xda56f>
 <2><dac0f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac10>   DW_AT_type        : <0xda56f>
 <2><dac14>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac15>   DW_AT_type        : <0xda56f>
 <2><dac19>: Abbrev Number: 0
 <1><dac1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <dac1b>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <dac1f>   DW_AT_decl_file   : 9
    <dac20>   DW_AT_decl_line   : 48
    <dac21>   DW_AT_decl_column : 23
    <dac22>   DW_AT_type        : <0xdac26>
 <1><dac26>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dac27>   DW_AT_byte_size   : 8
    <dac27>   DW_AT_type        : <0xdac2b>
 <1><dac2b>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dac2c>   DW_AT_prototyped  : 1
    <dac2c>   DW_AT_sibling     : <0xdac40>
 <2><dac30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac31>   DW_AT_type        : <0xda5f7>
 <2><dac35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac36>   DW_AT_type        : <0xda5a3>
 <2><dac3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac3b>   DW_AT_type        : <0xda56f>
 <2><dac3f>: Abbrev Number: 0
 <1><dac40>: Abbrev Number: 3 (DW_TAG_typedef)
    <dac41>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <dac45>   DW_AT_decl_file   : 9
    <dac46>   DW_AT_decl_line   : 49
    <dac47>   DW_AT_decl_column : 23
    <dac48>   DW_AT_type        : <0xdac4c>
 <1><dac4c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dac4d>   DW_AT_byte_size   : 8
    <dac4d>   DW_AT_type        : <0xdac51>
 <1><dac51>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dac52>   DW_AT_prototyped  : 1
    <dac52>   DW_AT_sibling     : <0xdac66>
 <2><dac56>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac57>   DW_AT_type        : <0xda8ba>
 <2><dac5b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac5c>   DW_AT_type        : <0xda5a3>
 <2><dac60>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac61>   DW_AT_type        : <0xda56f>
 <2><dac65>: Abbrev Number: 0
 <1><dac66>: Abbrev Number: 3 (DW_TAG_typedef)
    <dac67>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <dac6b>   DW_AT_decl_file   : 9
    <dac6c>   DW_AT_decl_line   : 51
    <dac6d>   DW_AT_decl_column : 24
    <dac6e>   DW_AT_type        : <0xdac72>
 <1><dac72>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dac73>   DW_AT_byte_size   : 8
    <dac73>   DW_AT_type        : <0xdac77>
 <1><dac77>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dac78>   DW_AT_prototyped  : 1
    <dac78>   DW_AT_type        : <0xda597>
    <dac7c>   DW_AT_sibling     : <0xdac8b>
 <2><dac80>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac81>   DW_AT_type        : <0xda597>
 <2><dac85>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dac86>   DW_AT_type        : <0xda5d4>
 <2><dac8a>: Abbrev Number: 0
 <1><dac8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dac8c>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <dac90>   DW_AT_decl_file   : 9
    <dac91>   DW_AT_decl_line   : 54
    <dac92>   DW_AT_decl_column : 23
    <dac93>   DW_AT_type        : <0xdac97>
 <1><dac97>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dac98>   DW_AT_byte_size   : 8
    <dac98>   DW_AT_type        : <0xdac9c>
 <1><dac9c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dac9d>   DW_AT_prototyped  : 1
    <dac9d>   DW_AT_type        : <0xda56f>
    <daca1>   DW_AT_sibling     : <0xdacc4>
 <2><daca5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <daca6>   DW_AT_type        : <0xda91a>
 <2><dacaa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacab>   DW_AT_type        : <0xda589>
 <2><dacaf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacb0>   DW_AT_type        : <0xda5d4>
 <2><dacb4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacb5>   DW_AT_type        : <0xda56f>
 <2><dacb9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacba>   DW_AT_type        : <0xda56f>
 <2><dacbe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacbf>   DW_AT_type        : <0xda56f>
 <2><dacc3>: Abbrev Number: 0
 <1><dacc4>: Abbrev Number: 3 (DW_TAG_typedef)
    <dacc5>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <dacc9>   DW_AT_decl_file   : 9
    <dacca>   DW_AT_decl_line   : 56
    <daccb>   DW_AT_decl_column : 23
    <daccc>   DW_AT_type        : <0xdacd0>
 <1><dacd0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dacd1>   DW_AT_byte_size   : 8
    <dacd1>   DW_AT_type        : <0xdacd5>
 <1><dacd5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dacd6>   DW_AT_prototyped  : 1
    <dacd6>   DW_AT_type        : <0xda56f>
    <dacda>   DW_AT_sibling     : <0xdacf8>
 <2><dacde>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacdf>   DW_AT_type        : <0xda8ba>
 <2><dace3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dace4>   DW_AT_type        : <0xda663>
 <2><dace8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dace9>   DW_AT_type        : <0xda5d4>
 <2><daced>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacee>   DW_AT_type        : <0xda56f>
 <2><dacf2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dacf3>   DW_AT_type        : <0xda56f>
 <2><dacf7>: Abbrev Number: 0
 <1><dacf8>: Abbrev Number: 3 (DW_TAG_typedef)
    <dacf9>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <dacfd>   DW_AT_decl_file   : 9
    <dacfe>   DW_AT_decl_line   : 67
    <dacff>   DW_AT_decl_column : 23
    <dad00>   DW_AT_type        : <0xdad04>
 <1><dad04>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dad05>   DW_AT_byte_size   : 8
    <dad05>   DW_AT_type        : <0xdad09>
 <1><dad09>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dad0a>   DW_AT_prototyped  : 1
    <dad0a>   DW_AT_type        : <0xda56f>
    <dad0e>   DW_AT_sibling     : <0xdad18>
 <2><dad12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad13>   DW_AT_type        : <0xda56f>
 <2><dad17>: Abbrev Number: 0
 <1><dad18>: Abbrev Number: 3 (DW_TAG_typedef)
    <dad19>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <dad1d>   DW_AT_decl_file   : 9
    <dad1e>   DW_AT_decl_line   : 68
    <dad1f>   DW_AT_decl_column : 23
    <dad20>   DW_AT_type        : <0xdad24>
 <1><dad24>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dad25>   DW_AT_byte_size   : 8
    <dad25>   DW_AT_type        : <0xdad29>
 <1><dad29>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dad2a>   DW_AT_prototyped  : 1
    <dad2a>   DW_AT_type        : <0xda56f>
    <dad2e>   DW_AT_sibling     : <0xdad4c>
 <2><dad32>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad33>   DW_AT_type        : <0xdabdf>
 <2><dad37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad38>   DW_AT_type        : <0xdabdf>
 <2><dad3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad3d>   DW_AT_type        : <0xdabdf>
 <2><dad41>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad42>   DW_AT_type        : <0xdabdf>
 <2><dad46>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad47>   DW_AT_type        : <0xdabdf>
 <2><dad4b>: Abbrev Number: 0
 <1><dad4c>: Abbrev Number: 3 (DW_TAG_typedef)
    <dad4d>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <dad51>   DW_AT_decl_file   : 9
    <dad52>   DW_AT_decl_line   : 69
    <dad53>   DW_AT_decl_column : 23
    <dad54>   DW_AT_type        : <0xdad58>
 <1><dad58>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dad59>   DW_AT_byte_size   : 8
    <dad59>   DW_AT_type        : <0xdad5d>
 <1><dad5d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dad5e>   DW_AT_prototyped  : 1
    <dad5e>   DW_AT_type        : <0xda56f>
    <dad62>   DW_AT_sibling     : <0xdad7b>
 <2><dad66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad67>   DW_AT_type        : <0xda56f>
 <2><dad6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad6c>   DW_AT_type        : <0xda56f>
 <2><dad70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad71>   DW_AT_type        : <0xda56f>
 <2><dad75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad76>   DW_AT_type        : <0xda56f>
 <2><dad7a>: Abbrev Number: 0
 <1><dad7b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dad7c>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <dad80>   DW_AT_decl_file   : 9
    <dad81>   DW_AT_decl_line   : 73
    <dad82>   DW_AT_decl_column : 23
    <dad83>   DW_AT_type        : <0xdad87>
 <1><dad87>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dad88>   DW_AT_byte_size   : 8
    <dad88>   DW_AT_type        : <0xdad8c>
 <1><dad8c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dad8d>   DW_AT_prototyped  : 1
    <dad8d>   DW_AT_type        : <0xda56f>
    <dad91>   DW_AT_sibling     : <0xdad9b>
 <2><dad95>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dad96>   DW_AT_type        : <0xda54c>
 <2><dad9a>: Abbrev Number: 0
 <1><dad9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dad9c>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <dada0>   DW_AT_decl_file   : 9
    <dada1>   DW_AT_decl_line   : 74
    <dada2>   DW_AT_decl_column : 23
    <dada3>   DW_AT_type        : <0xdada7>
 <1><dada7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dada8>   DW_AT_byte_size   : 8
    <dada8>   DW_AT_type        : <0xdadac>
 <1><dadac>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dadad>   DW_AT_prototyped  : 1
    <dadad>   DW_AT_type        : <0xda56f>
    <dadb1>   DW_AT_sibling     : <0xdadc0>
 <2><dadb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dadb6>   DW_AT_type        : <0xda54c>
 <2><dadba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dadbb>   DW_AT_type        : <0xda545>
 <2><dadbf>: Abbrev Number: 0
 <1><dadc0>: Abbrev Number: 3 (DW_TAG_typedef)
    <dadc1>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <dadc5>   DW_AT_decl_file   : 9
    <dadc6>   DW_AT_decl_line   : 80
    <dadc7>   DW_AT_decl_column : 23
    <dadc8>   DW_AT_type        : <0xdab2f>
 <1><dadcc>: Abbrev Number: 3 (DW_TAG_typedef)
    <dadcd>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <dadd1>   DW_AT_decl_file   : 9
    <dadd2>   DW_AT_decl_line   : 83
    <dadd3>   DW_AT_decl_column : 23
    <dadd4>   DW_AT_type        : <0xdad04>
 <1><dadd8>: Abbrev Number: 3 (DW_TAG_typedef)
    <dadd9>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <daddd>   DW_AT_decl_file   : 9
    <dadde>   DW_AT_decl_line   : 86
    <daddf>   DW_AT_decl_column : 23
    <dade0>   DW_AT_type        : <0xdab8d>
 <1><dade4>: Abbrev Number: 3 (DW_TAG_typedef)
    <dade5>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <dade9>   DW_AT_decl_file   : 9
    <dadea>   DW_AT_decl_line   : 89
    <dadeb>   DW_AT_decl_column : 23
    <dadec>   DW_AT_type        : <0xdab8d>
 <1><dadf0>: Abbrev Number: 3 (DW_TAG_typedef)
    <dadf1>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <dadf5>   DW_AT_decl_file   : 9
    <dadf6>   DW_AT_decl_line   : 91
    <dadf7>   DW_AT_decl_column : 23
    <dadf8>   DW_AT_type        : <0xdadfc>
 <1><dadfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dadfd>   DW_AT_byte_size   : 8
    <dadfd>   DW_AT_type        : <0xdae01>
 <1><dae01>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dae02>   DW_AT_prototyped  : 1
    <dae02>   DW_AT_sibling     : <0xdae0c>
 <2><dae06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dae07>   DW_AT_type        : <0xdae0c>
 <2><dae0b>: Abbrev Number: 0
 <1><dae0c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dae0d>   DW_AT_byte_size   : 8
    <dae0d>   DW_AT_type        : <0xdaadf>
 <1><dae11>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dae12>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <dae16>   DW_AT_byte_size   : 224
    <dae17>   DW_AT_decl_file   : 9
    <dae18>   DW_AT_decl_line   : 93
    <dae19>   DW_AT_decl_column : 16
    <dae1a>   DW_AT_sibling     : <0xdaf8b>
 <2><dae1e>: Abbrev Number: 2 (DW_TAG_member)
    <dae1f>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <dae23>   DW_AT_decl_file   : 9
    <dae24>   DW_AT_decl_line   : 94
    <dae25>   DW_AT_decl_column : 23
    <dae26>   DW_AT_type        : <0xdaaeb>
    <dae2a>   DW_AT_data_member_location: 0
 <2><dae2b>: Abbrev Number: 2 (DW_TAG_member)
    <dae2c>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <dae30>   DW_AT_decl_file   : 9
    <dae31>   DW_AT_decl_line   : 95
    <dae32>   DW_AT_decl_column : 23
    <dae33>   DW_AT_type        : <0xdab01>
    <dae37>   DW_AT_data_member_location: 8
 <2><dae38>: Abbrev Number: 2 (DW_TAG_member)
    <dae39>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <dae3d>   DW_AT_decl_file   : 9
    <dae3e>   DW_AT_decl_line   : 96
    <dae3f>   DW_AT_decl_column : 23
    <dae40>   DW_AT_type        : <0xdab17>
    <dae44>   DW_AT_data_member_location: 16
 <2><dae45>: Abbrev Number: 2 (DW_TAG_member)
    <dae46>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <dae4a>   DW_AT_decl_file   : 9
    <dae4b>   DW_AT_decl_line   : 97
    <dae4c>   DW_AT_decl_column : 23
    <dae4d>   DW_AT_type        : <0xdab23>
    <dae51>   DW_AT_data_member_location: 24
 <2><dae52>: Abbrev Number: 2 (DW_TAG_member)
    <dae53>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <dae57>   DW_AT_decl_file   : 9
    <dae58>   DW_AT_decl_line   : 98
    <dae59>   DW_AT_decl_column : 23
    <dae5a>   DW_AT_type        : <0xdab3f>
    <dae5e>   DW_AT_data_member_location: 32
 <2><dae5f>: Abbrev Number: 2 (DW_TAG_member)
    <dae60>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <dae64>   DW_AT_decl_file   : 9
    <dae65>   DW_AT_decl_line   : 99
    <dae66>   DW_AT_decl_column : 23
    <dae67>   DW_AT_type        : <0xdab69>
    <dae6b>   DW_AT_data_member_location: 40
 <2><dae6c>: Abbrev Number: 2 (DW_TAG_member)
    <dae6d>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <dae71>   DW_AT_decl_file   : 9
    <dae72>   DW_AT_decl_line   : 100
    <dae73>   DW_AT_decl_column : 23
    <dae74>   DW_AT_type        : <0xdab81>
    <dae78>   DW_AT_data_member_location: 48
 <2><dae79>: Abbrev Number: 2 (DW_TAG_member)
    <dae7a>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <dae7e>   DW_AT_decl_file   : 9
    <dae7f>   DW_AT_decl_line   : 101
    <dae80>   DW_AT_decl_column : 23
    <dae81>   DW_AT_type        : <0xdaba6>
    <dae85>   DW_AT_data_member_location: 56
 <2><dae86>: Abbrev Number: 2 (DW_TAG_member)
    <dae87>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <dae8b>   DW_AT_decl_file   : 9
    <dae8c>   DW_AT_decl_line   : 102
    <dae8d>   DW_AT_decl_column : 23
    <dae8e>   DW_AT_type        : <0xdabb2>
    <dae92>   DW_AT_data_member_location: 64
 <2><dae93>: Abbrev Number: 2 (DW_TAG_member)
    <dae94>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <dae98>   DW_AT_decl_file   : 9
    <dae99>   DW_AT_decl_line   : 103
    <dae9a>   DW_AT_decl_column : 23
    <dae9b>   DW_AT_type        : <0xdabbe>
    <dae9f>   DW_AT_data_member_location: 72
 <2><daea0>: Abbrev Number: 2 (DW_TAG_member)
    <daea1>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <daea5>   DW_AT_decl_file   : 9
    <daea6>   DW_AT_decl_line   : 104
    <daea7>   DW_AT_decl_column : 23
    <daea8>   DW_AT_type        : <0xdabe4>
    <daeac>   DW_AT_data_member_location: 80
 <2><daead>: Abbrev Number: 2 (DW_TAG_member)
    <daeae>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <daeb2>   DW_AT_decl_file   : 9
    <daeb3>   DW_AT_decl_line   : 105
    <daeb4>   DW_AT_decl_column : 24
    <daeb5>   DW_AT_type        : <0xdac1a>
    <daeb9>   DW_AT_data_member_location: 88
 <2><daeba>: Abbrev Number: 2 (DW_TAG_member)
    <daebb>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <daebf>   DW_AT_decl_file   : 9
    <daec0>   DW_AT_decl_line   : 106
    <daec1>   DW_AT_decl_column : 25
    <daec2>   DW_AT_type        : <0xdac40>
    <daec6>   DW_AT_data_member_location: 96
 <2><daec7>: Abbrev Number: 2 (DW_TAG_member)
    <daec8>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <daecc>   DW_AT_decl_file   : 9
    <daecd>   DW_AT_decl_line   : 107
    <daece>   DW_AT_decl_column : 23
    <daecf>   DW_AT_type        : <0xdac66>
    <daed3>   DW_AT_data_member_location: 104
 <2><daed4>: Abbrev Number: 2 (DW_TAG_member)
    <daed5>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <daed9>   DW_AT_decl_file   : 9
    <daeda>   DW_AT_decl_line   : 108
    <daedb>   DW_AT_decl_column : 23
    <daedc>   DW_AT_type        : <0xdacf8>
    <daee0>   DW_AT_data_member_location: 112
 <2><daee1>: Abbrev Number: 2 (DW_TAG_member)
    <daee2>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <daee6>   DW_AT_decl_file   : 9
    <daee7>   DW_AT_decl_line   : 109
    <daee8>   DW_AT_decl_column : 23
    <daee9>   DW_AT_type        : <0xdad18>
    <daeed>   DW_AT_data_member_location: 120
 <2><daeee>: Abbrev Number: 2 (DW_TAG_member)
    <daeef>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <daef3>   DW_AT_decl_file   : 9
    <daef4>   DW_AT_decl_line   : 110
    <daef5>   DW_AT_decl_column : 23
    <daef6>   DW_AT_type        : <0xdad4c>
    <daefa>   DW_AT_data_member_location: 128
 <2><daefb>: Abbrev Number: 2 (DW_TAG_member)
    <daefc>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <daf00>   DW_AT_decl_file   : 9
    <daf01>   DW_AT_decl_line   : 111
    <daf02>   DW_AT_decl_column : 23
    <daf03>   DW_AT_type        : <0xdad7b>
    <daf07>   DW_AT_data_member_location: 136
 <2><daf08>: Abbrev Number: 2 (DW_TAG_member)
    <daf09>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <daf0d>   DW_AT_decl_file   : 9
    <daf0e>   DW_AT_decl_line   : 112
    <daf0f>   DW_AT_decl_column : 23
    <daf10>   DW_AT_type        : <0xdad9b>
    <daf14>   DW_AT_data_member_location: 144
 <2><daf15>: Abbrev Number: 2 (DW_TAG_member)
    <daf16>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <daf1a>   DW_AT_decl_file   : 9
    <daf1b>   DW_AT_decl_line   : 113
    <daf1c>   DW_AT_decl_column : 25
    <daf1d>   DW_AT_type        : <0xdab75>
    <daf21>   DW_AT_data_member_location: 152
 <2><daf22>: Abbrev Number: 2 (DW_TAG_member)
    <daf23>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <daf27>   DW_AT_decl_file   : 9
    <daf28>   DW_AT_decl_line   : 114
    <daf29>   DW_AT_decl_column : 24
    <daf2a>   DW_AT_type        : <0xdac8b>
    <daf2e>   DW_AT_data_member_location: 160
 <2><daf2f>: Abbrev Number: 2 (DW_TAG_member)
    <daf30>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <daf34>   DW_AT_decl_file   : 9
    <daf35>   DW_AT_decl_line   : 115
    <daf36>   DW_AT_decl_column : 25
    <daf37>   DW_AT_type        : <0xdacc4>
    <daf3b>   DW_AT_data_member_location: 168
 <2><daf3c>: Abbrev Number: 2 (DW_TAG_member)
    <daf3d>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <daf41>   DW_AT_decl_file   : 9
    <daf42>   DW_AT_decl_line   : 116
    <daf43>   DW_AT_decl_column : 23
    <daf44>   DW_AT_type        : <0xdabf0>
    <daf48>   DW_AT_data_member_location: 176
 <2><daf49>: Abbrev Number: 2 (DW_TAG_member)
    <daf4a>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <daf4e>   DW_AT_decl_file   : 9
    <daf4f>   DW_AT_decl_line   : 117
    <daf50>   DW_AT_decl_column : 23
    <daf51>   DW_AT_type        : <0xdadc0>
    <daf55>   DW_AT_data_member_location: 184
 <2><daf56>: Abbrev Number: 2 (DW_TAG_member)
    <daf57>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <daf5b>   DW_AT_decl_file   : 9
    <daf5c>   DW_AT_decl_line   : 118
    <daf5d>   DW_AT_decl_column : 22
    <daf5e>   DW_AT_type        : <0xdadcc>
    <daf62>   DW_AT_data_member_location: 192
 <2><daf63>: Abbrev Number: 2 (DW_TAG_member)
    <daf64>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <daf68>   DW_AT_decl_file   : 9
    <daf69>   DW_AT_decl_line   : 119
    <daf6a>   DW_AT_decl_column : 23
    <daf6b>   DW_AT_type        : <0xdadd8>
    <daf6f>   DW_AT_data_member_location: 200
 <2><daf70>: Abbrev Number: 2 (DW_TAG_member)
    <daf71>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <daf75>   DW_AT_decl_file   : 9
    <daf76>   DW_AT_decl_line   : 120
    <daf77>   DW_AT_decl_column : 22
    <daf78>   DW_AT_type        : <0xdade4>
    <daf7c>   DW_AT_data_member_location: 208
 <2><daf7d>: Abbrev Number: 2 (DW_TAG_member)
    <daf7e>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <daf82>   DW_AT_decl_file   : 9
    <daf83>   DW_AT_decl_line   : 121
    <daf84>   DW_AT_decl_column : 23
    <daf85>   DW_AT_type        : <0xdadf0>
    <daf89>   DW_AT_data_member_location: 216
 <2><daf8a>: Abbrev Number: 0
 <1><daf8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <daf8c>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <daf90>   DW_AT_decl_file   : 9
    <daf91>   DW_AT_decl_line   : 122
    <daf92>   DW_AT_decl_column : 3
    <daf93>   DW_AT_type        : <0xdae11>
 <1><daf97>: Abbrev Number: 32 (DW_TAG_structure_type)
    <daf98>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <daf9c>   DW_AT_byte_size   : 20848
    <daf9e>   DW_AT_decl_file   : 10
    <daf9f>   DW_AT_decl_line   : 349
    <dafa1>   DW_AT_decl_column : 16
    <dafa2>   DW_AT_sibling     : <0xdb017>
 <2><dafa6>: Abbrev Number: 10 (DW_TAG_member)
    <dafa7>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <dafab>   DW_AT_decl_file   : 10
    <dafab>   DW_AT_decl_line   : 350
    <dafad>   DW_AT_decl_column : 18
    <dafad>   DW_AT_type        : <0xda56f>
    <dafb1>   DW_AT_data_member_location: 0
 <2><dafb2>: Abbrev Number: 10 (DW_TAG_member)
    <dafb3>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <dafb7>   DW_AT_decl_file   : 10
    <dafb7>   DW_AT_decl_line   : 351
    <dafb9>   DW_AT_decl_column : 18
    <dafb9>   DW_AT_type        : <0xda5fd>
    <dafbd>   DW_AT_data_member_location: 8
 <2><dafbe>: Abbrev Number: 10 (DW_TAG_member)
    <dafbf>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <dafc3>   DW_AT_decl_file   : 10
    <dafc3>   DW_AT_decl_line   : 352
    <dafc5>   DW_AT_decl_column : 18
    <dafc5>   DW_AT_type        : <0xda649>
    <dafc9>   DW_AT_data_member_location: 16
 <2><dafca>: Abbrev Number: 10 (DW_TAG_member)
    <dafcb>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <dafcf>   DW_AT_decl_file   : 10
    <dafcf>   DW_AT_decl_line   : 353
    <dafd1>   DW_AT_decl_column : 18
    <dafd1>   DW_AT_type        : <0xda597>
    <dafd5>   DW_AT_data_member_location: 40
 <2><dafd6>: Abbrev Number: 10 (DW_TAG_member)
    <dafd7>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <dafdb>   DW_AT_decl_file   : 10
    <dafdb>   DW_AT_decl_line   : 354
    <dafdd>   DW_AT_decl_column : 18
    <dafdd>   DW_AT_type        : <0xdaf8b>
    <dafe1>   DW_AT_data_member_location: 48
 <2><dafe2>: Abbrev Number: 12 (DW_TAG_member)
    <dafe3>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <dafe7>   DW_AT_decl_file   : 10
    <dafe7>   DW_AT_decl_line   : 355
    <dafe9>   DW_AT_decl_column : 18
    <dafe9>   DW_AT_type        : <0xdb017>
    <dafed>   DW_AT_data_member_location: 272
 <2><dafef>: Abbrev Number: 12 (DW_TAG_member)
    <daff0>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <daff4>   DW_AT_decl_file   : 10
    <daff4>   DW_AT_decl_line   : 356
    <daff6>   DW_AT_decl_column : 18
    <daff6>   DW_AT_type        : <0xda56f>
    <daffa>   DW_AT_data_member_location: 20832
 <2><daffc>: Abbrev Number: 12 (DW_TAG_member)
    <daffd>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <db001>   DW_AT_decl_file   : 10
    <db001>   DW_AT_decl_line   : 357
    <db003>   DW_AT_decl_column : 18
    <db003>   DW_AT_type        : <0xda56f>
    <db007>   DW_AT_data_member_location: 20836
 <2><db009>: Abbrev Number: 12 (DW_TAG_member)
    <db00a>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <db00e>   DW_AT_decl_file   : 10
    <db00e>   DW_AT_decl_line   : 358
    <db010>   DW_AT_decl_column : 18
    <db010>   DW_AT_type        : <0xda60e>
    <db014>   DW_AT_data_member_location: 20840
 <2><db016>: Abbrev Number: 0
 <1><db017>: Abbrev Number: 15 (DW_TAG_array_type)
    <db018>   DW_AT_type        : <0xdaa2a>
    <db01c>   DW_AT_sibling     : <0xdb028>
 <2><db020>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <db021>   DW_AT_type        : <0xda55a>
    <db025>   DW_AT_upper_bound : 256
 <2><db027>: Abbrev Number: 0
 <1><db028>: Abbrev Number: 14 (DW_TAG_typedef)
    <db029>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <db02d>   DW_AT_decl_file   : 10
    <db02e>   DW_AT_decl_line   : 359
    <db030>   DW_AT_decl_column : 3
    <db031>   DW_AT_type        : <0xdaf97>
 <1><db035>: Abbrev Number: 34 (DW_TAG_variable)
    <db036>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <db03a>   DW_AT_decl_file   : 10
    <db03b>   DW_AT_decl_line   : 361
    <db03d>   DW_AT_decl_column : 21
    <db03e>   DW_AT_type        : <0xdb028>
    <db042>   DW_AT_external    : 1
    <db042>   DW_AT_declaration : 1
 <1><db042>: Abbrev Number: 20 (DW_TAG_subprogram)
    <db043>   DW_AT_external    : 1
    <db043>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <db047>   DW_AT_decl_file   : 11
    <db048>   DW_AT_decl_line   : 61
    <db049>   DW_AT_decl_column : 14
    <db04a>   DW_AT_prototyped  : 1
    <db04a>   DW_AT_type        : <0xda589>
    <db04e>   DW_AT_declaration : 1
    <db04e>   DW_AT_sibling     : <0xdb062>
 <2><db052>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db053>   DW_AT_type        : <0xda589>
 <2><db057>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db058>   DW_AT_type        : <0xda56f>
 <2><db05c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db05d>   DW_AT_type        : <0xda5a3>
 <2><db061>: Abbrev Number: 0
 <1><db062>: Abbrev Number: 20 (DW_TAG_subprogram)
    <db063>   DW_AT_external    : 1
    <db063>   DW_AT_name        : (indirect string, offset: 0x1beac): fb_hStrAllocTemp
    <db067>   DW_AT_decl_file   : 6
    <db068>   DW_AT_decl_line   : 109
    <db069>   DW_AT_decl_column : 21
    <db06a>   DW_AT_prototyped  : 1
    <db06a>   DW_AT_type        : <0xda91a>
    <db06e>   DW_AT_declaration : 1
    <db06e>   DW_AT_sibling     : <0xdb07d>
 <2><db072>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db073>   DW_AT_type        : <0xda91a>
 <2><db077>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db078>   DW_AT_type        : <0xda5d4>
 <2><db07c>: Abbrev Number: 0
 <1><db07d>: Abbrev Number: 35 (DW_TAG_subprogram)
    <db07e>   DW_AT_external    : 1
    <db07e>   DW_AT_name        : (indirect string, offset: 0x4e8e): fb_SPACE
    <db082>   DW_AT_decl_file   : 1
    <db083>   DW_AT_decl_line   : 5
    <db084>   DW_AT_decl_column : 18
    <db085>   DW_AT_prototyped  : 1
    <db085>   DW_AT_type        : <0xda91a>
    <db089>   DW_AT_low_pc      : 0x4774d0
    <db091>   DW_AT_high_pc     : 0x58
    <db099>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <db09b>   DW_AT_call_all_calls: 1
 <2><db09b>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <db09c>   DW_AT_name        : len
    <db0a0>   DW_AT_decl_file   : 1
    <db0a1>   DW_AT_decl_line   : 5
    <db0a2>   DW_AT_decl_column : 36
    <db0a3>   DW_AT_type        : <0xda5d4>
    <db0a7>   DW_AT_location    : 0x40474 (location list)
    <db0ab>   DW_AT_GNU_locviews: 0x4046a
 <2><db0af>: Abbrev Number: 37 (DW_TAG_variable)
    <db0b0>   DW_AT_name        : dst
    <db0b4>   DW_AT_decl_file   : 1
    <db0b5>   DW_AT_decl_line   : 7
    <db0b6>   DW_AT_decl_column : 13
    <db0b7>   DW_AT_type        : <0xda91a>
    <db0bb>   DW_AT_location    : 0x4049a (location list)
    <db0bf>   DW_AT_GNU_locviews: 0x40494
 <2><db0c3>: Abbrev Number: 38 (DW_TAG_call_site)
    <db0c4>   DW_AT_call_return_pc: 0x4774fd
    <db0cc>   DW_AT_call_origin : <0xdb062>
    <db0d0>   DW_AT_sibling     : <0xdb0e0>
 <3><db0d4>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <db0d5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <db0d7>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><db0d9>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <db0da>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <db0dc>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><db0df>: Abbrev Number: 0
 <2><db0e0>: Abbrev Number: 39 (DW_TAG_call_site)
    <db0e1>   DW_AT_call_return_pc: 0x477515
    <db0e9>   DW_AT_call_origin : <0xdb042>
 <3><db0ed>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <db0ee>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <db0f0>   DW_AT_call_value  : 2 byte block: 8 20 	(DW_OP_const1u: 32)
 <3><db0f3>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <db0f4>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <db0f6>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><db0f9>: Abbrev Number: 0
 <2><db0fa>: Abbrev Number: 0
 <1><db0fb>: Abbrev Number: 0
  Compilation Unit @ offset 0xdb0fc:
   Length:        0xbd1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x14e08
   Pointer Size:  8
 <0><db108>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <db109>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <db10d>   DW_AT_language    : 29	(C11)
    <db10e>   DW_AT_name        : (indirect line string, offset: 0x148a): src/rtlib/str_tempdescf.c
    <db112>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <db116>   DW_AT_low_pc      : 0x477530
    <db11e>   DW_AT_high_pc     : 0x56
    <db126>   DW_AT_stmt_list   : 0x6c5a1
 <1><db12a>: Abbrev Number: 6 (DW_TAG_base_type)
    <db12b>   DW_AT_byte_size   : 1
    <db12c>   DW_AT_encoding    : 8	(unsigned char)
    <db12d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><db131>: Abbrev Number: 6 (DW_TAG_base_type)
    <db132>   DW_AT_byte_size   : 2
    <db133>   DW_AT_encoding    : 7	(unsigned)
    <db134>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><db138>: Abbrev Number: 6 (DW_TAG_base_type)
    <db139>   DW_AT_byte_size   : 4
    <db13a>   DW_AT_encoding    : 7	(unsigned)
    <db13b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><db13f>: Abbrev Number: 6 (DW_TAG_base_type)
    <db140>   DW_AT_byte_size   : 8
    <db141>   DW_AT_encoding    : 7	(unsigned)
    <db142>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><db146>: Abbrev Number: 6 (DW_TAG_base_type)
    <db147>   DW_AT_byte_size   : 1
    <db148>   DW_AT_encoding    : 6	(signed char)
    <db149>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><db14d>: Abbrev Number: 6 (DW_TAG_base_type)
    <db14e>   DW_AT_byte_size   : 2
    <db14f>   DW_AT_encoding    : 5	(signed)
    <db150>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><db154>: Abbrev Number: 21 (DW_TAG_base_type)
    <db155>   DW_AT_byte_size   : 4
    <db156>   DW_AT_encoding    : 5	(signed)
    <db157>   DW_AT_name        : int
 <1><db15b>: Abbrev Number: 6 (DW_TAG_base_type)
    <db15c>   DW_AT_byte_size   : 8
    <db15d>   DW_AT_encoding    : 5	(signed)
    <db15e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><db162>: Abbrev Number: 3 (DW_TAG_typedef)
    <db163>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <db167>   DW_AT_decl_file   : 2
    <db168>   DW_AT_decl_line   : 153
    <db169>   DW_AT_decl_column : 27
    <db16a>   DW_AT_type        : <0xdb15b>
 <1><db16e>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <db16f>   DW_AT_byte_size   : 8
 <1><db170>: Abbrev Number: 3 (DW_TAG_typedef)
    <db171>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <db175>   DW_AT_decl_file   : 2
    <db176>   DW_AT_decl_line   : 194
    <db177>   DW_AT_decl_column : 27
    <db178>   DW_AT_type        : <0xdb15b>
 <1><db17c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db17d>   DW_AT_byte_size   : 8
    <db17d>   DW_AT_type        : <0xdb181>
 <1><db181>: Abbrev Number: 6 (DW_TAG_base_type)
    <db182>   DW_AT_byte_size   : 1
    <db183>   DW_AT_encoding    : 6	(signed char)
    <db184>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><db188>: Abbrev Number: 13 (DW_TAG_const_type)
    <db189>   DW_AT_type        : <0xdb181>
 <1><db18d>: Abbrev Number: 3 (DW_TAG_typedef)
    <db18e>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <db192>   DW_AT_decl_file   : 3
    <db193>   DW_AT_decl_line   : 209
    <db194>   DW_AT_decl_column : 23
    <db195>   DW_AT_type        : <0xdb13f>
 <1><db199>: Abbrev Number: 14 (DW_TAG_typedef)
    <db19a>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <db19e>   DW_AT_decl_file   : 3
    <db19f>   DW_AT_decl_line   : 321
    <db1a1>   DW_AT_decl_column : 24
    <db1a2>   DW_AT_type        : <0xdb154>
 <1><db1a6>: Abbrev Number: 13 (DW_TAG_const_type)
    <db1a7>   DW_AT_type        : <0xdb199>
 <1><db1ab>: Abbrev Number: 6 (DW_TAG_base_type)
    <db1ac>   DW_AT_byte_size   : 8
    <db1ad>   DW_AT_encoding    : 5	(signed)
    <db1ae>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><db1b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <db1b3>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <db1b7>   DW_AT_decl_file   : 4
    <db1b8>   DW_AT_decl_line   : 87
    <db1b9>   DW_AT_decl_column : 19
    <db1ba>   DW_AT_type        : <0xdb162>
 <1><db1be>: Abbrev Number: 3 (DW_TAG_typedef)
    <db1bf>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <db1c3>   DW_AT_decl_file   : 4
    <db1c4>   DW_AT_decl_line   : 108
    <db1c5>   DW_AT_decl_column : 19
    <db1c6>   DW_AT_type        : <0xdb170>
 <1><db1ca>: Abbrev Number: 6 (DW_TAG_base_type)
    <db1cb>   DW_AT_byte_size   : 8
    <db1cc>   DW_AT_encoding    : 7	(unsigned)
    <db1cd>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><db1d1>: Abbrev Number: 15 (DW_TAG_array_type)
    <db1d2>   DW_AT_type        : <0xdb181>
    <db1d6>   DW_AT_sibling     : <0xdb1e1>
 <2><db1da>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <db1db>   DW_AT_type        : <0xdb13f>
    <db1df>   DW_AT_upper_bound : 3
 <2><db1e0>: Abbrev Number: 0
 <1><db1e1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db1e2>   DW_AT_byte_size   : 8
    <db1e2>   DW_AT_type        : <0xdb1e6>
 <1><db1e6>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><db1e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db1e8>   DW_AT_byte_size   : 8
    <db1e8>   DW_AT_type        : <0xdb188>
 <1><db1ec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db1ed>   DW_AT_byte_size   : 8
    <db1ed>   DW_AT_type        : <0xdb17c>
 <1><db1f1>: Abbrev Number: 3 (DW_TAG_typedef)
    <db1f2>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <db1f6>   DW_AT_decl_file   : 5
    <db1f7>   DW_AT_decl_line   : 22
    <db1f8>   DW_AT_decl_column : 15
    <db1f9>   DW_AT_type        : <0xdb1b2>
 <1><db1fd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db1fe>   DW_AT_byte_size   : 8
    <db1fe>   DW_AT_type        : <0xdb202>
 <1><db202>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <db203>   DW_AT_prototyped  : 1
 <1><db203>: Abbrev Number: 8 (DW_TAG_structure_type)
    <db204>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <db208>   DW_AT_byte_size   : 24
    <db209>   DW_AT_decl_file   : 6
    <db20a>   DW_AT_decl_line   : 82
    <db20b>   DW_AT_decl_column : 16
    <db20c>   DW_AT_sibling     : <0xdb238>
 <2><db210>: Abbrev Number: 2 (DW_TAG_member)
    <db211>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <db215>   DW_AT_decl_file   : 6
    <db216>   DW_AT_decl_line   : 83
    <db217>   DW_AT_decl_column : 21
    <db218>   DW_AT_type        : <0xdb17c>
    <db21c>   DW_AT_data_member_location: 0
 <2><db21d>: Abbrev Number: 7 (DW_TAG_member)
    <db21e>   DW_AT_name        : len
    <db222>   DW_AT_decl_file   : 6
    <db223>   DW_AT_decl_line   : 84
    <db224>   DW_AT_decl_column : 21
    <db225>   DW_AT_type        : <0xdb1be>
    <db229>   DW_AT_data_member_location: 8
 <2><db22a>: Abbrev Number: 2 (DW_TAG_member)
    <db22b>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <db22f>   DW_AT_decl_file   : 6
    <db230>   DW_AT_decl_line   : 85
    <db231>   DW_AT_decl_column : 21
    <db232>   DW_AT_type        : <0xdb1be>
    <db236>   DW_AT_data_member_location: 16
 <2><db237>: Abbrev Number: 0
 <1><db238>: Abbrev Number: 3 (DW_TAG_typedef)
    <db239>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <db23d>   DW_AT_decl_file   : 6
    <db23e>   DW_AT_decl_line   : 86
    <db23f>   DW_AT_decl_column : 3
    <db240>   DW_AT_type        : <0xdb203>
 <1><db244>: Abbrev Number: 6 (DW_TAG_base_type)
    <db245>   DW_AT_byte_size   : 8
    <db246>   DW_AT_encoding    : 4	(float)
    <db247>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><db24b>: Abbrev Number: 6 (DW_TAG_base_type)
    <db24c>   DW_AT_byte_size   : 4
    <db24d>   DW_AT_encoding    : 4	(float)
    <db24e>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><db252>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db253>   DW_AT_byte_size   : 8
    <db253>   DW_AT_type        : <0xdb199>
 <1><db257>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <db258>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <db25c>   DW_AT_encoding    : 7	(unsigned)
    <db25d>   DW_AT_byte_size   : 4
    <db25e>   DW_AT_type        : <0xdb138>
    <db262>   DW_AT_decl_file   : 7
    <db263>   DW_AT_decl_line   : 25
    <db264>   DW_AT_decl_column : 14
    <db265>   DW_AT_sibling     : <0xdb282>
 <2><db269>: Abbrev Number: 11 (DW_TAG_enumerator)
    <db26a>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <db26e>   DW_AT_const_value : 0
 <2><db26f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <db270>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <db274>   DW_AT_const_value : 1
 <2><db275>: Abbrev Number: 11 (DW_TAG_enumerator)
    <db276>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <db27a>   DW_AT_const_value : 2
 <2><db27b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <db27c>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <db280>   DW_AT_const_value : 3
 <2><db281>: Abbrev Number: 0
 <1><db282>: Abbrev Number: 3 (DW_TAG_typedef)
    <db283>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <db287>   DW_AT_decl_file   : 7
    <db288>   DW_AT_decl_line   : 30
    <db289>   DW_AT_decl_column : 3
    <db28a>   DW_AT_type        : <0xdb257>
 <1><db28e>: Abbrev Number: 3 (DW_TAG_typedef)
    <db28f>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <db293>   DW_AT_decl_file   : 7
    <db294>   DW_AT_decl_line   : 54
    <db295>   DW_AT_decl_column : 15
    <db296>   DW_AT_type        : <0xdb29a>
 <1><db29a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db29b>   DW_AT_byte_size   : 8
    <db29b>   DW_AT_type        : <0xdb29f>
 <1><db29f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db2a0>   DW_AT_prototyped  : 1
    <db2a0>   DW_AT_type        : <0xdb154>
    <db2a4>   DW_AT_sibling     : <0xdb2b3>
 <2><db2a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db2a9>   DW_AT_type        : <0xdb2b3>
 <2><db2ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db2ae>   DW_AT_type        : <0xdb154>
 <2><db2b2>: Abbrev Number: 0
 <1><db2b3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db2b4>   DW_AT_byte_size   : 8
    <db2b4>   DW_AT_type        : <0xdb2b8>
 <1><db2b8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <db2b9>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <db2bd>   DW_AT_byte_size   : 80
    <db2be>   DW_AT_decl_file   : 7
    <db2bf>   DW_AT_decl_line   : 97
    <db2c0>   DW_AT_decl_column : 16
    <db2c1>   DW_AT_sibling     : <0xdb37c>
 <2><db2c5>: Abbrev Number: 2 (DW_TAG_member)
    <db2c6>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <db2ca>   DW_AT_decl_file   : 7
    <db2cb>   DW_AT_decl_line   : 98
    <db2cc>   DW_AT_decl_column : 21
    <db2cd>   DW_AT_type        : <0xdb154>
    <db2d1>   DW_AT_data_member_location: 0
 <2><db2d2>: Abbrev Number: 7 (DW_TAG_member)
    <db2d3>   DW_AT_name        : len
    <db2d7>   DW_AT_decl_file   : 7
    <db2d8>   DW_AT_decl_line   : 99
    <db2d9>   DW_AT_decl_column : 21
    <db2da>   DW_AT_type        : <0xdb154>
    <db2de>   DW_AT_data_member_location: 4
 <2><db2df>: Abbrev Number: 2 (DW_TAG_member)
    <db2e0>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <db2e4>   DW_AT_decl_file   : 7
    <db2e5>   DW_AT_decl_line   : 100
    <db2e6>   DW_AT_decl_column : 21
    <db2e7>   DW_AT_type        : <0xdb282>
    <db2eb>   DW_AT_data_member_location: 8
 <2><db2ec>: Abbrev Number: 2 (DW_TAG_member)
    <db2ed>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <db2f1>   DW_AT_decl_file   : 7
    <db2f2>   DW_AT_decl_line   : 101
    <db2f3>   DW_AT_decl_column : 21
    <db2f4>   DW_AT_type        : <0xdb1f1>
    <db2f8>   DW_AT_data_member_location: 16
 <2><db2f9>: Abbrev Number: 2 (DW_TAG_member)
    <db2fa>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <db2fe>   DW_AT_decl_file   : 7
    <db2ff>   DW_AT_decl_line   : 102
    <db300>   DW_AT_decl_column : 21
    <db301>   DW_AT_type        : <0xdb154>
    <db305>   DW_AT_data_member_location: 24
 <2><db306>: Abbrev Number: 2 (DW_TAG_member)
    <db307>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <db30b>   DW_AT_decl_file   : 7
    <db30c>   DW_AT_decl_line   : 103
    <db30d>   DW_AT_decl_column : 21
    <db30e>   DW_AT_type        : <0xdb154>
    <db312>   DW_AT_data_member_location: 28
 <2><db313>: Abbrev Number: 2 (DW_TAG_member)
    <db314>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <db318>   DW_AT_decl_file   : 7
    <db319>   DW_AT_decl_line   : 104
    <db31a>   DW_AT_decl_column : 21
    <db31b>   DW_AT_type        : <0xdb154>
    <db31f>   DW_AT_data_member_location: 32
 <2><db320>: Abbrev Number: 2 (DW_TAG_member)
    <db321>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <db325>   DW_AT_decl_file   : 7
    <db326>   DW_AT_decl_line   : 105
    <db327>   DW_AT_decl_column : 21
    <db328>   DW_AT_type        : <0xdb138>
    <db32c>   DW_AT_data_member_location: 36
 <2><db32d>: Abbrev Number: 2 (DW_TAG_member)
    <db32e>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <db332>   DW_AT_decl_file   : 7
    <db333>   DW_AT_decl_line   : 106
    <db334>   DW_AT_decl_column : 21
    <db335>   DW_AT_type        : <0xdb138>
    <db339>   DW_AT_data_member_location: 40
 <2><db33a>: Abbrev Number: 2 (DW_TAG_member)
    <db33b>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <db33f>   DW_AT_decl_file   : 7
    <db340>   DW_AT_decl_line   : 109
    <db341>   DW_AT_decl_column : 21
    <db342>   DW_AT_type        : <0xdb1d1>
    <db346>   DW_AT_data_member_location: 44
 <2><db347>: Abbrev Number: 2 (DW_TAG_member)
    <db348>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <db34c>   DW_AT_decl_file   : 7
    <db34d>   DW_AT_decl_line   : 110
    <db34e>   DW_AT_decl_column : 21
    <db34f>   DW_AT_type        : <0xdb18d>
    <db353>   DW_AT_data_member_location: 48
 <2><db354>: Abbrev Number: 2 (DW_TAG_member)
    <db355>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <db359>   DW_AT_decl_file   : 7
    <db35a>   DW_AT_decl_line   : 112
    <db35b>   DW_AT_decl_column : 22
    <db35c>   DW_AT_type        : <0xdb614>
    <db360>   DW_AT_data_member_location: 56
 <2><db361>: Abbrev Number: 2 (DW_TAG_member)
    <db362>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <db366>   DW_AT_decl_file   : 7
    <db367>   DW_AT_decl_line   : 114
    <db368>   DW_AT_decl_column : 14
    <db369>   DW_AT_type        : <0xdb16e>
    <db36d>   DW_AT_data_member_location: 64
 <2><db36e>: Abbrev Number: 2 (DW_TAG_member)
    <db36f>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <db373>   DW_AT_decl_file   : 7
    <db374>   DW_AT_decl_line   : 116
    <db375>   DW_AT_decl_column : 22
    <db376>   DW_AT_type        : <0xdb2b3>
    <db37a>   DW_AT_data_member_location: 72
 <2><db37b>: Abbrev Number: 0
 <1><db37c>: Abbrev Number: 3 (DW_TAG_typedef)
    <db37d>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <db381>   DW_AT_decl_file   : 7
    <db382>   DW_AT_decl_line   : 59
    <db383>   DW_AT_decl_column : 15
    <db384>   DW_AT_type        : <0xdb388>
 <1><db388>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db389>   DW_AT_byte_size   : 8
    <db389>   DW_AT_type        : <0xdb38d>
 <1><db38d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db38e>   DW_AT_prototyped  : 1
    <db38e>   DW_AT_type        : <0xdb154>
    <db392>   DW_AT_sibling     : <0xdb39c>
 <2><db396>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db397>   DW_AT_type        : <0xdb2b3>
 <2><db39b>: Abbrev Number: 0
 <1><db39c>: Abbrev Number: 3 (DW_TAG_typedef)
    <db39d>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <db3a1>   DW_AT_decl_file   : 7
    <db3a2>   DW_AT_decl_line   : 60
    <db3a3>   DW_AT_decl_column : 15
    <db3a4>   DW_AT_type        : <0xdb388>
 <1><db3a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <db3a9>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <db3ad>   DW_AT_decl_file   : 7
    <db3ae>   DW_AT_decl_line   : 61
    <db3af>   DW_AT_decl_column : 15
    <db3b0>   DW_AT_type        : <0xdb3b4>
 <1><db3b4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db3b5>   DW_AT_byte_size   : 8
    <db3b5>   DW_AT_type        : <0xdb3b9>
 <1><db3b9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db3ba>   DW_AT_prototyped  : 1
    <db3ba>   DW_AT_type        : <0xdb154>
    <db3be>   DW_AT_sibling     : <0xdb3d2>
 <2><db3c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db3c3>   DW_AT_type        : <0xdb2b3>
 <2><db3c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db3c8>   DW_AT_type        : <0xdb1f1>
 <2><db3cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db3cd>   DW_AT_type        : <0xdb154>
 <2><db3d1>: Abbrev Number: 0
 <1><db3d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <db3d3>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <db3d7>   DW_AT_decl_file   : 7
    <db3d8>   DW_AT_decl_line   : 62
    <db3d9>   DW_AT_decl_column : 15
    <db3da>   DW_AT_type        : <0xdb3de>
 <1><db3de>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db3df>   DW_AT_byte_size   : 8
    <db3df>   DW_AT_type        : <0xdb3e3>
 <1><db3e3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db3e4>   DW_AT_prototyped  : 1
    <db3e4>   DW_AT_type        : <0xdb154>
    <db3e8>   DW_AT_sibling     : <0xdb3f7>
 <2><db3ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db3ed>   DW_AT_type        : <0xdb2b3>
 <2><db3f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db3f2>   DW_AT_type        : <0xdb3f7>
 <2><db3f6>: Abbrev Number: 0
 <1><db3f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db3f8>   DW_AT_byte_size   : 8
    <db3f8>   DW_AT_type        : <0xdb1f1>
 <1><db3fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <db3fd>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <db401>   DW_AT_decl_file   : 7
    <db402>   DW_AT_decl_line   : 63
    <db403>   DW_AT_decl_column : 15
    <db404>   DW_AT_type        : <0xdb408>
 <1><db408>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db409>   DW_AT_byte_size   : 8
    <db409>   DW_AT_type        : <0xdb40d>
 <1><db40d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db40e>   DW_AT_prototyped  : 1
    <db40e>   DW_AT_type        : <0xdb154>
    <db412>   DW_AT_sibling     : <0xdb426>
 <2><db416>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db417>   DW_AT_type        : <0xdb2b3>
 <2><db41b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db41c>   DW_AT_type        : <0xdb16e>
 <2><db420>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db421>   DW_AT_type        : <0xdb426>
 <2><db425>: Abbrev Number: 0
 <1><db426>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db427>   DW_AT_byte_size   : 8
    <db427>   DW_AT_type        : <0xdb18d>
 <1><db42b>: Abbrev Number: 3 (DW_TAG_typedef)
    <db42c>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <db430>   DW_AT_decl_file   : 7
    <db431>   DW_AT_decl_line   : 65
    <db432>   DW_AT_decl_column : 15
    <db433>   DW_AT_type        : <0xdb437>
 <1><db437>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db438>   DW_AT_byte_size   : 8
    <db438>   DW_AT_type        : <0xdb43c>
 <1><db43c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db43d>   DW_AT_prototyped  : 1
    <db43d>   DW_AT_type        : <0xdb154>
    <db441>   DW_AT_sibling     : <0xdb455>
 <2><db445>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db446>   DW_AT_type        : <0xdb2b3>
 <2><db44a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db44b>   DW_AT_type        : <0xdb252>
 <2><db44f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db450>   DW_AT_type        : <0xdb426>
 <2><db454>: Abbrev Number: 0
 <1><db455>: Abbrev Number: 3 (DW_TAG_typedef)
    <db456>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <db45a>   DW_AT_decl_file   : 7
    <db45b>   DW_AT_decl_line   : 67
    <db45c>   DW_AT_decl_column : 15
    <db45d>   DW_AT_type        : <0xdb461>
 <1><db461>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db462>   DW_AT_byte_size   : 8
    <db462>   DW_AT_type        : <0xdb466>
 <1><db466>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db467>   DW_AT_prototyped  : 1
    <db467>   DW_AT_type        : <0xdb154>
    <db46b>   DW_AT_sibling     : <0xdb47f>
 <2><db46f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db470>   DW_AT_type        : <0xdb2b3>
 <2><db474>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db475>   DW_AT_type        : <0xdb1e1>
 <2><db479>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db47a>   DW_AT_type        : <0xdb18d>
 <2><db47e>: Abbrev Number: 0
 <1><db47f>: Abbrev Number: 3 (DW_TAG_typedef)
    <db480>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <db484>   DW_AT_decl_file   : 7
    <db485>   DW_AT_decl_line   : 69
    <db486>   DW_AT_decl_column : 15
    <db487>   DW_AT_type        : <0xdb48b>
 <1><db48b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db48c>   DW_AT_byte_size   : 8
    <db48c>   DW_AT_type        : <0xdb490>
 <1><db490>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db491>   DW_AT_prototyped  : 1
    <db491>   DW_AT_type        : <0xdb154>
    <db495>   DW_AT_sibling     : <0xdb4a9>
 <2><db499>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db49a>   DW_AT_type        : <0xdb2b3>
 <2><db49e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db49f>   DW_AT_type        : <0xdb4a9>
 <2><db4a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db4a4>   DW_AT_type        : <0xdb18d>
 <2><db4a8>: Abbrev Number: 0
 <1><db4a9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db4aa>   DW_AT_byte_size   : 8
    <db4aa>   DW_AT_type        : <0xdb1a6>
 <1><db4ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <db4af>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <db4b3>   DW_AT_decl_file   : 7
    <db4b4>   DW_AT_decl_line   : 71
    <db4b5>   DW_AT_decl_column : 15
    <db4b6>   DW_AT_type        : <0xdb4ba>
 <1><db4ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db4bb>   DW_AT_byte_size   : 8
    <db4bb>   DW_AT_type        : <0xdb4bf>
 <1><db4bf>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db4c0>   DW_AT_prototyped  : 1
    <db4c0>   DW_AT_type        : <0xdb154>
    <db4c4>   DW_AT_sibling     : <0xdb4d8>
 <2><db4c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db4c9>   DW_AT_type        : <0xdb2b3>
 <2><db4cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db4ce>   DW_AT_type        : <0xdb1f1>
 <2><db4d2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db4d3>   DW_AT_type        : <0xdb1f1>
 <2><db4d7>: Abbrev Number: 0
 <1><db4d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <db4d9>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <db4dd>   DW_AT_decl_file   : 7
    <db4de>   DW_AT_decl_line   : 73
    <db4df>   DW_AT_decl_column : 15
    <db4e0>   DW_AT_type        : <0xdb4ba>
 <1><db4e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <db4e5>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <db4e9>   DW_AT_decl_file   : 7
    <db4ea>   DW_AT_decl_line   : 75
    <db4eb>   DW_AT_decl_column : 15
    <db4ec>   DW_AT_type        : <0xdb4f0>
 <1><db4f0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db4f1>   DW_AT_byte_size   : 8
    <db4f1>   DW_AT_type        : <0xdb4f5>
 <1><db4f5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db4f6>   DW_AT_prototyped  : 1
    <db4f6>   DW_AT_type        : <0xdb154>
    <db4fa>   DW_AT_sibling     : <0xdb509>
 <2><db4fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db4ff>   DW_AT_type        : <0xdb2b3>
 <2><db503>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db504>   DW_AT_type        : <0xdb509>
 <2><db508>: Abbrev Number: 0
 <1><db509>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db50a>   DW_AT_byte_size   : 8
    <db50a>   DW_AT_type        : <0xdb238>
 <1><db50e>: Abbrev Number: 3 (DW_TAG_typedef)
    <db50f>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <db513>   DW_AT_decl_file   : 7
    <db514>   DW_AT_decl_line   : 76
    <db515>   DW_AT_decl_column : 15
    <db516>   DW_AT_type        : <0xdb51a>
 <1><db51a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <db51b>   DW_AT_byte_size   : 8
    <db51b>   DW_AT_type        : <0xdb51f>
 <1><db51f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <db520>   DW_AT_prototyped  : 1
    <db520>   DW_AT_type        : <0xdb154>
    <db524>   DW_AT_sibling     : <0xdb538>
 <2><db528>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db529>   DW_AT_type        : <0xdb2b3>
 <2><db52d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db52e>   DW_AT_type        : <0xdb252>
 <2><db532>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <db533>   DW_AT_type        : <0xdb1be>
 <2><db537>: Abbrev Number: 0
 <1><db538>: Abbrev Number: 3 (DW_TAG_typedef)
    <db539>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <db53d>   DW_AT_decl_file   : 7
    <db53e>   DW_AT_decl_line   : 77
    <db53f>   DW_AT_decl_column : 15
    <db540>   DW_AT_type        : <0xdb388>
 <1><db544>: Abbrev Number: 8 (DW_TAG_structure_type)
    <db545>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <db549>   DW_AT_byte_size   : 112
    <db54a>   DW_AT_decl_file   : 7
    <db54b>   DW_AT_decl_line   : 80
    <db54c>   DW_AT_decl_column : 16
    <db54d>   DW_AT_sibling     : <0xdb608>
 <2><db551>: Abbrev Number: 2 (DW_TAG_member)
    <db552>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <db556>   DW_AT_decl_file   : 7
    <db557>   DW_AT_decl_line   : 81
    <db558>   DW_AT_decl_column : 25
    <db559>   DW_AT_type        : <0xdb37c>
    <db55d>   DW_AT_data_member_location: 0
 <2><db55e>: Abbrev Number: 2 (DW_TAG_member)
    <db55f>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <db563>   DW_AT_decl_file   : 7
    <db564>   DW_AT_decl_line   : 82
    <db565>   DW_AT_decl_column : 25
