    <bb274>   DW_AT_decl_line   : 118
    <bb275>   DW_AT_decl_column : 22
    <bb276>   DW_AT_type        : <0xbb0e4>
    <bb27a>   DW_AT_data_member_location: 192
 <2><bb27b>: Abbrev Number: 2 (DW_TAG_member)
    <bb27c>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <bb280>   DW_AT_decl_file   : 9
    <bb281>   DW_AT_decl_line   : 119
    <bb282>   DW_AT_decl_column : 23
    <bb283>   DW_AT_type        : <0xbb0f0>
    <bb287>   DW_AT_data_member_location: 200
 <2><bb288>: Abbrev Number: 2 (DW_TAG_member)
    <bb289>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <bb28d>   DW_AT_decl_file   : 9
    <bb28e>   DW_AT_decl_line   : 120
    <bb28f>   DW_AT_decl_column : 22
    <bb290>   DW_AT_type        : <0xbb0fc>
    <bb294>   DW_AT_data_member_location: 208
 <2><bb295>: Abbrev Number: 2 (DW_TAG_member)
    <bb296>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <bb29a>   DW_AT_decl_file   : 9
    <bb29b>   DW_AT_decl_line   : 121
    <bb29c>   DW_AT_decl_column : 23
    <bb29d>   DW_AT_type        : <0xbb108>
    <bb2a1>   DW_AT_data_member_location: 216
 <2><bb2a2>: Abbrev Number: 0
 <1><bb2a3>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb2a4>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <bb2a8>   DW_AT_decl_file   : 9
    <bb2a9>   DW_AT_decl_line   : 122
    <bb2aa>   DW_AT_decl_column : 3
    <bb2ab>   DW_AT_type        : <0xbb129>
 <1><bb2af>: Abbrev Number: 34 (DW_TAG_structure_type)
    <bb2b0>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <bb2b4>   DW_AT_byte_size   : 20848
    <bb2b6>   DW_AT_decl_file   : 10
    <bb2b7>   DW_AT_decl_line   : 349
    <bb2b9>   DW_AT_decl_column : 16
    <bb2ba>   DW_AT_sibling     : <0xbb32f>
 <2><bb2be>: Abbrev Number: 10 (DW_TAG_member)
    <bb2bf>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <bb2c3>   DW_AT_decl_file   : 10
    <bb2c3>   DW_AT_decl_line   : 350
    <bb2c5>   DW_AT_decl_column : 18
    <bb2c5>   DW_AT_type        : <0xba887>
    <bb2c9>   DW_AT_data_member_location: 0
 <2><bb2ca>: Abbrev Number: 10 (DW_TAG_member)
    <bb2cb>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <bb2cf>   DW_AT_decl_file   : 10
    <bb2cf>   DW_AT_decl_line   : 351
    <bb2d1>   DW_AT_decl_column : 18
    <bb2d1>   DW_AT_type        : <0xba915>
    <bb2d5>   DW_AT_data_member_location: 8
 <2><bb2d6>: Abbrev Number: 10 (DW_TAG_member)
    <bb2d7>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <bb2db>   DW_AT_decl_file   : 10
    <bb2db>   DW_AT_decl_line   : 352
    <bb2dd>   DW_AT_decl_column : 18
    <bb2dd>   DW_AT_type        : <0xba961>
    <bb2e1>   DW_AT_data_member_location: 16
 <2><bb2e2>: Abbrev Number: 10 (DW_TAG_member)
    <bb2e3>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <bb2e7>   DW_AT_decl_file   : 10
    <bb2e7>   DW_AT_decl_line   : 353
    <bb2e9>   DW_AT_decl_column : 18
    <bb2e9>   DW_AT_type        : <0xba8af>
    <bb2ed>   DW_AT_data_member_location: 40
 <2><bb2ee>: Abbrev Number: 10 (DW_TAG_member)
    <bb2ef>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <bb2f3>   DW_AT_decl_file   : 10
    <bb2f3>   DW_AT_decl_line   : 354
    <bb2f5>   DW_AT_decl_column : 18
    <bb2f5>   DW_AT_type        : <0xbb2a3>
    <bb2f9>   DW_AT_data_member_location: 48
 <2><bb2fa>: Abbrev Number: 12 (DW_TAG_member)
    <bb2fb>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <bb2ff>   DW_AT_decl_file   : 10
    <bb2ff>   DW_AT_decl_line   : 355
    <bb301>   DW_AT_decl_column : 18
    <bb301>   DW_AT_type        : <0xbb32f>
    <bb305>   DW_AT_data_member_location: 272
 <2><bb307>: Abbrev Number: 12 (DW_TAG_member)
    <bb308>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <bb30c>   DW_AT_decl_file   : 10
    <bb30c>   DW_AT_decl_line   : 356
    <bb30e>   DW_AT_decl_column : 18
    <bb30e>   DW_AT_type        : <0xba887>
    <bb312>   DW_AT_data_member_location: 20832
 <2><bb314>: Abbrev Number: 12 (DW_TAG_member)
    <bb315>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <bb319>   DW_AT_decl_file   : 10
    <bb319>   DW_AT_decl_line   : 357
    <bb31b>   DW_AT_decl_column : 18
    <bb31b>   DW_AT_type        : <0xba887>
    <bb31f>   DW_AT_data_member_location: 20836
 <2><bb321>: Abbrev Number: 12 (DW_TAG_member)
    <bb322>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <bb326>   DW_AT_decl_file   : 10
    <bb326>   DW_AT_decl_line   : 358
    <bb328>   DW_AT_decl_column : 18
    <bb328>   DW_AT_type        : <0xba926>
    <bb32c>   DW_AT_data_member_location: 20840
 <2><bb32e>: Abbrev Number: 0
 <1><bb32f>: Abbrev Number: 15 (DW_TAG_array_type)
    <bb330>   DW_AT_type        : <0xbad42>
    <bb334>   DW_AT_sibling     : <0xbb340>
 <2><bb338>: Abbrev Number: 35 (DW_TAG_subrange_type)
    <bb339>   DW_AT_type        : <0xba872>
    <bb33d>   DW_AT_upper_bound : 256
 <2><bb33f>: Abbrev Number: 0
 <1><bb340>: Abbrev Number: 14 (DW_TAG_typedef)
    <bb341>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <bb345>   DW_AT_decl_file   : 10
    <bb346>   DW_AT_decl_line   : 359
    <bb348>   DW_AT_decl_column : 3
    <bb349>   DW_AT_type        : <0xbb2af>
 <1><bb34d>: Abbrev Number: 36 (DW_TAG_variable)
    <bb34e>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <bb352>   DW_AT_decl_file   : 10
    <bb353>   DW_AT_decl_line   : 361
    <bb355>   DW_AT_decl_column : 21
    <bb356>   DW_AT_type        : <0xbb340>
    <bb35a>   DW_AT_external    : 1
    <bb35a>   DW_AT_declaration : 1
 <1><bb35a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bb35b>   DW_AT_external    : 1
    <bb35b>   DW_AT_name        : (indirect string, offset: 0x1b64a): fb_ConsoleKeyHit
    <bb35f>   DW_AT_decl_file   : 11
    <bb35f>   DW_AT_decl_line   : 72
    <bb360>   DW_AT_decl_column : 21
    <bb360>   DW_AT_prototyped  : 1
    <bb360>   DW_AT_type        : <0xba887>
    <bb364>   DW_AT_declaration : 1
 <1><bb364>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bb365>   DW_AT_external    : 1
    <bb365>   DW_AT_name        : (indirect string, offset: 0x1b65b): fb_ConsoleGetkey
    <bb369>   DW_AT_decl_file   : 11
    <bb369>   DW_AT_decl_line   : 70
    <bb36a>   DW_AT_decl_column : 21
    <bb36a>   DW_AT_prototyped  : 1
    <bb36a>   DW_AT_type        : <0xba887>
    <bb36e>   DW_AT_declaration : 1
 <1><bb36e>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bb36f>   DW_AT_external    : 1
    <bb36f>   DW_AT_name        : (indirect string, offset: 0x1b63a): fb_ConsoleInkey
    <bb373>   DW_AT_decl_file   : 11
    <bb373>   DW_AT_decl_line   : 71
    <bb374>   DW_AT_decl_column : 21
    <bb374>   DW_AT_prototyped  : 1
    <bb374>   DW_AT_type        : <0xbac32>
    <bb378>   DW_AT_declaration : 1
 <1><bb378>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bb379>   DW_AT_external    : 1
    <bb379>   DW_AT_name        : (indirect string, offset: 0x1b08d): fb_KeyHit
    <bb37d>   DW_AT_decl_file   : 1
    <bb37d>   DW_AT_decl_line   : 40
    <bb37e>   DW_AT_decl_column : 12
    <bb37e>   DW_AT_prototyped  : 1
    <bb37e>   DW_AT_type        : <0xba887>
    <bb382>   DW_AT_low_pc      : 0x471d10
    <bb38a>   DW_AT_high_pc     : 0x15
    <bb392>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bb394>   DW_AT_sibling     : <0xbb3b1>
 <2><bb398>: Abbrev Number: 21 (DW_TAG_variable)
    <bb399>   DW_AT_name        : res
    <bb39d>   DW_AT_decl_file   : 1
    <bb39d>   DW_AT_decl_line   : 42
    <bb39e>   DW_AT_decl_column : 6
    <bb39f>   DW_AT_type        : <0xba887>
 <2><bb3a3>: Abbrev Number: 22 (DW_TAG_call_site)
    <bb3a4>   DW_AT_call_return_pc: 0x471d25
    <bb3ac>   DW_AT_call_tail_call: 1
    <bb3ac>   DW_AT_call_origin : <0xbb35a>
 <2><bb3b0>: Abbrev Number: 0
 <1><bb3b1>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bb3b2>   DW_AT_external    : 1
    <bb3b2>   DW_AT_name        : (indirect string, offset: 0x1ab68): fb_Getkey
    <bb3b6>   DW_AT_decl_file   : 1
    <bb3b6>   DW_AT_decl_line   : 21
    <bb3b7>   DW_AT_decl_column : 12
    <bb3b7>   DW_AT_prototyped  : 1
    <bb3b7>   DW_AT_type        : <0xba887>
    <bb3bb>   DW_AT_low_pc      : 0x471cf0
    <bb3c3>   DW_AT_high_pc     : 0x19
    <bb3cb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bb3cd>   DW_AT_sibling     : <0xbb3ef>
 <2><bb3d1>: Abbrev Number: 37 (DW_TAG_variable)
    <bb3d2>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <bb3d6>   DW_AT_decl_file   : 1
    <bb3d7>   DW_AT_decl_line   : 23
    <bb3d8>   DW_AT_decl_column : 16
    <bb3d9>   DW_AT_type        : <0xbae19>
    <bb3dd>   DW_AT_location    : 0x3a6f2 (location list)
    <bb3e1>   DW_AT_GNU_locviews: 0x3a6ee
 <2><bb3e5>: Abbrev Number: 38 (DW_TAG_call_site)
    <bb3e6>   DW_AT_call_return_pc: 0x471d09
    <bb3ee>   DW_AT_call_tail_call: 1
 <2><bb3ee>: Abbrev Number: 0
 <1><bb3ef>: Abbrev Number: 39 (DW_TAG_subprogram)
    <bb3f0>   DW_AT_external    : 1
    <bb3f0>   DW_AT_name        : (indirect string, offset: 0x3f97): fb_Inkey
    <bb3f4>   DW_AT_decl_file   : 1
    <bb3f5>   DW_AT_decl_line   : 5
    <bb3f6>   DW_AT_decl_column : 18
    <bb3f7>   DW_AT_prototyped  : 1
    <bb3f7>   DW_AT_type        : <0xbac32>
    <bb3fb>   DW_AT_low_pc      : 0x471cd0
    <bb403>   DW_AT_high_pc     : 0x15
    <bb40b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
 <2><bb40d>: Abbrev Number: 21 (DW_TAG_variable)
    <bb40e>   DW_AT_name        : res
    <bb412>   DW_AT_decl_file   : 1
    <bb412>   DW_AT_decl_line   : 7
    <bb413>   DW_AT_decl_column : 12
    <bb414>   DW_AT_type        : <0xbac32>
 <2><bb418>: Abbrev Number: 22 (DW_TAG_call_site)
    <bb419>   DW_AT_call_return_pc: 0x471ce5
    <bb421>   DW_AT_call_tail_call: 1
    <bb421>   DW_AT_call_origin : <0xbb36e>
 <2><bb425>: Abbrev Number: 0
 <1><bb426>: Abbrev Number: 0
  Compilation Unit @ offset 0xbb427:
   Length:        0xb9f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xdc09
   Pointer Size:  8
 <0><bb433>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <bb434>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <bb438>   DW_AT_language    : 29	(C11)
    <bb439>   DW_AT_name        : (indirect line string, offset: 0xe26): src/rtlib/hook_isredir.c
    <bb43d>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <bb441>   DW_AT_low_pc      : 0x471d30
    <bb449>   DW_AT_high_pc     : 0x15
    <bb451>   DW_AT_stmt_list   : 0x66222
 <1><bb455>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb456>   DW_AT_byte_size   : 1
    <bb457>   DW_AT_encoding    : 8	(unsigned char)
    <bb458>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><bb45c>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb45d>   DW_AT_byte_size   : 2
    <bb45e>   DW_AT_encoding    : 7	(unsigned)
    <bb45f>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><bb463>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb464>   DW_AT_byte_size   : 4
    <bb465>   DW_AT_encoding    : 7	(unsigned)
    <bb466>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><bb46a>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb46b>   DW_AT_byte_size   : 8
    <bb46c>   DW_AT_encoding    : 7	(unsigned)
    <bb46d>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><bb471>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb472>   DW_AT_byte_size   : 1
    <bb473>   DW_AT_encoding    : 6	(signed char)
    <bb474>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><bb478>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb479>   DW_AT_byte_size   : 2
    <bb47a>   DW_AT_encoding    : 5	(signed)
    <bb47b>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><bb47f>: Abbrev Number: 20 (DW_TAG_base_type)
    <bb480>   DW_AT_byte_size   : 4
    <bb481>   DW_AT_encoding    : 5	(signed)
    <bb482>   DW_AT_name        : int
 <1><bb486>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb487>   DW_AT_byte_size   : 8
    <bb488>   DW_AT_encoding    : 5	(signed)
    <bb489>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><bb48d>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb48e>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <bb492>   DW_AT_decl_file   : 2
    <bb493>   DW_AT_decl_line   : 153
    <bb494>   DW_AT_decl_column : 27
    <bb495>   DW_AT_type        : <0xbb486>
 <1><bb499>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bb49a>   DW_AT_byte_size   : 8
 <1><bb49b>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb49c>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <bb4a0>   DW_AT_decl_file   : 2
    <bb4a1>   DW_AT_decl_line   : 194
    <bb4a2>   DW_AT_decl_column : 27
    <bb4a3>   DW_AT_type        : <0xbb486>
 <1><bb4a7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb4a8>   DW_AT_byte_size   : 8
    <bb4a8>   DW_AT_type        : <0xbb4ac>
 <1><bb4ac>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb4ad>   DW_AT_byte_size   : 1
    <bb4ae>   DW_AT_encoding    : 6	(signed char)
    <bb4af>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><bb4b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb4b4>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <bb4b8>   DW_AT_decl_file   : 3
    <bb4b9>   DW_AT_decl_line   : 209
    <bb4ba>   DW_AT_decl_column : 23
    <bb4bb>   DW_AT_type        : <0xbb46a>
 <1><bb4bf>: Abbrev Number: 13 (DW_TAG_typedef)
    <bb4c0>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <bb4c4>   DW_AT_decl_file   : 3
    <bb4c5>   DW_AT_decl_line   : 321
    <bb4c7>   DW_AT_decl_column : 24
    <bb4c8>   DW_AT_type        : <0xbb47f>
 <1><bb4cc>: Abbrev Number: 22 (DW_TAG_const_type)
    <bb4cd>   DW_AT_type        : <0xbb4bf>
 <1><bb4d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb4d2>   DW_AT_byte_size   : 8
    <bb4d3>   DW_AT_encoding    : 5	(signed)
    <bb4d4>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><bb4d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb4d9>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <bb4dd>   DW_AT_decl_file   : 4
    <bb4de>   DW_AT_decl_line   : 87
    <bb4df>   DW_AT_decl_column : 19
    <bb4e0>   DW_AT_type        : <0xbb48d>
 <1><bb4e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb4e5>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <bb4e9>   DW_AT_decl_file   : 4
    <bb4ea>   DW_AT_decl_line   : 108
    <bb4eb>   DW_AT_decl_column : 19
    <bb4ec>   DW_AT_type        : <0xbb49b>
 <1><bb4f0>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb4f1>   DW_AT_byte_size   : 8
    <bb4f2>   DW_AT_encoding    : 7	(unsigned)
    <bb4f3>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><bb4f7>: Abbrev Number: 14 (DW_TAG_array_type)
    <bb4f8>   DW_AT_type        : <0xbb4ac>
    <bb4fc>   DW_AT_sibling     : <0xbb507>
 <2><bb500>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <bb501>   DW_AT_type        : <0xbb46a>
    <bb505>   DW_AT_upper_bound : 3
 <2><bb506>: Abbrev Number: 0
 <1><bb507>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb508>   DW_AT_byte_size   : 8
    <bb508>   DW_AT_type        : <0xbb50c>
 <1><bb50c>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><bb50d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb50e>   DW_AT_byte_size   : 8
    <bb50e>   DW_AT_type        : <0xbb4a7>
 <1><bb512>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb513>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <bb517>   DW_AT_decl_file   : 5
    <bb518>   DW_AT_decl_line   : 22
    <bb519>   DW_AT_decl_column : 15
    <bb51a>   DW_AT_type        : <0xbb4d8>
 <1><bb51e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb51f>   DW_AT_byte_size   : 8
    <bb51f>   DW_AT_type        : <0xbb523>
 <1><bb523>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <bb524>   DW_AT_prototyped  : 1
 <1><bb524>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bb525>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <bb529>   DW_AT_byte_size   : 24
    <bb52a>   DW_AT_decl_file   : 6
    <bb52b>   DW_AT_decl_line   : 82
    <bb52c>   DW_AT_decl_column : 16
    <bb52d>   DW_AT_sibling     : <0xbb559>
 <2><bb531>: Abbrev Number: 2 (DW_TAG_member)
    <bb532>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <bb536>   DW_AT_decl_file   : 6
    <bb537>   DW_AT_decl_line   : 83
    <bb538>   DW_AT_decl_column : 21
    <bb539>   DW_AT_type        : <0xbb4a7>
    <bb53d>   DW_AT_data_member_location: 0
 <2><bb53e>: Abbrev Number: 7 (DW_TAG_member)
    <bb53f>   DW_AT_name        : len
    <bb543>   DW_AT_decl_file   : 6
    <bb544>   DW_AT_decl_line   : 84
    <bb545>   DW_AT_decl_column : 21
    <bb546>   DW_AT_type        : <0xbb4e4>
    <bb54a>   DW_AT_data_member_location: 8
 <2><bb54b>: Abbrev Number: 2 (DW_TAG_member)
    <bb54c>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bb550>   DW_AT_decl_file   : 6
    <bb551>   DW_AT_decl_line   : 85
    <bb552>   DW_AT_decl_column : 21
    <bb553>   DW_AT_type        : <0xbb4e4>
    <bb557>   DW_AT_data_member_location: 16
 <2><bb558>: Abbrev Number: 0
 <1><bb559>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb55a>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <bb55e>   DW_AT_decl_file   : 6
    <bb55f>   DW_AT_decl_line   : 86
    <bb560>   DW_AT_decl_column : 3
    <bb561>   DW_AT_type        : <0xbb524>
 <1><bb565>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb566>   DW_AT_byte_size   : 8
    <bb567>   DW_AT_encoding    : 4	(float)
    <bb568>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><bb56c>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb56d>   DW_AT_byte_size   : 4
    <bb56e>   DW_AT_encoding    : 4	(float)
    <bb56f>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><bb573>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb574>   DW_AT_byte_size   : 8
    <bb574>   DW_AT_type        : <0xbb4bf>
 <1><bb578>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <bb579>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <bb57d>   DW_AT_encoding    : 7	(unsigned)
    <bb57e>   DW_AT_byte_size   : 4
    <bb57f>   DW_AT_type        : <0xbb463>
    <bb583>   DW_AT_decl_file   : 7
    <bb584>   DW_AT_decl_line   : 25
    <bb585>   DW_AT_decl_column : 14
    <bb586>   DW_AT_sibling     : <0xbb5a3>
 <2><bb58a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb58b>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <bb58f>   DW_AT_const_value : 0
 <2><bb590>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb591>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <bb595>   DW_AT_const_value : 1
 <2><bb596>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb597>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <bb59b>   DW_AT_const_value : 2
 <2><bb59c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb59d>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <bb5a1>   DW_AT_const_value : 3
 <2><bb5a2>: Abbrev Number: 0
 <1><bb5a3>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb5a4>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <bb5a8>   DW_AT_decl_file   : 7
    <bb5a9>   DW_AT_decl_line   : 30
    <bb5aa>   DW_AT_decl_column : 3
    <bb5ab>   DW_AT_type        : <0xbb578>
 <1><bb5af>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb5b0>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <bb5b4>   DW_AT_decl_file   : 7
    <bb5b5>   DW_AT_decl_line   : 54
    <bb5b6>   DW_AT_decl_column : 15
    <bb5b7>   DW_AT_type        : <0xbb5bb>
 <1><bb5bb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb5bc>   DW_AT_byte_size   : 8
    <bb5bc>   DW_AT_type        : <0xbb5c0>
 <1><bb5c0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb5c1>   DW_AT_prototyped  : 1
    <bb5c1>   DW_AT_type        : <0xbb47f>
    <bb5c5>   DW_AT_sibling     : <0xbb5d4>
 <2><bb5c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb5ca>   DW_AT_type        : <0xbb5d4>
 <2><bb5ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb5cf>   DW_AT_type        : <0xbb47f>
 <2><bb5d3>: Abbrev Number: 0
 <1><bb5d4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb5d5>   DW_AT_byte_size   : 8
    <bb5d5>   DW_AT_type        : <0xbb5d9>
 <1><bb5d9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bb5da>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <bb5de>   DW_AT_byte_size   : 80
    <bb5df>   DW_AT_decl_file   : 7
    <bb5e0>   DW_AT_decl_line   : 97
    <bb5e1>   DW_AT_decl_column : 16
    <bb5e2>   DW_AT_sibling     : <0xbb69d>
 <2><bb5e6>: Abbrev Number: 2 (DW_TAG_member)
    <bb5e7>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <bb5eb>   DW_AT_decl_file   : 7
    <bb5ec>   DW_AT_decl_line   : 98
    <bb5ed>   DW_AT_decl_column : 21
    <bb5ee>   DW_AT_type        : <0xbb47f>
    <bb5f2>   DW_AT_data_member_location: 0
 <2><bb5f3>: Abbrev Number: 7 (DW_TAG_member)
    <bb5f4>   DW_AT_name        : len
    <bb5f8>   DW_AT_decl_file   : 7
    <bb5f9>   DW_AT_decl_line   : 99
    <bb5fa>   DW_AT_decl_column : 21
    <bb5fb>   DW_AT_type        : <0xbb47f>
    <bb5ff>   DW_AT_data_member_location: 4
 <2><bb600>: Abbrev Number: 2 (DW_TAG_member)
    <bb601>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <bb605>   DW_AT_decl_file   : 7
    <bb606>   DW_AT_decl_line   : 100
    <bb607>   DW_AT_decl_column : 21
    <bb608>   DW_AT_type        : <0xbb5a3>
    <bb60c>   DW_AT_data_member_location: 8
 <2><bb60d>: Abbrev Number: 2 (DW_TAG_member)
    <bb60e>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bb612>   DW_AT_decl_file   : 7
    <bb613>   DW_AT_decl_line   : 101
    <bb614>   DW_AT_decl_column : 21
    <bb615>   DW_AT_type        : <0xbb512>
    <bb619>   DW_AT_data_member_location: 16
 <2><bb61a>: Abbrev Number: 2 (DW_TAG_member)
    <bb61b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <bb61f>   DW_AT_decl_file   : 7
    <bb620>   DW_AT_decl_line   : 102
    <bb621>   DW_AT_decl_column : 21
    <bb622>   DW_AT_type        : <0xbb47f>
    <bb626>   DW_AT_data_member_location: 24
 <2><bb627>: Abbrev Number: 2 (DW_TAG_member)
    <bb628>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <bb62c>   DW_AT_decl_file   : 7
    <bb62d>   DW_AT_decl_line   : 103
    <bb62e>   DW_AT_decl_column : 21
    <bb62f>   DW_AT_type        : <0xbb47f>
    <bb633>   DW_AT_data_member_location: 28
 <2><bb634>: Abbrev Number: 2 (DW_TAG_member)
    <bb635>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <bb639>   DW_AT_decl_file   : 7
    <bb63a>   DW_AT_decl_line   : 104
    <bb63b>   DW_AT_decl_column : 21
    <bb63c>   DW_AT_type        : <0xbb47f>
    <bb640>   DW_AT_data_member_location: 32
 <2><bb641>: Abbrev Number: 2 (DW_TAG_member)
    <bb642>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <bb646>   DW_AT_decl_file   : 7
    <bb647>   DW_AT_decl_line   : 105
    <bb648>   DW_AT_decl_column : 21
    <bb649>   DW_AT_type        : <0xbb463>
    <bb64d>   DW_AT_data_member_location: 36
 <2><bb64e>: Abbrev Number: 2 (DW_TAG_member)
    <bb64f>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <bb653>   DW_AT_decl_file   : 7
    <bb654>   DW_AT_decl_line   : 106
    <bb655>   DW_AT_decl_column : 21
    <bb656>   DW_AT_type        : <0xbb463>
    <bb65a>   DW_AT_data_member_location: 40
 <2><bb65b>: Abbrev Number: 2 (DW_TAG_member)
    <bb65c>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <bb660>   DW_AT_decl_file   : 7
    <bb661>   DW_AT_decl_line   : 109
    <bb662>   DW_AT_decl_column : 21
    <bb663>   DW_AT_type        : <0xbb4f7>
    <bb667>   DW_AT_data_member_location: 44
 <2><bb668>: Abbrev Number: 2 (DW_TAG_member)
    <bb669>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <bb66d>   DW_AT_decl_file   : 7
    <bb66e>   DW_AT_decl_line   : 110
    <bb66f>   DW_AT_decl_column : 21
    <bb670>   DW_AT_type        : <0xbb4b3>
    <bb674>   DW_AT_data_member_location: 48
 <2><bb675>: Abbrev Number: 2 (DW_TAG_member)
    <bb676>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <bb67a>   DW_AT_decl_file   : 7
    <bb67b>   DW_AT_decl_line   : 112
    <bb67c>   DW_AT_decl_column : 22
    <bb67d>   DW_AT_type        : <0xbb935>
    <bb681>   DW_AT_data_member_location: 56
 <2><bb682>: Abbrev Number: 2 (DW_TAG_member)
    <bb683>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <bb687>   DW_AT_decl_file   : 7
    <bb688>   DW_AT_decl_line   : 114
    <bb689>   DW_AT_decl_column : 14
    <bb68a>   DW_AT_type        : <0xbb499>
    <bb68e>   DW_AT_data_member_location: 64
 <2><bb68f>: Abbrev Number: 2 (DW_TAG_member)
    <bb690>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <bb694>   DW_AT_decl_file   : 7
    <bb695>   DW_AT_decl_line   : 116
    <bb696>   DW_AT_decl_column : 22
    <bb697>   DW_AT_type        : <0xbb5d4>
    <bb69b>   DW_AT_data_member_location: 72
 <2><bb69c>: Abbrev Number: 0
 <1><bb69d>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb69e>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <bb6a2>   DW_AT_decl_file   : 7
    <bb6a3>   DW_AT_decl_line   : 59
    <bb6a4>   DW_AT_decl_column : 15
    <bb6a5>   DW_AT_type        : <0xbb6a9>
 <1><bb6a9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb6aa>   DW_AT_byte_size   : 8
    <bb6aa>   DW_AT_type        : <0xbb6ae>
 <1><bb6ae>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb6af>   DW_AT_prototyped  : 1
    <bb6af>   DW_AT_type        : <0xbb47f>
    <bb6b3>   DW_AT_sibling     : <0xbb6bd>
 <2><bb6b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb6b8>   DW_AT_type        : <0xbb5d4>
 <2><bb6bc>: Abbrev Number: 0
 <1><bb6bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb6be>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <bb6c2>   DW_AT_decl_file   : 7
    <bb6c3>   DW_AT_decl_line   : 60
    <bb6c4>   DW_AT_decl_column : 15
    <bb6c5>   DW_AT_type        : <0xbb6a9>
 <1><bb6c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb6ca>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <bb6ce>   DW_AT_decl_file   : 7
    <bb6cf>   DW_AT_decl_line   : 61
    <bb6d0>   DW_AT_decl_column : 15
    <bb6d1>   DW_AT_type        : <0xbb6d5>
 <1><bb6d5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb6d6>   DW_AT_byte_size   : 8
    <bb6d6>   DW_AT_type        : <0xbb6da>
 <1><bb6da>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb6db>   DW_AT_prototyped  : 1
    <bb6db>   DW_AT_type        : <0xbb47f>
    <bb6df>   DW_AT_sibling     : <0xbb6f3>
 <2><bb6e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb6e4>   DW_AT_type        : <0xbb5d4>
 <2><bb6e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb6e9>   DW_AT_type        : <0xbb512>
 <2><bb6ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb6ee>   DW_AT_type        : <0xbb47f>
 <2><bb6f2>: Abbrev Number: 0
 <1><bb6f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb6f4>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <bb6f8>   DW_AT_decl_file   : 7
    <bb6f9>   DW_AT_decl_line   : 62
    <bb6fa>   DW_AT_decl_column : 15
    <bb6fb>   DW_AT_type        : <0xbb6ff>
 <1><bb6ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb700>   DW_AT_byte_size   : 8
    <bb700>   DW_AT_type        : <0xbb704>
 <1><bb704>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb705>   DW_AT_prototyped  : 1
    <bb705>   DW_AT_type        : <0xbb47f>
    <bb709>   DW_AT_sibling     : <0xbb718>
 <2><bb70d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb70e>   DW_AT_type        : <0xbb5d4>
 <2><bb712>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb713>   DW_AT_type        : <0xbb718>
 <2><bb717>: Abbrev Number: 0
 <1><bb718>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb719>   DW_AT_byte_size   : 8
    <bb719>   DW_AT_type        : <0xbb512>
 <1><bb71d>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb71e>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <bb722>   DW_AT_decl_file   : 7
    <bb723>   DW_AT_decl_line   : 63
    <bb724>   DW_AT_decl_column : 15
    <bb725>   DW_AT_type        : <0xbb729>
 <1><bb729>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb72a>   DW_AT_byte_size   : 8
    <bb72a>   DW_AT_type        : <0xbb72e>
 <1><bb72e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb72f>   DW_AT_prototyped  : 1
    <bb72f>   DW_AT_type        : <0xbb47f>
    <bb733>   DW_AT_sibling     : <0xbb747>
 <2><bb737>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb738>   DW_AT_type        : <0xbb5d4>
 <2><bb73c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb73d>   DW_AT_type        : <0xbb499>
 <2><bb741>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb742>   DW_AT_type        : <0xbb747>
 <2><bb746>: Abbrev Number: 0
 <1><bb747>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb748>   DW_AT_byte_size   : 8
    <bb748>   DW_AT_type        : <0xbb4b3>
 <1><bb74c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb74d>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <bb751>   DW_AT_decl_file   : 7
    <bb752>   DW_AT_decl_line   : 65
    <bb753>   DW_AT_decl_column : 15
    <bb754>   DW_AT_type        : <0xbb758>
 <1><bb758>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb759>   DW_AT_byte_size   : 8
    <bb759>   DW_AT_type        : <0xbb75d>
 <1><bb75d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb75e>   DW_AT_prototyped  : 1
    <bb75e>   DW_AT_type        : <0xbb47f>
    <bb762>   DW_AT_sibling     : <0xbb776>
 <2><bb766>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb767>   DW_AT_type        : <0xbb5d4>
 <2><bb76b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb76c>   DW_AT_type        : <0xbb573>
 <2><bb770>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb771>   DW_AT_type        : <0xbb747>
 <2><bb775>: Abbrev Number: 0
 <1><bb776>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb777>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <bb77b>   DW_AT_decl_file   : 7
    <bb77c>   DW_AT_decl_line   : 67
    <bb77d>   DW_AT_decl_column : 15
    <bb77e>   DW_AT_type        : <0xbb782>
 <1><bb782>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb783>   DW_AT_byte_size   : 8
    <bb783>   DW_AT_type        : <0xbb787>
 <1><bb787>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb788>   DW_AT_prototyped  : 1
    <bb788>   DW_AT_type        : <0xbb47f>
    <bb78c>   DW_AT_sibling     : <0xbb7a0>
 <2><bb790>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb791>   DW_AT_type        : <0xbb5d4>
 <2><bb795>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb796>   DW_AT_type        : <0xbb507>
 <2><bb79a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb79b>   DW_AT_type        : <0xbb4b3>
 <2><bb79f>: Abbrev Number: 0
 <1><bb7a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb7a1>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <bb7a5>   DW_AT_decl_file   : 7
    <bb7a6>   DW_AT_decl_line   : 69
    <bb7a7>   DW_AT_decl_column : 15
    <bb7a8>   DW_AT_type        : <0xbb7ac>
 <1><bb7ac>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb7ad>   DW_AT_byte_size   : 8
    <bb7ad>   DW_AT_type        : <0xbb7b1>
 <1><bb7b1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb7b2>   DW_AT_prototyped  : 1
    <bb7b2>   DW_AT_type        : <0xbb47f>
    <bb7b6>   DW_AT_sibling     : <0xbb7ca>
 <2><bb7ba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7bb>   DW_AT_type        : <0xbb5d4>
 <2><bb7bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7c0>   DW_AT_type        : <0xbb7ca>
 <2><bb7c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7c5>   DW_AT_type        : <0xbb4b3>
 <2><bb7c9>: Abbrev Number: 0
 <1><bb7ca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb7cb>   DW_AT_byte_size   : 8
    <bb7cb>   DW_AT_type        : <0xbb4cc>
 <1><bb7cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb7d0>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <bb7d4>   DW_AT_decl_file   : 7
    <bb7d5>   DW_AT_decl_line   : 71
    <bb7d6>   DW_AT_decl_column : 15
    <bb7d7>   DW_AT_type        : <0xbb7db>
 <1><bb7db>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb7dc>   DW_AT_byte_size   : 8
    <bb7dc>   DW_AT_type        : <0xbb7e0>
 <1><bb7e0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb7e1>   DW_AT_prototyped  : 1
    <bb7e1>   DW_AT_type        : <0xbb47f>
    <bb7e5>   DW_AT_sibling     : <0xbb7f9>
 <2><bb7e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7ea>   DW_AT_type        : <0xbb5d4>
 <2><bb7ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7ef>   DW_AT_type        : <0xbb512>
 <2><bb7f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb7f4>   DW_AT_type        : <0xbb512>
 <2><bb7f8>: Abbrev Number: 0
 <1><bb7f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb7fa>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <bb7fe>   DW_AT_decl_file   : 7
    <bb7ff>   DW_AT_decl_line   : 73
    <bb800>   DW_AT_decl_column : 15
    <bb801>   DW_AT_type        : <0xbb7db>
 <1><bb805>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb806>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <bb80a>   DW_AT_decl_file   : 7
    <bb80b>   DW_AT_decl_line   : 75
    <bb80c>   DW_AT_decl_column : 15
    <bb80d>   DW_AT_type        : <0xbb811>
 <1><bb811>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb812>   DW_AT_byte_size   : 8
    <bb812>   DW_AT_type        : <0xbb816>
 <1><bb816>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb817>   DW_AT_prototyped  : 1
    <bb817>   DW_AT_type        : <0xbb47f>
    <bb81b>   DW_AT_sibling     : <0xbb82a>
 <2><bb81f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb820>   DW_AT_type        : <0xbb5d4>
 <2><bb824>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb825>   DW_AT_type        : <0xbb82a>
 <2><bb829>: Abbrev Number: 0
 <1><bb82a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb82b>   DW_AT_byte_size   : 8
    <bb82b>   DW_AT_type        : <0xbb559>
 <1><bb82f>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb830>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <bb834>   DW_AT_decl_file   : 7
    <bb835>   DW_AT_decl_line   : 76
    <bb836>   DW_AT_decl_column : 15
    <bb837>   DW_AT_type        : <0xbb83b>
 <1><bb83b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb83c>   DW_AT_byte_size   : 8
    <bb83c>   DW_AT_type        : <0xbb840>
 <1><bb840>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bb841>   DW_AT_prototyped  : 1
    <bb841>   DW_AT_type        : <0xbb47f>
    <bb845>   DW_AT_sibling     : <0xbb859>
 <2><bb849>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb84a>   DW_AT_type        : <0xbb5d4>
 <2><bb84e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb84f>   DW_AT_type        : <0xbb573>
 <2><bb853>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bb854>   DW_AT_type        : <0xbb4e4>
 <2><bb858>: Abbrev Number: 0
 <1><bb859>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb85a>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <bb85e>   DW_AT_decl_file   : 7
    <bb85f>   DW_AT_decl_line   : 77
    <bb860>   DW_AT_decl_column : 15
    <bb861>   DW_AT_type        : <0xbb6a9>
 <1><bb865>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bb866>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <bb86a>   DW_AT_byte_size   : 112
    <bb86b>   DW_AT_decl_file   : 7
    <bb86c>   DW_AT_decl_line   : 80
    <bb86d>   DW_AT_decl_column : 16
    <bb86e>   DW_AT_sibling     : <0xbb929>
 <2><bb872>: Abbrev Number: 2 (DW_TAG_member)
    <bb873>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <bb877>   DW_AT_decl_file   : 7
    <bb878>   DW_AT_decl_line   : 81
    <bb879>   DW_AT_decl_column : 25
    <bb87a>   DW_AT_type        : <0xbb69d>
    <bb87e>   DW_AT_data_member_location: 0
 <2><bb87f>: Abbrev Number: 2 (DW_TAG_member)
    <bb880>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <bb884>   DW_AT_decl_file   : 7
    <bb885>   DW_AT_decl_line   : 82
    <bb886>   DW_AT_decl_column : 25
    <bb887>   DW_AT_type        : <0xbb6bd>
    <bb88b>   DW_AT_data_member_location: 8
 <2><bb88c>: Abbrev Number: 2 (DW_TAG_member)
    <bb88d>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <bb891>   DW_AT_decl_file   : 7
    <bb892>   DW_AT_decl_line   : 83
    <bb893>   DW_AT_decl_column : 25
    <bb894>   DW_AT_type        : <0xbb6c9>
    <bb898>   DW_AT_data_member_location: 16
 <2><bb899>: Abbrev Number: 2 (DW_TAG_member)
    <bb89a>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <bb89e>   DW_AT_decl_file   : 7
    <bb89f>   DW_AT_decl_line   : 84
    <bb8a0>   DW_AT_decl_column : 25
    <bb8a1>   DW_AT_type        : <0xbb6f3>
    <bb8a5>   DW_AT_data_member_location: 24
 <2><bb8a6>: Abbrev Number: 2 (DW_TAG_member)
    <bb8a7>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <bb8ab>   DW_AT_decl_file   : 7
    <bb8ac>   DW_AT_decl_line   : 85
    <bb8ad>   DW_AT_decl_column : 25
    <bb8ae>   DW_AT_type        : <0xbb71d>
    <bb8b2>   DW_AT_data_member_location: 32
 <2><bb8b3>: Abbrev Number: 2 (DW_TAG_member)
    <bb8b4>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <bb8b8>   DW_AT_decl_file   : 7
    <bb8b9>   DW_AT_decl_line   : 86
    <bb8ba>   DW_AT_decl_column : 25
    <bb8bb>   DW_AT_type        : <0xbb74c>
    <bb8bf>   DW_AT_data_member_location: 40
 <2><bb8c0>: Abbrev Number: 2 (DW_TAG_member)
    <bb8c1>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <bb8c5>   DW_AT_decl_file   : 7
    <bb8c6>   DW_AT_decl_line   : 87
    <bb8c7>   DW_AT_decl_column : 25
    <bb8c8>   DW_AT_type        : <0xbb776>
    <bb8cc>   DW_AT_data_member_location: 48
 <2><bb8cd>: Abbrev Number: 2 (DW_TAG_member)
    <bb8ce>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <bb8d2>   DW_AT_decl_file   : 7
    <bb8d3>   DW_AT_decl_line   : 88
    <bb8d4>   DW_AT_decl_column : 25
    <bb8d5>   DW_AT_type        : <0xbb7a0>
    <bb8d9>   DW_AT_data_member_location: 56
 <2><bb8da>: Abbrev Number: 2 (DW_TAG_member)
    <bb8db>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <bb8df>   DW_AT_decl_file   : 7
    <bb8e0>   DW_AT_decl_line   : 89
    <bb8e1>   DW_AT_decl_column : 25
    <bb8e2>   DW_AT_type        : <0xbb7cf>
    <bb8e6>   DW_AT_data_member_location: 64
 <2><bb8e7>: Abbrev Number: 2 (DW_TAG_member)
    <bb8e8>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <bb8ec>   DW_AT_decl_file   : 7
    <bb8ed>   DW_AT_decl_line   : 90
    <bb8ee>   DW_AT_decl_column : 25
    <bb8ef>   DW_AT_type        : <0xbb7f9>
    <bb8f3>   DW_AT_data_member_location: 72
 <2><bb8f4>: Abbrev Number: 2 (DW_TAG_member)
    <bb8f5>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <bb8f9>   DW_AT_decl_file   : 7
    <bb8fa>   DW_AT_decl_line   : 91
    <bb8fb>   DW_AT_decl_column : 25
    <bb8fc>   DW_AT_type        : <0xbb805>
    <bb900>   DW_AT_data_member_location: 80
 <2><bb901>: Abbrev Number: 2 (DW_TAG_member)
    <bb902>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <bb906>   DW_AT_decl_file   : 7
    <bb907>   DW_AT_decl_line   : 92
    <bb908>   DW_AT_decl_column : 25
    <bb909>   DW_AT_type        : <0xbb82f>
    <bb90d>   DW_AT_data_member_location: 88
 <2><bb90e>: Abbrev Number: 2 (DW_TAG_member)
    <bb90f>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <bb913>   DW_AT_decl_file   : 7
    <bb914>   DW_AT_decl_line   : 93
    <bb915>   DW_AT_decl_column : 25
    <bb916>   DW_AT_type        : <0xbb5af>
    <bb91a>   DW_AT_data_member_location: 96
 <2><bb91b>: Abbrev Number: 2 (DW_TAG_member)
    <bb91c>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <bb920>   DW_AT_decl_file   : 7
    <bb921>   DW_AT_decl_line   : 94
    <bb922>   DW_AT_decl_column : 25
    <bb923>   DW_AT_type        : <0xbb859>
    <bb927>   DW_AT_data_member_location: 104
 <2><bb928>: Abbrev Number: 0
 <1><bb929>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb92a>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <bb92e>   DW_AT_decl_file   : 7
    <bb92f>   DW_AT_decl_line   : 95
    <bb930>   DW_AT_decl_column : 3
    <bb931>   DW_AT_type        : <0xbb865>
 <1><bb935>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bb936>   DW_AT_byte_size   : 8
    <bb936>   DW_AT_type        : <0xbb929>
 <1><bb93a>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb93b>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <bb93f>   DW_AT_decl_file   : 7
    <bb940>   DW_AT_decl_line   : 117
    <bb941>   DW_AT_decl_column : 3
    <bb942>   DW_AT_type        : <0xbb5d9>
 <1><bb946>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bb947>   DW_AT_byte_size   : 8
    <bb948>   DW_AT_decl_file   : 8
    <bb948>   DW_AT_decl_line   : 4
    <bb949>   DW_AT_decl_column : 3
    <bb949>   DW_AT_sibling     : <0xbb968>
 <2><bb94d>: Abbrev Number: 2 (DW_TAG_member)
    <bb94e>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <bb952>   DW_AT_decl_file   : 8
    <bb953>   DW_AT_decl_line   : 5
    <bb954>   DW_AT_decl_column : 8
    <bb955>   DW_AT_type        : <0xbb47f>
    <bb959>   DW_AT_data_member_location: 0
 <2><bb95a>: Abbrev Number: 2 (DW_TAG_member)
    <bb95b>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <bb95f>   DW_AT_decl_file   : 8
    <bb960>   DW_AT_decl_line   : 6
    <bb961>   DW_AT_decl_column : 8
    <bb962>   DW_AT_type        : <0xbb47f>
    <bb966>   DW_AT_data_member_location: 4
 <2><bb967>: Abbrev Number: 0
 <1><bb968>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bb969>   DW_AT_byte_size   : 16
    <bb96a>   DW_AT_decl_file   : 8
    <bb96a>   DW_AT_decl_line   : 8
    <bb96b>   DW_AT_decl_column : 3
    <bb96b>   DW_AT_sibling     : <0xbb99e>
 <2><bb96f>: Abbrev Number: 7 (DW_TAG_member)
    <bb970>   DW_AT_name        : x
    <bb972>   DW_AT_decl_file   : 8
    <bb973>   DW_AT_decl_line   : 9
    <bb974>   DW_AT_decl_column : 8
    <bb975>   DW_AT_type        : <0xbb47f>
    <bb979>   DW_AT_data_member_location: 0
 <2><bb97a>: Abbrev Number: 7 (DW_TAG_member)
    <bb97b>   DW_AT_name        : y
    <bb97d>   DW_AT_decl_file   : 8
    <bb97e>   DW_AT_decl_line   : 9
    <bb97f>   DW_AT_decl_column : 11
    <bb980>   DW_AT_type        : <0xbb47f>
    <bb984>   DW_AT_data_member_location: 4
 <2><bb985>: Abbrev Number: 7 (DW_TAG_member)
    <bb986>   DW_AT_name        : dx
    <bb989>   DW_AT_decl_file   : 8
    <bb98a>   DW_AT_decl_line   : 10
    <bb98b>   DW_AT_decl_column : 8
    <bb98c>   DW_AT_type        : <0xbb47f>
    <bb990>   DW_AT_data_member_location: 8
 <2><bb991>: Abbrev Number: 7 (DW_TAG_member)
    <bb992>   DW_AT_name        : dy
    <bb995>   DW_AT_decl_file   : 8
    <bb996>   DW_AT_decl_line   : 10
    <bb997>   DW_AT_decl_column : 12
    <bb998>   DW_AT_type        : <0xbb47f>
    <bb99c>   DW_AT_data_member_location: 12
 <2><bb99d>: Abbrev Number: 0
 <1><bb99e>: Abbrev Number: 27 (DW_TAG_union_type)
    <bb99f>   DW_AT_byte_size   : 16
    <bb9a0>   DW_AT_decl_file   : 8
    <bb9a1>   DW_AT_decl_line   : 3
    <bb9a2>   DW_AT_decl_column : 2
    <bb9a3>   DW_AT_sibling     : <0xbb9ce>
 <2><bb9a7>: Abbrev Number: 16 (DW_TAG_member)
    <bb9a8>   DW_AT_type        : <0xbb946>
 <2><bb9ac>: Abbrev Number: 16 (DW_TAG_member)
    <bb9ad>   DW_AT_type        : <0xbb968>
 <2><bb9b1>: Abbrev Number: 28 (DW_TAG_member)
    <bb9b2>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <bb9b6>   DW_AT_decl_file   : 8
    <bb9b7>   DW_AT_decl_line   : 12
    <bb9b8>   DW_AT_decl_column : 7
    <bb9b9>   DW_AT_type        : <0xbb47f>
 <2><bb9bd>: Abbrev Number: 17 (DW_TAG_member)
    <bb9be>   DW_AT_name        : z
    <bb9c0>   DW_AT_decl_file   : 8
    <bb9c0>   DW_AT_decl_line   : 13
    <bb9c1>   DW_AT_decl_column : 7
    <bb9c1>   DW_AT_type        : <0xbb47f>
 <2><bb9c5>: Abbrev Number: 17 (DW_TAG_member)
    <bb9c6>   DW_AT_name        : w
    <bb9c8>   DW_AT_decl_file   : 8
    <bb9c8>   DW_AT_decl_line   : 14
    <bb9c9>   DW_AT_decl_column : 7
    <bb9c9>   DW_AT_type        : <0xbb47f>
 <2><bb9cd>: Abbrev Number: 0
 <1><bb9ce>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bb9cf>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <bb9d3>   DW_AT_byte_size   : 20
    <bb9d4>   DW_AT_decl_file   : 8
    <bb9d5>   DW_AT_decl_line   : 1
    <bb9d6>   DW_AT_decl_column : 8
    <bb9d7>   DW_AT_sibling     : <0xbb9ef>
 <2><bb9db>: Abbrev Number: 2 (DW_TAG_member)
    <bb9dc>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <bb9e0>   DW_AT_decl_file   : 8
    <bb9e1>   DW_AT_decl_line   : 2
    <bb9e2>   DW_AT_decl_column : 6
    <bb9e3>   DW_AT_type        : <0xbb47f>
    <bb9e7>   DW_AT_data_member_location: 0
 <2><bb9e8>: Abbrev Number: 29 (DW_TAG_member)
    <bb9e9>   DW_AT_type        : <0xbb99e>
    <bb9ed>   DW_AT_data_member_location: 4
 <2><bb9ee>: Abbrev Number: 0
 <1><bb9ef>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb9f0>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <bb9f4>   DW_AT_decl_file   : 8
    <bb9f5>   DW_AT_decl_line   : 18
    <bb9f6>   DW_AT_decl_column : 23
    <bb9f7>   DW_AT_type        : <0xbb9ce>
 <1><bb9fb>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb9fc>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <bba00>   DW_AT_decl_file   : 9
    <bba01>   DW_AT_decl_line   : 1
    <bba02>   DW_AT_decl_column : 23
    <bba03>   DW_AT_type        : <0xbba07>
 <1><bba07>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bba08>   DW_AT_byte_size   : 8
    <bba08>   DW_AT_type        : <0xbba0c>
 <1><bba0c>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <bba0d>   DW_AT_prototyped  : 1
    <bba0d>   DW_AT_type        : <0xbb82a>
 <1><bba11>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba12>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <bba16>   DW_AT_decl_file   : 9
    <bba17>   DW_AT_decl_line   : 2
    <bba18>   DW_AT_decl_column : 23
    <bba19>   DW_AT_type        : <0xbba1d>
 <1><bba1d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bba1e>   DW_AT_byte_size   : 8
    <bba1e>   DW_AT_type        : <0xbba22>
 <1><bba22>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <bba23>   DW_AT_prototyped  : 1
    <bba23>   DW_AT_type        : <0xbb47f>
 <1><bba27>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba28>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <bba2c>   DW_AT_decl_file   : 9
    <bba2d>   DW_AT_decl_line   : 3
    <bba2e>   DW_AT_decl_column : 23
    <bba2f>   DW_AT_type        : <0xbba1d>
 <1><bba33>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba34>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <bba38>   DW_AT_decl_file   : 9
    <bba39>   DW_AT_decl_line   : 10
    <bba3a>   DW_AT_decl_column : 23
    <bba3b>   DW_AT_type        : <0xbba3f>
 <1><bba3f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bba40>   DW_AT_byte_size   : 8
    <bba40>   DW_AT_type        : <0xbba44>
 <1><bba44>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bba45>   DW_AT_prototyped  : 1
    <bba45>   DW_AT_sibling     : <0xbba4f>
 <2><bba49>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bba4a>   DW_AT_type        : <0xbb47f>
 <2><bba4e>: Abbrev Number: 0
 <1><bba4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba50>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <bba54>   DW_AT_decl_file   : 9
    <bba55>   DW_AT_decl_line   : 14
    <bba56>   DW_AT_decl_column : 23
    <bba57>   DW_AT_type        : <0xbba5b>
 <1><bba5b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bba5c>   DW_AT_byte_size   : 8
    <bba5c>   DW_AT_type        : <0xbba60>
 <1><bba60>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bba61>   DW_AT_prototyped  : 1
    <bba61>   DW_AT_type        : <0xbb47f>
    <bba65>   DW_AT_sibling     : <0xbba79>
 <2><bba69>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bba6a>   DW_AT_type        : <0xbb47f>
 <2><bba6e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bba6f>   DW_AT_type        : <0xbb47f>
 <2><bba73>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bba74>   DW_AT_type        : <0xbb47f>
 <2><bba78>: Abbrev Number: 0
 <1><bba79>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba7a>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <bba7e>   DW_AT_decl_file   : 9
    <bba7f>   DW_AT_decl_line   : 18
    <bba80>   DW_AT_decl_column : 23
    <bba81>   DW_AT_type        : <0xbba5b>
 <1><bba85>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba86>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <bba8a>   DW_AT_decl_file   : 9
    <bba8b>   DW_AT_decl_line   : 24
    <bba8c>   DW_AT_decl_column : 23
    <bba8d>   DW_AT_type        : <0xbb51e>
 <1><bba91>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba92>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <bba96>   DW_AT_decl_file   : 9
    <bba97>   DW_AT_decl_line   : 28
    <bba98>   DW_AT_decl_column : 23
    <bba99>   DW_AT_type        : <0xbba9d>
 <1><bba9d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bba9e>   DW_AT_byte_size   : 8
    <bba9e>   DW_AT_type        : <0xbbaa2>
 <1><bbaa2>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbaa3>   DW_AT_prototyped  : 1
    <bbaa3>   DW_AT_type        : <0xbb47f>
    <bbaa7>   DW_AT_sibling     : <0xbbab6>
 <2><bbaab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbaac>   DW_AT_type        : <0xbb47f>
 <2><bbab0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbab1>   DW_AT_type        : <0xbb47f>
 <2><bbab5>: Abbrev Number: 0
 <1><bbab6>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbab7>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <bbabb>   DW_AT_decl_file   : 9
    <bbabc>   DW_AT_decl_line   : 34
    <bbabd>   DW_AT_decl_column : 23
    <bbabe>   DW_AT_type        : <0xbba1d>
 <1><bbac2>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbac3>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <bbac7>   DW_AT_decl_file   : 9
    <bbac8>   DW_AT_decl_line   : 35
    <bbac9>   DW_AT_decl_column : 23
    <bbaca>   DW_AT_type        : <0xbba1d>
 <1><bbace>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbacf>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <bbad3>   DW_AT_decl_file   : 9
    <bbad4>   DW_AT_decl_line   : 36
    <bbad5>   DW_AT_decl_column : 23
    <bbad6>   DW_AT_type        : <0xbbada>
 <1><bbada>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbadb>   DW_AT_byte_size   : 8
    <bbadb>   DW_AT_type        : <0xbbadf>
 <1><bbadf>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bbae0>   DW_AT_prototyped  : 1
    <bbae0>   DW_AT_sibling     : <0xbbaef>
 <2><bbae4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbae5>   DW_AT_type        : <0xbbaef>
 <2><bbae9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbaea>   DW_AT_type        : <0xbbaef>
 <2><bbaee>: Abbrev Number: 0
 <1><bbaef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbaf0>   DW_AT_byte_size   : 8
    <bbaf0>   DW_AT_type        : <0xbb47f>
 <1><bbaf4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbaf5>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <bbaf9>   DW_AT_decl_file   : 9
    <bbafa>   DW_AT_decl_line   : 37
    <bbafb>   DW_AT_decl_column : 23
    <bbafc>   DW_AT_type        : <0xbbada>
 <1><bbb00>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbb01>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <bbb05>   DW_AT_decl_file   : 9
    <bbb06>   DW_AT_decl_line   : 45
    <bbb07>   DW_AT_decl_column : 24
    <bbb08>   DW_AT_type        : <0xbbb0c>
 <1><bbb0c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbb0d>   DW_AT_byte_size   : 8
    <bbb0d>   DW_AT_type        : <0xbbb11>
 <1><bbb11>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbb12>   DW_AT_prototyped  : 1
    <bbb12>   DW_AT_type        : <0xbb463>
    <bbb16>   DW_AT_sibling     : <0xbbb2a>
 <2><bbb1a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb1b>   DW_AT_type        : <0xbb47f>
 <2><bbb1f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb20>   DW_AT_type        : <0xbb47f>
 <2><bbb24>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb25>   DW_AT_type        : <0xbb47f>
 <2><bbb29>: Abbrev Number: 0
 <1><bbb2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbb2b>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <bbb2f>   DW_AT_decl_file   : 9
    <bbb30>   DW_AT_decl_line   : 48
    <bbb31>   DW_AT_decl_column : 23
    <bbb32>   DW_AT_type        : <0xbbb36>
 <1><bbb36>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbb37>   DW_AT_byte_size   : 8
    <bbb37>   DW_AT_type        : <0xbbb3b>
 <1><bbb3b>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bbb3c>   DW_AT_prototyped  : 1
    <bbb3c>   DW_AT_sibling     : <0xbbb50>
 <2><bbb40>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb41>   DW_AT_type        : <0xbb507>
 <2><bbb45>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb46>   DW_AT_type        : <0xbb4b3>
 <2><bbb4a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb4b>   DW_AT_type        : <0xbb47f>
 <2><bbb4f>: Abbrev Number: 0
 <1><bbb50>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbb51>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <bbb55>   DW_AT_decl_file   : 9
    <bbb56>   DW_AT_decl_line   : 49
    <bbb57>   DW_AT_decl_column : 23
    <bbb58>   DW_AT_type        : <0xbbb5c>
 <1><bbb5c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbb5d>   DW_AT_byte_size   : 8
    <bbb5d>   DW_AT_type        : <0xbbb61>
 <1><bbb61>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bbb62>   DW_AT_prototyped  : 1
    <bbb62>   DW_AT_sibling     : <0xbbb76>
 <2><bbb66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb67>   DW_AT_type        : <0xbb7ca>
 <2><bbb6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb6c>   DW_AT_type        : <0xbb4b3>
 <2><bbb70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb71>   DW_AT_type        : <0xbb47f>
 <2><bbb75>: Abbrev Number: 0
 <1><bbb76>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbb77>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <bbb7b>   DW_AT_decl_file   : 9
    <bbb7c>   DW_AT_decl_line   : 51
    <bbb7d>   DW_AT_decl_column : 24
    <bbb7e>   DW_AT_type        : <0xbbb82>
 <1><bbb82>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbb83>   DW_AT_byte_size   : 8
    <bbb83>   DW_AT_type        : <0xbbb87>
 <1><bbb87>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbb88>   DW_AT_prototyped  : 1
    <bbb88>   DW_AT_type        : <0xbb4a7>
    <bbb8c>   DW_AT_sibling     : <0xbbb9b>
 <2><bbb90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb91>   DW_AT_type        : <0xbb4a7>
 <2><bbb95>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbb96>   DW_AT_type        : <0xbb4e4>
 <2><bbb9a>: Abbrev Number: 0
 <1><bbb9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbb9c>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <bbba0>   DW_AT_decl_file   : 9
    <bbba1>   DW_AT_decl_line   : 54
    <bbba2>   DW_AT_decl_column : 23
    <bbba3>   DW_AT_type        : <0xbbba7>
 <1><bbba7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbba8>   DW_AT_byte_size   : 8
    <bbba8>   DW_AT_type        : <0xbbbac>
 <1><bbbac>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbbad>   DW_AT_prototyped  : 1
    <bbbad>   DW_AT_type        : <0xbb47f>
    <bbbb1>   DW_AT_sibling     : <0xbbbd4>
 <2><bbbb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbb6>   DW_AT_type        : <0xbb82a>
 <2><bbbba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbbb>   DW_AT_type        : <0xbb499>
 <2><bbbbf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbc0>   DW_AT_type        : <0xbb4e4>
 <2><bbbc4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbc5>   DW_AT_type        : <0xbb47f>
 <2><bbbc9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbca>   DW_AT_type        : <0xbb47f>
 <2><bbbce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbcf>   DW_AT_type        : <0xbb47f>
 <2><bbbd3>: Abbrev Number: 0
 <1><bbbd4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbbd5>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <bbbd9>   DW_AT_decl_file   : 9
    <bbbda>   DW_AT_decl_line   : 56
    <bbbdb>   DW_AT_decl_column : 23
    <bbbdc>   DW_AT_type        : <0xbbbe0>
 <1><bbbe0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbbe1>   DW_AT_byte_size   : 8
    <bbbe1>   DW_AT_type        : <0xbbbe5>
 <1><bbbe5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbbe6>   DW_AT_prototyped  : 1
    <bbbe6>   DW_AT_type        : <0xbb47f>
    <bbbea>   DW_AT_sibling     : <0xbbc08>
 <2><bbbee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbef>   DW_AT_type        : <0xbb7ca>
 <2><bbbf3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbf4>   DW_AT_type        : <0xbb573>
 <2><bbbf8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbf9>   DW_AT_type        : <0xbb4e4>
 <2><bbbfd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbbfe>   DW_AT_type        : <0xbb47f>
 <2><bbc02>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc03>   DW_AT_type        : <0xbb47f>
 <2><bbc07>: Abbrev Number: 0
 <1><bbc08>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbc09>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <bbc0d>   DW_AT_decl_file   : 9
    <bbc0e>   DW_AT_decl_line   : 67
    <bbc0f>   DW_AT_decl_column : 23
    <bbc10>   DW_AT_type        : <0xbbc14>
 <1><bbc14>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbc15>   DW_AT_byte_size   : 8
    <bbc15>   DW_AT_type        : <0xbbc19>
 <1><bbc19>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbc1a>   DW_AT_prototyped  : 1
    <bbc1a>   DW_AT_type        : <0xbb47f>
    <bbc1e>   DW_AT_sibling     : <0xbbc28>
 <2><bbc22>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc23>   DW_AT_type        : <0xbb47f>
 <2><bbc27>: Abbrev Number: 0
 <1><bbc28>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbc29>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <bbc2d>   DW_AT_decl_file   : 9
    <bbc2e>   DW_AT_decl_line   : 68
    <bbc2f>   DW_AT_decl_column : 23
    <bbc30>   DW_AT_type        : <0xbbc34>
 <1><bbc34>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbc35>   DW_AT_byte_size   : 8
    <bbc35>   DW_AT_type        : <0xbbc39>
 <1><bbc39>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbc3a>   DW_AT_prototyped  : 1
    <bbc3a>   DW_AT_type        : <0xbb47f>
    <bbc3e>   DW_AT_sibling     : <0xbbc5c>
 <2><bbc42>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc43>   DW_AT_type        : <0xbbaef>
 <2><bbc47>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc48>   DW_AT_type        : <0xbbaef>
 <2><bbc4c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc4d>   DW_AT_type        : <0xbbaef>
 <2><bbc51>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc52>   DW_AT_type        : <0xbbaef>
 <2><bbc56>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc57>   DW_AT_type        : <0xbbaef>
 <2><bbc5b>: Abbrev Number: 0
 <1><bbc5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbc5d>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <bbc61>   DW_AT_decl_file   : 9
    <bbc62>   DW_AT_decl_line   : 69
    <bbc63>   DW_AT_decl_column : 23
    <bbc64>   DW_AT_type        : <0xbbc68>
 <1><bbc68>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbc69>   DW_AT_byte_size   : 8
    <bbc69>   DW_AT_type        : <0xbbc6d>
 <1><bbc6d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbc6e>   DW_AT_prototyped  : 1
    <bbc6e>   DW_AT_type        : <0xbb47f>
    <bbc72>   DW_AT_sibling     : <0xbbc8b>
 <2><bbc76>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc77>   DW_AT_type        : <0xbb47f>
 <2><bbc7b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc7c>   DW_AT_type        : <0xbb47f>
 <2><bbc80>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc81>   DW_AT_type        : <0xbb47f>
 <2><bbc85>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbc86>   DW_AT_type        : <0xbb47f>
 <2><bbc8a>: Abbrev Number: 0
 <1><bbc8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbc8c>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <bbc90>   DW_AT_decl_file   : 9
    <bbc91>   DW_AT_decl_line   : 73
    <bbc92>   DW_AT_decl_column : 23
    <bbc93>   DW_AT_type        : <0xbbc97>
 <1><bbc97>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbc98>   DW_AT_byte_size   : 8
    <bbc98>   DW_AT_type        : <0xbbc9c>
 <1><bbc9c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbc9d>   DW_AT_prototyped  : 1
    <bbc9d>   DW_AT_type        : <0xbb47f>
    <bbca1>   DW_AT_sibling     : <0xbbcab>
 <2><bbca5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbca6>   DW_AT_type        : <0xbb45c>
 <2><bbcaa>: Abbrev Number: 0
 <1><bbcab>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbcac>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <bbcb0>   DW_AT_decl_file   : 9
    <bbcb1>   DW_AT_decl_line   : 74
    <bbcb2>   DW_AT_decl_column : 23
    <bbcb3>   DW_AT_type        : <0xbbcb7>
 <1><bbcb7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbcb8>   DW_AT_byte_size   : 8
    <bbcb8>   DW_AT_type        : <0xbbcbc>
 <1><bbcbc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bbcbd>   DW_AT_prototyped  : 1
    <bbcbd>   DW_AT_type        : <0xbb47f>
    <bbcc1>   DW_AT_sibling     : <0xbbcd0>
 <2><bbcc5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbcc6>   DW_AT_type        : <0xbb45c>
 <2><bbcca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbccb>   DW_AT_type        : <0xbb455>
 <2><bbccf>: Abbrev Number: 0
 <1><bbcd0>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbcd1>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <bbcd5>   DW_AT_decl_file   : 9
    <bbcd6>   DW_AT_decl_line   : 80
    <bbcd7>   DW_AT_decl_column : 23
    <bbcd8>   DW_AT_type        : <0xbba3f>
 <1><bbcdc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbcdd>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <bbce1>   DW_AT_decl_file   : 9
    <bbce2>   DW_AT_decl_line   : 83
    <bbce3>   DW_AT_decl_column : 23
    <bbce4>   DW_AT_type        : <0xbbc14>
 <1><bbce8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbce9>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <bbced>   DW_AT_decl_file   : 9
    <bbcee>   DW_AT_decl_line   : 86
    <bbcef>   DW_AT_decl_column : 23
    <bbcf0>   DW_AT_type        : <0xbba9d>
 <1><bbcf4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbcf5>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <bbcf9>   DW_AT_decl_file   : 9
    <bbcfa>   DW_AT_decl_line   : 89
    <bbcfb>   DW_AT_decl_column : 23
    <bbcfc>   DW_AT_type        : <0xbba9d>
 <1><bbd00>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbd01>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <bbd05>   DW_AT_decl_file   : 9
    <bbd06>   DW_AT_decl_line   : 91
    <bbd07>   DW_AT_decl_column : 23
    <bbd08>   DW_AT_type        : <0xbbd0c>
 <1><bbd0c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbd0d>   DW_AT_byte_size   : 8
    <bbd0d>   DW_AT_type        : <0xbbd11>
 <1><bbd11>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bbd12>   DW_AT_prototyped  : 1
    <bbd12>   DW_AT_sibling     : <0xbbd1c>
 <2><bbd16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbd17>   DW_AT_type        : <0xbbd1c>
 <2><bbd1b>: Abbrev Number: 0
 <1><bbd1c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bbd1d>   DW_AT_byte_size   : 8
    <bbd1d>   DW_AT_type        : <0xbb9ef>
 <1><bbd21>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bbd22>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <bbd26>   DW_AT_byte_size   : 224
    <bbd27>   DW_AT_decl_file   : 9
    <bbd28>   DW_AT_decl_line   : 93
    <bbd29>   DW_AT_decl_column : 16
    <bbd2a>   DW_AT_sibling     : <0xbbe9b>
 <2><bbd2e>: Abbrev Number: 2 (DW_TAG_member)
    <bbd2f>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <bbd33>   DW_AT_decl_file   : 9
    <bbd34>   DW_AT_decl_line   : 94
    <bbd35>   DW_AT_decl_column : 23
    <bbd36>   DW_AT_type        : <0xbb9fb>
    <bbd3a>   DW_AT_data_member_location: 0
 <2><bbd3b>: Abbrev Number: 2 (DW_TAG_member)
    <bbd3c>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <bbd40>   DW_AT_decl_file   : 9
    <bbd41>   DW_AT_decl_line   : 95
    <bbd42>   DW_AT_decl_column : 23
    <bbd43>   DW_AT_type        : <0xbba11>
    <bbd47>   DW_AT_data_member_location: 8
 <2><bbd48>: Abbrev Number: 2 (DW_TAG_member)
    <bbd49>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <bbd4d>   DW_AT_decl_file   : 9
    <bbd4e>   DW_AT_decl_line   : 96
    <bbd4f>   DW_AT_decl_column : 23
    <bbd50>   DW_AT_type        : <0xbba27>
    <bbd54>   DW_AT_data_member_location: 16
 <2><bbd55>: Abbrev Number: 2 (DW_TAG_member)
    <bbd56>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <bbd5a>   DW_AT_decl_file   : 9
    <bbd5b>   DW_AT_decl_line   : 97
    <bbd5c>   DW_AT_decl_column : 23
    <bbd5d>   DW_AT_type        : <0xbba33>
    <bbd61>   DW_AT_data_member_location: 24
 <2><bbd62>: Abbrev Number: 2 (DW_TAG_member)
    <bbd63>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <bbd67>   DW_AT_decl_file   : 9
    <bbd68>   DW_AT_decl_line   : 98
    <bbd69>   DW_AT_decl_column : 23
    <bbd6a>   DW_AT_type        : <0xbba4f>
    <bbd6e>   DW_AT_data_member_location: 32
 <2><bbd6f>: Abbrev Number: 2 (DW_TAG_member)
    <bbd70>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <bbd74>   DW_AT_decl_file   : 9
    <bbd75>   DW_AT_decl_line   : 99
    <bbd76>   DW_AT_decl_column : 23
    <bbd77>   DW_AT_type        : <0xbba79>
    <bbd7b>   DW_AT_data_member_location: 40
 <2><bbd7c>: Abbrev Number: 2 (DW_TAG_member)
    <bbd7d>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <bbd81>   DW_AT_decl_file   : 9
    <bbd82>   DW_AT_decl_line   : 100
    <bbd83>   DW_AT_decl_column : 23
    <bbd84>   DW_AT_type        : <0xbba91>
    <bbd88>   DW_AT_data_member_location: 48
 <2><bbd89>: Abbrev Number: 2 (DW_TAG_member)
    <bbd8a>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <bbd8e>   DW_AT_decl_file   : 9
    <bbd8f>   DW_AT_decl_line   : 101
    <bbd90>   DW_AT_decl_column : 23
    <bbd91>   DW_AT_type        : <0xbbab6>
    <bbd95>   DW_AT_data_member_location: 56
 <2><bbd96>: Abbrev Number: 2 (DW_TAG_member)
    <bbd97>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <bbd9b>   DW_AT_decl_file   : 9
    <bbd9c>   DW_AT_decl_line   : 102
    <bbd9d>   DW_AT_decl_column : 23
    <bbd9e>   DW_AT_type        : <0xbbac2>
    <bbda2>   DW_AT_data_member_location: 64
 <2><bbda3>: Abbrev Number: 2 (DW_TAG_member)
    <bbda4>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <bbda8>   DW_AT_decl_file   : 9
    <bbda9>   DW_AT_decl_line   : 103
    <bbdaa>   DW_AT_decl_column : 23
    <bbdab>   DW_AT_type        : <0xbbace>
    <bbdaf>   DW_AT_data_member_location: 72
 <2><bbdb0>: Abbrev Number: 2 (DW_TAG_member)
    <bbdb1>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <bbdb5>   DW_AT_decl_file   : 9
    <bbdb6>   DW_AT_decl_line   : 104
    <bbdb7>   DW_AT_decl_column : 23
    <bbdb8>   DW_AT_type        : <0xbbaf4>
    <bbdbc>   DW_AT_data_member_location: 80
 <2><bbdbd>: Abbrev Number: 2 (DW_TAG_member)
    <bbdbe>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <bbdc2>   DW_AT_decl_file   : 9
    <bbdc3>   DW_AT_decl_line   : 105
    <bbdc4>   DW_AT_decl_column : 24
    <bbdc5>   DW_AT_type        : <0xbbb2a>
    <bbdc9>   DW_AT_data_member_location: 88
 <2><bbdca>: Abbrev Number: 2 (DW_TAG_member)
    <bbdcb>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <bbdcf>   DW_AT_decl_file   : 9
    <bbdd0>   DW_AT_decl_line   : 106
    <bbdd1>   DW_AT_decl_column : 25
    <bbdd2>   DW_AT_type        : <0xbbb50>
    <bbdd6>   DW_AT_data_member_location: 96
 <2><bbdd7>: Abbrev Number: 2 (DW_TAG_member)
    <bbdd8>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <bbddc>   DW_AT_decl_file   : 9
    <bbddd>   DW_AT_decl_line   : 107
    <bbdde>   DW_AT_decl_column : 23
    <bbddf>   DW_AT_type        : <0xbbb76>
    <bbde3>   DW_AT_data_member_location: 104
 <2><bbde4>: Abbrev Number: 2 (DW_TAG_member)
    <bbde5>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <bbde9>   DW_AT_decl_file   : 9
    <bbdea>   DW_AT_decl_line   : 108
    <bbdeb>   DW_AT_decl_column : 23
    <bbdec>   DW_AT_type        : <0xbbc08>
    <bbdf0>   DW_AT_data_member_location: 112
 <2><bbdf1>: Abbrev Number: 2 (DW_TAG_member)
    <bbdf2>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <bbdf6>   DW_AT_decl_file   : 9
    <bbdf7>   DW_AT_decl_line   : 109
    <bbdf8>   DW_AT_decl_column : 23
    <bbdf9>   DW_AT_type        : <0xbbc28>
    <bbdfd>   DW_AT_data_member_location: 120
 <2><bbdfe>: Abbrev Number: 2 (DW_TAG_member)
    <bbdff>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <bbe03>   DW_AT_decl_file   : 9
    <bbe04>   DW_AT_decl_line   : 110
    <bbe05>   DW_AT_decl_column : 23
    <bbe06>   DW_AT_type        : <0xbbc5c>
    <bbe0a>   DW_AT_data_member_location: 128
 <2><bbe0b>: Abbrev Number: 2 (DW_TAG_member)
    <bbe0c>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <bbe10>   DW_AT_decl_file   : 9
    <bbe11>   DW_AT_decl_line   : 111
    <bbe12>   DW_AT_decl_column : 23
    <bbe13>   DW_AT_type        : <0xbbc8b>
    <bbe17>   DW_AT_data_member_location: 136
 <2><bbe18>: Abbrev Number: 2 (DW_TAG_member)
    <bbe19>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <bbe1d>   DW_AT_decl_file   : 9
    <bbe1e>   DW_AT_decl_line   : 112
    <bbe1f>   DW_AT_decl_column : 23
    <bbe20>   DW_AT_type        : <0xbbcab>
    <bbe24>   DW_AT_data_member_location: 144
 <2><bbe25>: Abbrev Number: 2 (DW_TAG_member)
    <bbe26>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <bbe2a>   DW_AT_decl_file   : 9
    <bbe2b>   DW_AT_decl_line   : 113
    <bbe2c>   DW_AT_decl_column : 25
    <bbe2d>   DW_AT_type        : <0xbba85>
    <bbe31>   DW_AT_data_member_location: 152
 <2><bbe32>: Abbrev Number: 2 (DW_TAG_member)
    <bbe33>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <bbe37>   DW_AT_decl_file   : 9
    <bbe38>   DW_AT_decl_line   : 114
    <bbe39>   DW_AT_decl_column : 24
    <bbe3a>   DW_AT_type        : <0xbbb9b>
    <bbe3e>   DW_AT_data_member_location: 160
 <2><bbe3f>: Abbrev Number: 2 (DW_TAG_member)
    <bbe40>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <bbe44>   DW_AT_decl_file   : 9
    <bbe45>   DW_AT_decl_line   : 115
    <bbe46>   DW_AT_decl_column : 25
    <bbe47>   DW_AT_type        : <0xbbbd4>
    <bbe4b>   DW_AT_data_member_location: 168
 <2><bbe4c>: Abbrev Number: 2 (DW_TAG_member)
    <bbe4d>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <bbe51>   DW_AT_decl_file   : 9
    <bbe52>   DW_AT_decl_line   : 116
    <bbe53>   DW_AT_decl_column : 23
    <bbe54>   DW_AT_type        : <0xbbb00>
    <bbe58>   DW_AT_data_member_location: 176
 <2><bbe59>: Abbrev Number: 2 (DW_TAG_member)
    <bbe5a>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <bbe5e>   DW_AT_decl_file   : 9
    <bbe5f>   DW_AT_decl_line   : 117
    <bbe60>   DW_AT_decl_column : 23
    <bbe61>   DW_AT_type        : <0xbbcd0>
    <bbe65>   DW_AT_data_member_location: 184
 <2><bbe66>: Abbrev Number: 2 (DW_TAG_member)
    <bbe67>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <bbe6b>   DW_AT_decl_file   : 9
    <bbe6c>   DW_AT_decl_line   : 118
    <bbe6d>   DW_AT_decl_column : 22
    <bbe6e>   DW_AT_type        : <0xbbcdc>
    <bbe72>   DW_AT_data_member_location: 192
 <2><bbe73>: Abbrev Number: 2 (DW_TAG_member)
    <bbe74>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <bbe78>   DW_AT_decl_file   : 9
    <bbe79>   DW_AT_decl_line   : 119
    <bbe7a>   DW_AT_decl_column : 23
    <bbe7b>   DW_AT_type        : <0xbbce8>
    <bbe7f>   DW_AT_data_member_location: 200
 <2><bbe80>: Abbrev Number: 2 (DW_TAG_member)
    <bbe81>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <bbe85>   DW_AT_decl_file   : 9
    <bbe86>   DW_AT_decl_line   : 120
    <bbe87>   DW_AT_decl_column : 22
    <bbe88>   DW_AT_type        : <0xbbcf4>
    <bbe8c>   DW_AT_data_member_location: 208
 <2><bbe8d>: Abbrev Number: 2 (DW_TAG_member)
    <bbe8e>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <bbe92>   DW_AT_decl_file   : 9
    <bbe93>   DW_AT_decl_line   : 121
    <bbe94>   DW_AT_decl_column : 23
    <bbe95>   DW_AT_type        : <0xbbd00>
    <bbe99>   DW_AT_data_member_location: 216
 <2><bbe9a>: Abbrev Number: 0
 <1><bbe9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <bbe9c>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <bbea0>   DW_AT_decl_file   : 9
    <bbea1>   DW_AT_decl_line   : 122
    <bbea2>   DW_AT_decl_column : 3
    <bbea3>   DW_AT_type        : <0xbbd21>
 <1><bbea7>: Abbrev Number: 30 (DW_TAG_structure_type)
    <bbea8>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <bbeac>   DW_AT_byte_size   : 20848
    <bbeae>   DW_AT_decl_file   : 10
    <bbeaf>   DW_AT_decl_line   : 349
    <bbeb1>   DW_AT_decl_column : 16
    <bbeb2>   DW_AT_sibling     : <0xbbf27>
 <2><bbeb6>: Abbrev Number: 10 (DW_TAG_member)
    <bbeb7>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <bbebb>   DW_AT_decl_file   : 10
    <bbebb>   DW_AT_decl_line   : 350
    <bbebd>   DW_AT_decl_column : 18
    <bbebd>   DW_AT_type        : <0xbb47f>
    <bbec1>   DW_AT_data_member_location: 0
 <2><bbec2>: Abbrev Number: 10 (DW_TAG_member)
    <bbec3>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <bbec7>   DW_AT_decl_file   : 10
    <bbec7>   DW_AT_decl_line   : 351
    <bbec9>   DW_AT_decl_column : 18
    <bbec9>   DW_AT_type        : <0xbb50d>
    <bbecd>   DW_AT_data_member_location: 8
 <2><bbece>: Abbrev Number: 10 (DW_TAG_member)
    <bbecf>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <bbed3>   DW_AT_decl_file   : 10
    <bbed3>   DW_AT_decl_line   : 352
    <bbed5>   DW_AT_decl_column : 18
    <bbed5>   DW_AT_type        : <0xbb559>
    <bbed9>   DW_AT_data_member_location: 16
 <2><bbeda>: Abbrev Number: 10 (DW_TAG_member)
    <bbedb>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <bbedf>   DW_AT_decl_file   : 10
    <bbedf>   DW_AT_decl_line   : 353
    <bbee1>   DW_AT_decl_column : 18
    <bbee1>   DW_AT_type        : <0xbb4a7>
    <bbee5>   DW_AT_data_member_location: 40
 <2><bbee6>: Abbrev Number: 10 (DW_TAG_member)
    <bbee7>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <bbeeb>   DW_AT_decl_file   : 10
    <bbeeb>   DW_AT_decl_line   : 354
    <bbeed>   DW_AT_decl_column : 18
    <bbeed>   DW_AT_type        : <0xbbe9b>
    <bbef1>   DW_AT_data_member_location: 48
 <2><bbef2>: Abbrev Number: 12 (DW_TAG_member)
    <bbef3>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <bbef7>   DW_AT_decl_file   : 10
    <bbef7>   DW_AT_decl_line   : 355
    <bbef9>   DW_AT_decl_column : 18
    <bbef9>   DW_AT_type        : <0xbbf27>
    <bbefd>   DW_AT_data_member_location: 272
 <2><bbeff>: Abbrev Number: 12 (DW_TAG_member)
    <bbf00>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <bbf04>   DW_AT_decl_file   : 10
    <bbf04>   DW_AT_decl_line   : 356
    <bbf06>   DW_AT_decl_column : 18
    <bbf06>   DW_AT_type        : <0xbb47f>
    <bbf0a>   DW_AT_data_member_location: 20832
 <2><bbf0c>: Abbrev Number: 12 (DW_TAG_member)
    <bbf0d>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <bbf11>   DW_AT_decl_file   : 10
    <bbf11>   DW_AT_decl_line   : 357
    <bbf13>   DW_AT_decl_column : 18
    <bbf13>   DW_AT_type        : <0xbb47f>
    <bbf17>   DW_AT_data_member_location: 20836
 <2><bbf19>: Abbrev Number: 12 (DW_TAG_member)
    <bbf1a>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <bbf1e>   DW_AT_decl_file   : 10
    <bbf1e>   DW_AT_decl_line   : 358
    <bbf20>   DW_AT_decl_column : 18
    <bbf20>   DW_AT_type        : <0xbb51e>
    <bbf24>   DW_AT_data_member_location: 20840
 <2><bbf26>: Abbrev Number: 0
 <1><bbf27>: Abbrev Number: 14 (DW_TAG_array_type)
    <bbf28>   DW_AT_type        : <0xbb93a>
    <bbf2c>   DW_AT_sibling     : <0xbbf38>
 <2><bbf30>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <bbf31>   DW_AT_type        : <0xbb46a>
    <bbf35>   DW_AT_upper_bound : 256
 <2><bbf37>: Abbrev Number: 0
 <1><bbf38>: Abbrev Number: 13 (DW_TAG_typedef)
    <bbf39>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <bbf3d>   DW_AT_decl_file   : 10
    <bbf3e>   DW_AT_decl_line   : 359
    <bbf40>   DW_AT_decl_column : 3
    <bbf41>   DW_AT_type        : <0xbbea7>
 <1><bbf45>: Abbrev Number: 32 (DW_TAG_variable)
    <bbf46>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <bbf4a>   DW_AT_decl_file   : 10
    <bbf4b>   DW_AT_decl_line   : 361
    <bbf4d>   DW_AT_decl_column : 21
    <bbf4e>   DW_AT_type        : <0xbbf38>
    <bbf52>   DW_AT_external    : 1
    <bbf52>   DW_AT_declaration : 1
 <1><bbf52>: Abbrev Number: 33 (DW_TAG_subprogram)
    <bbf53>   DW_AT_external    : 1
    <bbf53>   DW_AT_name        : (indirect string, offset: 0x1b66c): fb_ConsoleIsRedirected
    <bbf57>   DW_AT_decl_file   : 11
    <bbf58>   DW_AT_decl_line   : 91
    <bbf59>   DW_AT_decl_column : 21
    <bbf5a>   DW_AT_prototyped  : 1
    <bbf5a>   DW_AT_type        : <0xbb47f>
    <bbf5e>   DW_AT_declaration : 1
    <bbf5e>   DW_AT_sibling     : <0xbbf68>
 <2><bbf62>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bbf63>   DW_AT_type        : <0xbb47f>
 <2><bbf67>: Abbrev Number: 0
 <1><bbf68>: Abbrev Number: 34 (DW_TAG_subprogram)
    <bbf69>   DW_AT_external    : 1
    <bbf69>   DW_AT_name        : (indirect string, offset: 0x1aebd): fb_IsRedirected
    <bbf6d>   DW_AT_decl_file   : 1
    <bbf6e>   DW_AT_decl_line   : 5
    <bbf6f>   DW_AT_decl_column : 12
    <bbf70>   DW_AT_prototyped  : 1
    <bbf70>   DW_AT_type        : <0xbb47f>
    <bbf74>   DW_AT_low_pc      : 0x471d30
    <bbf7c>   DW_AT_high_pc     : 0x15
    <bbf84>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bbf86>   DW_AT_call_all_calls: 1
 <2><bbf86>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <bbf87>   DW_AT_name        : (indirect string, offset: 0x1a72b): is_input
    <bbf8b>   DW_AT_decl_file   : 1
    <bbf8c>   DW_AT_decl_line   : 5
    <bbf8d>   DW_AT_decl_column : 34
    <bbf8e>   DW_AT_type        : <0xbb47f>
    <bbf92>   DW_AT_location    : 0x3a711 (location list)
    <bbf96>   DW_AT_GNU_locviews: 0x3a709
 <2><bbf9a>: Abbrev Number: 36 (DW_TAG_variable)
    <bbf9b>   DW_AT_name        : (indirect string, offset: 0x1a7da): result
    <bbf9f>   DW_AT_decl_file   : 1
    <bbfa0>   DW_AT_decl_line   : 7
    <bbfa1>   DW_AT_decl_column : 6
    <bbfa2>   DW_AT_type        : <0xbb47f>
 <2><bbfa6>: Abbrev Number: 37 (DW_TAG_call_site)
    <bbfa7>   DW_AT_call_return_pc: 0x471d3e
    <bbfaf>   DW_AT_call_tail_call: 1
    <bbfaf>   DW_AT_sibling     : <0xbbfbb>
 <3><bbfb3>: Abbrev Number: 38 (DW_TAG_call_site_parameter)
    <bbfb4>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <bbfb6>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><bbfba>: Abbrev Number: 0
 <2><bbfbb>: Abbrev Number: 39 (DW_TAG_call_site)
    <bbfbc>   DW_AT_call_return_pc: 0x471d45
    <bbfc4>   DW_AT_call_tail_call: 1
    <bbfc4>   DW_AT_call_origin : <0xbbf52>
 <2><bbfc8>: Abbrev Number: 0
 <1><bbfc9>: Abbrev Number: 0
  Compilation Unit @ offset 0xbbfca:
   Length:        0xc42 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xde15
   Pointer Size:  8
 <0><bbfd6>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <bbfd7>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <bbfdb>   DW_AT_language    : 29	(C11)
    <bbfdc>   DW_AT_name        : (indirect line string, offset: 0xe3f): src/rtlib/hook_lineinp.c
    <bbfe0>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <bbfe4>   DW_AT_low_pc      : 0x471d50
    <bbfec>   DW_AT_high_pc     : 0x15
    <bbff4>   DW_AT_stmt_list   : 0x662d0
 <1><bbff8>: Abbrev Number: 6 (DW_TAG_base_type)
    <bbff9>   DW_AT_byte_size   : 1
    <bbffa>   DW_AT_encoding    : 8	(unsigned char)
    <bbffb>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><bbfff>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc000>   DW_AT_byte_size   : 2
    <bc001>   DW_AT_encoding    : 7	(unsigned)
    <bc002>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><bc006>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc007>   DW_AT_byte_size   : 4
    <bc008>   DW_AT_encoding    : 7	(unsigned)
    <bc009>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><bc00d>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc00e>   DW_AT_byte_size   : 8
    <bc00f>   DW_AT_encoding    : 7	(unsigned)
    <bc010>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><bc014>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc015>   DW_AT_byte_size   : 1
    <bc016>   DW_AT_encoding    : 6	(signed char)
    <bc017>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><bc01b>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc01c>   DW_AT_byte_size   : 2
    <bc01d>   DW_AT_encoding    : 5	(signed)
    <bc01e>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><bc022>: Abbrev Number: 22 (DW_TAG_base_type)
    <bc023>   DW_AT_byte_size   : 4
    <bc024>   DW_AT_encoding    : 5	(signed)
    <bc025>   DW_AT_name        : int
 <1><bc029>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc02a>   DW_AT_byte_size   : 8
    <bc02b>   DW_AT_encoding    : 5	(signed)
    <bc02c>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><bc030>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc031>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <bc035>   DW_AT_decl_file   : 2
    <bc036>   DW_AT_decl_line   : 153
    <bc037>   DW_AT_decl_column : 27
    <bc038>   DW_AT_type        : <0xbc029>
 <1><bc03c>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <bc03d>   DW_AT_byte_size   : 8
 <1><bc03e>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc03f>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <bc043>   DW_AT_decl_file   : 2
    <bc044>   DW_AT_decl_line   : 194
    <bc045>   DW_AT_decl_column : 27
    <bc046>   DW_AT_type        : <0xbc029>
 <1><bc04a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc04b>   DW_AT_byte_size   : 8
    <bc04b>   DW_AT_type        : <0xbc04f>
 <1><bc04f>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc050>   DW_AT_byte_size   : 1
    <bc051>   DW_AT_encoding    : 6	(signed char)
    <bc052>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><bc056>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc057>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <bc05b>   DW_AT_decl_file   : 3
    <bc05c>   DW_AT_decl_line   : 209
    <bc05d>   DW_AT_decl_column : 23
    <bc05e>   DW_AT_type        : <0xbc00d>
 <1><bc062>: Abbrev Number: 15 (DW_TAG_typedef)
    <bc063>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <bc067>   DW_AT_decl_file   : 3
    <bc068>   DW_AT_decl_line   : 321
    <bc06a>   DW_AT_decl_column : 24
    <bc06b>   DW_AT_type        : <0xbc022>
 <1><bc06f>: Abbrev Number: 24 (DW_TAG_const_type)
    <bc070>   DW_AT_type        : <0xbc062>
 <1><bc074>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc075>   DW_AT_byte_size   : 8
    <bc076>   DW_AT_encoding    : 5	(signed)
    <bc077>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><bc07b>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc07c>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <bc080>   DW_AT_decl_file   : 4
    <bc081>   DW_AT_decl_line   : 87
    <bc082>   DW_AT_decl_column : 19
    <bc083>   DW_AT_type        : <0xbc030>
 <1><bc087>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc088>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <bc08c>   DW_AT_decl_file   : 4
    <bc08d>   DW_AT_decl_line   : 108
    <bc08e>   DW_AT_decl_column : 19
    <bc08f>   DW_AT_type        : <0xbc03e>
 <1><bc093>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc094>   DW_AT_byte_size   : 8
    <bc095>   DW_AT_encoding    : 7	(unsigned)
    <bc096>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><bc09a>: Abbrev Number: 16 (DW_TAG_array_type)
    <bc09b>   DW_AT_type        : <0xbc04f>
    <bc09f>   DW_AT_sibling     : <0xbc0aa>
 <2><bc0a3>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <bc0a4>   DW_AT_type        : <0xbc00d>
    <bc0a8>   DW_AT_upper_bound : 3
 <2><bc0a9>: Abbrev Number: 0
 <1><bc0aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc0ab>   DW_AT_byte_size   : 8
    <bc0ab>   DW_AT_type        : <0xbc0af>
 <1><bc0af>: Abbrev Number: 26 (DW_TAG_const_type)
 <1><bc0b0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc0b1>   DW_AT_byte_size   : 8
    <bc0b1>   DW_AT_type        : <0xbc04a>
 <1><bc0b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc0b6>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <bc0ba>   DW_AT_decl_file   : 5
    <bc0bb>   DW_AT_decl_line   : 22
    <bc0bc>   DW_AT_decl_column : 15
    <bc0bd>   DW_AT_type        : <0xbc07b>
 <1><bc0c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc0c2>   DW_AT_byte_size   : 8
    <bc0c2>   DW_AT_type        : <0xbc0c6>
 <1><bc0c6>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <bc0c7>   DW_AT_prototyped  : 1
 <1><bc0c7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <bc0c8>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <bc0cc>   DW_AT_byte_size   : 24
    <bc0cd>   DW_AT_decl_file   : 6
    <bc0ce>   DW_AT_decl_line   : 82
    <bc0cf>   DW_AT_decl_column : 16
    <bc0d0>   DW_AT_sibling     : <0xbc0fc>
 <2><bc0d4>: Abbrev Number: 2 (DW_TAG_member)
    <bc0d5>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <bc0d9>   DW_AT_decl_file   : 6
    <bc0da>   DW_AT_decl_line   : 83
    <bc0db>   DW_AT_decl_column : 21
    <bc0dc>   DW_AT_type        : <0xbc04a>
    <bc0e0>   DW_AT_data_member_location: 0
 <2><bc0e1>: Abbrev Number: 7 (DW_TAG_member)
    <bc0e2>   DW_AT_name        : len
    <bc0e6>   DW_AT_decl_file   : 6
    <bc0e7>   DW_AT_decl_line   : 84
    <bc0e8>   DW_AT_decl_column : 21
    <bc0e9>   DW_AT_type        : <0xbc087>
    <bc0ed>   DW_AT_data_member_location: 8
 <2><bc0ee>: Abbrev Number: 2 (DW_TAG_member)
    <bc0ef>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bc0f3>   DW_AT_decl_file   : 6
    <bc0f4>   DW_AT_decl_line   : 85
    <bc0f5>   DW_AT_decl_column : 21
    <bc0f6>   DW_AT_type        : <0xbc087>
    <bc0fa>   DW_AT_data_member_location: 16
 <2><bc0fb>: Abbrev Number: 0
 <1><bc0fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc0fd>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <bc101>   DW_AT_decl_file   : 6
    <bc102>   DW_AT_decl_line   : 86
    <bc103>   DW_AT_decl_column : 3
    <bc104>   DW_AT_type        : <0xbc0c7>
 <1><bc108>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc109>   DW_AT_byte_size   : 8
    <bc10a>   DW_AT_encoding    : 4	(float)
    <bc10b>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><bc10f>: Abbrev Number: 6 (DW_TAG_base_type)
    <bc110>   DW_AT_byte_size   : 4
    <bc111>   DW_AT_encoding    : 4	(float)
    <bc112>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><bc116>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc117>   DW_AT_byte_size   : 8
    <bc117>   DW_AT_type        : <0xbc062>
 <1><bc11b>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <bc11c>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <bc120>   DW_AT_encoding    : 7	(unsigned)
    <bc121>   DW_AT_byte_size   : 4
    <bc122>   DW_AT_type        : <0xbc006>
    <bc126>   DW_AT_decl_file   : 7
    <bc127>   DW_AT_decl_line   : 25
    <bc128>   DW_AT_decl_column : 14
    <bc129>   DW_AT_sibling     : <0xbc146>
 <2><bc12d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bc12e>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <bc132>   DW_AT_const_value : 0
 <2><bc133>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bc134>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <bc138>   DW_AT_const_value : 1
 <2><bc139>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bc13a>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <bc13e>   DW_AT_const_value : 2
 <2><bc13f>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bc140>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <bc144>   DW_AT_const_value : 3
 <2><bc145>: Abbrev Number: 0
 <1><bc146>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc147>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <bc14b>   DW_AT_decl_file   : 7
    <bc14c>   DW_AT_decl_line   : 30
    <bc14d>   DW_AT_decl_column : 3
    <bc14e>   DW_AT_type        : <0xbc11b>
 <1><bc152>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc153>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <bc157>   DW_AT_decl_file   : 7
    <bc158>   DW_AT_decl_line   : 54
    <bc159>   DW_AT_decl_column : 15
    <bc15a>   DW_AT_type        : <0xbc15e>
 <1><bc15e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc15f>   DW_AT_byte_size   : 8
    <bc15f>   DW_AT_type        : <0xbc163>
 <1><bc163>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bc164>   DW_AT_prototyped  : 1
    <bc164>   DW_AT_type        : <0xbc022>
    <bc168>   DW_AT_sibling     : <0xbc177>
 <2><bc16c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc16d>   DW_AT_type        : <0xbc177>
 <2><bc171>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc172>   DW_AT_type        : <0xbc022>
 <2><bc176>: Abbrev Number: 0
 <1><bc177>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc178>   DW_AT_byte_size   : 8
    <bc178>   DW_AT_type        : <0xbc17c>
 <1><bc17c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <bc17d>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <bc181>   DW_AT_byte_size   : 80
    <bc182>   DW_AT_decl_file   : 7
    <bc183>   DW_AT_decl_line   : 97
    <bc184>   DW_AT_decl_column : 16
    <bc185>   DW_AT_sibling     : <0xbc240>
 <2><bc189>: Abbrev Number: 2 (DW_TAG_member)
    <bc18a>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <bc18e>   DW_AT_decl_file   : 7
    <bc18f>   DW_AT_decl_line   : 98
    <bc190>   DW_AT_decl_column : 21
    <bc191>   DW_AT_type        : <0xbc022>
    <bc195>   DW_AT_data_member_location: 0
 <2><bc196>: Abbrev Number: 7 (DW_TAG_member)
    <bc197>   DW_AT_name        : len
    <bc19b>   DW_AT_decl_file   : 7
    <bc19c>   DW_AT_decl_line   : 99
    <bc19d>   DW_AT_decl_column : 21
    <bc19e>   DW_AT_type        : <0xbc022>
    <bc1a2>   DW_AT_data_member_location: 4
 <2><bc1a3>: Abbrev Number: 2 (DW_TAG_member)
    <bc1a4>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <bc1a8>   DW_AT_decl_file   : 7
    <bc1a9>   DW_AT_decl_line   : 100
    <bc1aa>   DW_AT_decl_column : 21
    <bc1ab>   DW_AT_type        : <0xbc146>
    <bc1af>   DW_AT_data_member_location: 8
 <2><bc1b0>: Abbrev Number: 2 (DW_TAG_member)
    <bc1b1>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bc1b5>   DW_AT_decl_file   : 7
    <bc1b6>   DW_AT_decl_line   : 101
    <bc1b7>   DW_AT_decl_column : 21
    <bc1b8>   DW_AT_type        : <0xbc0b5>
    <bc1bc>   DW_AT_data_member_location: 16
 <2><bc1bd>: Abbrev Number: 2 (DW_TAG_member)
    <bc1be>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <bc1c2>   DW_AT_decl_file   : 7
    <bc1c3>   DW_AT_decl_line   : 102
    <bc1c4>   DW_AT_decl_column : 21
    <bc1c5>   DW_AT_type        : <0xbc022>
    <bc1c9>   DW_AT_data_member_location: 24
 <2><bc1ca>: Abbrev Number: 2 (DW_TAG_member)
    <bc1cb>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <bc1cf>   DW_AT_decl_file   : 7
    <bc1d0>   DW_AT_decl_line   : 103
    <bc1d1>   DW_AT_decl_column : 21
    <bc1d2>   DW_AT_type        : <0xbc022>
    <bc1d6>   DW_AT_data_member_location: 28
 <2><bc1d7>: Abbrev Number: 2 (DW_TAG_member)
    <bc1d8>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <bc1dc>   DW_AT_decl_file   : 7
    <bc1dd>   DW_AT_decl_line   : 104
    <bc1de>   DW_AT_decl_column : 21
    <bc1df>   DW_AT_type        : <0xbc022>
    <bc1e3>   DW_AT_data_member_location: 32
 <2><bc1e4>: Abbrev Number: 2 (DW_TAG_member)
    <bc1e5>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <bc1e9>   DW_AT_decl_file   : 7
    <bc1ea>   DW_AT_decl_line   : 105
    <bc1eb>   DW_AT_decl_column : 21
    <bc1ec>   DW_AT_type        : <0xbc006>
    <bc1f0>   DW_AT_data_member_location: 36
 <2><bc1f1>: Abbrev Number: 2 (DW_TAG_member)
    <bc1f2>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <bc1f6>   DW_AT_decl_file   : 7
    <bc1f7>   DW_AT_decl_line   : 106
    <bc1f8>   DW_AT_decl_column : 21
    <bc1f9>   DW_AT_type        : <0xbc006>
    <bc1fd>   DW_AT_data_member_location: 40
 <2><bc1fe>: Abbrev Number: 2 (DW_TAG_member)
    <bc1ff>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <bc203>   DW_AT_decl_file   : 7
    <bc204>   DW_AT_decl_line   : 109
    <bc205>   DW_AT_decl_column : 21
    <bc206>   DW_AT_type        : <0xbc09a>
    <bc20a>   DW_AT_data_member_location: 44
 <2><bc20b>: Abbrev Number: 2 (DW_TAG_member)
    <bc20c>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <bc210>   DW_AT_decl_file   : 7
    <bc211>   DW_AT_decl_line   : 110
    <bc212>   DW_AT_decl_column : 21
    <bc213>   DW_AT_type        : <0xbc056>
    <bc217>   DW_AT_data_member_location: 48
 <2><bc218>: Abbrev Number: 2 (DW_TAG_member)
    <bc219>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <bc21d>   DW_AT_decl_file   : 7
    <bc21e>   DW_AT_decl_line   : 112
    <bc21f>   DW_AT_decl_column : 22
    <bc220>   DW_AT_type        : <0xbc4d8>
    <bc224>   DW_AT_data_member_location: 56
 <2><bc225>: Abbrev Number: 2 (DW_TAG_member)
    <bc226>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <bc22a>   DW_AT_decl_file   : 7
    <bc22b>   DW_AT_decl_line   : 114
    <bc22c>   DW_AT_decl_column : 14
    <bc22d>   DW_AT_type        : <0xbc03c>
    <bc231>   DW_AT_data_member_location: 64
 <2><bc232>: Abbrev Number: 2 (DW_TAG_member)
    <bc233>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <bc237>   DW_AT_decl_file   : 7
    <bc238>   DW_AT_decl_line   : 116
    <bc239>   DW_AT_decl_column : 22
    <bc23a>   DW_AT_type        : <0xbc177>
    <bc23e>   DW_AT_data_member_location: 72
 <2><bc23f>: Abbrev Number: 0
 <1><bc240>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc241>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <bc245>   DW_AT_decl_file   : 7
    <bc246>   DW_AT_decl_line   : 59
    <bc247>   DW_AT_decl_column : 15
    <bc248>   DW_AT_type        : <0xbc24c>
 <1><bc24c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc24d>   DW_AT_byte_size   : 8
    <bc24d>   DW_AT_type        : <0xbc251>
 <1><bc251>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bc252>   DW_AT_prototyped  : 1
    <bc252>   DW_AT_type        : <0xbc022>
    <bc256>   DW_AT_sibling     : <0xbc260>
 <2><bc25a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc25b>   DW_AT_type        : <0xbc177>
 <2><bc25f>: Abbrev Number: 0
 <1><bc260>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc261>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <bc265>   DW_AT_decl_file   : 7
    <bc266>   DW_AT_decl_line   : 60
    <bc267>   DW_AT_decl_column : 15
    <bc268>   DW_AT_type        : <0xbc24c>
 <1><bc26c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc26d>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <bc271>   DW_AT_decl_file   : 7
    <bc272>   DW_AT_decl_line   : 61
    <bc273>   DW_AT_decl_column : 15
    <bc274>   DW_AT_type        : <0xbc278>
 <1><bc278>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc279>   DW_AT_byte_size   : 8
    <bc279>   DW_AT_type        : <0xbc27d>
 <1><bc27d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bc27e>   DW_AT_prototyped  : 1
    <bc27e>   DW_AT_type        : <0xbc022>
    <bc282>   DW_AT_sibling     : <0xbc296>
 <2><bc286>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc287>   DW_AT_type        : <0xbc177>
 <2><bc28b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc28c>   DW_AT_type        : <0xbc0b5>
 <2><bc290>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc291>   DW_AT_type        : <0xbc022>
 <2><bc295>: Abbrev Number: 0
 <1><bc296>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc297>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <bc29b>   DW_AT_decl_file   : 7
    <bc29c>   DW_AT_decl_line   : 62
    <bc29d>   DW_AT_decl_column : 15
    <bc29e>   DW_AT_type        : <0xbc2a2>
 <1><bc2a2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc2a3>   DW_AT_byte_size   : 8
    <bc2a3>   DW_AT_type        : <0xbc2a7>
 <1><bc2a7>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bc2a8>   DW_AT_prototyped  : 1
    <bc2a8>   DW_AT_type        : <0xbc022>
    <bc2ac>   DW_AT_sibling     : <0xbc2bb>
 <2><bc2b0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc2b1>   DW_AT_type        : <0xbc177>
 <2><bc2b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bc2b6>   DW_AT_type        : <0xbc2bb>
 <2><bc2ba>: Abbrev Number: 0
 <1><bc2bb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc2bc>   DW_AT_byte_size   : 8
    <bc2bc>   DW_AT_type        : <0xbc0b5>
 <1><bc2c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc2c1>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <bc2c5>   DW_AT_decl_file   : 7
    <bc2c6>   DW_AT_decl_line   : 63
    <bc2c7>   DW_AT_decl_column : 15
    <bc2c8>   DW_AT_type        : <0xbc2cc>
 <1><bc2cc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bc2cd>   DW_AT_byte_size   : 8
    <bc2cd>   DW_AT_type        : <0xbc2d1>
 <1><bc2d1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bc2d2>   DW_AT_prototyped  : 1
    <bc2d2>   DW_AT_type        : <0xbc022>
    <bc2d6>   DW_AT_sibling     : <0xbc2ea>
