    <76944>   DW_AT_data_member_location: 12
 <2><76945>: Abbrev Number: 0
 <1><76946>: Abbrev Number: 32 (DW_TAG_union_type)
    <76947>   DW_AT_byte_size   : 16
    <76947>   DW_AT_decl_file   : 5
    <76948>   DW_AT_decl_line   : 31
    <76949>   DW_AT_decl_column : 2
    <76949>   DW_AT_sibling     : <0x7695e>
 <2><7694d>: Abbrev Number: 24 (DW_TAG_member)
    <7694e>   DW_AT_type        : <0x76909>
 <2><76952>: Abbrev Number: 33 (DW_TAG_member)
    <76953>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <76957>   DW_AT_decl_file   : 5
    <76958>   DW_AT_decl_line   : 35
    <76959>   DW_AT_decl_column : 7
    <76959>   DW_AT_type        : <0x768f9>
 <2><7695d>: Abbrev Number: 0
 <1><7695e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7695f>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <76963>   DW_AT_byte_size   : 216
    <76964>   DW_AT_decl_file   : 5
    <76965>   DW_AT_decl_line   : 16
    <76966>   DW_AT_decl_column : 16
    <76967>   DW_AT_sibling     : <0x76a7b>
 <2><7696b>: Abbrev Number: 9 (DW_TAG_member)
    <7696c>   DW_AT_name        : id
    <7696f>   DW_AT_decl_file   : 5
    <76970>   DW_AT_decl_line   : 17
    <76971>   DW_AT_decl_column : 6
    <76972>   DW_AT_type        : <0x7669f>
    <76976>   DW_AT_data_member_location: 0
 <2><76977>: Abbrev Number: 3 (DW_TAG_member)
    <76978>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <7697c>   DW_AT_decl_file   : 5
    <7697d>   DW_AT_decl_line   : 18
    <7697e>   DW_AT_decl_column : 6
    <7697f>   DW_AT_type        : <0x7669f>
    <76983>   DW_AT_data_member_location: 4
 <2><76984>: Abbrev Number: 3 (DW_TAG_member)
    <76985>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <76989>   DW_AT_decl_file   : 5
    <7698a>   DW_AT_decl_line   : 19
    <7698b>   DW_AT_decl_column : 18
    <7698c>   DW_AT_type        : <0x76a7b>
    <76990>   DW_AT_data_member_location: 8
 <2><76991>: Abbrev Number: 3 (DW_TAG_member)
    <76992>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <76996>   DW_AT_decl_file   : 5
    <76997>   DW_AT_decl_line   : 20
    <76998>   DW_AT_decl_column : 6
    <76999>   DW_AT_type        : <0x7669f>
    <7699d>   DW_AT_data_member_location: 16
 <2><7699e>: Abbrev Number: 3 (DW_TAG_member)
    <7699f>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <769a3>   DW_AT_decl_file   : 5
    <769a4>   DW_AT_decl_line   : 21
    <769a5>   DW_AT_decl_column : 6
    <769a6>   DW_AT_type        : <0x7669f>
    <769aa>   DW_AT_data_member_location: 20
 <2><769ab>: Abbrev Number: 3 (DW_TAG_member)
    <769ac>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <769b0>   DW_AT_decl_file   : 5
    <769b1>   DW_AT_decl_line   : 22
    <769b2>   DW_AT_decl_column : 6
    <769b3>   DW_AT_type        : <0x7669f>
    <769b7>   DW_AT_data_member_location: 24
 <2><769b8>: Abbrev Number: 3 (DW_TAG_member)
    <769b9>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <769bd>   DW_AT_decl_file   : 5
    <769be>   DW_AT_decl_line   : 23
    <769bf>   DW_AT_decl_column : 8
    <769c0>   DW_AT_type        : <0x766eb>
    <769c4>   DW_AT_data_member_location: 32
 <2><769c5>: Abbrev Number: 3 (DW_TAG_member)
    <769c6>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <769ca>   DW_AT_decl_file   : 5
    <769cb>   DW_AT_decl_line   : 24
    <769cc>   DW_AT_decl_column : 8
    <769cd>   DW_AT_type        : <0x76691>
    <769d1>   DW_AT_data_member_location: 40
 <2><769d2>: Abbrev Number: 3 (DW_TAG_member)
    <769d3>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <769d7>   DW_AT_decl_file   : 5
    <769d8>   DW_AT_decl_line   : 24
    <769d9>   DW_AT_decl_column : 16
    <769da>   DW_AT_type        : <0x76691>
    <769de>   DW_AT_data_member_location: 44
 <2><769df>: Abbrev Number: 34 (DW_TAG_member)
    <769e0>   DW_AT_type        : <0x768e1>
    <769e4>   DW_AT_data_member_location: 48
 <2><769e5>: Abbrev Number: 34 (DW_TAG_member)
    <769e6>   DW_AT_type        : <0x76946>
    <769ea>   DW_AT_data_member_location: 64
 <2><769eb>: Abbrev Number: 3 (DW_TAG_member)
    <769ec>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <769f0>   DW_AT_decl_file   : 5
    <769f1>   DW_AT_decl_line   : 37
    <769f2>   DW_AT_decl_column : 8
    <769f3>   DW_AT_type        : <0x76691>
    <769f7>   DW_AT_data_member_location: 80
 <2><769f8>: Abbrev Number: 3 (DW_TAG_member)
    <769f9>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <769fd>   DW_AT_decl_file   : 5
    <769fe>   DW_AT_decl_line   : 37
    <769ff>   DW_AT_decl_column : 15
    <76a00>   DW_AT_type        : <0x76691>
    <76a04>   DW_AT_data_member_location: 84
 <2><76a05>: Abbrev Number: 3 (DW_TAG_member)
    <76a06>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <76a0a>   DW_AT_decl_file   : 5
    <76a0b>   DW_AT_decl_line   : 37
    <76a0c>   DW_AT_decl_column : 22
    <76a0d>   DW_AT_type        : <0x76691>
    <76a11>   DW_AT_data_member_location: 88
 <2><76a12>: Abbrev Number: 3 (DW_TAG_member)
    <76a13>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <76a17>   DW_AT_decl_file   : 5
    <76a18>   DW_AT_decl_line   : 37
    <76a19>   DW_AT_decl_column : 29
    <76a1a>   DW_AT_type        : <0x76691>
    <76a1e>   DW_AT_data_member_location: 92
 <2><76a1f>: Abbrev Number: 3 (DW_TAG_member)
    <76a20>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <76a24>   DW_AT_decl_file   : 5
    <76a25>   DW_AT_decl_line   : 38
    <76a26>   DW_AT_decl_column : 15
    <76a27>   DW_AT_type        : <0x766c0>
    <76a2b>   DW_AT_data_member_location: 96
 <2><76a2c>: Abbrev Number: 3 (DW_TAG_member)
    <76a2d>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <76a31>   DW_AT_decl_file   : 5
    <76a32>   DW_AT_decl_line   : 38
    <76a33>   DW_AT_decl_column : 25
    <76a34>   DW_AT_type        : <0x766c0>
    <76a38>   DW_AT_data_member_location: 100
 <2><76a39>: Abbrev Number: 3 (DW_TAG_member)
    <76a3a>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <76a3e>   DW_AT_decl_file   : 5
    <76a3f>   DW_AT_decl_line   : 39
    <76a40>   DW_AT_decl_column : 9
    <76a41>   DW_AT_type        : <0x76a9f>
    <76a45>   DW_AT_data_member_location: 104
 <2><76a46>: Abbrev Number: 3 (DW_TAG_member)
    <76a47>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <76a4b>   DW_AT_decl_file   : 5
    <76a4c>   DW_AT_decl_line   : 40
    <76a4d>   DW_AT_decl_column : 17
    <76a4e>   DW_AT_type        : <0x76abd>
    <76a52>   DW_AT_data_member_location: 112
 <2><76a53>: Abbrev Number: 3 (DW_TAG_member)
    <76a54>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <76a58>   DW_AT_decl_file   : 5
    <76a59>   DW_AT_decl_line   : 41
    <76a5a>   DW_AT_decl_column : 10
    <76a5b>   DW_AT_type        : <0x76adb>
    <76a5f>   DW_AT_data_member_location: 120
 <2><76a60>: Abbrev Number: 3 (DW_TAG_member)
    <76a61>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <76a65>   DW_AT_decl_file   : 5
    <76a66>   DW_AT_decl_line   : 42
    <76a67>   DW_AT_decl_column : 11
    <76a68>   DW_AT_type        : <0x76ae0>
    <76a6c>   DW_AT_data_member_location: 128
 <2><76a6d>: Abbrev Number: 3 (DW_TAG_member)
    <76a6e>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <76a72>   DW_AT_decl_file   : 5
    <76a73>   DW_AT_decl_line   : 43
    <76a74>   DW_AT_decl_column : 6
    <76a75>   DW_AT_type        : <0x7669f>
    <76a79>   DW_AT_data_member_location: 208
 <2><76a7a>: Abbrev Number: 0
 <1><76a7b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76a7c>   DW_AT_byte_size   : 8
    <76a7c>   DW_AT_type        : <0x7689a>
 <1><76a80>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <76a81>   DW_AT_prototyped  : 1
    <76a81>   DW_AT_sibling     : <0x76a9a>
 <2><76a85>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76a86>   DW_AT_type        : <0x76a9a>
 <2><76a8a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76a8b>   DW_AT_type        : <0x7669f>
 <2><76a8f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76a90>   DW_AT_type        : <0x7669f>
 <2><76a94>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76a95>   DW_AT_type        : <0x766c0>
 <2><76a99>: Abbrev Number: 0
 <1><76a9a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76a9b>   DW_AT_byte_size   : 8
    <76a9b>   DW_AT_type        : <0x7695e>
 <1><76a9f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76aa0>   DW_AT_byte_size   : 8
    <76aa0>   DW_AT_type        : <0x76a80>
 <1><76aa4>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <76aa5>   DW_AT_prototyped  : 1
    <76aa5>   DW_AT_type        : <0x766c0>
    <76aa9>   DW_AT_sibling     : <0x76abd>
 <2><76aad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76aae>   DW_AT_type        : <0x76a9a>
 <2><76ab2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ab3>   DW_AT_type        : <0x7669f>
 <2><76ab7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ab8>   DW_AT_type        : <0x7669f>
 <2><76abc>: Abbrev Number: 0
 <1><76abd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76abe>   DW_AT_byte_size   : 8
    <76abe>   DW_AT_type        : <0x76aa4>
 <1><76ac2>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <76ac3>   DW_AT_prototyped  : 1
    <76ac3>   DW_AT_type        : <0x766eb>
    <76ac7>   DW_AT_sibling     : <0x76adb>
 <2><76acb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76acc>   DW_AT_type        : <0x766eb>
 <2><76ad0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ad1>   DW_AT_type        : <0x7669f>
 <2><76ad5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ad6>   DW_AT_type        : <0x766f9>
 <2><76ada>: Abbrev Number: 0
 <1><76adb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76adc>   DW_AT_byte_size   : 8
    <76adc>   DW_AT_type        : <0x76ac2>
 <1><76ae0>: Abbrev Number: 26 (DW_TAG_array_type)
    <76ae1>   DW_AT_type        : <0x76af0>
    <76ae5>   DW_AT_sibling     : <0x76af0>
 <2><76ae9>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <76aea>   DW_AT_type        : <0x766c7>
    <76aee>   DW_AT_upper_bound : 9
 <2><76aef>: Abbrev Number: 0
 <1><76af0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76af1>   DW_AT_byte_size   : 8
    <76af1>   DW_AT_type        : <0x76af5>
 <1><76af5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76af6>   DW_AT_byte_size   : 8
    <76af6>   DW_AT_type        : <0x7685b>
 <1><76afa>: Abbrev Number: 14 (DW_TAG_typedef)
    <76afb>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <76aff>   DW_AT_decl_file   : 5
    <76b00>   DW_AT_decl_line   : 44
    <76b01>   DW_AT_decl_column : 3
    <76b02>   DW_AT_type        : <0x7695e>
 <1><76b06>: Abbrev Number: 21 (DW_TAG_structure_type)
    <76b07>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <76b0b>   DW_AT_byte_size   : 12
    <76b0c>   DW_AT_decl_file   : 6
    <76b0d>   DW_AT_decl_line   : 139
    <76b0e>   DW_AT_decl_column : 16
    <76b0f>   DW_AT_sibling     : <0x76b38>
 <2><76b13>: Abbrev Number: 9 (DW_TAG_member)
    <76b14>   DW_AT_name        : ch
    <76b17>   DW_AT_decl_file   : 6
    <76b18>   DW_AT_decl_line   : 140
    <76b19>   DW_AT_decl_column : 14
    <76b1a>   DW_AT_type        : <0x76705>
    <76b1e>   DW_AT_data_member_location: 0
 <2><76b1f>: Abbrev Number: 9 (DW_TAG_member)
    <76b20>   DW_AT_name        : fg
    <76b23>   DW_AT_decl_file   : 6
    <76b24>   DW_AT_decl_line   : 141
    <76b25>   DW_AT_decl_column : 14
    <76b26>   DW_AT_type        : <0x766c0>
    <76b2a>   DW_AT_data_member_location: 4
 <2><76b2b>: Abbrev Number: 9 (DW_TAG_member)
    <76b2c>   DW_AT_name        : bg
    <76b2f>   DW_AT_decl_file   : 6
    <76b30>   DW_AT_decl_line   : 141
    <76b31>   DW_AT_decl_column : 18
    <76b32>   DW_AT_type        : <0x766c0>
    <76b36>   DW_AT_data_member_location: 8
 <2><76b37>: Abbrev Number: 0
 <1><76b38>: Abbrev Number: 14 (DW_TAG_typedef)
    <76b39>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <76b3d>   DW_AT_decl_file   : 6
    <76b3e>   DW_AT_decl_line   : 142
    <76b3f>   DW_AT_decl_column : 3
    <76b40>   DW_AT_type        : <0x76b06>
 <1><76b44>: Abbrev Number: 21 (DW_TAG_structure_type)
    <76b45>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <76b49>   DW_AT_byte_size   : 208
    <76b4a>   DW_AT_decl_file   : 6
    <76b4b>   DW_AT_decl_line   : 144
    <76b4c>   DW_AT_decl_column : 16
    <76b4d>   DW_AT_sibling     : <0x76d07>
 <2><76b51>: Abbrev Number: 9 (DW_TAG_member)
    <76b52>   DW_AT_name        : id
    <76b55>   DW_AT_decl_file   : 6
    <76b56>   DW_AT_decl_line   : 146
    <76b57>   DW_AT_decl_column : 6
    <76b58>   DW_AT_type        : <0x7669f>
    <76b5c>   DW_AT_data_member_location: 0
 <2><76b5d>: Abbrev Number: 3 (DW_TAG_member)
    <76b5e>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <76b62>   DW_AT_decl_file   : 6
    <76b63>   DW_AT_decl_line   : 147
    <76b64>   DW_AT_decl_column : 9
    <76b65>   DW_AT_type        : <0x7669f>
    <76b69>   DW_AT_data_member_location: 4
 <2><76b6a>: Abbrev Number: 3 (DW_TAG_member)
    <76b6b>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <76b6f>   DW_AT_decl_file   : 6
    <76b70>   DW_AT_decl_line   : 148
    <76b71>   DW_AT_decl_column : 21
    <76b72>   DW_AT_type        : <0x76a7b>
    <76b76>   DW_AT_data_member_location: 8
 <2><76b77>: Abbrev Number: 3 (DW_TAG_member)
    <76b78>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <76b7c>   DW_AT_decl_file   : 6
    <76b7d>   DW_AT_decl_line   : 149
    <76b7e>   DW_AT_decl_column : 9
    <76b7f>   DW_AT_type        : <0x7669f>
    <76b83>   DW_AT_data_member_location: 16
 <2><76b84>: Abbrev Number: 3 (DW_TAG_member)
    <76b85>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <76b89>   DW_AT_decl_file   : 6
    <76b8a>   DW_AT_decl_line   : 150
    <76b8b>   DW_AT_decl_column : 9
    <76b8c>   DW_AT_type        : <0x7669f>
    <76b90>   DW_AT_data_member_location: 20
 <2><76b91>: Abbrev Number: 3 (DW_TAG_member)
    <76b92>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <76b96>   DW_AT_decl_file   : 6
    <76b97>   DW_AT_decl_line   : 151
    <76b98>   DW_AT_decl_column : 20
    <76b99>   DW_AT_type        : <0x7689a>
    <76b9d>   DW_AT_data_member_location: 24
 <2><76b9e>: Abbrev Number: 9 (DW_TAG_member)
    <76b9f>   DW_AT_name        : w
    <76ba1>   DW_AT_decl_file   : 6
    <76ba2>   DW_AT_decl_line   : 152
    <76ba3>   DW_AT_decl_column : 9
    <76ba4>   DW_AT_type        : <0x7669f>
    <76ba8>   DW_AT_data_member_location: 32
 <2><76ba9>: Abbrev Number: 9 (DW_TAG_member)
    <76baa>   DW_AT_name        : h
    <76bac>   DW_AT_decl_file   : 6
    <76bad>   DW_AT_decl_line   : 152
    <76bae>   DW_AT_decl_column : 12
    <76baf>   DW_AT_type        : <0x7669f>
    <76bb3>   DW_AT_data_member_location: 36
 <2><76bb4>: Abbrev Number: 3 (DW_TAG_member)
    <76bb5>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <76bb9>   DW_AT_decl_file   : 6
    <76bba>   DW_AT_decl_line   : 153
    <76bbb>   DW_AT_decl_column : 9
    <76bbc>   DW_AT_type        : <0x7669f>
    <76bc0>   DW_AT_data_member_location: 40
 <2><76bc1>: Abbrev Number: 9 (DW_TAG_member)
    <76bc2>   DW_AT_name        : bpp
    <76bc6>   DW_AT_decl_file   : 6
    <76bc7>   DW_AT_decl_line   : 154
    <76bc8>   DW_AT_decl_column : 9
    <76bc9>   DW_AT_type        : <0x7669f>
    <76bcd>   DW_AT_data_member_location: 44
 <2><76bce>: Abbrev Number: 3 (DW_TAG_member)
    <76bcf>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <76bd3>   DW_AT_decl_file   : 6
    <76bd4>   DW_AT_decl_line   : 155
    <76bd5>   DW_AT_decl_column : 9
    <76bd6>   DW_AT_type        : <0x7669f>
    <76bda>   DW_AT_data_member_location: 48
 <2><76bdb>: Abbrev Number: 3 (DW_TAG_member)
    <76bdc>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <76be0>   DW_AT_decl_file   : 6
    <76be1>   DW_AT_decl_line   : 156
    <76be2>   DW_AT_decl_column : 19
    <76be3>   DW_AT_type        : <0x76d07>
    <76be7>   DW_AT_data_member_location: 56
 <2><76be8>: Abbrev Number: 3 (DW_TAG_member)
    <76be9>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <76bed>   DW_AT_decl_file   : 6
    <76bee>   DW_AT_decl_line   : 157
    <76bef>   DW_AT_decl_column : 19
    <76bf0>   DW_AT_type        : <0x76d07>
    <76bf4>   DW_AT_data_member_location: 64
 <2><76bf5>: Abbrev Number: 3 (DW_TAG_member)
    <76bf6>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <76bfa>   DW_AT_decl_file   : 6
    <76bfb>   DW_AT_decl_line   : 158
    <76bfc>   DW_AT_decl_column : 20
    <76bfd>   DW_AT_type        : <0x7689a>
    <76c01>   DW_AT_data_member_location: 72
 <2><76c02>: Abbrev Number: 3 (DW_TAG_member)
    <76c03>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <76c07>   DW_AT_decl_file   : 6
    <76c08>   DW_AT_decl_line   : 159
    <76c09>   DW_AT_decl_column : 11
    <76c0a>   DW_AT_type        : <0x766ed>
    <76c0e>   DW_AT_data_member_location: 80
 <2><76c0f>: Abbrev Number: 3 (DW_TAG_member)
    <76c10>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <76c14>   DW_AT_decl_file   : 6
    <76c15>   DW_AT_decl_line   : 160
    <76c16>   DW_AT_decl_column : 29
    <76c17>   DW_AT_type        : <0x76dd5>
    <76c1b>   DW_AT_data_member_location: 88
 <2><76c1c>: Abbrev Number: 3 (DW_TAG_member)
    <76c1d>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <76c21>   DW_AT_decl_file   : 6
    <76c22>   DW_AT_decl_line   : 161
    <76c23>   DW_AT_decl_column : 9
    <76c24>   DW_AT_type        : <0x7669f>
    <76c28>   DW_AT_data_member_location: 96
 <2><76c29>: Abbrev Number: 3 (DW_TAG_member)
    <76c2a>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <76c2e>   DW_AT_decl_file   : 6
    <76c2f>   DW_AT_decl_line   : 162
    <76c30>   DW_AT_decl_column : 27
    <76c31>   DW_AT_type        : <0x76e05>
    <76c35>   DW_AT_data_member_location: 104
 <2><76c36>: Abbrev Number: 3 (DW_TAG_member)
    <76c37>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <76c3b>   DW_AT_decl_file   : 6
    <76c3c>   DW_AT_decl_line   : 163
    <76c3d>   DW_AT_decl_column : 9
    <76c3e>   DW_AT_type        : <0x7669f>
    <76c42>   DW_AT_data_member_location: 112
 <2><76c43>: Abbrev Number: 3 (DW_TAG_member)
    <76c44>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <76c48>   DW_AT_decl_file   : 6
    <76c49>   DW_AT_decl_line   : 164
    <76c4a>   DW_AT_decl_column : 9
    <76c4b>   DW_AT_type        : <0x7669f>
    <76c4f>   DW_AT_data_member_location: 116
 <2><76c50>: Abbrev Number: 3 (DW_TAG_member)
    <76c51>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <76c55>   DW_AT_decl_file   : 6
    <76c56>   DW_AT_decl_line   : 164
    <76c57>   DW_AT_decl_column : 19
    <76c58>   DW_AT_type        : <0x7669f>
    <76c5c>   DW_AT_data_member_location: 120
 <2><76c5d>: Abbrev Number: 3 (DW_TAG_member)
    <76c5e>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <76c62>   DW_AT_decl_file   : 6
    <76c63>   DW_AT_decl_line   : 165
    <76c64>   DW_AT_decl_column : 24
    <76c65>   DW_AT_type        : <0x76e3c>
    <76c69>   DW_AT_data_member_location: 128
 <2><76c6a>: Abbrev Number: 3 (DW_TAG_member)
    <76c6b>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <76c6f>   DW_AT_decl_file   : 6
    <76c70>   DW_AT_decl_line   : 166
    <76c71>   DW_AT_decl_column : 9
    <76c72>   DW_AT_type        : <0x7669f>
    <76c76>   DW_AT_data_member_location: 136
 <2><76c77>: Abbrev Number: 3 (DW_TAG_member)
    <76c78>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <76c7c>   DW_AT_decl_file   : 6
    <76c7d>   DW_AT_decl_line   : 166
    <76c7e>   DW_AT_decl_column : 17
    <76c7f>   DW_AT_type        : <0x7669f>
    <76c83>   DW_AT_data_member_location: 140
 <2><76c84>: Abbrev Number: 3 (DW_TAG_member)
    <76c85>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <76c89>   DW_AT_decl_file   : 6
    <76c8a>   DW_AT_decl_line   : 167
    <76c8b>   DW_AT_decl_column : 11
    <76c8c>   DW_AT_type        : <0x76691>
    <76c90>   DW_AT_data_member_location: 144
 <2><76c91>: Abbrev Number: 9 (DW_TAG_member)
    <76c92>   DW_AT_name        : key
    <76c96>   DW_AT_decl_file   : 6
    <76c97>   DW_AT_decl_line   : 168
    <76c98>   DW_AT_decl_column : 11
    <76c99>   DW_AT_type        : <0x766ed>
    <76c9d>   DW_AT_data_member_location: 152
 <2><76c9e>: Abbrev Number: 3 (DW_TAG_member)
    <76c9f>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <76ca3>   DW_AT_decl_file   : 6
    <76ca4>   DW_AT_decl_line   : 169
    <76ca5>   DW_AT_decl_column : 6
    <76ca6>   DW_AT_type        : <0x7669f>
    <76caa>   DW_AT_data_member_location: 160
 <2><76cab>: Abbrev Number: 3 (DW_TAG_member)
    <76cac>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <76cb0>   DW_AT_decl_file   : 6
    <76cb1>   DW_AT_decl_line   : 170
    <76cb2>   DW_AT_decl_column : 18
    <76cb3>   DW_AT_type        : <0x76e41>
    <76cb7>   DW_AT_data_member_location: 168
 <2><76cb8>: Abbrev Number: 3 (DW_TAG_member)
    <76cb9>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <76cbd>   DW_AT_decl_file   : 6
    <76cbe>   DW_AT_decl_line   : 171
    <76cbf>   DW_AT_decl_column : 12
    <76cc0>   DW_AT_type        : <0x76831>
    <76cc4>   DW_AT_data_member_location: 176
 <2><76cc5>: Abbrev Number: 3 (DW_TAG_member)
    <76cc6>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <76cca>   DW_AT_decl_file   : 6
    <76ccb>   DW_AT_decl_line   : 172
    <76ccc>   DW_AT_decl_column : 9
    <76ccd>   DW_AT_type        : <0x7669f>
    <76cd1>   DW_AT_data_member_location: 184
 <2><76cd2>: Abbrev Number: 3 (DW_TAG_member)
    <76cd3>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <76cd7>   DW_AT_decl_file   : 6
    <76cd8>   DW_AT_decl_line   : 172
    <76cd9>   DW_AT_decl_column : 21
    <76cda>   DW_AT_type        : <0x7669f>
    <76cde>   DW_AT_data_member_location: 188
 <2><76cdf>: Abbrev Number: 3 (DW_TAG_member)
    <76ce0>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <76ce4>   DW_AT_decl_file   : 6
    <76ce5>   DW_AT_decl_line   : 173
    <76ce6>   DW_AT_decl_column : 11
    <76ce7>   DW_AT_type        : <0x76e4b>
    <76ceb>   DW_AT_data_member_location: 192
 <2><76cec>: Abbrev Number: 3 (DW_TAG_member)
    <76ced>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <76cf1>   DW_AT_decl_file   : 6
    <76cf2>   DW_AT_decl_line   : 174
    <76cf3>   DW_AT_decl_column : 15
    <76cf4>   DW_AT_type        : <0x766e1>
    <76cf8>   DW_AT_data_member_location: 200
 <2><76cf9>: Abbrev Number: 3 (DW_TAG_member)
    <76cfa>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <76cfe>   DW_AT_decl_file   : 6
    <76cff>   DW_AT_decl_line   : 175
    <76d00>   DW_AT_decl_column : 6
    <76d01>   DW_AT_type        : <0x7669f>
    <76d05>   DW_AT_data_member_location: 204
 <2><76d06>: Abbrev Number: 0
 <1><76d07>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76d08>   DW_AT_byte_size   : 8
    <76d08>   DW_AT_type        : <0x766c0>
 <1><76d0c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <76d0d>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <76d11>   DW_AT_byte_size   : 112
    <76d12>   DW_AT_decl_file   : 6
    <76d13>   DW_AT_decl_line   : 178
    <76d14>   DW_AT_decl_column : 16
    <76d15>   DW_AT_sibling     : <0x76dd0>
 <2><76d19>: Abbrev Number: 3 (DW_TAG_member)
    <76d1a>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <76d1e>   DW_AT_decl_file   : 6
    <76d1f>   DW_AT_decl_line   : 188
    <76d20>   DW_AT_decl_column : 8
    <76d21>   DW_AT_type        : <0x766ed>
    <76d25>   DW_AT_data_member_location: 0
 <2><76d26>: Abbrev Number: 3 (DW_TAG_member)
    <76d27>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <76d2b>   DW_AT_decl_file   : 6
    <76d2c>   DW_AT_decl_line   : 208
    <76d2d>   DW_AT_decl_column : 8
    <76d2e>   DW_AT_type        : <0x76e84>
    <76d32>   DW_AT_data_member_location: 8
 <2><76d33>: Abbrev Number: 3 (DW_TAG_member)
    <76d34>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <76d38>   DW_AT_decl_file   : 6
    <76d39>   DW_AT_decl_line   : 222
    <76d3a>   DW_AT_decl_column : 9
    <76d3b>   DW_AT_type        : <0x76720>
    <76d3f>   DW_AT_data_member_location: 16
 <2><76d40>: Abbrev Number: 3 (DW_TAG_member)
    <76d41>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <76d45>   DW_AT_decl_file   : 6
    <76d46>   DW_AT_decl_line   : 231
    <76d47>   DW_AT_decl_column : 9
    <76d48>   DW_AT_type        : <0x76720>
    <76d4c>   DW_AT_data_member_location: 24
 <2><76d4d>: Abbrev Number: 3 (DW_TAG_member)
    <76d4e>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <76d52>   DW_AT_decl_file   : 6
    <76d53>   DW_AT_decl_line   : 239
    <76d54>   DW_AT_decl_column : 9
    <76d55>   DW_AT_type        : <0x76720>
    <76d59>   DW_AT_data_member_location: 32
 <2><76d5a>: Abbrev Number: 3 (DW_TAG_member)
    <76d5b>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <76d5f>   DW_AT_decl_file   : 6
    <76d60>   DW_AT_decl_line   : 248
    <76d61>   DW_AT_decl_column : 9
    <76d62>   DW_AT_type        : <0x76ea3>
    <76d66>   DW_AT_data_member_location: 40
 <2><76d67>: Abbrev Number: 11 (DW_TAG_member)
    <76d68>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <76d6c>   DW_AT_decl_file   : 6
    <76d6c>   DW_AT_decl_line   : 258
    <76d6e>   DW_AT_decl_column : 9
    <76d6f>   DW_AT_type        : <0x76720>
    <76d73>   DW_AT_data_member_location: 48
 <2><76d74>: Abbrev Number: 11 (DW_TAG_member)
    <76d75>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <76d79>   DW_AT_decl_file   : 6
    <76d79>   DW_AT_decl_line   : 274
    <76d7b>   DW_AT_decl_column : 8
    <76d7c>   DW_AT_type        : <0x76809>
    <76d80>   DW_AT_data_member_location: 56
 <2><76d81>: Abbrev Number: 11 (DW_TAG_member)
    <76d82>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <76d86>   DW_AT_decl_file   : 6
    <76d86>   DW_AT_decl_line   : 285
    <76d88>   DW_AT_decl_column : 9
    <76d89>   DW_AT_type        : <0x76ea3>
    <76d8d>   DW_AT_data_member_location: 64
 <2><76d8e>: Abbrev Number: 11 (DW_TAG_member)
    <76d8f>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <76d93>   DW_AT_decl_file   : 6
    <76d93>   DW_AT_decl_line   : 293
    <76d95>   DW_AT_decl_column : 9
    <76d96>   DW_AT_type        : <0x76eb3>
    <76d9a>   DW_AT_data_member_location: 72
 <2><76d9b>: Abbrev Number: 11 (DW_TAG_member)
    <76d9c>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <76da0>   DW_AT_decl_file   : 6
    <76da0>   DW_AT_decl_line   : 301
    <76da2>   DW_AT_decl_column : 8
    <76da3>   DW_AT_type        : <0x767eb>
    <76da7>   DW_AT_data_member_location: 80
 <2><76da8>: Abbrev Number: 11 (DW_TAG_member)
    <76da9>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <76dad>   DW_AT_decl_file   : 6
    <76dad>   DW_AT_decl_line   : 314
    <76daf>   DW_AT_decl_column : 9
    <76db0>   DW_AT_type        : <0x76ecc>
    <76db4>   DW_AT_data_member_location: 88
 <2><76db5>: Abbrev Number: 11 (DW_TAG_member)
    <76db6>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <76dba>   DW_AT_decl_file   : 6
    <76dba>   DW_AT_decl_line   : 321
    <76dbc>   DW_AT_decl_column : 9
    <76dbd>   DW_AT_type        : <0x76720>
    <76dc1>   DW_AT_data_member_location: 96
 <2><76dc2>: Abbrev Number: 11 (DW_TAG_member)
    <76dc3>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <76dc7>   DW_AT_decl_file   : 6
    <76dc7>   DW_AT_decl_line   : 328
    <76dc9>   DW_AT_decl_column : 9
    <76dca>   DW_AT_type        : <0x76720>
    <76dce>   DW_AT_data_member_location: 104
 <2><76dcf>: Abbrev Number: 0
 <1><76dd0>: Abbrev Number: 18 (DW_TAG_const_type)
    <76dd1>   DW_AT_type        : <0x76d0c>
 <1><76dd5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76dd6>   DW_AT_byte_size   : 8
    <76dd6>   DW_AT_type        : <0x76dd0>
 <1><76dda>: Abbrev Number: 37 (DW_TAG_structure_type)
    <76ddb>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <76ddf>   DW_AT_byte_size   : 16
    <76ddf>   DW_AT_decl_file   : 6
    <76ddf>   DW_AT_decl_line   : 331
    <76de1>   DW_AT_decl_column : 16
    <76de1>   DW_AT_sibling     : <0x76e00>
 <2><76de5>: Abbrev Number: 11 (DW_TAG_member)
    <76de6>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <76dea>   DW_AT_decl_file   : 6
    <76dea>   DW_AT_decl_line   : 333
    <76dec>   DW_AT_decl_column : 12
    <76ded>   DW_AT_type        : <0x766e6>
    <76df1>   DW_AT_data_member_location: 0
 <2><76df2>: Abbrev Number: 11 (DW_TAG_member)
    <76df3>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <76df7>   DW_AT_decl_file   : 6
    <76df7>   DW_AT_decl_line   : 334
    <76df9>   DW_AT_decl_column : 23
    <76dfa>   DW_AT_type        : <0x76ed1>
    <76dfe>   DW_AT_data_member_location: 8
 <2><76dff>: Abbrev Number: 0
 <1><76e00>: Abbrev Number: 18 (DW_TAG_const_type)
    <76e01>   DW_AT_type        : <0x76dda>
 <1><76e05>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e06>   DW_AT_byte_size   : 8
    <76e06>   DW_AT_type        : <0x76e00>
 <1><76e0a>: Abbrev Number: 37 (DW_TAG_structure_type)
    <76e0b>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <76e0f>   DW_AT_byte_size   : 16
    <76e0f>   DW_AT_decl_file   : 6
    <76e0f>   DW_AT_decl_line   : 337
    <76e11>   DW_AT_decl_column : 16
    <76e11>   DW_AT_sibling     : <0x76e37>
 <2><76e15>: Abbrev Number: 38 (DW_TAG_member)
    <76e16>   DW_AT_name        : w
    <76e18>   DW_AT_decl_file   : 6
    <76e18>   DW_AT_decl_line   : 339
    <76e1a>   DW_AT_decl_column : 15
    <76e1a>   DW_AT_type        : <0x766e6>
    <76e1e>   DW_AT_data_member_location: 0
 <2><76e1f>: Abbrev Number: 38 (DW_TAG_member)
    <76e20>   DW_AT_name        : h
    <76e22>   DW_AT_decl_file   : 6
    <76e22>   DW_AT_decl_line   : 340
    <76e24>   DW_AT_decl_column : 15
    <76e24>   DW_AT_type        : <0x766e6>
    <76e28>   DW_AT_data_member_location: 4
 <2><76e29>: Abbrev Number: 11 (DW_TAG_member)
    <76e2a>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <76e2e>   DW_AT_decl_file   : 6
    <76e2e>   DW_AT_decl_line   : 341
    <76e30>   DW_AT_decl_column : 23
    <76e31>   DW_AT_type        : <0x76ed1>
    <76e35>   DW_AT_data_member_location: 8
 <2><76e36>: Abbrev Number: 0
 <1><76e37>: Abbrev Number: 18 (DW_TAG_const_type)
    <76e38>   DW_AT_type        : <0x76e0a>
 <1><76e3c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e3d>   DW_AT_byte_size   : 8
    <76e3d>   DW_AT_type        : <0x76e37>
 <1><76e41>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e42>   DW_AT_byte_size   : 8
    <76e42>   DW_AT_type        : <0x76e46>
 <1><76e46>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e47>   DW_AT_byte_size   : 8
    <76e47>   DW_AT_type        : <0x76b38>
 <1><76e4b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e4c>   DW_AT_byte_size   : 8
    <76e4c>   DW_AT_type        : <0x76726>
 <1><76e50>: Abbrev Number: 14 (DW_TAG_typedef)
    <76e51>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <76e55>   DW_AT_decl_file   : 6
    <76e56>   DW_AT_decl_line   : 176
    <76e57>   DW_AT_decl_column : 3
    <76e58>   DW_AT_type        : <0x76b44>
 <1><76e5c>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <76e5d>   DW_AT_prototyped  : 1
    <76e5d>   DW_AT_type        : <0x7669f>
    <76e61>   DW_AT_sibling     : <0x76e84>
 <2><76e65>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e66>   DW_AT_type        : <0x766ed>
 <2><76e6a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e6b>   DW_AT_type        : <0x7669f>
 <2><76e6f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e70>   DW_AT_type        : <0x7669f>
 <2><76e74>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e75>   DW_AT_type        : <0x7669f>
 <2><76e79>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e7a>   DW_AT_type        : <0x7669f>
 <2><76e7e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e7f>   DW_AT_type        : <0x7669f>
 <2><76e83>: Abbrev Number: 0
 <1><76e84>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76e85>   DW_AT_byte_size   : 8
    <76e85>   DW_AT_type        : <0x76e5c>
 <1><76e89>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <76e8a>   DW_AT_prototyped  : 1
    <76e8a>   DW_AT_sibling     : <0x76ea3>
 <2><76e8e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e8f>   DW_AT_type        : <0x7669f>
 <2><76e93>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e94>   DW_AT_type        : <0x7669f>
 <2><76e98>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e99>   DW_AT_type        : <0x7669f>
 <2><76e9d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76e9e>   DW_AT_type        : <0x7669f>
 <2><76ea2>: Abbrev Number: 0
 <1><76ea3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76ea4>   DW_AT_byte_size   : 8
    <76ea4>   DW_AT_type        : <0x76e89>
 <1><76ea8>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <76ea9>   DW_AT_prototyped  : 1
    <76ea9>   DW_AT_sibling     : <0x76eb3>
 <2><76ead>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76eae>   DW_AT_type        : <0x766ed>
 <2><76eb2>: Abbrev Number: 0
 <1><76eb3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76eb4>   DW_AT_byte_size   : 8
    <76eb4>   DW_AT_type        : <0x76ea8>
 <1><76eb8>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <76eb9>   DW_AT_prototyped  : 1
    <76eb9>   DW_AT_type        : <0x76804>
    <76ebd>   DW_AT_sibling     : <0x76ecc>
 <2><76ec1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ec2>   DW_AT_type        : <0x7669f>
 <2><76ec6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ec7>   DW_AT_type        : <0x76804>
 <2><76ecb>: Abbrev Number: 0
 <1><76ecc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76ecd>   DW_AT_byte_size   : 8
    <76ecd>   DW_AT_type        : <0x76eb8>
 <1><76ed1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76ed2>   DW_AT_byte_size   : 8
    <76ed2>   DW_AT_type        : <0x766b4>
 <1><76ed6>: Abbrev Number: 39 (DW_TAG_variable)
    <76ed7>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <76edb>   DW_AT_decl_file   : 6
    <76edb>   DW_AT_decl_line   : 364
    <76edd>   DW_AT_decl_column : 15
    <76ede>   DW_AT_type        : <0x76ee2>
    <76ee2>   DW_AT_external    : 1
    <76ee2>   DW_AT_declaration : 1
 <1><76ee2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76ee3>   DW_AT_byte_size   : 8
    <76ee3>   DW_AT_type        : <0x76e50>
 <1><76ee7>: Abbrev Number: 39 (DW_TAG_variable)
    <76ee8>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <76eec>   DW_AT_decl_file   : 6
    <76eec>   DW_AT_decl_line   : 369
    <76eee>   DW_AT_decl_column : 16
    <76eef>   DW_AT_type        : <0x76adb>
    <76ef3>   DW_AT_external    : 1
    <76ef3>   DW_AT_declaration : 1
 <1><76ef3>: Abbrev Number: 40 (DW_TAG_subprogram)
    <76ef4>   DW_AT_external    : 1
    <76ef4>   DW_AT_name        : sin
    <76ef8>   DW_AT_decl_file   : 7
    <76ef8>   DW_AT_decl_line   : 64
    <76ef9>   DW_AT_decl_column : 1
    <76ef9>   DW_AT_prototyped  : 1
    <76ef9>   DW_AT_type        : <0x76698>
    <76efd>   DW_AT_declaration : 1
    <76efd>   DW_AT_sibling     : <0x76f07>
 <2><76f01>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f02>   DW_AT_type        : <0x76698>
 <2><76f06>: Abbrev Number: 0
 <1><76f07>: Abbrev Number: 40 (DW_TAG_subprogram)
    <76f08>   DW_AT_external    : 1
    <76f08>   DW_AT_name        : cos
    <76f0c>   DW_AT_decl_file   : 7
    <76f0c>   DW_AT_decl_line   : 62
    <76f0d>   DW_AT_decl_column : 1
    <76f0d>   DW_AT_prototyped  : 1
    <76f0d>   DW_AT_type        : <0x76698>
    <76f11>   DW_AT_declaration : 1
    <76f11>   DW_AT_sibling     : <0x76f1b>
 <2><76f15>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f16>   DW_AT_type        : <0x76698>
 <2><76f1a>: Abbrev Number: 0
 <1><76f1b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <76f1c>   DW_AT_external    : 1
    <76f1c>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <76f20>   DW_AT_decl_file   : 6
    <76f20>   DW_AT_decl_line   : 470
    <76f22>   DW_AT_decl_column : 20
    <76f23>   DW_AT_prototyped  : 1
    <76f23>   DW_AT_declaration : 1
    <76f23>   DW_AT_sibling     : <0x76f32>
 <2><76f27>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f28>   DW_AT_type        : <0x7669f>
 <2><76f2c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f2d>   DW_AT_type        : <0x7669f>
 <2><76f31>: Abbrev Number: 0
 <1><76f32>: Abbrev Number: 50 (DW_TAG_subprogram)
    <76f33>   DW_AT_external    : 1
    <76f33>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <76f37>   DW_AT_decl_file   : 6
    <76f38>   DW_AT_decl_line   : 469
    <76f3a>   DW_AT_decl_column : 20
    <76f3b>   DW_AT_prototyped  : 1
    <76f3b>   DW_AT_declaration : 1
 <1><76f3b>: Abbrev Number: 51 (DW_TAG_subprogram)
    <76f3c>   DW_AT_external    : 1
    <76f3c>   DW_AT_name        : (indirect string, offset: 0x16e45): sqrt
    <76f40>   DW_AT_decl_file   : 7
    <76f41>   DW_AT_decl_line   : 143
    <76f42>   DW_AT_decl_column : 1
    <76f43>   DW_AT_prototyped  : 1
    <76f43>   DW_AT_type        : <0x76698>
    <76f47>   DW_AT_declaration : 1
    <76f47>   DW_AT_sibling     : <0x76f51>
 <2><76f4b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f4c>   DW_AT_type        : <0x76698>
 <2><76f50>: Abbrev Number: 0
 <1><76f51>: Abbrev Number: 19 (DW_TAG_subprogram)
    <76f52>   DW_AT_external    : 1
    <76f52>   DW_AT_name        : (indirect string, offset: 0x49a5): fb_GfxLine
    <76f56>   DW_AT_decl_file   : 6
    <76f56>   DW_AT_decl_line   : 459
    <76f58>   DW_AT_decl_column : 20
    <76f59>   DW_AT_prototyped  : 1
    <76f59>   DW_AT_declaration : 1
    <76f59>   DW_AT_sibling     : <0x76f8b>
 <2><76f5d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f5e>   DW_AT_type        : <0x766eb>
 <2><76f62>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f63>   DW_AT_type        : <0x76691>
 <2><76f67>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f68>   DW_AT_type        : <0x76691>
 <2><76f6c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f6d>   DW_AT_type        : <0x76691>
 <2><76f71>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f72>   DW_AT_type        : <0x76691>
 <2><76f76>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f77>   DW_AT_type        : <0x766c0>
 <2><76f7b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f7c>   DW_AT_type        : <0x7669f>
 <2><76f80>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f81>   DW_AT_type        : <0x766c0>
 <2><76f85>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f86>   DW_AT_type        : <0x7669f>
 <2><76f8a>: Abbrev Number: 0
 <1><76f8b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <76f8c>   DW_AT_external    : 1
    <76f8c>   DW_AT_name        : (indirect string, offset: 0x16de3): fb_hTranslateCoord
    <76f90>   DW_AT_decl_file   : 6
    <76f90>   DW_AT_decl_line   : 411
    <76f92>   DW_AT_decl_column : 13
    <76f93>   DW_AT_prototyped  : 1
    <76f93>   DW_AT_declaration : 1
    <76f93>   DW_AT_sibling     : <0x76fb1>
 <2><76f97>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f98>   DW_AT_type        : <0x76fb1>
 <2><76f9c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76f9d>   DW_AT_type        : <0x76691>
 <2><76fa1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fa2>   DW_AT_type        : <0x76691>
 <2><76fa6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fa7>   DW_AT_type        : <0x76804>
 <2><76fab>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fac>   DW_AT_type        : <0x76804>
 <2><76fb0>: Abbrev Number: 0
 <1><76fb1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76fb2>   DW_AT_byte_size   : 8
    <76fb2>   DW_AT_type        : <0x76afa>
 <1><76fb6>: Abbrev Number: 19 (DW_TAG_subprogram)
    <76fb7>   DW_AT_external    : 1
    <76fb7>   DW_AT_name        : (indirect string, offset: 0x16e2a): fb_hFixRelative
    <76fbb>   DW_AT_decl_file   : 6
    <76fbb>   DW_AT_decl_line   : 412
    <76fbd>   DW_AT_decl_column : 13
    <76fbe>   DW_AT_prototyped  : 1
    <76fbe>   DW_AT_declaration : 1
    <76fbe>   DW_AT_sibling     : <0x76fe1>
 <2><76fc2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fc3>   DW_AT_type        : <0x76fb1>
 <2><76fc7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fc8>   DW_AT_type        : <0x7669f>
 <2><76fcc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fcd>   DW_AT_type        : <0x76fe1>
 <2><76fd1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fd2>   DW_AT_type        : <0x76fe1>
 <2><76fd6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fd7>   DW_AT_type        : <0x76fe1>
 <2><76fdb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76fdc>   DW_AT_type        : <0x76fe1>
 <2><76fe0>: Abbrev Number: 0
 <1><76fe1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <76fe2>   DW_AT_byte_size   : 8
    <76fe2>   DW_AT_type        : <0x76691>
 <1><76fe6>: Abbrev Number: 19 (DW_TAG_subprogram)
    <76fe7>   DW_AT_external    : 1
    <76fe7>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <76feb>   DW_AT_decl_file   : 6
    <76feb>   DW_AT_decl_line   : 410
    <76fed>   DW_AT_decl_column : 13
    <76fee>   DW_AT_prototyped  : 1
    <76fee>   DW_AT_declaration : 1
    <76fee>   DW_AT_sibling     : <0x76ffd>
 <2><76ff2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ff3>   DW_AT_type        : <0x76fb1>
 <2><76ff7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76ff8>   DW_AT_type        : <0x766c0>
 <2><76ffc>: Abbrev Number: 0
 <1><76ffd>: Abbrev Number: 52 (DW_TAG_subprogram)
    <76ffe>   DW_AT_external    : 1
    <76ffe>   DW_AT_name        : (indirect string, offset: 0x16da4): fb_hFixColor
    <77002>   DW_AT_decl_file   : 6
    <77003>   DW_AT_decl_line   : 405
    <77005>   DW_AT_decl_column : 21
    <77006>   DW_AT_prototyped  : 1
    <77006>   DW_AT_type        : <0x766c0>
    <7700a>   DW_AT_declaration : 1
    <7700a>   DW_AT_sibling     : <0x77019>
 <2><7700e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7700f>   DW_AT_type        : <0x7669f>
 <2><77013>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <77014>   DW_AT_type        : <0x766c0>
 <2><77018>: Abbrev Number: 0
 <1><77019>: Abbrev Number: 19 (DW_TAG_subprogram)
    <7701a>   DW_AT_external    : 1
    <7701a>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <7701e>   DW_AT_decl_file   : 6
    <7701e>   DW_AT_decl_line   : 409
    <77020>   DW_AT_decl_column : 13
    <77021>   DW_AT_prototyped  : 1
    <77021>   DW_AT_declaration : 1
    <77021>   DW_AT_sibling     : <0x77030>
 <2><77025>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <77026>   DW_AT_type        : <0x76fb1>
 <2><7702a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7702b>   DW_AT_type        : <0x766eb>
 <2><7702f>: Abbrev Number: 0
 <1><77030>: Abbrev Number: 53 (DW_TAG_subprogram)
    <77031>   DW_AT_external    : 1
    <77031>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <77035>   DW_AT_decl_file   : 6
    <77036>   DW_AT_decl_line   : 396
    <77038>   DW_AT_decl_column : 19
    <77039>   DW_AT_prototyped  : 1
    <77039>   DW_AT_type        : <0x76fb1>
    <7703d>   DW_AT_declaration : 1
 <1><7703d>: Abbrev Number: 54 (DW_TAG_subprogram)
    <7703e>   DW_AT_external    : 1
    <7703e>   DW_AT_name        : (indirect string, offset: 0x9e77): fb_GfxEllipse
    <77042>   DW_AT_decl_file   : 1
    <77043>   DW_AT_decl_line   : 100
    <77044>   DW_AT_decl_column : 13
    <77045>   DW_AT_prototyped  : 1
    <77045>   DW_AT_low_pc      : 0x4591f0
    <7704d>   DW_AT_high_pc     : 0xa6b
    <77055>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <77057>   DW_AT_call_all_calls: 1
    <77057>   DW_AT_sibling     : <0x7783e>
 <2><7705b>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <7705c>   DW_AT_name        : (indirect string, offset: 0x167a7): target
    <77060>   DW_AT_decl_file   : 1
    <77060>   DW_AT_decl_line   : 100
    <77061>   DW_AT_decl_column : 33
    <77062>   DW_AT_type        : <0x766eb>
    <77066>   DW_AT_location    : 0x21360 (location list)
    <7706a>   DW_AT_GNU_locviews: 0x21342
 <2><7706e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <7706f>   DW_AT_name        : fx
    <77072>   DW_AT_decl_file   : 1
    <77072>   DW_AT_decl_line   : 100
    <77073>   DW_AT_decl_column : 47
    <77074>   DW_AT_type        : <0x76691>
    <77078>   DW_AT_location    : 0x213e1 (location list)
    <7707c>   DW_AT_GNU_locviews: 0x213df
 <2><77080>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <77081>   DW_AT_name        : fy
    <77084>   DW_AT_decl_file   : 1
    <77084>   DW_AT_decl_line   : 100
    <77085>   DW_AT_decl_column : 57
    <77086>   DW_AT_type        : <0x76691>
    <7708a>   DW_AT_location    : 0x213eb (location list)
    <7708e>   DW_AT_GNU_locviews: 0x213e9
 <2><77092>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <77093>   DW_AT_name        : (indirect string, offset: 0x16e23): radius
    <77097>   DW_AT_decl_file   : 1
    <77097>   DW_AT_decl_line   : 100
    <77098>   DW_AT_decl_column : 67
    <77099>   DW_AT_type        : <0x76691>
    <7709d>   DW_AT_location    : 0x21401 (location list)
    <770a1>   DW_AT_GNU_locviews: 0x213f3
 <2><770a5>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <770a6>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <770aa>   DW_AT_decl_file   : 1
    <770aa>   DW_AT_decl_line   : 100
    <770ab>   DW_AT_decl_column : 88
    <770ac>   DW_AT_type        : <0x766c0>
    <770b0>   DW_AT_location    : 0x21458 (location list)
    <770b4>   DW_AT_GNU_locviews: 0x21448
 <2><770b8>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <770b9>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <770bd>   DW_AT_decl_file   : 1
    <770bd>   DW_AT_decl_line   : 100
    <770be>   DW_AT_decl_column : 101
    <770bf>   DW_AT_type        : <0x76691>
    <770c3>   DW_AT_location    : 0x214a9 (location list)
    <770c7>   DW_AT_GNU_locviews: 0x2149b
 <2><770cb>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <770cc>   DW_AT_name        : (indirect string, offset: 0x18b60): start
    <770d0>   DW_AT_decl_file   : 1
    <770d0>   DW_AT_decl_line   : 100
    <770d1>   DW_AT_decl_column : 115
    <770d2>   DW_AT_type        : <0x76691>
    <770d6>   DW_AT_location    : 0x2151d (location list)
    <770da>   DW_AT_GNU_locviews: 0x214e9
 <2><770de>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <770df>   DW_AT_name        : end
    <770e3>   DW_AT_decl_file   : 1
    <770e3>   DW_AT_decl_line   : 100
    <770e4>   DW_AT_decl_column : 128
    <770e5>   DW_AT_type        : <0x76691>
    <770e9>   DW_AT_location    : 0x21625 (location list)
    <770ed>   DW_AT_GNU_locviews: 0x21601
 <2><770f1>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <770f2>   DW_AT_name        : (indirect string, offset: 0x1affd): fill
    <770f6>   DW_AT_decl_file   : 1
    <770f6>   DW_AT_decl_line   : 100
    <770f7>   DW_AT_decl_column : 137
    <770f8>   DW_AT_type        : <0x7669f>
    <770fc>   DW_AT_location    : 0x216e3 (location list)
    <77100>   DW_AT_GNU_locviews: 0x216d1
 <2><77104>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <77105>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <77109>   DW_AT_decl_file   : 1
    <77109>   DW_AT_decl_line   : 100
    <7710a>   DW_AT_decl_column : 147
    <7710b>   DW_AT_type        : <0x7669f>
    <7710f>   DW_AT_location    : 0x2174d (location list)
    <77113>   DW_AT_GNU_locviews: 0x2172f
 <2><77117>: Abbrev Number: 20 (DW_TAG_variable)
    <77118>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7711c>   DW_AT_decl_file   : 1
    <7711c>   DW_AT_decl_line   : 102
    <7711d>   DW_AT_decl_column : 13
    <7711e>   DW_AT_type        : <0x76fb1>
    <77122>   DW_AT_location    : 0x217d2 (location list)
    <77126>   DW_AT_GNU_locviews: 0x217cc
 <2><7712a>: Abbrev Number: 41 (DW_TAG_variable)
    <7712b>   DW_AT_name        : x
    <7712d>   DW_AT_decl_file   : 1
    <7712d>   DW_AT_decl_line   : 103
    <7712e>   DW_AT_decl_column : 6
    <7712f>   DW_AT_type        : <0x7669f>
    <77133>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><77137>: Abbrev Number: 41 (DW_TAG_variable)
    <77138>   DW_AT_name        : y
    <7713a>   DW_AT_decl_file   : 1
    <7713a>   DW_AT_decl_line   : 103
    <7713b>   DW_AT_decl_column : 9
    <7713c>   DW_AT_type        : <0x7669f>
    <77140>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><77144>: Abbrev Number: 22 (DW_TAG_variable)
    <77145>   DW_AT_name        : x1
    <77148>   DW_AT_decl_file   : 1
    <77148>   DW_AT_decl_line   : 103
    <77149>   DW_AT_decl_column : 12
    <7714a>   DW_AT_type        : <0x7669f>
    <7714e>   DW_AT_location    : 0x217f6 (location list)
    <77152>   DW_AT_GNU_locviews: 0x217e8
 <2><77156>: Abbrev Number: 22 (DW_TAG_variable)
    <77157>   DW_AT_name        : y1
    <7715a>   DW_AT_decl_file   : 1
    <7715a>   DW_AT_decl_line   : 103
    <7715b>   DW_AT_decl_column : 16
    <7715c>   DW_AT_type        : <0x7669f>
    <77160>   DW_AT_location    : 0x2184a (location list)
    <77164>   DW_AT_GNU_locviews: 0x21844
 <2><77168>: Abbrev Number: 22 (DW_TAG_variable)
    <77169>   DW_AT_name        : top
    <7716d>   DW_AT_decl_file   : 1
    <7716d>   DW_AT_decl_line   : 103
    <7716e>   DW_AT_decl_column : 20
    <7716f>   DW_AT_type        : <0x7669f>
    <77173>   DW_AT_location    : 0x2187d (location list)
    <77177>   DW_AT_GNU_locviews: 0x21865
 <2><7717b>: Abbrev Number: 20 (DW_TAG_variable)
    <7717c>   DW_AT_name        : (indirect string, offset: 0x1aa62): bottom
    <77180>   DW_AT_decl_file   : 1
    <77180>   DW_AT_decl_line   : 103
    <77181>   DW_AT_decl_column : 25
    <77182>   DW_AT_type        : <0x7669f>
    <77186>   DW_AT_location    : 0x218f0 (location list)
    <7718a>   DW_AT_GNU_locviews: 0x218da
 <2><7718e>: Abbrev Number: 20 (DW_TAG_variable)
    <7718f>   DW_AT_name        : (indirect string, offset: 0x16e3a): orig_color
    <77193>   DW_AT_decl_file   : 1
    <77193>   DW_AT_decl_line   : 104
    <77194>   DW_AT_decl_column : 15
    <77195>   DW_AT_type        : <0x766c0>
    <77199>   DW_AT_location    : 0x21954 (location list)
    <7719d>   DW_AT_GNU_locviews: 0x21946
 <2><771a1>: Abbrev Number: 22 (DW_TAG_variable)
    <771a2>   DW_AT_name        : a
    <771a4>   DW_AT_decl_file   : 1
    <771a4>   DW_AT_decl_line   : 105
    <771a5>   DW_AT_decl_column : 8
    <771a6>   DW_AT_type        : <0x76691>
    <771aa>   DW_AT_location    : 0x21998 (location list)
    <771ae>   DW_AT_GNU_locviews: 0x21994
 <2><771b2>: Abbrev Number: 22 (DW_TAG_variable)
    <771b3>   DW_AT_name        : b
    <771b5>   DW_AT_decl_file   : 1
    <771b5>   DW_AT_decl_line   : 105
    <771b6>   DW_AT_decl_column : 11
    <771b7>   DW_AT_type        : <0x76691>
    <771bb>   DW_AT_location    : 0x21998 (location list)
    <771bf>   DW_AT_GNU_locviews: 0x21994
 <2><771c3>: Abbrev Number: 20 (DW_TAG_variable)
    <771c4>   DW_AT_name        : (indirect string, offset: 0x16e15): orig_x
    <771c8>   DW_AT_decl_file   : 1
    <771c8>   DW_AT_decl_line   : 105
    <771c9>   DW_AT_decl_column : 14
    <771ca>   DW_AT_type        : <0x76691>
    <771ce>   DW_AT_location    : 0x219be (location list)
    <771d2>   DW_AT_GNU_locviews: 0x219ae
 <2><771d6>: Abbrev Number: 20 (DW_TAG_variable)
    <771d7>   DW_AT_name        : (indirect string, offset: 0x16e1c): orig_y
    <771db>   DW_AT_decl_file   : 1
    <771db>   DW_AT_decl_line   : 105
    <771dc>   DW_AT_decl_column : 22
    <771dd>   DW_AT_type        : <0x76691>
    <771e1>   DW_AT_location    : 0x21a13 (location list)
    <771e5>   DW_AT_GNU_locviews: 0x21a05
 <2><771e9>: Abbrev Number: 20 (DW_TAG_variable)
    <771ea>   DW_AT_name        : (indirect string, offset: 0x16df6): increment
    <771ee>   DW_AT_decl_file   : 1
    <771ee>   DW_AT_decl_line   : 105
    <771ef>   DW_AT_decl_column : 30
    <771f0>   DW_AT_type        : <0x76691>
    <771f4>   DW_AT_location    : 0x21a53 (location list)
    <771f8>   DW_AT_GNU_locviews: 0x21a51
 <2><771fc>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <771fd>   DW_AT_abstract_origin: <0x7783e>
    <77201>   DW_AT_entry_pc    : 0x459a4b
    <77209>   DW_AT_GNU_entry_view: 2
    <7720b>   DW_AT_ranges      : 0x17168
    <7720f>   DW_AT_call_file   : 1
    <7720f>   DW_AT_call_line   : 151
    <77210>   DW_AT_call_column : 4
    <77211>   DW_AT_sibling     : <0x77267>
 <3><77215>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77216>   DW_AT_abstract_origin: <0x7786e>
    <7721a>   DW_AT_location    : 0x21a63 (location list)
    <7721e>   DW_AT_GNU_locviews: 0x21a5d
 <3><77222>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77223>   DW_AT_abstract_origin: <0x77865>
    <77227>   DW_AT_location    : 0x21a8e (location list)
    <7722b>   DW_AT_GNU_locviews: 0x21a88
 <3><7722f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <77230>   DW_AT_abstract_origin: <0x7785c>
 <3><77234>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <77235>   DW_AT_abstract_origin: <0x77853>
 <3><77239>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7723a>   DW_AT_abstract_origin: <0x77848>
    <7723e>   DW_AT_location    : 0x21ab9 (location list)
    <77242>   DW_AT_GNU_locviews: 0x21ab3
 <3><77246>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <77247>   DW_AT_ranges      : 0x17168
 <4><7724b>: Abbrev Number: 6 (DW_TAG_variable)
    <7724c>   DW_AT_abstract_origin: <0x77877>
    <77250>   DW_AT_location    : 0x21adb (location list)
    <77254>   DW_AT_GNU_locviews: 0x21ad3
 <4><77258>: Abbrev Number: 6 (DW_TAG_variable)
    <77259>   DW_AT_abstract_origin: <0x77880>
    <7725d>   DW_AT_location    : 0x21b1c (location list)
    <77261>   DW_AT_GNU_locviews: 0x21b14
 <4><77265>: Abbrev Number: 0
 <3><77266>: Abbrev Number: 0
 <2><77267>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <77268>   DW_AT_abstract_origin: <0x7783e>
    <7726c>   DW_AT_entry_pc    : 0x459612
    <77274>   DW_AT_GNU_entry_view: 1
    <77276>   DW_AT_ranges      : 0x17187
    <7727a>   DW_AT_call_file   : 1
    <7727a>   DW_AT_call_line   : 175
    <7727b>   DW_AT_call_column : 4
    <7727c>   DW_AT_sibling     : <0x772d2>
 <3><77280>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77281>   DW_AT_abstract_origin: <0x7786e>
    <77285>   DW_AT_location    : 0x21b4b (location list)
    <77289>   DW_AT_GNU_locviews: 0x21b47
 <3><7728d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7728e>   DW_AT_abstract_origin: <0x77865>
    <77292>   DW_AT_location    : 0x21b68 (location list)
    <77296>   DW_AT_GNU_locviews: 0x21b64
 <3><7729a>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <7729b>   DW_AT_abstract_origin: <0x7785c>
 <3><7729f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <772a0>   DW_AT_abstract_origin: <0x77853>
 <3><772a4>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <772a5>   DW_AT_abstract_origin: <0x77848>
    <772a9>   DW_AT_location    : 0x21b87 (location list)
    <772ad>   DW_AT_GNU_locviews: 0x21b81
 <3><772b1>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <772b2>   DW_AT_ranges      : 0x17187
 <4><772b6>: Abbrev Number: 6 (DW_TAG_variable)
    <772b7>   DW_AT_abstract_origin: <0x77877>
    <772bb>   DW_AT_location    : 0x21ba9 (location list)
    <772bf>   DW_AT_GNU_locviews: 0x21ba1
 <4><772c3>: Abbrev Number: 6 (DW_TAG_variable)
    <772c4>   DW_AT_abstract_origin: <0x77880>
    <772c8>   DW_AT_location    : 0x21be6 (location list)
    <772cc>   DW_AT_GNU_locviews: 0x21be2
 <4><772d0>: Abbrev Number: 0
 <3><772d1>: Abbrev Number: 0
 <2><772d2>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <772d3>   DW_AT_abstract_origin: <0x7788a>
    <772d7>   DW_AT_entry_pc    : 0x45969f
    <772df>   DW_AT_GNU_entry_view: 2
    <772e1>   DW_AT_ranges      : 0x17192
    <772e5>   DW_AT_call_file   : 1
    <772e5>   DW_AT_call_line   : 189
    <772e6>   DW_AT_call_column : 3
    <772e7>   DW_AT_sibling     : <0x7756f>
 <3><772eb>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <772ec>   DW_AT_abstract_origin: <0x778e4>
    <772f0>   DW_AT_location    : 0x21bf9 (location list)
    <772f4>   DW_AT_GNU_locviews: 0x21bf5
 <3><772f8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <772f9>   DW_AT_abstract_origin: <0x778d9>
    <772fd>   DW_AT_location    : 0x21c16 (location list)
    <77301>   DW_AT_GNU_locviews: 0x21c12
 <3><77305>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77306>   DW_AT_abstract_origin: <0x778ce>
    <7730a>   DW_AT_location    : 0x21c33 (location list)
    <7730e>   DW_AT_GNU_locviews: 0x21c2f
 <3><77312>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77313>   DW_AT_abstract_origin: <0x778c3>
    <77317>   DW_AT_location    : 0x21c46 (location list)
    <7731b>   DW_AT_GNU_locviews: 0x21c42
 <3><7731f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <77320>   DW_AT_abstract_origin: <0x778ba>
 <3><77324>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <77325>   DW_AT_abstract_origin: <0x778b1>
 <3><77329>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7732a>   DW_AT_abstract_origin: <0x778a8>
    <7732e>   DW_AT_location    : 0x21c5b (location list)
    <77332>   DW_AT_GNU_locviews: 0x21c59
 <3><77336>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77337>   DW_AT_abstract_origin: <0x7789f>
    <7733b>   DW_AT_location    : 0x21c67 (location list)
    <7733f>   DW_AT_GNU_locviews: 0x21c65
 <3><77343>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77344>   DW_AT_abstract_origin: <0x77894>
    <77348>   DW_AT_location    : 0x21c75 (location list)
    <7734c>   DW_AT_GNU_locviews: 0x21c71
 <3><77350>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <77351>   DW_AT_ranges      : 0x17192
 <4><77355>: Abbrev Number: 6 (DW_TAG_variable)
    <77356>   DW_AT_abstract_origin: <0x778ef>
    <7735a>   DW_AT_location    : 0x21c88 (location list)
    <7735e>   DW_AT_GNU_locviews: 0x21c84
 <4><77362>: Abbrev Number: 6 (DW_TAG_variable)
    <77363>   DW_AT_abstract_origin: <0x778f8>
    <77367>   DW_AT_location    : 0x21ca1 (location list)
    <7736b>   DW_AT_GNU_locviews: 0x21c9b
 <4><7736f>: Abbrev Number: 6 (DW_TAG_variable)
    <77370>   DW_AT_abstract_origin: <0x77902>
    <77374>   DW_AT_location    : 0x21cc3 (location list)
    <77378>   DW_AT_GNU_locviews: 0x21cb7
 <4><7737c>: Abbrev Number: 6 (DW_TAG_variable)
    <7737d>   DW_AT_abstract_origin: <0x7790c>
    <77381>   DW_AT_location    : 0x21d02 (location list)
    <77385>   DW_AT_GNU_locviews: 0x21cf8
 <4><77389>: Abbrev Number: 6 (DW_TAG_variable)
    <7738a>   DW_AT_abstract_origin: <0x77916>
    <7738e>   DW_AT_location    : 0x21d30 (location list)
    <77392>   DW_AT_GNU_locviews: 0x21d26
 <4><77396>: Abbrev Number: 6 (DW_TAG_variable)
    <77397>   DW_AT_abstract_origin: <0x77920>
    <7739b>   DW_AT_location    : 0x21d60 (location list)
    <7739f>   DW_AT_GNU_locviews: 0x21d5c
 <4><773a3>: Abbrev Number: 6 (DW_TAG_variable)
    <773a4>   DW_AT_abstract_origin: <0x7792a>
    <773a8>   DW_AT_location    : 0x21d75 (location list)
    <773ac>   DW_AT_GNU_locviews: 0x21d71
 <4><773b0>: Abbrev Number: 55 (DW_TAG_variable)
    <773b1>   DW_AT_abstract_origin: <0x77934>
 <4><773b5>: Abbrev Number: 6 (DW_TAG_variable)
    <773b6>   DW_AT_abstract_origin: <0x7793e>
    <773ba>   DW_AT_location    : 0x21d8a (location list)
    <773be>   DW_AT_GNU_locviews: 0x21d86
 <4><773c2>: Abbrev Number: 6 (DW_TAG_variable)
    <773c3>   DW_AT_abstract_origin: <0x77948>
    <773c7>   DW_AT_location    : 0x21da2 (location list)
    <773cb>   DW_AT_GNU_locviews: 0x21da0
 <4><773cf>: Abbrev Number: 6 (DW_TAG_variable)
    <773d0>   DW_AT_abstract_origin: <0x77951>
    <773d4>   DW_AT_location    : 0x21db2 (location list)
    <773d8>   DW_AT_GNU_locviews: 0x21daa
 <4><773dc>: Abbrev Number: 6 (DW_TAG_variable)
    <773dd>   DW_AT_abstract_origin: <0x7795b>
    <773e1>   DW_AT_location    : 0x21ddb (location list)
    <773e5>   DW_AT_GNU_locviews: 0x21dd3
 <4><773e9>: Abbrev Number: 56 (DW_TAG_variable)
    <773ea>   DW_AT_abstract_origin: <0x77965>
    <773ee>   DW_AT_type        : <0x77a74>
    <773f2>   DW_AT_location    : 0x21e11 (location list)
    <773f6>   DW_AT_GNU_locviews: 0x21dfd
 <4><773fa>: Abbrev Number: 29 (DW_TAG_call_site)
    <773fb>   DW_AT_call_return_pc: 0x4596ec
    <77403>   DW_AT_sibling     : <0x77413>
 <5><77407>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77408>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7740a>   DW_AT_call_value  : 2 byte block: 77 0 	(DW_OP_breg7 (rsp): 0)
 <5><7740d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7740e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77410>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><77412>: Abbrev Number: 0
 <4><77413>: Abbrev Number: 5 (DW_TAG_call_site)
    <77414>   DW_AT_call_return_pc: 0x459730
    <7741c>   DW_AT_call_origin : <0x77981>
    <77420>   DW_AT_sibling     : <0x7744f>
 <5><77424>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77425>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77427>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><7742a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7742b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7742d>   DW_AT_call_value  : 5 byte block: 91 84 7f 94 4 	(DW_OP_fbreg: -124; DW_OP_deref_size: 4)
 <5><77433>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77434>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77436>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><77439>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7743a>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7743c>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><7743f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77440>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <77442>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><77448>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77449>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7744b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><7744e>: Abbrev Number: 0
 <4><7744f>: Abbrev Number: 5 (DW_TAG_call_site)
    <77450>   DW_AT_call_return_pc: 0x4597ed
    <77458>   DW_AT_call_origin : <0x77981>
    <7745c>   DW_AT_sibling     : <0x7748b>
 <5><77460>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77461>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77463>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><77466>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77467>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77469>   DW_AT_call_value  : 5 byte block: 91 84 7f 94 4 	(DW_OP_fbreg: -124; DW_OP_deref_size: 4)
 <5><7746f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77470>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77472>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><77475>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77476>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <77478>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><7747b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7747c>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <7747e>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><77484>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77485>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <77487>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><7748a>: Abbrev Number: 0
 <4><7748b>: Abbrev Number: 5 (DW_TAG_call_site)
    <7748c>   DW_AT_call_return_pc: 0x45980b
    <77494>   DW_AT_call_origin : <0x77981>
    <77498>   DW_AT_sibling     : <0x774c7>
 <5><7749c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7749d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7749f>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><774a2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774a3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <774a5>   DW_AT_call_value  : 5 byte block: 91 80 7f 94 4 	(DW_OP_fbreg: -128; DW_OP_deref_size: 4)
 <5><774ab>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774ac>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <774ae>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><774b1>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774b2>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <774b4>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><774b7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774b8>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <774ba>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><774c0>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774c1>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <774c3>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><774c6>: Abbrev Number: 0
 <4><774c7>: Abbrev Number: 5 (DW_TAG_call_site)
    <774c8>   DW_AT_call_return_pc: 0x459850
    <774d0>   DW_AT_call_origin : <0x77981>
    <774d4>   DW_AT_sibling     : <0x77503>
 <5><774d8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774d9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <774db>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><774de>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774df>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <774e1>   DW_AT_call_value  : 5 byte block: 91 84 7f 94 4 	(DW_OP_fbreg: -124; DW_OP_deref_size: 4)
 <5><774e7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774e8>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <774ea>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><774ed>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774ee>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <774f0>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><774f3>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774f4>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <774f6>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><774fc>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <774fd>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <774ff>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><77502>: Abbrev Number: 0
 <4><77503>: Abbrev Number: 5 (DW_TAG_call_site)
    <77504>   DW_AT_call_return_pc: 0x45986e
    <7750c>   DW_AT_call_origin : <0x77981>
    <77510>   DW_AT_sibling     : <0x7753f>
 <5><77514>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77515>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77517>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><7751a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7751b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7751d>   DW_AT_call_value  : 5 byte block: 91 80 7f 94 4 	(DW_OP_fbreg: -128; DW_OP_deref_size: 4)
 <5><77523>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77524>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77526>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><77529>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7752a>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7752c>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><7752f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77530>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <77532>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><77538>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77539>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7753b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><7753e>: Abbrev Number: 0
 <4><7753f>: Abbrev Number: 57 (DW_TAG_call_site)
    <77540>   DW_AT_call_return_pc: 0x459b76
    <77548>   DW_AT_call_origin : <0x77981>
 <5><7754c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7754d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7754f>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><77552>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77553>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77555>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <5><77558>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77559>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7755b>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><7755e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7755f>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <77561>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <5><77567>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77568>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7756a>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><7756c>: Abbrev Number: 0
 <4><7756d>: Abbrev Number: 0
 <3><7756e>: Abbrev Number: 0
 <2><7756f>: Abbrev Number: 58 (DW_TAG_variable)
    <77570>   DW_AT_artificial  : 1
    <77570>   DW_AT_type        : <0x766ce>
    <77574>   DW_AT_location    : 0x21e6e (location list)
    <77578>   DW_AT_GNU_locviews: 0x21e6c
 <2><7757c>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <7757d>   DW_AT_abstract_origin: <0x7783e>
    <77581>   DW_AT_entry_pc    : 0x459924
    <77589>   DW_AT_GNU_entry_view: 2
    <7758b>   DW_AT_ranges      : 0x171b6
    <7758f>   DW_AT_call_file   : 1
    <7758f>   DW_AT_call_line   : 158
    <77590>   DW_AT_call_column : 4
    <77591>   DW_AT_sibling     : <0x775e7>
 <3><77595>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <77596>   DW_AT_abstract_origin: <0x7786e>
    <7759a>   DW_AT_location    : 0x21e7e (location list)
    <7759e>   DW_AT_GNU_locviews: 0x21e78
 <3><775a2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <775a3>   DW_AT_abstract_origin: <0x77865>
    <775a7>   DW_AT_location    : 0x21ea9 (location list)
    <775ab>   DW_AT_GNU_locviews: 0x21ea3
 <3><775af>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <775b0>   DW_AT_abstract_origin: <0x7785c>
 <3><775b4>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <775b5>   DW_AT_abstract_origin: <0x77853>
 <3><775b9>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <775ba>   DW_AT_abstract_origin: <0x77848>
    <775be>   DW_AT_location    : 0x21ed4 (location list)
    <775c2>   DW_AT_GNU_locviews: 0x21ece
 <3><775c6>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <775c7>   DW_AT_ranges      : 0x171b6
 <4><775cb>: Abbrev Number: 6 (DW_TAG_variable)
    <775cc>   DW_AT_abstract_origin: <0x77877>
    <775d0>   DW_AT_location    : 0x21ef6 (location list)
    <775d4>   DW_AT_GNU_locviews: 0x21eee
 <4><775d8>: Abbrev Number: 6 (DW_TAG_variable)
    <775d9>   DW_AT_abstract_origin: <0x77880>
    <775dd>   DW_AT_location    : 0x21f37 (location list)
    <775e1>   DW_AT_GNU_locviews: 0x21f2f
 <4><775e5>: Abbrev Number: 0
 <3><775e6>: Abbrev Number: 0
 <2><775e7>: Abbrev Number: 30 (DW_TAG_call_site)
    <775e8>   DW_AT_call_return_pc: 0x459259
    <775f0>   DW_AT_call_origin : <0x77030>
 <2><775f4>: Abbrev Number: 5 (DW_TAG_call_site)
    <775f5>   DW_AT_call_return_pc: 0x459281
    <775fd>   DW_AT_call_origin : <0x77019>
    <77601>   DW_AT_sibling     : <0x77612>
 <3><77605>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77606>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77608>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><7760b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7760c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7760e>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><77611>: Abbrev Number: 0
 <2><77612>: Abbrev Number: 5 (DW_TAG_call_site)
    <77613>   DW_AT_call_return_pc: 0x4592c5
    <7761b>   DW_AT_call_origin : <0x76fe6>
    <7761f>   DW_AT_sibling     : <0x7762a>
 <3><77623>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77624>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77626>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><77629>: Abbrev Number: 0
 <2><7762a>: Abbrev Number: 5 (DW_TAG_call_site)
    <7762b>   DW_AT_call_return_pc: 0x4592dd
    <77633>   DW_AT_call_origin : <0x76fb6>
    <77637>   DW_AT_sibling     : <0x77660>
 <3><7763b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7763c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7763e>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><77641>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77642>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77644>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><77647>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77648>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7764a>   DW_AT_call_value  : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><7764e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7764f>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <77651>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><77655>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77656>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <77658>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><7765a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7765b>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7765d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><7765f>: Abbrev Number: 0
 <2><77660>: Abbrev Number: 5 (DW_TAG_call_site)
    <77661>   DW_AT_call_return_pc: 0x4592f7
    <77669>   DW_AT_call_origin : <0x76f8b>
    <7766d>   DW_AT_sibling     : <0x77686>
 <3><77671>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77672>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77674>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><77677>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77678>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7767a>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><7767e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7767f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77681>   DW_AT_call_value  : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <3><77685>: Abbrev Number: 0
 <2><77686>: Abbrev Number: 5 (DW_TAG_call_site)
    <77687>   DW_AT_call_return_pc: 0x459448
    <7768f>   DW_AT_call_origin : <0x76f1b>
    <77693>   DW_AT_sibling     : <0x776a2>
 <3><77697>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77698>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7769a>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><7769c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7769d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7769f>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><776a1>: Abbrev Number: 0
 <2><776a2>: Abbrev Number: 30 (DW_TAG_call_site)
    <776a3>   DW_AT_call_return_pc: 0x4594f6
    <776ab>   DW_AT_call_origin : <0x76f32>
 <2><776af>: Abbrev Number: 29 (DW_TAG_call_site)
    <776b0>   DW_AT_call_return_pc: 0x4595c7
    <776b8>   DW_AT_sibling     : <0x776d2>
 <3><776bc>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <776bd>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <776bf>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><776c2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <776c3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <776c5>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><776c8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <776c9>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <776cb>   DW_AT_call_value  : 5 byte block: 91 ec 7e 94 4 	(DW_OP_fbreg: -148; DW_OP_deref_size: 4)
 <3><776d1>: Abbrev Number: 0
 <2><776d2>: Abbrev Number: 5 (DW_TAG_call_site)
    <776d3>   DW_AT_call_return_pc: 0x45962a
    <776db>   DW_AT_call_origin : <0x77a87>
    <776df>   DW_AT_sibling     : <0x776f0>
 <3><776e3>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <776e4>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <776e6>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><776e9>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <776ea>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <776ec>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><776ef>: Abbrev Number: 0
 <2><776f0>: Abbrev Number: 30 (DW_TAG_call_site)
    <776f1>   DW_AT_call_return_pc: 0x45969f
    <776f9>   DW_AT_call_origin : <0x76f32>
 <2><776fd>: Abbrev Number: 5 (DW_TAG_call_site)
    <776fe>   DW_AT_call_return_pc: 0x4598b8
    <77706>   DW_AT_call_origin : <0x76ffd>
    <7770a>   DW_AT_sibling     : <0x77718>
 <3><7770e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7770f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77711>   DW_AT_call_value  : 5 byte block: 91 80 7f 94 4 	(DW_OP_fbreg: -128; DW_OP_deref_size: 4)
 <3><77717>: Abbrev Number: 0
 <2><77718>: Abbrev Number: 29 (DW_TAG_call_site)
    <77719>   DW_AT_call_return_pc: 0x45990a
    <77721>   DW_AT_sibling     : <0x7772b>
 <3><77725>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77726>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77728>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><7772a>: Abbrev Number: 0
 <2><7772b>: Abbrev Number: 5 (DW_TAG_call_site)
    <7772c>   DW_AT_call_return_pc: 0x45993c
    <77734>   DW_AT_call_origin : <0x77a87>
    <77738>   DW_AT_sibling     : <0x77749>
 <3><7773c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7773d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7773f>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><77742>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77743>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77745>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><77748>: Abbrev Number: 0
 <2><77749>: Abbrev Number: 5 (DW_TAG_call_site)
    <7774a>   DW_AT_call_return_pc: 0x459a15
    <77752>   DW_AT_call_origin : <0x76f51>
    <77756>   DW_AT_sibling     : <0x77790>
 <3><7775a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7775b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7775d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><77760>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77761>   DW_AT_location    : 1 byte block: 61 	(DW_OP_reg17 (xmm0))
    <77763>   DW_AT_call_value  : 6 byte block: 91 e0 7e a6 4 2e 	(DW_OP_fbreg: -160; DW_OP_deref_type: 4 <0x76691>)
 <3><7776a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7776b>   DW_AT_location    : 1 byte block: 62 	(DW_OP_reg18 (xmm1))
    <7776d>   DW_AT_call_value  : 6 byte block: 91 d8 7e a6 4 2e 	(DW_OP_fbreg: -168; DW_OP_deref_type: 4 <0x76691>)
 <3><77774>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77775>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77777>   DW_AT_call_value  : 5 byte block: 91 80 7f 94 4 	(DW_OP_fbreg: -128; DW_OP_deref_size: 4)
 <3><7777d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7777e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77780>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><77782>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77783>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <77785>   DW_AT_call_value  : 3 byte block: a ff ff 	(DW_OP_const2u: 65535)
 <3><77789>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7778a>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <7778c>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><7778f>: Abbrev Number: 0
 <2><77790>: Abbrev Number: 5 (DW_TAG_call_site)
    <77791>   DW_AT_call_return_pc: 0x459a59
    <77799>   DW_AT_call_origin : <0x77a87>
    <7779d>   DW_AT_sibling     : <0x777ae>
 <3><777a1>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777a2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <777a4>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><777a7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777a8>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <777aa>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><777ad>: Abbrev Number: 0
 <2><777ae>: Abbrev Number: 5 (DW_TAG_call_site)
    <777af>   DW_AT_call_return_pc: 0x459b40
    <777b7>   DW_AT_call_origin : <0x76f51>
    <777bb>   DW_AT_sibling     : <0x777f8>
 <3><777bf>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777c0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <777c2>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><777c5>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777c6>   DW_AT_location    : 1 byte block: 61 	(DW_OP_reg17 (xmm0))
    <777c8>   DW_AT_call_value  : 6 byte block: 91 e0 7e a6 4 2e 	(DW_OP_fbreg: -160; DW_OP_deref_type: 4 <0x76691>)
 <3><777cf>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777d0>   DW_AT_location    : 1 byte block: 62 	(DW_OP_reg18 (xmm1))
    <777d2>   DW_AT_call_value  : 6 byte block: 91 d8 7e a6 4 2e 	(DW_OP_fbreg: -168; DW_OP_deref_type: 4 <0x76691>)
 <3><777d9>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777da>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <777dc>   DW_AT_call_value  : 5 byte block: 91 80 7f 94 4 	(DW_OP_fbreg: -128; DW_OP_deref_size: 4)
 <3><777e2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777e3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <777e5>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><777e7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777e8>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <777ea>   DW_AT_call_value  : 3 byte block: a ff ff 	(DW_OP_const2u: 65535)
 <3><777ee>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <777ef>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <777f1>   DW_AT_call_value  : 5 byte block: 73 0 9 f8 1a 	(DW_OP_breg3 (rbx): 0; DW_OP_const1s: -8; DW_OP_and)
 <3><777f7>: Abbrev Number: 0
 <2><777f8>: Abbrev Number: 5 (DW_TAG_call_site)
    <777f9>   DW_AT_call_return_pc: 0x459c12
    <77801>   DW_AT_call_origin : <0x76f3b>
    <77805>   DW_AT_sibling     : <0x77814>
 <3><77809>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <7780a>   DW_AT_location    : 1 byte block: 61 	(DW_OP_reg17 (xmm0))
    <7780c>   DW_AT_call_value  : 6 byte block: 91 f8 7e a6 8 35 	(DW_OP_fbreg: -136; DW_OP_deref_type: 8 <0x76698>)
 <3><77813>: Abbrev Number: 0
 <2><77814>: Abbrev Number: 5 (DW_TAG_call_site)
    <77815>   DW_AT_call_return_pc: 0x459c42
    <7781d>   DW_AT_call_origin : <0x76f3b>
    <77821>   DW_AT_sibling     : <0x77830>
 <3><77825>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77826>   DW_AT_location    : 1 byte block: 61 	(DW_OP_reg17 (xmm0))
    <77828>   DW_AT_call_value  : 6 byte block: 91 f0 7e a6 8 35 	(DW_OP_fbreg: -144; DW_OP_deref_type: 8 <0x76698>)
 <3><7782f>: Abbrev Number: 0
 <2><77830>: Abbrev Number: 30 (DW_TAG_call_site)
    <77831>   DW_AT_call_return_pc: 0x459c5b
    <77839>   DW_AT_call_origin : <0x77a92>
 <2><7783d>: Abbrev Number: 0
 <1><7783e>: Abbrev Number: 42 (DW_TAG_subprogram)
    <7783f>   DW_AT_name        : (indirect string, offset: 0x16dcf): get_arc_point
    <77843>   DW_AT_decl_file   : 1
    <77843>   DW_AT_decl_line   : 90
    <77844>   DW_AT_decl_column : 13
    <77844>   DW_AT_prototyped  : 1
    <77844>   DW_AT_inline      : 1	(not inlined)
    <77844>   DW_AT_sibling     : <0x7788a>
 <2><77848>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <77849>   DW_AT_name        : (indirect string, offset: 0x16ddd): angle
    <7784d>   DW_AT_decl_file   : 1
    <7784d>   DW_AT_decl_line   : 90
    <7784e>   DW_AT_decl_column : 33
    <7784f>   DW_AT_type        : <0x76691>
 <2><77853>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <77854>   DW_AT_name        : a
    <77856>   DW_AT_decl_file   : 1
    <77856>   DW_AT_decl_line   : 90
    <77857>   DW_AT_decl_column : 46
    <77858>   DW_AT_type        : <0x76691>
 <2><7785c>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7785d>   DW_AT_name        : b
    <7785f>   DW_AT_decl_file   : 1
    <7785f>   DW_AT_decl_line   : 90
    <77860>   DW_AT_decl_column : 55
    <77861>   DW_AT_type        : <0x76691>
 <2><77865>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <77866>   DW_AT_name        : x
    <77868>   DW_AT_decl_file   : 1
    <77868>   DW_AT_decl_line   : 90
    <77869>   DW_AT_decl_column : 63
    <7786a>   DW_AT_type        : <0x76804>
 <2><7786e>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7786f>   DW_AT_name        : y
    <77871>   DW_AT_decl_file   : 1
    <77871>   DW_AT_decl_line   : 90
    <77872>   DW_AT_decl_column : 71
    <77873>   DW_AT_type        : <0x76804>
 <2><77877>: Abbrev Number: 8 (DW_TAG_variable)
    <77878>   DW_AT_name        : c
    <7787a>   DW_AT_decl_file   : 1
    <7787a>   DW_AT_decl_line   : 92
    <7787b>   DW_AT_decl_column : 8
    <7787c>   DW_AT_type        : <0x76691>
 <2><77880>: Abbrev Number: 8 (DW_TAG_variable)
    <77881>   DW_AT_name        : s
    <77883>   DW_AT_decl_file   : 1
    <77883>   DW_AT_decl_line   : 92
    <77884>   DW_AT_decl_column : 11
    <77885>   DW_AT_type        : <0x76691>
 <2><77889>: Abbrev Number: 0
 <1><7788a>: Abbrev Number: 42 (DW_TAG_subprogram)
    <7788b>   DW_AT_name        : (indirect string, offset: 0x16dc2): draw_ellipse
    <7788f>   DW_AT_decl_file   : 1
    <7788f>   DW_AT_decl_line   : 26
    <77890>   DW_AT_decl_column : 13
    <77890>   DW_AT_prototyped  : 1
    <77890>   DW_AT_inline      : 1	(not inlined)
    <77890>   DW_AT_sibling     : <0x77972>
 <2><77894>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <77895>   DW_AT_name        : ctx
    <77899>   DW_AT_decl_file   : 1
    <77899>   DW_AT_decl_line   : 28
    <7789a>   DW_AT_decl_column : 14
    <7789b>   DW_AT_type        : <0x76fb1>
 <2><7789f>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <778a0>   DW_AT_name        : x
    <778a2>   DW_AT_decl_file   : 1
    <778a2>   DW_AT_decl_line   : 29
    <778a3>   DW_AT_decl_column : 7
    <778a4>   DW_AT_type        : <0x7669f>
 <2><778a8>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <778a9>   DW_AT_name        : y
    <778ab>   DW_AT_decl_file   : 1
    <778ab>   DW_AT_decl_line   : 30
    <778ac>   DW_AT_decl_column : 7
    <778ad>   DW_AT_type        : <0x7669f>
 <2><778b1>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <778b2>   DW_AT_name        : a
    <778b4>   DW_AT_decl_file   : 1
    <778b4>   DW_AT_decl_line   : 31
    <778b5>   DW_AT_decl_column : 9
    <778b6>   DW_AT_type        : <0x76691>
 <2><778ba>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <778bb>   DW_AT_name        : b
    <778bd>   DW_AT_decl_file   : 1
    <778bd>   DW_AT_decl_line   : 32
    <778be>   DW_AT_decl_column : 9
    <778bf>   DW_AT_type        : <0x76691>
 <2><778c3>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <778c4>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <778c8>   DW_AT_decl_file   : 1
    <778c8>   DW_AT_decl_line   : 33
    <778c9>   DW_AT_decl_column : 16
    <778ca>   DW_AT_type        : <0x766c0>
 <2><778ce>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <778cf>   DW_AT_name        : (indirect string, offset: 0x1affd): fill
    <778d3>   DW_AT_decl_file   : 1
    <778d3>   DW_AT_decl_line   : 34
    <778d4>   DW_AT_decl_column : 7
    <778d5>   DW_AT_type        : <0x7669f>
 <2><778d9>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <778da>   DW_AT_name        : top
    <778de>   DW_AT_decl_file   : 1
    <778de>   DW_AT_decl_line   : 35
    <778df>   DW_AT_decl_column : 8
    <778e0>   DW_AT_type        : <0x76804>
 <2><778e4>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <778e5>   DW_AT_name        : (indirect string, offset: 0x1aa62): bottom
    <778e9>   DW_AT_decl_file   : 1
    <778e9>   DW_AT_decl_line   : 36
    <778ea>   DW_AT_decl_column : 8
    <778eb>   DW_AT_type        : <0x76804>
 <2><778ef>: Abbrev Number: 8 (DW_TAG_variable)
    <778f0>   DW_AT_name        : d
    <778f2>   DW_AT_decl_file   : 1
    <778f2>   DW_AT_decl_line   : 39
    <778f3>   DW_AT_decl_column : 6
    <778f4>   DW_AT_type        : <0x7669f>
 <2><778f8>: Abbrev Number: 8 (DW_TAG_variable)
    <778f9>   DW_AT_name        : x1
    <778fc>   DW_AT_decl_file   : 1
    <778fc>   DW_AT_decl_line   : 39
    <778fd>   DW_AT_decl_column : 9
    <778fe>   DW_AT_type        : <0x7669f>
 <2><77902>: Abbrev Number: 8 (DW_TAG_variable)
    <77903>   DW_AT_name        : y1
    <77906>   DW_AT_decl_file   : 1
    <77906>   DW_AT_decl_line   : 39
    <77907>   DW_AT_decl_column : 13
    <77908>   DW_AT_type        : <0x7669f>
 <2><7790c>: Abbrev Number: 8 (DW_TAG_variable)
    <7790d>   DW_AT_name        : x2
    <77910>   DW_AT_decl_file   : 1
    <77910>   DW_AT_decl_line   : 39
    <77911>   DW_AT_decl_column : 17
    <77912>   DW_AT_type        : <0x7669f>
 <2><77916>: Abbrev Number: 8 (DW_TAG_variable)
    <77917>   DW_AT_name        : y2
    <7791a>   DW_AT_decl_file   : 1
    <7791a>   DW_AT_decl_line   : 39
    <7791b>   DW_AT_decl_column : 21
    <7791c>   DW_AT_type        : <0x7669f>
 <2><77920>: Abbrev Number: 8 (DW_TAG_variable)
    <77921>   DW_AT_name        : dx
    <77924>   DW_AT_decl_file   : 1
    <77924>   DW_AT_decl_line   : 40
    <77925>   DW_AT_decl_column : 12
    <77926>   DW_AT_type        : <0x76712>
 <2><7792a>: Abbrev Number: 8 (DW_TAG_variable)
    <7792b>   DW_AT_name        : dy
    <7792e>   DW_AT_decl_file   : 1
    <7792e>   DW_AT_decl_line   : 40
    <7792f>   DW_AT_decl_column : 16
    <77930>   DW_AT_type        : <0x76712>
 <2><77934>: Abbrev Number: 8 (DW_TAG_variable)
    <77935>   DW_AT_name        : aq
    <77938>   DW_AT_decl_file   : 1
    <77938>   DW_AT_decl_line   : 40
    <77939>   DW_AT_decl_column : 20
    <7793a>   DW_AT_type        : <0x76712>
 <2><7793e>: Abbrev Number: 8 (DW_TAG_variable)
    <7793f>   DW_AT_name        : bq
    <77942>   DW_AT_decl_file   : 1
    <77942>   DW_AT_decl_line   : 40
    <77943>   DW_AT_decl_column : 24
    <77944>   DW_AT_type        : <0x76712>
 <2><77948>: Abbrev Number: 8 (DW_TAG_variable)
    <77949>   DW_AT_name        : r
    <7794b>   DW_AT_decl_file   : 1
    <7794b>   DW_AT_decl_line   : 40
    <7794c>   DW_AT_decl_column : 28
    <7794d>   DW_AT_type        : <0x76712>
 <2><77951>: Abbrev Number: 8 (DW_TAG_variable)
    <77952>   DW_AT_name        : rx
    <77955>   DW_AT_decl_file   : 1
    <77955>   DW_AT_decl_line   : 40
    <77956>   DW_AT_decl_column : 31
    <77957>   DW_AT_type        : <0x76712>
 <2><7795b>: Abbrev Number: 8 (DW_TAG_variable)
    <7795c>   DW_AT_name        : ry
    <7795f>   DW_AT_decl_file   : 1
    <7795f>   DW_AT_decl_line   : 40
    <77960>   DW_AT_decl_column : 35
    <77961>   DW_AT_type        : <0x76712>
 <2><77965>: Abbrev Number: 59 (DW_TAG_variable)
    <77966>   DW_AT_name        : (indirect string, offset: 0x16e00): filled
    <7796a>   DW_AT_decl_file   : 1
    <7796b>   DW_AT_decl_line   : 41
    <7796c>   DW_AT_decl_column : 7
    <7796d>   DW_AT_type        : <0x77972>
 <2><77971>: Abbrev Number: 0
 <1><77972>: Abbrev Number: 26 (DW_TAG_array_type)
    <77973>   DW_AT_type        : <0x766f2>
    <77977>   DW_AT_sibling     : <0x77981>
 <2><7797b>: Abbrev Number: 60 (DW_TAG_subrange_type)
    <7797c>   DW_AT_type        : <0x766c7>
 <2><77980>: Abbrev Number: 0
 <1><77981>: Abbrev Number: 61 (DW_TAG_subprogram)
    <77982>   DW_AT_name        : (indirect string, offset: 0x16e07): draw_scanline
    <77986>   DW_AT_decl_file   : 1
    <77987>   DW_AT_decl_line   : 6
    <77988>   DW_AT_decl_column : 13
    <77989>   DW_AT_prototyped  : 1
    <77989>   DW_AT_low_pc      : 0x4590f0
    <77991>   DW_AT_high_pc     : 0xff
    <77999>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7799b>   DW_AT_call_all_calls: 1
    <7799b>   DW_AT_sibling     : <0x77a74>
 <2><7799f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <779a0>   DW_AT_name        : ctx
    <779a4>   DW_AT_decl_file   : 1
    <779a4>   DW_AT_decl_line   : 6
    <779a5>   DW_AT_decl_column : 38
    <779a6>   DW_AT_type        : <0x76fb1>
    <779aa>   DW_AT_location    : 0x21f6c (location list)
    <779ae>   DW_AT_GNU_locviews: 0x21f62
 <2><779b2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <779b3>   DW_AT_name        : y
    <779b5>   DW_AT_decl_file   : 1
    <779b5>   DW_AT_decl_line   : 6
    <779b6>   DW_AT_decl_column : 47
    <779b7>   DW_AT_type        : <0x7669f>
    <779bb>   DW_AT_location    : 0x21f9c (location list)
    <779bf>   DW_AT_GNU_locviews: 0x21f96
 <2><779c3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <779c4>   DW_AT_name        : x1
    <779c7>   DW_AT_decl_file   : 1
    <779c7>   DW_AT_decl_line   : 6
    <779c8>   DW_AT_decl_column : 54
    <779c9>   DW_AT_type        : <0x7669f>
    <779cd>   DW_AT_location    : 0x21fbe (location list)
    <779d1>   DW_AT_GNU_locviews: 0x21fb2
 <2><779d5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <779d6>   DW_AT_name        : x2
    <779d9>   DW_AT_decl_file   : 1
    <779d9>   DW_AT_decl_line   : 6
    <779da>   DW_AT_decl_column : 62
    <779db>   DW_AT_type        : <0x7669f>
    <779df>   DW_AT_location    : 0x22037 (location list)
    <779e3>   DW_AT_GNU_locviews: 0x22021
 <2><779e7>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <779e8>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <779ec>   DW_AT_decl_file   : 1
    <779ec>   DW_AT_decl_line   : 6
    <779ed>   DW_AT_decl_column : 79
    <779ee>   DW_AT_type        : <0x766c0>
    <779f2>   DW_AT_location    : 0x22109 (location list)
    <779f6>   DW_AT_GNU_locviews: 0x220ff
 <2><779fa>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <779fb>   DW_AT_name        : (indirect string, offset: 0x1affd): fill
    <779ff>   DW_AT_decl_file   : 1
    <779ff>   DW_AT_decl_line   : 6
    <77a00>   DW_AT_decl_column : 90
    <77a01>   DW_AT_type        : <0x7669f>
    <77a05>   DW_AT_location    : 0x2213b (location list)
    <77a09>   DW_AT_GNU_locviews: 0x22133
 <2><77a0d>: Abbrev Number: 62 (DW_TAG_formal_parameter)
    <77a0e>   DW_AT_name        : (indirect string, offset: 0x16e00): filled
    <77a12>   DW_AT_decl_file   : 1
    <77a13>   DW_AT_decl_line   : 6
    <77a14>   DW_AT_decl_column : 102
    <77a15>   DW_AT_type        : <0x766ed>
    <77a19>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><77a1c>: Abbrev Number: 63 (DW_TAG_call_site)
    <77a1d>   DW_AT_call_return_pc: 0x45918e
    <77a25>   DW_AT_call_tail_call: 1
    <77a25>   DW_AT_sibling     : <0x77a31>
 <3><77a29>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a2a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77a2c>   DW_AT_call_value  : 3 byte block: a3 1 58 	(DW_OP_entry_value: (DW_OP_reg8 (r8)))
 <3><77a30>: Abbrev Number: 0
 <2><77a31>: Abbrev Number: 29 (DW_TAG_call_site)
    <77a32>   DW_AT_call_return_pc: 0x4591af
    <77a3a>   DW_AT_sibling     : <0x77a5b>
 <3><77a3e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a3f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <77a41>   DW_AT_call_value  : 3 byte block: 91 50 6 	(DW_OP_fbreg: -48; DW_OP_deref)
 <3><77a45>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a46>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77a48>   DW_AT_call_value  : 3 byte block: a3 1 51 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)))
 <3><77a4c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a4d>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77a4f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><77a52>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a53>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <77a55>   DW_AT_call_value  : 4 byte block: 91 5c 94 4 	(DW_OP_fbreg: -36; DW_OP_deref_size: 4)
 <3><77a5a>: Abbrev Number: 0
 <2><77a5b>: Abbrev Number: 64 (DW_TAG_call_site)
    <77a5c>   DW_AT_call_return_pc: 0x4591ef
    <77a64>   DW_AT_call_tail_call: 1
 <3><77a64>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a65>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <77a67>   DW_AT_call_value  : 3 byte block: a3 1 52 	(DW_OP_entry_value: (DW_OP_reg2 (rcx)))
 <3><77a6b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <77a6c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <77a6e>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><77a72>: Abbrev Number: 0
 <2><77a73>: Abbrev Number: 0
 <1><77a74>: Abbrev Number: 26 (DW_TAG_array_type)
    <77a75>   DW_AT_type        : <0x766f2>
    <77a79>   DW_AT_sibling     : <0x77a87>
 <2><77a7d>: Abbrev Number: 65 (DW_TAG_subrange_type)
    <77a7e>   DW_AT_type        : <0x766c7>
    <77a82>   DW_AT_upper_bound : <0x7756f>
 <2><77a86>: Abbrev Number: 0
 <1><77a87>: Abbrev Number: 66 (DW_TAG_subprogram)
    <77a88>   DW_AT_external    : 1
    <77a88>   DW_AT_declaration : 1
    <77a88>   DW_AT_linkage_name: (indirect string, offset: 0x16dbb): sincos
    <77a8c>   DW_AT_name        : (indirect string, offset: 0x16db1): __builtin_sincos
    <77a90>   DW_AT_decl_file   : 8
    <77a91>   DW_AT_decl_line   : 0
 <1><77a92>: Abbrev Number: 67 (DW_TAG_subprogram)
    <77a93>   DW_AT_external    : 1
    <77a93>   DW_AT_declaration : 1
    <77a93>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <77a97>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><77a9b>: Abbrev Number: 0
  Compilation Unit @ offset 0x77a9c:
   Length:        0x1ec2 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x122c
   Pointer Size:  8
 <0><77aa8>: Abbrev Number: 44 (DW_TAG_compile_unit)
