    <ab5c7>   DW_AT_sibling     : <0xab682>
 <2><ab5cb>: Abbrev Number: 2 (DW_TAG_member)
    <ab5cc>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <ab5d0>   DW_AT_decl_file   : 7
    <ab5d1>   DW_AT_decl_line   : 81
    <ab5d2>   DW_AT_decl_column : 25
    <ab5d3>   DW_AT_type        : <0xab3f6>
    <ab5d7>   DW_AT_data_member_location: 0
 <2><ab5d8>: Abbrev Number: 2 (DW_TAG_member)
    <ab5d9>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <ab5dd>   DW_AT_decl_file   : 7
    <ab5de>   DW_AT_decl_line   : 82
    <ab5df>   DW_AT_decl_column : 25
    <ab5e0>   DW_AT_type        : <0xab416>
    <ab5e4>   DW_AT_data_member_location: 8
 <2><ab5e5>: Abbrev Number: 2 (DW_TAG_member)
    <ab5e6>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <ab5ea>   DW_AT_decl_file   : 7
    <ab5eb>   DW_AT_decl_line   : 83
    <ab5ec>   DW_AT_decl_column : 25
    <ab5ed>   DW_AT_type        : <0xab422>
    <ab5f1>   DW_AT_data_member_location: 16
 <2><ab5f2>: Abbrev Number: 2 (DW_TAG_member)
    <ab5f3>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <ab5f7>   DW_AT_decl_file   : 7
    <ab5f8>   DW_AT_decl_line   : 84
    <ab5f9>   DW_AT_decl_column : 25
    <ab5fa>   DW_AT_type        : <0xab44c>
    <ab5fe>   DW_AT_data_member_location: 24
 <2><ab5ff>: Abbrev Number: 2 (DW_TAG_member)
    <ab600>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <ab604>   DW_AT_decl_file   : 7
    <ab605>   DW_AT_decl_line   : 85
    <ab606>   DW_AT_decl_column : 25
    <ab607>   DW_AT_type        : <0xab476>
    <ab60b>   DW_AT_data_member_location: 32
 <2><ab60c>: Abbrev Number: 2 (DW_TAG_member)
    <ab60d>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <ab611>   DW_AT_decl_file   : 7
    <ab612>   DW_AT_decl_line   : 86
    <ab613>   DW_AT_decl_column : 25
    <ab614>   DW_AT_type        : <0xab4a5>
    <ab618>   DW_AT_data_member_location: 40
 <2><ab619>: Abbrev Number: 2 (DW_TAG_member)
    <ab61a>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <ab61e>   DW_AT_decl_file   : 7
    <ab61f>   DW_AT_decl_line   : 87
    <ab620>   DW_AT_decl_column : 25
    <ab621>   DW_AT_type        : <0xab4cf>
    <ab625>   DW_AT_data_member_location: 48
 <2><ab626>: Abbrev Number: 2 (DW_TAG_member)
    <ab627>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <ab62b>   DW_AT_decl_file   : 7
    <ab62c>   DW_AT_decl_line   : 88
    <ab62d>   DW_AT_decl_column : 25
    <ab62e>   DW_AT_type        : <0xab4f9>
    <ab632>   DW_AT_data_member_location: 56
 <2><ab633>: Abbrev Number: 2 (DW_TAG_member)
    <ab634>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <ab638>   DW_AT_decl_file   : 7
    <ab639>   DW_AT_decl_line   : 89
    <ab63a>   DW_AT_decl_column : 25
    <ab63b>   DW_AT_type        : <0xab528>
    <ab63f>   DW_AT_data_member_location: 64
 <2><ab640>: Abbrev Number: 2 (DW_TAG_member)
    <ab641>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <ab645>   DW_AT_decl_file   : 7
    <ab646>   DW_AT_decl_line   : 90
    <ab647>   DW_AT_decl_column : 25
    <ab648>   DW_AT_type        : <0xab552>
    <ab64c>   DW_AT_data_member_location: 72
 <2><ab64d>: Abbrev Number: 2 (DW_TAG_member)
    <ab64e>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <ab652>   DW_AT_decl_file   : 7
    <ab653>   DW_AT_decl_line   : 91
    <ab654>   DW_AT_decl_column : 25
    <ab655>   DW_AT_type        : <0xab55e>
    <ab659>   DW_AT_data_member_location: 80
 <2><ab65a>: Abbrev Number: 2 (DW_TAG_member)
    <ab65b>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <ab65f>   DW_AT_decl_file   : 7
    <ab660>   DW_AT_decl_line   : 92
    <ab661>   DW_AT_decl_column : 25
    <ab662>   DW_AT_type        : <0xab588>
    <ab666>   DW_AT_data_member_location: 88
 <2><ab667>: Abbrev Number: 2 (DW_TAG_member)
    <ab668>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <ab66c>   DW_AT_decl_file   : 7
    <ab66d>   DW_AT_decl_line   : 93
    <ab66e>   DW_AT_decl_column : 25
    <ab66f>   DW_AT_type        : <0xab308>
    <ab673>   DW_AT_data_member_location: 96
 <2><ab674>: Abbrev Number: 2 (DW_TAG_member)
    <ab675>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <ab679>   DW_AT_decl_file   : 7
    <ab67a>   DW_AT_decl_line   : 94
    <ab67b>   DW_AT_decl_column : 25
    <ab67c>   DW_AT_type        : <0xab5b2>
    <ab680>   DW_AT_data_member_location: 104
 <2><ab681>: Abbrev Number: 0
 <1><ab682>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab683>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <ab687>   DW_AT_decl_file   : 7
    <ab688>   DW_AT_decl_line   : 95
    <ab689>   DW_AT_decl_column : 3
    <ab68a>   DW_AT_type        : <0xab5be>
 <1><ab68e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab68f>   DW_AT_byte_size   : 8
    <ab68f>   DW_AT_type        : <0xab682>
 <1><ab693>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab694>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <ab698>   DW_AT_decl_file   : 7
    <ab699>   DW_AT_decl_line   : 117
    <ab69a>   DW_AT_decl_column : 3
    <ab69b>   DW_AT_type        : <0xab332>
 <1><ab69f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab6a0>   DW_AT_byte_size   : 8
    <ab6a0>   DW_AT_type        : <0xab693>
 <1><ab6a4>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ab6a5>   DW_AT_byte_size   : 8
    <ab6a6>   DW_AT_decl_file   : 8
    <ab6a6>   DW_AT_decl_line   : 4
    <ab6a7>   DW_AT_decl_column : 3
    <ab6a7>   DW_AT_sibling     : <0xab6c6>
 <2><ab6ab>: Abbrev Number: 2 (DW_TAG_member)
    <ab6ac>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <ab6b0>   DW_AT_decl_file   : 8
    <ab6b1>   DW_AT_decl_line   : 5
    <ab6b2>   DW_AT_decl_column : 8
    <ab6b3>   DW_AT_type        : <0xab1d8>
    <ab6b7>   DW_AT_data_member_location: 0
 <2><ab6b8>: Abbrev Number: 2 (DW_TAG_member)
    <ab6b9>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <ab6bd>   DW_AT_decl_file   : 8
    <ab6be>   DW_AT_decl_line   : 6
    <ab6bf>   DW_AT_decl_column : 8
    <ab6c0>   DW_AT_type        : <0xab1d8>
    <ab6c4>   DW_AT_data_member_location: 4
 <2><ab6c5>: Abbrev Number: 0
 <1><ab6c6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ab6c7>   DW_AT_byte_size   : 16
    <ab6c8>   DW_AT_decl_file   : 8
    <ab6c8>   DW_AT_decl_line   : 8
    <ab6c9>   DW_AT_decl_column : 3
    <ab6c9>   DW_AT_sibling     : <0xab6fc>
 <2><ab6cd>: Abbrev Number: 7 (DW_TAG_member)
    <ab6ce>   DW_AT_name        : x
    <ab6d0>   DW_AT_decl_file   : 8
    <ab6d1>   DW_AT_decl_line   : 9
    <ab6d2>   DW_AT_decl_column : 8
    <ab6d3>   DW_AT_type        : <0xab1d8>
    <ab6d7>   DW_AT_data_member_location: 0
 <2><ab6d8>: Abbrev Number: 7 (DW_TAG_member)
    <ab6d9>   DW_AT_name        : y
    <ab6db>   DW_AT_decl_file   : 8
    <ab6dc>   DW_AT_decl_line   : 9
    <ab6dd>   DW_AT_decl_column : 11
    <ab6de>   DW_AT_type        : <0xab1d8>
    <ab6e2>   DW_AT_data_member_location: 4
 <2><ab6e3>: Abbrev Number: 7 (DW_TAG_member)
    <ab6e4>   DW_AT_name        : dx
    <ab6e7>   DW_AT_decl_file   : 8
    <ab6e8>   DW_AT_decl_line   : 10
    <ab6e9>   DW_AT_decl_column : 8
    <ab6ea>   DW_AT_type        : <0xab1d8>
    <ab6ee>   DW_AT_data_member_location: 8
 <2><ab6ef>: Abbrev Number: 7 (DW_TAG_member)
    <ab6f0>   DW_AT_name        : dy
    <ab6f3>   DW_AT_decl_file   : 8
    <ab6f4>   DW_AT_decl_line   : 10
    <ab6f5>   DW_AT_decl_column : 12
    <ab6f6>   DW_AT_type        : <0xab1d8>
    <ab6fa>   DW_AT_data_member_location: 12
 <2><ab6fb>: Abbrev Number: 0
 <1><ab6fc>: Abbrev Number: 29 (DW_TAG_union_type)
    <ab6fd>   DW_AT_byte_size   : 16
    <ab6fe>   DW_AT_decl_file   : 8
    <ab6ff>   DW_AT_decl_line   : 3
    <ab700>   DW_AT_decl_column : 2
    <ab701>   DW_AT_sibling     : <0xab72c>
 <2><ab705>: Abbrev Number: 16 (DW_TAG_member)
    <ab706>   DW_AT_type        : <0xab6a4>
 <2><ab70a>: Abbrev Number: 16 (DW_TAG_member)
    <ab70b>   DW_AT_type        : <0xab6c6>
 <2><ab70f>: Abbrev Number: 30 (DW_TAG_member)
    <ab710>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <ab714>   DW_AT_decl_file   : 8
    <ab715>   DW_AT_decl_line   : 12
    <ab716>   DW_AT_decl_column : 7
    <ab717>   DW_AT_type        : <0xab1d8>
 <2><ab71b>: Abbrev Number: 17 (DW_TAG_member)
    <ab71c>   DW_AT_name        : z
    <ab71e>   DW_AT_decl_file   : 8
    <ab71e>   DW_AT_decl_line   : 13
    <ab71f>   DW_AT_decl_column : 7
    <ab71f>   DW_AT_type        : <0xab1d8>
 <2><ab723>: Abbrev Number: 17 (DW_TAG_member)
    <ab724>   DW_AT_name        : w
    <ab726>   DW_AT_decl_file   : 8
    <ab726>   DW_AT_decl_line   : 14
    <ab727>   DW_AT_decl_column : 7
    <ab727>   DW_AT_type        : <0xab1d8>
 <2><ab72b>: Abbrev Number: 0
 <1><ab72c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ab72d>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <ab731>   DW_AT_byte_size   : 20
    <ab732>   DW_AT_decl_file   : 8
    <ab733>   DW_AT_decl_line   : 1
    <ab734>   DW_AT_decl_column : 8
    <ab735>   DW_AT_sibling     : <0xab74d>
 <2><ab739>: Abbrev Number: 2 (DW_TAG_member)
    <ab73a>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ab73e>   DW_AT_decl_file   : 8
    <ab73f>   DW_AT_decl_line   : 2
    <ab740>   DW_AT_decl_column : 6
    <ab741>   DW_AT_type        : <0xab1d8>
    <ab745>   DW_AT_data_member_location: 0
 <2><ab746>: Abbrev Number: 31 (DW_TAG_member)
    <ab747>   DW_AT_type        : <0xab6fc>
    <ab74b>   DW_AT_data_member_location: 4
 <2><ab74c>: Abbrev Number: 0
 <1><ab74d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab74e>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <ab752>   DW_AT_decl_file   : 8
    <ab753>   DW_AT_decl_line   : 18
    <ab754>   DW_AT_decl_column : 23
    <ab755>   DW_AT_type        : <0xab72c>
 <1><ab759>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab75a>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <ab75e>   DW_AT_decl_file   : 9
    <ab75f>   DW_AT_decl_line   : 1
    <ab760>   DW_AT_decl_column : 23
    <ab761>   DW_AT_type        : <0xab765>
 <1><ab765>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab766>   DW_AT_byte_size   : 8
    <ab766>   DW_AT_type        : <0xab76a>
 <1><ab76a>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <ab76b>   DW_AT_prototyped  : 1
    <ab76b>   DW_AT_type        : <0xab583>
 <1><ab76f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab770>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <ab774>   DW_AT_decl_file   : 9
    <ab775>   DW_AT_decl_line   : 2
    <ab776>   DW_AT_decl_column : 23
    <ab777>   DW_AT_type        : <0xab77b>
 <1><ab77b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab77c>   DW_AT_byte_size   : 8
    <ab77c>   DW_AT_type        : <0xab780>
 <1><ab780>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <ab781>   DW_AT_prototyped  : 1
    <ab781>   DW_AT_type        : <0xab1d8>
 <1><ab785>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab786>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <ab78a>   DW_AT_decl_file   : 9
    <ab78b>   DW_AT_decl_line   : 3
    <ab78c>   DW_AT_decl_column : 23
    <ab78d>   DW_AT_type        : <0xab77b>
 <1><ab791>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab792>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <ab796>   DW_AT_decl_file   : 9
    <ab797>   DW_AT_decl_line   : 10
    <ab798>   DW_AT_decl_column : 23
    <ab799>   DW_AT_type        : <0xab79d>
 <1><ab79d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab79e>   DW_AT_byte_size   : 8
    <ab79e>   DW_AT_type        : <0xab7a2>
 <1><ab7a2>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ab7a3>   DW_AT_prototyped  : 1
    <ab7a3>   DW_AT_sibling     : <0xab7ad>
 <2><ab7a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab7a8>   DW_AT_type        : <0xab1d8>
 <2><ab7ac>: Abbrev Number: 0
 <1><ab7ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab7ae>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <ab7b2>   DW_AT_decl_file   : 9
    <ab7b3>   DW_AT_decl_line   : 14
    <ab7b4>   DW_AT_decl_column : 23
    <ab7b5>   DW_AT_type        : <0xab7b9>
 <1><ab7b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab7ba>   DW_AT_byte_size   : 8
    <ab7ba>   DW_AT_type        : <0xab7be>
 <1><ab7be>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab7bf>   DW_AT_prototyped  : 1
    <ab7bf>   DW_AT_type        : <0xab1d8>
    <ab7c3>   DW_AT_sibling     : <0xab7d7>
 <2><ab7c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab7c8>   DW_AT_type        : <0xab1d8>
 <2><ab7cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab7cd>   DW_AT_type        : <0xab1d8>
 <2><ab7d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab7d2>   DW_AT_type        : <0xab1d8>
 <2><ab7d6>: Abbrev Number: 0
 <1><ab7d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab7d8>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <ab7dc>   DW_AT_decl_file   : 9
    <ab7dd>   DW_AT_decl_line   : 18
    <ab7de>   DW_AT_decl_column : 23
    <ab7df>   DW_AT_type        : <0xab7b9>
 <1><ab7e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab7e4>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <ab7e8>   DW_AT_decl_file   : 9
    <ab7e9>   DW_AT_decl_line   : 24
    <ab7ea>   DW_AT_decl_column : 23
    <ab7eb>   DW_AT_type        : <0xab277>
 <1><ab7ef>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab7f0>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <ab7f4>   DW_AT_decl_file   : 9
    <ab7f5>   DW_AT_decl_line   : 28
    <ab7f6>   DW_AT_decl_column : 23
    <ab7f7>   DW_AT_type        : <0xab7fb>
 <1><ab7fb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab7fc>   DW_AT_byte_size   : 8
    <ab7fc>   DW_AT_type        : <0xab800>
 <1><ab800>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab801>   DW_AT_prototyped  : 1
    <ab801>   DW_AT_type        : <0xab1d8>
    <ab805>   DW_AT_sibling     : <0xab814>
 <2><ab809>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab80a>   DW_AT_type        : <0xab1d8>
 <2><ab80e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab80f>   DW_AT_type        : <0xab1d8>
 <2><ab813>: Abbrev Number: 0
 <1><ab814>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab815>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <ab819>   DW_AT_decl_file   : 9
    <ab81a>   DW_AT_decl_line   : 34
    <ab81b>   DW_AT_decl_column : 23
    <ab81c>   DW_AT_type        : <0xab77b>
 <1><ab820>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab821>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <ab825>   DW_AT_decl_file   : 9
    <ab826>   DW_AT_decl_line   : 35
    <ab827>   DW_AT_decl_column : 23
    <ab828>   DW_AT_type        : <0xab77b>
 <1><ab82c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab82d>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <ab831>   DW_AT_decl_file   : 9
    <ab832>   DW_AT_decl_line   : 36
    <ab833>   DW_AT_decl_column : 23
    <ab834>   DW_AT_type        : <0xab838>
 <1><ab838>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab839>   DW_AT_byte_size   : 8
    <ab839>   DW_AT_type        : <0xab83d>
 <1><ab83d>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ab83e>   DW_AT_prototyped  : 1
    <ab83e>   DW_AT_sibling     : <0xab84d>
 <2><ab842>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab843>   DW_AT_type        : <0xab84d>
 <2><ab847>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab848>   DW_AT_type        : <0xab84d>
 <2><ab84c>: Abbrev Number: 0
 <1><ab84d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab84e>   DW_AT_byte_size   : 8
    <ab84e>   DW_AT_type        : <0xab1d8>
 <1><ab852>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab853>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <ab857>   DW_AT_decl_file   : 9
    <ab858>   DW_AT_decl_line   : 37
    <ab859>   DW_AT_decl_column : 23
    <ab85a>   DW_AT_type        : <0xab838>
 <1><ab85e>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab85f>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <ab863>   DW_AT_decl_file   : 9
    <ab864>   DW_AT_decl_line   : 45
    <ab865>   DW_AT_decl_column : 24
    <ab866>   DW_AT_type        : <0xab86a>
 <1><ab86a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab86b>   DW_AT_byte_size   : 8
    <ab86b>   DW_AT_type        : <0xab86f>
 <1><ab86f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab870>   DW_AT_prototyped  : 1
    <ab870>   DW_AT_type        : <0xab1bc>
    <ab874>   DW_AT_sibling     : <0xab888>
 <2><ab878>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab879>   DW_AT_type        : <0xab1d8>
 <2><ab87d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab87e>   DW_AT_type        : <0xab1d8>
 <2><ab882>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab883>   DW_AT_type        : <0xab1d8>
 <2><ab887>: Abbrev Number: 0
 <1><ab888>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab889>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <ab88d>   DW_AT_decl_file   : 9
    <ab88e>   DW_AT_decl_line   : 48
    <ab88f>   DW_AT_decl_column : 23
    <ab890>   DW_AT_type        : <0xab894>
 <1><ab894>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab895>   DW_AT_byte_size   : 8
    <ab895>   DW_AT_type        : <0xab899>
 <1><ab899>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ab89a>   DW_AT_prototyped  : 1
    <ab89a>   DW_AT_sibling     : <0xab8ae>
 <2><ab89e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab89f>   DW_AT_type        : <0xab260>
 <2><ab8a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8a4>   DW_AT_type        : <0xab20c>
 <2><ab8a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8a9>   DW_AT_type        : <0xab1d8>
 <2><ab8ad>: Abbrev Number: 0
 <1><ab8ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab8af>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <ab8b3>   DW_AT_decl_file   : 9
    <ab8b4>   DW_AT_decl_line   : 49
    <ab8b5>   DW_AT_decl_column : 23
    <ab8b6>   DW_AT_type        : <0xab8ba>
 <1><ab8ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab8bb>   DW_AT_byte_size   : 8
    <ab8bb>   DW_AT_type        : <0xab8bf>
 <1><ab8bf>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ab8c0>   DW_AT_prototyped  : 1
    <ab8c0>   DW_AT_sibling     : <0xab8d4>
 <2><ab8c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8c5>   DW_AT_type        : <0xab523>
 <2><ab8c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8ca>   DW_AT_type        : <0xab20c>
 <2><ab8ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8cf>   DW_AT_type        : <0xab1d8>
 <2><ab8d3>: Abbrev Number: 0
 <1><ab8d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab8d5>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <ab8d9>   DW_AT_decl_file   : 9
    <ab8da>   DW_AT_decl_line   : 51
    <ab8db>   DW_AT_decl_column : 24
    <ab8dc>   DW_AT_type        : <0xab8e0>
 <1><ab8e0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab8e1>   DW_AT_byte_size   : 8
    <ab8e1>   DW_AT_type        : <0xab8e5>
 <1><ab8e5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab8e6>   DW_AT_prototyped  : 1
    <ab8e6>   DW_AT_type        : <0xab200>
    <ab8ea>   DW_AT_sibling     : <0xab8f9>
 <2><ab8ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8ef>   DW_AT_type        : <0xab200>
 <2><ab8f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab8f4>   DW_AT_type        : <0xab23d>
 <2><ab8f8>: Abbrev Number: 0
 <1><ab8f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab8fa>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <ab8fe>   DW_AT_decl_file   : 9
    <ab8ff>   DW_AT_decl_line   : 54
    <ab900>   DW_AT_decl_column : 23
    <ab901>   DW_AT_type        : <0xab905>
 <1><ab905>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab906>   DW_AT_byte_size   : 8
    <ab906>   DW_AT_type        : <0xab90a>
 <1><ab90a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab90b>   DW_AT_prototyped  : 1
    <ab90b>   DW_AT_type        : <0xab1d8>
    <ab90f>   DW_AT_sibling     : <0xab932>
 <2><ab913>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab914>   DW_AT_type        : <0xab583>
 <2><ab918>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab919>   DW_AT_type        : <0xab1f2>
 <2><ab91d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab91e>   DW_AT_type        : <0xab23d>
 <2><ab922>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab923>   DW_AT_type        : <0xab1d8>
 <2><ab927>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab928>   DW_AT_type        : <0xab1d8>
 <2><ab92c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab92d>   DW_AT_type        : <0xab1d8>
 <2><ab931>: Abbrev Number: 0
 <1><ab932>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab933>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <ab937>   DW_AT_decl_file   : 9
    <ab938>   DW_AT_decl_line   : 56
    <ab939>   DW_AT_decl_column : 23
    <ab93a>   DW_AT_type        : <0xab93e>
 <1><ab93e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab93f>   DW_AT_byte_size   : 8
    <ab93f>   DW_AT_type        : <0xab943>
 <1><ab943>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab944>   DW_AT_prototyped  : 1
    <ab944>   DW_AT_type        : <0xab1d8>
    <ab948>   DW_AT_sibling     : <0xab966>
 <2><ab94c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab94d>   DW_AT_type        : <0xab523>
 <2><ab951>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab952>   DW_AT_type        : <0xab2cc>
 <2><ab956>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab957>   DW_AT_type        : <0xab23d>
 <2><ab95b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab95c>   DW_AT_type        : <0xab1d8>
 <2><ab960>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab961>   DW_AT_type        : <0xab1d8>
 <2><ab965>: Abbrev Number: 0
 <1><ab966>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab967>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <ab96b>   DW_AT_decl_file   : 9
    <ab96c>   DW_AT_decl_line   : 67
    <ab96d>   DW_AT_decl_column : 23
    <ab96e>   DW_AT_type        : <0xab972>
 <1><ab972>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab973>   DW_AT_byte_size   : 8
    <ab973>   DW_AT_type        : <0xab977>
 <1><ab977>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab978>   DW_AT_prototyped  : 1
    <ab978>   DW_AT_type        : <0xab1d8>
    <ab97c>   DW_AT_sibling     : <0xab986>
 <2><ab980>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab981>   DW_AT_type        : <0xab1d8>
 <2><ab985>: Abbrev Number: 0
 <1><ab986>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab987>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <ab98b>   DW_AT_decl_file   : 9
    <ab98c>   DW_AT_decl_line   : 68
    <ab98d>   DW_AT_decl_column : 23
    <ab98e>   DW_AT_type        : <0xab992>
 <1><ab992>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab993>   DW_AT_byte_size   : 8
    <ab993>   DW_AT_type        : <0xab997>
 <1><ab997>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab998>   DW_AT_prototyped  : 1
    <ab998>   DW_AT_type        : <0xab1d8>
    <ab99c>   DW_AT_sibling     : <0xab9ba>
 <2><ab9a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9a1>   DW_AT_type        : <0xab84d>
 <2><ab9a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9a6>   DW_AT_type        : <0xab84d>
 <2><ab9aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9ab>   DW_AT_type        : <0xab84d>
 <2><ab9af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9b0>   DW_AT_type        : <0xab84d>
 <2><ab9b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9b5>   DW_AT_type        : <0xab84d>
 <2><ab9b9>: Abbrev Number: 0
 <1><ab9ba>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab9bb>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <ab9bf>   DW_AT_decl_file   : 9
    <ab9c0>   DW_AT_decl_line   : 69
    <ab9c1>   DW_AT_decl_column : 23
    <ab9c2>   DW_AT_type        : <0xab9c6>
 <1><ab9c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab9c7>   DW_AT_byte_size   : 8
    <ab9c7>   DW_AT_type        : <0xab9cb>
 <1><ab9cb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab9cc>   DW_AT_prototyped  : 1
    <ab9cc>   DW_AT_type        : <0xab1d8>
    <ab9d0>   DW_AT_sibling     : <0xab9e9>
 <2><ab9d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9d5>   DW_AT_type        : <0xab1d8>
 <2><ab9d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9da>   DW_AT_type        : <0xab1d8>
 <2><ab9de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9df>   DW_AT_type        : <0xab1d8>
 <2><ab9e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ab9e4>   DW_AT_type        : <0xab1d8>
 <2><ab9e8>: Abbrev Number: 0
 <1><ab9e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab9ea>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <ab9ee>   DW_AT_decl_file   : 9
    <ab9ef>   DW_AT_decl_line   : 73
    <ab9f0>   DW_AT_decl_column : 23
    <ab9f1>   DW_AT_type        : <0xab9f5>
 <1><ab9f5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ab9f6>   DW_AT_byte_size   : 8
    <ab9f6>   DW_AT_type        : <0xab9fa>
 <1><ab9fa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ab9fb>   DW_AT_prototyped  : 1
    <ab9fb>   DW_AT_type        : <0xab1d8>
    <ab9ff>   DW_AT_sibling     : <0xaba09>
 <2><aba03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aba04>   DW_AT_type        : <0xab1b5>
 <2><aba08>: Abbrev Number: 0
 <1><aba09>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba0a>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <aba0e>   DW_AT_decl_file   : 9
    <aba0f>   DW_AT_decl_line   : 74
    <aba10>   DW_AT_decl_column : 23
    <aba11>   DW_AT_type        : <0xaba15>
 <1><aba15>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aba16>   DW_AT_byte_size   : 8
    <aba16>   DW_AT_type        : <0xaba1a>
 <1><aba1a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <aba1b>   DW_AT_prototyped  : 1
    <aba1b>   DW_AT_type        : <0xab1d8>
    <aba1f>   DW_AT_sibling     : <0xaba2e>
 <2><aba23>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aba24>   DW_AT_type        : <0xab1b5>
 <2><aba28>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aba29>   DW_AT_type        : <0xab1ae>
 <2><aba2d>: Abbrev Number: 0
 <1><aba2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba2f>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <aba33>   DW_AT_decl_file   : 9
    <aba34>   DW_AT_decl_line   : 80
    <aba35>   DW_AT_decl_column : 23
    <aba36>   DW_AT_type        : <0xab79d>
 <1><aba3a>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba3b>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <aba3f>   DW_AT_decl_file   : 9
    <aba40>   DW_AT_decl_line   : 83
    <aba41>   DW_AT_decl_column : 23
    <aba42>   DW_AT_type        : <0xab972>
 <1><aba46>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba47>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <aba4b>   DW_AT_decl_file   : 9
    <aba4c>   DW_AT_decl_line   : 86
    <aba4d>   DW_AT_decl_column : 23
    <aba4e>   DW_AT_type        : <0xab7fb>
 <1><aba52>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba53>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <aba57>   DW_AT_decl_file   : 9
    <aba58>   DW_AT_decl_line   : 89
    <aba59>   DW_AT_decl_column : 23
    <aba5a>   DW_AT_type        : <0xab7fb>
 <1><aba5e>: Abbrev Number: 3 (DW_TAG_typedef)
    <aba5f>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <aba63>   DW_AT_decl_file   : 9
    <aba64>   DW_AT_decl_line   : 91
    <aba65>   DW_AT_decl_column : 23
    <aba66>   DW_AT_type        : <0xaba6a>
 <1><aba6a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aba6b>   DW_AT_byte_size   : 8
    <aba6b>   DW_AT_type        : <0xaba6f>
 <1><aba6f>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <aba70>   DW_AT_prototyped  : 1
    <aba70>   DW_AT_sibling     : <0xaba7a>
 <2><aba74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aba75>   DW_AT_type        : <0xaba7a>
 <2><aba79>: Abbrev Number: 0
 <1><aba7a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aba7b>   DW_AT_byte_size   : 8
    <aba7b>   DW_AT_type        : <0xab74d>
 <1><aba7f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <aba80>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <aba84>   DW_AT_byte_size   : 224
    <aba85>   DW_AT_decl_file   : 9
    <aba86>   DW_AT_decl_line   : 93
    <aba87>   DW_AT_decl_column : 16
    <aba88>   DW_AT_sibling     : <0xabbf9>
 <2><aba8c>: Abbrev Number: 2 (DW_TAG_member)
    <aba8d>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <aba91>   DW_AT_decl_file   : 9
    <aba92>   DW_AT_decl_line   : 94
    <aba93>   DW_AT_decl_column : 23
    <aba94>   DW_AT_type        : <0xab759>
    <aba98>   DW_AT_data_member_location: 0
 <2><aba99>: Abbrev Number: 2 (DW_TAG_member)
    <aba9a>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <aba9e>   DW_AT_decl_file   : 9
    <aba9f>   DW_AT_decl_line   : 95
    <abaa0>   DW_AT_decl_column : 23
    <abaa1>   DW_AT_type        : <0xab76f>
    <abaa5>   DW_AT_data_member_location: 8
 <2><abaa6>: Abbrev Number: 2 (DW_TAG_member)
    <abaa7>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <abaab>   DW_AT_decl_file   : 9
    <abaac>   DW_AT_decl_line   : 96
    <abaad>   DW_AT_decl_column : 23
    <abaae>   DW_AT_type        : <0xab785>
    <abab2>   DW_AT_data_member_location: 16
 <2><abab3>: Abbrev Number: 2 (DW_TAG_member)
    <abab4>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <abab8>   DW_AT_decl_file   : 9
    <abab9>   DW_AT_decl_line   : 97
    <ababa>   DW_AT_decl_column : 23
    <ababb>   DW_AT_type        : <0xab791>
    <ababf>   DW_AT_data_member_location: 24
 <2><abac0>: Abbrev Number: 2 (DW_TAG_member)
    <abac1>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <abac5>   DW_AT_decl_file   : 9
    <abac6>   DW_AT_decl_line   : 98
    <abac7>   DW_AT_decl_column : 23
    <abac8>   DW_AT_type        : <0xab7ad>
    <abacc>   DW_AT_data_member_location: 32
 <2><abacd>: Abbrev Number: 2 (DW_TAG_member)
    <abace>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <abad2>   DW_AT_decl_file   : 9
    <abad3>   DW_AT_decl_line   : 99
    <abad4>   DW_AT_decl_column : 23
    <abad5>   DW_AT_type        : <0xab7d7>
    <abad9>   DW_AT_data_member_location: 40
 <2><abada>: Abbrev Number: 2 (DW_TAG_member)
    <abadb>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <abadf>   DW_AT_decl_file   : 9
    <abae0>   DW_AT_decl_line   : 100
    <abae1>   DW_AT_decl_column : 23
    <abae2>   DW_AT_type        : <0xab7ef>
    <abae6>   DW_AT_data_member_location: 48
 <2><abae7>: Abbrev Number: 2 (DW_TAG_member)
    <abae8>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <abaec>   DW_AT_decl_file   : 9
    <abaed>   DW_AT_decl_line   : 101
    <abaee>   DW_AT_decl_column : 23
    <abaef>   DW_AT_type        : <0xab814>
    <abaf3>   DW_AT_data_member_location: 56
 <2><abaf4>: Abbrev Number: 2 (DW_TAG_member)
    <abaf5>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <abaf9>   DW_AT_decl_file   : 9
    <abafa>   DW_AT_decl_line   : 102
    <abafb>   DW_AT_decl_column : 23
    <abafc>   DW_AT_type        : <0xab820>
    <abb00>   DW_AT_data_member_location: 64
 <2><abb01>: Abbrev Number: 2 (DW_TAG_member)
    <abb02>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <abb06>   DW_AT_decl_file   : 9
    <abb07>   DW_AT_decl_line   : 103
    <abb08>   DW_AT_decl_column : 23
    <abb09>   DW_AT_type        : <0xab82c>
    <abb0d>   DW_AT_data_member_location: 72
 <2><abb0e>: Abbrev Number: 2 (DW_TAG_member)
    <abb0f>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <abb13>   DW_AT_decl_file   : 9
    <abb14>   DW_AT_decl_line   : 104
    <abb15>   DW_AT_decl_column : 23
    <abb16>   DW_AT_type        : <0xab852>
    <abb1a>   DW_AT_data_member_location: 80
 <2><abb1b>: Abbrev Number: 2 (DW_TAG_member)
    <abb1c>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <abb20>   DW_AT_decl_file   : 9
    <abb21>   DW_AT_decl_line   : 105
    <abb22>   DW_AT_decl_column : 24
    <abb23>   DW_AT_type        : <0xab888>
    <abb27>   DW_AT_data_member_location: 88
 <2><abb28>: Abbrev Number: 2 (DW_TAG_member)
    <abb29>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <abb2d>   DW_AT_decl_file   : 9
    <abb2e>   DW_AT_decl_line   : 106
    <abb2f>   DW_AT_decl_column : 25
    <abb30>   DW_AT_type        : <0xab8ae>
    <abb34>   DW_AT_data_member_location: 96
 <2><abb35>: Abbrev Number: 2 (DW_TAG_member)
    <abb36>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <abb3a>   DW_AT_decl_file   : 9
    <abb3b>   DW_AT_decl_line   : 107
    <abb3c>   DW_AT_decl_column : 23
    <abb3d>   DW_AT_type        : <0xab8d4>
    <abb41>   DW_AT_data_member_location: 104
 <2><abb42>: Abbrev Number: 2 (DW_TAG_member)
    <abb43>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <abb47>   DW_AT_decl_file   : 9
    <abb48>   DW_AT_decl_line   : 108
    <abb49>   DW_AT_decl_column : 23
    <abb4a>   DW_AT_type        : <0xab966>
    <abb4e>   DW_AT_data_member_location: 112
 <2><abb4f>: Abbrev Number: 2 (DW_TAG_member)
    <abb50>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <abb54>   DW_AT_decl_file   : 9
    <abb55>   DW_AT_decl_line   : 109
    <abb56>   DW_AT_decl_column : 23
    <abb57>   DW_AT_type        : <0xab986>
    <abb5b>   DW_AT_data_member_location: 120
 <2><abb5c>: Abbrev Number: 2 (DW_TAG_member)
    <abb5d>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <abb61>   DW_AT_decl_file   : 9
    <abb62>   DW_AT_decl_line   : 110
    <abb63>   DW_AT_decl_column : 23
    <abb64>   DW_AT_type        : <0xab9ba>
    <abb68>   DW_AT_data_member_location: 128
 <2><abb69>: Abbrev Number: 2 (DW_TAG_member)
    <abb6a>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <abb6e>   DW_AT_decl_file   : 9
    <abb6f>   DW_AT_decl_line   : 111
    <abb70>   DW_AT_decl_column : 23
    <abb71>   DW_AT_type        : <0xab9e9>
    <abb75>   DW_AT_data_member_location: 136
 <2><abb76>: Abbrev Number: 2 (DW_TAG_member)
    <abb77>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <abb7b>   DW_AT_decl_file   : 9
    <abb7c>   DW_AT_decl_line   : 112
    <abb7d>   DW_AT_decl_column : 23
    <abb7e>   DW_AT_type        : <0xaba09>
    <abb82>   DW_AT_data_member_location: 144
 <2><abb83>: Abbrev Number: 2 (DW_TAG_member)
    <abb84>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <abb88>   DW_AT_decl_file   : 9
    <abb89>   DW_AT_decl_line   : 113
    <abb8a>   DW_AT_decl_column : 25
    <abb8b>   DW_AT_type        : <0xab7e3>
    <abb8f>   DW_AT_data_member_location: 152
 <2><abb90>: Abbrev Number: 2 (DW_TAG_member)
    <abb91>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <abb95>   DW_AT_decl_file   : 9
    <abb96>   DW_AT_decl_line   : 114
    <abb97>   DW_AT_decl_column : 24
    <abb98>   DW_AT_type        : <0xab8f9>
    <abb9c>   DW_AT_data_member_location: 160
 <2><abb9d>: Abbrev Number: 2 (DW_TAG_member)
    <abb9e>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <abba2>   DW_AT_decl_file   : 9
    <abba3>   DW_AT_decl_line   : 115
    <abba4>   DW_AT_decl_column : 25
    <abba5>   DW_AT_type        : <0xab932>
    <abba9>   DW_AT_data_member_location: 168
 <2><abbaa>: Abbrev Number: 2 (DW_TAG_member)
    <abbab>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <abbaf>   DW_AT_decl_file   : 9
    <abbb0>   DW_AT_decl_line   : 116
    <abbb1>   DW_AT_decl_column : 23
    <abbb2>   DW_AT_type        : <0xab85e>
    <abbb6>   DW_AT_data_member_location: 176
 <2><abbb7>: Abbrev Number: 2 (DW_TAG_member)
    <abbb8>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <abbbc>   DW_AT_decl_file   : 9
    <abbbd>   DW_AT_decl_line   : 117
    <abbbe>   DW_AT_decl_column : 23
    <abbbf>   DW_AT_type        : <0xaba2e>
    <abbc3>   DW_AT_data_member_location: 184
 <2><abbc4>: Abbrev Number: 2 (DW_TAG_member)
    <abbc5>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <abbc9>   DW_AT_decl_file   : 9
    <abbca>   DW_AT_decl_line   : 118
    <abbcb>   DW_AT_decl_column : 22
    <abbcc>   DW_AT_type        : <0xaba3a>
    <abbd0>   DW_AT_data_member_location: 192
 <2><abbd1>: Abbrev Number: 2 (DW_TAG_member)
    <abbd2>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <abbd6>   DW_AT_decl_file   : 9
    <abbd7>   DW_AT_decl_line   : 119
    <abbd8>   DW_AT_decl_column : 23
    <abbd9>   DW_AT_type        : <0xaba46>
    <abbdd>   DW_AT_data_member_location: 200
 <2><abbde>: Abbrev Number: 2 (DW_TAG_member)
    <abbdf>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <abbe3>   DW_AT_decl_file   : 9
    <abbe4>   DW_AT_decl_line   : 120
    <abbe5>   DW_AT_decl_column : 22
    <abbe6>   DW_AT_type        : <0xaba52>
    <abbea>   DW_AT_data_member_location: 208
 <2><abbeb>: Abbrev Number: 2 (DW_TAG_member)
    <abbec>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <abbf0>   DW_AT_decl_file   : 9
    <abbf1>   DW_AT_decl_line   : 121
    <abbf2>   DW_AT_decl_column : 23
    <abbf3>   DW_AT_type        : <0xaba5e>
    <abbf7>   DW_AT_data_member_location: 216
 <2><abbf8>: Abbrev Number: 0
 <1><abbf9>: Abbrev Number: 3 (DW_TAG_typedef)
    <abbfa>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <abbfe>   DW_AT_decl_file   : 9
    <abbff>   DW_AT_decl_line   : 122
    <abc00>   DW_AT_decl_column : 3
    <abc01>   DW_AT_type        : <0xaba7f>
 <1><abc05>: Abbrev Number: 32 (DW_TAG_structure_type)
    <abc06>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <abc0a>   DW_AT_byte_size   : 20848
    <abc0c>   DW_AT_decl_file   : 10
    <abc0d>   DW_AT_decl_line   : 349
    <abc0f>   DW_AT_decl_column : 16
    <abc10>   DW_AT_sibling     : <0xabc85>
 <2><abc14>: Abbrev Number: 10 (DW_TAG_member)
    <abc15>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <abc19>   DW_AT_decl_file   : 10
    <abc19>   DW_AT_decl_line   : 350
    <abc1b>   DW_AT_decl_column : 18
    <abc1b>   DW_AT_type        : <0xab1d8>
    <abc1f>   DW_AT_data_member_location: 0
 <2><abc20>: Abbrev Number: 10 (DW_TAG_member)
    <abc21>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <abc25>   DW_AT_decl_file   : 10
    <abc25>   DW_AT_decl_line   : 351
    <abc27>   DW_AT_decl_column : 18
    <abc27>   DW_AT_type        : <0xab266>
    <abc2b>   DW_AT_data_member_location: 8
 <2><abc2c>: Abbrev Number: 10 (DW_TAG_member)
    <abc2d>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <abc31>   DW_AT_decl_file   : 10
    <abc31>   DW_AT_decl_line   : 352
    <abc33>   DW_AT_decl_column : 18
    <abc33>   DW_AT_type        : <0xab2b2>
    <abc37>   DW_AT_data_member_location: 16
 <2><abc38>: Abbrev Number: 10 (DW_TAG_member)
    <abc39>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <abc3d>   DW_AT_decl_file   : 10
    <abc3d>   DW_AT_decl_line   : 353
    <abc3f>   DW_AT_decl_column : 18
    <abc3f>   DW_AT_type        : <0xab200>
    <abc43>   DW_AT_data_member_location: 40
 <2><abc44>: Abbrev Number: 10 (DW_TAG_member)
    <abc45>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <abc49>   DW_AT_decl_file   : 10
    <abc49>   DW_AT_decl_line   : 354
    <abc4b>   DW_AT_decl_column : 18
    <abc4b>   DW_AT_type        : <0xabbf9>
    <abc4f>   DW_AT_data_member_location: 48
 <2><abc50>: Abbrev Number: 12 (DW_TAG_member)
    <abc51>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <abc55>   DW_AT_decl_file   : 10
    <abc55>   DW_AT_decl_line   : 355
    <abc57>   DW_AT_decl_column : 18
    <abc57>   DW_AT_type        : <0xabc85>
    <abc5b>   DW_AT_data_member_location: 272
 <2><abc5d>: Abbrev Number: 12 (DW_TAG_member)
    <abc5e>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <abc62>   DW_AT_decl_file   : 10
    <abc62>   DW_AT_decl_line   : 356
    <abc64>   DW_AT_decl_column : 18
    <abc64>   DW_AT_type        : <0xab1d8>
    <abc68>   DW_AT_data_member_location: 20832
 <2><abc6a>: Abbrev Number: 12 (DW_TAG_member)
    <abc6b>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <abc6f>   DW_AT_decl_file   : 10
    <abc6f>   DW_AT_decl_line   : 357
    <abc71>   DW_AT_decl_column : 18
    <abc71>   DW_AT_type        : <0xab1d8>
    <abc75>   DW_AT_data_member_location: 20836
 <2><abc77>: Abbrev Number: 12 (DW_TAG_member)
    <abc78>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <abc7c>   DW_AT_decl_file   : 10
    <abc7c>   DW_AT_decl_line   : 358
    <abc7e>   DW_AT_decl_column : 18
    <abc7e>   DW_AT_type        : <0xab277>
    <abc82>   DW_AT_data_member_location: 20840
 <2><abc84>: Abbrev Number: 0
 <1><abc85>: Abbrev Number: 14 (DW_TAG_array_type)
    <abc86>   DW_AT_type        : <0xab693>
    <abc8a>   DW_AT_sibling     : <0xabc96>
 <2><abc8e>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <abc8f>   DW_AT_type        : <0xab1c3>
    <abc93>   DW_AT_upper_bound : 256
 <2><abc95>: Abbrev Number: 0
 <1><abc96>: Abbrev Number: 13 (DW_TAG_typedef)
    <abc97>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <abc9b>   DW_AT_decl_file   : 10
    <abc9c>   DW_AT_decl_line   : 359
    <abc9e>   DW_AT_decl_column : 3
    <abc9f>   DW_AT_type        : <0xabc05>
 <1><abca3>: Abbrev Number: 34 (DW_TAG_variable)
    <abca4>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <abca8>   DW_AT_decl_file   : 10
    <abca9>   DW_AT_decl_line   : 361
    <abcab>   DW_AT_decl_column : 21
    <abcac>   DW_AT_type        : <0xabc96>
    <abcb0>   DW_AT_external    : 1
    <abcb0>   DW_AT_declaration : 1
 <1><abcb0>: Abbrev Number: 35 (DW_TAG_subprogram)
    <abcb1>   DW_AT_external    : 1
    <abcb1>   DW_AT_name        : (indirect string, offset: 0xe888): fb_FileEof
    <abcb5>   DW_AT_decl_file   : 1
    <abcb6>   DW_AT_decl_line   : 37
    <abcb7>   DW_AT_decl_column : 12
    <abcb8>   DW_AT_prototyped  : 1
    <abcb8>   DW_AT_type        : <0xab1d8>
    <abcbc>   DW_AT_low_pc      : 0x46dbb0
    <abcc4>   DW_AT_high_pc     : 0x76
    <abccc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <abcce>   DW_AT_sibling     : <0xabd17>
 <2><abcd2>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <abcd3>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <abcd7>   DW_AT_decl_file   : 1
    <abcd8>   DW_AT_decl_line   : 37
    <abcd9>   DW_AT_decl_column : 28
    <abcda>   DW_AT_type        : <0xab1d8>
    <abcde>   DW_AT_location    : 0x339c3 (location list)
    <abce2>   DW_AT_GNU_locviews: 0x339b5
 <2><abce6>: Abbrev Number: 37 (DW_TAG_inlined_subroutine)
    <abce7>   DW_AT_abstract_origin: <0xabd17>
    <abceb>   DW_AT_entry_pc    : 0x46dbe7
    <abcf3>   DW_AT_GNU_entry_view: 0
    <abcf4>   DW_AT_ranges      : 0x17968
    <abcf8>   DW_AT_call_file   : 1
    <abcf9>   DW_AT_call_line   : 39
    <abcfa>   DW_AT_call_column : 12
 <3><abcfb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <abcfc>   DW_AT_abstract_origin: <0xabd28>
    <abd00>   DW_AT_location    : 0x339fb (location list)
    <abd04>   DW_AT_GNU_locviews: 0x339f7
 <3><abd08>: Abbrev Number: 38 (DW_TAG_lexical_block)
    <abd09>   DW_AT_ranges      : 0x17968
 <4><abd0d>: Abbrev Number: 20 (DW_TAG_variable)
    <abd0e>   DW_AT_abstract_origin: <0xabd34>
    <abd12>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (rax))
 <4><abd14>: Abbrev Number: 0
 <3><abd15>: Abbrev Number: 0
 <2><abd16>: Abbrev Number: 0
 <1><abd17>: Abbrev Number: 39 (DW_TAG_subprogram)
    <abd18>   DW_AT_external    : 1
    <abd18>   DW_AT_name        : (indirect string, offset: 0x1b34c): fb_FileEofEx
    <abd1c>   DW_AT_decl_file   : 1
    <abd1d>   DW_AT_decl_line   : 6
    <abd1e>   DW_AT_decl_column : 5
    <abd1f>   DW_AT_prototyped  : 1
    <abd1f>   DW_AT_type        : <0xab1d8>
    <abd23>   DW_AT_inline      : 1	(inlined)
    <abd24>   DW_AT_sibling     : <0xabd41>
 <2><abd28>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <abd29>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <abd2d>   DW_AT_decl_file   : 1
    <abd2e>   DW_AT_decl_line   : 6
    <abd2f>   DW_AT_decl_column : 28
    <abd30>   DW_AT_type        : <0xab69f>
 <2><abd34>: Abbrev Number: 41 (DW_TAG_variable)
    <abd35>   DW_AT_name        : res
    <abd39>   DW_AT_decl_file   : 1
    <abd3a>   DW_AT_decl_line   : 8
    <abd3b>   DW_AT_decl_column : 9
    <abd3c>   DW_AT_type        : <0xab1d8>
 <2><abd40>: Abbrev Number: 0
 <1><abd41>: Abbrev Number: 42 (DW_TAG_subprogram)
    <abd42>   DW_AT_abstract_origin: <0xabd17>
    <abd46>   DW_AT_low_pc      : 0x46db80
    <abd4e>   DW_AT_high_pc     : 0x2e
    <abd56>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <abd58>   DW_AT_call_all_calls: 1
 <2><abd58>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <abd59>   DW_AT_abstract_origin: <0xabd28>
    <abd5d>   DW_AT_location    : 0x33a0f (location list)
    <abd61>   DW_AT_GNU_locviews: 0x33a09
 <2><abd65>: Abbrev Number: 20 (DW_TAG_variable)
    <abd66>   DW_AT_abstract_origin: <0xabd34>
    <abd6a>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (rax))
 <2><abd6c>: Abbrev Number: 43 (DW_TAG_call_site)
    <abd6d>   DW_AT_call_return_pc: 0x46db9f
    <abd75>   DW_AT_call_tail_call: 1
 <3><abd75>: Abbrev Number: 44 (DW_TAG_call_site_parameter)
    <abd76>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <abd78>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><abd7c>: Abbrev Number: 0
 <2><abd7d>: Abbrev Number: 0
 <1><abd7e>: Abbrev Number: 0
  Compilation Unit @ offset 0xabd7f:
   Length:        0xb84 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xaffd
   Pointer Size:  8
 <0><abd8b>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <abd8c>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <abd90>   DW_AT_language    : 29	(C11)
    <abd91>   DW_AT_name        : (indirect line string, offset: 0xc2c): src/rtlib/file_free.c
    <abd95>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <abd99>   DW_AT_low_pc      : 0x46dc30
    <abda1>   DW_AT_high_pc     : 0x37
    <abda9>   DW_AT_stmt_list   : 0x62666
 <1><abdad>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdae>   DW_AT_byte_size   : 1
    <abdaf>   DW_AT_encoding    : 8	(unsigned char)
    <abdb0>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><abdb4>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdb5>   DW_AT_byte_size   : 2
    <abdb6>   DW_AT_encoding    : 7	(unsigned)
    <abdb7>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><abdbb>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdbc>   DW_AT_byte_size   : 4
    <abdbd>   DW_AT_encoding    : 7	(unsigned)
    <abdbe>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><abdc2>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdc3>   DW_AT_byte_size   : 8
    <abdc4>   DW_AT_encoding    : 7	(unsigned)
    <abdc5>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><abdc9>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdca>   DW_AT_byte_size   : 1
    <abdcb>   DW_AT_encoding    : 6	(signed char)
    <abdcc>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><abdd0>: Abbrev Number: 6 (DW_TAG_base_type)
    <abdd1>   DW_AT_byte_size   : 2
    <abdd2>   DW_AT_encoding    : 5	(signed)
    <abdd3>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><abdd7>: Abbrev Number: 20 (DW_TAG_base_type)
    <abdd8>   DW_AT_byte_size   : 4
    <abdd9>   DW_AT_encoding    : 5	(signed)
    <abdda>   DW_AT_name        : int
 <1><abdde>: Abbrev Number: 6 (DW_TAG_base_type)
    <abddf>   DW_AT_byte_size   : 8
    <abde0>   DW_AT_encoding    : 5	(signed)
    <abde1>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><abde5>: Abbrev Number: 3 (DW_TAG_typedef)
    <abde6>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <abdea>   DW_AT_decl_file   : 2
    <abdeb>   DW_AT_decl_line   : 153
    <abdec>   DW_AT_decl_column : 27
    <abded>   DW_AT_type        : <0xabdde>
 <1><abdf1>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <abdf2>   DW_AT_byte_size   : 8
 <1><abdf3>: Abbrev Number: 3 (DW_TAG_typedef)
    <abdf4>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <abdf8>   DW_AT_decl_file   : 2
    <abdf9>   DW_AT_decl_line   : 194
    <abdfa>   DW_AT_decl_column : 27
    <abdfb>   DW_AT_type        : <0xabdde>
 <1><abdff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abe00>   DW_AT_byte_size   : 8
    <abe00>   DW_AT_type        : <0xabe04>
 <1><abe04>: Abbrev Number: 6 (DW_TAG_base_type)
    <abe05>   DW_AT_byte_size   : 1
    <abe06>   DW_AT_encoding    : 6	(signed char)
    <abe07>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><abe0b>: Abbrev Number: 3 (DW_TAG_typedef)
    <abe0c>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <abe10>   DW_AT_decl_file   : 3
    <abe11>   DW_AT_decl_line   : 209
    <abe12>   DW_AT_decl_column : 23
    <abe13>   DW_AT_type        : <0xabdc2>
 <1><abe17>: Abbrev Number: 13 (DW_TAG_typedef)
    <abe18>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <abe1c>   DW_AT_decl_file   : 3
    <abe1d>   DW_AT_decl_line   : 321
    <abe1f>   DW_AT_decl_column : 24
    <abe20>   DW_AT_type        : <0xabdd7>
 <1><abe24>: Abbrev Number: 22 (DW_TAG_const_type)
    <abe25>   DW_AT_type        : <0xabe17>
 <1><abe29>: Abbrev Number: 6 (DW_TAG_base_type)
    <abe2a>   DW_AT_byte_size   : 8
    <abe2b>   DW_AT_encoding    : 5	(signed)
    <abe2c>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><abe30>: Abbrev Number: 3 (DW_TAG_typedef)
    <abe31>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <abe35>   DW_AT_decl_file   : 4
    <abe36>   DW_AT_decl_line   : 87
    <abe37>   DW_AT_decl_column : 19
    <abe38>   DW_AT_type        : <0xabde5>
 <1><abe3c>: Abbrev Number: 3 (DW_TAG_typedef)
    <abe3d>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <abe41>   DW_AT_decl_file   : 4
    <abe42>   DW_AT_decl_line   : 108
    <abe43>   DW_AT_decl_column : 19
    <abe44>   DW_AT_type        : <0xabdf3>
 <1><abe48>: Abbrev Number: 6 (DW_TAG_base_type)
    <abe49>   DW_AT_byte_size   : 8
    <abe4a>   DW_AT_encoding    : 7	(unsigned)
    <abe4b>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><abe4f>: Abbrev Number: 14 (DW_TAG_array_type)
    <abe50>   DW_AT_type        : <0xabe04>
    <abe54>   DW_AT_sibling     : <0xabe5f>
 <2><abe58>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <abe59>   DW_AT_type        : <0xabdc2>
    <abe5d>   DW_AT_upper_bound : 3
 <2><abe5e>: Abbrev Number: 0
 <1><abe5f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abe60>   DW_AT_byte_size   : 8
    <abe60>   DW_AT_type        : <0xabe64>
 <1><abe64>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><abe65>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abe66>   DW_AT_byte_size   : 8
    <abe66>   DW_AT_type        : <0xabdff>
 <1><abe6a>: Abbrev Number: 3 (DW_TAG_typedef)
    <abe6b>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <abe6f>   DW_AT_decl_file   : 5
    <abe70>   DW_AT_decl_line   : 22
    <abe71>   DW_AT_decl_column : 15
    <abe72>   DW_AT_type        : <0xabe30>
 <1><abe76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abe77>   DW_AT_byte_size   : 8
    <abe77>   DW_AT_type        : <0xabe7b>
 <1><abe7b>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <abe7c>   DW_AT_prototyped  : 1
 <1><abe7c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <abe7d>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <abe81>   DW_AT_byte_size   : 24
    <abe82>   DW_AT_decl_file   : 6
    <abe83>   DW_AT_decl_line   : 82
    <abe84>   DW_AT_decl_column : 16
    <abe85>   DW_AT_sibling     : <0xabeb1>
 <2><abe89>: Abbrev Number: 2 (DW_TAG_member)
    <abe8a>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <abe8e>   DW_AT_decl_file   : 6
    <abe8f>   DW_AT_decl_line   : 83
    <abe90>   DW_AT_decl_column : 21
    <abe91>   DW_AT_type        : <0xabdff>
    <abe95>   DW_AT_data_member_location: 0
 <2><abe96>: Abbrev Number: 7 (DW_TAG_member)
    <abe97>   DW_AT_name        : len
    <abe9b>   DW_AT_decl_file   : 6
    <abe9c>   DW_AT_decl_line   : 84
    <abe9d>   DW_AT_decl_column : 21
    <abe9e>   DW_AT_type        : <0xabe3c>
    <abea2>   DW_AT_data_member_location: 8
 <2><abea3>: Abbrev Number: 2 (DW_TAG_member)
    <abea4>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <abea8>   DW_AT_decl_file   : 6
    <abea9>   DW_AT_decl_line   : 85
    <abeaa>   DW_AT_decl_column : 21
    <abeab>   DW_AT_type        : <0xabe3c>
    <abeaf>   DW_AT_data_member_location: 16
 <2><abeb0>: Abbrev Number: 0
 <1><abeb1>: Abbrev Number: 3 (DW_TAG_typedef)
    <abeb2>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <abeb6>   DW_AT_decl_file   : 6
    <abeb7>   DW_AT_decl_line   : 86
    <abeb8>   DW_AT_decl_column : 3
    <abeb9>   DW_AT_type        : <0xabe7c>
 <1><abebd>: Abbrev Number: 6 (DW_TAG_base_type)
    <abebe>   DW_AT_byte_size   : 8
    <abebf>   DW_AT_encoding    : 4	(float)
    <abec0>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><abec4>: Abbrev Number: 6 (DW_TAG_base_type)
    <abec5>   DW_AT_byte_size   : 4
    <abec6>   DW_AT_encoding    : 4	(float)
    <abec7>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><abecb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abecc>   DW_AT_byte_size   : 8
    <abecc>   DW_AT_type        : <0xabe17>
 <1><abed0>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <abed1>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <abed5>   DW_AT_encoding    : 7	(unsigned)
    <abed6>   DW_AT_byte_size   : 4
    <abed7>   DW_AT_type        : <0xabdbb>
    <abedb>   DW_AT_decl_file   : 7
    <abedc>   DW_AT_decl_line   : 25
    <abedd>   DW_AT_decl_column : 14
    <abede>   DW_AT_sibling     : <0xabefb>
 <2><abee2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <abee3>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <abee7>   DW_AT_const_value : 0
 <2><abee8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <abee9>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <abeed>   DW_AT_const_value : 1
 <2><abeee>: Abbrev Number: 11 (DW_TAG_enumerator)
    <abeef>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <abef3>   DW_AT_const_value : 2
 <2><abef4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <abef5>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <abef9>   DW_AT_const_value : 3
 <2><abefa>: Abbrev Number: 0
 <1><abefb>: Abbrev Number: 3 (DW_TAG_typedef)
    <abefc>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <abf00>   DW_AT_decl_file   : 7
    <abf01>   DW_AT_decl_line   : 30
    <abf02>   DW_AT_decl_column : 3
    <abf03>   DW_AT_type        : <0xabed0>
 <1><abf07>: Abbrev Number: 3 (DW_TAG_typedef)
    <abf08>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <abf0c>   DW_AT_decl_file   : 7
    <abf0d>   DW_AT_decl_line   : 54
    <abf0e>   DW_AT_decl_column : 15
    <abf0f>   DW_AT_type        : <0xabf13>
 <1><abf13>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abf14>   DW_AT_byte_size   : 8
    <abf14>   DW_AT_type        : <0xabf18>
 <1><abf18>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <abf19>   DW_AT_prototyped  : 1
    <abf19>   DW_AT_type        : <0xabdd7>
    <abf1d>   DW_AT_sibling     : <0xabf2c>
 <2><abf21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <abf22>   DW_AT_type        : <0xabf2c>
 <2><abf26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <abf27>   DW_AT_type        : <0xabdd7>
 <2><abf2b>: Abbrev Number: 0
 <1><abf2c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <abf2d>   DW_AT_byte_size   : 8
    <abf2d>   DW_AT_type        : <0xabf31>
 <1><abf31>: Abbrev Number: 8 (DW_TAG_structure_type)
    <abf32>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <abf36>   DW_AT_byte_size   : 80
    <abf37>   DW_AT_decl_file   : 7
    <abf38>   DW_AT_decl_line   : 97
    <abf39>   DW_AT_decl_column : 16
    <abf3a>   DW_AT_sibling     : <0xabff5>
 <2><abf3e>: Abbrev Number: 2 (DW_TAG_member)
    <abf3f>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <abf43>   DW_AT_decl_file   : 7
    <abf44>   DW_AT_decl_line   : 98
    <abf45>   DW_AT_decl_column : 21
    <abf46>   DW_AT_type        : <0xabdd7>
    <abf4a>   DW_AT_data_member_location: 0
 <2><abf4b>: Abbrev Number: 7 (DW_TAG_member)
    <abf4c>   DW_AT_name        : len
    <abf50>   DW_AT_decl_file   : 7
    <abf51>   DW_AT_decl_line   : 99
    <abf52>   DW_AT_decl_column : 21
    <abf53>   DW_AT_type        : <0xabdd7>
    <abf57>   DW_AT_data_member_location: 4
 <2><abf58>: Abbrev Number: 2 (DW_TAG_member)
    <abf59>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <abf5d>   DW_AT_decl_file   : 7
    <abf5e>   DW_AT_decl_line   : 100
    <abf5f>   DW_AT_decl_column : 21
    <abf60>   DW_AT_type        : <0xabefb>
    <abf64>   DW_AT_data_member_location: 8
 <2><abf65>: Abbrev Number: 2 (DW_TAG_member)
    <abf66>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <abf6a>   DW_AT_decl_file   : 7
    <abf6b>   DW_AT_decl_line   : 101
    <abf6c>   DW_AT_decl_column : 21
    <abf6d>   DW_AT_type        : <0xabe6a>
    <abf71>   DW_AT_data_member_location: 16
 <2><abf72>: Abbrev Number: 2 (DW_TAG_member)
    <abf73>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <abf77>   DW_AT_decl_file   : 7
    <abf78>   DW_AT_decl_line   : 102
    <abf79>   DW_AT_decl_column : 21
    <abf7a>   DW_AT_type        : <0xabdd7>
    <abf7e>   DW_AT_data_member_location: 24
 <2><abf7f>: Abbrev Number: 2 (DW_TAG_member)
    <abf80>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <abf84>   DW_AT_decl_file   : 7
    <abf85>   DW_AT_decl_line   : 103
    <abf86>   DW_AT_decl_column : 21
    <abf87>   DW_AT_type        : <0xabdd7>
    <abf8b>   DW_AT_data_member_location: 28
 <2><abf8c>: Abbrev Number: 2 (DW_TAG_member)
    <abf8d>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <abf91>   DW_AT_decl_file   : 7
    <abf92>   DW_AT_decl_line   : 104
    <abf93>   DW_AT_decl_column : 21
    <abf94>   DW_AT_type        : <0xabdd7>
    <abf98>   DW_AT_data_member_location: 32
 <2><abf99>: Abbrev Number: 2 (DW_TAG_member)
    <abf9a>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <abf9e>   DW_AT_decl_file   : 7
    <abf9f>   DW_AT_decl_line   : 105
    <abfa0>   DW_AT_decl_column : 21
    <abfa1>   DW_AT_type        : <0xabdbb>
    <abfa5>   DW_AT_data_member_location: 36
 <2><abfa6>: Abbrev Number: 2 (DW_TAG_member)
    <abfa7>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <abfab>   DW_AT_decl_file   : 7
    <abfac>   DW_AT_decl_line   : 106
    <abfad>   DW_AT_decl_column : 21
    <abfae>   DW_AT_type        : <0xabdbb>
    <abfb2>   DW_AT_data_member_location: 40
 <2><abfb3>: Abbrev Number: 2 (DW_TAG_member)
    <abfb4>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <abfb8>   DW_AT_decl_file   : 7
    <abfb9>   DW_AT_decl_line   : 109
    <abfba>   DW_AT_decl_column : 21
    <abfbb>   DW_AT_type        : <0xabe4f>
    <abfbf>   DW_AT_data_member_location: 44
 <2><abfc0>: Abbrev Number: 2 (DW_TAG_member)
    <abfc1>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <abfc5>   DW_AT_decl_file   : 7
    <abfc6>   DW_AT_decl_line   : 110
    <abfc7>   DW_AT_decl_column : 21
    <abfc8>   DW_AT_type        : <0xabe0b>
    <abfcc>   DW_AT_data_member_location: 48
 <2><abfcd>: Abbrev Number: 2 (DW_TAG_member)
    <abfce>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <abfd2>   DW_AT_decl_file   : 7
    <abfd3>   DW_AT_decl_line   : 112
    <abfd4>   DW_AT_decl_column : 22
    <abfd5>   DW_AT_type        : <0xac28d>
    <abfd9>   DW_AT_data_member_location: 56
 <2><abfda>: Abbrev Number: 2 (DW_TAG_member)
    <abfdb>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <abfdf>   DW_AT_decl_file   : 7
    <abfe0>   DW_AT_decl_line   : 114
    <abfe1>   DW_AT_decl_column : 14
    <abfe2>   DW_AT_type        : <0xabdf1>
    <abfe6>   DW_AT_data_member_location: 64
 <2><abfe7>: Abbrev Number: 2 (DW_TAG_member)
    <abfe8>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <abfec>   DW_AT_decl_file   : 7
    <abfed>   DW_AT_decl_line   : 116
    <abfee>   DW_AT_decl_column : 22
    <abfef>   DW_AT_type        : <0xabf2c>
    <abff3>   DW_AT_data_member_location: 72
 <2><abff4>: Abbrev Number: 0
 <1><abff5>: Abbrev Number: 3 (DW_TAG_typedef)
    <abff6>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <abffa>   DW_AT_decl_file   : 7
    <abffb>   DW_AT_decl_line   : 59
    <abffc>   DW_AT_decl_column : 15
    <abffd>   DW_AT_type        : <0xac001>
 <1><ac001>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac002>   DW_AT_byte_size   : 8
    <ac002>   DW_AT_type        : <0xac006>
 <1><ac006>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac007>   DW_AT_prototyped  : 1
    <ac007>   DW_AT_type        : <0xabdd7>
    <ac00b>   DW_AT_sibling     : <0xac015>
 <2><ac00f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac010>   DW_AT_type        : <0xabf2c>
 <2><ac014>: Abbrev Number: 0
 <1><ac015>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac016>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <ac01a>   DW_AT_decl_file   : 7
    <ac01b>   DW_AT_decl_line   : 60
    <ac01c>   DW_AT_decl_column : 15
    <ac01d>   DW_AT_type        : <0xac001>
 <1><ac021>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac022>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <ac026>   DW_AT_decl_file   : 7
    <ac027>   DW_AT_decl_line   : 61
    <ac028>   DW_AT_decl_column : 15
    <ac029>   DW_AT_type        : <0xac02d>
 <1><ac02d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac02e>   DW_AT_byte_size   : 8
    <ac02e>   DW_AT_type        : <0xac032>
 <1><ac032>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac033>   DW_AT_prototyped  : 1
    <ac033>   DW_AT_type        : <0xabdd7>
    <ac037>   DW_AT_sibling     : <0xac04b>
 <2><ac03b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac03c>   DW_AT_type        : <0xabf2c>
 <2><ac040>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac041>   DW_AT_type        : <0xabe6a>
 <2><ac045>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac046>   DW_AT_type        : <0xabdd7>
 <2><ac04a>: Abbrev Number: 0
 <1><ac04b>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac04c>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <ac050>   DW_AT_decl_file   : 7
    <ac051>   DW_AT_decl_line   : 62
    <ac052>   DW_AT_decl_column : 15
    <ac053>   DW_AT_type        : <0xac057>
 <1><ac057>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac058>   DW_AT_byte_size   : 8
    <ac058>   DW_AT_type        : <0xac05c>
 <1><ac05c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac05d>   DW_AT_prototyped  : 1
    <ac05d>   DW_AT_type        : <0xabdd7>
    <ac061>   DW_AT_sibling     : <0xac070>
 <2><ac065>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac066>   DW_AT_type        : <0xabf2c>
 <2><ac06a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac06b>   DW_AT_type        : <0xac070>
 <2><ac06f>: Abbrev Number: 0
 <1><ac070>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac071>   DW_AT_byte_size   : 8
    <ac071>   DW_AT_type        : <0xabe6a>
 <1><ac075>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac076>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <ac07a>   DW_AT_decl_file   : 7
    <ac07b>   DW_AT_decl_line   : 63
    <ac07c>   DW_AT_decl_column : 15
    <ac07d>   DW_AT_type        : <0xac081>
 <1><ac081>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac082>   DW_AT_byte_size   : 8
    <ac082>   DW_AT_type        : <0xac086>
 <1><ac086>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac087>   DW_AT_prototyped  : 1
    <ac087>   DW_AT_type        : <0xabdd7>
    <ac08b>   DW_AT_sibling     : <0xac09f>
 <2><ac08f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac090>   DW_AT_type        : <0xabf2c>
 <2><ac094>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac095>   DW_AT_type        : <0xabdf1>
 <2><ac099>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac09a>   DW_AT_type        : <0xac09f>
 <2><ac09e>: Abbrev Number: 0
 <1><ac09f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac0a0>   DW_AT_byte_size   : 8
    <ac0a0>   DW_AT_type        : <0xabe0b>
 <1><ac0a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac0a5>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <ac0a9>   DW_AT_decl_file   : 7
    <ac0aa>   DW_AT_decl_line   : 65
    <ac0ab>   DW_AT_decl_column : 15
    <ac0ac>   DW_AT_type        : <0xac0b0>
 <1><ac0b0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac0b1>   DW_AT_byte_size   : 8
    <ac0b1>   DW_AT_type        : <0xac0b5>
 <1><ac0b5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac0b6>   DW_AT_prototyped  : 1
    <ac0b6>   DW_AT_type        : <0xabdd7>
    <ac0ba>   DW_AT_sibling     : <0xac0ce>
 <2><ac0be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0bf>   DW_AT_type        : <0xabf2c>
 <2><ac0c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0c4>   DW_AT_type        : <0xabecb>
 <2><ac0c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0c9>   DW_AT_type        : <0xac09f>
 <2><ac0cd>: Abbrev Number: 0
 <1><ac0ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac0cf>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <ac0d3>   DW_AT_decl_file   : 7
    <ac0d4>   DW_AT_decl_line   : 67
    <ac0d5>   DW_AT_decl_column : 15
    <ac0d6>   DW_AT_type        : <0xac0da>
 <1><ac0da>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac0db>   DW_AT_byte_size   : 8
    <ac0db>   DW_AT_type        : <0xac0df>
 <1><ac0df>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac0e0>   DW_AT_prototyped  : 1
    <ac0e0>   DW_AT_type        : <0xabdd7>
    <ac0e4>   DW_AT_sibling     : <0xac0f8>
 <2><ac0e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0e9>   DW_AT_type        : <0xabf2c>
 <2><ac0ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0ee>   DW_AT_type        : <0xabe5f>
 <2><ac0f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac0f3>   DW_AT_type        : <0xabe0b>
 <2><ac0f7>: Abbrev Number: 0
 <1><ac0f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac0f9>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <ac0fd>   DW_AT_decl_file   : 7
    <ac0fe>   DW_AT_decl_line   : 69
    <ac0ff>   DW_AT_decl_column : 15
    <ac100>   DW_AT_type        : <0xac104>
 <1><ac104>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac105>   DW_AT_byte_size   : 8
    <ac105>   DW_AT_type        : <0xac109>
 <1><ac109>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac10a>   DW_AT_prototyped  : 1
    <ac10a>   DW_AT_type        : <0xabdd7>
    <ac10e>   DW_AT_sibling     : <0xac122>
 <2><ac112>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac113>   DW_AT_type        : <0xabf2c>
 <2><ac117>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac118>   DW_AT_type        : <0xac122>
 <2><ac11c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac11d>   DW_AT_type        : <0xabe0b>
 <2><ac121>: Abbrev Number: 0
 <1><ac122>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac123>   DW_AT_byte_size   : 8
    <ac123>   DW_AT_type        : <0xabe24>
 <1><ac127>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac128>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <ac12c>   DW_AT_decl_file   : 7
    <ac12d>   DW_AT_decl_line   : 71
    <ac12e>   DW_AT_decl_column : 15
    <ac12f>   DW_AT_type        : <0xac133>
 <1><ac133>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac134>   DW_AT_byte_size   : 8
    <ac134>   DW_AT_type        : <0xac138>
 <1><ac138>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac139>   DW_AT_prototyped  : 1
    <ac139>   DW_AT_type        : <0xabdd7>
    <ac13d>   DW_AT_sibling     : <0xac151>
 <2><ac141>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac142>   DW_AT_type        : <0xabf2c>
 <2><ac146>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac147>   DW_AT_type        : <0xabe6a>
 <2><ac14b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac14c>   DW_AT_type        : <0xabe6a>
 <2><ac150>: Abbrev Number: 0
 <1><ac151>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac152>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <ac156>   DW_AT_decl_file   : 7
    <ac157>   DW_AT_decl_line   : 73
    <ac158>   DW_AT_decl_column : 15
    <ac159>   DW_AT_type        : <0xac133>
 <1><ac15d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac15e>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <ac162>   DW_AT_decl_file   : 7
    <ac163>   DW_AT_decl_line   : 75
    <ac164>   DW_AT_decl_column : 15
    <ac165>   DW_AT_type        : <0xac169>
 <1><ac169>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac16a>   DW_AT_byte_size   : 8
    <ac16a>   DW_AT_type        : <0xac16e>
 <1><ac16e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac16f>   DW_AT_prototyped  : 1
    <ac16f>   DW_AT_type        : <0xabdd7>
    <ac173>   DW_AT_sibling     : <0xac182>
 <2><ac177>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac178>   DW_AT_type        : <0xabf2c>
 <2><ac17c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac17d>   DW_AT_type        : <0xac182>
 <2><ac181>: Abbrev Number: 0
 <1><ac182>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac183>   DW_AT_byte_size   : 8
    <ac183>   DW_AT_type        : <0xabeb1>
 <1><ac187>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac188>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <ac18c>   DW_AT_decl_file   : 7
    <ac18d>   DW_AT_decl_line   : 76
    <ac18e>   DW_AT_decl_column : 15
    <ac18f>   DW_AT_type        : <0xac193>
 <1><ac193>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac194>   DW_AT_byte_size   : 8
    <ac194>   DW_AT_type        : <0xac198>
 <1><ac198>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac199>   DW_AT_prototyped  : 1
    <ac199>   DW_AT_type        : <0xabdd7>
    <ac19d>   DW_AT_sibling     : <0xac1b1>
 <2><ac1a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac1a2>   DW_AT_type        : <0xabf2c>
 <2><ac1a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac1a7>   DW_AT_type        : <0xabecb>
 <2><ac1ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac1ac>   DW_AT_type        : <0xabe3c>
 <2><ac1b0>: Abbrev Number: 0
 <1><ac1b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac1b2>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <ac1b6>   DW_AT_decl_file   : 7
    <ac1b7>   DW_AT_decl_line   : 77
    <ac1b8>   DW_AT_decl_column : 15
    <ac1b9>   DW_AT_type        : <0xac001>
 <1><ac1bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac1be>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <ac1c2>   DW_AT_byte_size   : 112
    <ac1c3>   DW_AT_decl_file   : 7
    <ac1c4>   DW_AT_decl_line   : 80
    <ac1c5>   DW_AT_decl_column : 16
    <ac1c6>   DW_AT_sibling     : <0xac281>
 <2><ac1ca>: Abbrev Number: 2 (DW_TAG_member)
    <ac1cb>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <ac1cf>   DW_AT_decl_file   : 7
    <ac1d0>   DW_AT_decl_line   : 81
    <ac1d1>   DW_AT_decl_column : 25
    <ac1d2>   DW_AT_type        : <0xabff5>
    <ac1d6>   DW_AT_data_member_location: 0
 <2><ac1d7>: Abbrev Number: 2 (DW_TAG_member)
    <ac1d8>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <ac1dc>   DW_AT_decl_file   : 7
    <ac1dd>   DW_AT_decl_line   : 82
    <ac1de>   DW_AT_decl_column : 25
    <ac1df>   DW_AT_type        : <0xac015>
    <ac1e3>   DW_AT_data_member_location: 8
 <2><ac1e4>: Abbrev Number: 2 (DW_TAG_member)
    <ac1e5>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <ac1e9>   DW_AT_decl_file   : 7
    <ac1ea>   DW_AT_decl_line   : 83
    <ac1eb>   DW_AT_decl_column : 25
    <ac1ec>   DW_AT_type        : <0xac021>
    <ac1f0>   DW_AT_data_member_location: 16
 <2><ac1f1>: Abbrev Number: 2 (DW_TAG_member)
    <ac1f2>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <ac1f6>   DW_AT_decl_file   : 7
    <ac1f7>   DW_AT_decl_line   : 84
    <ac1f8>   DW_AT_decl_column : 25
    <ac1f9>   DW_AT_type        : <0xac04b>
    <ac1fd>   DW_AT_data_member_location: 24
 <2><ac1fe>: Abbrev Number: 2 (DW_TAG_member)
    <ac1ff>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <ac203>   DW_AT_decl_file   : 7
    <ac204>   DW_AT_decl_line   : 85
    <ac205>   DW_AT_decl_column : 25
    <ac206>   DW_AT_type        : <0xac075>
    <ac20a>   DW_AT_data_member_location: 32
 <2><ac20b>: Abbrev Number: 2 (DW_TAG_member)
    <ac20c>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <ac210>   DW_AT_decl_file   : 7
    <ac211>   DW_AT_decl_line   : 86
    <ac212>   DW_AT_decl_column : 25
    <ac213>   DW_AT_type        : <0xac0a4>
    <ac217>   DW_AT_data_member_location: 40
 <2><ac218>: Abbrev Number: 2 (DW_TAG_member)
    <ac219>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <ac21d>   DW_AT_decl_file   : 7
    <ac21e>   DW_AT_decl_line   : 87
    <ac21f>   DW_AT_decl_column : 25
    <ac220>   DW_AT_type        : <0xac0ce>
    <ac224>   DW_AT_data_member_location: 48
 <2><ac225>: Abbrev Number: 2 (DW_TAG_member)
    <ac226>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <ac22a>   DW_AT_decl_file   : 7
    <ac22b>   DW_AT_decl_line   : 88
    <ac22c>   DW_AT_decl_column : 25
    <ac22d>   DW_AT_type        : <0xac0f8>
    <ac231>   DW_AT_data_member_location: 56
 <2><ac232>: Abbrev Number: 2 (DW_TAG_member)
    <ac233>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <ac237>   DW_AT_decl_file   : 7
    <ac238>   DW_AT_decl_line   : 89
    <ac239>   DW_AT_decl_column : 25
    <ac23a>   DW_AT_type        : <0xac127>
    <ac23e>   DW_AT_data_member_location: 64
 <2><ac23f>: Abbrev Number: 2 (DW_TAG_member)
    <ac240>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <ac244>   DW_AT_decl_file   : 7
    <ac245>   DW_AT_decl_line   : 90
    <ac246>   DW_AT_decl_column : 25
    <ac247>   DW_AT_type        : <0xac151>
    <ac24b>   DW_AT_data_member_location: 72
 <2><ac24c>: Abbrev Number: 2 (DW_TAG_member)
    <ac24d>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <ac251>   DW_AT_decl_file   : 7
    <ac252>   DW_AT_decl_line   : 91
    <ac253>   DW_AT_decl_column : 25
    <ac254>   DW_AT_type        : <0xac15d>
    <ac258>   DW_AT_data_member_location: 80
 <2><ac259>: Abbrev Number: 2 (DW_TAG_member)
    <ac25a>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <ac25e>   DW_AT_decl_file   : 7
    <ac25f>   DW_AT_decl_line   : 92
    <ac260>   DW_AT_decl_column : 25
    <ac261>   DW_AT_type        : <0xac187>
    <ac265>   DW_AT_data_member_location: 88
 <2><ac266>: Abbrev Number: 2 (DW_TAG_member)
    <ac267>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <ac26b>   DW_AT_decl_file   : 7
    <ac26c>   DW_AT_decl_line   : 93
    <ac26d>   DW_AT_decl_column : 25
    <ac26e>   DW_AT_type        : <0xabf07>
    <ac272>   DW_AT_data_member_location: 96
 <2><ac273>: Abbrev Number: 2 (DW_TAG_member)
    <ac274>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <ac278>   DW_AT_decl_file   : 7
    <ac279>   DW_AT_decl_line   : 94
    <ac27a>   DW_AT_decl_column : 25
    <ac27b>   DW_AT_type        : <0xac1b1>
    <ac27f>   DW_AT_data_member_location: 104
 <2><ac280>: Abbrev Number: 0
 <1><ac281>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac282>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <ac286>   DW_AT_decl_file   : 7
    <ac287>   DW_AT_decl_line   : 95
    <ac288>   DW_AT_decl_column : 3
    <ac289>   DW_AT_type        : <0xac1bd>
 <1><ac28d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac28e>   DW_AT_byte_size   : 8
    <ac28e>   DW_AT_type        : <0xac281>
 <1><ac292>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac293>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <ac297>   DW_AT_decl_file   : 7
    <ac298>   DW_AT_decl_line   : 117
    <ac299>   DW_AT_decl_column : 3
    <ac29a>   DW_AT_type        : <0xabf31>
 <1><ac29e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac29f>   DW_AT_byte_size   : 8
    <ac29f>   DW_AT_type        : <0xac292>
 <1><ac2a3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ac2a4>   DW_AT_byte_size   : 8
    <ac2a5>   DW_AT_decl_file   : 8
    <ac2a5>   DW_AT_decl_line   : 4
    <ac2a6>   DW_AT_decl_column : 3
    <ac2a6>   DW_AT_sibling     : <0xac2c5>
 <2><ac2aa>: Abbrev Number: 2 (DW_TAG_member)
    <ac2ab>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <ac2af>   DW_AT_decl_file   : 8
    <ac2b0>   DW_AT_decl_line   : 5
    <ac2b1>   DW_AT_decl_column : 8
    <ac2b2>   DW_AT_type        : <0xabdd7>
    <ac2b6>   DW_AT_data_member_location: 0
 <2><ac2b7>: Abbrev Number: 2 (DW_TAG_member)
    <ac2b8>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <ac2bc>   DW_AT_decl_file   : 8
    <ac2bd>   DW_AT_decl_line   : 6
    <ac2be>   DW_AT_decl_column : 8
    <ac2bf>   DW_AT_type        : <0xabdd7>
    <ac2c3>   DW_AT_data_member_location: 4
 <2><ac2c4>: Abbrev Number: 0
 <1><ac2c5>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ac2c6>   DW_AT_byte_size   : 16
    <ac2c7>   DW_AT_decl_file   : 8
    <ac2c7>   DW_AT_decl_line   : 8
    <ac2c8>   DW_AT_decl_column : 3
    <ac2c8>   DW_AT_sibling     : <0xac2fb>
 <2><ac2cc>: Abbrev Number: 7 (DW_TAG_member)
    <ac2cd>   DW_AT_name        : x
    <ac2cf>   DW_AT_decl_file   : 8
    <ac2d0>   DW_AT_decl_line   : 9
    <ac2d1>   DW_AT_decl_column : 8
    <ac2d2>   DW_AT_type        : <0xabdd7>
    <ac2d6>   DW_AT_data_member_location: 0
 <2><ac2d7>: Abbrev Number: 7 (DW_TAG_member)
    <ac2d8>   DW_AT_name        : y
    <ac2da>   DW_AT_decl_file   : 8
    <ac2db>   DW_AT_decl_line   : 9
    <ac2dc>   DW_AT_decl_column : 11
    <ac2dd>   DW_AT_type        : <0xabdd7>
    <ac2e1>   DW_AT_data_member_location: 4
 <2><ac2e2>: Abbrev Number: 7 (DW_TAG_member)
    <ac2e3>   DW_AT_name        : dx
    <ac2e6>   DW_AT_decl_file   : 8
    <ac2e7>   DW_AT_decl_line   : 10
    <ac2e8>   DW_AT_decl_column : 8
    <ac2e9>   DW_AT_type        : <0xabdd7>
    <ac2ed>   DW_AT_data_member_location: 8
 <2><ac2ee>: Abbrev Number: 7 (DW_TAG_member)
    <ac2ef>   DW_AT_name        : dy
    <ac2f2>   DW_AT_decl_file   : 8
    <ac2f3>   DW_AT_decl_line   : 10
    <ac2f4>   DW_AT_decl_column : 12
    <ac2f5>   DW_AT_type        : <0xabdd7>
    <ac2f9>   DW_AT_data_member_location: 12
 <2><ac2fa>: Abbrev Number: 0
 <1><ac2fb>: Abbrev Number: 27 (DW_TAG_union_type)
    <ac2fc>   DW_AT_byte_size   : 16
    <ac2fd>   DW_AT_decl_file   : 8
    <ac2fe>   DW_AT_decl_line   : 3
    <ac2ff>   DW_AT_decl_column : 2
    <ac300>   DW_AT_sibling     : <0xac32b>
 <2><ac304>: Abbrev Number: 16 (DW_TAG_member)
    <ac305>   DW_AT_type        : <0xac2a3>
 <2><ac309>: Abbrev Number: 16 (DW_TAG_member)
    <ac30a>   DW_AT_type        : <0xac2c5>
 <2><ac30e>: Abbrev Number: 28 (DW_TAG_member)
    <ac30f>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <ac313>   DW_AT_decl_file   : 8
    <ac314>   DW_AT_decl_line   : 12
    <ac315>   DW_AT_decl_column : 7
    <ac316>   DW_AT_type        : <0xabdd7>
 <2><ac31a>: Abbrev Number: 17 (DW_TAG_member)
    <ac31b>   DW_AT_name        : z
    <ac31d>   DW_AT_decl_file   : 8
    <ac31d>   DW_AT_decl_line   : 13
    <ac31e>   DW_AT_decl_column : 7
    <ac31e>   DW_AT_type        : <0xabdd7>
 <2><ac322>: Abbrev Number: 17 (DW_TAG_member)
    <ac323>   DW_AT_name        : w
    <ac325>   DW_AT_decl_file   : 8
    <ac325>   DW_AT_decl_line   : 14
    <ac326>   DW_AT_decl_column : 7
    <ac326>   DW_AT_type        : <0xabdd7>
 <2><ac32a>: Abbrev Number: 0
 <1><ac32b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac32c>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <ac330>   DW_AT_byte_size   : 20
    <ac331>   DW_AT_decl_file   : 8
    <ac332>   DW_AT_decl_line   : 1
    <ac333>   DW_AT_decl_column : 8
    <ac334>   DW_AT_sibling     : <0xac34c>
 <2><ac338>: Abbrev Number: 2 (DW_TAG_member)
    <ac339>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <ac33d>   DW_AT_decl_file   : 8
    <ac33e>   DW_AT_decl_line   : 2
    <ac33f>   DW_AT_decl_column : 6
    <ac340>   DW_AT_type        : <0xabdd7>
    <ac344>   DW_AT_data_member_location: 0
 <2><ac345>: Abbrev Number: 29 (DW_TAG_member)
    <ac346>   DW_AT_type        : <0xac2fb>
    <ac34a>   DW_AT_data_member_location: 4
 <2><ac34b>: Abbrev Number: 0
 <1><ac34c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac34d>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <ac351>   DW_AT_decl_file   : 8
    <ac352>   DW_AT_decl_line   : 18
    <ac353>   DW_AT_decl_column : 23
    <ac354>   DW_AT_type        : <0xac32b>
 <1><ac358>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac359>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <ac35d>   DW_AT_decl_file   : 9
    <ac35e>   DW_AT_decl_line   : 1
    <ac35f>   DW_AT_decl_column : 23
    <ac360>   DW_AT_type        : <0xac364>
 <1><ac364>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac365>   DW_AT_byte_size   : 8
    <ac365>   DW_AT_type        : <0xac369>
 <1><ac369>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <ac36a>   DW_AT_prototyped  : 1
    <ac36a>   DW_AT_type        : <0xac182>
 <1><ac36e>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac36f>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <ac373>   DW_AT_decl_file   : 9
    <ac374>   DW_AT_decl_line   : 2
    <ac375>   DW_AT_decl_column : 23
    <ac376>   DW_AT_type        : <0xac37a>
 <1><ac37a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac37b>   DW_AT_byte_size   : 8
    <ac37b>   DW_AT_type        : <0xac37f>
 <1><ac37f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <ac380>   DW_AT_prototyped  : 1
    <ac380>   DW_AT_type        : <0xabdd7>
 <1><ac384>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac385>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <ac389>   DW_AT_decl_file   : 9
    <ac38a>   DW_AT_decl_line   : 3
    <ac38b>   DW_AT_decl_column : 23
    <ac38c>   DW_AT_type        : <0xac37a>
 <1><ac390>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac391>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <ac395>   DW_AT_decl_file   : 9
    <ac396>   DW_AT_decl_line   : 10
    <ac397>   DW_AT_decl_column : 23
    <ac398>   DW_AT_type        : <0xac39c>
 <1><ac39c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac39d>   DW_AT_byte_size   : 8
    <ac39d>   DW_AT_type        : <0xac3a1>
 <1><ac3a1>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ac3a2>   DW_AT_prototyped  : 1
    <ac3a2>   DW_AT_sibling     : <0xac3ac>
 <2><ac3a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac3a7>   DW_AT_type        : <0xabdd7>
 <2><ac3ab>: Abbrev Number: 0
 <1><ac3ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac3ad>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <ac3b1>   DW_AT_decl_file   : 9
    <ac3b2>   DW_AT_decl_line   : 14
    <ac3b3>   DW_AT_decl_column : 23
    <ac3b4>   DW_AT_type        : <0xac3b8>
 <1><ac3b8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac3b9>   DW_AT_byte_size   : 8
    <ac3b9>   DW_AT_type        : <0xac3bd>
 <1><ac3bd>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac3be>   DW_AT_prototyped  : 1
    <ac3be>   DW_AT_type        : <0xabdd7>
    <ac3c2>   DW_AT_sibling     : <0xac3d6>
 <2><ac3c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac3c7>   DW_AT_type        : <0xabdd7>
 <2><ac3cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac3cc>   DW_AT_type        : <0xabdd7>
 <2><ac3d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac3d1>   DW_AT_type        : <0xabdd7>
 <2><ac3d5>: Abbrev Number: 0
 <1><ac3d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac3d7>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <ac3db>   DW_AT_decl_file   : 9
    <ac3dc>   DW_AT_decl_line   : 18
    <ac3dd>   DW_AT_decl_column : 23
    <ac3de>   DW_AT_type        : <0xac3b8>
 <1><ac3e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac3e3>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <ac3e7>   DW_AT_decl_file   : 9
    <ac3e8>   DW_AT_decl_line   : 24
    <ac3e9>   DW_AT_decl_column : 23
    <ac3ea>   DW_AT_type        : <0xabe76>
 <1><ac3ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac3ef>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <ac3f3>   DW_AT_decl_file   : 9
    <ac3f4>   DW_AT_decl_line   : 28
    <ac3f5>   DW_AT_decl_column : 23
    <ac3f6>   DW_AT_type        : <0xac3fa>
 <1><ac3fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac3fb>   DW_AT_byte_size   : 8
    <ac3fb>   DW_AT_type        : <0xac3ff>
 <1><ac3ff>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac400>   DW_AT_prototyped  : 1
    <ac400>   DW_AT_type        : <0xabdd7>
    <ac404>   DW_AT_sibling     : <0xac413>
 <2><ac408>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac409>   DW_AT_type        : <0xabdd7>
 <2><ac40d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac40e>   DW_AT_type        : <0xabdd7>
 <2><ac412>: Abbrev Number: 0
 <1><ac413>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac414>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <ac418>   DW_AT_decl_file   : 9
    <ac419>   DW_AT_decl_line   : 34
    <ac41a>   DW_AT_decl_column : 23
    <ac41b>   DW_AT_type        : <0xac37a>
 <1><ac41f>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac420>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <ac424>   DW_AT_decl_file   : 9
    <ac425>   DW_AT_decl_line   : 35
    <ac426>   DW_AT_decl_column : 23
    <ac427>   DW_AT_type        : <0xac37a>
 <1><ac42b>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac42c>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <ac430>   DW_AT_decl_file   : 9
    <ac431>   DW_AT_decl_line   : 36
    <ac432>   DW_AT_decl_column : 23
    <ac433>   DW_AT_type        : <0xac437>
 <1><ac437>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac438>   DW_AT_byte_size   : 8
    <ac438>   DW_AT_type        : <0xac43c>
 <1><ac43c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ac43d>   DW_AT_prototyped  : 1
    <ac43d>   DW_AT_sibling     : <0xac44c>
 <2><ac441>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac442>   DW_AT_type        : <0xac44c>
 <2><ac446>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac447>   DW_AT_type        : <0xac44c>
 <2><ac44b>: Abbrev Number: 0
 <1><ac44c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac44d>   DW_AT_byte_size   : 8
    <ac44d>   DW_AT_type        : <0xabdd7>
 <1><ac451>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac452>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <ac456>   DW_AT_decl_file   : 9
    <ac457>   DW_AT_decl_line   : 37
    <ac458>   DW_AT_decl_column : 23
    <ac459>   DW_AT_type        : <0xac437>
 <1><ac45d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac45e>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <ac462>   DW_AT_decl_file   : 9
    <ac463>   DW_AT_decl_line   : 45
    <ac464>   DW_AT_decl_column : 24
    <ac465>   DW_AT_type        : <0xac469>
 <1><ac469>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac46a>   DW_AT_byte_size   : 8
    <ac46a>   DW_AT_type        : <0xac46e>
 <1><ac46e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac46f>   DW_AT_prototyped  : 1
    <ac46f>   DW_AT_type        : <0xabdbb>
    <ac473>   DW_AT_sibling     : <0xac487>
 <2><ac477>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac478>   DW_AT_type        : <0xabdd7>
 <2><ac47c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac47d>   DW_AT_type        : <0xabdd7>
 <2><ac481>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac482>   DW_AT_type        : <0xabdd7>
 <2><ac486>: Abbrev Number: 0
 <1><ac487>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac488>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <ac48c>   DW_AT_decl_file   : 9
    <ac48d>   DW_AT_decl_line   : 48
    <ac48e>   DW_AT_decl_column : 23
    <ac48f>   DW_AT_type        : <0xac493>
 <1><ac493>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac494>   DW_AT_byte_size   : 8
    <ac494>   DW_AT_type        : <0xac498>
 <1><ac498>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ac499>   DW_AT_prototyped  : 1
    <ac499>   DW_AT_sibling     : <0xac4ad>
 <2><ac49d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac49e>   DW_AT_type        : <0xabe5f>
 <2><ac4a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4a3>   DW_AT_type        : <0xabe0b>
 <2><ac4a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4a8>   DW_AT_type        : <0xabdd7>
 <2><ac4ac>: Abbrev Number: 0
 <1><ac4ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac4ae>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <ac4b2>   DW_AT_decl_file   : 9
    <ac4b3>   DW_AT_decl_line   : 49
    <ac4b4>   DW_AT_decl_column : 23
    <ac4b5>   DW_AT_type        : <0xac4b9>
 <1><ac4b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac4ba>   DW_AT_byte_size   : 8
    <ac4ba>   DW_AT_type        : <0xac4be>
 <1><ac4be>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <ac4bf>   DW_AT_prototyped  : 1
    <ac4bf>   DW_AT_sibling     : <0xac4d3>
 <2><ac4c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4c4>   DW_AT_type        : <0xac122>
 <2><ac4c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4c9>   DW_AT_type        : <0xabe0b>
 <2><ac4cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4ce>   DW_AT_type        : <0xabdd7>
 <2><ac4d2>: Abbrev Number: 0
 <1><ac4d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac4d4>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <ac4d8>   DW_AT_decl_file   : 9
    <ac4d9>   DW_AT_decl_line   : 51
    <ac4da>   DW_AT_decl_column : 24
    <ac4db>   DW_AT_type        : <0xac4df>
 <1><ac4df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac4e0>   DW_AT_byte_size   : 8
    <ac4e0>   DW_AT_type        : <0xac4e4>
 <1><ac4e4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac4e5>   DW_AT_prototyped  : 1
    <ac4e5>   DW_AT_type        : <0xabdff>
    <ac4e9>   DW_AT_sibling     : <0xac4f8>
 <2><ac4ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4ee>   DW_AT_type        : <0xabdff>
 <2><ac4f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac4f3>   DW_AT_type        : <0xabe3c>
 <2><ac4f7>: Abbrev Number: 0
 <1><ac4f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac4f9>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <ac4fd>   DW_AT_decl_file   : 9
    <ac4fe>   DW_AT_decl_line   : 54
    <ac4ff>   DW_AT_decl_column : 23
    <ac500>   DW_AT_type        : <0xac504>
 <1><ac504>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac505>   DW_AT_byte_size   : 8
    <ac505>   DW_AT_type        : <0xac509>
 <1><ac509>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac50a>   DW_AT_prototyped  : 1
    <ac50a>   DW_AT_type        : <0xabdd7>
    <ac50e>   DW_AT_sibling     : <0xac531>
 <2><ac512>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac513>   DW_AT_type        : <0xac182>
 <2><ac517>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac518>   DW_AT_type        : <0xabdf1>
 <2><ac51c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac51d>   DW_AT_type        : <0xabe3c>
 <2><ac521>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac522>   DW_AT_type        : <0xabdd7>
 <2><ac526>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac527>   DW_AT_type        : <0xabdd7>
 <2><ac52b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac52c>   DW_AT_type        : <0xabdd7>
 <2><ac530>: Abbrev Number: 0
 <1><ac531>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac532>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <ac536>   DW_AT_decl_file   : 9
    <ac537>   DW_AT_decl_line   : 56
    <ac538>   DW_AT_decl_column : 23
    <ac539>   DW_AT_type        : <0xac53d>
 <1><ac53d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac53e>   DW_AT_byte_size   : 8
    <ac53e>   DW_AT_type        : <0xac542>
 <1><ac542>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac543>   DW_AT_prototyped  : 1
    <ac543>   DW_AT_type        : <0xabdd7>
    <ac547>   DW_AT_sibling     : <0xac565>
 <2><ac54b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac54c>   DW_AT_type        : <0xac122>
 <2><ac550>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac551>   DW_AT_type        : <0xabecb>
 <2><ac555>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac556>   DW_AT_type        : <0xabe3c>
 <2><ac55a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac55b>   DW_AT_type        : <0xabdd7>
 <2><ac55f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac560>   DW_AT_type        : <0xabdd7>
 <2><ac564>: Abbrev Number: 0
 <1><ac565>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac566>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <ac56a>   DW_AT_decl_file   : 9
    <ac56b>   DW_AT_decl_line   : 67
    <ac56c>   DW_AT_decl_column : 23
    <ac56d>   DW_AT_type        : <0xac571>
 <1><ac571>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac572>   DW_AT_byte_size   : 8
    <ac572>   DW_AT_type        : <0xac576>
 <1><ac576>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac577>   DW_AT_prototyped  : 1
    <ac577>   DW_AT_type        : <0xabdd7>
    <ac57b>   DW_AT_sibling     : <0xac585>
 <2><ac57f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac580>   DW_AT_type        : <0xabdd7>
 <2><ac584>: Abbrev Number: 0
 <1><ac585>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac586>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <ac58a>   DW_AT_decl_file   : 9
    <ac58b>   DW_AT_decl_line   : 68
    <ac58c>   DW_AT_decl_column : 23
    <ac58d>   DW_AT_type        : <0xac591>
 <1><ac591>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac592>   DW_AT_byte_size   : 8
    <ac592>   DW_AT_type        : <0xac596>
 <1><ac596>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac597>   DW_AT_prototyped  : 1
    <ac597>   DW_AT_type        : <0xabdd7>
    <ac59b>   DW_AT_sibling     : <0xac5b9>
 <2><ac59f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5a0>   DW_AT_type        : <0xac44c>
 <2><ac5a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5a5>   DW_AT_type        : <0xac44c>
 <2><ac5a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5aa>   DW_AT_type        : <0xac44c>
 <2><ac5ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5af>   DW_AT_type        : <0xac44c>
 <2><ac5b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5b4>   DW_AT_type        : <0xac44c>
 <2><ac5b8>: Abbrev Number: 0
 <1><ac5b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac5ba>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <ac5be>   DW_AT_decl_file   : 9
    <ac5bf>   DW_AT_decl_line   : 69
    <ac5c0>   DW_AT_decl_column : 23
    <ac5c1>   DW_AT_type        : <0xac5c5>
 <1><ac5c5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac5c6>   DW_AT_byte_size   : 8
    <ac5c6>   DW_AT_type        : <0xac5ca>
 <1><ac5ca>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac5cb>   DW_AT_prototyped  : 1
    <ac5cb>   DW_AT_type        : <0xabdd7>
    <ac5cf>   DW_AT_sibling     : <0xac5e8>
 <2><ac5d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5d4>   DW_AT_type        : <0xabdd7>
 <2><ac5d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5d9>   DW_AT_type        : <0xabdd7>
 <2><ac5dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5de>   DW_AT_type        : <0xabdd7>
 <2><ac5e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac5e3>   DW_AT_type        : <0xabdd7>
 <2><ac5e7>: Abbrev Number: 0
 <1><ac5e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac5e9>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <ac5ed>   DW_AT_decl_file   : 9
    <ac5ee>   DW_AT_decl_line   : 73
    <ac5ef>   DW_AT_decl_column : 23
    <ac5f0>   DW_AT_type        : <0xac5f4>
 <1><ac5f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac5f5>   DW_AT_byte_size   : 8
    <ac5f5>   DW_AT_type        : <0xac5f9>
 <1><ac5f9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac5fa>   DW_AT_prototyped  : 1
    <ac5fa>   DW_AT_type        : <0xabdd7>
    <ac5fe>   DW_AT_sibling     : <0xac608>
 <2><ac602>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac603>   DW_AT_type        : <0xabdb4>
 <2><ac607>: Abbrev Number: 0
 <1><ac608>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac609>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <ac60d>   DW_AT_decl_file   : 9
    <ac60e>   DW_AT_decl_line   : 74
    <ac60f>   DW_AT_decl_column : 23
    <ac610>   DW_AT_type        : <0xac614>
 <1><ac614>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ac615>   DW_AT_byte_size   : 8
    <ac615>   DW_AT_type        : <0xac619>
 <1><ac619>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <ac61a>   DW_AT_prototyped  : 1
    <ac61a>   DW_AT_type        : <0xabdd7>
    <ac61e>   DW_AT_sibling     : <0xac62d>
 <2><ac622>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac623>   DW_AT_type        : <0xabdb4>
 <2><ac627>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ac628>   DW_AT_type        : <0xabdad>
 <2><ac62c>: Abbrev Number: 0
 <1><ac62d>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac62e>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <ac632>   DW_AT_decl_file   : 9
    <ac633>   DW_AT_decl_line   : 80
    <ac634>   DW_AT_decl_column : 23
    <ac635>   DW_AT_type        : <0xac39c>
 <1><ac639>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac63a>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <ac63e>   DW_AT_decl_file   : 9
    <ac63f>   DW_AT_decl_line   : 83
    <ac640>   DW_AT_decl_column : 23
    <ac641>   DW_AT_type        : <0xac571>
 <1><ac645>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac646>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <ac64a>   DW_AT_decl_file   : 9
    <ac64b>   DW_AT_decl_line   : 86
    <ac64c>   DW_AT_decl_column : 23
    <ac64d>   DW_AT_type        : <0xac3fa>
 <1><ac651>: Abbrev Number: 3 (DW_TAG_typedef)
