    <30d>   DW_AT_decl_line   : 206
    <30e>   DW_AT_decl_column : 16
    <30f>   DW_AT_type        : <0x313>
 <1><313>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <314>   DW_AT_byte_size   : 8
    <314>   DW_AT_type        : <0x318>
 <1><318>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <319>   DW_AT_prototyped  : 1
    <319>   DW_AT_sibling     : <0x32d>
 <2><31d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <31e>   DW_AT_type        : <0x92>
 <2><322>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <323>   DW_AT_type        : <0x92>
 <2><327>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <328>   DW_AT_type        : <0x32d>
 <2><32c>: Abbrev Number: 0
 <1><32d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <32e>   DW_AT_byte_size   : 8
    <32e>   DW_AT_type        : <0x31>
 <1><332>: Abbrev Number: 26 (DW_TAG_typedef)
    <333>   DW_AT_name        : (indirect string, offset: 0x5f92): tmp$96
    <337>   DW_AT_decl_file   : 2
    <338>   DW_AT_decl_line   : 208
    <339>   DW_AT_decl_column : 16
    <33a>   DW_AT_type        : <0x33e>
 <1><33e>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <33f>   DW_AT_byte_size   : 8
    <33f>   DW_AT_type        : <0x343>
 <1><343>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <344>   DW_AT_prototyped  : 1
    <344>   DW_AT_sibling     : <0x362>
 <2><348>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <349>   DW_AT_type        : <0x92>
 <2><34d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <34e>   DW_AT_type        : <0x31>
 <2><352>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <353>   DW_AT_type        : <0x31>
 <2><357>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <358>   DW_AT_type        : <0x31>
 <2><35c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <35d>   DW_AT_type        : <0x31>
 <2><361>: Abbrev Number: 0
 <1><362>: Abbrev Number: 54 (DW_TAG_structure_type)
    <363>   DW_AT_name        : (indirect string, offset: 0x1282c): $9SHADERTOY
    <367>   DW_AT_byte_size   : 32
    <368>   DW_AT_decl_file   : 2
    <369>   DW_AT_decl_line   : 209
    <36a>   DW_AT_decl_column : 8
    <36b>   DW_AT_sibling     : <0x397>
 <2><36f>: Abbrev Number: 22 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0x9da): FRAGMENTSHADER
    <374>   DW_AT_decl_file   : 2
    <375>   DW_AT_decl_line   : 210
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0x9e>
    <37b>   DW_AT_data_member_location: 0
 <2><37c>: Abbrev Number: 22 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xe99): PROGRAMOBJECT
    <381>   DW_AT_decl_file   : 2
    <382>   DW_AT_decl_line   : 211
    <383>   DW_AT_decl_column : 9
    <384>   DW_AT_type        : <0x9e>
    <388>   DW_AT_data_member_location: 4
 <2><389>: Abbrev Number: 22 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x8605): SHADERLOG
    <38e>   DW_AT_decl_file   : 2
    <38f>   DW_AT_decl_line   : 212
    <390>   DW_AT_decl_column : 11
    <391>   DW_AT_type        : <0x113>
    <395>   DW_AT_data_member_location: 8
 <2><396>: Abbrev Number: 0
 <1><397>: Abbrev Number: 82 (DW_TAG_structure_type)
    <398>   DW_AT_name        : (indirect string, offset: 0x111fa): $8MEMORY_T
    <39c>   DW_AT_byte_size   : 0x8083608
    <3a0>   DW_AT_decl_file   : 2
    <3a1>   DW_AT_decl_line   : 224
    <3a2>   DW_AT_decl_column : 8
    <3a3>   DW_AT_sibling     : <0x40b>
 <2><3a7>: Abbrev Number: 22 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0xca3b): MEM64
    <3ac>   DW_AT_decl_file   : 2
    <3ad>   DW_AT_decl_line   : 225
    <3ae>   DW_AT_decl_column : 9
    <3af>   DW_AT_type        : <0x40b>
    <3b3>   DW_AT_data_member_location: 0
 <2><3b4>: Abbrev Number: 55 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x670e): KERNAL
    <3b9>   DW_AT_decl_file   : 2
    <3b9>   DW_AT_decl_line   : 226
    <3ba>   DW_AT_decl_column : 9
    <3ba>   DW_AT_type        : <0x41e>
    <3be>   DW_AT_data_member_location: 0x8000000
 <2><3c2>: Abbrev Number: 55 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x3e14): BASIC
    <3c7>   DW_AT_decl_file   : 2
    <3c7>   DW_AT_decl_line   : 227
    <3c8>   DW_AT_decl_column : 9
    <3c8>   DW_AT_type        : <0x41e>
    <3cc>   DW_AT_data_member_location: 0x8020000
 <2><3d0>: Abbrev Number: 55 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x162b4): CHAR
    <3d5>   DW_AT_decl_file   : 2
    <3d5>   DW_AT_decl_line   : 228
    <3d6>   DW_AT_decl_column : 9
    <3d6>   DW_AT_type        : <0x42f>
    <3da>   DW_AT_data_member_location: 0x8040000
 <2><3de>: Abbrev Number: 83 (DW_TAG_member)
    <3df>   DW_AT_name        : COL
    <3e3>   DW_AT_decl_file   : 2
    <3e4>   DW_AT_decl_line   : 229
    <3e5>   DW_AT_decl_column : 9
    <3e6>   DW_AT_type        : <0x440>
    <3ea>   DW_AT_data_member_location: 0x807ff88
 <2><3ee>: Abbrev Number: 55 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0xf800): SINTABLE
    <3f3>   DW_AT_decl_file   : 2
    <3f3>   DW_AT_decl_line   : 230
    <3f4>   DW_AT_decl_column : 9
    <3f4>   DW_AT_type        : <0x451>
    <3f8>   DW_AT_data_member_location: 0x8081f88
 <2><3fc>: Abbrev Number: 55 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0xb685): COSTABLE
    <401>   DW_AT_decl_file   : 2
    <401>   DW_AT_decl_line   : 231
    <402>   DW_AT_decl_column : 9
    <402>   DW_AT_type        : <0x451>
    <406>   DW_AT_data_member_location: 0x8082ac8
 <2><40a>: Abbrev Number: 0
 <1><40b>: Abbrev Number: 23 (DW_TAG_array_type)
    <40c>   DW_AT_type        : <0x2a>
    <410>   DW_AT_sibling     : <0x41e>
 <2><414>: Abbrev Number: 84 (DW_TAG_subrange_type)
    <415>   DW_AT_type        : <0x170>
    <419>   DW_AT_upper_bound : 0xffffff
 <2><41d>: Abbrev Number: 0
 <1><41e>: Abbrev Number: 23 (DW_TAG_array_type)
    <41f>   DW_AT_type        : <0x2a>
    <423>   DW_AT_sibling     : <0x42f>
 <2><427>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <428>   DW_AT_type        : <0x170>
    <42c>   DW_AT_upper_bound : 16383
 <2><42e>: Abbrev Number: 0
 <1><42f>: Abbrev Number: 23 (DW_TAG_array_type)
    <430>   DW_AT_type        : <0x2a>
    <434>   DW_AT_sibling     : <0x440>
 <2><438>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <439>   DW_AT_type        : <0x170>
    <43d>   DW_AT_upper_bound : 32752
 <2><43f>: Abbrev Number: 0
 <1><440>: Abbrev Number: 23 (DW_TAG_array_type)
    <441>   DW_AT_type        : <0x2a>
    <445>   DW_AT_sibling     : <0x451>
 <2><449>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <44a>   DW_AT_type        : <0x170>
    <44e>   DW_AT_upper_bound : 1023
 <2><450>: Abbrev Number: 0
 <1><451>: Abbrev Number: 23 (DW_TAG_array_type)
    <452>   DW_AT_type        : <0x2a>
    <456>   DW_AT_sibling     : <0x462>
 <2><45a>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <45b>   DW_AT_type        : <0x170>
    <45f>   DW_AT_upper_bound : 359
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 50 (DW_TAG_structure_type)
    <463>   DW_AT_name        : (indirect string, offset: 0xf9a6): $5FLAGS
    <467>   DW_AT_byte_size   : 1
    <468>   DW_AT_decl_file   : 1
    <468>   DW_AT_decl_line   : 457
    <46a>   DW_AT_decl_column : 8
    <46b>   DW_AT_sibling     : <0x47d>
 <2><46f>: Abbrev Number: 35 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0x8670): __fb_struct_body
    <474>   DW_AT_decl_file   : 1
    <474>   DW_AT_decl_line   : 458
    <476>   DW_AT_decl_column : 8
    <477>   DW_AT_type        : <0x47d>
    <47b>   DW_AT_data_member_location: 0
 <2><47c>: Abbrev Number: 0
 <1><47d>: Abbrev Number: 23 (DW_TAG_array_type)
    <47e>   DW_AT_type        : <0x59>
    <482>   DW_AT_sibling     : <0x48d>
 <2><486>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <487>   DW_AT_type        : <0x170>
    <48b>   DW_AT_upper_bound : 0
 <2><48c>: Abbrev Number: 0
 <1><48d>: Abbrev Number: 36 (DW_TAG_union_type)
    <48e>   DW_AT_byte_size   : 1
    <48f>   DW_AT_decl_file   : 1
    <48f>   DW_AT_decl_line   : 482
    <491>   DW_AT_decl_column : 14
    <492>   DW_AT_sibling     : <0x4af>
 <2><496>: Abbrev Number: 29 (DW_TAG_member)
    <497>   DW_AT_name        : ULO
    <49b>   DW_AT_decl_file   : 1
    <49b>   DW_AT_decl_line   : 483
    <49d>   DW_AT_decl_column : 21
    <49e>   DW_AT_type        : <0x59>
 <2><4a2>: Abbrev Number: 29 (DW_TAG_member)
    <4a3>   DW_AT_name        : SLO
    <4a7>   DW_AT_decl_file   : 1
    <4a7>   DW_AT_decl_line   : 484
    <4a9>   DW_AT_decl_column : 20
    <4aa>   DW_AT_type        : <0x46>
 <2><4ae>: Abbrev Number: 0
 <1><4af>: Abbrev Number: 36 (DW_TAG_union_type)
    <4b0>   DW_AT_byte_size   : 1
    <4b1>   DW_AT_decl_file   : 1
    <4b1>   DW_AT_decl_line   : 486
    <4b3>   DW_AT_decl_column : 14
    <4b4>   DW_AT_sibling     : <0x4d1>
 <2><4b8>: Abbrev Number: 29 (DW_TAG_member)
    <4b9>   DW_AT_name        : UHI
    <4bd>   DW_AT_decl_file   : 1
    <4bd>   DW_AT_decl_line   : 487
    <4bf>   DW_AT_decl_column : 21
    <4c0>   DW_AT_type        : <0x59>
 <2><4c4>: Abbrev Number: 29 (DW_TAG_member)
    <4c5>   DW_AT_name        : SHI
    <4c9>   DW_AT_decl_file   : 1
    <4c9>   DW_AT_decl_line   : 488
    <4cb>   DW_AT_decl_column : 20
    <4cc>   DW_AT_type        : <0x46>
 <2><4d0>: Abbrev Number: 0
 <1><4d1>: Abbrev Number: 46 (DW_TAG_structure_type)
    <4d2>   DW_AT_byte_size   : 2
    <4d3>   DW_AT_decl_file   : 1
    <4d3>   DW_AT_decl_line   : 481
    <4d5>   DW_AT_decl_column : 13
    <4d6>   DW_AT_sibling     : <0x4e7>
 <2><4da>: Abbrev Number: 37 (DW_TAG_member)
    <4db>   DW_AT_type        : <0x48d>
    <4df>   DW_AT_data_member_location: 0
 <2><4e0>: Abbrev Number: 37 (DW_TAG_member)
    <4e1>   DW_AT_type        : <0x4af>
    <4e5>   DW_AT_data_member_location: 1
 <2><4e6>: Abbrev Number: 0
 <1><4e7>: Abbrev Number: 36 (DW_TAG_union_type)
    <4e8>   DW_AT_byte_size   : 2
    <4e9>   DW_AT_decl_file   : 1
    <4e9>   DW_AT_decl_line   : 478
    <4eb>   DW_AT_decl_column : 12
    <4ec>   DW_AT_sibling     : <0x50e>
 <2><4f0>: Abbrev Number: 29 (DW_TAG_member)
    <4f1>   DW_AT_name        : U16
    <4f5>   DW_AT_decl_file   : 1
    <4f5>   DW_AT_decl_line   : 479
    <4f7>   DW_AT_decl_column : 20
    <4f8>   DW_AT_type        : <0x7f>
 <2><4fc>: Abbrev Number: 29 (DW_TAG_member)
    <4fd>   DW_AT_name        : S16
    <501>   DW_AT_decl_file   : 1
    <501>   DW_AT_decl_line   : 480
    <503>   DW_AT_decl_column : 19
    <504>   DW_AT_type        : <0x6c>
 <2><508>: Abbrev Number: 47 (DW_TAG_member)
    <509>   DW_AT_type        : <0x4d1>
 <2><50d>: Abbrev Number: 0
 <1><50e>: Abbrev Number: 46 (DW_TAG_structure_type)
    <50f>   DW_AT_byte_size   : 2
    <510>   DW_AT_decl_file   : 1
    <510>   DW_AT_decl_line   : 477
    <512>   DW_AT_decl_column : 11
    <513>   DW_AT_sibling     : <0x51e>
 <2><517>: Abbrev Number: 37 (DW_TAG_member)
    <518>   DW_AT_type        : <0x4e7>
    <51c>   DW_AT_data_member_location: 0
 <2><51d>: Abbrev Number: 0
 <1><51e>: Abbrev Number: 36 (DW_TAG_union_type)
    <51f>   DW_AT_byte_size   : 4
    <520>   DW_AT_decl_file   : 1
    <520>   DW_AT_decl_line   : 474
    <522>   DW_AT_decl_column : 10
    <523>   DW_AT_sibling     : <0x545>
 <2><527>: Abbrev Number: 29 (DW_TAG_member)
    <528>   DW_AT_name        : U32
    <52c>   DW_AT_decl_file   : 1
    <52c>   DW_AT_decl_line   : 475
    <52e>   DW_AT_decl_column : 18
    <52f>   DW_AT_type        : <0x9e>
 <2><533>: Abbrev Number: 29 (DW_TAG_member)
    <534>   DW_AT_name        : S32
    <538>   DW_AT_decl_file   : 1
    <538>   DW_AT_decl_line   : 476
    <53a>   DW_AT_decl_column : 17
    <53b>   DW_AT_type        : <0x92>
 <2><53f>: Abbrev Number: 47 (DW_TAG_member)
    <540>   DW_AT_type        : <0x50e>
 <2><544>: Abbrev Number: 0
 <1><545>: Abbrev Number: 46 (DW_TAG_structure_type)
    <546>   DW_AT_byte_size   : 4
    <547>   DW_AT_decl_file   : 1
    <547>   DW_AT_decl_line   : 473
    <549>   DW_AT_decl_column : 9
    <54a>   DW_AT_sibling     : <0x555>
 <2><54e>: Abbrev Number: 37 (DW_TAG_member)
    <54f>   DW_AT_type        : <0x51e>
    <553>   DW_AT_data_member_location: 0
 <2><554>: Abbrev Number: 0
 <1><555>: Abbrev Number: 36 (DW_TAG_union_type)
    <556>   DW_AT_byte_size   : 4
    <557>   DW_AT_decl_file   : 1
    <557>   DW_AT_decl_line   : 470
    <559>   DW_AT_decl_column : 8
    <55a>   DW_AT_sibling     : <0x57c>
 <2><55e>: Abbrev Number: 51 (DW_TAG_member)
    <55f>   DW_AT_name        : (indirect string, offset: 0x9ef6): UFPU32
    <563>   DW_AT_decl_file   : 1
    <563>   DW_AT_decl_line   : 471
    <565>   DW_AT_decl_column : 15
    <566>   DW_AT_type        : <0x31>
 <2><56a>: Abbrev Number: 51 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0x1aab): SFPU32
    <56f>   DW_AT_decl_file   : 1
    <56f>   DW_AT_decl_line   : 472
    <571>   DW_AT_decl_column : 15
    <572>   DW_AT_type        : <0x31>
 <2><576>: Abbrev Number: 47 (DW_TAG_member)
    <577>   DW_AT_type        : <0x545>
 <2><57b>: Abbrev Number: 0
 <1><57c>: Abbrev Number: 46 (DW_TAG_structure_type)
    <57d>   DW_AT_byte_size   : 4
    <57e>   DW_AT_decl_file   : 1
    <57e>   DW_AT_decl_line   : 469
    <580>   DW_AT_decl_column : 7
    <581>   DW_AT_sibling     : <0x58c>
 <2><585>: Abbrev Number: 37 (DW_TAG_member)
    <586>   DW_AT_type        : <0x555>
    <58a>   DW_AT_data_member_location: 0
 <2><58b>: Abbrev Number: 0
 <1><58c>: Abbrev Number: 36 (DW_TAG_union_type)
    <58d>   DW_AT_byte_size   : 8
    <58e>   DW_AT_decl_file   : 1
    <58e>   DW_AT_decl_line   : 466
    <590>   DW_AT_decl_column : 6
    <591>   DW_AT_sibling     : <0x5b3>
 <2><595>: Abbrev Number: 29 (DW_TAG_member)
    <596>   DW_AT_name        : U64
    <59a>   DW_AT_decl_file   : 1
    <59a>   DW_AT_decl_line   : 467
    <59c>   DW_AT_decl_column : 14
    <59d>   DW_AT_type        : <0xc4>
 <2><5a1>: Abbrev Number: 29 (DW_TAG_member)
    <5a2>   DW_AT_name        : S64
    <5a6>   DW_AT_decl_file   : 1
    <5a6>   DW_AT_decl_line   : 468
    <5a8>   DW_AT_decl_column : 13
    <5a9>   DW_AT_type        : <0xb1>
 <2><5ad>: Abbrev Number: 47 (DW_TAG_member)
    <5ae>   DW_AT_type        : <0x57c>
 <2><5b2>: Abbrev Number: 0
 <1><5b3>: Abbrev Number: 46 (DW_TAG_structure_type)
    <5b4>   DW_AT_byte_size   : 8
    <5b5>   DW_AT_decl_file   : 1
    <5b5>   DW_AT_decl_line   : 465
    <5b7>   DW_AT_decl_column : 5
    <5b8>   DW_AT_sibling     : <0x5c3>
 <2><5bc>: Abbrev Number: 37 (DW_TAG_member)
    <5bd>   DW_AT_type        : <0x58c>
    <5c1>   DW_AT_data_member_location: 0
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 36 (DW_TAG_union_type)
    <5c4>   DW_AT_byte_size   : 8
    <5c5>   DW_AT_decl_file   : 1
    <5c5>   DW_AT_decl_line   : 462
    <5c7>   DW_AT_decl_column : 4
    <5c8>   DW_AT_sibling     : <0x5ea>
 <2><5cc>: Abbrev Number: 51 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0xa2fa): UFPU64
    <5d1>   DW_AT_decl_file   : 1
    <5d1>   DW_AT_decl_line   : 463
    <5d3>   DW_AT_decl_column : 12
    <5d4>   DW_AT_type        : <0x2a>
 <2><5d8>: Abbrev Number: 51 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x2011): SFPU64
    <5dd>   DW_AT_decl_file   : 1
    <5dd>   DW_AT_decl_line   : 464
    <5df>   DW_AT_decl_column : 12
    <5e0>   DW_AT_type        : <0x2a>
 <2><5e4>: Abbrev Number: 47 (DW_TAG_member)
    <5e5>   DW_AT_type        : <0x5b3>
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 46 (DW_TAG_structure_type)
    <5eb>   DW_AT_byte_size   : 8
    <5ec>   DW_AT_decl_file   : 1
    <5ec>   DW_AT_decl_line   : 461
    <5ee>   DW_AT_decl_column : 3
    <5ef>   DW_AT_sibling     : <0x5fa>
 <2><5f3>: Abbrev Number: 37 (DW_TAG_member)
    <5f4>   DW_AT_type        : <0x5c3>
    <5f8>   DW_AT_data_member_location: 0
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 36 (DW_TAG_union_type)
    <5fb>   DW_AT_byte_size   : 8
    <5fc>   DW_AT_decl_file   : 1
    <5fc>   DW_AT_decl_line   : 458
    <5fe>   DW_AT_decl_column : 2
    <5ff>   DW_AT_sibling     : <0x621>
 <2><603>: Abbrev Number: 51 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x56cb): ADR0
    <608>   DW_AT_decl_file   : 1
    <608>   DW_AT_decl_line   : 459
    <60a>   DW_AT_decl_column : 9
    <60b>   DW_AT_type        : <0x621>
 <2><60f>: Abbrev Number: 51 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x56d0): ADR1
    <614>   DW_AT_decl_file   : 1
    <614>   DW_AT_decl_line   : 460
    <616>   DW_AT_decl_column : 9
    <617>   DW_AT_type        : <0x621>
 <2><61b>: Abbrev Number: 47 (DW_TAG_member)
    <61c>   DW_AT_type        : <0x5ea>
 <2><620>: Abbrev Number: 0
 <1><621>: Abbrev Number: 85 (DW_TAG_pointer_type)
    <622>   DW_AT_byte_size   : 8
 <1><623>: Abbrev Number: 50 (DW_TAG_structure_type)
    <624>   DW_AT_name        : (indirect string, offset: 0x1e2e): $5MULTI
    <628>   DW_AT_byte_size   : 8
    <629>   DW_AT_decl_file   : 1
    <629>   DW_AT_decl_line   : 457
    <62b>   DW_AT_decl_column : 8
    <62c>   DW_AT_sibling     : <0x637>
 <2><630>: Abbrev Number: 37 (DW_TAG_member)
    <631>   DW_AT_type        : <0x5fa>
    <635>   DW_AT_data_member_location: 0
 <2><636>: Abbrev Number: 0
 <1><637>: Abbrev Number: 58 (DW_TAG_typedef)
    <638>   DW_AT_name        : (indirect string, offset: 0xbb95): tmp$717
    <63c>   DW_AT_decl_file   : 1
    <63c>   DW_AT_decl_line   : 456
    <63e>   DW_AT_decl_column : 16
    <63f>   DW_AT_type        : <0x643>
 <1><643>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <644>   DW_AT_byte_size   : 8
    <644>   DW_AT_type        : <0x648>
 <1><648>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <649>   DW_AT_prototyped  : 1
    <649>   DW_AT_sibling     : <0x653>
 <2><64d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <64e>   DW_AT_type        : <0x653>
 <2><652>: Abbrev Number: 0
 <1><653>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <654>   DW_AT_byte_size   : 8
    <654>   DW_AT_type        : <0x658>
 <1><658>: Abbrev Number: 86 (DW_TAG_structure_type)
    <659>   DW_AT_name        : (indirect string, offset: 0x1607f): $7CPU6510
    <65d>   DW_AT_byte_size   : 14720
    <65f>   DW_AT_decl_file   : 1
    <660>   DW_AT_decl_line   : 457
    <662>   DW_AT_decl_column : 8
    <663>   DW_AT_sibling     : <0x6c2>
 <2><667>: Abbrev Number: 37 (DW_TAG_member)
    <668>   DW_AT_type        : <0x73a>
    <66c>   DW_AT_data_member_location: 0
 <2><66d>: Abbrev Number: 37 (DW_TAG_member)
    <66e>   DW_AT_type        : <0x758>
    <672>   DW_AT_data_member_location: 1
 <2><673>: Abbrev Number: 37 (DW_TAG_member)
    <674>   DW_AT_type        : <0x777>
    <678>   DW_AT_data_member_location: 2
 <2><679>: Abbrev Number: 37 (DW_TAG_member)
    <67a>   DW_AT_type        : <0x796>
    <67e>   DW_AT_data_member_location: 3
 <2><67f>: Abbrev Number: 37 (DW_TAG_member)
    <680>   DW_AT_type        : <0x7d7>
    <684>   DW_AT_data_member_location: 4
 <2><685>: Abbrev Number: 37 (DW_TAG_member)
    <686>   DW_AT_type        : <0x813>
    <68a>   DW_AT_data_member_location: 6
 <2><68b>: Abbrev Number: 40 (DW_TAG_member)
    <68c>   DW_AT_name        : MEM
    <690>   DW_AT_decl_file   : 1
    <690>   DW_AT_decl_line   : 488
    <692>   DW_AT_decl_column : 21
    <693>   DW_AT_type        : <0x82d>
    <697>   DW_AT_data_member_location: 8
 <2><698>: Abbrev Number: 35 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0x1331a): CODE
    <69d>   DW_AT_decl_file   : 1
    <69d>   DW_AT_decl_line   : 489
    <69f>   DW_AT_decl_column : 18
    <6a0>   DW_AT_type        : <0x6c2>
    <6a4>   DW_AT_data_member_location: 16
 <2><6a5>: Abbrev Number: 35 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x2858): OPCODES
    <6aa>   DW_AT_decl_file   : 1
    <6aa>   DW_AT_decl_line   : 490
    <6ac>   DW_AT_decl_column : 18
    <6ad>   DW_AT_type        : <0x832>
    <6b1>   DW_AT_data_member_location: 72
 <2><6b2>: Abbrev Number: 87 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x6d87): STRADRMODES
    <6b7>   DW_AT_decl_file   : 1
    <6b8>   DW_AT_decl_line   : 491
    <6ba>   DW_AT_decl_column : 11
    <6bb>   DW_AT_type        : <0x842>
    <6bf>   DW_AT_data_member_location: 14408
 <2><6c1>: Abbrev Number: 0
 <1><6c2>: Abbrev Number: 50 (DW_TAG_structure_type)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x8c53): $6OPCODE
    <6c7>   DW_AT_byte_size   : 56
    <6c8>   DW_AT_decl_file   : 1
    <6c8>   DW_AT_decl_line   : 457
    <6ca>   DW_AT_decl_column : 8
    <6cb>   DW_AT_sibling     : <0x72a>
 <2><6cf>: Abbrev Number: 35 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x1331a): CODE
    <6d4>   DW_AT_decl_file   : 1
    <6d4>   DW_AT_decl_line   : 458
    <6d6>   DW_AT_decl_column : 9
    <6d7>   DW_AT_type        : <0xc4>
    <6db>   DW_AT_data_member_location: 0
 <2><6dc>: Abbrev Number: 40 (DW_TAG_member)
    <6dd>   DW_AT_name        : NAM
    <6e1>   DW_AT_decl_file   : 1
    <6e1>   DW_AT_decl_line   : 459
    <6e3>   DW_AT_decl_column : 8
    <6e4>   DW_AT_type        : <0x72a>
    <6e8>   DW_AT_data_member_location: 8
 <2><6e9>: Abbrev Number: 35 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x6647): ADRMODE
    <6ee>   DW_AT_decl_file   : 1
    <6ee>   DW_AT_decl_line   : 460
    <6f0>   DW_AT_decl_column : 9
    <6f1>   DW_AT_type        : <0xc4>
    <6f5>   DW_AT_data_member_location: 16
 <2><6f6>: Abbrev Number: 35 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x1ff5): BYTES
    <6fb>   DW_AT_decl_file   : 1
    <6fb>   DW_AT_decl_line   : 461
    <6fd>   DW_AT_decl_column : 9
    <6fe>   DW_AT_type        : <0xc4>
    <702>   DW_AT_data_member_location: 24
 <2><703>: Abbrev Number: 35 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x902f): TICKS
    <708>   DW_AT_decl_file   : 1
    <708>   DW_AT_decl_line   : 462
    <70a>   DW_AT_decl_column : 9
    <70b>   DW_AT_type        : <0xc4>
    <70f>   DW_AT_data_member_location: 32
 <2><710>: Abbrev Number: 40 (DW_TAG_member)
    <711>   DW_AT_name        : OP
    <714>   DW_AT_decl_file   : 1
    <714>   DW_AT_decl_line   : 463
    <716>   DW_AT_decl_column : 17
    <717>   DW_AT_type        : <0x623>
    <71b>   DW_AT_data_member_location: 40
 <2><71c>: Abbrev Number: 35 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x13318): DECODE
    <721>   DW_AT_decl_file   : 1
    <721>   DW_AT_decl_line   : 464
    <723>   DW_AT_decl_column : 10
    <724>   DW_AT_type        : <0x637>
    <728>   DW_AT_data_member_location: 48
 <2><729>: Abbrev Number: 0
 <1><72a>: Abbrev Number: 23 (DW_TAG_array_type)
    <72b>   DW_AT_type        : <0x59>
    <72f>   DW_AT_sibling     : <0x73a>
 <2><733>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <734>   DW_AT_type        : <0x170>
    <738>   DW_AT_upper_bound : 3
 <2><739>: Abbrev Number: 0
 <1><73a>: Abbrev Number: 36 (DW_TAG_union_type)
    <73b>   DW_AT_byte_size   : 1
    <73c>   DW_AT_decl_file   : 1
    <73c>   DW_AT_decl_line   : 458
    <73e>   DW_AT_decl_column : 2
    <73f>   DW_AT_sibling     : <0x758>
 <2><743>: Abbrev Number: 29 (DW_TAG_member)
    <744>   DW_AT_name        : P
    <746>   DW_AT_decl_file   : 1
    <746>   DW_AT_decl_line   : 459
    <748>   DW_AT_decl_column : 9
    <749>   DW_AT_type        : <0x59>
 <2><74d>: Abbrev Number: 29 (DW_TAG_member)
    <74e>   DW_AT_name        : F
    <750>   DW_AT_decl_file   : 1
    <750>   DW_AT_decl_line   : 460
    <752>   DW_AT_decl_column : 18
    <753>   DW_AT_type        : <0x462>
 <2><757>: Abbrev Number: 0
 <1><758>: Abbrev Number: 36 (DW_TAG_union_type)
    <759>   DW_AT_byte_size   : 1
    <75a>   DW_AT_decl_file   : 1
    <75a>   DW_AT_decl_line   : 462
    <75c>   DW_AT_decl_column : 2
    <75d>   DW_AT_sibling     : <0x777>
 <2><761>: Abbrev Number: 29 (DW_TAG_member)
    <762>   DW_AT_name        : A
    <764>   DW_AT_decl_file   : 1
    <764>   DW_AT_decl_line   : 463
    <766>   DW_AT_decl_column : 9
    <767>   DW_AT_type        : <0x59>
 <2><76b>: Abbrev Number: 29 (DW_TAG_member)
    <76c>   DW_AT_name        : SA
    <76f>   DW_AT_decl_file   : 1
    <76f>   DW_AT_decl_line   : 464
    <771>   DW_AT_decl_column : 8
    <772>   DW_AT_type        : <0x46>
 <2><776>: Abbrev Number: 0
 <1><777>: Abbrev Number: 36 (DW_TAG_union_type)
    <778>   DW_AT_byte_size   : 1
    <779>   DW_AT_decl_file   : 1
    <779>   DW_AT_decl_line   : 466
    <77b>   DW_AT_decl_column : 2
    <77c>   DW_AT_sibling     : <0x796>
 <2><780>: Abbrev Number: 29 (DW_TAG_member)
    <781>   DW_AT_name        : X
    <783>   DW_AT_decl_file   : 1
    <783>   DW_AT_decl_line   : 467
    <785>   DW_AT_decl_column : 9
    <786>   DW_AT_type        : <0x59>
 <2><78a>: Abbrev Number: 29 (DW_TAG_member)
    <78b>   DW_AT_name        : SX
    <78e>   DW_AT_decl_file   : 1
    <78e>   DW_AT_decl_line   : 468
    <790>   DW_AT_decl_column : 8
    <791>   DW_AT_type        : <0x46>
 <2><795>: Abbrev Number: 0
 <1><796>: Abbrev Number: 36 (DW_TAG_union_type)
    <797>   DW_AT_byte_size   : 1
    <798>   DW_AT_decl_file   : 1
    <798>   DW_AT_decl_line   : 470
    <79a>   DW_AT_decl_column : 2
    <79b>   DW_AT_sibling     : <0x7b5>
 <2><79f>: Abbrev Number: 29 (DW_TAG_member)
    <7a0>   DW_AT_name        : Y
    <7a2>   DW_AT_decl_file   : 1
    <7a2>   DW_AT_decl_line   : 471
    <7a4>   DW_AT_decl_column : 9
    <7a5>   DW_AT_type        : <0x59>
 <2><7a9>: Abbrev Number: 29 (DW_TAG_member)
    <7aa>   DW_AT_name        : SY
    <7ad>   DW_AT_decl_file   : 1
    <7ad>   DW_AT_decl_line   : 472
    <7af>   DW_AT_decl_column : 8
    <7b0>   DW_AT_type        : <0x46>
 <2><7b4>: Abbrev Number: 0
 <1><7b5>: Abbrev Number: 46 (DW_TAG_structure_type)
    <7b6>   DW_AT_byte_size   : 2
    <7b7>   DW_AT_decl_file   : 1
    <7b7>   DW_AT_decl_line   : 476
    <7b9>   DW_AT_decl_column : 3
    <7ba>   DW_AT_sibling     : <0x7d7>
 <2><7be>: Abbrev Number: 40 (DW_TAG_member)
    <7bf>   DW_AT_name        : PL
    <7c2>   DW_AT_decl_file   : 1
    <7c2>   DW_AT_decl_line   : 477
    <7c4>   DW_AT_decl_column : 10
    <7c5>   DW_AT_type        : <0x59>
    <7c9>   DW_AT_data_member_location: 0
 <2><7ca>: Abbrev Number: 40 (DW_TAG_member)
    <7cb>   DW_AT_name        : PH
    <7ce>   DW_AT_decl_file   : 1
    <7ce>   DW_AT_decl_line   : 478
    <7d0>   DW_AT_decl_column : 10
    <7d1>   DW_AT_type        : <0x59>
    <7d5>   DW_AT_data_member_location: 1
 <2><7d6>: Abbrev Number: 0
 <1><7d7>: Abbrev Number: 36 (DW_TAG_union_type)
    <7d8>   DW_AT_byte_size   : 2
    <7d9>   DW_AT_decl_file   : 1
    <7d9>   DW_AT_decl_line   : 474
    <7db>   DW_AT_decl_column : 2
    <7dc>   DW_AT_sibling     : <0x7f1>
 <2><7e0>: Abbrev Number: 29 (DW_TAG_member)
    <7e1>   DW_AT_name        : PC
    <7e4>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 475
    <7e6>   DW_AT_decl_column : 10
    <7e7>   DW_AT_type        : <0x7f>
 <2><7eb>: Abbrev Number: 47 (DW_TAG_member)
    <7ec>   DW_AT_type        : <0x7b5>
 <2><7f0>: Abbrev Number: 0
 <1><7f1>: Abbrev Number: 46 (DW_TAG_structure_type)
    <7f2>   DW_AT_byte_size   : 2
    <7f3>   DW_AT_decl_file   : 1
    <7f3>   DW_AT_decl_line   : 483
    <7f5>   DW_AT_decl_column : 3
    <7f6>   DW_AT_sibling     : <0x813>
 <2><7fa>: Abbrev Number: 40 (DW_TAG_member)
    <7fb>   DW_AT_name        : S
    <7fd>   DW_AT_decl_file   : 1
    <7fd>   DW_AT_decl_line   : 484
    <7ff>   DW_AT_decl_column : 10
    <800>   DW_AT_type        : <0x59>
    <804>   DW_AT_data_member_location: 0
 <2><805>: Abbrev Number: 40 (DW_TAG_member)
    <806>   DW_AT_name        : MSB
    <80a>   DW_AT_decl_file   : 1
    <80a>   DW_AT_decl_line   : 485
    <80c>   DW_AT_decl_column : 10
    <80d>   DW_AT_type        : <0x59>
    <811>   DW_AT_data_member_location: 1
 <2><812>: Abbrev Number: 0
 <1><813>: Abbrev Number: 36 (DW_TAG_union_type)
    <814>   DW_AT_byte_size   : 2
    <815>   DW_AT_decl_file   : 1
    <815>   DW_AT_decl_line   : 481
    <817>   DW_AT_decl_column : 2
    <818>   DW_AT_sibling     : <0x82d>
 <2><81c>: Abbrev Number: 29 (DW_TAG_member)
    <81d>   DW_AT_name        : SP
    <820>   DW_AT_decl_file   : 1
    <820>   DW_AT_decl_line   : 482
    <822>   DW_AT_decl_column : 10
    <823>   DW_AT_type        : <0x7f>
 <2><827>: Abbrev Number: 47 (DW_TAG_member)
    <828>   DW_AT_type        : <0x7f1>
 <2><82c>: Abbrev Number: 0
 <1><82d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <82e>   DW_AT_byte_size   : 8
    <82e>   DW_AT_type        : <0x397>
 <1><832>: Abbrev Number: 23 (DW_TAG_array_type)
    <833>   DW_AT_type        : <0x6c2>
    <837>   DW_AT_sibling     : <0x842>
 <2><83b>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <83c>   DW_AT_type        : <0x170>
    <840>   DW_AT_upper_bound : 255
 <2><841>: Abbrev Number: 0
 <1><842>: Abbrev Number: 23 (DW_TAG_array_type)
    <843>   DW_AT_type        : <0x113>
    <847>   DW_AT_sibling     : <0x852>
 <2><84b>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <84c>   DW_AT_type        : <0x170>
    <850>   DW_AT_upper_bound : 12
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 50 (DW_TAG_structure_type)
    <853>   DW_AT_name        : (indirect string, offset: 0x127c6): $5C64_T
    <857>   DW_AT_byte_size   : 16
    <858>   DW_AT_decl_file   : 1
    <858>   DW_AT_decl_line   : 457
    <85a>   DW_AT_decl_column : 8
    <85b>   DW_AT_sibling     : <0x87a>
 <2><85f>: Abbrev Number: 40 (DW_TAG_member)
    <860>   DW_AT_name        : MEM
    <864>   DW_AT_decl_file   : 1
    <864>   DW_AT_decl_line   : 458
    <866>   DW_AT_decl_column : 21
    <867>   DW_AT_type        : <0x82d>
    <86b>   DW_AT_data_member_location: 0
 <2><86c>: Abbrev Number: 40 (DW_TAG_member)
    <86d>   DW_AT_name        : CPU
    <871>   DW_AT_decl_file   : 1
    <871>   DW_AT_decl_line   : 459
    <873>   DW_AT_decl_column : 20
    <874>   DW_AT_type        : <0x653>
    <878>   DW_AT_data_member_location: 8
 <2><879>: Abbrev Number: 0
 <1><87a>: Abbrev Number: 50 (DW_TAG_structure_type)
    <87b>   DW_AT_name        : (indirect string, offset: 0xa079): $4VEC3
    <87f>   DW_AT_byte_size   : 12
    <880>   DW_AT_decl_file   : 1
    <880>   DW_AT_decl_line   : 457
    <882>   DW_AT_decl_column : 8
    <883>   DW_AT_sibling     : <0x8a9>
 <2><887>: Abbrev Number: 40 (DW_TAG_member)
    <888>   DW_AT_name        : X
    <88a>   DW_AT_decl_file   : 1
    <88a>   DW_AT_decl_line   : 458
    <88c>   DW_AT_decl_column : 8
    <88d>   DW_AT_type        : <0x31>
    <891>   DW_AT_data_member_location: 0
 <2><892>: Abbrev Number: 40 (DW_TAG_member)
    <893>   DW_AT_name        : Y
    <895>   DW_AT_decl_file   : 1
    <895>   DW_AT_decl_line   : 459
    <897>   DW_AT_decl_column : 8
    <898>   DW_AT_type        : <0x31>
    <89c>   DW_AT_data_member_location: 4
 <2><89d>: Abbrev Number: 40 (DW_TAG_member)
    <89e>   DW_AT_name        : Z
    <8a0>   DW_AT_decl_file   : 1
    <8a0>   DW_AT_decl_line   : 460
    <8a2>   DW_AT_decl_column : 8
    <8a3>   DW_AT_type        : <0x31>
    <8a7>   DW_AT_data_member_location: 8
 <2><8a8>: Abbrev Number: 0
 <1><8a9>: Abbrev Number: 54 (DW_TAG_structure_type)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x6c02): $7FBARRAYIvE
    <8ae>   DW_AT_byte_size   : 240
    <8af>   DW_AT_decl_file   : 5
    <8b0>   DW_AT_decl_line   : 25
    <8b1>   DW_AT_decl_column : 8
    <8b2>   DW_AT_sibling     : <0x911>
 <2><8b6>: Abbrev Number: 22 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xb6c5): DATA
    <8bb>   DW_AT_decl_file   : 5
    <8bc>   DW_AT_decl_line   : 26
    <8bd>   DW_AT_decl_column : 8
    <8be>   DW_AT_type        : <0x621>
    <8c2>   DW_AT_data_member_location: 0
 <2><8c3>: Abbrev Number: 57 (DW_TAG_member)
    <8c4>   DW_AT_name        : PTR
    <8c8>   DW_AT_decl_file   : 5
    <8c9>   DW_AT_decl_line   : 27
    <8ca>   DW_AT_decl_column : 8
    <8cb>   DW_AT_type        : <0x621>
    <8cf>   DW_AT_data_member_location: 8
 <2><8cf>: Abbrev Number: 22 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x2e5e): SIZE
    <8d4>   DW_AT_decl_file   : 5
    <8d5>   DW_AT_decl_line   : 28
    <8d6>   DW_AT_decl_column : 8
    <8d7>   DW_AT_type        : <0xb1>
    <8db>   DW_AT_data_member_location: 16
 <2><8dc>: Abbrev Number: 22 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x107d9): ELEMENT_LEN
    <8e1>   DW_AT_decl_file   : 5
    <8e2>   DW_AT_decl_line   : 29
    <8e3>   DW_AT_decl_column : 8
    <8e4>   DW_AT_type        : <0xb1>
    <8e8>   DW_AT_data_member_location: 24
 <2><8e9>: Abbrev Number: 22 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x62b4): DIMENSIONS
    <8ee>   DW_AT_decl_file   : 5
    <8ef>   DW_AT_decl_line   : 30
    <8f0>   DW_AT_decl_column : 8
    <8f1>   DW_AT_type        : <0xb1>
    <8f5>   DW_AT_data_member_location: 32
 <2><8f6>: Abbrev Number: 22 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xf9a8): FLAGS
    <8fb>   DW_AT_decl_file   : 5
    <8fc>   DW_AT_decl_line   : 31
    <8fd>   DW_AT_decl_column : 8
    <8fe>   DW_AT_type        : <0xb1>
    <902>   DW_AT_data_member_location: 40
 <2><903>: Abbrev Number: 22 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x108ab): DIMTB
    <908>   DW_AT_decl_file   : 5
    <909>   DW_AT_decl_line   : 32
    <90a>   DW_AT_decl_column : 29
    <90b>   DW_AT_type        : <0x911>
    <90f>   DW_AT_data_member_location: 48
 <2><910>: Abbrev Number: 0
 <1><911>: Abbrev Number: 23 (DW_TAG_array_type)
    <912>   DW_AT_type        : <0x12b>
    <916>   DW_AT_sibling     : <0x921>
 <2><91a>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <91b>   DW_AT_type        : <0x170>
    <91f>   DW_AT_upper_bound : 7
 <2><920>: Abbrev Number: 0
 <1><921>: Abbrev Number: 9 (DW_TAG_variable)
    <922>   DW_AT_name        : (indirect string, offset: 0x12ff6): INDEX$
    <926>   DW_AT_decl_file   : 1
    <927>   DW_AT_decl_line   : 446
    <929>   DW_AT_decl_column : 15
    <92a>   DW_AT_type        : <0x7f>
    <92e>   DW_AT_location    : 9 byte block: 3 c0 c6 47 0 0 0 0 0 	(DW_OP_addr: 47c6c0)
 <1><938>: Abbrev Number: 16 (DW_TAG_variable)
    <939>   DW_AT_name        : (indirect string, offset: 0x69a1): RVS$
    <93d>   DW_AT_decl_file   : 1
    <93e>   DW_AT_decl_line   : 446
    <940>   DW_AT_decl_column : 15
    <941>   DW_AT_type        : <0x7f>
 <1><945>: Abbrev Number: 16 (DW_TAG_variable)
    <946>   DW_AT_name        : (indirect string, offset: 0xc5b8): FCOLOR$
    <94a>   DW_AT_decl_file   : 1
    <94b>   DW_AT_decl_line   : 446
    <94d>   DW_AT_decl_column : 15
    <94e>   DW_AT_type        : <0x7f>
 <1><952>: Abbrev Number: 16 (DW_TAG_variable)
    <953>   DW_AT_name        : (indirect string, offset: 0xe41c): HIBASE$
    <957>   DW_AT_decl_file   : 1
    <958>   DW_AT_decl_line   : 446
    <95a>   DW_AT_decl_column : 15
    <95b>   DW_AT_type        : <0x7f>
 <1><95f>: Abbrev Number: 16 (DW_TAG_variable)
    <960>   DW_AT_name        : (indirect string, offset: 0xe1b6): SP0X$
    <964>   DW_AT_decl_file   : 1
    <965>   DW_AT_decl_line   : 446
    <967>   DW_AT_decl_column : 15
    <968>   DW_AT_type        : <0x7f>
 <1><96c>: Abbrev Number: 16 (DW_TAG_variable)
    <96d>   DW_AT_name        : (indirect string, offset: 0xe29e): SP0Y$
    <971>   DW_AT_decl_file   : 1
    <972>   DW_AT_decl_line   : 446
    <974>   DW_AT_decl_column : 15
    <975>   DW_AT_type        : <0x7f>
 <1><979>: Abbrev Number: 16 (DW_TAG_variable)
    <97a>   DW_AT_name        : (indirect string, offset: 0x13fb0): SP1X$
    <97e>   DW_AT_decl_file   : 1
    <97f>   DW_AT_decl_line   : 446
    <981>   DW_AT_decl_column : 15
    <982>   DW_AT_type        : <0x7f>
 <1><986>: Abbrev Number: 16 (DW_TAG_variable)
    <987>   DW_AT_name        : (indirect string, offset: 0x140e6): SP1Y$
    <98b>   DW_AT_decl_file   : 1
    <98c>   DW_AT_decl_line   : 446
    <98e>   DW_AT_decl_column : 15
    <98f>   DW_AT_type        : <0x7f>
 <1><993>: Abbrev Number: 16 (DW_TAG_variable)
    <994>   DW_AT_name        : (indirect string, offset: 0x3fe4): SP2X$
    <998>   DW_AT_decl_file   : 1
    <999>   DW_AT_decl_line   : 446
    <99b>   DW_AT_decl_column : 15
    <99c>   DW_AT_type        : <0x7f>
 <1><9a0>: Abbrev Number: 16 (DW_TAG_variable)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x4088): SP2Y$
    <9a5>   DW_AT_decl_file   : 1
    <9a6>   DW_AT_decl_line   : 446
    <9a8>   DW_AT_decl_column : 15
    <9a9>   DW_AT_type        : <0x7f>
 <1><9ad>: Abbrev Number: 16 (DW_TAG_variable)
    <9ae>   DW_AT_name        : (indirect string, offset: 0xa195): SP3X$
    <9b2>   DW_AT_decl_file   : 1
    <9b3>   DW_AT_decl_line   : 446
    <9b5>   DW_AT_decl_column : 15
    <9b6>   DW_AT_type        : <0x7f>
 <1><9ba>: Abbrev Number: 16 (DW_TAG_variable)
    <9bb>   DW_AT_name        : (indirect string, offset: 0xa2c1): SP3Y$
    <9bf>   DW_AT_decl_file   : 1
    <9c0>   DW_AT_decl_line   : 446
    <9c2>   DW_AT_decl_column : 15
    <9c3>   DW_AT_type        : <0x7f>
 <1><9c7>: Abbrev Number: 16 (DW_TAG_variable)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x1033e): SP4X$
    <9cc>   DW_AT_decl_file   : 1
    <9cd>   DW_AT_decl_line   : 446
    <9cf>   DW_AT_decl_column : 15
    <9d0>   DW_AT_type        : <0x7f>
 <1><9d4>: Abbrev Number: 16 (DW_TAG_variable)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x10440): SP4Y$
    <9d9>   DW_AT_decl_file   : 1
    <9da>   DW_AT_decl_line   : 446
    <9dc>   DW_AT_decl_column : 15
    <9dd>   DW_AT_type        : <0x7f>
 <1><9e1>: Abbrev Number: 16 (DW_TAG_variable)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x6d): SP5X$
    <9e6>   DW_AT_decl_file   : 1
    <9e7>   DW_AT_decl_line   : 446
    <9e9>   DW_AT_decl_column : 15
    <9ea>   DW_AT_type        : <0x7f>
 <1><9ee>: Abbrev Number: 16 (DW_TAG_variable)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x193): SP5Y$
    <9f3>   DW_AT_decl_file   : 1
    <9f4>   DW_AT_decl_line   : 446
    <9f6>   DW_AT_decl_column : 15
    <9f7>   DW_AT_type        : <0x7f>
 <1><9fb>: Abbrev Number: 16 (DW_TAG_variable)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x635b): SP6X$
    <a00>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 446
    <a03>   DW_AT_decl_column : 15
    <a04>   DW_AT_type        : <0x7f>
 <1><a08>: Abbrev Number: 16 (DW_TAG_variable)
    <a09>   DW_AT_name        : (indirect string, offset: 0x649c): SP6Y$
    <a0d>   DW_AT_decl_file   : 1
    <a0e>   DW_AT_decl_line   : 446
    <a10>   DW_AT_decl_column : 15
    <a11>   DW_AT_type        : <0x7f>
 <1><a15>: Abbrev Number: 16 (DW_TAG_variable)
    <a16>   DW_AT_name        : (indirect string, offset: 0xc6e7): SP7X$
    <a1a>   DW_AT_decl_file   : 1
    <a1b>   DW_AT_decl_line   : 446
    <a1d>   DW_AT_decl_column : 15
    <a1e>   DW_AT_type        : <0x7f>
 <1><a22>: Abbrev Number: 16 (DW_TAG_variable)
    <a23>   DW_AT_name        : (indirect string, offset: 0xc82a): SP7Y$
    <a27>   DW_AT_decl_file   : 1
    <a28>   DW_AT_decl_line   : 446
    <a2a>   DW_AT_decl_column : 15
    <a2b>   DW_AT_type        : <0x7f>
 <1><a2f>: Abbrev Number: 16 (DW_TAG_variable)
    <a30>   DW_AT_name        : (indirect string, offset: 0x1270): RASTR$
    <a34>   DW_AT_decl_file   : 1
    <a35>   DW_AT_decl_line   : 446
    <a37>   DW_AT_decl_column : 15
    <a38>   DW_AT_type        : <0x7f>
 <1><a3c>: Abbrev Number: 16 (DW_TAG_variable)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x1095b): SPENA$
    <a41>   DW_AT_decl_file   : 1
    <a42>   DW_AT_decl_line   : 446
    <a44>   DW_AT_decl_column : 15
    <a45>   DW_AT_type        : <0x7f>
 <1><a49>: Abbrev Number: 16 (DW_TAG_variable)
    <a4a>   DW_AT_name        : (indirect string, offset: 0xb93b): VMCSB$
    <a4e>   DW_AT_decl_file   : 1
    <a4f>   DW_AT_decl_line   : 446
    <a51>   DW_AT_decl_column : 15
    <a52>   DW_AT_type        : <0x7f>
 <1><a56>: Abbrev Number: 16 (DW_TAG_variable)
    <a57>   DW_AT_name        : (indirect string, offset: 0xaaee): EXTCOL$
    <a5b>   DW_AT_decl_file   : 1
    <a5c>   DW_AT_decl_line   : 446
    <a5e>   DW_AT_decl_column : 15
    <a5f>   DW_AT_type        : <0x7f>
 <1><a63>: Abbrev Number: 16 (DW_TAG_variable)
    <a64>   DW_AT_name        : (indirect string, offset: 0x12270): BGCOL0$
    <a68>   DW_AT_decl_file   : 1
    <a69>   DW_AT_decl_line   : 446
    <a6b>   DW_AT_decl_column : 15
    <a6c>   DW_AT_type        : <0x7f>
 <1><a70>: Abbrev Number: 16 (DW_TAG_variable)
    <a71>   DW_AT_name        : (indirect string, offset: 0x1235d): BGCOL1$
    <a75>   DW_AT_decl_file   : 1
    <a76>   DW_AT_decl_line   : 446
    <a78>   DW_AT_decl_column : 15
    <a79>   DW_AT_type        : <0x7f>
 <1><a7d>: Abbrev Number: 16 (DW_TAG_variable)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x1243c): BGCOL2$
    <a82>   DW_AT_decl_file   : 1
    <a83>   DW_AT_decl_line   : 446
    <a85>   DW_AT_decl_column : 15
    <a86>   DW_AT_type        : <0x7f>
 <1><a8a>: Abbrev Number: 16 (DW_TAG_variable)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x124b0): BGCOL3$
    <a8f>   DW_AT_decl_file   : 1
    <a90>   DW_AT_decl_line   : 446
    <a92>   DW_AT_decl_column : 15
    <a93>   DW_AT_type        : <0x7f>
 <1><a97>: Abbrev Number: 16 (DW_TAG_variable)
    <a98>   DW_AT_name        : (indirect string, offset: 0xfd8c): SP0COL$
    <a9c>   DW_AT_decl_file   : 1
    <a9d>   DW_AT_decl_line   : 446
    <a9f>   DW_AT_decl_column : 15
    <aa0>   DW_AT_type        : <0x7f>
 <1><aa4>: Abbrev Number: 16 (DW_TAG_variable)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x12cd6): SP1COL$
    <aa9>   DW_AT_decl_file   : 1
    <aaa>   DW_AT_decl_line   : 446
    <aac>   DW_AT_decl_column : 15
    <aad>   DW_AT_type        : <0x7f>
 <1><ab1>: Abbrev Number: 16 (DW_TAG_variable)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x311): SP2COL$
    <ab6>   DW_AT_decl_file   : 1
    <ab7>   DW_AT_decl_line   : 446
    <ab9>   DW_AT_decl_column : 15
    <aba>   DW_AT_type        : <0x7f>
 <1><abe>: Abbrev Number: 16 (DW_TAG_variable)
    <abf>   DW_AT_name        : (indirect string, offset: 0x3c2b): SP3COL$
    <ac3>   DW_AT_decl_file   : 1
    <ac4>   DW_AT_decl_line   : 446
    <ac6>   DW_AT_decl_column : 15
    <ac7>   DW_AT_type        : <0x7f>
 <1><acb>: Abbrev Number: 16 (DW_TAG_variable)
    <acc>   DW_AT_name        : (indirect string, offset: 0x6d7f): SP4COL$
    <ad0>   DW_AT_decl_file   : 1
    <ad1>   DW_AT_decl_line   : 446
    <ad3>   DW_AT_decl_column : 15
    <ad4>   DW_AT_type        : <0x7f>
 <1><ad8>: Abbrev Number: 16 (DW_TAG_variable)
    <ad9>   DW_AT_name        : (indirect string, offset: 0xa54d): SP5COL$
    <add>   DW_AT_decl_file   : 1
    <ade>   DW_AT_decl_line   : 446
    <ae0>   DW_AT_decl_column : 15
    <ae1>   DW_AT_type        : <0x7f>
 <1><ae5>: Abbrev Number: 16 (DW_TAG_variable)
    <ae6>   DW_AT_name        : (indirect string, offset: 0xdead): SP6COL$
    <aea>   DW_AT_decl_file   : 1
    <aeb>   DW_AT_decl_line   : 446
    <aed>   DW_AT_decl_column : 15
    <aee>   DW_AT_type        : <0x7f>
 <1><af2>: Abbrev Number: 16 (DW_TAG_variable)
    <af3>   DW_AT_name        : (indirect string, offset: 0x10eca): SP7COL$
    <af7>   DW_AT_decl_file   : 1
    <af8>   DW_AT_decl_line   : 446
    <afa>   DW_AT_decl_column : 15
    <afb>   DW_AT_type        : <0x7f>
 <1><aff>: Abbrev Number: 28 (DW_TAG_variable)
    <b00>   DW_AT_name        : (indirect string, offset: 0x66db): SWCH$
    <b04>   DW_AT_decl_file   : 1
    <b04>   DW_AT_decl_line   : 446
    <b06>   DW_AT_decl_column : 15
    <b07>   DW_AT_type        : <0x2a>
    <b0b>   DW_AT_external    : 1
    <b0b>   DW_AT_declaration : 1
 <1><b0b>: Abbrev Number: 28 (DW_TAG_variable)
    <b0c>   DW_AT_name        : (indirect string, offset: 0xf307): OFFSET$
    <b10>   DW_AT_decl_file   : 1
    <b10>   DW_AT_decl_line   : 446
    <b12>   DW_AT_decl_column : 15
    <b13>   DW_AT_type        : <0x2a>
    <b17>   DW_AT_external    : 1
    <b17>   DW_AT_declaration : 1
 <1><b17>: Abbrev Number: 28 (DW_TAG_variable)
    <b18>   DW_AT_name        : (indirect string, offset: 0x12765): IMAGE$
    <b1c>   DW_AT_decl_file   : 1
    <b1c>   DW_AT_decl_line   : 446
    <b1e>   DW_AT_decl_column : 14
    <b1f>   DW_AT_type        : <0x621>
    <b23>   DW_AT_external    : 1
    <b23>   DW_AT_declaration : 1
 <1><b23>: Abbrev Number: 28 (DW_TAG_variable)
    <b24>   DW_AT_name        : (indirect string, offset: 0x617f): STRCODE$
    <b28>   DW_AT_decl_file   : 1
    <b28>   DW_AT_decl_line   : 446
    <b2a>   DW_AT_decl_column : 17
    <b2b>   DW_AT_type        : <0x113>
    <b2f>   DW_AT_external    : 1
    <b2f>   DW_AT_declaration : 1
 <1><b2f>: Abbrev Number: 28 (DW_TAG_variable)
    <b30>   DW_AT_name        : (indirect string, offset: 0xc803): FILENAME$
    <b34>   DW_AT_decl_file   : 1
    <b34>   DW_AT_decl_line   : 446
    <b36>   DW_AT_decl_column : 17
    <b37>   DW_AT_type        : <0x113>
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_declaration : 1
 <1><b3b>: Abbrev Number: 9 (DW_TAG_variable)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x309d): GLCREATESHADER$
    <b40>   DW_AT_decl_file   : 1
    <b41>   DW_AT_decl_line   : 446
    <b43>   DW_AT_decl_column : 15
    <b44>   DW_AT_type        : <0x177>
    <b48>   DW_AT_location    : 9 byte block: 3 b8 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2eb8)
 <1><b52>: Abbrev Number: 9 (DW_TAG_variable)
    <b53>   DW_AT_name        : (indirect string, offset: 0x55d8): GLDELETESHADER$
    <b57>   DW_AT_decl_file   : 1
    <b58>   DW_AT_decl_line   : 446
    <b5a>   DW_AT_decl_column : 15
    <b5b>   DW_AT_type        : <0x197>
    <b5f>   DW_AT_location    : 9 byte block: 3 b0 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2eb0)
 <1><b69>: Abbrev Number: 9 (DW_TAG_variable)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x4337): GLSHADERSOURCE$
    <b6e>   DW_AT_decl_file   : 1
    <b6f>   DW_AT_decl_line   : 446
    <b71>   DW_AT_decl_column : 15
    <b72>   DW_AT_type        : <0x1b3>
    <b76>   DW_AT_location    : 9 byte block: 3 a8 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2ea8)
 <1><b80>: Abbrev Number: 9 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0x1615c): GLCOMPILESHADER$
    <b85>   DW_AT_decl_file   : 1
    <b86>   DW_AT_decl_line   : 446
    <b88>   DW_AT_decl_column : 15
    <b89>   DW_AT_type        : <0x197>
    <b8d>   DW_AT_location    : 9 byte block: 3 a0 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2ea0)
 <1><b97>: Abbrev Number: 9 (DW_TAG_variable)
    <b98>   DW_AT_name        : (indirect string, offset: 0xdb8f): GLGETSHADERIV$
    <b9c>   DW_AT_decl_file   : 1
    <b9d>   DW_AT_decl_line   : 446
    <b9f>   DW_AT_decl_column : 15
    <ba0>   DW_AT_type        : <0x1ed>
    <ba4>   DW_AT_location    : 9 byte block: 3 98 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e98)
 <1><bae>: Abbrev Number: 9 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x2273): GLGETSHADERINFOLOG$
    <bb3>   DW_AT_decl_file   : 1
    <bb4>   DW_AT_decl_line   : 446
    <bb6>   DW_AT_decl_column : 15
    <bb7>   DW_AT_type        : <0x213>
    <bbb>   DW_AT_location    : 9 byte block: 3 90 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e90)
 <1><bc5>: Abbrev Number: 9 (DW_TAG_variable)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x2e63): GLCREATEPROGRAM$
    <bca>   DW_AT_decl_file   : 1
    <bcb>   DW_AT_decl_line   : 446
    <bcd>   DW_AT_decl_column : 15
    <bce>   DW_AT_type        : <0x23e>
    <bd2>   DW_AT_location    : 9 byte block: 3 88 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e88)
 <1><bdc>: Abbrev Number: 9 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x12164): GLDELETEPROGRAM$
    <be1>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 446
    <be4>   DW_AT_decl_column : 15
    <be5>   DW_AT_type        : <0x197>
    <be9>   DW_AT_location    : 9 byte block: 3 80 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e80)
 <1><bf3>: Abbrev Number: 9 (DW_TAG_variable)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x16bd): GLATTACHSHADER$
    <bf8>   DW_AT_decl_file   : 1
    <bf9>   DW_AT_decl_line   : 446
    <bfb>   DW_AT_decl_column : 15
    <bfc>   DW_AT_type        : <0x254>
    <c00>   DW_AT_location    : 9 byte block: 3 78 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e78)
 <1><c0a>: Abbrev Number: 9 (DW_TAG_variable)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x2202): GLDETACHSHADER$
    <c0f>   DW_AT_decl_file   : 1
    <c10>   DW_AT_decl_line   : 446
    <c12>   DW_AT_decl_column : 15
    <c13>   DW_AT_type        : <0x254>
    <c17>   DW_AT_location    : 9 byte block: 3 70 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e70)
 <1><c21>: Abbrev Number: 9 (DW_TAG_variable)
    <c22>   DW_AT_name        : (indirect string, offset: 0xe633): GLLINKPROGRAM$
    <c26>   DW_AT_decl_file   : 1
    <c27>   DW_AT_decl_line   : 446
    <c29>   DW_AT_decl_column : 15
    <c2a>   DW_AT_type        : <0x197>
    <c2e>   DW_AT_location    : 9 byte block: 3 68 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e68)
 <1><c38>: Abbrev Number: 9 (DW_TAG_variable)
    <c39>   DW_AT_name        : (indirect string, offset: 0x2a56): GLGETPROGRAMIV$
    <c3d>   DW_AT_decl_file   : 1
    <c3e>   DW_AT_decl_line   : 446
    <c40>   DW_AT_decl_column : 15
    <c41>   DW_AT_type        : <0x1ed>
    <c45>   DW_AT_location    : 9 byte block: 3 60 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e60)
 <1><c4f>: Abbrev Number: 9 (DW_TAG_variable)
    <c50>   DW_AT_name        : (indirect string, offset: 0x11093): GLGETPROGRAMINFOLOG$
    <c54>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 446
    <c57>   DW_AT_decl_column : 15
    <c58>   DW_AT_type        : <0x213>
    <c5c>   DW_AT_location    : 9 byte block: 3 58 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e58)
 <1><c66>: Abbrev Number: 9 (DW_TAG_variable)
    <c67>   DW_AT_name        : (indirect string, offset: 0x5f15): GLUSEPROGRAM$
    <c6b>   DW_AT_decl_file   : 1
    <c6c>   DW_AT_decl_line   : 446
    <c6e>   DW_AT_decl_column : 15
    <c6f>   DW_AT_type        : <0x197>
    <c73>   DW_AT_location    : 9 byte block: 3 50 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e50)
 <1><c7d>: Abbrev Number: 9 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x6e4b): GLGETUNIFORMLOCATION$
    <c82>   DW_AT_decl_file   : 1
    <c83>   DW_AT_decl_line   : 446
    <c85>   DW_AT_decl_column : 15
    <c86>   DW_AT_type        : <0x275>
    <c8a>   DW_AT_location    : 9 byte block: 3 48 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e48)
 <1><c94>: Abbrev Number: 9 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0xbe06): GLUNIFORM1F$
    <c99>   DW_AT_decl_file   : 1
    <c9a>   DW_AT_decl_line   : 446
    <c9c>   DW_AT_decl_column : 15
    <c9d>   DW_AT_type        : <0x2bb>
    <ca1>   DW_AT_location    : 9 byte block: 3 40 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e40)
 <1><cab>: Abbrev Number: 58 (DW_TAG_typedef)
    <cac>   DW_AT_name        : (indirect string, offset: 0x5f84): tmp$94
    <cb0>   DW_AT_decl_file   : 1
    <cb0>   DW_AT_decl_line   : 446
    <cb2>   DW_AT_decl_column : 16
    <cb3>   DW_AT_type        : <0xcb7>
 <1><cb7>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <cb8>   DW_AT_byte_size   : 8
    <cb8>   DW_AT_type        : <0xcbc>
 <1><cbc>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <cbd>   DW_AT_prototyped  : 1
    <cbd>   DW_AT_sibling     : <0xcd1>
 <2><cc1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cc2>   DW_AT_type        : <0x92>
 <2><cc6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cc7>   DW_AT_type        : <0x31>
 <2><ccb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ccc>   DW_AT_type        : <0x31>
 <2><cd0>: Abbrev Number: 0
 <1><cd1>: Abbrev Number: 16 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x11c39): GLUNIFORM2F$
    <cd6>   DW_AT_decl_file   : 1
    <cd7>   DW_AT_decl_line   : 446
    <cd9>   DW_AT_decl_column : 15
    <cda>   DW_AT_type        : <0xcab>
 <1><cde>: Abbrev Number: 9 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x1ca6): GLUNIFORM3F$
    <ce3>   DW_AT_decl_file   : 1
    <ce4>   DW_AT_decl_line   : 446
    <ce6>   DW_AT_decl_column : 15
    <ce7>   DW_AT_type        : <0x2dc>
    <ceb>   DW_AT_location    : 9 byte block: 3 38 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e38)
 <1><cf5>: Abbrev Number: 16 (DW_TAG_variable)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x15ad0): GLUNIFORM3FV$
    <cfa>   DW_AT_decl_file   : 1
    <cfb>   DW_AT_decl_line   : 446
    <cfd>   DW_AT_decl_column : 15
    <cfe>   DW_AT_type        : <0x307>
 <1><d02>: Abbrev Number: 9 (DW_TAG_variable)
    <d03>   DW_AT_name        : (indirect string, offset: 0x7ae2): GLUNIFORM4F$
    <d07>   DW_AT_decl_file   : 1
    <d08>   DW_AT_decl_line   : 446
    <d0a>   DW_AT_decl_column : 15
    <d0b>   DW_AT_type        : <0x332>
    <d0f>   DW_AT_location    : 9 byte block: 3 30 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e30)
 <1><d19>: Abbrev Number: 16 (DW_TAG_variable)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x7426): GLUNIFORM4FV$
    <d1e>   DW_AT_decl_file   : 1
    <d1f>   DW_AT_decl_line   : 446
    <d21>   DW_AT_decl_column : 15
    <d22>   DW_AT_type        : <0x307>
 <1><d26>: Abbrev Number: 9 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0xc2de): GLUNIFORM1I$
    <d2b>   DW_AT_decl_file   : 1
    <d2c>   DW_AT_decl_line   : 446
    <d2e>   DW_AT_decl_column : 15
    <d2f>   DW_AT_type        : <0x29a>
    <d33>   DW_AT_location    : 9 byte block: 3 28 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e28)
 <1><d3d>: Abbrev Number: 41 (DW_TAG_variable)
    <d3e>   DW_AT_name        : PC$
    <d42>   DW_AT_decl_file   : 1
    <d42>   DW_AT_decl_line   : 446
    <d44>   DW_AT_decl_column : 15
    <d45>   DW_AT_type        : <0xc4>
    <d49>   DW_AT_location    : 9 byte block: 3 20 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e20)
 <1><d53>: Abbrev Number: 16 (DW_TAG_variable)
    <d54>   DW_AT_name        : (indirect string, offset: 0x1021b): ADR0$
    <d58>   DW_AT_decl_file   : 1
    <d59>   DW_AT_decl_line   : 446
    <d5b>   DW_AT_decl_column : 15
    <d5c>   DW_AT_type        : <0xc4>
 <1><d60>: Abbrev Number: 16 (DW_TAG_variable)
    <d61>   DW_AT_name        : (indirect string, offset: 0x102f0): ADR1$
    <d65>   DW_AT_decl_file   : 1
    <d66>   DW_AT_decl_line   : 446
    <d68>   DW_AT_decl_column : 15
    <d69>   DW_AT_type        : <0xc4>
 <1><d6d>: Abbrev Number: 16 (DW_TAG_variable)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x10418): ADR2$
    <d72>   DW_AT_decl_file   : 1
    <d73>   DW_AT_decl_line   : 446
    <d75>   DW_AT_decl_column : 15
    <d76>   DW_AT_type        : <0xc4>
 <1><d7a>: Abbrev Number: 16 (DW_TAG_variable)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x1046a): ADR3$
    <d7f>   DW_AT_decl_file   : 1
    <d80>   DW_AT_decl_line   : 446
    <d82>   DW_AT_decl_column : 15
    <d83>   DW_AT_type        : <0xc4>
 <1><d87>: Abbrev Number: 16 (DW_TAG_variable)
    <d88>   DW_AT_name        : (indirect string, offset: 0xe148): PC_STATUS$
    <d8c>   DW_AT_decl_file   : 1
    <d8d>   DW_AT_decl_line   : 446
    <d8f>   DW_AT_decl_column : 15
    <d90>   DW_AT_type        : <0xc4>
 <1><d94>: Abbrev Number: 32 (DW_TAG_variable)
    <d95>   DW_AT_name        : R0$
    <d99>   DW_AT_decl_file   : 1
    <d99>   DW_AT_decl_line   : 446
    <d9b>   DW_AT_decl_column : 15
    <d9c>   DW_AT_type        : <0x9e>
 <1><da0>: Abbrev Number: 32 (DW_TAG_variable)
    <da1>   DW_AT_name        : R1$
    <da5>   DW_AT_decl_file   : 1
    <da5>   DW_AT_decl_line   : 446
    <da7>   DW_AT_decl_column : 15
    <da8>   DW_AT_type        : <0x9e>
 <1><dac>: Abbrev Number: 32 (DW_TAG_variable)
    <dad>   DW_AT_name        : R2$
    <db1>   DW_AT_decl_file   : 1
    <db1>   DW_AT_decl_line   : 446
    <db3>   DW_AT_decl_column : 15
    <db4>   DW_AT_type        : <0x9e>
 <1><db8>: Abbrev Number: 41 (DW_TAG_variable)
    <db9>   DW_AT_name        : R3$
    <dbd>   DW_AT_decl_file   : 1
    <dbd>   DW_AT_decl_line   : 446
    <dbf>   DW_AT_decl_column : 15
    <dc0>   DW_AT_type        : <0x9e>
    <dc4>   DW_AT_location    : 9 byte block: 3 18 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e18)
 <1><dce>: Abbrev Number: 32 (DW_TAG_variable)
    <dcf>   DW_AT_name        : R4$
    <dd3>   DW_AT_decl_file   : 1
    <dd3>   DW_AT_decl_line   : 446
    <dd5>   DW_AT_decl_column : 15
    <dd6>   DW_AT_type        : <0x9e>
 <1><dda>: Abbrev Number: 32 (DW_TAG_variable)
    <ddb>   DW_AT_name        : R5$
    <ddf>   DW_AT_decl_file   : 1
    <ddf>   DW_AT_decl_line   : 446
    <de1>   DW_AT_decl_column : 15
    <de2>   DW_AT_type        : <0x9e>
 <1><de6>: Abbrev Number: 9 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0x8056): RADIUS$
    <deb>   DW_AT_decl_file   : 1
    <dec>   DW_AT_decl_line   : 446
    <dee>   DW_AT_decl_column : 15
    <def>   DW_AT_type        : <0xc4>
    <df3>   DW_AT_location    : 9 byte block: 3 10 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e10)
 <1><dfd>: Abbrev Number: 16 (DW_TAG_variable)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x12596): RED2$
    <e02>   DW_AT_decl_file   : 1
    <e03>   DW_AT_decl_line   : 446
    <e05>   DW_AT_decl_column : 15
    <e06>   DW_AT_type        : <0x9e>
 <1><e0a>: Abbrev Number: 16 (DW_TAG_variable)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x6f27): GREEN2$
    <e0f>   DW_AT_decl_file   : 1
    <e10>   DW_AT_decl_line   : 446
    <e12>   DW_AT_decl_column : 15
    <e13>   DW_AT_type        : <0x9e>
 <1><e17>: Abbrev Number: 16 (DW_TAG_variable)
    <e18>   DW_AT_name        : (indirect string, offset: 0x51de): BLUE2$
    <e1c>   DW_AT_decl_file   : 1
    <e1d>   DW_AT_decl_line   : 446
    <e1f>   DW_AT_decl_column : 15
    <e20>   DW_AT_type        : <0x9e>
 <1><e24>: Abbrev Number: 16 (DW_TAG_variable)
    <e25>   DW_AT_name        : (indirect string, offset: 0x174a): XALPHA2$
    <e29>   DW_AT_decl_file   : 1
    <e2a>   DW_AT_decl_line   : 446
    <e2c>   DW_AT_decl_column : 15
    <e2d>   DW_AT_type        : <0x9e>
 <1><e31>: Abbrev Number: 16 (DW_TAG_variable)
    <e32>   DW_AT_name        : (indirect string, offset: 0x1075a): X_AXIS0$
    <e36>   DW_AT_decl_file   : 1
    <e37>   DW_AT_decl_line   : 446
    <e39>   DW_AT_decl_column : 14
    <e3a>   DW_AT_type        : <0x31>
 <1><e3e>: Abbrev Number: 16 (DW_TAG_variable)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x68d8): Y_AXIS0$
    <e43>   DW_AT_decl_file   : 1
    <e44>   DW_AT_decl_line   : 446
    <e46>   DW_AT_decl_column : 14
    <e47>   DW_AT_type        : <0x31>
 <1><e4b>: Abbrev Number: 16 (DW_TAG_variable)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x128e9): Z_AXIS0$
    <e50>   DW_AT_decl_file   : 1
    <e51>   DW_AT_decl_line   : 446
    <e53>   DW_AT_decl_column : 14
    <e54>   DW_AT_type        : <0x31>
 <1><e58>: Abbrev Number: 16 (DW_TAG_variable)
    <e59>   DW_AT_name        : (indirect string, offset: 0x12272): COL0$
    <e5d>   DW_AT_decl_file   : 1
    <e5e>   DW_AT_decl_line   : 446
    <e60>   DW_AT_decl_column : 14
    <e61>   DW_AT_type        : <0x31>
 <1><e65>: Abbrev Number: 16 (DW_TAG_variable)
    <e66>   DW_AT_name        : (indirect string, offset: 0x1235f): COL1$
    <e6a>   DW_AT_decl_file   : 1
    <e6b>   DW_AT_decl_line   : 446
    <e6d>   DW_AT_decl_column : 14
    <e6e>   DW_AT_type        : <0x31>
 <1><e72>: Abbrev Number: 9 (DW_TAG_variable)
    <e73>   DW_AT_name        : (indirect string, offset: 0xbd53): CHAR_H$
    <e77>   DW_AT_decl_file   : 1
    <e78>   DW_AT_decl_line   : 446
    <e7a>   DW_AT_decl_column : 14
    <e7b>   DW_AT_type        : <0x31>
    <e7f>   DW_AT_location    : 9 byte block: 3 bc c6 47 0 0 0 0 0 	(DW_OP_addr: 47c6bc)
 <1><e89>: Abbrev Number: 16 (DW_TAG_variable)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x108b1): X_AXIS1$
    <e8e>   DW_AT_decl_file   : 1
    <e8f>   DW_AT_decl_line   : 446
    <e91>   DW_AT_decl_column : 14
    <e92>   DW_AT_type        : <0x31>
 <1><e96>: Abbrev Number: 16 (DW_TAG_variable)
    <e97>   DW_AT_name        : (indirect string, offset: 0x6a0f): Y_AXIS1$
    <e9b>   DW_AT_decl_file   : 1
    <e9c>   DW_AT_decl_line   : 446
    <e9e>   DW_AT_decl_column : 14
    <e9f>   DW_AT_type        : <0x31>
 <1><ea3>: Abbrev Number: 16 (DW_TAG_variable)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x12ab3): Z_AXIS1$
    <ea8>   DW_AT_decl_file   : 1
    <ea9>   DW_AT_decl_line   : 446
    <eab>   DW_AT_decl_column : 14
    <eac>   DW_AT_type        : <0x31>
 <1><eb0>: Abbrev Number: 16 (DW_TAG_variable)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xa864): CHAR_PTR$
    <eb5>   DW_AT_decl_file   : 1
    <eb6>   DW_AT_decl_line   : 446
    <eb8>   DW_AT_decl_column : 14
    <eb9>   DW_AT_type        : <0x31>
 <1><ebd>: Abbrev Number: 9 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xcf61): CHAR_W$
    <ec2>   DW_AT_decl_file   : 1
    <ec3>   DW_AT_decl_line   : 446
    <ec5>   DW_AT_decl_column : 14
    <ec6>   DW_AT_type        : <0x31>
    <eca>   DW_AT_location    : 9 byte block: 3 b8 c6 47 0 0 0 0 0 	(DW_OP_addr: 47c6b8)
 <1><ed4>: Abbrev Number: 9 (DW_TAG_variable)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xa2d9): CHAR_BUFFER$
    <ed9>   DW_AT_decl_file   : 1
    <eda>   DW_AT_decl_line   : 446
    <edc>   DW_AT_decl_column : 15
    <edd>   DW_AT_type        : <0x9e>
    <ee1>   DW_AT_location    : 9 byte block: 3 b4 c6 47 0 0 0 0 0 	(DW_OP_addr: 47c6b4)
 <1><eeb>: Abbrev Number: 9 (DW_TAG_variable)
    <eec>   DW_AT_name        : (indirect string, offset: 0x2242): BITMASK$
    <ef0>   DW_AT_decl_file   : 1
    <ef1>   DW_AT_decl_line   : 446
    <ef3>   DW_AT_decl_column : 15
    <ef4>   DW_AT_type        : <0x9e>
    <ef8>   DW_AT_location    : 9 byte block: 3 b0 c6 47 0 0 0 0 0 	(DW_OP_addr: 47c6b0)
 <1><f02>: Abbrev Number: 9 (DW_TAG_variable)
    <f03>   DW_AT_name        : (indirect string, offset: 0x12406): PIXEL_SIZE$
    <f07>   DW_AT_decl_file   : 1
    <f08>   DW_AT_decl_line   : 446
    <f0a>   DW_AT_decl_column : 15
    <f0b>   DW_AT_type        : <0x9e>
    <f0f>   DW_AT_location    : 9 byte block: 3 c 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e0c)
 <1><f19>: Abbrev Number: 9 (DW_TAG_variable)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x11f8b): STRING_ADR$
    <f1e>   DW_AT_decl_file   : 1
    <f1f>   DW_AT_decl_line   : 446
    <f21>   DW_AT_decl_column : 15
    <f22>   DW_AT_type        : <0x9e>
    <f26>   DW_AT_location    : 9 byte block: 3 8 2e 4a 0 0 0 0 0 	(DW_OP_addr: 4a2e08)
 <1><f30>: Abbrev Number: 16 (DW_TAG_variable)
    <f31>   DW_AT_name        : (indirect string, offset: 0x83a): STRING_LEN$
    <f35>   DW_AT_decl_file   : 1
    <f36>   DW_AT_decl_line   : 446
    <f38>   DW_AT_decl_column : 15
    <f39>   DW_AT_type        : <0x9e>
 <1><f3d>: Abbrev Number: 16 (DW_TAG_variable)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xa2a2): DRIVER_NAME$
    <f42>   DW_AT_decl_file   : 1
    <f43>   DW_AT_decl_line   : 446
    <f45>   DW_AT_decl_column : 17
    <f46>   DW_AT_type        : <0x113>
 <1><f4a>: Abbrev Number: 9 (DW_TAG_variable)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xc9bd): STRING_DATA$
    <f4f>   DW_AT_decl_file   : 1
    <f50>   DW_AT_decl_line   : 446
    <f52>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0x113>
    <f57>   DW_AT_location    : 9 byte block: 3 f0 2d 4a 0 0 0 0 0 	(DW_OP_addr: 4a2df0)
 <1><f61>: Abbrev Number: 16 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0xe37e): MOUSE_X$
    <f66>   DW_AT_decl_file   : 1
    <f67>   DW_AT_decl_line   : 446
    <f69>   DW_AT_decl_column : 14
    <f6a>   DW_AT_type        : <0x92>
 <1><f6e>: Abbrev Number: 16 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xe461): MOUSE_Y$
    <f73>   DW_AT_decl_file   : 1
    <f74>   DW_AT_decl_line   : 446
    <f76>   DW_AT_decl_column : 14
    <f77>   DW_AT_type        : <0x92>
 <1><f7b>: Abbrev Number: 16 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0xe2a4): MOUSE_W$
    <f80>   DW_AT_decl_file   : 1
    <f81>   DW_AT_decl_line   : 446
    <f83>   DW_AT_decl_column : 14
    <f84>   DW_AT_type        : <0x92>
 <1><f88>: Abbrev Number: 16 (DW_TAG_variable)
    <f89>   DW_AT_name        : (indirect string, offset: 0xc6fe): MOUSE_B$
    <f8d>   DW_AT_decl_file   : 1
    <f8e>   DW_AT_decl_line   : 446
    <f90>   DW_AT_decl_column : 14
    <f91>   DW_AT_type        : <0x92>
 <1><f95>: Abbrev Number: 16 (DW_TAG_variable)
    <f96>   DW_AT_name        : (indirect string, offset: 0xc853): MOUSE_C$
    <f9a>   DW_AT_decl_file   : 1
    <f9b>   DW_AT_decl_line   : 446
    <f9d>   DW_AT_decl_column : 14
    <f9e>   DW_AT_type        : <0x92>
 <1><fa2>: Abbrev Number: 16 (DW_TAG_variable)
    <fa3>   DW_AT_name        : (indirect string, offset: 0xe1c4): MOUSE_V$
    <fa7>   DW_AT_decl_file   : 1
    <fa8>   DW_AT_decl_line   : 446
    <faa>   DW_AT_decl_column : 14
    <fab>   DW_AT_type        : <0x92>
 <1><faf>: Abbrev Number: 16 (DW_TAG_variable)
    <fb0>   DW_AT_name        : (indirect string, offset: 0xfc20): JOYSTICK_ID$
    <fb4>   DW_AT_decl_file   : 1
    <fb5>   DW_AT_decl_line   : 446
    <fb7>   DW_AT_decl_column : 15
    <fb8>   DW_AT_type        : <0xc4>
 <1><fbc>: Abbrev Number: 16 (DW_TAG_variable)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x5c4c): JOYSTICK_B$
    <fc1>   DW_AT_decl_file   : 1
    <fc2>   DW_AT_decl_line   : 446
    <fc4>   DW_AT_decl_column : 15
    <fc5>   DW_AT_type        : <0xc4>
 <1><fc9>: Abbrev Number: 32 (DW_TAG_variable)
    <fca>   DW_AT_name        : A1$
    <fce>   DW_AT_decl_file   : 1
    <fce>   DW_AT_decl_line   : 446
    <fd0>   DW_AT_decl_column : 14
    <fd1>   DW_AT_type        : <0x31>
 <1><fd5>: Abbrev Number: 32 (DW_TAG_variable)
    <fd6>   DW_AT_name        : A2$
    <fda>   DW_AT_decl_file   : 1
    <fda>   DW_AT_decl_line   : 446
    <fdc>   DW_AT_decl_column : 14
    <fdd>   DW_AT_type        : <0x31>
 <1><fe1>: Abbrev Number: 32 (DW_TAG_variable)
    <fe2>   DW_AT_name        : A3$
    <fe6>   DW_AT_decl_file   : 1
    <fe6>   DW_AT_decl_line   : 446
    <fe8>   DW_AT_decl_column : 14
    <fe9>   DW_AT_type        : <0x31>
 <1><fed>: Abbrev Number: 32 (DW_TAG_variable)
    <fee>   DW_AT_name        : A4$
    <ff2>   DW_AT_decl_file   : 1
    <ff2>   DW_AT_decl_line   : 446
    <ff4>   DW_AT_decl_column : 14
    <ff5>   DW_AT_type        : <0x31>
 <1><ff9>: Abbrev Number: 32 (DW_TAG_variable)
    <ffa>   DW_AT_name        : A5$
    <ffe>   DW_AT_decl_file   : 1
    <ffe>   DW_AT_decl_line   : 446
    <1000>   DW_AT_decl_column : 14
    <1001>   DW_AT_type        : <0x31>
 <1><1005>: Abbrev Number: 32 (DW_TAG_variable)
    <1006>   DW_AT_name        : A6$
    <100a>   DW_AT_decl_file   : 1
    <100a>   DW_AT_decl_line   : 446
    <100c>   DW_AT_decl_column : 14
    <100d>   DW_AT_type        : <0x31>
 <1><1011>: Abbrev Number: 32 (DW_TAG_variable)
    <1012>   DW_AT_name        : A7$
    <1016>   DW_AT_decl_file   : 1
    <1016>   DW_AT_decl_line   : 446
    <1018>   DW_AT_decl_column : 14
    <1019>   DW_AT_type        : <0x31>
 <1><101d>: Abbrev Number: 32 (DW_TAG_variable)
    <101e>   DW_AT_name        : A8$
    <1022>   DW_AT_decl_file   : 1
    <1022>   DW_AT_decl_line   : 446
    <1024>   DW_AT_decl_column : 14
    <1025>   DW_AT_type        : <0x31>
 <1><1029>: Abbrev Number: 16 (DW_TAG_variable)
    <102a>   DW_AT_name        : (indirect string, offset: 0xde75): KEY$
    <102e>   DW_AT_decl_file   : 1
    <102f>   DW_AT_decl_line   : 446
    <1031>   DW_AT_decl_column : 14
    <1032>   DW_AT_type        : <0x59>
 <1><1036>: Abbrev Number: 23 (DW_TAG_array_type)
    <1037>   DW_AT_type        : <0x113>
    <103b>   DW_AT_sibling     : <0x1047>
 <2><103f>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <1040>   DW_AT_type        : <0x170>
    <1044>   DW_AT_upper_bound : 45055
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 16 (DW_TAG_variable)
    <1048>   DW_AT_name        : (indirect string, offset: 0x930d): VRAM$
    <104c>   DW_AT_decl_file   : 1
    <104d>   DW_AT_decl_line   : 446
    <104f>   DW_AT_decl_column : 17
    <1050>   DW_AT_type        : <0x1036>
 <1><1054>: Abbrev Number: 16 (DW_TAG_variable)
    <1055>   DW_AT_name        : (indirect string, offset: 0xde71): GET_KEY$
    <1059>   DW_AT_decl_file   : 1
    <105a>   DW_AT_decl_line   : 446
    <105c>   DW_AT_decl_column : 17
    <105d>   DW_AT_type        : <0x113>
 <1><1061>: Abbrev Number: 9 (DW_TAG_variable)
    <1062>   DW_AT_name        : (indirect string, offset: 0x1153d): GET_DATA$
    <1066>   DW_AT_decl_file   : 1
    <1067>   DW_AT_decl_line   : 446
    <1069>   DW_AT_decl_column : 17
    <106a>   DW_AT_type        : <0x113>
    <106e>   DW_AT_location    : 9 byte block: 3 d0 2d 4a 0 0 0 0 0 	(DW_OP_addr: 4a2dd0)
 <1><1078>: Abbrev Number: 23 (DW_TAG_array_type)
    <1079>   DW_AT_type        : <0x113>
    <107d>   DW_AT_sibling     : <0x1089>
 <2><1081>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <1082>   DW_AT_type        : <0x170>
    <1086>   DW_AT_upper_bound : 10000
 <2><1088>: Abbrev Number: 0
 <1><1089>: Abbrev Number: 16 (DW_TAG_variable)
    <108a>   DW_AT_name        : (indirect string, offset: 0xa30): OLD_DATA$
    <108e>   DW_AT_decl_file   : 1
    <108f>   DW_AT_decl_line   : 446
    <1091>   DW_AT_decl_column : 17
    <1092>   DW_AT_type        : <0x1078>
 <1><1096>: Abbrev Number: 16 (DW_TAG_variable)
    <1097>   DW_AT_name        : (indirect string, offset: 0x109): REPEAT$
    <109b>   DW_AT_decl_file   : 1
    <109c>   DW_AT_decl_line   : 446
    <109e>   DW_AT_decl_column : 14
    <109f>   DW_AT_type        : <0x6c>
 <1><10a3>: Abbrev Number: 41 (DW_TAG_variable)
    <10a4>   DW_AT_name        : I$
    <10a7>   DW_AT_decl_file   : 1
    <10a7>   DW_AT_decl_line   : 446
    <10a9>   DW_AT_decl_column : 14
    <10aa>   DW_AT_type        : <0xb1>
    <10ae>   DW_AT_location    : 9 byte block: 3 c8 2d 4a 0 0 0 0 0 	(DW_OP_addr: 4a2dc8)
 <1><10b8>: Abbrev Number: 9 (DW_TAG_variable)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xed2c): EOL$
    <10bd>   DW_AT_decl_file   : 1
    <10be>   DW_AT_decl_line   : 446
    <10c0>   DW_AT_decl_column : 17
    <10c1>   DW_AT_type        : <0x113>
    <10c5>   DW_AT_location    : 9 byte block: 3 b0 2d 4a 0 0 0 0 0 	(DW_OP_addr: 4a2db0)
 <1><10cf>: Abbrev Number: 23 (DW_TAG_array_type)
    <10d0>   DW_AT_type        : <0x59>
    <10d4>   DW_AT_sibling     : <0x10df>
 <2><10d8>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <10d9>   DW_AT_type        : <0x170>
    <10dd>   DW_AT_upper_bound : 15
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 9 (DW_TAG_variable)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x11e68): NIBBLES$
    <10e4>   DW_AT_decl_file   : 1
    <10e5>   DW_AT_decl_line   : 446
    <10e7>   DW_AT_decl_column : 14
    <10e8>   DW_AT_type        : <0x10cf>
    <10ec>   DW_AT_location    : 9 byte block: 3 a0 2d 4a 0 0 0 0 0 	(DW_OP_addr: 4a2da0)
 <1><10f6>: Abbrev Number: 23 (DW_TAG_array_type)
    <10f7>   DW_AT_type        : <0x59>
    <10fb>   DW_AT_sibling     : <0x1106>
 <2><10ff>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <1100>   DW_AT_type        : <0x170>
    <1104>   DW_AT_upper_bound : 255
 <2><1105>: Abbrev Number: 0
 <1><1106>: Abbrev Number: 9 (DW_TAG_variable)
    <1107>   DW_AT_name        : (indirect string, offset: 0x160a1): BYTES$
    <110b>   DW_AT_decl_file   : 1
    <110c>   DW_AT_decl_line   : 446
    <110e>   DW_AT_decl_column : 14
    <110f>   DW_AT_type        : <0x10f6>
    <1113>   DW_AT_location    : 9 byte block: 3 a0 2c 4a 0 0 0 0 0 	(DW_OP_addr: 4a2ca0)
 <1><111d>: Abbrev Number: 23 (DW_TAG_array_type)
    <111e>   DW_AT_type        : <0x7f>
    <1122>   DW_AT_sibling     : <0x112e>
 <2><1126>: Abbrev Number: 48 (DW_TAG_subrange_type)
    <1127>   DW_AT_type        : <0x170>
    <112b>   DW_AT_upper_bound : 65535
 <2><112d>: Abbrev Number: 0
 <1><112e>: Abbrev Number: 9 (DW_TAG_variable)
    <112f>   DW_AT_name        : (indirect string, offset: 0x7a3c): XWORDS$
    <1133>   DW_AT_decl_file   : 1
    <1134>   DW_AT_decl_line   : 446
    <1136>   DW_AT_decl_column : 15
    <1137>   DW_AT_type        : <0x111d>
    <113b>   DW_AT_location    : 9 byte block: 3 a0 2c 48 0 0 0 0 0 	(DW_OP_addr: 482ca0)
 <1><1145>: Abbrev Number: 41 (DW_TAG_variable)
    <1146>   DW_AT_name        : C$
    <1149>   DW_AT_decl_file   : 1
    <1149>   DW_AT_decl_line   : 446
    <114b>   DW_AT_decl_column : 14
    <114c>   DW_AT_type        : <0xb1>
    <1150>   DW_AT_location    : 9 byte block: 3 98 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c98)
 <1><115a>: Abbrev Number: 41 (DW_TAG_variable)
    <115b>   DW_AT_name        : X$
    <115e>   DW_AT_decl_file   : 1
    <115e>   DW_AT_decl_line   : 446
    <1160>   DW_AT_decl_column : 14
    <1161>   DW_AT_type        : <0xb1>
    <1165>   DW_AT_location    : 9 byte block: 3 90 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c90)
 <1><116f>: Abbrev Number: 41 (DW_TAG_variable)
    <1170>   DW_AT_name        : Y$
    <1173>   DW_AT_decl_file   : 1
    <1173>   DW_AT_decl_line   : 446
    <1175>   DW_AT_decl_column : 14
    <1176>   DW_AT_type        : <0xb1>
    <117a>   DW_AT_location    : 9 byte block: 3 88 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c88)
 <1><1184>: Abbrev Number: 41 (DW_TAG_variable)
    <1185>   DW_AT_name        : XS$
    <1189>   DW_AT_decl_file   : 1
    <1189>   DW_AT_decl_line   : 446
    <118b>   DW_AT_decl_column : 14
    <118c>   DW_AT_type        : <0xb1>
    <1190>   DW_AT_location    : 9 byte block: 3 80 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c80)
 <1><119a>: Abbrev Number: 41 (DW_TAG_variable)
    <119b>   DW_AT_name        : YS$
    <119f>   DW_AT_decl_file   : 1
    <119f>   DW_AT_decl_line   : 446
    <11a1>   DW_AT_decl_column : 14
    <11a2>   DW_AT_type        : <0xb1>
    <11a6>   DW_AT_location    : 9 byte block: 3 78 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c78)
 <1><11b0>: Abbrev Number: 16 (DW_TAG_variable)
    <11b1>   DW_AT_name        : (indirect string, offset: 0x27c0): CARY$
    <11b5>   DW_AT_decl_file   : 1
    <11b6>   DW_AT_decl_line   : 446
    <11b8>   DW_AT_decl_column : 14
    <11b9>   DW_AT_type        : <0xb1>
 <1><11bd>: Abbrev Number: 28 (DW_TAG_variable)
    <11be>   DW_AT_name        : (indirect string, offset: 0xf303): SYS_OFFSET$
    <11c2>   DW_AT_decl_file   : 1
    <11c2>   DW_AT_decl_line   : 446
    <11c4>   DW_AT_decl_column : 15
    <11c5>   DW_AT_type        : <0x2a>
    <11c9>   DW_AT_external    : 1
    <11c9>   DW_AT_declaration : 1
 <1><11c9>: Abbrev Number: 28 (DW_TAG_variable)
    <11ca>   DW_AT_name        : (indirect string, offset: 0x10771): STR_LEN$
    <11ce>   DW_AT_decl_file   : 1
    <11ce>   DW_AT_decl_line   : 446
    <11d0>   DW_AT_decl_column : 15
    <11d1>   DW_AT_type        : <0x2a>
    <11d5>   DW_AT_external    : 1
    <11d5>   DW_AT_declaration : 1
 <1><11d5>: Abbrev Number: 28 (DW_TAG_variable)
    <11d6>   DW_AT_name        : (indirect string, offset: 0xff03): CNT$
    <11da>   DW_AT_decl_file   : 1
    <11da>   DW_AT_decl_line   : 446
    <11dc>   DW_AT_decl_column : 15
    <11dd>   DW_AT_type        : <0x2a>
    <11e1>   DW_AT_external    : 1
    <11e1>   DW_AT_declaration : 1
 <1><11e1>: Abbrev Number: 28 (DW_TAG_variable)
    <11e2>   DW_AT_name        : (indirect string, offset: 0x12763): BGIMAGE$
    <11e6>   DW_AT_decl_file   : 1
    <11e6>   DW_AT_decl_line   : 446
    <11e8>   DW_AT_decl_column : 14
    <11e9>   DW_AT_type        : <0x621>
    <11ed>   DW_AT_external    : 1
    <11ed>   DW_AT_declaration : 1
 <1><11ed>: Abbrev Number: 28 (DW_TAG_variable)
    <11ee>   DW_AT_name        : (indirect string, offset: 0xc50): FGIMAGE$
    <11f2>   DW_AT_decl_file   : 1
    <11f2>   DW_AT_decl_line   : 446
    <11f4>   DW_AT_decl_column : 14
    <11f5>   DW_AT_type        : <0x621>
    <11f9>   DW_AT_external    : 1
    <11f9>   DW_AT_declaration : 1
 <1><11f9>: Abbrev Number: 28 (DW_TAG_variable)
    <11fa>   DW_AT_name        : (indirect string, offset: 0x4925): RASTER$
    <11fe>   DW_AT_decl_file   : 1
    <11fe>   DW_AT_decl_line   : 446
    <1200>   DW_AT_decl_column : 14
    <1201>   DW_AT_type        : <0x621>
    <1205>   DW_AT_external    : 1
    <1205>   DW_AT_declaration : 1
 <1><1205>: Abbrev Number: 28 (DW_TAG_variable)
    <1206>   DW_AT_name        : (indirect string, offset: 0x2297): PSCRN$
    <120a>   DW_AT_decl_file   : 1
    <120a>   DW_AT_decl_line   : 446
    <120c>   DW_AT_decl_column : 14
    <120d>   DW_AT_type        : <0x621>
    <1211>   DW_AT_external    : 1
    <1211>   DW_AT_declaration : 1
 <1><1211>: Abbrev Number: 28 (DW_TAG_variable)
    <1212>   DW_AT_name        : (indirect string, offset: 0x77c5): COMPILER$
    <1216>   DW_AT_decl_file   : 1
    <1216>   DW_AT_decl_line   : 446
    <1218>   DW_AT_decl_column : 17
    <1219>   DW_AT_type        : <0x113>
    <121d>   DW_AT_external    : 1
    <121d>   DW_AT_declaration : 1
 <1><121d>: Abbrev Number: 28 (DW_TAG_variable)
    <121e>   DW_AT_name        : (indirect string, offset: 0x4a02): SCR_W$
    <1222>   DW_AT_decl_file   : 1
    <1222>   DW_AT_decl_line   : 446
    <1224>   DW_AT_decl_column : 15
    <1225>   DW_AT_type        : <0xc4>
    <1229>   DW_AT_external    : 1
    <1229>   DW_AT_declaration : 1
 <1><1229>: Abbrev Number: 28 (DW_TAG_variable)
    <122a>   DW_AT_name        : (indirect string, offset: 0x3a32): SCR_H$
    <122e>   DW_AT_decl_file   : 1
    <122e>   DW_AT_decl_line   : 446
    <1230>   DW_AT_decl_column : 15
    <1231>   DW_AT_type        : <0xc4>
    <1235>   DW_AT_external    : 1
    <1235>   DW_AT_declaration : 1
 <1><1235>: Abbrev Number: 28 (DW_TAG_variable)
    <1236>   DW_AT_name        : (indirect string, offset: 0xa3d8): SCR_POS$
    <123a>   DW_AT_decl_file   : 1
    <123a>   DW_AT_decl_line   : 446
    <123c>   DW_AT_decl_column : 15
    <123d>   DW_AT_type        : <0xc4>
    <1241>   DW_AT_external    : 1
    <1241>   DW_AT_declaration : 1
 <1><1241>: Abbrev Number: 28 (DW_TAG_variable)
    <1242>   DW_AT_name        : (indirect string, offset: 0x2f24): IMGDATA$
    <1246>   DW_AT_decl_file   : 1
    <1246>   DW_AT_decl_line   : 446
    <1248>   DW_AT_decl_column : 15
    <1249>   DW_AT_type        : <0xc4>
    <124d>   DW_AT_external    : 1
    <124d>   DW_AT_declaration : 1
 <1><124d>: Abbrev Number: 28 (DW_TAG_variable)
    <124e>   DW_AT_name        : (indirect string, offset: 0xca4b): PITCH$
    <1252>   DW_AT_decl_file   : 1
    <1252>   DW_AT_decl_line   : 446
    <1254>   DW_AT_decl_column : 15
    <1255>   DW_AT_type        : <0xc4>
    <1259>   DW_AT_external    : 1
    <1259>   DW_AT_declaration : 1
 <1><1259>: Abbrev Number: 28 (DW_TAG_variable)
    <125a>   DW_AT_name        : (indirect string, offset: 0x960a): RENDER$
    <125e>   DW_AT_decl_file   : 1
    <125e>   DW_AT_decl_line   : 446
    <1260>   DW_AT_decl_column : 14
    <1261>   DW_AT_type        : <0x621>
    <1265>   DW_AT_external    : 1
    <1265>   DW_AT_declaration : 1
 <1><1265>: Abbrev Number: 28 (DW_TAG_variable)
    <1266>   DW_AT_name        : (indirect string, offset: 0xe1ea): MSG$
    <126a>   DW_AT_decl_file   : 1
    <126a>   DW_AT_decl_line   : 446
    <126c>   DW_AT_decl_column : 17
    <126d>   DW_AT_type        : <0x113>
    <1271>   DW_AT_external    : 1
    <1271>   DW_AT_declaration : 1
 <1><1271>: Abbrev Number: 41 (DW_TAG_variable)
    <1272>   DW_AT_name        : V$
    <1275>   DW_AT_decl_file   : 1
    <1275>   DW_AT_decl_line   : 446
    <1277>   DW_AT_decl_column : 23
    <1278>   DW_AT_type        : <0x623>
    <127c>   DW_AT_location    : 9 byte block: 3 70 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c70)
 <1><1286>: Abbrev Number: 32 (DW_TAG_variable)
    <1287>   DW_AT_name        : O$
    <128a>   DW_AT_decl_file   : 1
    <128a>   DW_AT_decl_line   : 446
    <128c>   DW_AT_decl_column : 23
    <128d>   DW_AT_type        : <0x623>
 <1><1291>: Abbrev Number: 9 (DW_TAG_variable)
    <1292>   DW_AT_name        : (indirect string, offset: 0x11d43): FLAG$
    <1296>   DW_AT_decl_file   : 1
    <1297>   DW_AT_decl_line   : 446
    <1299>   DW_AT_decl_column : 14
    <129a>   DW_AT_type        : <0xb1>
    <129e>   DW_AT_location    : 9 byte block: 3 68 2c 48 0 0 0 0 0 	(DW_OP_addr: 482c68)
 <1><12a8>: Abbrev Number: 88 (DW_TAG_structure_type)
    <12a9>   DW_AT_name        : (indirect string, offset: 0x9012): $14__FB_DATADESC$
    <12ad>   DW_AT_byte_size   : 10
    <12ae>   DW_AT_alignment   : 1
    <12af>   DW_AT_decl_file   : 1
    <12b0>   DW_AT_decl_line   : 447
    <12b2>   DW_AT_decl_column : 8
    <12b3>   DW_AT_sibling     : <0x12d0>
 <2><12b7>: Abbrev Number: 66 (DW_TAG_member)
    <12b8>   DW_AT_name        : (indirect string, offset: 0x125c4): TYPE
    <12bc>   DW_AT_decl_file   : 1
    <12bc>   DW_AT_decl_line   : 448
    <12be>   DW_AT_decl_column : 8
    <12be>   DW_AT_type        : <0x6c>
    <12c2>   DW_AT_alignment   : 1
    <12c2>   DW_AT_data_member_location: 0
 <2><12c3>: Abbrev Number: 66 (DW_TAG_member)
    <12c4>   DW_AT_name        : (indirect string, offset: 0x139a0): NODE
    <12c8>   DW_AT_decl_file   : 1
    <12c8>   DW_AT_decl_line   : 449
    <12ca>   DW_AT_decl_column : 8
    <12ca>   DW_AT_type        : <0x621>
    <12ce>   DW_AT_alignment   : 1
    <12ce>   DW_AT_data_member_location: 2
 <2><12cf>: Abbrev Number: 0
 <1><12d0>: Abbrev Number: 67 (DW_TAG_array_type)
    <12d1>   DW_AT_type        : <0x12a8>
    <12d5>   DW_AT_alignment   : 1
    <12d5>   DW_AT_sibling     : <0x12e0>
 <2><12d9>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <12da>   DW_AT_type        : <0x170>
    <12de>   DW_AT_upper_bound : 1
 <2><12df>: Abbrev Number: 0
 <1><12e0>: Abbrev Number: 9 (DW_TAG_variable)
    <12e1>   DW_AT_name        : (indirect string, offset: 0x3540): label$6968
    <12e5>   DW_AT_decl_file   : 1
    <12e6>   DW_AT_decl_line   : 446
    <12e8>   DW_AT_decl_column : 33
    <12e9>   DW_AT_type        : <0x12d0>
    <12ed>   DW_AT_location    : 9 byte block: 3 50 28 48 0 0 0 0 0 	(DW_OP_addr: 482850)
 <1><12f7>: Abbrev Number: 9 (DW_TAG_variable)
    <12f8>   DW_AT_name        : (indirect string, offset: 0x352a): label$6966
    <12fc>   DW_AT_decl_file   : 1
    <12fd>   DW_AT_decl_line   : 446
    <12ff>   DW_AT_decl_column : 33
    <1300>   DW_AT_type        : <0x12d0>
    <1304>   DW_AT_location    : 9 byte block: 3 30 28 48 0 0 0 0 0 	(DW_OP_addr: 482830)
 <1><130e>: Abbrev Number: 9 (DW_TAG_variable)
    <130f>   DW_AT_name        : (indirect string, offset: 0x3517): label$6964
    <1313>   DW_AT_decl_file   : 1
    <1314>   DW_AT_decl_line   : 446
    <1316>   DW_AT_decl_column : 33
    <1317>   DW_AT_type        : <0x12d0>
    <131b>   DW_AT_location    : 9 byte block: 3 10 28 48 0 0 0 0 0 	(DW_OP_addr: 482810)
 <1><1325>: Abbrev Number: 9 (DW_TAG_variable)
    <1326>   DW_AT_name        : (indirect string, offset: 0x3507): label$6962
    <132a>   DW_AT_decl_file   : 1
    <132b>   DW_AT_decl_line   : 446
    <132d>   DW_AT_decl_column : 33
    <132e>   DW_AT_type        : <0x12d0>
    <1332>   DW_AT_location    : 9 byte block: 3 f0 27 48 0 0 0 0 0 	(DW_OP_addr: 4827f0)
 <1><133c>: Abbrev Number: 9 (DW_TAG_variable)
    <133d>   DW_AT_name        : (indirect string, offset: 0x34f4): label$6960
    <1341>   DW_AT_decl_file   : 1
    <1342>   DW_AT_decl_line   : 446
    <1344>   DW_AT_decl_column : 33
    <1345>   DW_AT_type        : <0x12d0>
    <1349>   DW_AT_location    : 9 byte block: 3 d0 27 48 0 0 0 0 0 	(DW_OP_addr: 4827d0)
 <1><1353>: Abbrev Number: 9 (DW_TAG_variable)
    <1354>   DW_AT_name        : (indirect string, offset: 0x3323): label$6958
    <1358>   DW_AT_decl_file   : 1
    <1359>   DW_AT_decl_line   : 446
    <135b>   DW_AT_decl_column : 33
    <135c>   DW_AT_type        : <0x12d0>
    <1360>   DW_AT_location    : 9 byte block: 3 b0 27 48 0 0 0 0 0 	(DW_OP_addr: 4827b0)
 <1><136a>: Abbrev Number: 9 (DW_TAG_variable)
    <136b>   DW_AT_name        : (indirect string, offset: 0x330d): label$6956
    <136f>   DW_AT_decl_file   : 1
    <1370>   DW_AT_decl_line   : 446
    <1372>   DW_AT_decl_column : 33
    <1373>   DW_AT_type        : <0x12d0>
    <1377>   DW_AT_location    : 9 byte block: 3 90 27 48 0 0 0 0 0 	(DW_OP_addr: 482790)
 <1><1381>: Abbrev Number: 9 (DW_TAG_variable)
    <1382>   DW_AT_name        : (indirect string, offset: 0x32f7): label$6954
    <1386>   DW_AT_decl_file   : 1
    <1387>   DW_AT_decl_line   : 446
    <1389>   DW_AT_decl_column : 33
    <138a>   DW_AT_type        : <0x12d0>
    <138e>   DW_AT_location    : 9 byte block: 3 70 27 48 0 0 0 0 0 	(DW_OP_addr: 482770)
 <1><1398>: Abbrev Number: 9 (DW_TAG_variable)
    <1399>   DW_AT_name        : (indirect string, offset: 0x32ec): label$6952
    <139d>   DW_AT_decl_file   : 1
    <139e>   DW_AT_decl_line   : 446
    <13a0>   DW_AT_decl_column : 33
    <13a1>   DW_AT_type        : <0x12d0>
    <13a5>   DW_AT_location    : 9 byte block: 3 50 27 48 0 0 0 0 0 	(DW_OP_addr: 482750)
 <1><13af>: Abbrev Number: 9 (DW_TAG_variable)
    <13b0>   DW_AT_name        : (indirect string, offset: 0x32e1): label$6950
    <13b4>   DW_AT_decl_file   : 1
    <13b5>   DW_AT_decl_line   : 446
    <13b7>   DW_AT_decl_column : 33
    <13b8>   DW_AT_type        : <0x12d0>
