    <8e089>   DW_AT_decl_line   : 747
    <8e08b>   DW_AT_decl_column : 9
    <8e08b>   DW_AT_sibling     : <0x8e0e4>
 <2><8e08f>: Abbrev Number: 1 (DW_TAG_member)
    <8e090>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e094>   DW_AT_decl_file   : 12
    <8e095>   DW_AT_decl_line   : 748
    <8e097>   DW_AT_decl_column : 6
    <8e098>   DW_AT_type        : <0x8c3ef>
    <8e09c>   DW_AT_data_member_location: 0
 <2><8e09d>: Abbrev Number: 1 (DW_TAG_member)
    <8e09e>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e0a2>   DW_AT_decl_file   : 12
    <8e0a3>   DW_AT_decl_line   : 749
    <8e0a5>   DW_AT_decl_column : 16
    <8e0a6>   DW_AT_type        : <0x8c3c0>
    <8e0aa>   DW_AT_data_member_location: 8
 <2><8e0ab>: Abbrev Number: 1 (DW_TAG_member)
    <8e0ac>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e0b0>   DW_AT_decl_file   : 12
    <8e0b1>   DW_AT_decl_line   : 750
    <8e0b3>   DW_AT_decl_column : 7
    <8e0b4>   DW_AT_type        : <0x8c3ef>
    <8e0b8>   DW_AT_data_member_location: 16
 <2><8e0b9>: Abbrev Number: 1 (DW_TAG_member)
    <8e0ba>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e0be>   DW_AT_decl_file   : 12
    <8e0bf>   DW_AT_decl_line   : 751
    <8e0c1>   DW_AT_decl_column : 11
    <8e0c2>   DW_AT_type        : <0x8d87d>
    <8e0c6>   DW_AT_data_member_location: 24
 <2><8e0c7>: Abbrev Number: 1 (DW_TAG_member)
    <8e0c8>   DW_AT_name        : (indirect string, offset: 0x19973): parent
    <8e0cc>   DW_AT_decl_file   : 12
    <8e0cd>   DW_AT_decl_line   : 752
    <8e0cf>   DW_AT_decl_column : 9
    <8e0d0>   DW_AT_type        : <0x8cd6c>
    <8e0d4>   DW_AT_data_member_location: 32
 <2><8e0d5>: Abbrev Number: 1 (DW_TAG_member)
    <8e0d6>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e0da>   DW_AT_decl_file   : 12
    <8e0db>   DW_AT_decl_line   : 753
    <8e0dd>   DW_AT_decl_column : 9
    <8e0de>   DW_AT_type        : <0x8cd6c>
    <8e0e2>   DW_AT_data_member_location: 40
 <2><8e0e3>: Abbrev Number: 0
 <1><8e0e4>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e0e5>   DW_AT_name        : (indirect string, offset: 0x18998): XMapRequestEvent
    <8e0e9>   DW_AT_decl_file   : 12
    <8e0ea>   DW_AT_decl_line   : 754
    <8e0ec>   DW_AT_decl_column : 3
    <8e0ed>   DW_AT_type        : <0x8e087>
 <1><8e0f1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e0f2>   DW_AT_byte_size   : 72
    <8e0f3>   DW_AT_decl_file   : 12
    <8e0f3>   DW_AT_decl_line   : 756
    <8e0f5>   DW_AT_decl_column : 9
    <8e0f5>   DW_AT_sibling     : <0x8e182>
 <2><8e0f9>: Abbrev Number: 1 (DW_TAG_member)
    <8e0fa>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e0fe>   DW_AT_decl_file   : 12
    <8e0ff>   DW_AT_decl_line   : 757
    <8e101>   DW_AT_decl_column : 6
    <8e102>   DW_AT_type        : <0x8c3ef>
    <8e106>   DW_AT_data_member_location: 0
 <2><8e107>: Abbrev Number: 1 (DW_TAG_member)
    <8e108>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e10c>   DW_AT_decl_file   : 12
    <8e10d>   DW_AT_decl_line   : 758
    <8e10f>   DW_AT_decl_column : 16
    <8e110>   DW_AT_type        : <0x8c3c0>
    <8e114>   DW_AT_data_member_location: 8
 <2><8e115>: Abbrev Number: 1 (DW_TAG_member)
    <8e116>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e11a>   DW_AT_decl_file   : 12
    <8e11b>   DW_AT_decl_line   : 759
    <8e11d>   DW_AT_decl_column : 7
    <8e11e>   DW_AT_type        : <0x8c3ef>
    <8e122>   DW_AT_data_member_location: 16
 <2><8e123>: Abbrev Number: 1 (DW_TAG_member)
    <8e124>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e128>   DW_AT_decl_file   : 12
    <8e129>   DW_AT_decl_line   : 760
    <8e12b>   DW_AT_decl_column : 11
    <8e12c>   DW_AT_type        : <0x8d87d>
    <8e130>   DW_AT_data_member_location: 24
 <2><8e131>: Abbrev Number: 1 (DW_TAG_member)
    <8e132>   DW_AT_name        : (indirect string, offset: 0x1957d): event
    <8e136>   DW_AT_decl_file   : 12
    <8e137>   DW_AT_decl_line   : 761
    <8e139>   DW_AT_decl_column : 9
    <8e13a>   DW_AT_type        : <0x8cd6c>
    <8e13e>   DW_AT_data_member_location: 32
 <2><8e13f>: Abbrev Number: 1 (DW_TAG_member)
    <8e140>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e144>   DW_AT_decl_file   : 12
    <8e145>   DW_AT_decl_line   : 762
    <8e147>   DW_AT_decl_column : 9
    <8e148>   DW_AT_type        : <0x8cd6c>
    <8e14c>   DW_AT_data_member_location: 40
 <2><8e14d>: Abbrev Number: 1 (DW_TAG_member)
    <8e14e>   DW_AT_name        : (indirect string, offset: 0x19973): parent
    <8e152>   DW_AT_decl_file   : 12
    <8e153>   DW_AT_decl_line   : 763
    <8e155>   DW_AT_decl_column : 9
    <8e156>   DW_AT_type        : <0x8cd6c>
    <8e15a>   DW_AT_data_member_location: 48
 <2><8e15b>: Abbrev Number: 13 (DW_TAG_member)
    <8e15c>   DW_AT_name        : x
    <8e15e>   DW_AT_decl_file   : 12
    <8e15f>   DW_AT_decl_line   : 764
    <8e161>   DW_AT_decl_column : 6
    <8e162>   DW_AT_type        : <0x8c3ef>
    <8e166>   DW_AT_data_member_location: 56
 <2><8e167>: Abbrev Number: 13 (DW_TAG_member)
    <8e168>   DW_AT_name        : y
    <8e16a>   DW_AT_decl_file   : 12
    <8e16b>   DW_AT_decl_line   : 764
    <8e16d>   DW_AT_decl_column : 9
    <8e16e>   DW_AT_type        : <0x8c3ef>
    <8e172>   DW_AT_data_member_location: 60
 <2><8e173>: Abbrev Number: 1 (DW_TAG_member)
    <8e174>   DW_AT_name        : (indirect string, offset: 0x19190): override_redirect
    <8e178>   DW_AT_decl_file   : 12
    <8e179>   DW_AT_decl_line   : 765
    <8e17b>   DW_AT_decl_column : 7
    <8e17c>   DW_AT_type        : <0x8c3ef>
    <8e180>   DW_AT_data_member_location: 64
 <2><8e181>: Abbrev Number: 0
 <1><8e182>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e183>   DW_AT_name        : (indirect string, offset: 0x18a2a): XReparentEvent
    <8e187>   DW_AT_decl_file   : 12
    <8e188>   DW_AT_decl_line   : 766
    <8e18a>   DW_AT_decl_column : 3
    <8e18b>   DW_AT_type        : <0x8e0f1>
 <1><8e18f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e190>   DW_AT_byte_size   : 88
    <8e191>   DW_AT_decl_file   : 12
    <8e191>   DW_AT_decl_line   : 768
    <8e193>   DW_AT_decl_column : 9
    <8e193>   DW_AT_sibling     : <0x8e24a>
 <2><8e197>: Abbrev Number: 1 (DW_TAG_member)
    <8e198>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e19c>   DW_AT_decl_file   : 12
    <8e19d>   DW_AT_decl_line   : 769
    <8e19f>   DW_AT_decl_column : 6
    <8e1a0>   DW_AT_type        : <0x8c3ef>
    <8e1a4>   DW_AT_data_member_location: 0
 <2><8e1a5>: Abbrev Number: 1 (DW_TAG_member)
    <8e1a6>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e1aa>   DW_AT_decl_file   : 12
    <8e1ab>   DW_AT_decl_line   : 770
    <8e1ad>   DW_AT_decl_column : 16
    <8e1ae>   DW_AT_type        : <0x8c3c0>
    <8e1b2>   DW_AT_data_member_location: 8
 <2><8e1b3>: Abbrev Number: 1 (DW_TAG_member)
    <8e1b4>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e1b8>   DW_AT_decl_file   : 12
    <8e1b9>   DW_AT_decl_line   : 771
    <8e1bb>   DW_AT_decl_column : 7
    <8e1bc>   DW_AT_type        : <0x8c3ef>
    <8e1c0>   DW_AT_data_member_location: 16
 <2><8e1c1>: Abbrev Number: 1 (DW_TAG_member)
    <8e1c2>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e1c6>   DW_AT_decl_file   : 12
    <8e1c7>   DW_AT_decl_line   : 772
    <8e1c9>   DW_AT_decl_column : 11
    <8e1ca>   DW_AT_type        : <0x8d87d>
    <8e1ce>   DW_AT_data_member_location: 24
 <2><8e1cf>: Abbrev Number: 1 (DW_TAG_member)
    <8e1d0>   DW_AT_name        : (indirect string, offset: 0x1957d): event
    <8e1d4>   DW_AT_decl_file   : 12
    <8e1d5>   DW_AT_decl_line   : 773
    <8e1d7>   DW_AT_decl_column : 9
    <8e1d8>   DW_AT_type        : <0x8cd6c>
    <8e1dc>   DW_AT_data_member_location: 32
 <2><8e1dd>: Abbrev Number: 1 (DW_TAG_member)
    <8e1de>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e1e2>   DW_AT_decl_file   : 12
    <8e1e3>   DW_AT_decl_line   : 774
    <8e1e5>   DW_AT_decl_column : 9
    <8e1e6>   DW_AT_type        : <0x8cd6c>
    <8e1ea>   DW_AT_data_member_location: 40
 <2><8e1eb>: Abbrev Number: 13 (DW_TAG_member)
    <8e1ec>   DW_AT_name        : x
    <8e1ee>   DW_AT_decl_file   : 12
    <8e1ef>   DW_AT_decl_line   : 775
    <8e1f1>   DW_AT_decl_column : 6
    <8e1f2>   DW_AT_type        : <0x8c3ef>
    <8e1f6>   DW_AT_data_member_location: 48
 <2><8e1f7>: Abbrev Number: 13 (DW_TAG_member)
    <8e1f8>   DW_AT_name        : y
    <8e1fa>   DW_AT_decl_file   : 12
    <8e1fb>   DW_AT_decl_line   : 775
    <8e1fd>   DW_AT_decl_column : 9
    <8e1fe>   DW_AT_type        : <0x8c3ef>
    <8e202>   DW_AT_data_member_location: 52
 <2><8e203>: Abbrev Number: 1 (DW_TAG_member)
    <8e204>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8e208>   DW_AT_decl_file   : 12
    <8e209>   DW_AT_decl_line   : 776
    <8e20b>   DW_AT_decl_column : 6
    <8e20c>   DW_AT_type        : <0x8c3ef>
    <8e210>   DW_AT_data_member_location: 56
 <2><8e211>: Abbrev Number: 1 (DW_TAG_member)
    <8e212>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8e216>   DW_AT_decl_file   : 12
    <8e217>   DW_AT_decl_line   : 776
    <8e219>   DW_AT_decl_column : 13
    <8e21a>   DW_AT_type        : <0x8c3ef>
    <8e21e>   DW_AT_data_member_location: 60
 <2><8e21f>: Abbrev Number: 1 (DW_TAG_member)
    <8e220>   DW_AT_name        : (indirect string, offset: 0x18fe6): border_width
    <8e224>   DW_AT_decl_file   : 12
    <8e225>   DW_AT_decl_line   : 777
    <8e227>   DW_AT_decl_column : 6
    <8e228>   DW_AT_type        : <0x8c3ef>
    <8e22c>   DW_AT_data_member_location: 64
 <2><8e22d>: Abbrev Number: 1 (DW_TAG_member)
    <8e22e>   DW_AT_name        : (indirect string, offset: 0x189d0): above
    <8e232>   DW_AT_decl_file   : 12
    <8e233>   DW_AT_decl_line   : 778
    <8e235>   DW_AT_decl_column : 9
    <8e236>   DW_AT_type        : <0x8cd6c>
    <8e23a>   DW_AT_data_member_location: 72
 <2><8e23b>: Abbrev Number: 1 (DW_TAG_member)
    <8e23c>   DW_AT_name        : (indirect string, offset: 0x19190): override_redirect
    <8e240>   DW_AT_decl_file   : 12
    <8e241>   DW_AT_decl_line   : 779
    <8e243>   DW_AT_decl_column : 7
    <8e244>   DW_AT_type        : <0x8c3ef>
    <8e248>   DW_AT_data_member_location: 80
 <2><8e249>: Abbrev Number: 0
 <1><8e24a>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e24b>   DW_AT_name        : (indirect string, offset: 0x192d8): XConfigureEvent
    <8e24f>   DW_AT_decl_file   : 12
    <8e250>   DW_AT_decl_line   : 780
    <8e252>   DW_AT_decl_column : 3
    <8e253>   DW_AT_type        : <0x8e18f>
 <1><8e257>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e258>   DW_AT_byte_size   : 56
    <8e259>   DW_AT_decl_file   : 12
    <8e259>   DW_AT_decl_line   : 782
    <8e25b>   DW_AT_decl_column : 9
    <8e25b>   DW_AT_sibling     : <0x8e2cc>
 <2><8e25f>: Abbrev Number: 1 (DW_TAG_member)
    <8e260>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e264>   DW_AT_decl_file   : 12
    <8e265>   DW_AT_decl_line   : 783
    <8e267>   DW_AT_decl_column : 6
    <8e268>   DW_AT_type        : <0x8c3ef>
    <8e26c>   DW_AT_data_member_location: 0
 <2><8e26d>: Abbrev Number: 1 (DW_TAG_member)
    <8e26e>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e272>   DW_AT_decl_file   : 12
    <8e273>   DW_AT_decl_line   : 784
    <8e275>   DW_AT_decl_column : 16
    <8e276>   DW_AT_type        : <0x8c3c0>
    <8e27a>   DW_AT_data_member_location: 8
 <2><8e27b>: Abbrev Number: 1 (DW_TAG_member)
    <8e27c>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e280>   DW_AT_decl_file   : 12
    <8e281>   DW_AT_decl_line   : 785
    <8e283>   DW_AT_decl_column : 7
    <8e284>   DW_AT_type        : <0x8c3ef>
    <8e288>   DW_AT_data_member_location: 16
 <2><8e289>: Abbrev Number: 1 (DW_TAG_member)
    <8e28a>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e28e>   DW_AT_decl_file   : 12
    <8e28f>   DW_AT_decl_line   : 786
    <8e291>   DW_AT_decl_column : 11
    <8e292>   DW_AT_type        : <0x8d87d>
    <8e296>   DW_AT_data_member_location: 24
 <2><8e297>: Abbrev Number: 1 (DW_TAG_member)
    <8e298>   DW_AT_name        : (indirect string, offset: 0x1957d): event
    <8e29c>   DW_AT_decl_file   : 12
    <8e29d>   DW_AT_decl_line   : 787
    <8e29f>   DW_AT_decl_column : 9
    <8e2a0>   DW_AT_type        : <0x8cd6c>
    <8e2a4>   DW_AT_data_member_location: 32
 <2><8e2a5>: Abbrev Number: 1 (DW_TAG_member)
    <8e2a6>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e2aa>   DW_AT_decl_file   : 12
    <8e2ab>   DW_AT_decl_line   : 788
    <8e2ad>   DW_AT_decl_column : 9
    <8e2ae>   DW_AT_type        : <0x8cd6c>
    <8e2b2>   DW_AT_data_member_location: 40
 <2><8e2b3>: Abbrev Number: 13 (DW_TAG_member)
    <8e2b4>   DW_AT_name        : x
    <8e2b6>   DW_AT_decl_file   : 12
    <8e2b7>   DW_AT_decl_line   : 789
    <8e2b9>   DW_AT_decl_column : 6
    <8e2ba>   DW_AT_type        : <0x8c3ef>
    <8e2be>   DW_AT_data_member_location: 48
 <2><8e2bf>: Abbrev Number: 13 (DW_TAG_member)
    <8e2c0>   DW_AT_name        : y
    <8e2c2>   DW_AT_decl_file   : 12
    <8e2c3>   DW_AT_decl_line   : 789
    <8e2c5>   DW_AT_decl_column : 9
    <8e2c6>   DW_AT_type        : <0x8c3ef>
    <8e2ca>   DW_AT_data_member_location: 52
 <2><8e2cb>: Abbrev Number: 0
 <1><8e2cc>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e2cd>   DW_AT_name        : (indirect string, offset: 0x19bd5): XGravityEvent
    <8e2d1>   DW_AT_decl_file   : 12
    <8e2d2>   DW_AT_decl_line   : 790
    <8e2d4>   DW_AT_decl_column : 3
    <8e2d5>   DW_AT_type        : <0x8e257>
 <1><8e2d9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e2da>   DW_AT_byte_size   : 48
    <8e2db>   DW_AT_decl_file   : 12
    <8e2db>   DW_AT_decl_line   : 792
    <8e2dd>   DW_AT_decl_column : 9
    <8e2dd>   DW_AT_sibling     : <0x8e344>
 <2><8e2e1>: Abbrev Number: 1 (DW_TAG_member)
    <8e2e2>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e2e6>   DW_AT_decl_file   : 12
    <8e2e7>   DW_AT_decl_line   : 793
    <8e2e9>   DW_AT_decl_column : 6
    <8e2ea>   DW_AT_type        : <0x8c3ef>
    <8e2ee>   DW_AT_data_member_location: 0
 <2><8e2ef>: Abbrev Number: 1 (DW_TAG_member)
    <8e2f0>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e2f4>   DW_AT_decl_file   : 12
    <8e2f5>   DW_AT_decl_line   : 794
    <8e2f7>   DW_AT_decl_column : 16
    <8e2f8>   DW_AT_type        : <0x8c3c0>
    <8e2fc>   DW_AT_data_member_location: 8
 <2><8e2fd>: Abbrev Number: 1 (DW_TAG_member)
    <8e2fe>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e302>   DW_AT_decl_file   : 12
    <8e303>   DW_AT_decl_line   : 795
    <8e305>   DW_AT_decl_column : 7
    <8e306>   DW_AT_type        : <0x8c3ef>
    <8e30a>   DW_AT_data_member_location: 16
 <2><8e30b>: Abbrev Number: 1 (DW_TAG_member)
    <8e30c>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e310>   DW_AT_decl_file   : 12
    <8e311>   DW_AT_decl_line   : 796
    <8e313>   DW_AT_decl_column : 11
    <8e314>   DW_AT_type        : <0x8d87d>
    <8e318>   DW_AT_data_member_location: 24
 <2><8e319>: Abbrev Number: 1 (DW_TAG_member)
    <8e31a>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e31e>   DW_AT_decl_file   : 12
    <8e31f>   DW_AT_decl_line   : 797
    <8e321>   DW_AT_decl_column : 9
    <8e322>   DW_AT_type        : <0x8cd6c>
    <8e326>   DW_AT_data_member_location: 32
 <2><8e327>: Abbrev Number: 1 (DW_TAG_member)
    <8e328>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8e32c>   DW_AT_decl_file   : 12
    <8e32d>   DW_AT_decl_line   : 798
    <8e32f>   DW_AT_decl_column : 6
    <8e330>   DW_AT_type        : <0x8c3ef>
    <8e334>   DW_AT_data_member_location: 40
 <2><8e335>: Abbrev Number: 1 (DW_TAG_member)
    <8e336>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8e33a>   DW_AT_decl_file   : 12
    <8e33b>   DW_AT_decl_line   : 798
    <8e33d>   DW_AT_decl_column : 13
    <8e33e>   DW_AT_type        : <0x8c3ef>
    <8e342>   DW_AT_data_member_location: 44
 <2><8e343>: Abbrev Number: 0
 <1><8e344>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e345>   DW_AT_name        : (indirect string, offset: 0x19b2b): XResizeRequestEvent
    <8e349>   DW_AT_decl_file   : 12
    <8e34a>   DW_AT_decl_line   : 799
    <8e34c>   DW_AT_decl_column : 3
    <8e34d>   DW_AT_type        : <0x8e2d9>
 <1><8e351>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e352>   DW_AT_byte_size   : 96
    <8e353>   DW_AT_decl_file   : 12
    <8e353>   DW_AT_decl_line   : 801
    <8e355>   DW_AT_decl_column : 9
    <8e355>   DW_AT_sibling     : <0x8e41a>
 <2><8e359>: Abbrev Number: 1 (DW_TAG_member)
    <8e35a>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e35e>   DW_AT_decl_file   : 12
    <8e35f>   DW_AT_decl_line   : 802
    <8e361>   DW_AT_decl_column : 6
    <8e362>   DW_AT_type        : <0x8c3ef>
    <8e366>   DW_AT_data_member_location: 0
 <2><8e367>: Abbrev Number: 1 (DW_TAG_member)
    <8e368>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e36c>   DW_AT_decl_file   : 12
    <8e36d>   DW_AT_decl_line   : 803
    <8e36f>   DW_AT_decl_column : 16
    <8e370>   DW_AT_type        : <0x8c3c0>
    <8e374>   DW_AT_data_member_location: 8
 <2><8e375>: Abbrev Number: 1 (DW_TAG_member)
    <8e376>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e37a>   DW_AT_decl_file   : 12
    <8e37b>   DW_AT_decl_line   : 804
    <8e37d>   DW_AT_decl_column : 7
    <8e37e>   DW_AT_type        : <0x8c3ef>
    <8e382>   DW_AT_data_member_location: 16
 <2><8e383>: Abbrev Number: 1 (DW_TAG_member)
    <8e384>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e388>   DW_AT_decl_file   : 12
    <8e389>   DW_AT_decl_line   : 805
    <8e38b>   DW_AT_decl_column : 11
    <8e38c>   DW_AT_type        : <0x8d87d>
    <8e390>   DW_AT_data_member_location: 24
 <2><8e391>: Abbrev Number: 1 (DW_TAG_member)
    <8e392>   DW_AT_name        : (indirect string, offset: 0x19973): parent
    <8e396>   DW_AT_decl_file   : 12
    <8e397>   DW_AT_decl_line   : 806
    <8e399>   DW_AT_decl_column : 9
    <8e39a>   DW_AT_type        : <0x8cd6c>
    <8e39e>   DW_AT_data_member_location: 32
 <2><8e39f>: Abbrev Number: 1 (DW_TAG_member)
    <8e3a0>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e3a4>   DW_AT_decl_file   : 12
    <8e3a5>   DW_AT_decl_line   : 807
    <8e3a7>   DW_AT_decl_column : 9
    <8e3a8>   DW_AT_type        : <0x8cd6c>
    <8e3ac>   DW_AT_data_member_location: 40
 <2><8e3ad>: Abbrev Number: 13 (DW_TAG_member)
    <8e3ae>   DW_AT_name        : x
    <8e3b0>   DW_AT_decl_file   : 12
    <8e3b1>   DW_AT_decl_line   : 808
    <8e3b3>   DW_AT_decl_column : 6
    <8e3b4>   DW_AT_type        : <0x8c3ef>
    <8e3b8>   DW_AT_data_member_location: 48
 <2><8e3b9>: Abbrev Number: 13 (DW_TAG_member)
    <8e3ba>   DW_AT_name        : y
    <8e3bc>   DW_AT_decl_file   : 12
    <8e3bd>   DW_AT_decl_line   : 808
    <8e3bf>   DW_AT_decl_column : 9
    <8e3c0>   DW_AT_type        : <0x8c3ef>
    <8e3c4>   DW_AT_data_member_location: 52
 <2><8e3c5>: Abbrev Number: 1 (DW_TAG_member)
    <8e3c6>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8e3ca>   DW_AT_decl_file   : 12
    <8e3cb>   DW_AT_decl_line   : 809
    <8e3cd>   DW_AT_decl_column : 6
    <8e3ce>   DW_AT_type        : <0x8c3ef>
    <8e3d2>   DW_AT_data_member_location: 56
 <2><8e3d3>: Abbrev Number: 1 (DW_TAG_member)
    <8e3d4>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8e3d8>   DW_AT_decl_file   : 12
    <8e3d9>   DW_AT_decl_line   : 809
    <8e3db>   DW_AT_decl_column : 13
    <8e3dc>   DW_AT_type        : <0x8c3ef>
    <8e3e0>   DW_AT_data_member_location: 60
 <2><8e3e1>: Abbrev Number: 1 (DW_TAG_member)
    <8e3e2>   DW_AT_name        : (indirect string, offset: 0x18fe6): border_width
    <8e3e6>   DW_AT_decl_file   : 12
    <8e3e7>   DW_AT_decl_line   : 810
    <8e3e9>   DW_AT_decl_column : 6
    <8e3ea>   DW_AT_type        : <0x8c3ef>
    <8e3ee>   DW_AT_data_member_location: 64
 <2><8e3ef>: Abbrev Number: 1 (DW_TAG_member)
    <8e3f0>   DW_AT_name        : (indirect string, offset: 0x189d0): above
    <8e3f4>   DW_AT_decl_file   : 12
    <8e3f5>   DW_AT_decl_line   : 811
    <8e3f7>   DW_AT_decl_column : 9
    <8e3f8>   DW_AT_type        : <0x8cd6c>
    <8e3fc>   DW_AT_data_member_location: 72
 <2><8e3fd>: Abbrev Number: 1 (DW_TAG_member)
    <8e3fe>   DW_AT_name        : (indirect string, offset: 0x18592): detail
    <8e402>   DW_AT_decl_file   : 12
    <8e403>   DW_AT_decl_line   : 812
    <8e405>   DW_AT_decl_column : 6
    <8e406>   DW_AT_type        : <0x8c3ef>
    <8e40a>   DW_AT_data_member_location: 80
 <2><8e40b>: Abbrev Number: 1 (DW_TAG_member)
    <8e40c>   DW_AT_name        : (indirect string, offset: 0x19082): value_mask
    <8e410>   DW_AT_decl_file   : 12
    <8e411>   DW_AT_decl_line   : 813
    <8e413>   DW_AT_decl_column : 16
    <8e414>   DW_AT_type        : <0x8c3c0>
    <8e418>   DW_AT_data_member_location: 88
 <2><8e419>: Abbrev Number: 0
 <1><8e41a>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e41b>   DW_AT_name        : (indirect string, offset: 0x18cbe): XConfigureRequestEvent
    <8e41f>   DW_AT_decl_file   : 12
    <8e420>   DW_AT_decl_line   : 814
    <8e422>   DW_AT_decl_column : 3
    <8e423>   DW_AT_type        : <0x8e351>
 <1><8e427>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e428>   DW_AT_byte_size   : 56
    <8e429>   DW_AT_decl_file   : 12
    <8e429>   DW_AT_decl_line   : 816
    <8e42b>   DW_AT_decl_column : 9
    <8e42b>   DW_AT_sibling     : <0x8e492>
 <2><8e42f>: Abbrev Number: 1 (DW_TAG_member)
    <8e430>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e434>   DW_AT_decl_file   : 12
    <8e435>   DW_AT_decl_line   : 817
    <8e437>   DW_AT_decl_column : 6
    <8e438>   DW_AT_type        : <0x8c3ef>
    <8e43c>   DW_AT_data_member_location: 0
 <2><8e43d>: Abbrev Number: 1 (DW_TAG_member)
    <8e43e>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e442>   DW_AT_decl_file   : 12
    <8e443>   DW_AT_decl_line   : 818
    <8e445>   DW_AT_decl_column : 16
    <8e446>   DW_AT_type        : <0x8c3c0>
    <8e44a>   DW_AT_data_member_location: 8
 <2><8e44b>: Abbrev Number: 1 (DW_TAG_member)
    <8e44c>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e450>   DW_AT_decl_file   : 12
    <8e451>   DW_AT_decl_line   : 819
    <8e453>   DW_AT_decl_column : 7
    <8e454>   DW_AT_type        : <0x8c3ef>
    <8e458>   DW_AT_data_member_location: 16
 <2><8e459>: Abbrev Number: 1 (DW_TAG_member)
    <8e45a>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e45e>   DW_AT_decl_file   : 12
    <8e45f>   DW_AT_decl_line   : 820
    <8e461>   DW_AT_decl_column : 11
    <8e462>   DW_AT_type        : <0x8d87d>
    <8e466>   DW_AT_data_member_location: 24
 <2><8e467>: Abbrev Number: 1 (DW_TAG_member)
    <8e468>   DW_AT_name        : (indirect string, offset: 0x1957d): event
    <8e46c>   DW_AT_decl_file   : 12
    <8e46d>   DW_AT_decl_line   : 821
    <8e46f>   DW_AT_decl_column : 9
    <8e470>   DW_AT_type        : <0x8cd6c>
    <8e474>   DW_AT_data_member_location: 32
 <2><8e475>: Abbrev Number: 1 (DW_TAG_member)
    <8e476>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e47a>   DW_AT_decl_file   : 12
    <8e47b>   DW_AT_decl_line   : 822
    <8e47d>   DW_AT_decl_column : 9
    <8e47e>   DW_AT_type        : <0x8cd6c>
    <8e482>   DW_AT_data_member_location: 40
 <2><8e483>: Abbrev Number: 1 (DW_TAG_member)
    <8e484>   DW_AT_name        : (indirect string, offset: 0x1910b): place
    <8e488>   DW_AT_decl_file   : 12
    <8e489>   DW_AT_decl_line   : 823
    <8e48b>   DW_AT_decl_column : 6
    <8e48c>   DW_AT_type        : <0x8c3ef>
    <8e490>   DW_AT_data_member_location: 48
 <2><8e491>: Abbrev Number: 0
 <1><8e492>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e493>   DW_AT_name        : (indirect string, offset: 0x19631): XCirculateEvent
    <8e497>   DW_AT_decl_file   : 12
    <8e498>   DW_AT_decl_line   : 824
    <8e49a>   DW_AT_decl_column : 3
    <8e49b>   DW_AT_type        : <0x8e427>
 <1><8e49f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e4a0>   DW_AT_byte_size   : 56
    <8e4a1>   DW_AT_decl_file   : 12
    <8e4a1>   DW_AT_decl_line   : 826
    <8e4a3>   DW_AT_decl_column : 9
    <8e4a3>   DW_AT_sibling     : <0x8e50a>
 <2><8e4a7>: Abbrev Number: 1 (DW_TAG_member)
    <8e4a8>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e4ac>   DW_AT_decl_file   : 12
    <8e4ad>   DW_AT_decl_line   : 827
    <8e4af>   DW_AT_decl_column : 6
    <8e4b0>   DW_AT_type        : <0x8c3ef>
    <8e4b4>   DW_AT_data_member_location: 0
 <2><8e4b5>: Abbrev Number: 1 (DW_TAG_member)
    <8e4b6>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e4ba>   DW_AT_decl_file   : 12
    <8e4bb>   DW_AT_decl_line   : 828
    <8e4bd>   DW_AT_decl_column : 16
    <8e4be>   DW_AT_type        : <0x8c3c0>
    <8e4c2>   DW_AT_data_member_location: 8
 <2><8e4c3>: Abbrev Number: 1 (DW_TAG_member)
    <8e4c4>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e4c8>   DW_AT_decl_file   : 12
    <8e4c9>   DW_AT_decl_line   : 829
    <8e4cb>   DW_AT_decl_column : 7
    <8e4cc>   DW_AT_type        : <0x8c3ef>
    <8e4d0>   DW_AT_data_member_location: 16
 <2><8e4d1>: Abbrev Number: 1 (DW_TAG_member)
    <8e4d2>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e4d6>   DW_AT_decl_file   : 12
    <8e4d7>   DW_AT_decl_line   : 830
    <8e4d9>   DW_AT_decl_column : 11
    <8e4da>   DW_AT_type        : <0x8d87d>
    <8e4de>   DW_AT_data_member_location: 24
 <2><8e4df>: Abbrev Number: 1 (DW_TAG_member)
    <8e4e0>   DW_AT_name        : (indirect string, offset: 0x19973): parent
    <8e4e4>   DW_AT_decl_file   : 12
    <8e4e5>   DW_AT_decl_line   : 831
    <8e4e7>   DW_AT_decl_column : 9
    <8e4e8>   DW_AT_type        : <0x8cd6c>
    <8e4ec>   DW_AT_data_member_location: 32
 <2><8e4ed>: Abbrev Number: 1 (DW_TAG_member)
    <8e4ee>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e4f2>   DW_AT_decl_file   : 12
    <8e4f3>   DW_AT_decl_line   : 832
    <8e4f5>   DW_AT_decl_column : 9
    <8e4f6>   DW_AT_type        : <0x8cd6c>
    <8e4fa>   DW_AT_data_member_location: 40
 <2><8e4fb>: Abbrev Number: 1 (DW_TAG_member)
    <8e4fc>   DW_AT_name        : (indirect string, offset: 0x1910b): place
    <8e500>   DW_AT_decl_file   : 12
    <8e501>   DW_AT_decl_line   : 833
    <8e503>   DW_AT_decl_column : 6
    <8e504>   DW_AT_type        : <0x8c3ef>
    <8e508>   DW_AT_data_member_location: 48
 <2><8e509>: Abbrev Number: 0
 <1><8e50a>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e50b>   DW_AT_name        : (indirect string, offset: 0x18e4c): XCirculateRequestEvent
    <8e50f>   DW_AT_decl_file   : 12
    <8e510>   DW_AT_decl_line   : 834
    <8e512>   DW_AT_decl_column : 3
    <8e513>   DW_AT_type        : <0x8e49f>
 <1><8e517>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e518>   DW_AT_byte_size   : 64
    <8e519>   DW_AT_decl_file   : 12
    <8e519>   DW_AT_decl_line   : 836
    <8e51b>   DW_AT_decl_column : 9
    <8e51b>   DW_AT_sibling     : <0x8e590>
 <2><8e51f>: Abbrev Number: 1 (DW_TAG_member)
    <8e520>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e524>   DW_AT_decl_file   : 12
    <8e525>   DW_AT_decl_line   : 837
    <8e527>   DW_AT_decl_column : 6
    <8e528>   DW_AT_type        : <0x8c3ef>
    <8e52c>   DW_AT_data_member_location: 0
 <2><8e52d>: Abbrev Number: 1 (DW_TAG_member)
    <8e52e>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e532>   DW_AT_decl_file   : 12
    <8e533>   DW_AT_decl_line   : 838
    <8e535>   DW_AT_decl_column : 16
    <8e536>   DW_AT_type        : <0x8c3c0>
    <8e53a>   DW_AT_data_member_location: 8
 <2><8e53b>: Abbrev Number: 1 (DW_TAG_member)
    <8e53c>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e540>   DW_AT_decl_file   : 12
    <8e541>   DW_AT_decl_line   : 839
    <8e543>   DW_AT_decl_column : 7
    <8e544>   DW_AT_type        : <0x8c3ef>
    <8e548>   DW_AT_data_member_location: 16
 <2><8e549>: Abbrev Number: 1 (DW_TAG_member)
    <8e54a>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e54e>   DW_AT_decl_file   : 12
    <8e54f>   DW_AT_decl_line   : 840
    <8e551>   DW_AT_decl_column : 11
    <8e552>   DW_AT_type        : <0x8d87d>
    <8e556>   DW_AT_data_member_location: 24
 <2><8e557>: Abbrev Number: 1 (DW_TAG_member)
    <8e558>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e55c>   DW_AT_decl_file   : 12
    <8e55d>   DW_AT_decl_line   : 841
    <8e55f>   DW_AT_decl_column : 9
    <8e560>   DW_AT_type        : <0x8cd6c>
    <8e564>   DW_AT_data_member_location: 32
 <2><8e565>: Abbrev Number: 1 (DW_TAG_member)
    <8e566>   DW_AT_name        : (indirect string, offset: 0x18762): atom
    <8e56a>   DW_AT_decl_file   : 12
    <8e56b>   DW_AT_decl_line   : 842
    <8e56d>   DW_AT_decl_column : 7
    <8e56e>   DW_AT_type        : <0x8cd48>
    <8e572>   DW_AT_data_member_location: 40
 <2><8e573>: Abbrev Number: 1 (DW_TAG_member)
    <8e574>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <8e578>   DW_AT_decl_file   : 12
    <8e579>   DW_AT_decl_line   : 843
    <8e57b>   DW_AT_decl_column : 7
    <8e57c>   DW_AT_type        : <0x8cd60>
    <8e580>   DW_AT_data_member_location: 48
 <2><8e581>: Abbrev Number: 1 (DW_TAG_member)
    <8e582>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <8e586>   DW_AT_decl_file   : 12
    <8e587>   DW_AT_decl_line   : 844
    <8e589>   DW_AT_decl_column : 6
    <8e58a>   DW_AT_type        : <0x8c3ef>
    <8e58e>   DW_AT_data_member_location: 56
 <2><8e58f>: Abbrev Number: 0
 <1><8e590>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e591>   DW_AT_name        : (indirect string, offset: 0x1855b): XPropertyEvent
    <8e595>   DW_AT_decl_file   : 12
    <8e596>   DW_AT_decl_line   : 845
    <8e598>   DW_AT_decl_column : 3
    <8e599>   DW_AT_type        : <0x8e517>
 <1><8e59d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e59e>   DW_AT_byte_size   : 56
    <8e59f>   DW_AT_decl_file   : 12
    <8e59f>   DW_AT_decl_line   : 847
    <8e5a1>   DW_AT_decl_column : 9
    <8e5a1>   DW_AT_sibling     : <0x8e608>
 <2><8e5a5>: Abbrev Number: 1 (DW_TAG_member)
    <8e5a6>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e5aa>   DW_AT_decl_file   : 12
    <8e5ab>   DW_AT_decl_line   : 848
    <8e5ad>   DW_AT_decl_column : 6
    <8e5ae>   DW_AT_type        : <0x8c3ef>
    <8e5b2>   DW_AT_data_member_location: 0
 <2><8e5b3>: Abbrev Number: 1 (DW_TAG_member)
    <8e5b4>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e5b8>   DW_AT_decl_file   : 12
    <8e5b9>   DW_AT_decl_line   : 849
    <8e5bb>   DW_AT_decl_column : 16
    <8e5bc>   DW_AT_type        : <0x8c3c0>
    <8e5c0>   DW_AT_data_member_location: 8
 <2><8e5c1>: Abbrev Number: 1 (DW_TAG_member)
    <8e5c2>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e5c6>   DW_AT_decl_file   : 12
    <8e5c7>   DW_AT_decl_line   : 850
    <8e5c9>   DW_AT_decl_column : 7
    <8e5ca>   DW_AT_type        : <0x8c3ef>
    <8e5ce>   DW_AT_data_member_location: 16
 <2><8e5cf>: Abbrev Number: 1 (DW_TAG_member)
    <8e5d0>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e5d4>   DW_AT_decl_file   : 12
    <8e5d5>   DW_AT_decl_line   : 851
    <8e5d7>   DW_AT_decl_column : 11
    <8e5d8>   DW_AT_type        : <0x8d87d>
    <8e5dc>   DW_AT_data_member_location: 24
 <2><8e5dd>: Abbrev Number: 1 (DW_TAG_member)
    <8e5de>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e5e2>   DW_AT_decl_file   : 12
    <8e5e3>   DW_AT_decl_line   : 852
    <8e5e5>   DW_AT_decl_column : 9
    <8e5e6>   DW_AT_type        : <0x8cd6c>
    <8e5ea>   DW_AT_data_member_location: 32
 <2><8e5eb>: Abbrev Number: 1 (DW_TAG_member)
    <8e5ec>   DW_AT_name        : (indirect string, offset: 0x18be7): selection
    <8e5f0>   DW_AT_decl_file   : 12
    <8e5f1>   DW_AT_decl_line   : 853
    <8e5f3>   DW_AT_decl_column : 7
    <8e5f4>   DW_AT_type        : <0x8cd48>
    <8e5f8>   DW_AT_data_member_location: 40
 <2><8e5f9>: Abbrev Number: 1 (DW_TAG_member)
    <8e5fa>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <8e5fe>   DW_AT_decl_file   : 12
    <8e5ff>   DW_AT_decl_line   : 854
    <8e601>   DW_AT_decl_column : 7
    <8e602>   DW_AT_type        : <0x8cd60>
    <8e606>   DW_AT_data_member_location: 48
 <2><8e607>: Abbrev Number: 0
 <1><8e608>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e609>   DW_AT_name        : (indirect string, offset: 0x18d94): XSelectionClearEvent
    <8e60d>   DW_AT_decl_file   : 12
    <8e60e>   DW_AT_decl_line   : 855
    <8e610>   DW_AT_decl_column : 3
    <8e611>   DW_AT_type        : <0x8e59d>
 <1><8e615>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e616>   DW_AT_byte_size   : 80
    <8e617>   DW_AT_decl_file   : 12
    <8e617>   DW_AT_decl_line   : 857
    <8e619>   DW_AT_decl_column : 9
    <8e619>   DW_AT_sibling     : <0x8e6aa>
 <2><8e61d>: Abbrev Number: 1 (DW_TAG_member)
    <8e61e>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e622>   DW_AT_decl_file   : 12
    <8e623>   DW_AT_decl_line   : 858
    <8e625>   DW_AT_decl_column : 6
    <8e626>   DW_AT_type        : <0x8c3ef>
    <8e62a>   DW_AT_data_member_location: 0
 <2><8e62b>: Abbrev Number: 1 (DW_TAG_member)
    <8e62c>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e630>   DW_AT_decl_file   : 12
    <8e631>   DW_AT_decl_line   : 859
    <8e633>   DW_AT_decl_column : 16
    <8e634>   DW_AT_type        : <0x8c3c0>
    <8e638>   DW_AT_data_member_location: 8
 <2><8e639>: Abbrev Number: 1 (DW_TAG_member)
    <8e63a>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e63e>   DW_AT_decl_file   : 12
    <8e63f>   DW_AT_decl_line   : 860
    <8e641>   DW_AT_decl_column : 7
    <8e642>   DW_AT_type        : <0x8c3ef>
    <8e646>   DW_AT_data_member_location: 16
 <2><8e647>: Abbrev Number: 1 (DW_TAG_member)
    <8e648>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e64c>   DW_AT_decl_file   : 12
    <8e64d>   DW_AT_decl_line   : 861
    <8e64f>   DW_AT_decl_column : 11
    <8e650>   DW_AT_type        : <0x8d87d>
    <8e654>   DW_AT_data_member_location: 24
 <2><8e655>: Abbrev Number: 1 (DW_TAG_member)
    <8e656>   DW_AT_name        : (indirect string, offset: 0x18860): owner
    <8e65a>   DW_AT_decl_file   : 12
    <8e65b>   DW_AT_decl_line   : 862
    <8e65d>   DW_AT_decl_column : 9
    <8e65e>   DW_AT_type        : <0x8cd6c>
    <8e662>   DW_AT_data_member_location: 32
 <2><8e663>: Abbrev Number: 1 (DW_TAG_member)
    <8e664>   DW_AT_name        : (indirect string, offset: 0x19593): requestor
    <8e668>   DW_AT_decl_file   : 12
    <8e669>   DW_AT_decl_line   : 863
    <8e66b>   DW_AT_decl_column : 9
    <8e66c>   DW_AT_type        : <0x8cd6c>
    <8e670>   DW_AT_data_member_location: 40
 <2><8e671>: Abbrev Number: 1 (DW_TAG_member)
    <8e672>   DW_AT_name        : (indirect string, offset: 0x18be7): selection
    <8e676>   DW_AT_decl_file   : 12
    <8e677>   DW_AT_decl_line   : 864
    <8e679>   DW_AT_decl_column : 7
    <8e67a>   DW_AT_type        : <0x8cd48>
    <8e67e>   DW_AT_data_member_location: 48
 <2><8e67f>: Abbrev Number: 1 (DW_TAG_member)
    <8e680>   DW_AT_name        : (indirect string, offset: 0x167a7): target
    <8e684>   DW_AT_decl_file   : 12
    <8e685>   DW_AT_decl_line   : 865
    <8e687>   DW_AT_decl_column : 7
    <8e688>   DW_AT_type        : <0x8cd48>
    <8e68c>   DW_AT_data_member_location: 56
 <2><8e68d>: Abbrev Number: 1 (DW_TAG_member)
    <8e68e>   DW_AT_name        : (indirect string, offset: 0x19866): property
    <8e692>   DW_AT_decl_file   : 12
    <8e693>   DW_AT_decl_line   : 866
    <8e695>   DW_AT_decl_column : 7
    <8e696>   DW_AT_type        : <0x8cd48>
    <8e69a>   DW_AT_data_member_location: 64
 <2><8e69b>: Abbrev Number: 1 (DW_TAG_member)
    <8e69c>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <8e6a0>   DW_AT_decl_file   : 12
    <8e6a1>   DW_AT_decl_line   : 867
    <8e6a3>   DW_AT_decl_column : 7
    <8e6a4>   DW_AT_type        : <0x8cd60>
    <8e6a8>   DW_AT_data_member_location: 72
 <2><8e6a9>: Abbrev Number: 0
 <1><8e6aa>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e6ab>   DW_AT_name        : (indirect string, offset: 0x195c9): XSelectionRequestEvent
    <8e6af>   DW_AT_decl_file   : 12
    <8e6b0>   DW_AT_decl_line   : 868
    <8e6b2>   DW_AT_decl_column : 3
    <8e6b3>   DW_AT_type        : <0x8e615>
 <1><8e6b7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e6b8>   DW_AT_byte_size   : 72
    <8e6b9>   DW_AT_decl_file   : 12
    <8e6b9>   DW_AT_decl_line   : 870
    <8e6bb>   DW_AT_decl_column : 9
    <8e6bb>   DW_AT_sibling     : <0x8e73e>
 <2><8e6bf>: Abbrev Number: 1 (DW_TAG_member)
    <8e6c0>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e6c4>   DW_AT_decl_file   : 12
    <8e6c5>   DW_AT_decl_line   : 871
    <8e6c7>   DW_AT_decl_column : 6
    <8e6c8>   DW_AT_type        : <0x8c3ef>
    <8e6cc>   DW_AT_data_member_location: 0
 <2><8e6cd>: Abbrev Number: 1 (DW_TAG_member)
    <8e6ce>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e6d2>   DW_AT_decl_file   : 12
    <8e6d3>   DW_AT_decl_line   : 872
    <8e6d5>   DW_AT_decl_column : 16
    <8e6d6>   DW_AT_type        : <0x8c3c0>
    <8e6da>   DW_AT_data_member_location: 8
 <2><8e6db>: Abbrev Number: 1 (DW_TAG_member)
    <8e6dc>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e6e0>   DW_AT_decl_file   : 12
    <8e6e1>   DW_AT_decl_line   : 873
    <8e6e3>   DW_AT_decl_column : 7
    <8e6e4>   DW_AT_type        : <0x8c3ef>
    <8e6e8>   DW_AT_data_member_location: 16
 <2><8e6e9>: Abbrev Number: 1 (DW_TAG_member)
    <8e6ea>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e6ee>   DW_AT_decl_file   : 12
    <8e6ef>   DW_AT_decl_line   : 874
    <8e6f1>   DW_AT_decl_column : 11
    <8e6f2>   DW_AT_type        : <0x8d87d>
    <8e6f6>   DW_AT_data_member_location: 24
 <2><8e6f7>: Abbrev Number: 1 (DW_TAG_member)
    <8e6f8>   DW_AT_name        : (indirect string, offset: 0x19593): requestor
    <8e6fc>   DW_AT_decl_file   : 12
    <8e6fd>   DW_AT_decl_line   : 875
    <8e6ff>   DW_AT_decl_column : 9
    <8e700>   DW_AT_type        : <0x8cd6c>
    <8e704>   DW_AT_data_member_location: 32
 <2><8e705>: Abbrev Number: 1 (DW_TAG_member)
    <8e706>   DW_AT_name        : (indirect string, offset: 0x18be7): selection
    <8e70a>   DW_AT_decl_file   : 12
    <8e70b>   DW_AT_decl_line   : 876
    <8e70d>   DW_AT_decl_column : 7
    <8e70e>   DW_AT_type        : <0x8cd48>
    <8e712>   DW_AT_data_member_location: 40
 <2><8e713>: Abbrev Number: 1 (DW_TAG_member)
    <8e714>   DW_AT_name        : (indirect string, offset: 0x167a7): target
    <8e718>   DW_AT_decl_file   : 12
    <8e719>   DW_AT_decl_line   : 877
    <8e71b>   DW_AT_decl_column : 7
    <8e71c>   DW_AT_type        : <0x8cd48>
    <8e720>   DW_AT_data_member_location: 48
 <2><8e721>: Abbrev Number: 1 (DW_TAG_member)
    <8e722>   DW_AT_name        : (indirect string, offset: 0x19866): property
    <8e726>   DW_AT_decl_file   : 12
    <8e727>   DW_AT_decl_line   : 878
    <8e729>   DW_AT_decl_column : 7
    <8e72a>   DW_AT_type        : <0x8cd48>
    <8e72e>   DW_AT_data_member_location: 56
 <2><8e72f>: Abbrev Number: 1 (DW_TAG_member)
    <8e730>   DW_AT_name        : (indirect string, offset: 0x18c12): time
    <8e734>   DW_AT_decl_file   : 12
    <8e735>   DW_AT_decl_line   : 879
    <8e737>   DW_AT_decl_column : 7
    <8e738>   DW_AT_type        : <0x8cd60>
    <8e73c>   DW_AT_data_member_location: 64
 <2><8e73d>: Abbrev Number: 0
 <1><8e73e>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e73f>   DW_AT_name        : (indirect string, offset: 0x18a04): XSelectionEvent
    <8e743>   DW_AT_decl_file   : 12
    <8e744>   DW_AT_decl_line   : 880
    <8e746>   DW_AT_decl_column : 3
    <8e747>   DW_AT_type        : <0x8e6b7>
 <1><8e74b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e74c>   DW_AT_byte_size   : 56
    <8e74d>   DW_AT_decl_file   : 12
    <8e74d>   DW_AT_decl_line   : 882
    <8e74f>   DW_AT_decl_column : 9
    <8e74f>   DW_AT_sibling     : <0x8e7c4>
 <2><8e753>: Abbrev Number: 1 (DW_TAG_member)
    <8e754>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e758>   DW_AT_decl_file   : 12
    <8e759>   DW_AT_decl_line   : 883
    <8e75b>   DW_AT_decl_column : 6
    <8e75c>   DW_AT_type        : <0x8c3ef>
    <8e760>   DW_AT_data_member_location: 0
 <2><8e761>: Abbrev Number: 1 (DW_TAG_member)
    <8e762>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e766>   DW_AT_decl_file   : 12
    <8e767>   DW_AT_decl_line   : 884
    <8e769>   DW_AT_decl_column : 16
    <8e76a>   DW_AT_type        : <0x8c3c0>
    <8e76e>   DW_AT_data_member_location: 8
 <2><8e76f>: Abbrev Number: 1 (DW_TAG_member)
    <8e770>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e774>   DW_AT_decl_file   : 12
    <8e775>   DW_AT_decl_line   : 885
    <8e777>   DW_AT_decl_column : 7
    <8e778>   DW_AT_type        : <0x8c3ef>
    <8e77c>   DW_AT_data_member_location: 16
 <2><8e77d>: Abbrev Number: 1 (DW_TAG_member)
    <8e77e>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e782>   DW_AT_decl_file   : 12
    <8e783>   DW_AT_decl_line   : 886
    <8e785>   DW_AT_decl_column : 11
    <8e786>   DW_AT_type        : <0x8d87d>
    <8e78a>   DW_AT_data_member_location: 24
 <2><8e78b>: Abbrev Number: 1 (DW_TAG_member)
    <8e78c>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e790>   DW_AT_decl_file   : 12
    <8e791>   DW_AT_decl_line   : 887
    <8e793>   DW_AT_decl_column : 9
    <8e794>   DW_AT_type        : <0x8cd6c>
    <8e798>   DW_AT_data_member_location: 32
 <2><8e799>: Abbrev Number: 1 (DW_TAG_member)
    <8e79a>   DW_AT_name        : (indirect string, offset: 0x1979b): colormap
    <8e79e>   DW_AT_decl_file   : 12
    <8e79f>   DW_AT_decl_line   : 888
    <8e7a1>   DW_AT_decl_column : 11
    <8e7a2>   DW_AT_type        : <0x8cda8>
    <8e7a6>   DW_AT_data_member_location: 40
 <2><8e7a7>: Abbrev Number: 13 (DW_TAG_member)
    <8e7a8>   DW_AT_name        : new
    <8e7ac>   DW_AT_decl_file   : 12
    <8e7ad>   DW_AT_decl_line   : 892
    <8e7af>   DW_AT_decl_column : 7
    <8e7b0>   DW_AT_type        : <0x8c3ef>
    <8e7b4>   DW_AT_data_member_location: 48
 <2><8e7b5>: Abbrev Number: 1 (DW_TAG_member)
    <8e7b6>   DW_AT_name        : (indirect string, offset: 0x186e7): state
    <8e7ba>   DW_AT_decl_file   : 12
    <8e7bb>   DW_AT_decl_line   : 894
    <8e7bd>   DW_AT_decl_column : 6
    <8e7be>   DW_AT_type        : <0x8c3ef>
    <8e7c2>   DW_AT_data_member_location: 52
 <2><8e7c3>: Abbrev Number: 0
 <1><8e7c4>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e7c5>   DW_AT_name        : (indirect string, offset: 0x19216): XColormapEvent
    <8e7c9>   DW_AT_decl_file   : 12
    <8e7ca>   DW_AT_decl_line   : 895
    <8e7cc>   DW_AT_decl_column : 3
    <8e7cd>   DW_AT_type        : <0x8e74b>
 <1><8e7d1>: Abbrev Number: 76 (DW_TAG_union_type)
    <8e7d2>   DW_AT_byte_size   : 40
    <8e7d3>   DW_AT_decl_file   : 12
    <8e7d4>   DW_AT_decl_line   : 905
    <8e7d6>   DW_AT_decl_column : 2
    <8e7d7>   DW_AT_sibling     : <0x8e7fa>
 <2><8e7db>: Abbrev Number: 43 (DW_TAG_member)
    <8e7dc>   DW_AT_name        : b
    <8e7de>   DW_AT_decl_file   : 12
    <8e7de>   DW_AT_decl_line   : 906
    <8e7e0>   DW_AT_decl_column : 8
    <8e7e1>   DW_AT_type        : <0x8c782>
 <2><8e7e5>: Abbrev Number: 43 (DW_TAG_member)
    <8e7e6>   DW_AT_name        : s
    <8e7e8>   DW_AT_decl_file   : 12
    <8e7e8>   DW_AT_decl_line   : 907
    <8e7ea>   DW_AT_decl_column : 9
    <8e7eb>   DW_AT_type        : <0x8e7fa>
 <2><8e7ef>: Abbrev Number: 43 (DW_TAG_member)
    <8e7f0>   DW_AT_name        : l
    <8e7f2>   DW_AT_decl_file   : 12
    <8e7f2>   DW_AT_decl_line   : 908
    <8e7f4>   DW_AT_decl_column : 8
    <8e7f5>   DW_AT_type        : <0x8e80a>
 <2><8e7f9>: Abbrev Number: 0
 <1><8e7fa>: Abbrev Number: 21 (DW_TAG_array_type)
    <8e7fb>   DW_AT_type        : <0x8c3e8>
    <8e7ff>   DW_AT_sibling     : <0x8e80a>
 <2><8e803>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8e804>   DW_AT_type        : <0x8c3c0>
    <8e808>   DW_AT_upper_bound : 9
 <2><8e809>: Abbrev Number: 0
 <1><8e80a>: Abbrev Number: 21 (DW_TAG_array_type)
    <8e80b>   DW_AT_type        : <0x8c400>
    <8e80f>   DW_AT_sibling     : <0x8e81a>
 <2><8e813>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8e814>   DW_AT_type        : <0x8c3c0>
    <8e818>   DW_AT_upper_bound : 4
 <2><8e819>: Abbrev Number: 0
 <1><8e81a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e81b>   DW_AT_byte_size   : 96
    <8e81c>   DW_AT_decl_file   : 12
    <8e81c>   DW_AT_decl_line   : 897
    <8e81e>   DW_AT_decl_column : 9
    <8e81e>   DW_AT_sibling     : <0x8e893>
 <2><8e822>: Abbrev Number: 1 (DW_TAG_member)
    <8e823>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e827>   DW_AT_decl_file   : 12
    <8e828>   DW_AT_decl_line   : 898
    <8e82a>   DW_AT_decl_column : 6
    <8e82b>   DW_AT_type        : <0x8c3ef>
    <8e82f>   DW_AT_data_member_location: 0
 <2><8e830>: Abbrev Number: 1 (DW_TAG_member)
    <8e831>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e835>   DW_AT_decl_file   : 12
    <8e836>   DW_AT_decl_line   : 899
    <8e838>   DW_AT_decl_column : 16
    <8e839>   DW_AT_type        : <0x8c3c0>
    <8e83d>   DW_AT_data_member_location: 8
 <2><8e83e>: Abbrev Number: 1 (DW_TAG_member)
    <8e83f>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e843>   DW_AT_decl_file   : 12
    <8e844>   DW_AT_decl_line   : 900
    <8e846>   DW_AT_decl_column : 7
    <8e847>   DW_AT_type        : <0x8c3ef>
    <8e84b>   DW_AT_data_member_location: 16
 <2><8e84c>: Abbrev Number: 1 (DW_TAG_member)
    <8e84d>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e851>   DW_AT_decl_file   : 12
    <8e852>   DW_AT_decl_line   : 901
    <8e854>   DW_AT_decl_column : 11
    <8e855>   DW_AT_type        : <0x8d87d>
    <8e859>   DW_AT_data_member_location: 24
 <2><8e85a>: Abbrev Number: 1 (DW_TAG_member)
    <8e85b>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e85f>   DW_AT_decl_file   : 12
    <8e860>   DW_AT_decl_line   : 902
    <8e862>   DW_AT_decl_column : 9
    <8e863>   DW_AT_type        : <0x8cd6c>
    <8e867>   DW_AT_data_member_location: 32
 <2><8e868>: Abbrev Number: 1 (DW_TAG_member)
    <8e869>   DW_AT_name        : (indirect string, offset: 0x19843): message_type
    <8e86d>   DW_AT_decl_file   : 12
    <8e86e>   DW_AT_decl_line   : 903
    <8e870>   DW_AT_decl_column : 7
    <8e871>   DW_AT_type        : <0x8cd48>
    <8e875>   DW_AT_data_member_location: 40
 <2><8e876>: Abbrev Number: 1 (DW_TAG_member)
    <8e877>   DW_AT_name        : (indirect string, offset: 0x191a9): format
    <8e87b>   DW_AT_decl_file   : 12
    <8e87c>   DW_AT_decl_line   : 904
    <8e87e>   DW_AT_decl_column : 6
    <8e87f>   DW_AT_type        : <0x8c3ef>
    <8e883>   DW_AT_data_member_location: 48
 <2><8e884>: Abbrev Number: 1 (DW_TAG_member)
    <8e885>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8e889>   DW_AT_decl_file   : 12
    <8e88a>   DW_AT_decl_line   : 909
    <8e88c>   DW_AT_decl_column : 5
    <8e88d>   DW_AT_type        : <0x8e7d1>
    <8e891>   DW_AT_data_member_location: 56
 <2><8e892>: Abbrev Number: 0
 <1><8e893>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e894>   DW_AT_name        : (indirect string, offset: 0x197c6): XClientMessageEvent
    <8e898>   DW_AT_decl_file   : 12
    <8e899>   DW_AT_decl_line   : 910
    <8e89b>   DW_AT_decl_column : 3
    <8e89c>   DW_AT_type        : <0x8e81a>
 <1><8e8a0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e8a1>   DW_AT_byte_size   : 56
    <8e8a2>   DW_AT_decl_file   : 12
    <8e8a2>   DW_AT_decl_line   : 912
    <8e8a4>   DW_AT_decl_column : 9
    <8e8a4>   DW_AT_sibling     : <0x8e919>
 <2><8e8a8>: Abbrev Number: 1 (DW_TAG_member)
    <8e8a9>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e8ad>   DW_AT_decl_file   : 12
    <8e8ae>   DW_AT_decl_line   : 913
    <8e8b0>   DW_AT_decl_column : 6
    <8e8b1>   DW_AT_type        : <0x8c3ef>
    <8e8b5>   DW_AT_data_member_location: 0
 <2><8e8b6>: Abbrev Number: 1 (DW_TAG_member)
    <8e8b7>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e8bb>   DW_AT_decl_file   : 12
    <8e8bc>   DW_AT_decl_line   : 914
    <8e8be>   DW_AT_decl_column : 16
    <8e8bf>   DW_AT_type        : <0x8c3c0>
    <8e8c3>   DW_AT_data_member_location: 8
 <2><8e8c4>: Abbrev Number: 1 (DW_TAG_member)
    <8e8c5>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e8c9>   DW_AT_decl_file   : 12
    <8e8ca>   DW_AT_decl_line   : 915
    <8e8cc>   DW_AT_decl_column : 7
    <8e8cd>   DW_AT_type        : <0x8c3ef>
    <8e8d1>   DW_AT_data_member_location: 16
 <2><8e8d2>: Abbrev Number: 1 (DW_TAG_member)
    <8e8d3>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e8d7>   DW_AT_decl_file   : 12
    <8e8d8>   DW_AT_decl_line   : 916
    <8e8da>   DW_AT_decl_column : 11
    <8e8db>   DW_AT_type        : <0x8d87d>
    <8e8df>   DW_AT_data_member_location: 24
 <2><8e8e0>: Abbrev Number: 1 (DW_TAG_member)
    <8e8e1>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e8e5>   DW_AT_decl_file   : 12
    <8e8e6>   DW_AT_decl_line   : 917
    <8e8e8>   DW_AT_decl_column : 9
    <8e8e9>   DW_AT_type        : <0x8cd6c>
    <8e8ed>   DW_AT_data_member_location: 32
 <2><8e8ee>: Abbrev Number: 1 (DW_TAG_member)
    <8e8ef>   DW_AT_name        : (indirect string, offset: 0x19391): request
    <8e8f3>   DW_AT_decl_file   : 12
    <8e8f4>   DW_AT_decl_line   : 918
    <8e8f6>   DW_AT_decl_column : 6
    <8e8f7>   DW_AT_type        : <0x8c3ef>
    <8e8fb>   DW_AT_data_member_location: 40
 <2><8e8fc>: Abbrev Number: 1 (DW_TAG_member)
    <8e8fd>   DW_AT_name        : (indirect string, offset: 0x19850): first_keycode
    <8e901>   DW_AT_decl_file   : 12
    <8e902>   DW_AT_decl_line   : 920
    <8e904>   DW_AT_decl_column : 6
    <8e905>   DW_AT_type        : <0x8c3ef>
    <8e909>   DW_AT_data_member_location: 44
 <2><8e90a>: Abbrev Number: 1 (DW_TAG_member)
    <8e90b>   DW_AT_name        : (indirect string, offset: 0x18d05): count
    <8e90f>   DW_AT_decl_file   : 12
    <8e910>   DW_AT_decl_line   : 921
    <8e912>   DW_AT_decl_column : 6
    <8e913>   DW_AT_type        : <0x8c3ef>
    <8e917>   DW_AT_data_member_location: 48
 <2><8e918>: Abbrev Number: 0
 <1><8e919>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e91a>   DW_AT_name        : (indirect string, offset: 0x18712): XMappingEvent
    <8e91e>   DW_AT_decl_file   : 12
    <8e91f>   DW_AT_decl_line   : 922
    <8e921>   DW_AT_decl_column : 3
    <8e922>   DW_AT_type        : <0x8e8a0>
 <1><8e926>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e927>   DW_AT_byte_size   : 40
    <8e928>   DW_AT_decl_file   : 12
    <8e928>   DW_AT_decl_line   : 924
    <8e92a>   DW_AT_decl_column : 9
    <8e92a>   DW_AT_sibling     : <0x8e991>
 <2><8e92e>: Abbrev Number: 1 (DW_TAG_member)
    <8e92f>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e933>   DW_AT_decl_file   : 12
    <8e934>   DW_AT_decl_line   : 925
    <8e936>   DW_AT_decl_column : 6
    <8e937>   DW_AT_type        : <0x8c3ef>
    <8e93b>   DW_AT_data_member_location: 0
 <2><8e93c>: Abbrev Number: 1 (DW_TAG_member)
    <8e93d>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e941>   DW_AT_decl_file   : 12
    <8e942>   DW_AT_decl_line   : 926
    <8e944>   DW_AT_decl_column : 11
    <8e945>   DW_AT_type        : <0x8d87d>
    <8e949>   DW_AT_data_member_location: 8
 <2><8e94a>: Abbrev Number: 1 (DW_TAG_member)
    <8e94b>   DW_AT_name        : (indirect string, offset: 0x18ebd): resourceid
    <8e94f>   DW_AT_decl_file   : 12
    <8e950>   DW_AT_decl_line   : 927
    <8e952>   DW_AT_decl_column : 6
    <8e953>   DW_AT_type        : <0x8cd3c>
    <8e957>   DW_AT_data_member_location: 16
 <2><8e958>: Abbrev Number: 1 (DW_TAG_member)
    <8e959>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e95d>   DW_AT_decl_file   : 12
    <8e95e>   DW_AT_decl_line   : 928
    <8e960>   DW_AT_decl_column : 16
    <8e961>   DW_AT_type        : <0x8c3c0>
    <8e965>   DW_AT_data_member_location: 24
 <2><8e966>: Abbrev Number: 1 (DW_TAG_member)
    <8e967>   DW_AT_name        : (indirect string, offset: 0x18664): error_code
    <8e96b>   DW_AT_decl_file   : 12
    <8e96c>   DW_AT_decl_line   : 929
    <8e96e>   DW_AT_decl_column : 16
    <8e96f>   DW_AT_type        : <0x8c3c7>
    <8e973>   DW_AT_data_member_location: 32
 <2><8e974>: Abbrev Number: 1 (DW_TAG_member)
    <8e975>   DW_AT_name        : (indirect string, offset: 0x19330): request_code
    <8e979>   DW_AT_decl_file   : 12
    <8e97a>   DW_AT_decl_line   : 930
    <8e97c>   DW_AT_decl_column : 16
    <8e97d>   DW_AT_type        : <0x8c3c7>
    <8e981>   DW_AT_data_member_location: 33
 <2><8e982>: Abbrev Number: 1 (DW_TAG_member)
    <8e983>   DW_AT_name        : (indirect string, offset: 0x19b9c): minor_code
    <8e987>   DW_AT_decl_file   : 12
    <8e988>   DW_AT_decl_line   : 931
    <8e98a>   DW_AT_decl_column : 16
    <8e98b>   DW_AT_type        : <0x8c3c7>
    <8e98f>   DW_AT_data_member_location: 34
 <2><8e990>: Abbrev Number: 0
 <1><8e991>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e992>   DW_AT_name        : (indirect string, offset: 0x18bb9): XErrorEvent
    <8e996>   DW_AT_decl_file   : 12
    <8e997>   DW_AT_decl_line   : 932
    <8e999>   DW_AT_decl_column : 3
    <8e99a>   DW_AT_type        : <0x8e926>
 <1><8e99e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e99f>   DW_AT_byte_size   : 40
    <8e9a0>   DW_AT_decl_file   : 12
    <8e9a0>   DW_AT_decl_line   : 934
    <8e9a2>   DW_AT_decl_column : 9
    <8e9a2>   DW_AT_sibling     : <0x8e9ed>
 <2><8e9a6>: Abbrev Number: 1 (DW_TAG_member)
    <8e9a7>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8e9ab>   DW_AT_decl_file   : 12
    <8e9ac>   DW_AT_decl_line   : 935
    <8e9ae>   DW_AT_decl_column : 6
    <8e9af>   DW_AT_type        : <0x8c3ef>
    <8e9b3>   DW_AT_data_member_location: 0
 <2><8e9b4>: Abbrev Number: 1 (DW_TAG_member)
    <8e9b5>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8e9b9>   DW_AT_decl_file   : 12
    <8e9ba>   DW_AT_decl_line   : 936
    <8e9bc>   DW_AT_decl_column : 16
    <8e9bd>   DW_AT_type        : <0x8c3c0>
    <8e9c1>   DW_AT_data_member_location: 8
 <2><8e9c2>: Abbrev Number: 1 (DW_TAG_member)
    <8e9c3>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8e9c7>   DW_AT_decl_file   : 12
    <8e9c8>   DW_AT_decl_line   : 937
    <8e9ca>   DW_AT_decl_column : 7
    <8e9cb>   DW_AT_type        : <0x8c3ef>
    <8e9cf>   DW_AT_data_member_location: 16
 <2><8e9d0>: Abbrev Number: 1 (DW_TAG_member)
    <8e9d1>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8e9d5>   DW_AT_decl_file   : 12
    <8e9d6>   DW_AT_decl_line   : 938
    <8e9d8>   DW_AT_decl_column : 11
    <8e9d9>   DW_AT_type        : <0x8d87d>
    <8e9dd>   DW_AT_data_member_location: 24
 <2><8e9de>: Abbrev Number: 1 (DW_TAG_member)
    <8e9df>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <8e9e3>   DW_AT_decl_file   : 12
    <8e9e4>   DW_AT_decl_line   : 939
    <8e9e6>   DW_AT_decl_column : 9
    <8e9e7>   DW_AT_type        : <0x8cd6c>
    <8e9eb>   DW_AT_data_member_location: 32
 <2><8e9ec>: Abbrev Number: 0
 <1><8e9ed>: Abbrev Number: 10 (DW_TAG_typedef)
    <8e9ee>   DW_AT_name        : (indirect string, offset: 0x1970e): XAnyEvent
    <8e9f2>   DW_AT_decl_file   : 12
    <8e9f3>   DW_AT_decl_line   : 940
    <8e9f5>   DW_AT_decl_column : 3
    <8e9f6>   DW_AT_type        : <0x8e99e>
 <1><8e9fa>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8e9fb>   DW_AT_byte_size   : 40
    <8e9fc>   DW_AT_decl_file   : 12
    <8e9fc>   DW_AT_decl_line   : 948
    <8e9fe>   DW_AT_decl_column : 9
    <8e9fe>   DW_AT_sibling     : <0x8ea57>
 <2><8ea02>: Abbrev Number: 1 (DW_TAG_member)
    <8ea03>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8ea07>   DW_AT_decl_file   : 12
    <8ea08>   DW_AT_decl_line   : 950
    <8ea0a>   DW_AT_decl_column : 20
    <8ea0b>   DW_AT_type        : <0x8c3ef>
    <8ea0f>   DW_AT_data_member_location: 0
 <2><8ea10>: Abbrev Number: 1 (DW_TAG_member)
    <8ea11>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8ea15>   DW_AT_decl_file   : 12
    <8ea16>   DW_AT_decl_line   : 951
    <8ea18>   DW_AT_decl_column : 20
    <8ea19>   DW_AT_type        : <0x8c3c0>
    <8ea1d>   DW_AT_data_member_location: 8
 <2><8ea1e>: Abbrev Number: 1 (DW_TAG_member)
    <8ea1f>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8ea23>   DW_AT_decl_file   : 12
    <8ea24>   DW_AT_decl_line   : 952
    <8ea26>   DW_AT_decl_column : 20
    <8ea27>   DW_AT_type        : <0x8c3ef>
    <8ea2b>   DW_AT_data_member_location: 16
 <2><8ea2c>: Abbrev Number: 1 (DW_TAG_member)
    <8ea2d>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8ea31>   DW_AT_decl_file   : 12
    <8ea32>   DW_AT_decl_line   : 953
    <8ea34>   DW_AT_decl_column : 21
    <8ea35>   DW_AT_type        : <0x8d87d>
    <8ea39>   DW_AT_data_member_location: 24
 <2><8ea3a>: Abbrev Number: 1 (DW_TAG_member)
    <8ea3b>   DW_AT_name        : (indirect string, offset: 0x17e8b): extension
    <8ea3f>   DW_AT_decl_file   : 12
    <8ea40>   DW_AT_decl_line   : 954
    <8ea42>   DW_AT_decl_column : 20
    <8ea43>   DW_AT_type        : <0x8c3ef>
    <8ea47>   DW_AT_data_member_location: 32
 <2><8ea48>: Abbrev Number: 1 (DW_TAG_member)
    <8ea49>   DW_AT_name        : (indirect string, offset: 0x1898a): evtype
    <8ea4d>   DW_AT_decl_file   : 12
    <8ea4e>   DW_AT_decl_line   : 955
    <8ea50>   DW_AT_decl_column : 20
    <8ea51>   DW_AT_type        : <0x8c3ef>
    <8ea55>   DW_AT_data_member_location: 36
 <2><8ea56>: Abbrev Number: 0
 <1><8ea57>: Abbrev Number: 10 (DW_TAG_typedef)
    <8ea58>   DW_AT_name        : (indirect string, offset: 0x19988): XGenericEvent
    <8ea5c>   DW_AT_decl_file   : 12
    <8ea5d>   DW_AT_decl_line   : 956
    <8ea5f>   DW_AT_decl_column : 7
    <8ea60>   DW_AT_type        : <0x8e9fa>
 <1><8ea64>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8ea65>   DW_AT_byte_size   : 56
    <8ea66>   DW_AT_decl_file   : 12
    <8ea66>   DW_AT_decl_line   : 958
    <8ea68>   DW_AT_decl_column : 9
    <8ea68>   DW_AT_sibling     : <0x8eadd>
 <2><8ea6c>: Abbrev Number: 1 (DW_TAG_member)
    <8ea6d>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8ea71>   DW_AT_decl_file   : 12
    <8ea72>   DW_AT_decl_line   : 959
    <8ea74>   DW_AT_decl_column : 20
    <8ea75>   DW_AT_type        : <0x8c3ef>
    <8ea79>   DW_AT_data_member_location: 0
 <2><8ea7a>: Abbrev Number: 1 (DW_TAG_member)
    <8ea7b>   DW_AT_name        : (indirect string, offset: 0x1947f): serial
    <8ea7f>   DW_AT_decl_file   : 12
    <8ea80>   DW_AT_decl_line   : 960
    <8ea82>   DW_AT_decl_column : 20
    <8ea83>   DW_AT_type        : <0x8c3c0>
    <8ea87>   DW_AT_data_member_location: 8
 <2><8ea88>: Abbrev Number: 1 (DW_TAG_member)
    <8ea89>   DW_AT_name        : (indirect string, offset: 0x19578): send_event
    <8ea8d>   DW_AT_decl_file   : 12
    <8ea8e>   DW_AT_decl_line   : 961
    <8ea90>   DW_AT_decl_column : 20
    <8ea91>   DW_AT_type        : <0x8c3ef>
    <8ea95>   DW_AT_data_member_location: 16
 <2><8ea96>: Abbrev Number: 1 (DW_TAG_member)
    <8ea97>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <8ea9b>   DW_AT_decl_file   : 12
    <8ea9c>   DW_AT_decl_line   : 962
    <8ea9e>   DW_AT_decl_column : 21
    <8ea9f>   DW_AT_type        : <0x8d87d>
    <8eaa3>   DW_AT_data_member_location: 24
 <2><8eaa4>: Abbrev Number: 1 (DW_TAG_member)
    <8eaa5>   DW_AT_name        : (indirect string, offset: 0x17e8b): extension
    <8eaa9>   DW_AT_decl_file   : 12
    <8eaaa>   DW_AT_decl_line   : 963
    <8eaac>   DW_AT_decl_column : 20
    <8eaad>   DW_AT_type        : <0x8c3ef>
    <8eab1>   DW_AT_data_member_location: 32
 <2><8eab2>: Abbrev Number: 1 (DW_TAG_member)
    <8eab3>   DW_AT_name        : (indirect string, offset: 0x1898a): evtype
    <8eab7>   DW_AT_decl_file   : 12
    <8eab8>   DW_AT_decl_line   : 964
    <8eaba>   DW_AT_decl_column : 20
    <8eabb>   DW_AT_type        : <0x8c3ef>
    <8eabf>   DW_AT_data_member_location: 36
 <2><8eac0>: Abbrev Number: 1 (DW_TAG_member)
    <8eac1>   DW_AT_name        : (indirect string, offset: 0x190c0): cookie
    <8eac5>   DW_AT_decl_file   : 12
    <8eac6>   DW_AT_decl_line   : 965
    <8eac8>   DW_AT_decl_column : 20
    <8eac9>   DW_AT_type        : <0x8c3da>
    <8eacd>   DW_AT_data_member_location: 40
 <2><8eace>: Abbrev Number: 1 (DW_TAG_member)
    <8eacf>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8ead3>   DW_AT_decl_file   : 12
    <8ead4>   DW_AT_decl_line   : 966
    <8ead6>   DW_AT_decl_column : 21
    <8ead7>   DW_AT_type        : <0x8c413>
    <8eadb>   DW_AT_data_member_location: 48
 <2><8eadc>: Abbrev Number: 0
 <1><8eadd>: Abbrev Number: 10 (DW_TAG_typedef)
    <8eade>   DW_AT_name        : (indirect string, offset: 0x187a6): XGenericEventCookie
    <8eae2>   DW_AT_decl_file   : 12
    <8eae3>   DW_AT_decl_line   : 967
    <8eae5>   DW_AT_decl_column : 3
    <8eae6>   DW_AT_type        : <0x8ea64>
 <1><8eaea>: Abbrev Number: 77 (DW_TAG_union_type)
    <8eaeb>   DW_AT_name        : (indirect string, offset: 0x19255): _XEvent
    <8eaef>   DW_AT_byte_size   : 192
    <8eaf0>   DW_AT_decl_file   : 12
    <8eaf1>   DW_AT_decl_line   : 973
    <8eaf3>   DW_AT_decl_column : 15
    <8eaf4>   DW_AT_sibling     : <0x8ec9d>
 <2><8eaf8>: Abbrev Number: 12 (DW_TAG_member)
    <8eaf9>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8eafd>   DW_AT_decl_file   : 12
    <8eafd>   DW_AT_decl_line   : 974
    <8eaff>   DW_AT_decl_column : 13
    <8eb00>   DW_AT_type        : <0x8c3ef>
 <2><8eb04>: Abbrev Number: 12 (DW_TAG_member)
    <8eb05>   DW_AT_name        : (indirect string, offset: 0x19741): xany
    <8eb09>   DW_AT_decl_file   : 12
    <8eb09>   DW_AT_decl_line   : 975
    <8eb0b>   DW_AT_decl_column : 12
    <8eb0c>   DW_AT_type        : <0x8e9ed>
 <2><8eb10>: Abbrev Number: 12 (DW_TAG_member)
    <8eb11>   DW_AT_name        : (indirect string, offset: 0x19302): xkey
    <8eb15>   DW_AT_decl_file   : 12
    <8eb15>   DW_AT_decl_line   : 976
    <8eb17>   DW_AT_decl_column : 12
    <8eb18>   DW_AT_type        : <0x8d882>
 <2><8eb1c>: Abbrev Number: 12 (DW_TAG_member)
    <8eb1d>   DW_AT_name        : (indirect string, offset: 0x1902e): xbutton
    <8eb21>   DW_AT_decl_file   : 12
    <8eb21>   DW_AT_decl_line   : 977
    <8eb23>   DW_AT_decl_column : 15
    <8eb24>   DW_AT_type        : <0x8d966>
 <2><8eb28>: Abbrev Number: 12 (DW_TAG_member)
    <8eb29>   DW_AT_name        : (indirect string, offset: 0x18803): xmotion
    <8eb2d>   DW_AT_decl_file   : 12
    <8eb2d>   DW_AT_decl_line   : 978
    <8eb2f>   DW_AT_decl_column : 15
    <8eb30>   DW_AT_type        : <0x8da4a>
 <2><8eb34>: Abbrev Number: 12 (DW_TAG_member)
    <8eb35>   DW_AT_name        : (indirect string, offset: 0x18e0e): xcrossing
    <8eb39>   DW_AT_decl_file   : 12
    <8eb39>   DW_AT_decl_line   : 979
    <8eb3b>   DW_AT_decl_column : 17
    <8eb3c>   DW_AT_type        : <0x8db4a>
 <2><8eb40>: Abbrev Number: 12 (DW_TAG_member)
    <8eb41>   DW_AT_name        : (indirect string, offset: 0x186cd): xfocus
    <8eb45>   DW_AT_decl_file   : 12
    <8eb45>   DW_AT_decl_line   : 980
    <8eb47>   DW_AT_decl_column : 20
    <8eb48>   DW_AT_type        : <0x8dbc2>
 <2><8eb4c>: Abbrev Number: 12 (DW_TAG_member)
    <8eb4d>   DW_AT_name        : (indirect string, offset: 0x18fb5): xexpose
    <8eb51>   DW_AT_decl_file   : 12
    <8eb51>   DW_AT_decl_line   : 981
    <8eb53>   DW_AT_decl_column : 15
    <8eb54>   DW_AT_type        : <0x8dcca>
 <2><8eb58>: Abbrev Number: 12 (DW_TAG_member)
    <8eb59>   DW_AT_name        : (indirect string, offset: 0x18c77): xgraphicsexpose
    <8eb5d>   DW_AT_decl_file   : 12
    <8eb5d>   DW_AT_decl_line   : 982
    <8eb5f>   DW_AT_decl_column : 23
    <8eb60>   DW_AT_type        : <0x8dd84>
 <2><8eb64>: Abbrev Number: 12 (DW_TAG_member)
    <8eb65>   DW_AT_name        : (indirect string, offset: 0x1864d): xnoexpose
    <8eb69>   DW_AT_decl_file   : 12
    <8eb69>   DW_AT_decl_line   : 983
    <8eb6b>   DW_AT_decl_column : 17
    <8eb6c>   DW_AT_type        : <0x8ddfc>
 <2><8eb70>: Abbrev Number: 12 (DW_TAG_member)
    <8eb71>   DW_AT_name        : (indirect string, offset: 0x18846): xvisibility
    <8eb75>   DW_AT_decl_file   : 12
    <8eb75>   DW_AT_decl_line   : 984
    <8eb77>   DW_AT_decl_column : 19
    <8eb78>   DW_AT_type        : <0x8de66>
 <2><8eb7c>: Abbrev Number: 12 (DW_TAG_member)
    <8eb7d>   DW_AT_name        : (indirect string, offset: 0x192a9): xcreatewindow
    <8eb81>   DW_AT_decl_file   : 12
    <8eb81>   DW_AT_decl_line   : 985
    <8eb83>   DW_AT_decl_column : 21
    <8eb84>   DW_AT_type        : <0x8df20>
 <2><8eb88>: Abbrev Number: 12 (DW_TAG_member)
    <8eb89>   DW_AT_name        : (indirect string, offset: 0x18eed): xdestroywindow
    <8eb8d>   DW_AT_decl_file   : 12
    <8eb8d>   DW_AT_decl_line   : 986
    <8eb8f>   DW_AT_decl_column : 22
    <8eb90>   DW_AT_type        : <0x8df8a>
 <2><8eb94>: Abbrev Number: 12 (DW_TAG_member)
    <8eb95>   DW_AT_name        : (indirect string, offset: 0x19b16): xunmap
    <8eb99>   DW_AT_decl_file   : 12
    <8eb99>   DW_AT_decl_line   : 987
    <8eb9b>   DW_AT_decl_column : 14
    <8eb9c>   DW_AT_type        : <0x8e002>
 <2><8eba0>: Abbrev Number: 12 (DW_TAG_member)
    <8eba1>   DW_AT_name        : (indirect string, offset: 0x1947a): xmap
    <8eba5>   DW_AT_decl_file   : 12
    <8eba5>   DW_AT_decl_line   : 988
    <8eba7>   DW_AT_decl_column : 12
    <8eba8>   DW_AT_type        : <0x8e07a>
 <2><8ebac>: Abbrev Number: 12 (DW_TAG_member)
    <8ebad>   DW_AT_name        : (indirect string, offset: 0x19358): xmaprequest
    <8ebb1>   DW_AT_decl_file   : 12
    <8ebb1>   DW_AT_decl_line   : 989
    <8ebb3>   DW_AT_decl_column : 19
    <8ebb4>   DW_AT_type        : <0x8e0e4>
 <2><8ebb8>: Abbrev Number: 12 (DW_TAG_member)
    <8ebb9>   DW_AT_name        : (indirect string, offset: 0x19970): xreparent
    <8ebbd>   DW_AT_decl_file   : 12
    <8ebbd>   DW_AT_decl_line   : 990
    <8ebbf>   DW_AT_decl_column : 17
    <8ebc0>   DW_AT_type        : <0x8e182>
 <2><8ebc4>: Abbrev Number: 12 (DW_TAG_member)
    <8ebc5>   DW_AT_name        : (indirect string, offset: 0x1927d): xconfigure
    <8ebc9>   DW_AT_decl_file   : 12
    <8ebc9>   DW_AT_decl_line   : 991
    <8ebcb>   DW_AT_decl_column : 18
    <8ebcc>   DW_AT_type        : <0x8e24a>
 <2><8ebd0>: Abbrev Number: 12 (DW_TAG_member)
    <8ebd1>   DW_AT_name        : (indirect string, offset: 0x1951c): xgravity
    <8ebd5>   DW_AT_decl_file   : 12
    <8ebd5>   DW_AT_decl_line   : 992
    <8ebd7>   DW_AT_decl_column : 16
    <8ebd8>   DW_AT_type        : <0x8e2cc>
 <2><8ebdc>: Abbrev Number: 12 (DW_TAG_member)
    <8ebdd>   DW_AT_name        : (indirect string, offset: 0x1943e): xresizerequest
    <8ebe1>   DW_AT_decl_file   : 12
    <8ebe1>   DW_AT_decl_line   : 993
    <8ebe3>   DW_AT_decl_column : 22
    <8ebe4>   DW_AT_type        : <0x8e344>
 <2><8ebe8>: Abbrev Number: 12 (DW_TAG_member)
    <8ebe9>   DW_AT_name        : (indirect string, offset: 0x19387): xconfigurerequest
    <8ebed>   DW_AT_decl_file   : 12
    <8ebed>   DW_AT_decl_line   : 994
    <8ebef>   DW_AT_decl_column : 25
    <8ebf0>   DW_AT_type        : <0x8e41a>
 <2><8ebf4>: Abbrev Number: 12 (DW_TAG_member)
    <8ebf5>   DW_AT_name        : (indirect string, offset: 0x18928): xcirculate
    <8ebf9>   DW_AT_decl_file   : 12
    <8ebf9>   DW_AT_decl_line   : 995
    <8ebfb>   DW_AT_decl_column : 18
    <8ebfc>   DW_AT_type        : <0x8e492>
 <2><8ec00>: Abbrev Number: 12 (DW_TAG_member)
    <8ec01>   DW_AT_name        : (indirect string, offset: 0x18615): xcirculaterequest
    <8ec05>   DW_AT_decl_file   : 12
    <8ec05>   DW_AT_decl_line   : 996
    <8ec07>   DW_AT_decl_column : 25
    <8ec08>   DW_AT_type        : <0x8e50a>
 <2><8ec0c>: Abbrev Number: 12 (DW_TAG_member)
    <8ec0d>   DW_AT_name        : (indirect string, offset: 0x19865): xproperty
    <8ec11>   DW_AT_decl_file   : 12
    <8ec11>   DW_AT_decl_line   : 997
    <8ec13>   DW_AT_decl_column : 17
    <8ec14>   DW_AT_type        : <0x8e590>
 <2><8ec18>: Abbrev Number: 12 (DW_TAG_member)
    <8ec19>   DW_AT_name        : (indirect string, offset: 0x1933d): xselectionclear
    <8ec1d>   DW_AT_decl_file   : 12
    <8ec1d>   DW_AT_decl_line   : 998
    <8ec1f>   DW_AT_decl_column : 23
    <8ec20>   DW_AT_type        : <0x8e608>
 <2><8ec24>: Abbrev Number: 12 (DW_TAG_member)
    <8ec25>   DW_AT_name        : (indirect string, offset: 0x198b2): xselectionrequest
    <8ec29>   DW_AT_decl_file   : 12
    <8ec29>   DW_AT_decl_line   : 999
    <8ec2b>   DW_AT_decl_column : 25
    <8ec2c>   DW_AT_type        : <0x8e6aa>
 <2><8ec30>: Abbrev Number: 12 (DW_TAG_member)
    <8ec31>   DW_AT_name        : (indirect string, offset: 0x18be6): xselection
    <8ec35>   DW_AT_decl_file   : 12
    <8ec35>   DW_AT_decl_line   : 1000
    <8ec37>   DW_AT_decl_column : 18
    <8ec38>   DW_AT_type        : <0x8e73e>
 <2><8ec3c>: Abbrev Number: 12 (DW_TAG_member)
    <8ec3d>   DW_AT_name        : (indirect string, offset: 0x1979a): xcolormap
    <8ec41>   DW_AT_decl_file   : 12
    <8ec41>   DW_AT_decl_line   : 1001
    <8ec43>   DW_AT_decl_column : 17
    <8ec44>   DW_AT_type        : <0x8e7c4>
 <2><8ec48>: Abbrev Number: 12 (DW_TAG_member)
    <8ec49>   DW_AT_name        : (indirect string, offset: 0x18c66): xclient
    <8ec4d>   DW_AT_decl_file   : 12
    <8ec4d>   DW_AT_decl_line   : 1002
    <8ec4f>   DW_AT_decl_column : 22
    <8ec50>   DW_AT_type        : <0x8e893>
 <2><8ec54>: Abbrev Number: 12 (DW_TAG_member)
    <8ec55>   DW_AT_name        : (indirect string, offset: 0x19612): xmapping
    <8ec59>   DW_AT_decl_file   : 12
    <8ec59>   DW_AT_decl_line   : 1003
    <8ec5b>   DW_AT_decl_column : 16
    <8ec5c>   DW_AT_type        : <0x8e919>
 <2><8ec60>: Abbrev Number: 12 (DW_TAG_member)
    <8ec61>   DW_AT_name        : (indirect string, offset: 0x19201): xerror
    <8ec65>   DW_AT_decl_file   : 12
    <8ec65>   DW_AT_decl_line   : 1004
    <8ec67>   DW_AT_decl_column : 14
    <8ec68>   DW_AT_type        : <0x8e991>
 <2><8ec6c>: Abbrev Number: 12 (DW_TAG_member)
    <8ec6d>   DW_AT_name        : (indirect string, offset: 0x1889d): xkeymap
    <8ec71>   DW_AT_decl_file   : 12
    <8ec71>   DW_AT_decl_line   : 1005
    <8ec73>   DW_AT_decl_column : 15
    <8ec74>   DW_AT_type        : <0x8dc2c>
 <2><8ec78>: Abbrev Number: 12 (DW_TAG_member)
    <8ec79>   DW_AT_name        : (indirect string, offset: 0x19513): xgeneric
    <8ec7d>   DW_AT_decl_file   : 12
    <8ec7d>   DW_AT_decl_line   : 1006
    <8ec7f>   DW_AT_decl_column : 16
    <8ec80>   DW_AT_type        : <0x8ea57>
 <2><8ec84>: Abbrev Number: 12 (DW_TAG_member)
    <8ec85>   DW_AT_name        : (indirect string, offset: 0x190bf): xcookie
    <8ec89>   DW_AT_decl_file   : 12
    <8ec89>   DW_AT_decl_line   : 1007
    <8ec8b>   DW_AT_decl_column : 22
    <8ec8c>   DW_AT_type        : <0x8eadd>
 <2><8ec90>: Abbrev Number: 43 (DW_TAG_member)
    <8ec91>   DW_AT_name        : pad
    <8ec95>   DW_AT_decl_file   : 12
    <8ec95>   DW_AT_decl_line   : 1008
    <8ec97>   DW_AT_decl_column : 7
    <8ec98>   DW_AT_type        : <0x8ec9d>
 <2><8ec9c>: Abbrev Number: 0
 <1><8ec9d>: Abbrev Number: 21 (DW_TAG_array_type)
    <8ec9e>   DW_AT_type        : <0x8c400>
    <8eca2>   DW_AT_sibling     : <0x8ecad>
 <2><8eca6>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8eca7>   DW_AT_type        : <0x8c3c0>
    <8ecab>   DW_AT_upper_bound : 23
 <2><8ecac>: Abbrev Number: 0
 <1><8ecad>: Abbrev Number: 10 (DW_TAG_typedef)
    <8ecae>   DW_AT_name        : (indirect string, offset: 0x19256): XEvent
    <8ecb2>   DW_AT_decl_file   : 12
    <8ecb3>   DW_AT_decl_line   : 1009
    <8ecb5>   DW_AT_decl_column : 3
    <8ecb6>   DW_AT_type        : <0x8eaea>
 <1><8ecba>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8ecbb>   DW_AT_byte_size   : 8
    <8ecbc>   DW_AT_decl_file   : 13
    <8ecbd>   DW_AT_decl_line   : 88
    <8ecbe>   DW_AT_decl_column : 2
    <8ecbf>   DW_AT_sibling     : <0x8ecda>
 <2><8ecc3>: Abbrev Number: 16 (DW_TAG_member)
    <8ecc4>   DW_AT_name        : x
    <8ecc6>   DW_AT_decl_file   : 13
    <8ecc7>   DW_AT_decl_line   : 89
    <8ecc8>   DW_AT_decl_column : 7
    <8ecc9>   DW_AT_type        : <0x8c3ef>
    <8eccd>   DW_AT_data_member_location: 0
 <2><8ecce>: Abbrev Number: 16 (DW_TAG_member)
    <8eccf>   DW_AT_name        : y
    <8ecd1>   DW_AT_decl_file   : 13
    <8ecd2>   DW_AT_decl_line   : 90
    <8ecd3>   DW_AT_decl_column : 7
    <8ecd4>   DW_AT_type        : <0x8c3ef>
    <8ecd8>   DW_AT_data_member_location: 4
 <2><8ecd9>: Abbrev Number: 0
 <1><8ecda>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8ecdb>   DW_AT_byte_size   : 80
    <8ecdc>   DW_AT_decl_file   : 13
    <8ecdd>   DW_AT_decl_line   : 81
    <8ecde>   DW_AT_decl_column : 9
    <8ecdf>   DW_AT_sibling     : <0x8edb0>
 <2><8ece3>: Abbrev Number: 4 (DW_TAG_member)
    <8ece4>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8ece8>   DW_AT_decl_file   : 13
    <8ece9>   DW_AT_decl_line   : 82
    <8ecea>   DW_AT_decl_column : 11
    <8eceb>   DW_AT_type        : <0x8c400>
    <8ecef>   DW_AT_data_member_location: 0
 <2><8ecf0>: Abbrev Number: 16 (DW_TAG_member)
    <8ecf1>   DW_AT_name        : x
    <8ecf3>   DW_AT_decl_file   : 13
    <8ecf4>   DW_AT_decl_line   : 83
    <8ecf5>   DW_AT_decl_column : 6
    <8ecf6>   DW_AT_type        : <0x8c3ef>
    <8ecfa>   DW_AT_data_member_location: 8
 <2><8ecfb>: Abbrev Number: 16 (DW_TAG_member)
    <8ecfc>   DW_AT_name        : y
    <8ecfe>   DW_AT_decl_file   : 13
    <8ecff>   DW_AT_decl_line   : 83
    <8ed00>   DW_AT_decl_column : 9
    <8ed01>   DW_AT_type        : <0x8c3ef>
    <8ed05>   DW_AT_data_member_location: 12
 <2><8ed06>: Abbrev Number: 4 (DW_TAG_member)
    <8ed07>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8ed0b>   DW_AT_decl_file   : 13
    <8ed0c>   DW_AT_decl_line   : 84
    <8ed0d>   DW_AT_decl_column : 6
    <8ed0e>   DW_AT_type        : <0x8c3ef>
    <8ed12>   DW_AT_data_member_location: 16
 <2><8ed13>: Abbrev Number: 4 (DW_TAG_member)
    <8ed14>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8ed18>   DW_AT_decl_file   : 13
    <8ed19>   DW_AT_decl_line   : 84
    <8ed1a>   DW_AT_decl_column : 13
    <8ed1b>   DW_AT_type        : <0x8c3ef>
    <8ed1f>   DW_AT_data_member_location: 20
 <2><8ed20>: Abbrev Number: 4 (DW_TAG_member)
    <8ed21>   DW_AT_name        : (indirect string, offset: 0x1894d): min_width
    <8ed25>   DW_AT_decl_file   : 13
    <8ed26>   DW_AT_decl_line   : 85
    <8ed27>   DW_AT_decl_column : 6
    <8ed28>   DW_AT_type        : <0x8c3ef>
    <8ed2c>   DW_AT_data_member_location: 24
 <2><8ed2d>: Abbrev Number: 4 (DW_TAG_member)
    <8ed2e>   DW_AT_name        : (indirect string, offset: 0x1923c): min_height
    <8ed32>   DW_AT_decl_file   : 13
    <8ed33>   DW_AT_decl_line   : 85
    <8ed34>   DW_AT_decl_column : 17
    <8ed35>   DW_AT_type        : <0x8c3ef>
    <8ed39>   DW_AT_data_member_location: 28
 <2><8ed3a>: Abbrev Number: 4 (DW_TAG_member)
    <8ed3b>   DW_AT_name        : (indirect string, offset: 0x19549): max_width
    <8ed3f>   DW_AT_decl_file   : 13
    <8ed40>   DW_AT_decl_line   : 86
    <8ed41>   DW_AT_decl_column : 6
    <8ed42>   DW_AT_type        : <0x8c3ef>
    <8ed46>   DW_AT_data_member_location: 32
 <2><8ed47>: Abbrev Number: 4 (DW_TAG_member)
    <8ed48>   DW_AT_name        : (indirect string, offset: 0x19409): max_height
    <8ed4c>   DW_AT_decl_file   : 13
    <8ed4d>   DW_AT_decl_line   : 86
    <8ed4e>   DW_AT_decl_column : 17
    <8ed4f>   DW_AT_type        : <0x8c3ef>
    <8ed53>   DW_AT_data_member_location: 36
 <2><8ed54>: Abbrev Number: 4 (DW_TAG_member)
    <8ed55>   DW_AT_name        : (indirect string, offset: 0x18aed): width_inc
    <8ed59>   DW_AT_decl_file   : 13
    <8ed5a>   DW_AT_decl_line   : 87
    <8ed5b>   DW_AT_decl_column : 10
    <8ed5c>   DW_AT_type        : <0x8c3ef>
    <8ed60>   DW_AT_data_member_location: 40
 <2><8ed61>: Abbrev Number: 4 (DW_TAG_member)
    <8ed62>   DW_AT_name        : (indirect string, offset: 0x1987c): height_inc
    <8ed66>   DW_AT_decl_file   : 13
    <8ed67>   DW_AT_decl_line   : 87
    <8ed68>   DW_AT_decl_column : 21
    <8ed69>   DW_AT_type        : <0x8c3ef>
    <8ed6d>   DW_AT_data_member_location: 44
 <2><8ed6e>: Abbrev Number: 4 (DW_TAG_member)
    <8ed6f>   DW_AT_name        : (indirect string, offset: 0x1882f): min_aspect
    <8ed73>   DW_AT_decl_file   : 13
    <8ed74>   DW_AT_decl_line   : 91
    <8ed75>   DW_AT_decl_column : 4
    <8ed76>   DW_AT_type        : <0x8ecba>
    <8ed7a>   DW_AT_data_member_location: 48
 <2><8ed7b>: Abbrev Number: 4 (DW_TAG_member)
    <8ed7c>   DW_AT_name        : (indirect string, offset: 0x18d0b): max_aspect
    <8ed80>   DW_AT_decl_file   : 13
    <8ed81>   DW_AT_decl_line   : 91
    <8ed82>   DW_AT_decl_column : 16
    <8ed83>   DW_AT_type        : <0x8ecba>
    <8ed87>   DW_AT_data_member_location: 56
 <2><8ed88>: Abbrev Number: 4 (DW_TAG_member)
    <8ed89>   DW_AT_name        : (indirect string, offset: 0x19399): base_width
    <8ed8d>   DW_AT_decl_file   : 13
    <8ed8e>   DW_AT_decl_line   : 92
    <8ed8f>   DW_AT_decl_column : 6
    <8ed90>   DW_AT_type        : <0x8c3ef>
    <8ed94>   DW_AT_data_member_location: 64
 <2><8ed95>: Abbrev Number: 4 (DW_TAG_member)
    <8ed96>   DW_AT_name        : (indirect string, offset: 0x198a6): base_height
    <8ed9a>   DW_AT_decl_file   : 13
    <8ed9b>   DW_AT_decl_line   : 92
    <8ed9c>   DW_AT_decl_column : 18
    <8ed9d>   DW_AT_type        : <0x8c3ef>
    <8eda1>   DW_AT_data_member_location: 68
 <2><8eda2>: Abbrev Number: 4 (DW_TAG_member)
    <8eda3>   DW_AT_name        : (indirect string, offset: 0x18c87): win_gravity
    <8eda7>   DW_AT_decl_file   : 13
    <8eda8>   DW_AT_decl_line   : 93
    <8eda9>   DW_AT_decl_column : 6
    <8edaa>   DW_AT_type        : <0x8c3ef>
    <8edae>   DW_AT_data_member_location: 72
 <2><8edaf>: Abbrev Number: 0
 <1><8edb0>: Abbrev Number: 9 (DW_TAG_typedef)
    <8edb1>   DW_AT_name        : (indirect string, offset: 0x186d4): XSizeHints
    <8edb5>   DW_AT_decl_file   : 13
    <8edb6>   DW_AT_decl_line   : 94
    <8edb7>   DW_AT_decl_column : 3
    <8edb8>   DW_AT_type        : <0x8ecda>
 <1><8edbc>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8edbd>   DW_AT_byte_size   : 56
    <8edbe>   DW_AT_decl_file   : 13
    <8edbf>   DW_AT_decl_line   : 119
    <8edc0>   DW_AT_decl_column : 9
    <8edc1>   DW_AT_sibling     : <0x8ee3b>
 <2><8edc5>: Abbrev Number: 4 (DW_TAG_member)
    <8edc6>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8edca>   DW_AT_decl_file   : 13
    <8edcb>   DW_AT_decl_line   : 120
    <8edcc>   DW_AT_decl_column : 7
    <8edcd>   DW_AT_type        : <0x8c400>
    <8edd1>   DW_AT_data_member_location: 0
 <2><8edd2>: Abbrev Number: 4 (DW_TAG_member)
    <8edd3>   DW_AT_name        : (indirect string, offset: 0x1a72e): input
    <8edd7>   DW_AT_decl_file   : 13
    <8edd8>   DW_AT_decl_line   : 121
    <8edd9>   DW_AT_decl_column : 7
    <8edda>   DW_AT_type        : <0x8c3ef>
    <8edde>   DW_AT_data_member_location: 8
 <2><8eddf>: Abbrev Number: 4 (DW_TAG_member)
    <8ede0>   DW_AT_name        : (indirect string, offset: 0x186df): initial_state
    <8ede4>   DW_AT_decl_file   : 13
    <8ede5>   DW_AT_decl_line   : 123
    <8ede6>   DW_AT_decl_column : 6
    <8ede7>   DW_AT_type        : <0x8c3ef>
    <8edeb>   DW_AT_data_member_location: 12
 <2><8edec>: Abbrev Number: 4 (DW_TAG_member)
    <8eded>   DW_AT_name        : (indirect string, offset: 0x19111): icon_pixmap
    <8edf1>   DW_AT_decl_file   : 13
    <8edf2>   DW_AT_decl_line   : 124
    <8edf3>   DW_AT_decl_column : 9
    <8edf4>   DW_AT_type        : <0x8cd90>
    <8edf8>   DW_AT_data_member_location: 16
 <2><8edf9>: Abbrev Number: 4 (DW_TAG_member)
    <8edfa>   DW_AT_name        : (indirect string, offset: 0x18b1c): icon_window
    <8edfe>   DW_AT_decl_file   : 13
    <8edff>   DW_AT_decl_line   : 125
    <8ee00>   DW_AT_decl_column : 9
    <8ee01>   DW_AT_type        : <0x8cd6c>
    <8ee05>   DW_AT_data_member_location: 24
 <2><8ee06>: Abbrev Number: 4 (DW_TAG_member)
    <8ee07>   DW_AT_name        : (indirect string, offset: 0x198ef): icon_x
    <8ee0b>   DW_AT_decl_file   : 13
    <8ee0c>   DW_AT_decl_line   : 126
    <8ee0d>   DW_AT_decl_column : 6
    <8ee0e>   DW_AT_type        : <0x8c3ef>
    <8ee12>   DW_AT_data_member_location: 32
 <2><8ee13>: Abbrev Number: 4 (DW_TAG_member)
    <8ee14>   DW_AT_name        : (indirect string, offset: 0x198f6): icon_y
    <8ee18>   DW_AT_decl_file   : 13
    <8ee19>   DW_AT_decl_line   : 126
    <8ee1a>   DW_AT_decl_column : 14
    <8ee1b>   DW_AT_type        : <0x8c3ef>
    <8ee1f>   DW_AT_data_member_location: 36
 <2><8ee20>: Abbrev Number: 4 (DW_TAG_member)
    <8ee21>   DW_AT_name        : (indirect string, offset: 0x19966): icon_mask
    <8ee25>   DW_AT_decl_file   : 13
    <8ee26>   DW_AT_decl_line   : 127
    <8ee27>   DW_AT_decl_column : 9
    <8ee28>   DW_AT_type        : <0x8cd90>
    <8ee2c>   DW_AT_data_member_location: 40
 <2><8ee2d>: Abbrev Number: 4 (DW_TAG_member)
    <8ee2e>   DW_AT_name        : (indirect string, offset: 0x19941): window_group
    <8ee32>   DW_AT_decl_file   : 13
    <8ee33>   DW_AT_decl_line   : 128
    <8ee34>   DW_AT_decl_column : 6
    <8ee35>   DW_AT_type        : <0x8cd3c>
    <8ee39>   DW_AT_data_member_location: 48
 <2><8ee3a>: Abbrev Number: 0
 <1><8ee3b>: Abbrev Number: 9 (DW_TAG_typedef)
    <8ee3c>   DW_AT_name        : (indirect string, offset: 0x18627): XWMHints
    <8ee40>   DW_AT_decl_file   : 13
    <8ee41>   DW_AT_decl_line   : 130
    <8ee42>   DW_AT_decl_column : 3
    <8ee43>   DW_AT_type        : <0x8edbc>
 <1><8ee47>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8ee48>   DW_AT_name        : (indirect string, offset: 0x1887c): _XComposeStatus
    <8ee4c>   DW_AT_byte_size   : 16
    <8ee4d>   DW_AT_decl_file   : 13
    <8ee4e>   DW_AT_decl_line   : 231
    <8ee4f>   DW_AT_decl_column : 16
    <8ee50>   DW_AT_sibling     : <0x8ee6f>
 <2><8ee54>: Abbrev Number: 4 (DW_TAG_member)
    <8ee55>   DW_AT_name        : (indirect string, offset: 0x19641): compose_ptr
    <8ee59>   DW_AT_decl_file   : 13
    <8ee5a>   DW_AT_decl_line   : 232
    <8ee5b>   DW_AT_decl_column : 14
    <8ee5c>   DW_AT_type        : <0x8cdd3>
    <8ee60>   DW_AT_data_member_location: 0
 <2><8ee61>: Abbrev Number: 4 (DW_TAG_member)
    <8ee62>   DW_AT_name        : (indirect string, offset: 0x189e8): chars_matched
    <8ee66>   DW_AT_decl_file   : 13
    <8ee67>   DW_AT_decl_line   : 233
    <8ee68>   DW_AT_decl_column : 9
    <8ee69>   DW_AT_type        : <0x8c3ef>
    <8ee6d>   DW_AT_data_member_location: 8
 <2><8ee6e>: Abbrev Number: 0
 <1><8ee6f>: Abbrev Number: 9 (DW_TAG_typedef)
    <8ee70>   DW_AT_name        : (indirect string, offset: 0x1887d): XComposeStatus
    <8ee74>   DW_AT_decl_file   : 13
    <8ee75>   DW_AT_decl_line   : 234
    <8ee76>   DW_AT_decl_column : 3
    <8ee77>   DW_AT_type        : <0x8ee47>
 <1><8ee7b>: Abbrev Number: 9 (DW_TAG_typedef)
    <8ee7c>   DW_AT_name        : (indirect string, offset: 0x19263): Pixel
    <8ee80>   DW_AT_decl_file   : 14
    <8ee81>   DW_AT_decl_line   : 83
    <8ee82>   DW_AT_decl_column : 23
    <8ee83>   DW_AT_type        : <0x8c3c0>
 <1><8ee87>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8ee88>   DW_AT_byte_size   : 24
    <8ee89>   DW_AT_decl_file   : 14
    <8ee8a>   DW_AT_decl_line   : 100
    <8ee8b>   DW_AT_decl_column : 9
    <8ee8c>   DW_AT_sibling     : <0x8eeb8>
 <2><8ee90>: Abbrev Number: 4 (DW_TAG_member)
    <8ee91>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <8ee95>   DW_AT_decl_file   : 14
    <8ee96>   DW_AT_decl_line   : 101
    <8ee97>   DW_AT_decl_column : 11
    <8ee98>   DW_AT_type        : <0x8c426>
    <8ee9c>   DW_AT_data_member_location: 0
 <2><8ee9d>: Abbrev Number: 4 (DW_TAG_member)
    <8ee9e>   DW_AT_name        : (indirect string, offset: 0x1bb97): value
    <8eea2>   DW_AT_decl_file   : 14
    <8eea3>   DW_AT_decl_line   : 102
    <8eea4>   DW_AT_decl_column : 11
    <8eea5>   DW_AT_type        : <0x8c426>
    <8eea9>   DW_AT_data_member_location: 8
 <2><8eeaa>: Abbrev Number: 4 (DW_TAG_member)
    <8eeab>   DW_AT_name        : (indirect string, offset: 0x1a4d8): pixel
    <8eeaf>   DW_AT_decl_file   : 14
    <8eeb0>   DW_AT_decl_line   : 103
    <8eeb1>   DW_AT_decl_column : 11
    <8eeb2>   DW_AT_type        : <0x8ee7b>
    <8eeb6>   DW_AT_data_member_location: 16
 <2><8eeb7>: Abbrev Number: 0
 <1><8eeb8>: Abbrev Number: 9 (DW_TAG_typedef)
    <8eeb9>   DW_AT_name        : (indirect string, offset: 0x18d16): XpmColorSymbol
    <8eebd>   DW_AT_decl_file   : 14
    <8eebe>   DW_AT_decl_line   : 104
    <8eebf>   DW_AT_decl_column : 8
    <8eec0>   DW_AT_type        : <0x8ee87>
 <1><8eec4>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8eec5>   DW_AT_byte_size   : 24
    <8eec6>   DW_AT_decl_file   : 14
    <8eec7>   DW_AT_decl_line   : 106
    <8eec8>   DW_AT_decl_column : 9
    <8eec9>   DW_AT_sibling     : <0x8eef5>
 <2><8eecd>: Abbrev Number: 4 (DW_TAG_member)
    <8eece>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <8eed2>   DW_AT_decl_file   : 14
    <8eed3>   DW_AT_decl_line   : 107
    <8eed4>   DW_AT_decl_column : 11
    <8eed5>   DW_AT_type        : <0x8c426>
    <8eed9>   DW_AT_data_member_location: 0
 <2><8eeda>: Abbrev Number: 4 (DW_TAG_member)
    <8eedb>   DW_AT_name        : (indirect string, offset: 0x19553): nlines
    <8eedf>   DW_AT_decl_file   : 14
    <8eee0>   DW_AT_decl_line   : 108
    <8eee1>   DW_AT_decl_column : 18
    <8eee2>   DW_AT_type        : <0x8c3da>
    <8eee6>   DW_AT_data_member_location: 8
 <2><8eee7>: Abbrev Number: 4 (DW_TAG_member)
    <8eee8>   DW_AT_name        : (indirect string, offset: 0x19554): lines
    <8eeec>   DW_AT_decl_file   : 14
    <8eeed>   DW_AT_decl_line   : 109
    <8eeee>   DW_AT_decl_column : 12
    <8eeef>   DW_AT_type        : <0x8c792>
    <8eef3>   DW_AT_data_member_location: 16
 <2><8eef4>: Abbrev Number: 0
 <1><8eef5>: Abbrev Number: 9 (DW_TAG_typedef)
    <8eef6>   DW_AT_name        : (indirect string, offset: 0x18e63): XpmExtension
    <8eefa>   DW_AT_decl_file   : 14
    <8eefb>   DW_AT_decl_line   : 110
    <8eefc>   DW_AT_decl_column : 8
    <8eefd>   DW_AT_type        : <0x8eec4>
 <1><8ef01>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8ef02>   DW_AT_byte_size   : 48
    <8ef03>   DW_AT_decl_file   : 14
    <8ef04>   DW_AT_decl_line   : 112
    <8ef05>   DW_AT_decl_column : 9
    <8ef06>   DW_AT_sibling     : <0x8ef59>
 <2><8ef0a>: Abbrev Number: 4 (DW_TAG_member)
    <8ef0b>   DW_AT_name        : (indirect string, offset: 0x1a81f): string
    <8ef0f>   DW_AT_decl_file   : 14
    <8ef10>   DW_AT_decl_line   : 113
    <8ef11>   DW_AT_decl_column : 11
    <8ef12>   DW_AT_type        : <0x8c426>
    <8ef16>   DW_AT_data_member_location: 0
 <2><8ef17>: Abbrev Number: 4 (DW_TAG_member)
    <8ef18>   DW_AT_name        : (indirect string, offset: 0x18709): symbolic
    <8ef1c>   DW_AT_decl_file   : 14
    <8ef1d>   DW_AT_decl_line   : 114
    <8ef1e>   DW_AT_decl_column : 11
    <8ef1f>   DW_AT_type        : <0x8c426>
    <8ef23>   DW_AT_data_member_location: 8
 <2><8ef24>: Abbrev Number: 4 (DW_TAG_member)
    <8ef25>   DW_AT_name        : (indirect string, offset: 0x19aac): m_color
    <8ef29>   DW_AT_decl_file   : 14
    <8ef2a>   DW_AT_decl_line   : 115
    <8ef2b>   DW_AT_decl_column : 11
    <8ef2c>   DW_AT_type        : <0x8c426>
    <8ef30>   DW_AT_data_member_location: 16
 <2><8ef31>: Abbrev Number: 4 (DW_TAG_member)
    <8ef32>   DW_AT_name        : (indirect string, offset: 0x18d54): g4_color
    <8ef36>   DW_AT_decl_file   : 14
    <8ef37>   DW_AT_decl_line   : 116
    <8ef38>   DW_AT_decl_column : 11
    <8ef39>   DW_AT_type        : <0x8c426>
    <8ef3d>   DW_AT_data_member_location: 24
 <2><8ef3e>: Abbrev Number: 4 (DW_TAG_member)
    <8ef3f>   DW_AT_name        : (indirect string, offset: 0x1ac58): g_color
    <8ef43>   DW_AT_decl_file   : 14
    <8ef44>   DW_AT_decl_line   : 117
    <8ef45>   DW_AT_decl_column : 11
    <8ef46>   DW_AT_type        : <0x8c426>
    <8ef4a>   DW_AT_data_member_location: 32
 <2><8ef4b>: Abbrev Number: 4 (DW_TAG_member)
    <8ef4c>   DW_AT_name        : (indirect string, offset: 0x18856): c_color
    <8ef50>   DW_AT_decl_file   : 14
    <8ef51>   DW_AT_decl_line   : 118
    <8ef52>   DW_AT_decl_column : 11
    <8ef53>   DW_AT_type        : <0x8c426>
    <8ef57>   DW_AT_data_member_location: 40
 <2><8ef58>: Abbrev Number: 0
 <1><8ef59>: Abbrev Number: 9 (DW_TAG_typedef)
    <8ef5a>   DW_AT_name        : (indirect string, offset: 0x19b4c): XpmColor
    <8ef5e>   DW_AT_decl_file   : 14
    <8ef5f>   DW_AT_decl_line   : 119
    <8ef60>   DW_AT_decl_column : 8
    <8ef61>   DW_AT_type        : <0x8ef01>
 <1><8ef65>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8ef66>   DW_AT_byte_size   : 8
    <8ef66>   DW_AT_type        : <0x8ef59>
 <1><8ef6a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8ef6b>   DW_AT_byte_size   : 8
    <8ef6b>   DW_AT_type        : <0x8eef5>
 <1><8ef6f>: Abbrev Number: 9 (DW_TAG_typedef)
    <8ef70>   DW_AT_name        : (indirect string, offset: 0x18b93): XpmAllocColorFunc
    <8ef74>   DW_AT_decl_file   : 14
    <8ef75>   DW_AT_decl_line   : 141
    <8ef76>   DW_AT_decl_column : 15
    <8ef77>   DW_AT_type        : <0x8ef7b>
 <1><8ef7b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8ef7c>   DW_AT_byte_size   : 8
    <8ef7c>   DW_AT_type        : <0x8ef80>
 <1><8ef80>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8ef81>   DW_AT_prototyped  : 1
    <8ef81>   DW_AT_type        : <0x8c3ef>
    <8ef85>   DW_AT_sibling     : <0x8efa3>
 <2><8ef89>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef8a>   DW_AT_type        : <0x8d87d>
 <2><8ef8e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef8f>   DW_AT_type        : <0x8cda8>
 <2><8ef93>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef94>   DW_AT_type        : <0x8c426>
 <2><8ef98>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef99>   DW_AT_type        : <0x8efa3>
 <2><8ef9d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef9e>   DW_AT_type        : <0x8c413>
 <2><8efa2>: Abbrev Number: 0
 <1><8efa3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8efa4>   DW_AT_byte_size   : 8
    <8efa4>   DW_AT_type        : <0x8d4c7>
 <1><8efa8>: Abbrev Number: 9 (DW_TAG_typedef)
    <8efa9>   DW_AT_name        : (indirect string, offset: 0x18916): XpmFreeColorsFunc
    <8efad>   DW_AT_decl_file   : 14
    <8efae>   DW_AT_decl_line   : 149
    <8efaf>   DW_AT_decl_column : 15
    <8efb0>   DW_AT_type        : <0x8efb4>
 <1><8efb4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8efb5>   DW_AT_byte_size   : 8
    <8efb5>   DW_AT_type        : <0x8efb9>
 <1><8efb9>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8efba>   DW_AT_prototyped  : 1
    <8efba>   DW_AT_type        : <0x8c3ef>
    <8efbe>   DW_AT_sibling     : <0x8efdc>
 <2><8efc2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8efc3>   DW_AT_type        : <0x8d87d>
 <2><8efc7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8efc8>   DW_AT_type        : <0x8cda8>
 <2><8efcc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8efcd>   DW_AT_type        : <0x8efdc>
 <2><8efd1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8efd2>   DW_AT_type        : <0x8c3ef>
 <2><8efd6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8efd7>   DW_AT_type        : <0x8c413>
 <2><8efdb>: Abbrev Number: 0
 <1><8efdc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8efdd>   DW_AT_byte_size   : 8
    <8efdd>   DW_AT_type        : <0x8ee7b>
 <1><8efe1>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8efe2>   DW_AT_byte_size   : 224
    <8efe3>   DW_AT_decl_file   : 14
    <8efe4>   DW_AT_decl_line   : 157
    <8efe5>   DW_AT_decl_column : 9
    <8efe6>   DW_AT_sibling     : <0x8f1b2>
 <2><8efea>: Abbrev Number: 4 (DW_TAG_member)
    <8efeb>   DW_AT_name        : (indirect string, offset: 0x18f7c): valuemask
    <8efef>   DW_AT_decl_file   : 14
    <8eff0>   DW_AT_decl_line   : 158
    <8eff1>   DW_AT_decl_column : 19
    <8eff2>   DW_AT_type        : <0x8c3c0>
    <8eff6>   DW_AT_data_member_location: 0
 <2><8eff7>: Abbrev Number: 4 (DW_TAG_member)
    <8eff8>   DW_AT_name        : (indirect string, offset: 0x18ad5): visual
    <8effc>   DW_AT_decl_file   : 14
    <8effd>   DW_AT_decl_line   : 161
    <8effe>   DW_AT_decl_column : 13
    <8efff>   DW_AT_type        : <0x8d08d>
    <8f003>   DW_AT_data_member_location: 8
 <2><8f004>: Abbrev Number: 4 (DW_TAG_member)
    <8f005>   DW_AT_name        : (indirect string, offset: 0x1979b): colormap
    <8f009>   DW_AT_decl_file   : 14
    <8f00a>   DW_AT_decl_line   : 162
    <8f00b>   DW_AT_decl_column : 14
    <8f00c>   DW_AT_type        : <0x8cda8>
    <8f010>   DW_AT_data_member_location: 16
 <2><8f011>: Abbrev Number: 4 (DW_TAG_member)
    <8f012>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <8f016>   DW_AT_decl_file   : 14
    <8f017>   DW_AT_decl_line   : 163
    <8f018>   DW_AT_decl_column : 18
    <8f019>   DW_AT_type        : <0x8c3da>
    <8f01d>   DW_AT_data_member_location: 24
 <2><8f01e>: Abbrev Number: 4 (DW_TAG_member)
    <8f01f>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8f023>   DW_AT_decl_file   : 14
    <8f024>   DW_AT_decl_line   : 164
    <8f025>   DW_AT_decl_column : 18
    <8f026>   DW_AT_type        : <0x8c3da>
    <8f02a>   DW_AT_data_member_location: 28
 <2><8f02b>: Abbrev Number: 4 (DW_TAG_member)
    <8f02c>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8f030>   DW_AT_decl_file   : 14
    <8f031>   DW_AT_decl_line   : 166
    <8f032>   DW_AT_decl_column : 18
    <8f033>   DW_AT_type        : <0x8c3da>
    <8f037>   DW_AT_data_member_location: 32
 <2><8f038>: Abbrev Number: 4 (DW_TAG_member)
    <8f039>   DW_AT_name        : (indirect string, offset: 0x19681): x_hotspot
    <8f03d>   DW_AT_decl_file   : 14
    <8f03e>   DW_AT_decl_line   : 168
    <8f03f>   DW_AT_decl_column : 18
    <8f040>   DW_AT_type        : <0x8c3da>
    <8f044>   DW_AT_data_member_location: 36
 <2><8f045>: Abbrev Number: 4 (DW_TAG_member)
    <8f046>   DW_AT_name        : (indirect string, offset: 0x1968b): y_hotspot
    <8f04a>   DW_AT_decl_file   : 14
    <8f04b>   DW_AT_decl_line   : 170
    <8f04c>   DW_AT_decl_column : 18
    <8f04d>   DW_AT_type        : <0x8c3da>
    <8f051>   DW_AT_data_member_location: 40
 <2><8f052>: Abbrev Number: 16 (DW_TAG_member)
    <8f053>   DW_AT_name        : cpp
    <8f057>   DW_AT_decl_file   : 14
    <8f058>   DW_AT_decl_line   : 172
    <8f059>   DW_AT_decl_column : 18
    <8f05a>   DW_AT_type        : <0x8c3da>
    <8f05e>   DW_AT_data_member_location: 44
 <2><8f05f>: Abbrev Number: 4 (DW_TAG_member)
    <8f060>   DW_AT_name        : (indirect string, offset: 0x18c1e): pixels
    <8f064>   DW_AT_decl_file   : 14
    <8f065>   DW_AT_decl_line   : 174
    <8f066>   DW_AT_decl_column : 12
    <8f067>   DW_AT_type        : <0x8efdc>
    <8f06b>   DW_AT_data_member_location: 48
 <2><8f06c>: Abbrev Number: 4 (DW_TAG_member)
    <8f06d>   DW_AT_name        : (indirect string, offset: 0x19234): npixels
    <8f071>   DW_AT_decl_file   : 14
    <8f072>   DW_AT_decl_line   : 175
    <8f073>   DW_AT_decl_column : 18
    <8f074>   DW_AT_type        : <0x8c3da>
    <8f078>   DW_AT_data_member_location: 56
 <2><8f079>: Abbrev Number: 4 (DW_TAG_member)
    <8f07a>   DW_AT_name        : (indirect string, offset: 0x187c9): colorsymbols
    <8f07e>   DW_AT_decl_file   : 14
    <8f07f>   DW_AT_decl_line   : 176
    <8f080>   DW_AT_decl_column : 21
    <8f081>   DW_AT_type        : <0x8f1b2>
    <8f085>   DW_AT_data_member_location: 64
 <2><8f086>: Abbrev Number: 4 (DW_TAG_member)
    <8f087>   DW_AT_name        : (indirect string, offset: 0x19783): numsymbols
    <8f08b>   DW_AT_decl_file   : 14
    <8f08c>   DW_AT_decl_line   : 177
    <8f08d>   DW_AT_decl_column : 18
    <8f08e>   DW_AT_type        : <0x8c3da>
    <8f092>   DW_AT_data_member_location: 72
 <2><8f093>: Abbrev Number: 4 (DW_TAG_member)
    <8f094>   DW_AT_name        : (indirect string, offset: 0x19839): rgb_fname
    <8f098>   DW_AT_decl_file   : 14
    <8f099>   DW_AT_decl_line   : 178
    <8f09a>   DW_AT_decl_column : 11
    <8f09b>   DW_AT_type        : <0x8c426>
    <8f09f>   DW_AT_data_member_location: 80
 <2><8f0a0>: Abbrev Number: 4 (DW_TAG_member)
    <8f0a1>   DW_AT_name        : (indirect string, offset: 0x19652): nextensions
    <8f0a5>   DW_AT_decl_file   : 14
    <8f0a6>   DW_AT_decl_line   : 179
    <8f0a7>   DW_AT_decl_column : 18
    <8f0a8>   DW_AT_type        : <0x8c3da>
    <8f0ac>   DW_AT_data_member_location: 88
 <2><8f0ad>: Abbrev Number: 4 (DW_TAG_member)
    <8f0ae>   DW_AT_name        : (indirect string, offset: 0x17e80): extensions
    <8f0b2>   DW_AT_decl_file   : 14
    <8f0b3>   DW_AT_decl_line   : 180
    <8f0b4>   DW_AT_decl_column : 19
    <8f0b5>   DW_AT_type        : <0x8ef6a>
    <8f0b9>   DW_AT_data_member_location: 96
 <2><8f0ba>: Abbrev Number: 4 (DW_TAG_member)
    <8f0bb>   DW_AT_name        : (indirect string, offset: 0x188d9): ncolors
    <8f0bf>   DW_AT_decl_file   : 14
    <8f0c0>   DW_AT_decl_line   : 182
    <8f0c1>   DW_AT_decl_column : 18
    <8f0c2>   DW_AT_type        : <0x8c3da>
    <8f0c6>   DW_AT_data_member_location: 104
 <2><8f0c7>: Abbrev Number: 4 (DW_TAG_member)
    <8f0c8>   DW_AT_name        : (indirect string, offset: 0x19288): colorTable
    <8f0cc>   DW_AT_decl_file   : 14
    <8f0cd>   DW_AT_decl_line   : 183
    <8f0ce>   DW_AT_decl_column : 15
    <8f0cf>   DW_AT_type        : <0x8ef65>
    <8f0d3>   DW_AT_data_member_location: 112
 <2><8f0d4>: Abbrev Number: 4 (DW_TAG_member)
    <8f0d5>   DW_AT_name        : (indirect string, offset: 0x1937d): hints_cmt
    <8f0d9>   DW_AT_decl_file   : 14
    <8f0da>   DW_AT_decl_line   : 185
    <8f0db>   DW_AT_decl_column : 11
    <8f0dc>   DW_AT_type        : <0x8c426>
    <8f0e0>   DW_AT_data_member_location: 120
 <2><8f0e1>: Abbrev Number: 4 (DW_TAG_member)
    <8f0e2>   DW_AT_name        : (indirect string, offset: 0x18f65): colors_cmt
    <8f0e6>   DW_AT_decl_file   : 14
    <8f0e7>   DW_AT_decl_line   : 186
    <8f0e8>   DW_AT_decl_column : 11
    <8f0e9>   DW_AT_type        : <0x8c426>
    <8f0ed>   DW_AT_data_member_location: 128
 <2><8f0ee>: Abbrev Number: 4 (DW_TAG_member)
