 <3><e4df8>: Abbrev Number: 37 (DW_TAG_lexical_block)
    <e4df9>   DW_AT_ranges      : 0x18770
 <4><e4dfd>: Abbrev Number: 21 (DW_TAG_variable)
    <e4dfe>   DW_AT_abstract_origin: <0xe4ed4>
    <e4e02>   DW_AT_location    : 0x43225 (location list)
    <e4e06>   DW_AT_GNU_locviews: 0x4321f
 <4><e4e0a>: Abbrev Number: 21 (DW_TAG_variable)
    <e4e0b>   DW_AT_abstract_origin: <0xe4ede>
    <e4e0f>   DW_AT_location    : 0x43240 (location list)
    <e4e13>   DW_AT_GNU_locviews: 0x4323a
 <4><e4e17>: Abbrev Number: 22 (DW_TAG_call_site)
    <e4e18>   DW_AT_call_return_pc: 0x47926c
    <e4e20>   DW_AT_call_origin : <0xe4ccb>
    <e4e24>   DW_AT_sibling     : <0xe4e41>
 <5><e4e28>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <e4e29>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e4e2b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><e4e2e>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <e4e2f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e4e31>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><e4e33>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <e4e34>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e4e36>   DW_AT_call_value  : 3 byte block: 40 40 24 	(DW_OP_lit16; DW_OP_lit16; DW_OP_shl)
 <5><e4e3a>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <e4e3b>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))

 <1><e4f23>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f24>   DW_AT_byte_size   : 1
    <e4f25>   DW_AT_encoding    : 8	(unsigned char)
    <e4f26>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><e4f2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f2b>   DW_AT_byte_size   : 2
    <e4f2c>   DW_AT_encoding    : 7	(unsigned)
    <e4f2d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><e4f31>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f32>   DW_AT_byte_size   : 4
    <e4f33>   DW_AT_encoding    : 7	(unsigned)
    <e4f34>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><e4f38>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f39>   DW_AT_byte_size   : 8
    <e4f3a>   DW_AT_encoding    : 7	(unsigned)
    <e4f3b>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><e4f3f>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f40>   DW_AT_byte_size   : 1
    <e4f41>   DW_AT_encoding    : 6	(signed char)
    <e4f42>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><e4f46>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f47>   DW_AT_byte_size   : 2
    <e4f48>   DW_AT_encoding    : 5	(signed)
    <e4f49>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><e4f4d>: Abbrev Number: 25 (DW_TAG_base_type)
    <e4f4e>   DW_AT_byte_size   : 4
    <e4f4f>   DW_AT_encoding    : 5	(signed)
    <e4f50>   DW_AT_name        : int
 <1><e4f54>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f55>   DW_AT_byte_size   : 8
    <e4f56>   DW_AT_encoding    : 5	(signed)
    <e4f57>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><e4f5b>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4f5c>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <e4f60>   DW_AT_decl_file   : 2
    <e4f61>   DW_AT_decl_line   : 152
    <e4f62>   DW_AT_decl_column : 25
    <e4f63>   DW_AT_type        : <0xe4f54>
 <1><e4f67>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4f68>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <e4f6c>   DW_AT_decl_file   : 2
    <e4f6d>   DW_AT_decl_line   : 153
    <e4f6e>   DW_AT_decl_column : 27
    <e4f6f>   DW_AT_type        : <0xe4f54>
 <1><e4f73>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <e4f74>   DW_AT_byte_size   : 8
 <1><e4f75>: Abbrev Number: 16 (DW_TAG_restrict_type)
    <e4f76>   DW_AT_type        : <0xe4f73>
 <1><e4f7a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4f7b>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <e4f7f>   DW_AT_decl_file   : 2
    <e4f80>   DW_AT_decl_line   : 194
    <e4f81>   DW_AT_decl_column : 27
    <e4f82>   DW_AT_type        : <0xe4f54>
 <1><e4f86>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e4f87>   DW_AT_byte_size   : 8
    <e4f87>   DW_AT_type        : <0xe4f8b>
 <1><e4f8b>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4f8c>   DW_AT_byte_size   : 1
    <e4f8d>   DW_AT_encoding    : 6	(signed char)
    <e4f8e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><e4f92>: Abbrev Number: 17 (DW_TAG_const_type)
    <e4f93>   DW_AT_type        : <0xe4f8b>
 <1><e4f97>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4f98>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <e4f9c>   DW_AT_decl_file   : 3
    <e4f9d>   DW_AT_decl_line   : 209
    <e4f9e>   DW_AT_decl_column : 23
    <e4f9f>   DW_AT_type        : <0xe4f38>
 <1><e4fa3>: Abbrev Number: 27 (DW_TAG_typedef)
    <e4fa4>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <e4fa8>   DW_AT_decl_file   : 3
    <e4fa9>   DW_AT_decl_line   : 321
    <e4fab>   DW_AT_decl_column : 24
    <e4fac>   DW_AT_type        : <0xe4f4d>
 <1><e4fb0>: Abbrev Number: 17 (DW_TAG_const_type)
    <e4fb1>   DW_AT_type        : <0xe4fa3>
 <1><e4fb5>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4fb6>   DW_AT_byte_size   : 8
    <e4fb7>   DW_AT_encoding    : 5	(signed)
    <e4fb8>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e4fbc>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4fbd>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e4fc1>   DW_AT_decl_file   : 4
    <e4fc2>   DW_AT_decl_line   : 87
    <e4fc3>   DW_AT_decl_column : 19
    <e4fc4>   DW_AT_type        : <0xe4f67>
 <1><e4fc8>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4fc9>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <e4fcd>   DW_AT_decl_file   : 4
    <e4fce>   DW_AT_decl_line   : 108
    <e4fcf>   DW_AT_decl_column : 19
    <e4fd0>   DW_AT_type        : <0xe4f7a>
 <1><e4fd4>: Abbrev Number: 7 (DW_TAG_base_type)
    <e4fd5>   DW_AT_byte_size   : 8
    <e4fd6>   DW_AT_encoding    : 7	(unsigned)
    <e4fd7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e4fdb>: Abbrev Number: 11 (DW_TAG_array_type)
    <e4fdc>   DW_AT_type        : <0xe4f8b>
    <e4fe0>   DW_AT_sibling     : <0xe4feb>
 <2><e4fe4>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e4fe5>   DW_AT_type        : <0xe4f38>
    <e4fe9>   DW_AT_upper_bound : 3
 <2><e4fea>: Abbrev Number: 0
 <1><e4feb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e4fec>   DW_AT_byte_size   : 8
    <e4fec>   DW_AT_type        : <0xe4ff0>
 <1><e4ff0>: Abbrev Number: 28 (DW_TAG_const_type)
 <1><e4ff1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e4ff2>   DW_AT_byte_size   : 8
    <e4ff2>   DW_AT_type        : <0xe4f92>
 <1><e4ff6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e4ff7>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <e4ffb>   DW_AT_byte_size   : 216
    <e4ffc>   DW_AT_decl_file   : 5
    <e4ffd>   DW_AT_decl_line   : 49
    <e4ffe>   DW_AT_decl_column : 8
    <e4fff>   DW_AT_sibling     : <0xe517d>
 <2><e5003>: Abbrev Number: 1 (DW_TAG_member)
    <e5004>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <e5008>   DW_AT_decl_file   : 5
    <e5009>   DW_AT_decl_line   : 51
    <e500a>   DW_AT_decl_column : 7
    <e500b>   DW_AT_type        : <0xe4f4d>
    <e500f>   DW_AT_data_member_location: 0
 <2><e5010>: Abbrev Number: 1 (DW_TAG_member)
    <e5011>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <e5015>   DW_AT_decl_file   : 5
    <e5016>   DW_AT_decl_line   : 54
    <e5017>   DW_AT_decl_column : 9
    <e5018>   DW_AT_type        : <0xe4f86>
    <e501c>   DW_AT_data_member_location: 8
 <2><e501d>: Abbrev Number: 1 (DW_TAG_member)
    <e501e>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <e5022>   DW_AT_decl_file   : 5
    <e5023>   DW_AT_decl_line   : 55
    <e5024>   DW_AT_decl_column : 9
    <e5025>   DW_AT_type        : <0xe4f86>
    <e5029>   DW_AT_data_member_location: 16
 <2><e502a>: Abbrev Number: 1 (DW_TAG_member)
    <e502b>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <e502f>   DW_AT_decl_file   : 5
    <e5030>   DW_AT_decl_line   : 56
    <e5031>   DW_AT_decl_column : 9
    <e5032>   DW_AT_type        : <0xe4f86>
    <e5036>   DW_AT_data_member_location: 24
 <2><e5037>: Abbrev Number: 1 (DW_TAG_member)
    <e5038>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <e503c>   DW_AT_decl_file   : 5
    <e503d>   DW_AT_decl_line   : 57
    <e503e>   DW_AT_decl_column : 9
    <e503f>   DW_AT_type        : <0xe4f86>
    <e5043>   DW_AT_data_member_location: 32
 <2><e5044>: Abbrev Number: 1 (DW_TAG_member)
    <e5045>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <e5049>   DW_AT_decl_file   : 5
    <e504a>   DW_AT_decl_line   : 58
    <e504b>   DW_AT_decl_column : 9
    <e504c>   DW_AT_type        : <0xe4f86>
    <e5050>   DW_AT_data_member_location: 40
 <2><e5051>: Abbrev Number: 1 (DW_TAG_member)
    <e5052>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <e5056>   DW_AT_decl_file   : 5
    <e5057>   DW_AT_decl_line   : 59
    <e5058>   DW_AT_decl_column : 9
    <e5059>   DW_AT_type        : <0xe4f86>
    <e505d>   DW_AT_data_member_location: 48
 <2><e505e>: Abbrev Number: 1 (DW_TAG_member)
    <e505f>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <e5063>   DW_AT_decl_file   : 5
    <e5064>   DW_AT_decl_line   : 60
    <e5065>   DW_AT_decl_column : 9
    <e5066>   DW_AT_type        : <0xe4f86>
    <e506a>   DW_AT_data_member_location: 56
 <2><e506b>: Abbrev Number: 1 (DW_TAG_member)
    <e506c>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <e5070>   DW_AT_decl_file   : 5
    <e5071>   DW_AT_decl_line   : 61
    <e5072>   DW_AT_decl_column : 9
    <e5073>   DW_AT_type        : <0xe4f86>
    <e5077>   DW_AT_data_member_location: 64
 <2><e5078>: Abbrev Number: 1 (DW_TAG_member)
    <e5079>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <e507d>   DW_AT_decl_file   : 5
    <e507e>   DW_AT_decl_line   : 64
    <e507f>   DW_AT_decl_column : 9
    <e5080>   DW_AT_type        : <0xe4f86>
    <e5084>   DW_AT_data_member_location: 72
 <2><e5085>: Abbrev Number: 1 (DW_TAG_member)
    <e5086>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <e508a>   DW_AT_decl_file   : 5
    <e508b>   DW_AT_decl_line   : 65
    <e508c>   DW_AT_decl_column : 9
    <e508d>   DW_AT_type        : <0xe4f86>
    <e5091>   DW_AT_data_member_location: 80
 <2><e5092>: Abbrev Number: 1 (DW_TAG_member)
    <e5093>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <e5097>   DW_AT_decl_file   : 5
    <e5098>   DW_AT_decl_line   : 66
    <e5099>   DW_AT_decl_column : 9
    <e509a>   DW_AT_type        : <0xe4f86>
    <e509e>   DW_AT_data_member_location: 88
 <2><e509f>: Abbrev Number: 1 (DW_TAG_member)
    <e50a0>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <e50a4>   DW_AT_decl_file   : 5
    <e50a5>   DW_AT_decl_line   : 68
    <e50a6>   DW_AT_decl_column : 22
    <e50a7>   DW_AT_type        : <0xe5196>
    <e50ab>   DW_AT_data_member_location: 96
 <2><e50ac>: Abbrev Number: 1 (DW_TAG_member)
    <e50ad>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <e50b1>   DW_AT_decl_file   : 5
    <e50b2>   DW_AT_decl_line   : 70
    <e50b3>   DW_AT_decl_column : 20
    <e50b4>   DW_AT_type        : <0xe519b>
    <e50b8>   DW_AT_data_member_location: 104
 <2><e50b9>: Abbrev Number: 1 (DW_TAG_member)
    <e50ba>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <e50be>   DW_AT_decl_file   : 5
    <e50bf>   DW_AT_decl_line   : 72
    <e50c0>   DW_AT_decl_column : 7
    <e50c1>   DW_AT_type        : <0xe4f4d>
    <e50c5>   DW_AT_data_member_location: 112
 <2><e50c6>: Abbrev Number: 1 (DW_TAG_member)
    <e50c7>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <e50cb>   DW_AT_decl_file   : 5
    <e50cc>   DW_AT_decl_line   : 73
    <e50cd>   DW_AT_decl_column : 7
    <e50ce>   DW_AT_type        : <0xe4f4d>
    <e50d2>   DW_AT_data_member_location: 116
 <2><e50d3>: Abbrev Number: 1 (DW_TAG_member)
    <e50d4>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <e50d8>   DW_AT_decl_file   : 5
    <e50d9>   DW_AT_decl_line   : 74
    <e50da>   DW_AT_decl_column : 11
    <e50db>   DW_AT_type        : <0xe4f5b>
    <e50df>   DW_AT_data_member_location: 120
 <2><e50e0>: Abbrev Number: 1 (DW_TAG_member)
    <e50e1>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <e50e5>   DW_AT_decl_file   : 5
    <e50e6>   DW_AT_decl_line   : 77
    <e50e7>   DW_AT_decl_column : 18
    <e50e8>   DW_AT_type        : <0xe4f2a>
    <e50ec>   DW_AT_data_member_location: 128
 <2><e50ed>: Abbrev Number: 1 (DW_TAG_member)
    <e50ee>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <e50f2>   DW_AT_decl_file   : 5
    <e50f3>   DW_AT_decl_line   : 78
    <e50f4>   DW_AT_decl_column : 15
    <e50f5>   DW_AT_type        : <0xe4f3f>
    <e50f9>   DW_AT_data_member_location: 130
 <2><e50fa>: Abbrev Number: 1 (DW_TAG_member)
    <e50fb>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <e50ff>   DW_AT_decl_file   : 5
    <e5100>   DW_AT_decl_line   : 79
    <e5101>   DW_AT_decl_column : 8
    <e5102>   DW_AT_type        : <0xe51a0>
    <e5106>   DW_AT_data_member_location: 131
 <2><e5107>: Abbrev Number: 1 (DW_TAG_member)
    <e5108>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <e510c>   DW_AT_decl_file   : 5
    <e510d>   DW_AT_decl_line   : 81
    <e510e>   DW_AT_decl_column : 15
    <e510f>   DW_AT_type        : <0xe51b0>
    <e5113>   DW_AT_data_member_location: 136
 <2><e5114>: Abbrev Number: 1 (DW_TAG_member)
    <e5115>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <e5119>   DW_AT_decl_file   : 5
    <e511a>   DW_AT_decl_line   : 89
    <e511b>   DW_AT_decl_column : 13
    <e511c>   DW_AT_type        : <0xe4f67>
    <e5120>   DW_AT_data_member_location: 144
 <2><e5121>: Abbrev Number: 1 (DW_TAG_member)
    <e5122>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <e5126>   DW_AT_decl_file   : 5
    <e5127>   DW_AT_decl_line   : 91
    <e5128>   DW_AT_decl_column : 23
    <e5129>   DW_AT_type        : <0xe51ba>
    <e512d>   DW_AT_data_member_location: 152
 <2><e512e>: Abbrev Number: 1 (DW_TAG_member)
    <e512f>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <e5133>   DW_AT_decl_file   : 5
    <e5134>   DW_AT_decl_line   : 92
    <e5135>   DW_AT_decl_column : 25
    <e5136>   DW_AT_type        : <0xe51c4>
    <e513a>   DW_AT_data_member_location: 160
 <2><e513b>: Abbrev Number: 1 (DW_TAG_member)
    <e513c>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <e5140>   DW_AT_decl_file   : 5
    <e5141>   DW_AT_decl_line   : 93
    <e5142>   DW_AT_decl_column : 20
    <e5143>   DW_AT_type        : <0xe519b>
    <e5147>   DW_AT_data_member_location: 168
 <2><e5148>: Abbrev Number: 1 (DW_TAG_member)
    <e5149>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <e514d>   DW_AT_decl_file   : 5
    <e514e>   DW_AT_decl_line   : 94
    <e514f>   DW_AT_decl_column : 9
    <e5150>   DW_AT_type        : <0xe4f73>
    <e5154>   DW_AT_data_member_location: 176
 <2><e5155>: Abbrev Number: 1 (DW_TAG_member)
    <e5156>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <e515a>   DW_AT_decl_file   : 5
    <e515b>   DW_AT_decl_line   : 95
    <e515c>   DW_AT_decl_column : 10
    <e515d>   DW_AT_type        : <0xe4f97>
    <e5161>   DW_AT_data_member_location: 184
 <2><e5162>: Abbrev Number: 1 (DW_TAG_member)
    <e5163>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <e5167>   DW_AT_decl_file   : 5
    <e5168>   DW_AT_decl_line   : 96
    <e5169>   DW_AT_decl_column : 7
    <e516a>   DW_AT_type        : <0xe4f4d>
    <e516e>   DW_AT_data_member_location: 192
 <2><e516f>: Abbrev Number: 1 (DW_TAG_member)
    <e5170>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <e5174>   DW_AT_decl_file   : 5
    <e5175>   DW_AT_decl_line   : 98
    <e5176>   DW_AT_decl_column : 8
    <e5177>   DW_AT_type        : <0xe51c9>
    <e517b>   DW_AT_data_member_location: 196
 <2><e517c>: Abbrev Number: 0
 <1><e517d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e517e>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <e5182>   DW_AT_decl_file   : 6
    <e5183>   DW_AT_decl_line   : 7
    <e5184>   DW_AT_decl_column : 25
    <e5185>   DW_AT_type        : <0xe4ff6>
 <1><e5189>: Abbrev Number: 29 (DW_TAG_typedef)
    <e518a>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <e518e>   DW_AT_decl_file   : 5
    <e518f>   DW_AT_decl_line   : 43
    <e5190>   DW_AT_decl_column : 14
 <1><e5191>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e5192>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <e5196>   DW_AT_declaration : 1
 <1><e5196>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5197>   DW_AT_byte_size   : 8
    <e5197>   DW_AT_type        : <0xe5191>
 <1><e519b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e519c>   DW_AT_byte_size   : 8
    <e519c>   DW_AT_type        : <0xe4ff6>
 <1><e51a0>: Abbrev Number: 11 (DW_TAG_array_type)
    <e51a1>   DW_AT_type        : <0xe4f8b>
    <e51a5>   DW_AT_sibling     : <0xe51b0>
 <2><e51a9>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e51aa>   DW_AT_type        : <0xe4f38>
    <e51ae>   DW_AT_upper_bound : 0
 <2><e51af>: Abbrev Number: 0
 <1><e51b0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e51b1>   DW_AT_byte_size   : 8
    <e51b1>   DW_AT_type        : <0xe5189>
 <1><e51b5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e51b6>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <e51ba>   DW_AT_declaration : 1
 <1><e51ba>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e51bb>   DW_AT_byte_size   : 8
    <e51bb>   DW_AT_type        : <0xe51b5>
 <1><e51bf>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e51c0>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <e51c4>   DW_AT_declaration : 1
 <1><e51c4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e51c5>   DW_AT_byte_size   : 8
    <e51c5>   DW_AT_type        : <0xe51bf>
 <1><e51c9>: Abbrev Number: 11 (DW_TAG_array_type)
    <e51ca>   DW_AT_type        : <0xe4f8b>
    <e51ce>   DW_AT_sibling     : <0xe51d9>
 <2><e51d2>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e51d3>   DW_AT_type        : <0xe4f38>
    <e51d7>   DW_AT_upper_bound : 19
 <2><e51d8>: Abbrev Number: 0
 <1><e51d9>: Abbrev Number: 14 (DW_TAG_variable)
    <e51da>   DW_AT_name        : (indirect string, offset: 0x1b976): stdin
    <e51de>   DW_AT_decl_file   : 7
    <e51de>   DW_AT_decl_line   : 137
    <e51df>   DW_AT_decl_column : 14
    <e51df>   DW_AT_type        : <0xe51e3>
    <e51e3>   DW_AT_external    : 1
    <e51e3>   DW_AT_declaration : 1
 <1><e51e3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e51e4>   DW_AT_byte_size   : 8
    <e51e4>   DW_AT_type        : <0xe517d>
 <1><e51e8>: Abbrev Number: 16 (DW_TAG_restrict_type)
    <e51e9>   DW_AT_type        : <0xe51e3>
 <1><e51ed>: Abbrev Number: 14 (DW_TAG_variable)
    <e51ee>   DW_AT_name        : (indirect string, offset: 0x1b9ba): stdout
    <e51f2>   DW_AT_decl_file   : 7
    <e51f2>   DW_AT_decl_line   : 138
    <e51f3>   DW_AT_decl_column : 14
    <e51f3>   DW_AT_type        : <0xe51e3>
    <e51f7>   DW_AT_external    : 1
    <e51f7>   DW_AT_declaration : 1
 <1><e51f7>: Abbrev Number: 14 (DW_TAG_variable)
    <e51f8>   DW_AT_name        : (indirect string, offset: 0x1b784): stderr
    <e51fc>   DW_AT_decl_file   : 7
    <e51fc>   DW_AT_decl_line   : 139
    <e51fd>   DW_AT_decl_column : 14
    <e51fd>   DW_AT_type        : <0xe51e3>
    <e5201>   DW_AT_external    : 1
    <e5201>   DW_AT_declaration : 1
 <1><e5201>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5202>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <e5206>   DW_AT_decl_file   : 8
    <e5207>   DW_AT_decl_line   : 22
    <e5208>   DW_AT_decl_column : 15
    <e5209>   DW_AT_type        : <0xe4fbc>
 <1><e520d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <e520e>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <e5212>   DW_AT_encoding    : 7	(void)
    <e5212>   DW_AT_byte_size   : 4
    <e5212>   DW_AT_type        : <0xe4f31>
    <e5216>   DW_AT_decl_file   : 10
    <e5217>   DW_AT_decl_line   : 1
    <e5218>   DW_AT_decl_column : 14
    <e5218>   DW_AT_sibling     : <0xe528f>
 <2><e521c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e521d>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <e5221>   DW_AT_const_value : 0
 <2><e5222>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5223>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <e5227>   DW_AT_const_value : 1
 <2><e5228>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5229>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <e522d>   DW_AT_const_value : 2
 <2><e522e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e522f>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <e5233>   DW_AT_const_value : 3
 <2><e5234>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5235>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <e5239>   DW_AT_const_value : 4
 <2><e523a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e523b>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <e523f>   DW_AT_const_value : 5
 <2><e5240>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5241>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <e5245>   DW_AT_const_value : 6
 <2><e5246>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5247>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <e524b>   DW_AT_const_value : 7
 <2><e524c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e524d>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <e5251>   DW_AT_const_value : 8
 <2><e5252>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5253>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <e5257>   DW_AT_const_value : 9
 <2><e5258>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5259>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <e525d>   DW_AT_const_value : 10
 <2><e525e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e525f>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <e5263>   DW_AT_const_value : 11
 <2><e5264>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5265>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <e5269>   DW_AT_const_value : 12
 <2><e526a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e526b>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <e526f>   DW_AT_const_value : 13
 <2><e5270>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5271>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <e5275>   DW_AT_const_value : 14
 <2><e5276>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5277>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <e527b>   DW_AT_const_value : 15
 <2><e527c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e527d>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <e5281>   DW_AT_const_value : 16
 <2><e5282>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5283>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <e5287>   DW_AT_const_value : 17
 <2><e5288>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5289>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <e528d>   DW_AT_const_value : 18
 <2><e528e>: Abbrev Number: 0
 <1><e528f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e5290>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <e5294>   DW_AT_byte_size   : 24
    <e5295>   DW_AT_decl_file   : 9
    <e5296>   DW_AT_decl_line   : 82
    <e5297>   DW_AT_decl_column : 16
    <e5298>   DW_AT_sibling     : <0xe52c3>
 <2><e529c>: Abbrev Number: 1 (DW_TAG_member)
    <e529d>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <e52a1>   DW_AT_decl_file   : 9
    <e52a2>   DW_AT_decl_line   : 83
    <e52a3>   DW_AT_decl_column : 21
    <e52a4>   DW_AT_type        : <0xe4f86>
    <e52a8>   DW_AT_data_member_location: 0
 <2><e52a9>: Abbrev Number: 19 (DW_TAG_member)
    <e52aa>   DW_AT_name        : len
    <e52ae>   DW_AT_decl_file   : 9
    <e52af>   DW_AT_decl_line   : 84
    <e52b0>   DW_AT_decl_column : 21
    <e52b0>   DW_AT_type        : <0xe4fc8>
    <e52b4>   DW_AT_data_member_location: 8
 <2><e52b5>: Abbrev Number: 1 (DW_TAG_member)
    <e52b6>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e52ba>   DW_AT_decl_file   : 9
    <e52bb>   DW_AT_decl_line   : 85
    <e52bc>   DW_AT_decl_column : 21
    <e52bd>   DW_AT_type        : <0xe4fc8>
    <e52c1>   DW_AT_data_member_location: 16
 <2><e52c2>: Abbrev Number: 0
 <1><e52c3>: Abbrev Number: 4 (DW_TAG_typedef)
    <e52c4>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <e52c8>   DW_AT_decl_file   : 9
    <e52c9>   DW_AT_decl_line   : 86
    <e52ca>   DW_AT_decl_column : 3
    <e52cb>   DW_AT_type        : <0xe528f>
 <1><e52cf>: Abbrev Number: 7 (DW_TAG_base_type)
    <e52d0>   DW_AT_byte_size   : 8
    <e52d1>   DW_AT_encoding    : 4	(float)
    <e52d2>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><e52d6>: Abbrev Number: 7 (DW_TAG_base_type)
    <e52d7>   DW_AT_byte_size   : 4
    <e52d8>   DW_AT_encoding    : 4	(float)
    <e52d9>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><e52dd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e52de>   DW_AT_byte_size   : 8
    <e52de>   DW_AT_type        : <0xe4fa3>
 <1><e52e2>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <e52e3>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <e52e7>   DW_AT_encoding    : 7	(void)
    <e52e7>   DW_AT_byte_size   : 4
    <e52e7>   DW_AT_type        : <0xe4f31>
    <e52eb>   DW_AT_decl_file   : 11
    <e52ec>   DW_AT_decl_line   : 25
    <e52ed>   DW_AT_decl_column : 14
    <e52ed>   DW_AT_sibling     : <0xe530a>
 <2><e52f1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e52f2>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <e52f6>   DW_AT_const_value : 0
 <2><e52f7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e52f8>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <e52fc>   DW_AT_const_value : 1
 <2><e52fd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e52fe>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <e5302>   DW_AT_const_value : 2
 <2><e5303>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5304>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <e5308>   DW_AT_const_value : 3
 <2><e5309>: Abbrev Number: 0
 <1><e530a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e530b>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <e530f>   DW_AT_decl_file   : 11
    <e5310>   DW_AT_decl_line   : 30
    <e5311>   DW_AT_decl_column : 3
    <e5312>   DW_AT_type        : <0xe52e2>
 <1><e5316>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5317>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <e531b>   DW_AT_decl_file   : 11
    <e531c>   DW_AT_decl_line   : 54
    <e531d>   DW_AT_decl_column : 15
    <e531e>   DW_AT_type        : <0xe5322>
 <1><e5322>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5323>   DW_AT_byte_size   : 8
    <e5323>   DW_AT_type        : <0xe5327>
 <1><e5327>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5328>   DW_AT_prototyped  : 1
    <e5328>   DW_AT_type        : <0xe4f4d>
    <e532c>   DW_AT_sibling     : <0xe533b>
 <2><e5330>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5331>   DW_AT_type        : <0xe533b>
 <2><e5335>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5336>   DW_AT_type        : <0xe4f4d>
 <2><e533a>: Abbrev Number: 0
 <1><e533b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e533c>   DW_AT_byte_size   : 8
    <e533c>   DW_AT_type        : <0xe5340>
 <1><e5340>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e5341>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <e5345>   DW_AT_byte_size   : 80
    <e5346>   DW_AT_decl_file   : 11
    <e5347>   DW_AT_decl_line   : 97
    <e5348>   DW_AT_decl_column : 16
    <e5349>   DW_AT_sibling     : <0xe5403>
 <2><e534d>: Abbrev Number: 1 (DW_TAG_member)
    <e534e>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <e5352>   DW_AT_decl_file   : 11
    <e5353>   DW_AT_decl_line   : 98
    <e5354>   DW_AT_decl_column : 21
    <e5355>   DW_AT_type        : <0xe4f4d>
    <e5359>   DW_AT_data_member_location: 0
 <2><e535a>: Abbrev Number: 19 (DW_TAG_member)
    <e535b>   DW_AT_name        : len
    <e535f>   DW_AT_decl_file   : 11
    <e5360>   DW_AT_decl_line   : 99
    <e5361>   DW_AT_decl_column : 21
    <e5361>   DW_AT_type        : <0xe4f4d>
    <e5365>   DW_AT_data_member_location: 4
 <2><e5366>: Abbrev Number: 1 (DW_TAG_member)
    <e5367>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <e536b>   DW_AT_decl_file   : 11
    <e536c>   DW_AT_decl_line   : 100
    <e536d>   DW_AT_decl_column : 21
    <e536e>   DW_AT_type        : <0xe530a>
    <e5372>   DW_AT_data_member_location: 8
 <2><e5373>: Abbrev Number: 1 (DW_TAG_member)
    <e5374>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e5378>   DW_AT_decl_file   : 11
    <e5379>   DW_AT_decl_line   : 101
    <e537a>   DW_AT_decl_column : 21
    <e537b>   DW_AT_type        : <0xe5201>
    <e537f>   DW_AT_data_member_location: 16
 <2><e5380>: Abbrev Number: 1 (DW_TAG_member)
    <e5381>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <e5385>   DW_AT_decl_file   : 11
    <e5386>   DW_AT_decl_line   : 102
    <e5387>   DW_AT_decl_column : 21
    <e5388>   DW_AT_type        : <0xe4f4d>
    <e538c>   DW_AT_data_member_location: 24
 <2><e538d>: Abbrev Number: 1 (DW_TAG_member)
    <e538e>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <e5392>   DW_AT_decl_file   : 11
    <e5393>   DW_AT_decl_line   : 103
    <e5394>   DW_AT_decl_column : 21
    <e5395>   DW_AT_type        : <0xe4f4d>
    <e5399>   DW_AT_data_member_location: 28
 <2><e539a>: Abbrev Number: 1 (DW_TAG_member)
    <e539b>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <e539f>   DW_AT_decl_file   : 11
    <e53a0>   DW_AT_decl_line   : 104
    <e53a1>   DW_AT_decl_column : 21
    <e53a2>   DW_AT_type        : <0xe4f4d>
    <e53a6>   DW_AT_data_member_location: 32
 <2><e53a7>: Abbrev Number: 1 (DW_TAG_member)
    <e53a8>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <e53ac>   DW_AT_decl_file   : 11
    <e53ad>   DW_AT_decl_line   : 105
    <e53ae>   DW_AT_decl_column : 21
    <e53af>   DW_AT_type        : <0xe4f31>
    <e53b3>   DW_AT_data_member_location: 36
 <2><e53b4>: Abbrev Number: 1 (DW_TAG_member)
    <e53b5>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <e53b9>   DW_AT_decl_file   : 11
    <e53ba>   DW_AT_decl_line   : 106
    <e53bb>   DW_AT_decl_column : 21
    <e53bc>   DW_AT_type        : <0xe4f31>
    <e53c0>   DW_AT_data_member_location: 40
 <2><e53c1>: Abbrev Number: 1 (DW_TAG_member)
    <e53c2>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <e53c6>   DW_AT_decl_file   : 11
    <e53c7>   DW_AT_decl_line   : 109
    <e53c8>   DW_AT_decl_column : 21
    <e53c9>   DW_AT_type        : <0xe4fdb>
    <e53cd>   DW_AT_data_member_location: 44
 <2><e53ce>: Abbrev Number: 1 (DW_TAG_member)
    <e53cf>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <e53d3>   DW_AT_decl_file   : 11
    <e53d4>   DW_AT_decl_line   : 110
    <e53d5>   DW_AT_decl_column : 21
    <e53d6>   DW_AT_type        : <0xe4f97>
    <e53da>   DW_AT_data_member_location: 48
 <2><e53db>: Abbrev Number: 1 (DW_TAG_member)
    <e53dc>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <e53e0>   DW_AT_decl_file   : 11
    <e53e1>   DW_AT_decl_line   : 112
    <e53e2>   DW_AT_decl_column : 22
    <e53e3>   DW_AT_type        : <0xe569b>
    <e53e7>   DW_AT_data_member_location: 56
 <2><e53e8>: Abbrev Number: 1 (DW_TAG_member)
    <e53e9>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <e53ed>   DW_AT_decl_file   : 11
    <e53ee>   DW_AT_decl_line   : 114
    <e53ef>   DW_AT_decl_column : 14
    <e53f0>   DW_AT_type        : <0xe4f73>
    <e53f4>   DW_AT_data_member_location: 64
 <2><e53f5>: Abbrev Number: 1 (DW_TAG_member)
    <e53f6>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <e53fa>   DW_AT_decl_file   : 11
    <e53fb>   DW_AT_decl_line   : 116
    <e53fc>   DW_AT_decl_column : 22
    <e53fd>   DW_AT_type        : <0xe533b>
    <e5401>   DW_AT_data_member_location: 72
 <2><e5402>: Abbrev Number: 0
 <1><e5403>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5404>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <e5408>   DW_AT_decl_file   : 11
    <e5409>   DW_AT_decl_line   : 59
    <e540a>   DW_AT_decl_column : 15
    <e540b>   DW_AT_type        : <0xe540f>
 <1><e540f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5410>   DW_AT_byte_size   : 8
    <e5410>   DW_AT_type        : <0xe5414>
 <1><e5414>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5415>   DW_AT_prototyped  : 1
    <e5415>   DW_AT_type        : <0xe4f4d>
    <e5419>   DW_AT_sibling     : <0xe5423>
 <2><e541d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e541e>   DW_AT_type        : <0xe533b>
 <2><e5422>: Abbrev Number: 0
 <1><e5423>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5424>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <e5428>   DW_AT_decl_file   : 11
    <e5429>   DW_AT_decl_line   : 60
    <e542a>   DW_AT_decl_column : 15
    <e542b>   DW_AT_type        : <0xe540f>
 <1><e542f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5430>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <e5434>   DW_AT_decl_file   : 11
    <e5435>   DW_AT_decl_line   : 61
    <e5436>   DW_AT_decl_column : 15
    <e5437>   DW_AT_type        : <0xe543b>
 <1><e543b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e543c>   DW_AT_byte_size   : 8
    <e543c>   DW_AT_type        : <0xe5440>
 <1><e5440>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5441>   DW_AT_prototyped  : 1
    <e5441>   DW_AT_type        : <0xe4f4d>
    <e5445>   DW_AT_sibling     : <0xe5459>
 <2><e5449>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e544a>   DW_AT_type        : <0xe533b>
 <2><e544e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e544f>   DW_AT_type        : <0xe5201>
 <2><e5453>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5454>   DW_AT_type        : <0xe4f4d>
 <2><e5458>: Abbrev Number: 0
 <1><e5459>: Abbrev Number: 4 (DW_TAG_typedef)
    <e545a>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <e545e>   DW_AT_decl_file   : 11
    <e545f>   DW_AT_decl_line   : 62
    <e5460>   DW_AT_decl_column : 15
    <e5461>   DW_AT_type        : <0xe5465>
 <1><e5465>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5466>   DW_AT_byte_size   : 8
    <e5466>   DW_AT_type        : <0xe546a>
 <1><e546a>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e546b>   DW_AT_prototyped  : 1
    <e546b>   DW_AT_type        : <0xe4f4d>
    <e546f>   DW_AT_sibling     : <0xe547e>
 <2><e5473>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5474>   DW_AT_type        : <0xe533b>
 <2><e5478>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5479>   DW_AT_type        : <0xe547e>
 <2><e547d>: Abbrev Number: 0
 <1><e547e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e547f>   DW_AT_byte_size   : 8
    <e547f>   DW_AT_type        : <0xe5201>
 <1><e5483>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5484>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <e5488>   DW_AT_decl_file   : 11
    <e5489>   DW_AT_decl_line   : 63
    <e548a>   DW_AT_decl_column : 15
    <e548b>   DW_AT_type        : <0xe548f>
 <1><e548f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5490>   DW_AT_byte_size   : 8
    <e5490>   DW_AT_type        : <0xe5494>
 <1><e5494>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5495>   DW_AT_prototyped  : 1
    <e5495>   DW_AT_type        : <0xe4f4d>
    <e5499>   DW_AT_sibling     : <0xe54ad>
 <2><e549d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e549e>   DW_AT_type        : <0xe533b>
 <2><e54a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54a3>   DW_AT_type        : <0xe4f73>
 <2><e54a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54a8>   DW_AT_type        : <0xe54ad>
 <2><e54ac>: Abbrev Number: 0
 <1><e54ad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e54ae>   DW_AT_byte_size   : 8
    <e54ae>   DW_AT_type        : <0xe4f97>
 <1><e54b2>: Abbrev Number: 4 (DW_TAG_typedef)
    <e54b3>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <e54b7>   DW_AT_decl_file   : 11
    <e54b8>   DW_AT_decl_line   : 65
    <e54b9>   DW_AT_decl_column : 15
    <e54ba>   DW_AT_type        : <0xe54be>
 <1><e54be>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e54bf>   DW_AT_byte_size   : 8
    <e54bf>   DW_AT_type        : <0xe54c3>
 <1><e54c3>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e54c4>   DW_AT_prototyped  : 1
    <e54c4>   DW_AT_type        : <0xe4f4d>
    <e54c8>   DW_AT_sibling     : <0xe54dc>
 <2><e54cc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54cd>   DW_AT_type        : <0xe533b>
 <2><e54d1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54d2>   DW_AT_type        : <0xe52dd>
 <2><e54d6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54d7>   DW_AT_type        : <0xe54ad>
 <2><e54db>: Abbrev Number: 0
 <1><e54dc>: Abbrev Number: 4 (DW_TAG_typedef)
    <e54dd>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <e54e1>   DW_AT_decl_file   : 11
    <e54e2>   DW_AT_decl_line   : 67
    <e54e3>   DW_AT_decl_column : 15
    <e54e4>   DW_AT_type        : <0xe54e8>
 <1><e54e8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e54e9>   DW_AT_byte_size   : 8
    <e54e9>   DW_AT_type        : <0xe54ed>
 <1><e54ed>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e54ee>   DW_AT_prototyped  : 1
    <e54ee>   DW_AT_type        : <0xe4f4d>
    <e54f2>   DW_AT_sibling     : <0xe5506>
 <2><e54f6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54f7>   DW_AT_type        : <0xe533b>
 <2><e54fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e54fc>   DW_AT_type        : <0xe4feb>
 <2><e5500>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5501>   DW_AT_type        : <0xe4f97>
 <2><e5505>: Abbrev Number: 0
 <1><e5506>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5507>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <e550b>   DW_AT_decl_file   : 11
    <e550c>   DW_AT_decl_line   : 69
    <e550d>   DW_AT_decl_column : 15
    <e550e>   DW_AT_type        : <0xe5512>
 <1><e5512>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5513>   DW_AT_byte_size   : 8
    <e5513>   DW_AT_type        : <0xe5517>
 <1><e5517>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5518>   DW_AT_prototyped  : 1
    <e5518>   DW_AT_type        : <0xe4f4d>
    <e551c>   DW_AT_sibling     : <0xe5530>
 <2><e5520>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5521>   DW_AT_type        : <0xe533b>
 <2><e5525>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5526>   DW_AT_type        : <0xe5530>
 <2><e552a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e552b>   DW_AT_type        : <0xe4f97>
 <2><e552f>: Abbrev Number: 0
 <1><e5530>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5531>   DW_AT_byte_size   : 8
    <e5531>   DW_AT_type        : <0xe4fb0>
 <1><e5535>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5536>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <e553a>   DW_AT_decl_file   : 11
    <e553b>   DW_AT_decl_line   : 71
    <e553c>   DW_AT_decl_column : 15
    <e553d>   DW_AT_type        : <0xe5541>
 <1><e5541>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5542>   DW_AT_byte_size   : 8
    <e5542>   DW_AT_type        : <0xe5546>
 <1><e5546>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5547>   DW_AT_prototyped  : 1
    <e5547>   DW_AT_type        : <0xe4f4d>
    <e554b>   DW_AT_sibling     : <0xe555f>
 <2><e554f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5550>   DW_AT_type        : <0xe533b>
 <2><e5554>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5555>   DW_AT_type        : <0xe5201>
 <2><e5559>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e555a>   DW_AT_type        : <0xe5201>
 <2><e555e>: Abbrev Number: 0
 <1><e555f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5560>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <e5564>   DW_AT_decl_file   : 11
    <e5565>   DW_AT_decl_line   : 73
    <e5566>   DW_AT_decl_column : 15
    <e5567>   DW_AT_type        : <0xe5541>
 <1><e556b>: Abbrev Number: 4 (DW_TAG_typedef)
    <e556c>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <e5570>   DW_AT_decl_file   : 11
    <e5571>   DW_AT_decl_line   : 75
    <e5572>   DW_AT_decl_column : 15
    <e5573>   DW_AT_type        : <0xe5577>
 <1><e5577>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5578>   DW_AT_byte_size   : 8
    <e5578>   DW_AT_type        : <0xe557c>
 <1><e557c>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e557d>   DW_AT_prototyped  : 1
    <e557d>   DW_AT_type        : <0xe4f4d>
    <e5581>   DW_AT_sibling     : <0xe5590>
 <2><e5585>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5586>   DW_AT_type        : <0xe533b>
 <2><e558a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e558b>   DW_AT_type        : <0xe5590>
 <2><e558f>: Abbrev Number: 0
 <1><e5590>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5591>   DW_AT_byte_size   : 8
    <e5591>   DW_AT_type        : <0xe52c3>
 <1><e5595>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5596>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <e559a>   DW_AT_decl_file   : 11
    <e559b>   DW_AT_decl_line   : 76
    <e559c>   DW_AT_decl_column : 15
    <e559d>   DW_AT_type        : <0xe55a1>
 <1><e55a1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e55a2>   DW_AT_byte_size   : 8
    <e55a2>   DW_AT_type        : <0xe55a6>
 <1><e55a6>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e55a7>   DW_AT_prototyped  : 1
    <e55a7>   DW_AT_type        : <0xe4f4d>
    <e55ab>   DW_AT_sibling     : <0xe55bf>
 <2><e55af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e55b0>   DW_AT_type        : <0xe533b>
 <2><e55b4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e55b5>   DW_AT_type        : <0xe52dd>
 <2><e55b9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e55ba>   DW_AT_type        : <0xe4fc8>
 <2><e55be>: Abbrev Number: 0
 <1><e55bf>: Abbrev Number: 4 (DW_TAG_typedef)
    <e55c0>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <e55c4>   DW_AT_decl_file   : 11
    <e55c5>   DW_AT_decl_line   : 77
    <e55c6>   DW_AT_decl_column : 15
    <e55c7>   DW_AT_type        : <0xe540f>
 <1><e55cb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e55cc>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <e55d0>   DW_AT_byte_size   : 112
    <e55d1>   DW_AT_decl_file   : 11
    <e55d2>   DW_AT_decl_line   : 80
    <e55d3>   DW_AT_decl_column : 16
    <e55d4>   DW_AT_sibling     : <0xe568f>
 <2><e55d8>: Abbrev Number: 1 (DW_TAG_member)
    <e55d9>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <e55dd>   DW_AT_decl_file   : 11
    <e55de>   DW_AT_decl_line   : 81
    <e55df>   DW_AT_decl_column : 25
    <e55e0>   DW_AT_type        : <0xe5403>
    <e55e4>   DW_AT_data_member_location: 0
 <2><e55e5>: Abbrev Number: 1 (DW_TAG_member)
    <e55e6>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <e55ea>   DW_AT_decl_file   : 11
    <e55eb>   DW_AT_decl_line   : 82
    <e55ec>   DW_AT_decl_column : 25
    <e55ed>   DW_AT_type        : <0xe5423>
    <e55f1>   DW_AT_data_member_location: 8
 <2><e55f2>: Abbrev Number: 1 (DW_TAG_member)
    <e55f3>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <e55f7>   DW_AT_decl_file   : 11
    <e55f8>   DW_AT_decl_line   : 83
    <e55f9>   DW_AT_decl_column : 25
    <e55fa>   DW_AT_type        : <0xe542f>
    <e55fe>   DW_AT_data_member_location: 16
 <2><e55ff>: Abbrev Number: 1 (DW_TAG_member)
    <e5600>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <e5604>   DW_AT_decl_file   : 11
    <e5605>   DW_AT_decl_line   : 84
    <e5606>   DW_AT_decl_column : 25
    <e5607>   DW_AT_type        : <0xe5459>
    <e560b>   DW_AT_data_member_location: 24
 <2><e560c>: Abbrev Number: 1 (DW_TAG_member)
    <e560d>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <e5611>   DW_AT_decl_file   : 11
    <e5612>   DW_AT_decl_line   : 85
    <e5613>   DW_AT_decl_column : 25
    <e5614>   DW_AT_type        : <0xe5483>
    <e5618>   DW_AT_data_member_location: 32
 <2><e5619>: Abbrev Number: 1 (DW_TAG_member)
    <e561a>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <e561e>   DW_AT_decl_file   : 11
    <e561f>   DW_AT_decl_line   : 86
    <e5620>   DW_AT_decl_column : 25
    <e5621>   DW_AT_type        : <0xe54b2>
    <e5625>   DW_AT_data_member_location: 40
 <2><e5626>: Abbrev Number: 1 (DW_TAG_member)
    <e5627>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <e562b>   DW_AT_decl_file   : 11
    <e562c>   DW_AT_decl_line   : 87
    <e562d>   DW_AT_decl_column : 25
    <e562e>   DW_AT_type        : <0xe54dc>
    <e5632>   DW_AT_data_member_location: 48
 <2><e5633>: Abbrev Number: 1 (DW_TAG_member)
    <e5634>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <e5638>   DW_AT_decl_file   : 11
    <e5639>   DW_AT_decl_line   : 88
    <e563a>   DW_AT_decl_column : 25
    <e563b>   DW_AT_type        : <0xe5506>
    <e563f>   DW_AT_data_member_location: 56
 <2><e5640>: Abbrev Number: 1 (DW_TAG_member)
    <e5641>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <e5645>   DW_AT_decl_file   : 11
    <e5646>   DW_AT_decl_line   : 89
    <e5647>   DW_AT_decl_column : 25
    <e5648>   DW_AT_type        : <0xe5535>
    <e564c>   DW_AT_data_member_location: 64
 <2><e564d>: Abbrev Number: 1 (DW_TAG_member)
    <e564e>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <e5652>   DW_AT_decl_file   : 11
    <e5653>   DW_AT_decl_line   : 90
    <e5654>   DW_AT_decl_column : 25
    <e5655>   DW_AT_type        : <0xe555f>
    <e5659>   DW_AT_data_member_location: 72
 <2><e565a>: Abbrev Number: 1 (DW_TAG_member)
    <e565b>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <e565f>   DW_AT_decl_file   : 11
    <e5660>   DW_AT_decl_line   : 91
    <e5661>   DW_AT_decl_column : 25
    <e5662>   DW_AT_type        : <0xe556b>
    <e5666>   DW_AT_data_member_location: 80
 <2><e5667>: Abbrev Number: 1 (DW_TAG_member)
    <e5668>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <e566c>   DW_AT_decl_file   : 11
    <e566d>   DW_AT_decl_line   : 92
    <e566e>   DW_AT_decl_column : 25
    <e566f>   DW_AT_type        : <0xe5595>
    <e5673>   DW_AT_data_member_location: 88
 <2><e5674>: Abbrev Number: 1 (DW_TAG_member)
    <e5675>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <e5679>   DW_AT_decl_file   : 11
    <e567a>   DW_AT_decl_line   : 93
    <e567b>   DW_AT_decl_column : 25
    <e567c>   DW_AT_type        : <0xe5316>
    <e5680>   DW_AT_data_member_location: 96
 <2><e5681>: Abbrev Number: 1 (DW_TAG_member)
    <e5682>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <e5686>   DW_AT_decl_file   : 11
    <e5687>   DW_AT_decl_line   : 94
    <e5688>   DW_AT_decl_column : 25
    <e5689>   DW_AT_type        : <0xe55bf>
    <e568d>   DW_AT_data_member_location: 104
 <2><e568e>: Abbrev Number: 0
 <1><e568f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5690>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <e5694>   DW_AT_decl_file   : 11
    <e5695>   DW_AT_decl_line   : 95
    <e5696>   DW_AT_decl_column : 3
    <e5697>   DW_AT_type        : <0xe55cb>
 <1><e569b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e569c>   DW_AT_byte_size   : 8
    <e569c>   DW_AT_type        : <0xe568f>
 <1><e56a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e56a1>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <e56a5>   DW_AT_decl_file   : 11
    <e56a6>   DW_AT_decl_line   : 117
    <e56a7>   DW_AT_decl_column : 3
    <e56a8>   DW_AT_type        : <0xe5340>
 <1><e56ac>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e56ad>   DW_AT_byte_size   : 8
    <e56ad>   DW_AT_type        : <0xe56a0>
 <1><e56b1>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e56b2>   DW_AT_external    : 1
    <e56b2>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <e56b6>   DW_AT_decl_file   : 12
    <e56b7>   DW_AT_decl_line   : 61
    <e56b8>   DW_AT_decl_column : 14
    <e56b9>   DW_AT_prototyped  : 1
    <e56b9>   DW_AT_type        : <0xe4f73>
    <e56bd>   DW_AT_declaration : 1
    <e56bd>   DW_AT_sibling     : <0xe56d1>
 <2><e56c1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56c2>   DW_AT_type        : <0xe4f73>
 <2><e56c6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56c7>   DW_AT_type        : <0xe4f4d>
 <2><e56cb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56cc>   DW_AT_type        : <0xe4f97>
 <2><e56d0>: Abbrev Number: 0
 <1><e56d1>: Abbrev Number: 30 (DW_TAG_subprogram)
    <e56d2>   DW_AT_external    : 1
    <e56d2>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <e56d6>   DW_AT_decl_file   : 14
    <e56d7>   DW_AT_decl_line   : 565
    <e56d9>   DW_AT_decl_column : 13
    <e56da>   DW_AT_prototyped  : 1
    <e56da>   DW_AT_declaration : 1
    <e56da>   DW_AT_sibling     : <0xe56e4>
 <2><e56de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56df>   DW_AT_type        : <0xe4f73>
 <2><e56e3>: Abbrev Number: 0
 <1><e56e4>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e56e5>   DW_AT_external    : 1
    <e56e5>   DW_AT_name        : (indirect string, offset: 0x1c270): fb_wstr_ConvFromA
    <e56e9>   DW_AT_decl_file   : 13
    <e56ea>   DW_AT_decl_line   : 150
    <e56eb>   DW_AT_decl_column : 9
    <e56ec>   DW_AT_prototyped  : 1
    <e56ec>   DW_AT_type        : <0xe4fc8>
    <e56f0>   DW_AT_declaration : 1
    <e56f0>   DW_AT_sibling     : <0xe5704>
 <2><e56f4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56f5>   DW_AT_type        : <0xe52dd>
 <2><e56f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56fa>   DW_AT_type        : <0xe4fc8>
 <2><e56fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e56ff>   DW_AT_type        : <0xe4ff1>
 <2><e5703>: Abbrev Number: 0
 <1><e5704>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e5705>   DW_AT_external    : 1
    <e5705>   DW_AT_name        : (indirect string, offset: 0x16d3d): fread
    <e5709>   DW_AT_decl_file   : 7
    <e570a>   DW_AT_decl_line   : 651
    <e570c>   DW_AT_decl_column : 15
    <e570d>   DW_AT_prototyped  : 1
    <e570d>   DW_AT_type        : <0xe4f97>
    <e5711>   DW_AT_declaration : 1
    <e5711>   DW_AT_sibling     : <0xe572a>
 <2><e5715>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5716>   DW_AT_type        : <0xe4f75>
 <2><e571a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e571b>   DW_AT_type        : <0xe4f97>
 <2><e571f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5720>   DW_AT_type        : <0xe4f97>
 <2><e5724>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5725>   DW_AT_type        : <0xe51e8>
 <2><e5729>: Abbrev Number: 0
 <1><e572a>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e572b>   DW_AT_external    : 1
    <e572b>   DW_AT_name        : (indirect string, offset: 0xe63c): malloc
    <e572f>   DW_AT_decl_file   : 14
    <e5730>   DW_AT_decl_line   : 539
    <e5732>   DW_AT_decl_column : 14
    <e5733>   DW_AT_prototyped  : 1
    <e5733>   DW_AT_type        : <0xe4f73>
    <e5737>   DW_AT_declaration : 1
    <e5737>   DW_AT_sibling     : <0xe5741>
 <2><e573b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e573c>   DW_AT_type        : <0xe4f97>
 <2><e5740>: Abbrev Number: 0
 <1><e5741>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e5742>   DW_AT_external    : 1
    <e5742>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <e5746>   DW_AT_decl_file   : 10
    <e5747>   DW_AT_decl_line   : 50
    <e5748>   DW_AT_decl_column : 22
    <e5749>   DW_AT_prototyped  : 1
    <e5749>   DW_AT_type        : <0xe4f4d>
    <e574d>   DW_AT_declaration : 1
    <e574d>   DW_AT_sibling     : <0xe5757>
 <2><e5751>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5752>   DW_AT_type        : <0xe4f4d>
 <2><e5756>: Abbrev Number: 0
 <1><e5757>: Abbrev Number: 31 (DW_TAG_subprogram)
    <e5758>   DW_AT_external    : 1
    <e5758>   DW_AT_name        : (indirect string, offset: 0x1d504): fb_DevFileReadWstr
    <e575c>   DW_AT_decl_file   : 1
    <e575d>   DW_AT_decl_line   : 5
    <e575e>   DW_AT_decl_column : 5
    <e575f>   DW_AT_prototyped  : 1
    <e575f>   DW_AT_type        : <0xe4f4d>
    <e5763>   DW_AT_low_pc      : 0x4792f0
    <e576b>   DW_AT_high_pc     : 0x174
    <e5773>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5775>   DW_AT_call_all_calls: 1
    <e5775>   DW_AT_sibling     : <0xe58d3>
 <2><e5779>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <e577a>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <e577e>   DW_AT_decl_file   : 1
    <e577e>   DW_AT_decl_line   : 5
    <e577e>   DW_AT_decl_column : 34
    <e577f>   DW_AT_type        : <0xe56ac>
    <e5783>   DW_AT_location    : 0x4326d (location list)
    <e5787>   DW_AT_GNU_locviews: 0x43261
 <2><e578b>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <e578c>   DW_AT_name        : dst
    <e5790>   DW_AT_decl_file   : 1
    <e5791>   DW_AT_decl_line   : 5
    <e5792>   DW_AT_decl_column : 52
    <e5793>   DW_AT_type        : <0xe52dd>
    <e5797>   DW_AT_location    : 0x432b2 (location list)
    <e579b>   DW_AT_GNU_locviews: 0x4329e
 <2><e579f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <e57a0>   DW_AT_name        : (indirect string, offset: 0x1d617): pchars
    <e57a4>   DW_AT_decl_file   : 1
    <e57a4>   DW_AT_decl_line   : 5
    <e57a4>   DW_AT_decl_column : 65
    <e57a5>   DW_AT_type        : <0xe54ad>
    <e57a9>   DW_AT_location    : 0x4330f (location list)
    <e57ad>   DW_AT_GNU_locviews: 0x432fb
 <2><e57b1>: Abbrev Number: 33 (DW_TAG_variable)
    <e57b2>   DW_AT_name        : fp
    <e57b5>   DW_AT_decl_file   : 1
    <e57b6>   DW_AT_decl_line   : 7
    <e57b7>   DW_AT_decl_column : 11
    <e57b8>   DW_AT_type        : <0xe51e3>
    <e57bc>   DW_AT_location    : 0x43362 (location list)
    <e57c0>   DW_AT_GNU_locviews: 0x43358
 <2><e57c4>: Abbrev Number: 22 (DW_TAG_variable)
    <e57c5>   DW_AT_name        : (indirect string, offset: 0x1c247): chars
    <e57c9>   DW_AT_decl_file   : 1
    <e57c9>   DW_AT_decl_line   : 8
    <e57ca>   DW_AT_decl_column : 12
    <e57cb>   DW_AT_type        : <0xe4f97>
    <e57cf>   DW_AT_location    : 0x43393 (location list)
    <e57d3>   DW_AT_GNU_locviews: 0x43387
 <2><e57d7>: Abbrev Number: 22 (DW_TAG_variable)
    <e57d8>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <e57dc>   DW_AT_decl_file   : 1
    <e57dc>   DW_AT_decl_line   : 9
    <e57dd>   DW_AT_decl_column : 11
    <e57de>   DW_AT_type        : <0xe4f86>
    <e57e2>   DW_AT_location    : 0x433c7 (location list)
    <e57e6>   DW_AT_GNU_locviews: 0x433bd
 <2><e57ea>: Abbrev Number: 9 (DW_TAG_call_site)
    <e57eb>   DW_AT_call_return_pc: 0x479382
    <e57f3>   DW_AT_call_origin : <0xe5704>
    <e57f7>   DW_AT_sibling     : <0xe580d>
 <3><e57fb>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e57fc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e57fe>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><e5801>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5802>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5804>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><e5806>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5807>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e5809>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><e580c>: Abbrev Number: 0
 <2><e580d>: Abbrev Number: 9 (DW_TAG_call_site)
    <e580e>   DW_AT_call_return_pc: 0x479398
    <e5816>   DW_AT_call_origin : <0xe56e4>
    <e581a>   DW_AT_sibling     : <0xe5831>
 <3><e581e>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e581f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5821>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><e5824>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5825>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5827>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><e582a>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e582b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e582d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><e5830>: Abbrev Number: 0
 <2><e5831>: Abbrev Number: 9 (DW_TAG_call_site)
    <e5832>   DW_AT_call_return_pc: 0x4793b5
    <e583a>   DW_AT_call_origin : <0xe5741>
    <e583e>   DW_AT_sibling     : <0xe5848>
 <3><e5842>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5843>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5845>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5847>: Abbrev Number: 0
 <2><e5848>: Abbrev Number: 9 (DW_TAG_call_site)
    <e5849>   DW_AT_call_return_pc: 0x4793f6
    <e5851>   DW_AT_call_origin : <0xe58d3>
    <e5855>   DW_AT_sibling     : <0xe5872>
 <3><e5859>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e585a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e585c>   DW_AT_call_value  : 7 byte block: 73 0 32 24 7e 0 22 	(DW_OP_breg3 (rbx): 0; DW_OP_lit2; DW_OP_shl; DW_OP_breg14 (r14): 0; DW_OP_plus)
 <3><e5864>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5865>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5867>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5869>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e586a>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e586c>   DW_AT_call_value  : 4 byte block: 7f 0 32 24 	(DW_OP_breg15 (r15): 0; DW_OP_lit2; DW_OP_shl)
 <3><e5871>: Abbrev Number: 0
 <2><e5872>: Abbrev Number: 9 (DW_TAG_call_site)
    <e5873>   DW_AT_call_return_pc: 0x479418
    <e587b>   DW_AT_call_origin : <0xe56d1>
    <e587f>   DW_AT_sibling     : <0xe588a>
 <3><e5883>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e5884>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5886>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><e5889>: Abbrev Number: 0
 <2><e588a>: Abbrev Number: 23 (DW_TAG_call_site)
    <e588b>   DW_AT_call_return_pc: 0x479429
    <e5893>   DW_AT_call_origin : <0xe572a>
 <2><e5897>: Abbrev Number: 9 (DW_TAG_call_site)
    <e5898>   DW_AT_call_return_pc: 0x479443
    <e58a0>   DW_AT_call_origin : <0xe5741>
    <e58a4>   DW_AT_sibling     : <0xe58ae>
 <3><e58a8>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e58a9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e58ab>   DW_AT_call_value  : 1 byte block: 34 	(DW_OP_lit4)
 <3><e58ad>: Abbrev Number: 0
 <2><e58ae>: Abbrev Number: 9 (DW_TAG_call_site)
    <e58af>   DW_AT_call_return_pc: 0x47945a
    <e58b7>   DW_AT_call_origin : <0xe5741>
    <e58bb>   DW_AT_sibling     : <0xe58c5>
 <3><e58bf>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <e58c0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e58c2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><e58c4>: Abbrev Number: 0
 <2><e58c5>: Abbrev Number: 23 (DW_TAG_call_site)
    <e58c6>   DW_AT_call_return_pc: 0x479464
    <e58ce>   DW_AT_call_origin : <0xe58de>
 <2><e58d2>: Abbrev Number: 0
 <1><e58d3>: Abbrev Number: 34 (DW_TAG_subprogram)
    <e58d4>   DW_AT_external    : 1
    <e58d4>   DW_AT_declaration : 1
    <e58d4>   DW_AT_linkage_name: (indirect string, offset: 0x5beb): memset
    <e58d8>   DW_AT_name        : (indirect string, offset: 0x5be1): __builtin_memset
    <e58dc>   DW_AT_decl_file   : 15
    <e58dd>   DW_AT_decl_line   : 0
 <1><e58de>: Abbrev Number: 35 (DW_TAG_subprogram)
    <e58df>   DW_AT_external    : 1
    <e58df>   DW_AT_declaration : 1
    <e58df>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <e58e3>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><e58e7>: Abbrev Number: 0
  Compilation Unit @ offset 0xe58e8:
   Length:        0xb56 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x17c03
   Pointer Size:  8
 <0><e58f4>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <e58f5>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <e58f9>   DW_AT_language    : 29	(C11)
    <e58fa>   DW_AT_name        : (indirect line string, offset: 0x17bf): src/rtlib/dev_file_readline.c
    <e58fe>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <e5902>   DW_AT_low_pc      : 0x479470
    <e590a>   DW_AT_high_pc     : 0x21e
    <e5912>   DW_AT_stmt_list   : 0x6ed1e
 <1><e5916>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5917>   DW_AT_byte_size   : 1
    <e5918>   DW_AT_encoding    : 8	(unsigned char)
    <e5919>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><e591d>: Abbrev Number: 7 (DW_TAG_base_type)
    <e591e>   DW_AT_byte_size   : 2
    <e591f>   DW_AT_encoding    : 7	(unsigned)
    <e5920>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><e5924>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5925>   DW_AT_byte_size   : 4
    <e5926>   DW_AT_encoding    : 7	(unsigned)
    <e5927>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><e592b>: Abbrev Number: 7 (DW_TAG_base_type)
    <e592c>   DW_AT_byte_size   : 8
    <e592d>   DW_AT_encoding    : 7	(unsigned)
    <e592e>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><e5932>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5933>   DW_AT_byte_size   : 1
    <e5934>   DW_AT_encoding    : 6	(signed char)
    <e5935>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><e5939>: Abbrev Number: 7 (DW_TAG_base_type)
    <e593a>   DW_AT_byte_size   : 2
    <e593b>   DW_AT_encoding    : 5	(signed)
    <e593c>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><e5940>: Abbrev Number: 28 (DW_TAG_base_type)
    <e5941>   DW_AT_byte_size   : 4
    <e5942>   DW_AT_encoding    : 5	(signed)
    <e5943>   DW_AT_name        : int
 <1><e5947>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5948>   DW_AT_byte_size   : 8
    <e5949>   DW_AT_encoding    : 5	(signed)
    <e594a>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><e594e>: Abbrev Number: 4 (DW_TAG_typedef)
    <e594f>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <e5953>   DW_AT_decl_file   : 2
    <e5954>   DW_AT_decl_line   : 152
    <e5955>   DW_AT_decl_column : 25
    <e5956>   DW_AT_type        : <0xe5947>
 <1><e595a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e595b>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <e595f>   DW_AT_decl_file   : 2
    <e5960>   DW_AT_decl_line   : 153
    <e5961>   DW_AT_decl_column : 27
    <e5962>   DW_AT_type        : <0xe5947>
 <1><e5966>: Abbrev Number: 29 (DW_TAG_pointer_type)
    <e5967>   DW_AT_byte_size   : 8
 <1><e5968>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5969>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <e596d>   DW_AT_decl_file   : 2
    <e596e>   DW_AT_decl_line   : 194
    <e596f>   DW_AT_decl_column : 27
    <e5970>   DW_AT_type        : <0xe5947>
 <1><e5974>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5975>   DW_AT_byte_size   : 8
    <e5975>   DW_AT_type        : <0xe597e>
 <1><e5979>: Abbrev Number: 19 (DW_TAG_restrict_type)
    <e597a>   DW_AT_type        : <0xe5974>
 <1><e597e>: Abbrev Number: 7 (DW_TAG_base_type)
    <e597f>   DW_AT_byte_size   : 1
    <e5980>   DW_AT_encoding    : 6	(signed char)
    <e5981>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><e5985>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5986>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <e598a>   DW_AT_decl_file   : 3
    <e598b>   DW_AT_decl_line   : 209
    <e598c>   DW_AT_decl_column : 23
    <e598d>   DW_AT_type        : <0xe592b>
 <1><e5991>: Abbrev Number: 30 (DW_TAG_typedef)
    <e5992>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <e5996>   DW_AT_decl_file   : 3
    <e5997>   DW_AT_decl_line   : 321
    <e5999>   DW_AT_decl_column : 24
    <e599a>   DW_AT_type        : <0xe5940>
 <1><e599e>: Abbrev Number: 31 (DW_TAG_const_type)
    <e599f>   DW_AT_type        : <0xe5991>
 <1><e59a3>: Abbrev Number: 7 (DW_TAG_base_type)
    <e59a4>   DW_AT_byte_size   : 8
    <e59a5>   DW_AT_encoding    : 5	(signed)
    <e59a6>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><e59aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <e59ab>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <e59af>   DW_AT_decl_file   : 4
    <e59b0>   DW_AT_decl_line   : 87
    <e59b1>   DW_AT_decl_column : 19
    <e59b2>   DW_AT_type        : <0xe595a>
 <1><e59b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <e59b7>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <e59bb>   DW_AT_decl_file   : 4
    <e59bc>   DW_AT_decl_line   : 108
    <e59bd>   DW_AT_decl_column : 19
    <e59be>   DW_AT_type        : <0xe5968>
 <1><e59c2>: Abbrev Number: 7 (DW_TAG_base_type)
    <e59c3>   DW_AT_byte_size   : 8
    <e59c4>   DW_AT_encoding    : 7	(unsigned)
    <e59c5>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><e59c9>: Abbrev Number: 9 (DW_TAG_array_type)
    <e59ca>   DW_AT_type        : <0xe597e>
    <e59ce>   DW_AT_sibling     : <0xe59d9>
 <2><e59d2>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <e59d3>   DW_AT_type        : <0xe592b>
    <e59d7>   DW_AT_upper_bound : 3
 <2><e59d8>: Abbrev Number: 0
 <1><e59d9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e59da>   DW_AT_byte_size   : 8
    <e59da>   DW_AT_type        : <0xe59de>
 <1><e59de>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><e59df>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e59e0>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <e59e4>   DW_AT_byte_size   : 216
    <e59e5>   DW_AT_decl_file   : 5
    <e59e6>   DW_AT_decl_line   : 49
    <e59e7>   DW_AT_decl_column : 8
    <e59e8>   DW_AT_sibling     : <0xe5b66>
 <2><e59ec>: Abbrev Number: 1 (DW_TAG_member)
    <e59ed>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <e59f1>   DW_AT_decl_file   : 5
    <e59f2>   DW_AT_decl_line   : 51
    <e59f3>   DW_AT_decl_column : 7
    <e59f4>   DW_AT_type        : <0xe5940>
    <e59f8>   DW_AT_data_member_location: 0
 <2><e59f9>: Abbrev Number: 1 (DW_TAG_member)
    <e59fa>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <e59fe>   DW_AT_decl_file   : 5
    <e59ff>   DW_AT_decl_line   : 54
    <e5a00>   DW_AT_decl_column : 9
    <e5a01>   DW_AT_type        : <0xe5974>
    <e5a05>   DW_AT_data_member_location: 8
 <2><e5a06>: Abbrev Number: 1 (DW_TAG_member)
    <e5a07>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <e5a0b>   DW_AT_decl_file   : 5
    <e5a0c>   DW_AT_decl_line   : 55
    <e5a0d>   DW_AT_decl_column : 9
    <e5a0e>   DW_AT_type        : <0xe5974>
    <e5a12>   DW_AT_data_member_location: 16
 <2><e5a13>: Abbrev Number: 1 (DW_TAG_member)
    <e5a14>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <e5a18>   DW_AT_decl_file   : 5
    <e5a19>   DW_AT_decl_line   : 56
    <e5a1a>   DW_AT_decl_column : 9
    <e5a1b>   DW_AT_type        : <0xe5974>
    <e5a1f>   DW_AT_data_member_location: 24
 <2><e5a20>: Abbrev Number: 1 (DW_TAG_member)
    <e5a21>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <e5a25>   DW_AT_decl_file   : 5
    <e5a26>   DW_AT_decl_line   : 57
    <e5a27>   DW_AT_decl_column : 9
    <e5a28>   DW_AT_type        : <0xe5974>
    <e5a2c>   DW_AT_data_member_location: 32
 <2><e5a2d>: Abbrev Number: 1 (DW_TAG_member)
    <e5a2e>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <e5a32>   DW_AT_decl_file   : 5
    <e5a33>   DW_AT_decl_line   : 58
    <e5a34>   DW_AT_decl_column : 9
    <e5a35>   DW_AT_type        : <0xe5974>
    <e5a39>   DW_AT_data_member_location: 40
 <2><e5a3a>: Abbrev Number: 1 (DW_TAG_member)
    <e5a3b>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <e5a3f>   DW_AT_decl_file   : 5
    <e5a40>   DW_AT_decl_line   : 59
    <e5a41>   DW_AT_decl_column : 9
    <e5a42>   DW_AT_type        : <0xe5974>
    <e5a46>   DW_AT_data_member_location: 48
 <2><e5a47>: Abbrev Number: 1 (DW_TAG_member)
    <e5a48>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <e5a4c>   DW_AT_decl_file   : 5
    <e5a4d>   DW_AT_decl_line   : 60
    <e5a4e>   DW_AT_decl_column : 9
    <e5a4f>   DW_AT_type        : <0xe5974>
    <e5a53>   DW_AT_data_member_location: 56
 <2><e5a54>: Abbrev Number: 1 (DW_TAG_member)
    <e5a55>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <e5a59>   DW_AT_decl_file   : 5
    <e5a5a>   DW_AT_decl_line   : 61
    <e5a5b>   DW_AT_decl_column : 9
    <e5a5c>   DW_AT_type        : <0xe5974>
    <e5a60>   DW_AT_data_member_location: 64
 <2><e5a61>: Abbrev Number: 1 (DW_TAG_member)
    <e5a62>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <e5a66>   DW_AT_decl_file   : 5
    <e5a67>   DW_AT_decl_line   : 64
    <e5a68>   DW_AT_decl_column : 9
    <e5a69>   DW_AT_type        : <0xe5974>
    <e5a6d>   DW_AT_data_member_location: 72
 <2><e5a6e>: Abbrev Number: 1 (DW_TAG_member)
    <e5a6f>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <e5a73>   DW_AT_decl_file   : 5
    <e5a74>   DW_AT_decl_line   : 65
    <e5a75>   DW_AT_decl_column : 9
    <e5a76>   DW_AT_type        : <0xe5974>
    <e5a7a>   DW_AT_data_member_location: 80
 <2><e5a7b>: Abbrev Number: 1 (DW_TAG_member)
    <e5a7c>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <e5a80>   DW_AT_decl_file   : 5
    <e5a81>   DW_AT_decl_line   : 66
    <e5a82>   DW_AT_decl_column : 9
    <e5a83>   DW_AT_type        : <0xe5974>
    <e5a87>   DW_AT_data_member_location: 88
 <2><e5a88>: Abbrev Number: 1 (DW_TAG_member)
    <e5a89>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <e5a8d>   DW_AT_decl_file   : 5
    <e5a8e>   DW_AT_decl_line   : 68
    <e5a8f>   DW_AT_decl_column : 22
    <e5a90>   DW_AT_type        : <0xe5b7f>
    <e5a94>   DW_AT_data_member_location: 96
 <2><e5a95>: Abbrev Number: 1 (DW_TAG_member)
    <e5a96>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <e5a9a>   DW_AT_decl_file   : 5
    <e5a9b>   DW_AT_decl_line   : 70
    <e5a9c>   DW_AT_decl_column : 20
    <e5a9d>   DW_AT_type        : <0xe5b84>
    <e5aa1>   DW_AT_data_member_location: 104
 <2><e5aa2>: Abbrev Number: 1 (DW_TAG_member)
    <e5aa3>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <e5aa7>   DW_AT_decl_file   : 5
    <e5aa8>   DW_AT_decl_line   : 72
    <e5aa9>   DW_AT_decl_column : 7
    <e5aaa>   DW_AT_type        : <0xe5940>
    <e5aae>   DW_AT_data_member_location: 112
 <2><e5aaf>: Abbrev Number: 1 (DW_TAG_member)
    <e5ab0>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <e5ab4>   DW_AT_decl_file   : 5
    <e5ab5>   DW_AT_decl_line   : 73
    <e5ab6>   DW_AT_decl_column : 7
    <e5ab7>   DW_AT_type        : <0xe5940>
    <e5abb>   DW_AT_data_member_location: 116
 <2><e5abc>: Abbrev Number: 1 (DW_TAG_member)
    <e5abd>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <e5ac1>   DW_AT_decl_file   : 5
    <e5ac2>   DW_AT_decl_line   : 74
    <e5ac3>   DW_AT_decl_column : 11
    <e5ac4>   DW_AT_type        : <0xe594e>
    <e5ac8>   DW_AT_data_member_location: 120
 <2><e5ac9>: Abbrev Number: 1 (DW_TAG_member)
    <e5aca>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <e5ace>   DW_AT_decl_file   : 5
    <e5acf>   DW_AT_decl_line   : 77
    <e5ad0>   DW_AT_decl_column : 18
    <e5ad1>   DW_AT_type        : <0xe591d>
    <e5ad5>   DW_AT_data_member_location: 128
 <2><e5ad6>: Abbrev Number: 1 (DW_TAG_member)
    <e5ad7>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <e5adb>   DW_AT_decl_file   : 5
    <e5adc>   DW_AT_decl_line   : 78
    <e5add>   DW_AT_decl_column : 15
    <e5ade>   DW_AT_type        : <0xe5932>
    <e5ae2>   DW_AT_data_member_location: 130
 <2><e5ae3>: Abbrev Number: 1 (DW_TAG_member)
    <e5ae4>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <e5ae8>   DW_AT_decl_file   : 5
    <e5ae9>   DW_AT_decl_line   : 79
    <e5aea>   DW_AT_decl_column : 8
    <e5aeb>   DW_AT_type        : <0xe5b89>
    <e5aef>   DW_AT_data_member_location: 131
 <2><e5af0>: Abbrev Number: 1 (DW_TAG_member)
    <e5af1>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <e5af5>   DW_AT_decl_file   : 5
    <e5af6>   DW_AT_decl_line   : 81
    <e5af7>   DW_AT_decl_column : 15
    <e5af8>   DW_AT_type        : <0xe5b99>
    <e5afc>   DW_AT_data_member_location: 136
 <2><e5afd>: Abbrev Number: 1 (DW_TAG_member)
    <e5afe>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <e5b02>   DW_AT_decl_file   : 5
    <e5b03>   DW_AT_decl_line   : 89
    <e5b04>   DW_AT_decl_column : 13
    <e5b05>   DW_AT_type        : <0xe595a>
    <e5b09>   DW_AT_data_member_location: 144
 <2><e5b0a>: Abbrev Number: 1 (DW_TAG_member)
    <e5b0b>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <e5b0f>   DW_AT_decl_file   : 5
    <e5b10>   DW_AT_decl_line   : 91
    <e5b11>   DW_AT_decl_column : 23
    <e5b12>   DW_AT_type        : <0xe5ba3>
    <e5b16>   DW_AT_data_member_location: 152
 <2><e5b17>: Abbrev Number: 1 (DW_TAG_member)
    <e5b18>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <e5b1c>   DW_AT_decl_file   : 5
    <e5b1d>   DW_AT_decl_line   : 92
    <e5b1e>   DW_AT_decl_column : 25
    <e5b1f>   DW_AT_type        : <0xe5bad>
    <e5b23>   DW_AT_data_member_location: 160
 <2><e5b24>: Abbrev Number: 1 (DW_TAG_member)
    <e5b25>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <e5b29>   DW_AT_decl_file   : 5
    <e5b2a>   DW_AT_decl_line   : 93
    <e5b2b>   DW_AT_decl_column : 20
    <e5b2c>   DW_AT_type        : <0xe5b84>
    <e5b30>   DW_AT_data_member_location: 168
 <2><e5b31>: Abbrev Number: 1 (DW_TAG_member)
    <e5b32>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <e5b36>   DW_AT_decl_file   : 5
    <e5b37>   DW_AT_decl_line   : 94
    <e5b38>   DW_AT_decl_column : 9
    <e5b39>   DW_AT_type        : <0xe5966>
    <e5b3d>   DW_AT_data_member_location: 176
 <2><e5b3e>: Abbrev Number: 1 (DW_TAG_member)
    <e5b3f>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <e5b43>   DW_AT_decl_file   : 5
    <e5b44>   DW_AT_decl_line   : 95
    <e5b45>   DW_AT_decl_column : 10
    <e5b46>   DW_AT_type        : <0xe5985>
    <e5b4a>   DW_AT_data_member_location: 184
 <2><e5b4b>: Abbrev Number: 1 (DW_TAG_member)
    <e5b4c>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <e5b50>   DW_AT_decl_file   : 5
    <e5b51>   DW_AT_decl_line   : 96
    <e5b52>   DW_AT_decl_column : 7
    <e5b53>   DW_AT_type        : <0xe5940>
    <e5b57>   DW_AT_data_member_location: 192
 <2><e5b58>: Abbrev Number: 1 (DW_TAG_member)
    <e5b59>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <e5b5d>   DW_AT_decl_file   : 5
    <e5b5e>   DW_AT_decl_line   : 98
    <e5b5f>   DW_AT_decl_column : 8
    <e5b60>   DW_AT_type        : <0xe5bb2>
    <e5b64>   DW_AT_data_member_location: 196
 <2><e5b65>: Abbrev Number: 0
 <1><e5b66>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5b67>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <e5b6b>   DW_AT_decl_file   : 6
    <e5b6c>   DW_AT_decl_line   : 7
    <e5b6d>   DW_AT_decl_column : 25
    <e5b6e>   DW_AT_type        : <0xe59df>
 <1><e5b72>: Abbrev Number: 33 (DW_TAG_typedef)
    <e5b73>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <e5b77>   DW_AT_decl_file   : 5
    <e5b78>   DW_AT_decl_line   : 43
    <e5b79>   DW_AT_decl_column : 14
 <1><e5b7a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e5b7b>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <e5b7f>   DW_AT_declaration : 1
 <1><e5b7f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5b80>   DW_AT_byte_size   : 8
    <e5b80>   DW_AT_type        : <0xe5b7a>
 <1><e5b84>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5b85>   DW_AT_byte_size   : 8
    <e5b85>   DW_AT_type        : <0xe59df>
 <1><e5b89>: Abbrev Number: 9 (DW_TAG_array_type)
    <e5b8a>   DW_AT_type        : <0xe597e>
    <e5b8e>   DW_AT_sibling     : <0xe5b99>
 <2><e5b92>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <e5b93>   DW_AT_type        : <0xe592b>
    <e5b97>   DW_AT_upper_bound : 0
 <2><e5b98>: Abbrev Number: 0
 <1><e5b99>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5b9a>   DW_AT_byte_size   : 8
    <e5b9a>   DW_AT_type        : <0xe5b72>
 <1><e5b9e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e5b9f>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <e5ba3>   DW_AT_declaration : 1
 <1><e5ba3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5ba4>   DW_AT_byte_size   : 8
    <e5ba4>   DW_AT_type        : <0xe5b9e>
 <1><e5ba8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e5ba9>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <e5bad>   DW_AT_declaration : 1
 <1><e5bad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5bae>   DW_AT_byte_size   : 8
    <e5bae>   DW_AT_type        : <0xe5ba8>
 <1><e5bb2>: Abbrev Number: 9 (DW_TAG_array_type)
    <e5bb3>   DW_AT_type        : <0xe597e>
    <e5bb7>   DW_AT_sibling     : <0xe5bc2>
 <2><e5bbb>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <e5bbc>   DW_AT_type        : <0xe592b>
    <e5bc0>   DW_AT_upper_bound : 19
 <2><e5bc1>: Abbrev Number: 0
 <1><e5bc2>: Abbrev Number: 17 (DW_TAG_variable)
    <e5bc3>   DW_AT_name        : (indirect string, offset: 0x1b976): stdin
    <e5bc7>   DW_AT_decl_file   : 7
    <e5bc7>   DW_AT_decl_line   : 137
    <e5bc8>   DW_AT_decl_column : 14
    <e5bc8>   DW_AT_type        : <0xe5bcc>
    <e5bcc>   DW_AT_external    : 1
    <e5bcc>   DW_AT_declaration : 1
 <1><e5bcc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5bcd>   DW_AT_byte_size   : 8
    <e5bcd>   DW_AT_type        : <0xe5b66>
 <1><e5bd1>: Abbrev Number: 19 (DW_TAG_restrict_type)
    <e5bd2>   DW_AT_type        : <0xe5bcc>
 <1><e5bd6>: Abbrev Number: 17 (DW_TAG_variable)
    <e5bd7>   DW_AT_name        : (indirect string, offset: 0x1b9ba): stdout
    <e5bdb>   DW_AT_decl_file   : 7
    <e5bdb>   DW_AT_decl_line   : 138
    <e5bdc>   DW_AT_decl_column : 14
    <e5bdc>   DW_AT_type        : <0xe5bcc>
    <e5be0>   DW_AT_external    : 1
    <e5be0>   DW_AT_declaration : 1
 <1><e5be0>: Abbrev Number: 17 (DW_TAG_variable)
    <e5be1>   DW_AT_name        : (indirect string, offset: 0x1b784): stderr
    <e5be5>   DW_AT_decl_file   : 7
    <e5be5>   DW_AT_decl_line   : 139
    <e5be6>   DW_AT_decl_column : 14
    <e5be6>   DW_AT_type        : <0xe5bcc>
    <e5bea>   DW_AT_external    : 1
    <e5bea>   DW_AT_declaration : 1
 <1><e5bea>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5beb>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <e5bef>   DW_AT_decl_file   : 8
    <e5bf0>   DW_AT_decl_line   : 22
    <e5bf1>   DW_AT_decl_column : 15
    <e5bf2>   DW_AT_type        : <0xe59aa>
 <1><e5bf6>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <e5bf7>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <e5bfb>   DW_AT_encoding    : 7	(void)
    <e5bfb>   DW_AT_byte_size   : 4
    <e5bfb>   DW_AT_type        : <0xe5924>
    <e5bff>   DW_AT_decl_file   : 10
    <e5c00>   DW_AT_decl_line   : 1
    <e5c01>   DW_AT_decl_column : 14
    <e5c01>   DW_AT_sibling     : <0xe5c78>
 <2><e5c05>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c06>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <e5c0a>   DW_AT_const_value : 0
 <2><e5c0b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c0c>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <e5c10>   DW_AT_const_value : 1
 <2><e5c11>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c12>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <e5c16>   DW_AT_const_value : 2
 <2><e5c17>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c18>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <e5c1c>   DW_AT_const_value : 3
 <2><e5c1d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c1e>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <e5c22>   DW_AT_const_value : 4
 <2><e5c23>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c24>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <e5c28>   DW_AT_const_value : 5
 <2><e5c29>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c2a>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <e5c2e>   DW_AT_const_value : 6
 <2><e5c2f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c30>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <e5c34>   DW_AT_const_value : 7
 <2><e5c35>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c36>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <e5c3a>   DW_AT_const_value : 8
 <2><e5c3b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c3c>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <e5c40>   DW_AT_const_value : 9
 <2><e5c41>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c42>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <e5c46>   DW_AT_const_value : 10
 <2><e5c47>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c48>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <e5c4c>   DW_AT_const_value : 11
 <2><e5c4d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c4e>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <e5c52>   DW_AT_const_value : 12
 <2><e5c53>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c54>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <e5c58>   DW_AT_const_value : 13
 <2><e5c59>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c5a>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <e5c5e>   DW_AT_const_value : 14
 <2><e5c5f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c60>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <e5c64>   DW_AT_const_value : 15
 <2><e5c65>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c66>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <e5c6a>   DW_AT_const_value : 16
 <2><e5c6b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c6c>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <e5c70>   DW_AT_const_value : 17
 <2><e5c71>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5c72>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <e5c76>   DW_AT_const_value : 18
 <2><e5c77>: Abbrev Number: 0
 <1><e5c78>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e5c79>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <e5c7d>   DW_AT_byte_size   : 24
    <e5c7e>   DW_AT_decl_file   : 9
    <e5c7f>   DW_AT_decl_line   : 82
    <e5c80>   DW_AT_decl_column : 16
    <e5c81>   DW_AT_sibling     : <0xe5cac>
 <2><e5c85>: Abbrev Number: 1 (DW_TAG_member)
    <e5c86>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <e5c8a>   DW_AT_decl_file   : 9
    <e5c8b>   DW_AT_decl_line   : 83
    <e5c8c>   DW_AT_decl_column : 21
    <e5c8d>   DW_AT_type        : <0xe5974>
    <e5c91>   DW_AT_data_member_location: 0
 <2><e5c92>: Abbrev Number: 21 (DW_TAG_member)
    <e5c93>   DW_AT_name        : len
    <e5c97>   DW_AT_decl_file   : 9
    <e5c98>   DW_AT_decl_line   : 84
    <e5c99>   DW_AT_decl_column : 21
    <e5c99>   DW_AT_type        : <0xe59b6>
    <e5c9d>   DW_AT_data_member_location: 8
 <2><e5c9e>: Abbrev Number: 1 (DW_TAG_member)
    <e5c9f>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e5ca3>   DW_AT_decl_file   : 9
    <e5ca4>   DW_AT_decl_line   : 85
    <e5ca5>   DW_AT_decl_column : 21
    <e5ca6>   DW_AT_type        : <0xe59b6>
    <e5caa>   DW_AT_data_member_location: 16
 <2><e5cab>: Abbrev Number: 0
 <1><e5cac>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5cad>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <e5cb1>   DW_AT_decl_file   : 9
    <e5cb2>   DW_AT_decl_line   : 86
    <e5cb3>   DW_AT_decl_column : 3
    <e5cb4>   DW_AT_type        : <0xe5c78>
 <1><e5cb8>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5cb9>   DW_AT_byte_size   : 8
    <e5cba>   DW_AT_encoding    : 4	(float)
    <e5cbb>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><e5cbf>: Abbrev Number: 7 (DW_TAG_base_type)
    <e5cc0>   DW_AT_byte_size   : 4
    <e5cc1>   DW_AT_encoding    : 4	(float)
    <e5cc2>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><e5cc6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5cc7>   DW_AT_byte_size   : 8
    <e5cc7>   DW_AT_type        : <0xe5991>
 <1><e5ccb>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <e5ccc>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <e5cd0>   DW_AT_encoding    : 7	(void)
    <e5cd0>   DW_AT_byte_size   : 4
    <e5cd0>   DW_AT_type        : <0xe5924>
    <e5cd4>   DW_AT_decl_file   : 11
    <e5cd5>   DW_AT_decl_line   : 25
    <e5cd6>   DW_AT_decl_column : 14
    <e5cd6>   DW_AT_sibling     : <0xe5cf3>
 <2><e5cda>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5cdb>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <e5cdf>   DW_AT_const_value : 0
 <2><e5ce0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5ce1>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <e5ce5>   DW_AT_const_value : 1
 <2><e5ce6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5ce7>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <e5ceb>   DW_AT_const_value : 2
 <2><e5cec>: Abbrev Number: 5 (DW_TAG_enumerator)
    <e5ced>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <e5cf1>   DW_AT_const_value : 3
 <2><e5cf2>: Abbrev Number: 0
 <1><e5cf3>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5cf4>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <e5cf8>   DW_AT_decl_file   : 11
    <e5cf9>   DW_AT_decl_line   : 30
    <e5cfa>   DW_AT_decl_column : 3
    <e5cfb>   DW_AT_type        : <0xe5ccb>
 <1><e5cff>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5d00>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <e5d04>   DW_AT_decl_file   : 11
    <e5d05>   DW_AT_decl_line   : 54
    <e5d06>   DW_AT_decl_column : 15
    <e5d07>   DW_AT_type        : <0xe5d0b>
 <1><e5d0b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5d0c>   DW_AT_byte_size   : 8
    <e5d0c>   DW_AT_type        : <0xe5d10>
 <1><e5d10>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5d11>   DW_AT_prototyped  : 1
    <e5d11>   DW_AT_type        : <0xe5940>
    <e5d15>   DW_AT_sibling     : <0xe5d24>
 <2><e5d19>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5d1a>   DW_AT_type        : <0xe5d24>
 <2><e5d1e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5d1f>   DW_AT_type        : <0xe5940>
 <2><e5d23>: Abbrev Number: 0
 <1><e5d24>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5d25>   DW_AT_byte_size   : 8
    <e5d25>   DW_AT_type        : <0xe5d29>
 <1><e5d29>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e5d2a>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <e5d2e>   DW_AT_byte_size   : 80
    <e5d2f>   DW_AT_decl_file   : 11
    <e5d30>   DW_AT_decl_line   : 97
    <e5d31>   DW_AT_decl_column : 16
    <e5d32>   DW_AT_sibling     : <0xe5dec>
 <2><e5d36>: Abbrev Number: 1 (DW_TAG_member)
    <e5d37>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <e5d3b>   DW_AT_decl_file   : 11
    <e5d3c>   DW_AT_decl_line   : 98
    <e5d3d>   DW_AT_decl_column : 21
    <e5d3e>   DW_AT_type        : <0xe5940>
    <e5d42>   DW_AT_data_member_location: 0
 <2><e5d43>: Abbrev Number: 21 (DW_TAG_member)
    <e5d44>   DW_AT_name        : len
    <e5d48>   DW_AT_decl_file   : 11
    <e5d49>   DW_AT_decl_line   : 99
    <e5d4a>   DW_AT_decl_column : 21
    <e5d4a>   DW_AT_type        : <0xe5940>
    <e5d4e>   DW_AT_data_member_location: 4
 <2><e5d4f>: Abbrev Number: 1 (DW_TAG_member)
    <e5d50>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <e5d54>   DW_AT_decl_file   : 11
    <e5d55>   DW_AT_decl_line   : 100
    <e5d56>   DW_AT_decl_column : 21
    <e5d57>   DW_AT_type        : <0xe5cf3>
    <e5d5b>   DW_AT_data_member_location: 8
 <2><e5d5c>: Abbrev Number: 1 (DW_TAG_member)
    <e5d5d>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <e5d61>   DW_AT_decl_file   : 11
    <e5d62>   DW_AT_decl_line   : 101
    <e5d63>   DW_AT_decl_column : 21
    <e5d64>   DW_AT_type        : <0xe5bea>
    <e5d68>   DW_AT_data_member_location: 16
 <2><e5d69>: Abbrev Number: 1 (DW_TAG_member)
    <e5d6a>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <e5d6e>   DW_AT_decl_file   : 11
    <e5d6f>   DW_AT_decl_line   : 102
    <e5d70>   DW_AT_decl_column : 21
    <e5d71>   DW_AT_type        : <0xe5940>
    <e5d75>   DW_AT_data_member_location: 24
 <2><e5d76>: Abbrev Number: 1 (DW_TAG_member)
    <e5d77>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <e5d7b>   DW_AT_decl_file   : 11
    <e5d7c>   DW_AT_decl_line   : 103
    <e5d7d>   DW_AT_decl_column : 21
    <e5d7e>   DW_AT_type        : <0xe5940>
    <e5d82>   DW_AT_data_member_location: 28
 <2><e5d83>: Abbrev Number: 1 (DW_TAG_member)
    <e5d84>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <e5d88>   DW_AT_decl_file   : 11
    <e5d89>   DW_AT_decl_line   : 104
    <e5d8a>   DW_AT_decl_column : 21
    <e5d8b>   DW_AT_type        : <0xe5940>
    <e5d8f>   DW_AT_data_member_location: 32
 <2><e5d90>: Abbrev Number: 1 (DW_TAG_member)
    <e5d91>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <e5d95>   DW_AT_decl_file   : 11
    <e5d96>   DW_AT_decl_line   : 105
    <e5d97>   DW_AT_decl_column : 21
    <e5d98>   DW_AT_type        : <0xe5924>
    <e5d9c>   DW_AT_data_member_location: 36
 <2><e5d9d>: Abbrev Number: 1 (DW_TAG_member)
    <e5d9e>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <e5da2>   DW_AT_decl_file   : 11
    <e5da3>   DW_AT_decl_line   : 106
    <e5da4>   DW_AT_decl_column : 21
    <e5da5>   DW_AT_type        : <0xe5924>
    <e5da9>   DW_AT_data_member_location: 40
 <2><e5daa>: Abbrev Number: 1 (DW_TAG_member)
    <e5dab>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <e5daf>   DW_AT_decl_file   : 11
    <e5db0>   DW_AT_decl_line   : 109
    <e5db1>   DW_AT_decl_column : 21
    <e5db2>   DW_AT_type        : <0xe59c9>
    <e5db6>   DW_AT_data_member_location: 44
 <2><e5db7>: Abbrev Number: 1 (DW_TAG_member)
    <e5db8>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <e5dbc>   DW_AT_decl_file   : 11
    <e5dbd>   DW_AT_decl_line   : 110
    <e5dbe>   DW_AT_decl_column : 21
    <e5dbf>   DW_AT_type        : <0xe5985>
    <e5dc3>   DW_AT_data_member_location: 48
 <2><e5dc4>: Abbrev Number: 1 (DW_TAG_member)
    <e5dc5>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <e5dc9>   DW_AT_decl_file   : 11
    <e5dca>   DW_AT_decl_line   : 112
    <e5dcb>   DW_AT_decl_column : 22
    <e5dcc>   DW_AT_type        : <0xe6084>
    <e5dd0>   DW_AT_data_member_location: 56
 <2><e5dd1>: Abbrev Number: 1 (DW_TAG_member)
    <e5dd2>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <e5dd6>   DW_AT_decl_file   : 11
    <e5dd7>   DW_AT_decl_line   : 114
    <e5dd8>   DW_AT_decl_column : 14
    <e5dd9>   DW_AT_type        : <0xe5966>
    <e5ddd>   DW_AT_data_member_location: 64
 <2><e5dde>: Abbrev Number: 1 (DW_TAG_member)
    <e5ddf>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <e5de3>   DW_AT_decl_file   : 11
    <e5de4>   DW_AT_decl_line   : 116
    <e5de5>   DW_AT_decl_column : 22
    <e5de6>   DW_AT_type        : <0xe5d24>
    <e5dea>   DW_AT_data_member_location: 72
 <2><e5deb>: Abbrev Number: 0
 <1><e5dec>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5ded>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <e5df1>   DW_AT_decl_file   : 11
    <e5df2>   DW_AT_decl_line   : 59
    <e5df3>   DW_AT_decl_column : 15
    <e5df4>   DW_AT_type        : <0xe5df8>
 <1><e5df8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5df9>   DW_AT_byte_size   : 8
    <e5df9>   DW_AT_type        : <0xe5dfd>
 <1><e5dfd>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5dfe>   DW_AT_prototyped  : 1
    <e5dfe>   DW_AT_type        : <0xe5940>
    <e5e02>   DW_AT_sibling     : <0xe5e0c>
 <2><e5e06>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e07>   DW_AT_type        : <0xe5d24>
 <2><e5e0b>: Abbrev Number: 0
 <1><e5e0c>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5e0d>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <e5e11>   DW_AT_decl_file   : 11
    <e5e12>   DW_AT_decl_line   : 60
    <e5e13>   DW_AT_decl_column : 15
    <e5e14>   DW_AT_type        : <0xe5df8>
 <1><e5e18>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5e19>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <e5e1d>   DW_AT_decl_file   : 11
    <e5e1e>   DW_AT_decl_line   : 61
    <e5e1f>   DW_AT_decl_column : 15
    <e5e20>   DW_AT_type        : <0xe5e24>
 <1><e5e24>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5e25>   DW_AT_byte_size   : 8
    <e5e25>   DW_AT_type        : <0xe5e29>
 <1><e5e29>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5e2a>   DW_AT_prototyped  : 1
    <e5e2a>   DW_AT_type        : <0xe5940>
    <e5e2e>   DW_AT_sibling     : <0xe5e42>
 <2><e5e32>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e33>   DW_AT_type        : <0xe5d24>
 <2><e5e37>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e38>   DW_AT_type        : <0xe5bea>
 <2><e5e3c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e3d>   DW_AT_type        : <0xe5940>
 <2><e5e41>: Abbrev Number: 0
 <1><e5e42>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5e43>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <e5e47>   DW_AT_decl_file   : 11
    <e5e48>   DW_AT_decl_line   : 62
    <e5e49>   DW_AT_decl_column : 15
    <e5e4a>   DW_AT_type        : <0xe5e4e>
 <1><e5e4e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5e4f>   DW_AT_byte_size   : 8
    <e5e4f>   DW_AT_type        : <0xe5e53>
 <1><e5e53>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5e54>   DW_AT_prototyped  : 1
    <e5e54>   DW_AT_type        : <0xe5940>
    <e5e58>   DW_AT_sibling     : <0xe5e67>
 <2><e5e5c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e5d>   DW_AT_type        : <0xe5d24>
 <2><e5e61>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e62>   DW_AT_type        : <0xe5e67>
 <2><e5e66>: Abbrev Number: 0
 <1><e5e67>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5e68>   DW_AT_byte_size   : 8
    <e5e68>   DW_AT_type        : <0xe5bea>
 <1><e5e6c>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5e6d>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <e5e71>   DW_AT_decl_file   : 11
    <e5e72>   DW_AT_decl_line   : 63
    <e5e73>   DW_AT_decl_column : 15
    <e5e74>   DW_AT_type        : <0xe5e78>
 <1><e5e78>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5e79>   DW_AT_byte_size   : 8
    <e5e79>   DW_AT_type        : <0xe5e7d>
 <1><e5e7d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5e7e>   DW_AT_prototyped  : 1
    <e5e7e>   DW_AT_type        : <0xe5940>
    <e5e82>   DW_AT_sibling     : <0xe5e96>
 <2><e5e86>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e87>   DW_AT_type        : <0xe5d24>
 <2><e5e8b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e8c>   DW_AT_type        : <0xe5966>
 <2><e5e90>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5e91>   DW_AT_type        : <0xe5e96>
 <2><e5e95>: Abbrev Number: 0
 <1><e5e96>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5e97>   DW_AT_byte_size   : 8
    <e5e97>   DW_AT_type        : <0xe5985>
 <1><e5e9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5e9c>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <e5ea0>   DW_AT_decl_file   : 11
    <e5ea1>   DW_AT_decl_line   : 65
    <e5ea2>   DW_AT_decl_column : 15
    <e5ea3>   DW_AT_type        : <0xe5ea7>
 <1><e5ea7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5ea8>   DW_AT_byte_size   : 8
    <e5ea8>   DW_AT_type        : <0xe5eac>
 <1><e5eac>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5ead>   DW_AT_prototyped  : 1
    <e5ead>   DW_AT_type        : <0xe5940>
    <e5eb1>   DW_AT_sibling     : <0xe5ec5>
 <2><e5eb5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5eb6>   DW_AT_type        : <0xe5d24>
 <2><e5eba>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5ebb>   DW_AT_type        : <0xe5cc6>
 <2><e5ebf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e5ec0>   DW_AT_type        : <0xe5e96>
 <2><e5ec4>: Abbrev Number: 0
 <1><e5ec5>: Abbrev Number: 4 (DW_TAG_typedef)
    <e5ec6>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <e5eca>   DW_AT_decl_file   : 11
    <e5ecb>   DW_AT_decl_line   : 67
    <e5ecc>   DW_AT_decl_column : 15
    <e5ecd>   DW_AT_type        : <0xe5ed1>
 <1><e5ed1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5ed2>   DW_AT_byte_size   : 8
    <e5ed2>   DW_AT_type        : <0xe5ed6>
 <1><e5ed6>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5ed7>   DW_AT_prototyped  : 1
    <e5ed7>   DW_AT_type        : <0xe5940>
