    <bda8d>   DW_AT_type        : <0xbda4b>
 <1><bda91>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bda92>   DW_AT_byte_size   : 8
    <bda92>   DW_AT_type        : <0xbda96>
 <1><bda96>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <bda97>   DW_AT_prototyped  : 1
 <1><bda97>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bda98>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <bda9c>   DW_AT_byte_size   : 24
    <bda9d>   DW_AT_decl_file   : 6
    <bda9e>   DW_AT_decl_line   : 82
    <bda9f>   DW_AT_decl_column : 16
    <bdaa0>   DW_AT_sibling     : <0xbdacc>
 <2><bdaa4>: Abbrev Number: 2 (DW_TAG_member)
    <bdaa5>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <bdaa9>   DW_AT_decl_file   : 6
    <bdaaa>   DW_AT_decl_line   : 83
    <bdaab>   DW_AT_decl_column : 21
    <bdaac>   DW_AT_type        : <0xbda1a>
    <bdab0>   DW_AT_data_member_location: 0
 <2><bdab1>: Abbrev Number: 7 (DW_TAG_member)
    <bdab2>   DW_AT_name        : len
    <bdab6>   DW_AT_decl_file   : 6
    <bdab7>   DW_AT_decl_line   : 84
    <bdab8>   DW_AT_decl_column : 21
    <bdab9>   DW_AT_type        : <0xbda57>
    <bdabd>   DW_AT_data_member_location: 8
 <2><bdabe>: Abbrev Number: 2 (DW_TAG_member)
    <bdabf>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bdac3>   DW_AT_decl_file   : 6
    <bdac4>   DW_AT_decl_line   : 85
    <bdac5>   DW_AT_decl_column : 21
    <bdac6>   DW_AT_type        : <0xbda57>
    <bdaca>   DW_AT_data_member_location: 16
 <2><bdacb>: Abbrev Number: 0
 <1><bdacc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdacd>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <bdad1>   DW_AT_decl_file   : 6
    <bdad2>   DW_AT_decl_line   : 86
    <bdad3>   DW_AT_decl_column : 3
    <bdad4>   DW_AT_type        : <0xbda97>
 <1><bdad8>: Abbrev Number: 6 (DW_TAG_base_type)
    <bdad9>   DW_AT_byte_size   : 8
    <bdada>   DW_AT_encoding    : 4	(float)
    <bdadb>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><bdadf>: Abbrev Number: 6 (DW_TAG_base_type)
    <bdae0>   DW_AT_byte_size   : 4
    <bdae1>   DW_AT_encoding    : 4	(float)
    <bdae2>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><bdae6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdae7>   DW_AT_byte_size   : 8
    <bdae7>   DW_AT_type        : <0xbda32>
 <1><bdaeb>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <bdaec>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <bdaf0>   DW_AT_encoding    : 7	(unsigned)
    <bdaf1>   DW_AT_byte_size   : 4
    <bdaf2>   DW_AT_type        : <0xbd9d6>
    <bdaf6>   DW_AT_decl_file   : 7
    <bdaf7>   DW_AT_decl_line   : 25
    <bdaf8>   DW_AT_decl_column : 14
    <bdaf9>   DW_AT_sibling     : <0xbdb16>
 <2><bdafd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bdafe>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <bdb02>   DW_AT_const_value : 0
 <2><bdb03>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bdb04>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <bdb08>   DW_AT_const_value : 1
 <2><bdb09>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bdb0a>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <bdb0e>   DW_AT_const_value : 2
 <2><bdb0f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bdb10>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <bdb14>   DW_AT_const_value : 3
 <2><bdb15>: Abbrev Number: 0
 <1><bdb16>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdb17>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <bdb1b>   DW_AT_decl_file   : 7
    <bdb1c>   DW_AT_decl_line   : 30
    <bdb1d>   DW_AT_decl_column : 3
    <bdb1e>   DW_AT_type        : <0xbdaeb>
 <1><bdb22>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdb23>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <bdb27>   DW_AT_decl_file   : 7
    <bdb28>   DW_AT_decl_line   : 54
    <bdb29>   DW_AT_decl_column : 15
    <bdb2a>   DW_AT_type        : <0xbdb2e>
 <1><bdb2e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdb2f>   DW_AT_byte_size   : 8
    <bdb2f>   DW_AT_type        : <0xbdb33>
 <1><bdb33>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdb34>   DW_AT_prototyped  : 1
    <bdb34>   DW_AT_type        : <0xbd9f2>
    <bdb38>   DW_AT_sibling     : <0xbdb47>
 <2><bdb3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdb3d>   DW_AT_type        : <0xbdb47>
 <2><bdb41>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdb42>   DW_AT_type        : <0xbd9f2>
 <2><bdb46>: Abbrev Number: 0
 <1><bdb47>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdb48>   DW_AT_byte_size   : 8
    <bdb48>   DW_AT_type        : <0xbdb4c>
 <1><bdb4c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bdb4d>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <bdb51>   DW_AT_byte_size   : 80
    <bdb52>   DW_AT_decl_file   : 7
    <bdb53>   DW_AT_decl_line   : 97
    <bdb54>   DW_AT_decl_column : 16
    <bdb55>   DW_AT_sibling     : <0xbdc10>
 <2><bdb59>: Abbrev Number: 2 (DW_TAG_member)
    <bdb5a>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <bdb5e>   DW_AT_decl_file   : 7
    <bdb5f>   DW_AT_decl_line   : 98
    <bdb60>   DW_AT_decl_column : 21
    <bdb61>   DW_AT_type        : <0xbd9f2>
    <bdb65>   DW_AT_data_member_location: 0
 <2><bdb66>: Abbrev Number: 7 (DW_TAG_member)
    <bdb67>   DW_AT_name        : len
    <bdb6b>   DW_AT_decl_file   : 7
    <bdb6c>   DW_AT_decl_line   : 99
    <bdb6d>   DW_AT_decl_column : 21
    <bdb6e>   DW_AT_type        : <0xbd9f2>
    <bdb72>   DW_AT_data_member_location: 4
 <2><bdb73>: Abbrev Number: 2 (DW_TAG_member)
    <bdb74>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <bdb78>   DW_AT_decl_file   : 7
    <bdb79>   DW_AT_decl_line   : 100
    <bdb7a>   DW_AT_decl_column : 21
    <bdb7b>   DW_AT_type        : <0xbdb16>
    <bdb7f>   DW_AT_data_member_location: 8
 <2><bdb80>: Abbrev Number: 2 (DW_TAG_member)
    <bdb81>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <bdb85>   DW_AT_decl_file   : 7
    <bdb86>   DW_AT_decl_line   : 101
    <bdb87>   DW_AT_decl_column : 21
    <bdb88>   DW_AT_type        : <0xbda85>
    <bdb8c>   DW_AT_data_member_location: 16
 <2><bdb8d>: Abbrev Number: 2 (DW_TAG_member)
    <bdb8e>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <bdb92>   DW_AT_decl_file   : 7
    <bdb93>   DW_AT_decl_line   : 102
    <bdb94>   DW_AT_decl_column : 21
    <bdb95>   DW_AT_type        : <0xbd9f2>
    <bdb99>   DW_AT_data_member_location: 24
 <2><bdb9a>: Abbrev Number: 2 (DW_TAG_member)
    <bdb9b>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <bdb9f>   DW_AT_decl_file   : 7
    <bdba0>   DW_AT_decl_line   : 103
    <bdba1>   DW_AT_decl_column : 21
    <bdba2>   DW_AT_type        : <0xbd9f2>
    <bdba6>   DW_AT_data_member_location: 28
 <2><bdba7>: Abbrev Number: 2 (DW_TAG_member)
    <bdba8>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <bdbac>   DW_AT_decl_file   : 7
    <bdbad>   DW_AT_decl_line   : 104
    <bdbae>   DW_AT_decl_column : 21
    <bdbaf>   DW_AT_type        : <0xbd9f2>
    <bdbb3>   DW_AT_data_member_location: 32
 <2><bdbb4>: Abbrev Number: 2 (DW_TAG_member)
    <bdbb5>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <bdbb9>   DW_AT_decl_file   : 7
    <bdbba>   DW_AT_decl_line   : 105
    <bdbbb>   DW_AT_decl_column : 21
    <bdbbc>   DW_AT_type        : <0xbd9d6>
    <bdbc0>   DW_AT_data_member_location: 36
 <2><bdbc1>: Abbrev Number: 2 (DW_TAG_member)
    <bdbc2>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <bdbc6>   DW_AT_decl_file   : 7
    <bdbc7>   DW_AT_decl_line   : 106
    <bdbc8>   DW_AT_decl_column : 21
    <bdbc9>   DW_AT_type        : <0xbd9d6>
    <bdbcd>   DW_AT_data_member_location: 40
 <2><bdbce>: Abbrev Number: 2 (DW_TAG_member)
    <bdbcf>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <bdbd3>   DW_AT_decl_file   : 7
    <bdbd4>   DW_AT_decl_line   : 109
    <bdbd5>   DW_AT_decl_column : 21
    <bdbd6>   DW_AT_type        : <0xbda6a>
    <bdbda>   DW_AT_data_member_location: 44
 <2><bdbdb>: Abbrev Number: 2 (DW_TAG_member)
    <bdbdc>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <bdbe0>   DW_AT_decl_file   : 7
    <bdbe1>   DW_AT_decl_line   : 110
    <bdbe2>   DW_AT_decl_column : 21
    <bdbe3>   DW_AT_type        : <0xbda26>
    <bdbe7>   DW_AT_data_member_location: 48
 <2><bdbe8>: Abbrev Number: 2 (DW_TAG_member)
    <bdbe9>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <bdbed>   DW_AT_decl_file   : 7
    <bdbee>   DW_AT_decl_line   : 112
    <bdbef>   DW_AT_decl_column : 22
    <bdbf0>   DW_AT_type        : <0xbdea8>
    <bdbf4>   DW_AT_data_member_location: 56
 <2><bdbf5>: Abbrev Number: 2 (DW_TAG_member)
    <bdbf6>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <bdbfa>   DW_AT_decl_file   : 7
    <bdbfb>   DW_AT_decl_line   : 114
    <bdbfc>   DW_AT_decl_column : 14
    <bdbfd>   DW_AT_type        : <0xbda0c>
    <bdc01>   DW_AT_data_member_location: 64
 <2><bdc02>: Abbrev Number: 2 (DW_TAG_member)
    <bdc03>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <bdc07>   DW_AT_decl_file   : 7
    <bdc08>   DW_AT_decl_line   : 116
    <bdc09>   DW_AT_decl_column : 22
    <bdc0a>   DW_AT_type        : <0xbdb47>
    <bdc0e>   DW_AT_data_member_location: 72
 <2><bdc0f>: Abbrev Number: 0
 <1><bdc10>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdc11>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <bdc15>   DW_AT_decl_file   : 7
    <bdc16>   DW_AT_decl_line   : 59
    <bdc17>   DW_AT_decl_column : 15
    <bdc18>   DW_AT_type        : <0xbdc1c>
 <1><bdc1c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdc1d>   DW_AT_byte_size   : 8
    <bdc1d>   DW_AT_type        : <0xbdc21>
 <1><bdc21>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdc22>   DW_AT_prototyped  : 1
    <bdc22>   DW_AT_type        : <0xbd9f2>
    <bdc26>   DW_AT_sibling     : <0xbdc30>
 <2><bdc2a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc2b>   DW_AT_type        : <0xbdb47>
 <2><bdc2f>: Abbrev Number: 0
 <1><bdc30>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdc31>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <bdc35>   DW_AT_decl_file   : 7
    <bdc36>   DW_AT_decl_line   : 60
    <bdc37>   DW_AT_decl_column : 15
    <bdc38>   DW_AT_type        : <0xbdc1c>
 <1><bdc3c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdc3d>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <bdc41>   DW_AT_decl_file   : 7
    <bdc42>   DW_AT_decl_line   : 61
    <bdc43>   DW_AT_decl_column : 15
    <bdc44>   DW_AT_type        : <0xbdc48>
 <1><bdc48>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdc49>   DW_AT_byte_size   : 8
    <bdc49>   DW_AT_type        : <0xbdc4d>
 <1><bdc4d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdc4e>   DW_AT_prototyped  : 1
    <bdc4e>   DW_AT_type        : <0xbd9f2>
    <bdc52>   DW_AT_sibling     : <0xbdc66>
 <2><bdc56>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc57>   DW_AT_type        : <0xbdb47>
 <2><bdc5b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc5c>   DW_AT_type        : <0xbda85>
 <2><bdc60>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc61>   DW_AT_type        : <0xbd9f2>
 <2><bdc65>: Abbrev Number: 0
 <1><bdc66>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdc67>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <bdc6b>   DW_AT_decl_file   : 7
    <bdc6c>   DW_AT_decl_line   : 62
    <bdc6d>   DW_AT_decl_column : 15
    <bdc6e>   DW_AT_type        : <0xbdc72>
 <1><bdc72>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdc73>   DW_AT_byte_size   : 8
    <bdc73>   DW_AT_type        : <0xbdc77>
 <1><bdc77>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdc78>   DW_AT_prototyped  : 1
    <bdc78>   DW_AT_type        : <0xbd9f2>
    <bdc7c>   DW_AT_sibling     : <0xbdc8b>
 <2><bdc80>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc81>   DW_AT_type        : <0xbdb47>
 <2><bdc85>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdc86>   DW_AT_type        : <0xbdc8b>
 <2><bdc8a>: Abbrev Number: 0
 <1><bdc8b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdc8c>   DW_AT_byte_size   : 8
    <bdc8c>   DW_AT_type        : <0xbda85>
 <1><bdc90>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdc91>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <bdc95>   DW_AT_decl_file   : 7
    <bdc96>   DW_AT_decl_line   : 63
    <bdc97>   DW_AT_decl_column : 15
    <bdc98>   DW_AT_type        : <0xbdc9c>
 <1><bdc9c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdc9d>   DW_AT_byte_size   : 8
    <bdc9d>   DW_AT_type        : <0xbdca1>
 <1><bdca1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdca2>   DW_AT_prototyped  : 1
    <bdca2>   DW_AT_type        : <0xbd9f2>
    <bdca6>   DW_AT_sibling     : <0xbdcba>
 <2><bdcaa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdcab>   DW_AT_type        : <0xbdb47>
 <2><bdcaf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdcb0>   DW_AT_type        : <0xbda0c>
 <2><bdcb4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdcb5>   DW_AT_type        : <0xbdcba>
 <2><bdcb9>: Abbrev Number: 0
 <1><bdcba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdcbb>   DW_AT_byte_size   : 8
    <bdcbb>   DW_AT_type        : <0xbda26>
 <1><bdcbf>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdcc0>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <bdcc4>   DW_AT_decl_file   : 7
    <bdcc5>   DW_AT_decl_line   : 65
    <bdcc6>   DW_AT_decl_column : 15
    <bdcc7>   DW_AT_type        : <0xbdccb>
 <1><bdccb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdccc>   DW_AT_byte_size   : 8
    <bdccc>   DW_AT_type        : <0xbdcd0>
 <1><bdcd0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdcd1>   DW_AT_prototyped  : 1
    <bdcd1>   DW_AT_type        : <0xbd9f2>
    <bdcd5>   DW_AT_sibling     : <0xbdce9>
 <2><bdcd9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdcda>   DW_AT_type        : <0xbdb47>
 <2><bdcde>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdcdf>   DW_AT_type        : <0xbdae6>
 <2><bdce3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdce4>   DW_AT_type        : <0xbdcba>
 <2><bdce8>: Abbrev Number: 0
 <1><bdce9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdcea>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <bdcee>   DW_AT_decl_file   : 7
    <bdcef>   DW_AT_decl_line   : 67
    <bdcf0>   DW_AT_decl_column : 15
    <bdcf1>   DW_AT_type        : <0xbdcf5>
 <1><bdcf5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdcf6>   DW_AT_byte_size   : 8
    <bdcf6>   DW_AT_type        : <0xbdcfa>
 <1><bdcfa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdcfb>   DW_AT_prototyped  : 1
    <bdcfb>   DW_AT_type        : <0xbd9f2>
    <bdcff>   DW_AT_sibling     : <0xbdd13>
 <2><bdd03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd04>   DW_AT_type        : <0xbdb47>
 <2><bdd08>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd09>   DW_AT_type        : <0xbda7a>
 <2><bdd0d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd0e>   DW_AT_type        : <0xbda26>
 <2><bdd12>: Abbrev Number: 0
 <1><bdd13>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdd14>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <bdd18>   DW_AT_decl_file   : 7
    <bdd19>   DW_AT_decl_line   : 69
    <bdd1a>   DW_AT_decl_column : 15
    <bdd1b>   DW_AT_type        : <0xbdd1f>
 <1><bdd1f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd20>   DW_AT_byte_size   : 8
    <bdd20>   DW_AT_type        : <0xbdd24>
 <1><bdd24>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdd25>   DW_AT_prototyped  : 1
    <bdd25>   DW_AT_type        : <0xbd9f2>
    <bdd29>   DW_AT_sibling     : <0xbdd3d>
 <2><bdd2d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd2e>   DW_AT_type        : <0xbdb47>
 <2><bdd32>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd33>   DW_AT_type        : <0xbdd3d>
 <2><bdd37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd38>   DW_AT_type        : <0xbda26>
 <2><bdd3c>: Abbrev Number: 0
 <1><bdd3d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd3e>   DW_AT_byte_size   : 8
    <bdd3e>   DW_AT_type        : <0xbda3f>
 <1><bdd42>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdd43>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <bdd47>   DW_AT_decl_file   : 7
    <bdd48>   DW_AT_decl_line   : 71
    <bdd49>   DW_AT_decl_column : 15
    <bdd4a>   DW_AT_type        : <0xbdd4e>
 <1><bdd4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd4f>   DW_AT_byte_size   : 8
    <bdd4f>   DW_AT_type        : <0xbdd53>
 <1><bdd53>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdd54>   DW_AT_prototyped  : 1
    <bdd54>   DW_AT_type        : <0xbd9f2>
    <bdd58>   DW_AT_sibling     : <0xbdd6c>
 <2><bdd5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd5d>   DW_AT_type        : <0xbdb47>
 <2><bdd61>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd62>   DW_AT_type        : <0xbda85>
 <2><bdd66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd67>   DW_AT_type        : <0xbda85>
 <2><bdd6b>: Abbrev Number: 0
 <1><bdd6c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdd6d>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <bdd71>   DW_AT_decl_file   : 7
    <bdd72>   DW_AT_decl_line   : 73
    <bdd73>   DW_AT_decl_column : 15
    <bdd74>   DW_AT_type        : <0xbdd4e>
 <1><bdd78>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdd79>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <bdd7d>   DW_AT_decl_file   : 7
    <bdd7e>   DW_AT_decl_line   : 75
    <bdd7f>   DW_AT_decl_column : 15
    <bdd80>   DW_AT_type        : <0xbdd84>
 <1><bdd84>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd85>   DW_AT_byte_size   : 8
    <bdd85>   DW_AT_type        : <0xbdd89>
 <1><bdd89>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdd8a>   DW_AT_prototyped  : 1
    <bdd8a>   DW_AT_type        : <0xbd9f2>
    <bdd8e>   DW_AT_sibling     : <0xbdd9d>
 <2><bdd92>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd93>   DW_AT_type        : <0xbdb47>
 <2><bdd97>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdd98>   DW_AT_type        : <0xbdd9d>
 <2><bdd9c>: Abbrev Number: 0
 <1><bdd9d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdd9e>   DW_AT_byte_size   : 8
    <bdd9e>   DW_AT_type        : <0xbdacc>
 <1><bdda2>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdda3>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <bdda7>   DW_AT_decl_file   : 7
    <bdda8>   DW_AT_decl_line   : 76
    <bdda9>   DW_AT_decl_column : 15
    <bddaa>   DW_AT_type        : <0xbddae>
 <1><bddae>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bddaf>   DW_AT_byte_size   : 8
    <bddaf>   DW_AT_type        : <0xbddb3>
 <1><bddb3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bddb4>   DW_AT_prototyped  : 1
    <bddb4>   DW_AT_type        : <0xbd9f2>
    <bddb8>   DW_AT_sibling     : <0xbddcc>
 <2><bddbc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bddbd>   DW_AT_type        : <0xbdb47>
 <2><bddc1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bddc2>   DW_AT_type        : <0xbdae6>
 <2><bddc6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bddc7>   DW_AT_type        : <0xbda57>
 <2><bddcb>: Abbrev Number: 0
 <1><bddcc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bddcd>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <bddd1>   DW_AT_decl_file   : 7
    <bddd2>   DW_AT_decl_line   : 77
    <bddd3>   DW_AT_decl_column : 15
    <bddd4>   DW_AT_type        : <0xbdc1c>
 <1><bddd8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bddd9>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <bdddd>   DW_AT_byte_size   : 112
    <bddde>   DW_AT_decl_file   : 7
    <bdddf>   DW_AT_decl_line   : 80
    <bdde0>   DW_AT_decl_column : 16
    <bdde1>   DW_AT_sibling     : <0xbde9c>
 <2><bdde5>: Abbrev Number: 2 (DW_TAG_member)
    <bdde6>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <bddea>   DW_AT_decl_file   : 7
    <bddeb>   DW_AT_decl_line   : 81
    <bddec>   DW_AT_decl_column : 25
    <bdded>   DW_AT_type        : <0xbdc10>
    <bddf1>   DW_AT_data_member_location: 0
 <2><bddf2>: Abbrev Number: 2 (DW_TAG_member)
    <bddf3>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <bddf7>   DW_AT_decl_file   : 7
    <bddf8>   DW_AT_decl_line   : 82
    <bddf9>   DW_AT_decl_column : 25
    <bddfa>   DW_AT_type        : <0xbdc30>
    <bddfe>   DW_AT_data_member_location: 8
 <2><bddff>: Abbrev Number: 2 (DW_TAG_member)
    <bde00>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <bde04>   DW_AT_decl_file   : 7
    <bde05>   DW_AT_decl_line   : 83
    <bde06>   DW_AT_decl_column : 25
    <bde07>   DW_AT_type        : <0xbdc3c>
    <bde0b>   DW_AT_data_member_location: 16
 <2><bde0c>: Abbrev Number: 2 (DW_TAG_member)
    <bde0d>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <bde11>   DW_AT_decl_file   : 7
    <bde12>   DW_AT_decl_line   : 84
    <bde13>   DW_AT_decl_column : 25
    <bde14>   DW_AT_type        : <0xbdc66>
    <bde18>   DW_AT_data_member_location: 24
 <2><bde19>: Abbrev Number: 2 (DW_TAG_member)
    <bde1a>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <bde1e>   DW_AT_decl_file   : 7
    <bde1f>   DW_AT_decl_line   : 85
    <bde20>   DW_AT_decl_column : 25
    <bde21>   DW_AT_type        : <0xbdc90>
    <bde25>   DW_AT_data_member_location: 32
 <2><bde26>: Abbrev Number: 2 (DW_TAG_member)
    <bde27>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <bde2b>   DW_AT_decl_file   : 7
    <bde2c>   DW_AT_decl_line   : 86
    <bde2d>   DW_AT_decl_column : 25
    <bde2e>   DW_AT_type        : <0xbdcbf>
    <bde32>   DW_AT_data_member_location: 40
 <2><bde33>: Abbrev Number: 2 (DW_TAG_member)
    <bde34>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <bde38>   DW_AT_decl_file   : 7
    <bde39>   DW_AT_decl_line   : 87
    <bde3a>   DW_AT_decl_column : 25
    <bde3b>   DW_AT_type        : <0xbdce9>
    <bde3f>   DW_AT_data_member_location: 48
 <2><bde40>: Abbrev Number: 2 (DW_TAG_member)
    <bde41>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <bde45>   DW_AT_decl_file   : 7
    <bde46>   DW_AT_decl_line   : 88
    <bde47>   DW_AT_decl_column : 25
    <bde48>   DW_AT_type        : <0xbdd13>
    <bde4c>   DW_AT_data_member_location: 56
 <2><bde4d>: Abbrev Number: 2 (DW_TAG_member)
    <bde4e>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <bde52>   DW_AT_decl_file   : 7
    <bde53>   DW_AT_decl_line   : 89
    <bde54>   DW_AT_decl_column : 25
    <bde55>   DW_AT_type        : <0xbdd42>
    <bde59>   DW_AT_data_member_location: 64
 <2><bde5a>: Abbrev Number: 2 (DW_TAG_member)
    <bde5b>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <bde5f>   DW_AT_decl_file   : 7
    <bde60>   DW_AT_decl_line   : 90
    <bde61>   DW_AT_decl_column : 25
    <bde62>   DW_AT_type        : <0xbdd6c>
    <bde66>   DW_AT_data_member_location: 72
 <2><bde67>: Abbrev Number: 2 (DW_TAG_member)
    <bde68>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <bde6c>   DW_AT_decl_file   : 7
    <bde6d>   DW_AT_decl_line   : 91
    <bde6e>   DW_AT_decl_column : 25
    <bde6f>   DW_AT_type        : <0xbdd78>
    <bde73>   DW_AT_data_member_location: 80
 <2><bde74>: Abbrev Number: 2 (DW_TAG_member)
    <bde75>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <bde79>   DW_AT_decl_file   : 7
    <bde7a>   DW_AT_decl_line   : 92
    <bde7b>   DW_AT_decl_column : 25
    <bde7c>   DW_AT_type        : <0xbdda2>
    <bde80>   DW_AT_data_member_location: 88
 <2><bde81>: Abbrev Number: 2 (DW_TAG_member)
    <bde82>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <bde86>   DW_AT_decl_file   : 7
    <bde87>   DW_AT_decl_line   : 93
    <bde88>   DW_AT_decl_column : 25
    <bde89>   DW_AT_type        : <0xbdb22>
    <bde8d>   DW_AT_data_member_location: 96
 <2><bde8e>: Abbrev Number: 2 (DW_TAG_member)
    <bde8f>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <bde93>   DW_AT_decl_file   : 7
    <bde94>   DW_AT_decl_line   : 94
    <bde95>   DW_AT_decl_column : 25
    <bde96>   DW_AT_type        : <0xbddcc>
    <bde9a>   DW_AT_data_member_location: 104
 <2><bde9b>: Abbrev Number: 0
 <1><bde9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <bde9d>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <bdea1>   DW_AT_decl_file   : 7
    <bdea2>   DW_AT_decl_line   : 95
    <bdea3>   DW_AT_decl_column : 3
    <bdea4>   DW_AT_type        : <0xbddd8>
 <1><bdea8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdea9>   DW_AT_byte_size   : 8
    <bdea9>   DW_AT_type        : <0xbde9c>
 <1><bdead>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdeae>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <bdeb2>   DW_AT_decl_file   : 7
    <bdeb3>   DW_AT_decl_line   : 117
    <bdeb4>   DW_AT_decl_column : 3
    <bdeb5>   DW_AT_type        : <0xbdb4c>
 <1><bdeb9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <bdeba>   DW_AT_byte_size   : 8
    <bdebb>   DW_AT_decl_file   : 8
    <bdebb>   DW_AT_decl_line   : 4
    <bdebc>   DW_AT_decl_column : 3
    <bdebc>   DW_AT_sibling     : <0xbdedb>
 <2><bdec0>: Abbrev Number: 2 (DW_TAG_member)
    <bdec1>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <bdec5>   DW_AT_decl_file   : 8
    <bdec6>   DW_AT_decl_line   : 5
    <bdec7>   DW_AT_decl_column : 8
    <bdec8>   DW_AT_type        : <0xbd9f2>
    <bdecc>   DW_AT_data_member_location: 0
 <2><bdecd>: Abbrev Number: 2 (DW_TAG_member)
    <bdece>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <bded2>   DW_AT_decl_file   : 8
    <bded3>   DW_AT_decl_line   : 6
    <bded4>   DW_AT_decl_column : 8
    <bded5>   DW_AT_type        : <0xbd9f2>
    <bded9>   DW_AT_data_member_location: 4
 <2><bdeda>: Abbrev Number: 0
 <1><bdedb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <bdedc>   DW_AT_byte_size   : 16
    <bdedd>   DW_AT_decl_file   : 8
    <bdedd>   DW_AT_decl_line   : 8
    <bdede>   DW_AT_decl_column : 3
    <bdede>   DW_AT_sibling     : <0xbdf11>
 <2><bdee2>: Abbrev Number: 7 (DW_TAG_member)
    <bdee3>   DW_AT_name        : x
    <bdee5>   DW_AT_decl_file   : 8
    <bdee6>   DW_AT_decl_line   : 9
    <bdee7>   DW_AT_decl_column : 8
    <bdee8>   DW_AT_type        : <0xbd9f2>
    <bdeec>   DW_AT_data_member_location: 0
 <2><bdeed>: Abbrev Number: 7 (DW_TAG_member)
    <bdeee>   DW_AT_name        : y
    <bdef0>   DW_AT_decl_file   : 8
    <bdef1>   DW_AT_decl_line   : 9
    <bdef2>   DW_AT_decl_column : 11
    <bdef3>   DW_AT_type        : <0xbd9f2>
    <bdef7>   DW_AT_data_member_location: 4
 <2><bdef8>: Abbrev Number: 7 (DW_TAG_member)
    <bdef9>   DW_AT_name        : dx
    <bdefc>   DW_AT_decl_file   : 8
    <bdefd>   DW_AT_decl_line   : 10
    <bdefe>   DW_AT_decl_column : 8
    <bdeff>   DW_AT_type        : <0xbd9f2>
    <bdf03>   DW_AT_data_member_location: 8
 <2><bdf04>: Abbrev Number: 7 (DW_TAG_member)
    <bdf05>   DW_AT_name        : dy
    <bdf08>   DW_AT_decl_file   : 8
    <bdf09>   DW_AT_decl_line   : 10
    <bdf0a>   DW_AT_decl_column : 12
    <bdf0b>   DW_AT_type        : <0xbd9f2>
    <bdf0f>   DW_AT_data_member_location: 12
 <2><bdf10>: Abbrev Number: 0
 <1><bdf11>: Abbrev Number: 29 (DW_TAG_union_type)
    <bdf12>   DW_AT_byte_size   : 16
    <bdf13>   DW_AT_decl_file   : 8
    <bdf14>   DW_AT_decl_line   : 3
    <bdf15>   DW_AT_decl_column : 2
    <bdf16>   DW_AT_sibling     : <0xbdf41>
 <2><bdf1a>: Abbrev Number: 17 (DW_TAG_member)
    <bdf1b>   DW_AT_type        : <0xbdeb9>
 <2><bdf1f>: Abbrev Number: 17 (DW_TAG_member)
    <bdf20>   DW_AT_type        : <0xbdedb>
 <2><bdf24>: Abbrev Number: 30 (DW_TAG_member)
    <bdf25>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <bdf29>   DW_AT_decl_file   : 8
    <bdf2a>   DW_AT_decl_line   : 12
    <bdf2b>   DW_AT_decl_column : 7
    <bdf2c>   DW_AT_type        : <0xbd9f2>
 <2><bdf30>: Abbrev Number: 18 (DW_TAG_member)
    <bdf31>   DW_AT_name        : z
    <bdf33>   DW_AT_decl_file   : 8
    <bdf33>   DW_AT_decl_line   : 13
    <bdf34>   DW_AT_decl_column : 7
    <bdf34>   DW_AT_type        : <0xbd9f2>
 <2><bdf38>: Abbrev Number: 18 (DW_TAG_member)
    <bdf39>   DW_AT_name        : w
    <bdf3b>   DW_AT_decl_file   : 8
    <bdf3b>   DW_AT_decl_line   : 14
    <bdf3c>   DW_AT_decl_column : 7
    <bdf3c>   DW_AT_type        : <0xbd9f2>
 <2><bdf40>: Abbrev Number: 0
 <1><bdf41>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bdf42>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <bdf46>   DW_AT_byte_size   : 20
    <bdf47>   DW_AT_decl_file   : 8
    <bdf48>   DW_AT_decl_line   : 1
    <bdf49>   DW_AT_decl_column : 8
    <bdf4a>   DW_AT_sibling     : <0xbdf62>
 <2><bdf4e>: Abbrev Number: 2 (DW_TAG_member)
    <bdf4f>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <bdf53>   DW_AT_decl_file   : 8
    <bdf54>   DW_AT_decl_line   : 2
    <bdf55>   DW_AT_decl_column : 6
    <bdf56>   DW_AT_type        : <0xbd9f2>
    <bdf5a>   DW_AT_data_member_location: 0
 <2><bdf5b>: Abbrev Number: 31 (DW_TAG_member)
    <bdf5c>   DW_AT_type        : <0xbdf11>
    <bdf60>   DW_AT_data_member_location: 4
 <2><bdf61>: Abbrev Number: 0
 <1><bdf62>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdf63>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <bdf67>   DW_AT_decl_file   : 8
    <bdf68>   DW_AT_decl_line   : 18
    <bdf69>   DW_AT_decl_column : 23
    <bdf6a>   DW_AT_type        : <0xbdf41>
 <1><bdf6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdf6f>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <bdf73>   DW_AT_decl_file   : 9
    <bdf74>   DW_AT_decl_line   : 1
    <bdf75>   DW_AT_decl_column : 23
    <bdf76>   DW_AT_type        : <0xbdf7a>
 <1><bdf7a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdf7b>   DW_AT_byte_size   : 8
    <bdf7b>   DW_AT_type        : <0xbdf7f>
 <1><bdf7f>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <bdf80>   DW_AT_prototyped  : 1
    <bdf80>   DW_AT_type        : <0xbdd9d>
 <1><bdf84>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdf85>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <bdf89>   DW_AT_decl_file   : 9
    <bdf8a>   DW_AT_decl_line   : 2
    <bdf8b>   DW_AT_decl_column : 23
    <bdf8c>   DW_AT_type        : <0xbdf90>
 <1><bdf90>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdf91>   DW_AT_byte_size   : 8
    <bdf91>   DW_AT_type        : <0xbdf95>
 <1><bdf95>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <bdf96>   DW_AT_prototyped  : 1
    <bdf96>   DW_AT_type        : <0xbd9f2>
 <1><bdf9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdf9b>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <bdf9f>   DW_AT_decl_file   : 9
    <bdfa0>   DW_AT_decl_line   : 3
    <bdfa1>   DW_AT_decl_column : 23
    <bdfa2>   DW_AT_type        : <0xbdf90>
 <1><bdfa6>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdfa7>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <bdfab>   DW_AT_decl_file   : 9
    <bdfac>   DW_AT_decl_line   : 10
    <bdfad>   DW_AT_decl_column : 23
    <bdfae>   DW_AT_type        : <0xbdfb2>
 <1><bdfb2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdfb3>   DW_AT_byte_size   : 8
    <bdfb3>   DW_AT_type        : <0xbdfb7>
 <1><bdfb7>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <bdfb8>   DW_AT_prototyped  : 1
    <bdfb8>   DW_AT_sibling     : <0xbdfc2>
 <2><bdfbc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdfbd>   DW_AT_type        : <0xbd9f2>
 <2><bdfc1>: Abbrev Number: 0
 <1><bdfc2>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdfc3>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <bdfc7>   DW_AT_decl_file   : 9
    <bdfc8>   DW_AT_decl_line   : 14
    <bdfc9>   DW_AT_decl_column : 23
    <bdfca>   DW_AT_type        : <0xbdfce>
 <1><bdfce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bdfcf>   DW_AT_byte_size   : 8
    <bdfcf>   DW_AT_type        : <0xbdfd3>
 <1><bdfd3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <bdfd4>   DW_AT_prototyped  : 1
    <bdfd4>   DW_AT_type        : <0xbd9f2>
    <bdfd8>   DW_AT_sibling     : <0xbdfec>
 <2><bdfdc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdfdd>   DW_AT_type        : <0xbd9f2>
 <2><bdfe1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdfe2>   DW_AT_type        : <0xbd9f2>
 <2><bdfe6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bdfe7>   DW_AT_type        : <0xbd9f2>
 <2><bdfeb>: Abbrev Number: 0
 <1><bdfec>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdfed>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <bdff1>   DW_AT_decl_file   : 9
    <bdff2>   DW_AT_decl_line   : 18
    <bdff3>   DW_AT_decl_column : 23
    <bdff4>   DW_AT_type        : <0xbdfce>
 <1><bdff8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bdff9>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <bdffd>   DW_AT_decl_file   : 9
    <bdffe>   DW_AT_decl_line   : 24
    <bdfff>   DW_AT_decl_column : 23
    <be000>   DW_AT_type        : <0xbda91>
 <1><be004>: Abbrev Number: 3 (DW_TAG_typedef)
    <be005>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <be009>   DW_AT_decl_file   : 9
    <be00a>   DW_AT_decl_line   : 28
    <be00b>   DW_AT_decl_column : 23
    <be00c>   DW_AT_type        : <0xbe010>
 <1><be010>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be011>   DW_AT_byte_size   : 8
    <be011>   DW_AT_type        : <0xbe015>
 <1><be015>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be016>   DW_AT_prototyped  : 1
    <be016>   DW_AT_type        : <0xbd9f2>
    <be01a>   DW_AT_sibling     : <0xbe029>
 <2><be01e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be01f>   DW_AT_type        : <0xbd9f2>
 <2><be023>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be024>   DW_AT_type        : <0xbd9f2>
 <2><be028>: Abbrev Number: 0
 <1><be029>: Abbrev Number: 3 (DW_TAG_typedef)
    <be02a>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <be02e>   DW_AT_decl_file   : 9
    <be02f>   DW_AT_decl_line   : 34
    <be030>   DW_AT_decl_column : 23
    <be031>   DW_AT_type        : <0xbdf90>
 <1><be035>: Abbrev Number: 3 (DW_TAG_typedef)
    <be036>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <be03a>   DW_AT_decl_file   : 9
    <be03b>   DW_AT_decl_line   : 35
    <be03c>   DW_AT_decl_column : 23
    <be03d>   DW_AT_type        : <0xbdf90>
 <1><be041>: Abbrev Number: 3 (DW_TAG_typedef)
    <be042>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <be046>   DW_AT_decl_file   : 9
    <be047>   DW_AT_decl_line   : 36
    <be048>   DW_AT_decl_column : 23
    <be049>   DW_AT_type        : <0xbe04d>
 <1><be04d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be04e>   DW_AT_byte_size   : 8
    <be04e>   DW_AT_type        : <0xbe052>
 <1><be052>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <be053>   DW_AT_prototyped  : 1
    <be053>   DW_AT_sibling     : <0xbe062>
 <2><be057>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be058>   DW_AT_type        : <0xbe062>
 <2><be05c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be05d>   DW_AT_type        : <0xbe062>
 <2><be061>: Abbrev Number: 0
 <1><be062>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be063>   DW_AT_byte_size   : 8
    <be063>   DW_AT_type        : <0xbd9f2>
 <1><be067>: Abbrev Number: 3 (DW_TAG_typedef)
    <be068>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <be06c>   DW_AT_decl_file   : 9
    <be06d>   DW_AT_decl_line   : 37
    <be06e>   DW_AT_decl_column : 23
    <be06f>   DW_AT_type        : <0xbe04d>
 <1><be073>: Abbrev Number: 3 (DW_TAG_typedef)
    <be074>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <be078>   DW_AT_decl_file   : 9
    <be079>   DW_AT_decl_line   : 45
    <be07a>   DW_AT_decl_column : 24
    <be07b>   DW_AT_type        : <0xbe07f>
 <1><be07f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be080>   DW_AT_byte_size   : 8
    <be080>   DW_AT_type        : <0xbe084>
 <1><be084>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be085>   DW_AT_prototyped  : 1
    <be085>   DW_AT_type        : <0xbd9d6>
    <be089>   DW_AT_sibling     : <0xbe09d>
 <2><be08d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be08e>   DW_AT_type        : <0xbd9f2>
 <2><be092>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be093>   DW_AT_type        : <0xbd9f2>
 <2><be097>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be098>   DW_AT_type        : <0xbd9f2>
 <2><be09c>: Abbrev Number: 0
 <1><be09d>: Abbrev Number: 3 (DW_TAG_typedef)
    <be09e>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <be0a2>   DW_AT_decl_file   : 9
    <be0a3>   DW_AT_decl_line   : 48
    <be0a4>   DW_AT_decl_column : 23
    <be0a5>   DW_AT_type        : <0xbe0a9>
 <1><be0a9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be0aa>   DW_AT_byte_size   : 8
    <be0aa>   DW_AT_type        : <0xbe0ae>
 <1><be0ae>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <be0af>   DW_AT_prototyped  : 1
    <be0af>   DW_AT_sibling     : <0xbe0c3>
 <2><be0b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0b4>   DW_AT_type        : <0xbda7a>
 <2><be0b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0b9>   DW_AT_type        : <0xbda26>
 <2><be0bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0be>   DW_AT_type        : <0xbd9f2>
 <2><be0c2>: Abbrev Number: 0
 <1><be0c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <be0c4>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <be0c8>   DW_AT_decl_file   : 9
    <be0c9>   DW_AT_decl_line   : 49
    <be0ca>   DW_AT_decl_column : 23
    <be0cb>   DW_AT_type        : <0xbe0cf>
 <1><be0cf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be0d0>   DW_AT_byte_size   : 8
    <be0d0>   DW_AT_type        : <0xbe0d4>
 <1><be0d4>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <be0d5>   DW_AT_prototyped  : 1
    <be0d5>   DW_AT_sibling     : <0xbe0e9>
 <2><be0d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0da>   DW_AT_type        : <0xbdd3d>
 <2><be0de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0df>   DW_AT_type        : <0xbda26>
 <2><be0e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be0e4>   DW_AT_type        : <0xbd9f2>
 <2><be0e8>: Abbrev Number: 0
 <1><be0e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <be0ea>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <be0ee>   DW_AT_decl_file   : 9
    <be0ef>   DW_AT_decl_line   : 51
    <be0f0>   DW_AT_decl_column : 24
    <be0f1>   DW_AT_type        : <0xbe0f5>
 <1><be0f5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be0f6>   DW_AT_byte_size   : 8
    <be0f6>   DW_AT_type        : <0xbe0fa>
 <1><be0fa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be0fb>   DW_AT_prototyped  : 1
    <be0fb>   DW_AT_type        : <0xbda1a>
    <be0ff>   DW_AT_sibling     : <0xbe10e>
 <2><be103>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be104>   DW_AT_type        : <0xbda1a>
 <2><be108>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be109>   DW_AT_type        : <0xbda57>
 <2><be10d>: Abbrev Number: 0
 <1><be10e>: Abbrev Number: 3 (DW_TAG_typedef)
    <be10f>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <be113>   DW_AT_decl_file   : 9
    <be114>   DW_AT_decl_line   : 54
    <be115>   DW_AT_decl_column : 23
    <be116>   DW_AT_type        : <0xbe11a>
 <1><be11a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be11b>   DW_AT_byte_size   : 8
    <be11b>   DW_AT_type        : <0xbe11f>
 <1><be11f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be120>   DW_AT_prototyped  : 1
    <be120>   DW_AT_type        : <0xbd9f2>
    <be124>   DW_AT_sibling     : <0xbe147>
 <2><be128>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be129>   DW_AT_type        : <0xbdd9d>
 <2><be12d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be12e>   DW_AT_type        : <0xbda0c>
 <2><be132>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be133>   DW_AT_type        : <0xbda57>
 <2><be137>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be138>   DW_AT_type        : <0xbd9f2>
 <2><be13c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be13d>   DW_AT_type        : <0xbd9f2>
 <2><be141>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be142>   DW_AT_type        : <0xbd9f2>
 <2><be146>: Abbrev Number: 0
 <1><be147>: Abbrev Number: 3 (DW_TAG_typedef)
    <be148>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <be14c>   DW_AT_decl_file   : 9
    <be14d>   DW_AT_decl_line   : 56
    <be14e>   DW_AT_decl_column : 23
    <be14f>   DW_AT_type        : <0xbe153>
 <1><be153>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be154>   DW_AT_byte_size   : 8
    <be154>   DW_AT_type        : <0xbe158>
 <1><be158>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be159>   DW_AT_prototyped  : 1
    <be159>   DW_AT_type        : <0xbd9f2>
    <be15d>   DW_AT_sibling     : <0xbe17b>
 <2><be161>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be162>   DW_AT_type        : <0xbdd3d>
 <2><be166>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be167>   DW_AT_type        : <0xbdae6>
 <2><be16b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be16c>   DW_AT_type        : <0xbda57>
 <2><be170>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be171>   DW_AT_type        : <0xbd9f2>
 <2><be175>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be176>   DW_AT_type        : <0xbd9f2>
 <2><be17a>: Abbrev Number: 0
 <1><be17b>: Abbrev Number: 3 (DW_TAG_typedef)
    <be17c>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <be180>   DW_AT_decl_file   : 9
    <be181>   DW_AT_decl_line   : 67
    <be182>   DW_AT_decl_column : 23
    <be183>   DW_AT_type        : <0xbe187>
 <1><be187>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be188>   DW_AT_byte_size   : 8
    <be188>   DW_AT_type        : <0xbe18c>
 <1><be18c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be18d>   DW_AT_prototyped  : 1
    <be18d>   DW_AT_type        : <0xbd9f2>
    <be191>   DW_AT_sibling     : <0xbe19b>
 <2><be195>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be196>   DW_AT_type        : <0xbd9f2>
 <2><be19a>: Abbrev Number: 0
 <1><be19b>: Abbrev Number: 3 (DW_TAG_typedef)
    <be19c>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <be1a0>   DW_AT_decl_file   : 9
    <be1a1>   DW_AT_decl_line   : 68
    <be1a2>   DW_AT_decl_column : 23
    <be1a3>   DW_AT_type        : <0xbe1a7>
 <1><be1a7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be1a8>   DW_AT_byte_size   : 8
    <be1a8>   DW_AT_type        : <0xbe1ac>
 <1><be1ac>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be1ad>   DW_AT_prototyped  : 1
    <be1ad>   DW_AT_type        : <0xbd9f2>
    <be1b1>   DW_AT_sibling     : <0xbe1cf>
 <2><be1b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1b6>   DW_AT_type        : <0xbe062>
 <2><be1ba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1bb>   DW_AT_type        : <0xbe062>
 <2><be1bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1c0>   DW_AT_type        : <0xbe062>
 <2><be1c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1c5>   DW_AT_type        : <0xbe062>
 <2><be1c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1ca>   DW_AT_type        : <0xbe062>
 <2><be1ce>: Abbrev Number: 0
 <1><be1cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <be1d0>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <be1d4>   DW_AT_decl_file   : 9
    <be1d5>   DW_AT_decl_line   : 69
    <be1d6>   DW_AT_decl_column : 23
    <be1d7>   DW_AT_type        : <0xbe1db>
 <1><be1db>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be1dc>   DW_AT_byte_size   : 8
    <be1dc>   DW_AT_type        : <0xbe1e0>
 <1><be1e0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be1e1>   DW_AT_prototyped  : 1
    <be1e1>   DW_AT_type        : <0xbd9f2>
    <be1e5>   DW_AT_sibling     : <0xbe1fe>
 <2><be1e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1ea>   DW_AT_type        : <0xbd9f2>
 <2><be1ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1ef>   DW_AT_type        : <0xbd9f2>
 <2><be1f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1f4>   DW_AT_type        : <0xbd9f2>
 <2><be1f8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be1f9>   DW_AT_type        : <0xbd9f2>
 <2><be1fd>: Abbrev Number: 0
 <1><be1fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <be1ff>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <be203>   DW_AT_decl_file   : 9
    <be204>   DW_AT_decl_line   : 73
    <be205>   DW_AT_decl_column : 23
    <be206>   DW_AT_type        : <0xbe20a>
 <1><be20a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be20b>   DW_AT_byte_size   : 8
    <be20b>   DW_AT_type        : <0xbe20f>
 <1><be20f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be210>   DW_AT_prototyped  : 1
    <be210>   DW_AT_type        : <0xbd9f2>
    <be214>   DW_AT_sibling     : <0xbe21e>
 <2><be218>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be219>   DW_AT_type        : <0xbd9cf>
 <2><be21d>: Abbrev Number: 0
 <1><be21e>: Abbrev Number: 3 (DW_TAG_typedef)
    <be21f>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <be223>   DW_AT_decl_file   : 9
    <be224>   DW_AT_decl_line   : 74
    <be225>   DW_AT_decl_column : 23
    <be226>   DW_AT_type        : <0xbe22a>
 <1><be22a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be22b>   DW_AT_byte_size   : 8
    <be22b>   DW_AT_type        : <0xbe22f>
 <1><be22f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <be230>   DW_AT_prototyped  : 1
    <be230>   DW_AT_type        : <0xbd9f2>
    <be234>   DW_AT_sibling     : <0xbe243>
 <2><be238>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be239>   DW_AT_type        : <0xbd9cf>
 <2><be23d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be23e>   DW_AT_type        : <0xbd9c8>
 <2><be242>: Abbrev Number: 0
 <1><be243>: Abbrev Number: 3 (DW_TAG_typedef)
    <be244>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <be248>   DW_AT_decl_file   : 9
    <be249>   DW_AT_decl_line   : 80
    <be24a>   DW_AT_decl_column : 23
    <be24b>   DW_AT_type        : <0xbdfb2>
 <1><be24f>: Abbrev Number: 3 (DW_TAG_typedef)
    <be250>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <be254>   DW_AT_decl_file   : 9
    <be255>   DW_AT_decl_line   : 83
    <be256>   DW_AT_decl_column : 23
    <be257>   DW_AT_type        : <0xbe187>
 <1><be25b>: Abbrev Number: 3 (DW_TAG_typedef)
    <be25c>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <be260>   DW_AT_decl_file   : 9
    <be261>   DW_AT_decl_line   : 86
    <be262>   DW_AT_decl_column : 23
    <be263>   DW_AT_type        : <0xbe010>
 <1><be267>: Abbrev Number: 3 (DW_TAG_typedef)
    <be268>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <be26c>   DW_AT_decl_file   : 9
    <be26d>   DW_AT_decl_line   : 89
    <be26e>   DW_AT_decl_column : 23
    <be26f>   DW_AT_type        : <0xbe010>
 <1><be273>: Abbrev Number: 3 (DW_TAG_typedef)
    <be274>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <be278>   DW_AT_decl_file   : 9
    <be279>   DW_AT_decl_line   : 91
    <be27a>   DW_AT_decl_column : 23
    <be27b>   DW_AT_type        : <0xbe27f>
 <1><be27f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be280>   DW_AT_byte_size   : 8
    <be280>   DW_AT_type        : <0xbe284>
 <1><be284>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <be285>   DW_AT_prototyped  : 1
    <be285>   DW_AT_sibling     : <0xbe28f>
 <2><be289>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be28a>   DW_AT_type        : <0xbe28f>
 <2><be28e>: Abbrev Number: 0
 <1><be28f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be290>   DW_AT_byte_size   : 8
    <be290>   DW_AT_type        : <0xbdf62>
 <1><be294>: Abbrev Number: 8 (DW_TAG_structure_type)
    <be295>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <be299>   DW_AT_byte_size   : 224
    <be29a>   DW_AT_decl_file   : 9
    <be29b>   DW_AT_decl_line   : 93
    <be29c>   DW_AT_decl_column : 16
    <be29d>   DW_AT_sibling     : <0xbe40e>
 <2><be2a1>: Abbrev Number: 2 (DW_TAG_member)
    <be2a2>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <be2a6>   DW_AT_decl_file   : 9
    <be2a7>   DW_AT_decl_line   : 94
    <be2a8>   DW_AT_decl_column : 23
    <be2a9>   DW_AT_type        : <0xbdf6e>
    <be2ad>   DW_AT_data_member_location: 0
 <2><be2ae>: Abbrev Number: 2 (DW_TAG_member)
    <be2af>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <be2b3>   DW_AT_decl_file   : 9
    <be2b4>   DW_AT_decl_line   : 95
    <be2b5>   DW_AT_decl_column : 23
    <be2b6>   DW_AT_type        : <0xbdf84>
    <be2ba>   DW_AT_data_member_location: 8
 <2><be2bb>: Abbrev Number: 2 (DW_TAG_member)
    <be2bc>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <be2c0>   DW_AT_decl_file   : 9
    <be2c1>   DW_AT_decl_line   : 96
    <be2c2>   DW_AT_decl_column : 23
    <be2c3>   DW_AT_type        : <0xbdf9a>
    <be2c7>   DW_AT_data_member_location: 16
 <2><be2c8>: Abbrev Number: 2 (DW_TAG_member)
    <be2c9>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <be2cd>   DW_AT_decl_file   : 9
    <be2ce>   DW_AT_decl_line   : 97
    <be2cf>   DW_AT_decl_column : 23
    <be2d0>   DW_AT_type        : <0xbdfa6>
    <be2d4>   DW_AT_data_member_location: 24
 <2><be2d5>: Abbrev Number: 2 (DW_TAG_member)
    <be2d6>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <be2da>   DW_AT_decl_file   : 9
    <be2db>   DW_AT_decl_line   : 98
    <be2dc>   DW_AT_decl_column : 23
    <be2dd>   DW_AT_type        : <0xbdfc2>
    <be2e1>   DW_AT_data_member_location: 32
 <2><be2e2>: Abbrev Number: 2 (DW_TAG_member)
    <be2e3>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <be2e7>   DW_AT_decl_file   : 9
    <be2e8>   DW_AT_decl_line   : 99
    <be2e9>   DW_AT_decl_column : 23
    <be2ea>   DW_AT_type        : <0xbdfec>
    <be2ee>   DW_AT_data_member_location: 40
 <2><be2ef>: Abbrev Number: 2 (DW_TAG_member)
    <be2f0>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <be2f4>   DW_AT_decl_file   : 9
    <be2f5>   DW_AT_decl_line   : 100
    <be2f6>   DW_AT_decl_column : 23
    <be2f7>   DW_AT_type        : <0xbe004>
    <be2fb>   DW_AT_data_member_location: 48
 <2><be2fc>: Abbrev Number: 2 (DW_TAG_member)
    <be2fd>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <be301>   DW_AT_decl_file   : 9
    <be302>   DW_AT_decl_line   : 101
    <be303>   DW_AT_decl_column : 23
    <be304>   DW_AT_type        : <0xbe029>
    <be308>   DW_AT_data_member_location: 56
 <2><be309>: Abbrev Number: 2 (DW_TAG_member)
    <be30a>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <be30e>   DW_AT_decl_file   : 9
    <be30f>   DW_AT_decl_line   : 102
    <be310>   DW_AT_decl_column : 23
    <be311>   DW_AT_type        : <0xbe035>
    <be315>   DW_AT_data_member_location: 64
 <2><be316>: Abbrev Number: 2 (DW_TAG_member)
    <be317>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <be31b>   DW_AT_decl_file   : 9
    <be31c>   DW_AT_decl_line   : 103
    <be31d>   DW_AT_decl_column : 23
    <be31e>   DW_AT_type        : <0xbe041>
    <be322>   DW_AT_data_member_location: 72
 <2><be323>: Abbrev Number: 2 (DW_TAG_member)
    <be324>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <be328>   DW_AT_decl_file   : 9
    <be329>   DW_AT_decl_line   : 104
    <be32a>   DW_AT_decl_column : 23
    <be32b>   DW_AT_type        : <0xbe067>
    <be32f>   DW_AT_data_member_location: 80
 <2><be330>: Abbrev Number: 2 (DW_TAG_member)
    <be331>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <be335>   DW_AT_decl_file   : 9
    <be336>   DW_AT_decl_line   : 105
    <be337>   DW_AT_decl_column : 24
    <be338>   DW_AT_type        : <0xbe09d>
    <be33c>   DW_AT_data_member_location: 88
 <2><be33d>: Abbrev Number: 2 (DW_TAG_member)
    <be33e>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <be342>   DW_AT_decl_file   : 9
    <be343>   DW_AT_decl_line   : 106
    <be344>   DW_AT_decl_column : 25
    <be345>   DW_AT_type        : <0xbe0c3>
    <be349>   DW_AT_data_member_location: 96
 <2><be34a>: Abbrev Number: 2 (DW_TAG_member)
    <be34b>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <be34f>   DW_AT_decl_file   : 9
    <be350>   DW_AT_decl_line   : 107
    <be351>   DW_AT_decl_column : 23
    <be352>   DW_AT_type        : <0xbe0e9>
    <be356>   DW_AT_data_member_location: 104
 <2><be357>: Abbrev Number: 2 (DW_TAG_member)
    <be358>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <be35c>   DW_AT_decl_file   : 9
    <be35d>   DW_AT_decl_line   : 108
    <be35e>   DW_AT_decl_column : 23
    <be35f>   DW_AT_type        : <0xbe17b>
    <be363>   DW_AT_data_member_location: 112
 <2><be364>: Abbrev Number: 2 (DW_TAG_member)
    <be365>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <be369>   DW_AT_decl_file   : 9
    <be36a>   DW_AT_decl_line   : 109
    <be36b>   DW_AT_decl_column : 23
    <be36c>   DW_AT_type        : <0xbe19b>
    <be370>   DW_AT_data_member_location: 120
 <2><be371>: Abbrev Number: 2 (DW_TAG_member)
    <be372>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <be376>   DW_AT_decl_file   : 9
    <be377>   DW_AT_decl_line   : 110
    <be378>   DW_AT_decl_column : 23
    <be379>   DW_AT_type        : <0xbe1cf>
    <be37d>   DW_AT_data_member_location: 128
 <2><be37e>: Abbrev Number: 2 (DW_TAG_member)
    <be37f>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <be383>   DW_AT_decl_file   : 9
    <be384>   DW_AT_decl_line   : 111
    <be385>   DW_AT_decl_column : 23
    <be386>   DW_AT_type        : <0xbe1fe>
    <be38a>   DW_AT_data_member_location: 136
 <2><be38b>: Abbrev Number: 2 (DW_TAG_member)
    <be38c>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <be390>   DW_AT_decl_file   : 9
    <be391>   DW_AT_decl_line   : 112
    <be392>   DW_AT_decl_column : 23
    <be393>   DW_AT_type        : <0xbe21e>
    <be397>   DW_AT_data_member_location: 144
 <2><be398>: Abbrev Number: 2 (DW_TAG_member)
    <be399>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <be39d>   DW_AT_decl_file   : 9
    <be39e>   DW_AT_decl_line   : 113
    <be39f>   DW_AT_decl_column : 25
    <be3a0>   DW_AT_type        : <0xbdff8>
    <be3a4>   DW_AT_data_member_location: 152
 <2><be3a5>: Abbrev Number: 2 (DW_TAG_member)
    <be3a6>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <be3aa>   DW_AT_decl_file   : 9
    <be3ab>   DW_AT_decl_line   : 114
    <be3ac>   DW_AT_decl_column : 24
    <be3ad>   DW_AT_type        : <0xbe10e>
    <be3b1>   DW_AT_data_member_location: 160
 <2><be3b2>: Abbrev Number: 2 (DW_TAG_member)
    <be3b3>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <be3b7>   DW_AT_decl_file   : 9
    <be3b8>   DW_AT_decl_line   : 115
    <be3b9>   DW_AT_decl_column : 25
    <be3ba>   DW_AT_type        : <0xbe147>
    <be3be>   DW_AT_data_member_location: 168
 <2><be3bf>: Abbrev Number: 2 (DW_TAG_member)
    <be3c0>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <be3c4>   DW_AT_decl_file   : 9
    <be3c5>   DW_AT_decl_line   : 116
    <be3c6>   DW_AT_decl_column : 23
    <be3c7>   DW_AT_type        : <0xbe073>
    <be3cb>   DW_AT_data_member_location: 176
 <2><be3cc>: Abbrev Number: 2 (DW_TAG_member)
    <be3cd>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <be3d1>   DW_AT_decl_file   : 9
    <be3d2>   DW_AT_decl_line   : 117
    <be3d3>   DW_AT_decl_column : 23
    <be3d4>   DW_AT_type        : <0xbe243>
    <be3d8>   DW_AT_data_member_location: 184
 <2><be3d9>: Abbrev Number: 2 (DW_TAG_member)
    <be3da>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <be3de>   DW_AT_decl_file   : 9
    <be3df>   DW_AT_decl_line   : 118
    <be3e0>   DW_AT_decl_column : 22
    <be3e1>   DW_AT_type        : <0xbe24f>
    <be3e5>   DW_AT_data_member_location: 192
 <2><be3e6>: Abbrev Number: 2 (DW_TAG_member)
    <be3e7>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <be3eb>   DW_AT_decl_file   : 9
    <be3ec>   DW_AT_decl_line   : 119
    <be3ed>   DW_AT_decl_column : 23
    <be3ee>   DW_AT_type        : <0xbe25b>
    <be3f2>   DW_AT_data_member_location: 200
 <2><be3f3>: Abbrev Number: 2 (DW_TAG_member)
    <be3f4>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <be3f8>   DW_AT_decl_file   : 9
    <be3f9>   DW_AT_decl_line   : 120
    <be3fa>   DW_AT_decl_column : 22
    <be3fb>   DW_AT_type        : <0xbe267>
    <be3ff>   DW_AT_data_member_location: 208
 <2><be400>: Abbrev Number: 2 (DW_TAG_member)
    <be401>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <be405>   DW_AT_decl_file   : 9
    <be406>   DW_AT_decl_line   : 121
    <be407>   DW_AT_decl_column : 23
    <be408>   DW_AT_type        : <0xbe273>
    <be40c>   DW_AT_data_member_location: 216
 <2><be40d>: Abbrev Number: 0
 <1><be40e>: Abbrev Number: 3 (DW_TAG_typedef)
    <be40f>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <be413>   DW_AT_decl_file   : 9
    <be414>   DW_AT_decl_line   : 122
    <be415>   DW_AT_decl_column : 3
    <be416>   DW_AT_type        : <0xbe294>
 <1><be41a>: Abbrev Number: 32 (DW_TAG_structure_type)
    <be41b>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <be41f>   DW_AT_byte_size   : 20848
    <be421>   DW_AT_decl_file   : 10
    <be422>   DW_AT_decl_line   : 349
    <be424>   DW_AT_decl_column : 16
    <be425>   DW_AT_sibling     : <0xbe49a>
 <2><be429>: Abbrev Number: 10 (DW_TAG_member)
    <be42a>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <be42e>   DW_AT_decl_file   : 10
    <be42e>   DW_AT_decl_line   : 350
    <be430>   DW_AT_decl_column : 18
    <be430>   DW_AT_type        : <0xbd9f2>
    <be434>   DW_AT_data_member_location: 0
 <2><be435>: Abbrev Number: 10 (DW_TAG_member)
    <be436>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <be43a>   DW_AT_decl_file   : 10
    <be43a>   DW_AT_decl_line   : 351
    <be43c>   DW_AT_decl_column : 18
    <be43c>   DW_AT_type        : <0xbda80>
    <be440>   DW_AT_data_member_location: 8
 <2><be441>: Abbrev Number: 10 (DW_TAG_member)
    <be442>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <be446>   DW_AT_decl_file   : 10
    <be446>   DW_AT_decl_line   : 352
    <be448>   DW_AT_decl_column : 18
    <be448>   DW_AT_type        : <0xbdacc>
    <be44c>   DW_AT_data_member_location: 16
 <2><be44d>: Abbrev Number: 10 (DW_TAG_member)
    <be44e>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <be452>   DW_AT_decl_file   : 10
    <be452>   DW_AT_decl_line   : 353
    <be454>   DW_AT_decl_column : 18
    <be454>   DW_AT_type        : <0xbda1a>
    <be458>   DW_AT_data_member_location: 40
 <2><be459>: Abbrev Number: 10 (DW_TAG_member)
    <be45a>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <be45e>   DW_AT_decl_file   : 10
    <be45e>   DW_AT_decl_line   : 354
    <be460>   DW_AT_decl_column : 18
    <be460>   DW_AT_type        : <0xbe40e>
    <be464>   DW_AT_data_member_location: 48
 <2><be465>: Abbrev Number: 12 (DW_TAG_member)
    <be466>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <be46a>   DW_AT_decl_file   : 10
    <be46a>   DW_AT_decl_line   : 355
    <be46c>   DW_AT_decl_column : 18
    <be46c>   DW_AT_type        : <0xbe49a>
    <be470>   DW_AT_data_member_location: 272
 <2><be472>: Abbrev Number: 12 (DW_TAG_member)
    <be473>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <be477>   DW_AT_decl_file   : 10
    <be477>   DW_AT_decl_line   : 356
    <be479>   DW_AT_decl_column : 18
    <be479>   DW_AT_type        : <0xbd9f2>
    <be47d>   DW_AT_data_member_location: 20832
 <2><be47f>: Abbrev Number: 12 (DW_TAG_member)
    <be480>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <be484>   DW_AT_decl_file   : 10
    <be484>   DW_AT_decl_line   : 357
    <be486>   DW_AT_decl_column : 18
    <be486>   DW_AT_type        : <0xbd9f2>
    <be48a>   DW_AT_data_member_location: 20836
 <2><be48c>: Abbrev Number: 12 (DW_TAG_member)
    <be48d>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <be491>   DW_AT_decl_file   : 10
    <be491>   DW_AT_decl_line   : 358
    <be493>   DW_AT_decl_column : 18
    <be493>   DW_AT_type        : <0xbda91>
    <be497>   DW_AT_data_member_location: 20840
 <2><be499>: Abbrev Number: 0
 <1><be49a>: Abbrev Number: 15 (DW_TAG_array_type)
    <be49b>   DW_AT_type        : <0xbdead>
    <be49f>   DW_AT_sibling     : <0xbe4ab>
 <2><be4a3>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <be4a4>   DW_AT_type        : <0xbd9dd>
    <be4a8>   DW_AT_upper_bound : 256
 <2><be4aa>: Abbrev Number: 0
 <1><be4ab>: Abbrev Number: 14 (DW_TAG_typedef)
    <be4ac>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <be4b0>   DW_AT_decl_file   : 10
    <be4b1>   DW_AT_decl_line   : 359
    <be4b3>   DW_AT_decl_column : 3
    <be4b4>   DW_AT_type        : <0xbe41a>
 <1><be4b8>: Abbrev Number: 34 (DW_TAG_variable)
    <be4b9>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <be4bd>   DW_AT_decl_file   : 10
    <be4be>   DW_AT_decl_line   : 361
    <be4c0>   DW_AT_decl_column : 21
    <be4c1>   DW_AT_type        : <0xbe4ab>
    <be4c5>   DW_AT_external    : 1
    <be4c5>   DW_AT_declaration : 1
 <1><be4c5>: Abbrev Number: 35 (DW_TAG_subprogram)
    <be4c6>   DW_AT_external    : 1
    <be4c6>   DW_AT_name        : (indirect string, offset: 0x1b6c6): fb_ConsolePageSet
    <be4ca>   DW_AT_decl_file   : 11
    <be4cb>   DW_AT_decl_line   : 94
    <be4cc>   DW_AT_decl_column : 21
    <be4cd>   DW_AT_prototyped  : 1
    <be4cd>   DW_AT_type        : <0xbd9f2>
    <be4d1>   DW_AT_declaration : 1
    <be4d1>   DW_AT_sibling     : <0xbe4e0>
 <2><be4d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be4d6>   DW_AT_type        : <0xbd9f2>
 <2><be4da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be4db>   DW_AT_type        : <0xbd9f2>
 <2><be4df>: Abbrev Number: 0
 <1><be4e0>: Abbrev Number: 36 (DW_TAG_subprogram)
    <be4e1>   DW_AT_external    : 1
    <be4e1>   DW_AT_name        : (indirect string, offset: 0x1b167): fb_DevScrnInit_NoOpen
    <be4e5>   DW_AT_decl_file   : 12
    <be4e6>   DW_AT_decl_line   : 55
    <be4e7>   DW_AT_decl_column : 21
    <be4e8>   DW_AT_prototyped  : 1
    <be4e8>   DW_AT_declaration : 1
 <1><be4e8>: Abbrev Number: 37 (DW_TAG_subprogram)
    <be4e9>   DW_AT_external    : 1
    <be4e9>   DW_AT_name        : (indirect string, offset: 0x18397): fb_PageSet
    <be4ed>   DW_AT_decl_file   : 1
    <be4ee>   DW_AT_decl_line   : 5
    <be4ef>   DW_AT_decl_column : 12
    <be4f0>   DW_AT_prototyped  : 1
    <be4f0>   DW_AT_type        : <0xbd9f2>
    <be4f4>   DW_AT_low_pc      : 0x471e50
    <be4fc>   DW_AT_high_pc     : 0x5d
    <be504>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <be506>   DW_AT_call_all_calls: 1
 <2><be506>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <be507>   DW_AT_name        : (indirect string, offset: 0x19d88): active
    <be50b>   DW_AT_decl_file   : 1
    <be50b>   DW_AT_decl_line   : 5
    <be50b>   DW_AT_decl_column : 28
    <be50c>   DW_AT_type        : <0xbd9f2>
    <be510>   DW_AT_location    : 0x3a9a4 (location list)
    <be514>   DW_AT_GNU_locviews: 0x3a992
 <2><be518>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <be519>   DW_AT_name        : (indirect string, offset: 0x1b061): visible
    <be51d>   DW_AT_decl_file   : 1
    <be51d>   DW_AT_decl_line   : 5
    <be51d>   DW_AT_decl_column : 40
    <be51e>   DW_AT_type        : <0xbd9f2>
    <be522>   DW_AT_location    : 0x3a9ed (location list)
    <be526>   DW_AT_GNU_locviews: 0x3a9db
 <2><be52a>: Abbrev Number: 38 (DW_TAG_variable)
    <be52b>   DW_AT_name        : res
    <be52f>   DW_AT_decl_file   : 1
    <be530>   DW_AT_decl_line   : 7
    <be531>   DW_AT_decl_column : 6
    <be532>   DW_AT_type        : <0xbd9f2>
    <be536>   DW_AT_const_value : -1
 <2><be537>: Abbrev Number: 39 (DW_TAG_call_site)
    <be538>   DW_AT_call_return_pc: 0x471e61
    <be540>   DW_AT_call_origin : <0xbe4e0>
 <2><be544>: Abbrev Number: 40 (DW_TAG_call_site)
    <be545>   DW_AT_call_return_pc: 0x471e7b
    <be54d>   DW_AT_call_tail_call: 1
    <be54d>   DW_AT_sibling     : <0xbe560>
 <3><be551>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <be552>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <be554>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><be558>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <be559>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <be55b>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><be55f>: Abbrev Number: 0
 <2><be560>: Abbrev Number: 41 (DW_TAG_call_site)
    <be561>   DW_AT_call_return_pc: 0x471e9a
    <be569>   DW_AT_call_tail_call: 1
    <be569>   DW_AT_call_origin : <0xbe4c5>
 <3><be56d>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <be56e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <be570>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><be574>: Abbrev Number: 13 (DW_TAG_call_site_parameter)
    <be575>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <be577>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><be57b>: Abbrev Number: 0
 <2><be57c>: Abbrev Number: 0
 <1><be57d>: Abbrev Number: 0
  Compilation Unit @ offset 0xbe57e:
   Length:        0xc8b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xe4f7
   Pointer Size:  8
 <0><be58a>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <be58b>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <be58f>   DW_AT_language    : 29	(C11)
    <be590>   DW_AT_name        : (indirect line string, offset: 0xe8c): src/rtlib/hook_pcopy.c
    <be594>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <be598>   DW_AT_low_pc      : 0x471eb0
    <be5a0>   DW_AT_high_pc     : 0x61
    <be5a8>   DW_AT_stmt_list   : 0x665c6
 <1><be5ac>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5ad>   DW_AT_byte_size   : 1
    <be5ae>   DW_AT_encoding    : 8	(unsigned char)
    <be5af>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><be5b3>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5b4>   DW_AT_byte_size   : 2
    <be5b5>   DW_AT_encoding    : 7	(unsigned)
    <be5b6>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><be5ba>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5bb>   DW_AT_byte_size   : 4
    <be5bc>   DW_AT_encoding    : 7	(unsigned)
    <be5bd>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><be5c1>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5c2>   DW_AT_byte_size   : 8
    <be5c3>   DW_AT_encoding    : 7	(unsigned)
    <be5c4>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><be5c8>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5c9>   DW_AT_byte_size   : 1
    <be5ca>   DW_AT_encoding    : 6	(signed char)
    <be5cb>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><be5cf>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5d0>   DW_AT_byte_size   : 2
    <be5d1>   DW_AT_encoding    : 5	(signed)
    <be5d2>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><be5d6>: Abbrev Number: 24 (DW_TAG_base_type)
    <be5d7>   DW_AT_byte_size   : 4
    <be5d8>   DW_AT_encoding    : 5	(signed)
    <be5d9>   DW_AT_name        : int
 <1><be5dd>: Abbrev Number: 7 (DW_TAG_base_type)
    <be5de>   DW_AT_byte_size   : 8
    <be5df>   DW_AT_encoding    : 5	(signed)
    <be5e0>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><be5e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <be5e5>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <be5e9>   DW_AT_decl_file   : 2
    <be5ea>   DW_AT_decl_line   : 153
    <be5eb>   DW_AT_decl_column : 27
    <be5ec>   DW_AT_type        : <0xbe5dd>
 <1><be5f0>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <be5f1>   DW_AT_byte_size   : 8
 <1><be5f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <be5f3>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <be5f7>   DW_AT_decl_file   : 2
    <be5f8>   DW_AT_decl_line   : 194
    <be5f9>   DW_AT_decl_column : 27
    <be5fa>   DW_AT_type        : <0xbe5dd>
 <1><be5fe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be5ff>   DW_AT_byte_size   : 8
    <be5ff>   DW_AT_type        : <0xbe603>
 <1><be603>: Abbrev Number: 7 (DW_TAG_base_type)
    <be604>   DW_AT_byte_size   : 1
    <be605>   DW_AT_encoding    : 6	(signed char)
    <be606>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><be60a>: Abbrev Number: 3 (DW_TAG_typedef)
    <be60b>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <be60f>   DW_AT_decl_file   : 3
    <be610>   DW_AT_decl_line   : 209
    <be611>   DW_AT_decl_column : 23
    <be612>   DW_AT_type        : <0xbe5c1>
 <1><be616>: Abbrev Number: 14 (DW_TAG_typedef)
    <be617>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <be61b>   DW_AT_decl_file   : 3
    <be61c>   DW_AT_decl_line   : 321
    <be61e>   DW_AT_decl_column : 24
    <be61f>   DW_AT_type        : <0xbe5d6>
 <1><be623>: Abbrev Number: 26 (DW_TAG_const_type)
    <be624>   DW_AT_type        : <0xbe616>
 <1><be628>: Abbrev Number: 7 (DW_TAG_base_type)
    <be629>   DW_AT_byte_size   : 8
    <be62a>   DW_AT_encoding    : 5	(signed)
    <be62b>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><be62f>: Abbrev Number: 3 (DW_TAG_typedef)
    <be630>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <be634>   DW_AT_decl_file   : 4
    <be635>   DW_AT_decl_line   : 87
    <be636>   DW_AT_decl_column : 19
    <be637>   DW_AT_type        : <0xbe5e4>
 <1><be63b>: Abbrev Number: 3 (DW_TAG_typedef)
    <be63c>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <be640>   DW_AT_decl_file   : 4
    <be641>   DW_AT_decl_line   : 108
    <be642>   DW_AT_decl_column : 19
    <be643>   DW_AT_type        : <0xbe5f2>
 <1><be647>: Abbrev Number: 7 (DW_TAG_base_type)
    <be648>   DW_AT_byte_size   : 8
    <be649>   DW_AT_encoding    : 7	(unsigned)
    <be64a>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><be64e>: Abbrev Number: 15 (DW_TAG_array_type)
    <be64f>   DW_AT_type        : <0xbe603>
    <be653>   DW_AT_sibling     : <0xbe65e>
 <2><be657>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <be658>   DW_AT_type        : <0xbe5c1>
    <be65c>   DW_AT_upper_bound : 3
 <2><be65d>: Abbrev Number: 0
 <1><be65e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be65f>   DW_AT_byte_size   : 8
    <be65f>   DW_AT_type        : <0xbe663>
 <1><be663>: Abbrev Number: 28 (DW_TAG_const_type)
 <1><be664>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be665>   DW_AT_byte_size   : 8
    <be665>   DW_AT_type        : <0xbe5fe>
 <1><be669>: Abbrev Number: 3 (DW_TAG_typedef)
    <be66a>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <be66e>   DW_AT_decl_file   : 5
    <be66f>   DW_AT_decl_line   : 22
    <be670>   DW_AT_decl_column : 15
    <be671>   DW_AT_type        : <0xbe62f>
 <1><be675>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <be676>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <be67a>   DW_AT_encoding    : 7	(void)
    <be67a>   DW_AT_byte_size   : 4
    <be67a>   DW_AT_type        : <0xbe5ba>
    <be67e>   DW_AT_decl_file   : 7
    <be67f>   DW_AT_decl_line   : 1
    <be680>   DW_AT_decl_column : 14
    <be680>   DW_AT_sibling     : <0xbe6f7>
 <2><be684>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be685>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <be689>   DW_AT_const_value : 0
 <2><be68a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be68b>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <be68f>   DW_AT_const_value : 1
 <2><be690>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be691>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <be695>   DW_AT_const_value : 2
 <2><be696>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be697>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <be69b>   DW_AT_const_value : 3
 <2><be69c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be69d>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <be6a1>   DW_AT_const_value : 4
 <2><be6a2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6a3>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <be6a7>   DW_AT_const_value : 5
 <2><be6a8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6a9>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <be6ad>   DW_AT_const_value : 6
 <2><be6ae>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6af>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <be6b3>   DW_AT_const_value : 7
 <2><be6b4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6b5>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <be6b9>   DW_AT_const_value : 8
 <2><be6ba>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6bb>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <be6bf>   DW_AT_const_value : 9
 <2><be6c0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6c1>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <be6c5>   DW_AT_const_value : 10
 <2><be6c6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6c7>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <be6cb>   DW_AT_const_value : 11
 <2><be6cc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6cd>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <be6d1>   DW_AT_const_value : 12
 <2><be6d2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6d3>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <be6d7>   DW_AT_const_value : 13
 <2><be6d8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6d9>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <be6dd>   DW_AT_const_value : 14
 <2><be6de>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6df>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <be6e3>   DW_AT_const_value : 15
 <2><be6e4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6e5>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <be6e9>   DW_AT_const_value : 16
 <2><be6ea>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6eb>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <be6ef>   DW_AT_const_value : 17
 <2><be6f0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be6f1>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <be6f5>   DW_AT_const_value : 18
 <2><be6f6>: Abbrev Number: 0
 <1><be6f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be6f8>   DW_AT_byte_size   : 8
    <be6f8>   DW_AT_type        : <0xbe6fc>
 <1><be6fc>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <be6fd>   DW_AT_prototyped  : 1
 <1><be6fd>: Abbrev Number: 9 (DW_TAG_structure_type)
    <be6fe>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <be702>   DW_AT_byte_size   : 24
    <be703>   DW_AT_decl_file   : 6
    <be704>   DW_AT_decl_line   : 82
    <be705>   DW_AT_decl_column : 16
    <be706>   DW_AT_sibling     : <0xbe732>
 <2><be70a>: Abbrev Number: 2 (DW_TAG_member)
    <be70b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <be70f>   DW_AT_decl_file   : 6
    <be710>   DW_AT_decl_line   : 83
    <be711>   DW_AT_decl_column : 21
    <be712>   DW_AT_type        : <0xbe5fe>
    <be716>   DW_AT_data_member_location: 0
 <2><be717>: Abbrev Number: 8 (DW_TAG_member)
    <be718>   DW_AT_name        : len
    <be71c>   DW_AT_decl_file   : 6
    <be71d>   DW_AT_decl_line   : 84
    <be71e>   DW_AT_decl_column : 21
    <be71f>   DW_AT_type        : <0xbe63b>
    <be723>   DW_AT_data_member_location: 8
 <2><be724>: Abbrev Number: 2 (DW_TAG_member)
    <be725>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <be729>   DW_AT_decl_file   : 6
    <be72a>   DW_AT_decl_line   : 85
    <be72b>   DW_AT_decl_column : 21
    <be72c>   DW_AT_type        : <0xbe63b>
    <be730>   DW_AT_data_member_location: 16
 <2><be731>: Abbrev Number: 0
 <1><be732>: Abbrev Number: 3 (DW_TAG_typedef)
    <be733>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <be737>   DW_AT_decl_file   : 6
    <be738>   DW_AT_decl_line   : 86
    <be739>   DW_AT_decl_column : 3
    <be73a>   DW_AT_type        : <0xbe6fd>
 <1><be73e>: Abbrev Number: 7 (DW_TAG_base_type)
    <be73f>   DW_AT_byte_size   : 8
    <be740>   DW_AT_encoding    : 4	(float)
    <be741>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><be745>: Abbrev Number: 7 (DW_TAG_base_type)
    <be746>   DW_AT_byte_size   : 4
    <be747>   DW_AT_encoding    : 4	(float)
    <be748>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><be74c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be74d>   DW_AT_byte_size   : 8
    <be74d>   DW_AT_type        : <0xbe616>
 <1><be751>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <be752>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <be756>   DW_AT_encoding    : 7	(void)
    <be756>   DW_AT_byte_size   : 4
    <be756>   DW_AT_type        : <0xbe5ba>
    <be75a>   DW_AT_decl_file   : 8
    <be75b>   DW_AT_decl_line   : 25
    <be75c>   DW_AT_decl_column : 14
    <be75c>   DW_AT_sibling     : <0xbe779>
 <2><be760>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be761>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <be765>   DW_AT_const_value : 0
 <2><be766>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be767>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <be76b>   DW_AT_const_value : 1
 <2><be76c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be76d>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <be771>   DW_AT_const_value : 2
 <2><be772>: Abbrev Number: 5 (DW_TAG_enumerator)
    <be773>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <be777>   DW_AT_const_value : 3
 <2><be778>: Abbrev Number: 0
 <1><be779>: Abbrev Number: 3 (DW_TAG_typedef)
    <be77a>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <be77e>   DW_AT_decl_file   : 8
    <be77f>   DW_AT_decl_line   : 30
    <be780>   DW_AT_decl_column : 3
    <be781>   DW_AT_type        : <0xbe751>
 <1><be785>: Abbrev Number: 3 (DW_TAG_typedef)
    <be786>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <be78a>   DW_AT_decl_file   : 8
    <be78b>   DW_AT_decl_line   : 54
    <be78c>   DW_AT_decl_column : 15
    <be78d>   DW_AT_type        : <0xbe791>
 <1><be791>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be792>   DW_AT_byte_size   : 8
    <be792>   DW_AT_type        : <0xbe796>
 <1><be796>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be797>   DW_AT_prototyped  : 1
    <be797>   DW_AT_type        : <0xbe5d6>
    <be79b>   DW_AT_sibling     : <0xbe7aa>
 <2><be79f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be7a0>   DW_AT_type        : <0xbe7aa>
 <2><be7a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be7a5>   DW_AT_type        : <0xbe5d6>
 <2><be7a9>: Abbrev Number: 0
 <1><be7aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be7ab>   DW_AT_byte_size   : 8
    <be7ab>   DW_AT_type        : <0xbe7af>
 <1><be7af>: Abbrev Number: 9 (DW_TAG_structure_type)
    <be7b0>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <be7b4>   DW_AT_byte_size   : 80
    <be7b5>   DW_AT_decl_file   : 8
    <be7b6>   DW_AT_decl_line   : 97
    <be7b7>   DW_AT_decl_column : 16
    <be7b8>   DW_AT_sibling     : <0xbe873>
 <2><be7bc>: Abbrev Number: 2 (DW_TAG_member)
    <be7bd>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <be7c1>   DW_AT_decl_file   : 8
    <be7c2>   DW_AT_decl_line   : 98
    <be7c3>   DW_AT_decl_column : 21
    <be7c4>   DW_AT_type        : <0xbe5d6>
    <be7c8>   DW_AT_data_member_location: 0
 <2><be7c9>: Abbrev Number: 8 (DW_TAG_member)
    <be7ca>   DW_AT_name        : len
    <be7ce>   DW_AT_decl_file   : 8
    <be7cf>   DW_AT_decl_line   : 99
    <be7d0>   DW_AT_decl_column : 21
    <be7d1>   DW_AT_type        : <0xbe5d6>
    <be7d5>   DW_AT_data_member_location: 4
 <2><be7d6>: Abbrev Number: 2 (DW_TAG_member)
    <be7d7>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <be7db>   DW_AT_decl_file   : 8
    <be7dc>   DW_AT_decl_line   : 100
    <be7dd>   DW_AT_decl_column : 21
    <be7de>   DW_AT_type        : <0xbe779>
    <be7e2>   DW_AT_data_member_location: 8
 <2><be7e3>: Abbrev Number: 2 (DW_TAG_member)
    <be7e4>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <be7e8>   DW_AT_decl_file   : 8
    <be7e9>   DW_AT_decl_line   : 101
    <be7ea>   DW_AT_decl_column : 21
    <be7eb>   DW_AT_type        : <0xbe669>
    <be7ef>   DW_AT_data_member_location: 16
 <2><be7f0>: Abbrev Number: 2 (DW_TAG_member)
    <be7f1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <be7f5>   DW_AT_decl_file   : 8
    <be7f6>   DW_AT_decl_line   : 102
    <be7f7>   DW_AT_decl_column : 21
    <be7f8>   DW_AT_type        : <0xbe5d6>
    <be7fc>   DW_AT_data_member_location: 24
 <2><be7fd>: Abbrev Number: 2 (DW_TAG_member)
    <be7fe>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <be802>   DW_AT_decl_file   : 8
    <be803>   DW_AT_decl_line   : 103
    <be804>   DW_AT_decl_column : 21
    <be805>   DW_AT_type        : <0xbe5d6>
    <be809>   DW_AT_data_member_location: 28
 <2><be80a>: Abbrev Number: 2 (DW_TAG_member)
    <be80b>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <be80f>   DW_AT_decl_file   : 8
    <be810>   DW_AT_decl_line   : 104
    <be811>   DW_AT_decl_column : 21
    <be812>   DW_AT_type        : <0xbe5d6>
    <be816>   DW_AT_data_member_location: 32
 <2><be817>: Abbrev Number: 2 (DW_TAG_member)
    <be818>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <be81c>   DW_AT_decl_file   : 8
    <be81d>   DW_AT_decl_line   : 105
    <be81e>   DW_AT_decl_column : 21
    <be81f>   DW_AT_type        : <0xbe5ba>
    <be823>   DW_AT_data_member_location: 36
 <2><be824>: Abbrev Number: 2 (DW_TAG_member)
    <be825>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <be829>   DW_AT_decl_file   : 8
    <be82a>   DW_AT_decl_line   : 106
    <be82b>   DW_AT_decl_column : 21
    <be82c>   DW_AT_type        : <0xbe5ba>
    <be830>   DW_AT_data_member_location: 40
 <2><be831>: Abbrev Number: 2 (DW_TAG_member)
    <be832>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <be836>   DW_AT_decl_file   : 8
    <be837>   DW_AT_decl_line   : 109
    <be838>   DW_AT_decl_column : 21
    <be839>   DW_AT_type        : <0xbe64e>
    <be83d>   DW_AT_data_member_location: 44
 <2><be83e>: Abbrev Number: 2 (DW_TAG_member)
    <be83f>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <be843>   DW_AT_decl_file   : 8
    <be844>   DW_AT_decl_line   : 110
    <be845>   DW_AT_decl_column : 21
    <be846>   DW_AT_type        : <0xbe60a>
    <be84a>   DW_AT_data_member_location: 48
 <2><be84b>: Abbrev Number: 2 (DW_TAG_member)
    <be84c>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <be850>   DW_AT_decl_file   : 8
    <be851>   DW_AT_decl_line   : 112
    <be852>   DW_AT_decl_column : 22
    <be853>   DW_AT_type        : <0xbeb0b>
    <be857>   DW_AT_data_member_location: 56
 <2><be858>: Abbrev Number: 2 (DW_TAG_member)
    <be859>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <be85d>   DW_AT_decl_file   : 8
    <be85e>   DW_AT_decl_line   : 114
    <be85f>   DW_AT_decl_column : 14
    <be860>   DW_AT_type        : <0xbe5f0>
    <be864>   DW_AT_data_member_location: 64
 <2><be865>: Abbrev Number: 2 (DW_TAG_member)
    <be866>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <be86a>   DW_AT_decl_file   : 8
    <be86b>   DW_AT_decl_line   : 116
    <be86c>   DW_AT_decl_column : 22
    <be86d>   DW_AT_type        : <0xbe7aa>
    <be871>   DW_AT_data_member_location: 72
 <2><be872>: Abbrev Number: 0
 <1><be873>: Abbrev Number: 3 (DW_TAG_typedef)
    <be874>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <be878>   DW_AT_decl_file   : 8
    <be879>   DW_AT_decl_line   : 59
    <be87a>   DW_AT_decl_column : 15
    <be87b>   DW_AT_type        : <0xbe87f>
 <1><be87f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be880>   DW_AT_byte_size   : 8
    <be880>   DW_AT_type        : <0xbe884>
 <1><be884>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be885>   DW_AT_prototyped  : 1
    <be885>   DW_AT_type        : <0xbe5d6>
    <be889>   DW_AT_sibling     : <0xbe893>
 <2><be88d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be88e>   DW_AT_type        : <0xbe7aa>
 <2><be892>: Abbrev Number: 0
 <1><be893>: Abbrev Number: 3 (DW_TAG_typedef)
    <be894>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <be898>   DW_AT_decl_file   : 8
    <be899>   DW_AT_decl_line   : 60
    <be89a>   DW_AT_decl_column : 15
    <be89b>   DW_AT_type        : <0xbe87f>
 <1><be89f>: Abbrev Number: 3 (DW_TAG_typedef)
    <be8a0>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <be8a4>   DW_AT_decl_file   : 8
    <be8a5>   DW_AT_decl_line   : 61
    <be8a6>   DW_AT_decl_column : 15
    <be8a7>   DW_AT_type        : <0xbe8ab>
 <1><be8ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be8ac>   DW_AT_byte_size   : 8
    <be8ac>   DW_AT_type        : <0xbe8b0>
 <1><be8b0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be8b1>   DW_AT_prototyped  : 1
    <be8b1>   DW_AT_type        : <0xbe5d6>
    <be8b5>   DW_AT_sibling     : <0xbe8c9>
 <2><be8b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be8ba>   DW_AT_type        : <0xbe7aa>
 <2><be8be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be8bf>   DW_AT_type        : <0xbe669>
 <2><be8c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be8c4>   DW_AT_type        : <0xbe5d6>
 <2><be8c8>: Abbrev Number: 0
 <1><be8c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <be8ca>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <be8ce>   DW_AT_decl_file   : 8
    <be8cf>   DW_AT_decl_line   : 62
    <be8d0>   DW_AT_decl_column : 15
    <be8d1>   DW_AT_type        : <0xbe8d5>
 <1><be8d5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be8d6>   DW_AT_byte_size   : 8
    <be8d6>   DW_AT_type        : <0xbe8da>
 <1><be8da>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be8db>   DW_AT_prototyped  : 1
    <be8db>   DW_AT_type        : <0xbe5d6>
    <be8df>   DW_AT_sibling     : <0xbe8ee>
 <2><be8e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be8e4>   DW_AT_type        : <0xbe7aa>
 <2><be8e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be8e9>   DW_AT_type        : <0xbe8ee>
 <2><be8ed>: Abbrev Number: 0
 <1><be8ee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be8ef>   DW_AT_byte_size   : 8
    <be8ef>   DW_AT_type        : <0xbe669>
 <1><be8f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <be8f4>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <be8f8>   DW_AT_decl_file   : 8
    <be8f9>   DW_AT_decl_line   : 63
    <be8fa>   DW_AT_decl_column : 15
    <be8fb>   DW_AT_type        : <0xbe8ff>
 <1><be8ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be900>   DW_AT_byte_size   : 8
    <be900>   DW_AT_type        : <0xbe904>
 <1><be904>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be905>   DW_AT_prototyped  : 1
    <be905>   DW_AT_type        : <0xbe5d6>
    <be909>   DW_AT_sibling     : <0xbe91d>
 <2><be90d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be90e>   DW_AT_type        : <0xbe7aa>
 <2><be912>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be913>   DW_AT_type        : <0xbe5f0>
 <2><be917>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be918>   DW_AT_type        : <0xbe91d>
 <2><be91c>: Abbrev Number: 0
 <1><be91d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be91e>   DW_AT_byte_size   : 8
    <be91e>   DW_AT_type        : <0xbe60a>
 <1><be922>: Abbrev Number: 3 (DW_TAG_typedef)
    <be923>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <be927>   DW_AT_decl_file   : 8
    <be928>   DW_AT_decl_line   : 65
    <be929>   DW_AT_decl_column : 15
    <be92a>   DW_AT_type        : <0xbe92e>
 <1><be92e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be92f>   DW_AT_byte_size   : 8
    <be92f>   DW_AT_type        : <0xbe933>
 <1><be933>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be934>   DW_AT_prototyped  : 1
    <be934>   DW_AT_type        : <0xbe5d6>
    <be938>   DW_AT_sibling     : <0xbe94c>
 <2><be93c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be93d>   DW_AT_type        : <0xbe7aa>
 <2><be941>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be942>   DW_AT_type        : <0xbe74c>
 <2><be946>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be947>   DW_AT_type        : <0xbe91d>
 <2><be94b>: Abbrev Number: 0
 <1><be94c>: Abbrev Number: 3 (DW_TAG_typedef)
    <be94d>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <be951>   DW_AT_decl_file   : 8
    <be952>   DW_AT_decl_line   : 67
    <be953>   DW_AT_decl_column : 15
    <be954>   DW_AT_type        : <0xbe958>
 <1><be958>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be959>   DW_AT_byte_size   : 8
    <be959>   DW_AT_type        : <0xbe95d>
 <1><be95d>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be95e>   DW_AT_prototyped  : 1
    <be95e>   DW_AT_type        : <0xbe5d6>
    <be962>   DW_AT_sibling     : <0xbe976>
 <2><be966>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be967>   DW_AT_type        : <0xbe7aa>
 <2><be96b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be96c>   DW_AT_type        : <0xbe65e>
 <2><be970>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be971>   DW_AT_type        : <0xbe60a>
 <2><be975>: Abbrev Number: 0
 <1><be976>: Abbrev Number: 3 (DW_TAG_typedef)
    <be977>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <be97b>   DW_AT_decl_file   : 8
    <be97c>   DW_AT_decl_line   : 69
    <be97d>   DW_AT_decl_column : 15
    <be97e>   DW_AT_type        : <0xbe982>
 <1><be982>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be983>   DW_AT_byte_size   : 8
    <be983>   DW_AT_type        : <0xbe987>
 <1><be987>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be988>   DW_AT_prototyped  : 1
    <be988>   DW_AT_type        : <0xbe5d6>
    <be98c>   DW_AT_sibling     : <0xbe9a0>
 <2><be990>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be991>   DW_AT_type        : <0xbe7aa>
 <2><be995>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be996>   DW_AT_type        : <0xbe9a0>
 <2><be99a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be99b>   DW_AT_type        : <0xbe60a>
 <2><be99f>: Abbrev Number: 0
 <1><be9a0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be9a1>   DW_AT_byte_size   : 8
    <be9a1>   DW_AT_type        : <0xbe623>
 <1><be9a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <be9a6>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <be9aa>   DW_AT_decl_file   : 8
    <be9ab>   DW_AT_decl_line   : 71
    <be9ac>   DW_AT_decl_column : 15
    <be9ad>   DW_AT_type        : <0xbe9b1>
 <1><be9b1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be9b2>   DW_AT_byte_size   : 8
    <be9b2>   DW_AT_type        : <0xbe9b6>
 <1><be9b6>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be9b7>   DW_AT_prototyped  : 1
    <be9b7>   DW_AT_type        : <0xbe5d6>
    <be9bb>   DW_AT_sibling     : <0xbe9cf>
 <2><be9bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be9c0>   DW_AT_type        : <0xbe7aa>
 <2><be9c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be9c5>   DW_AT_type        : <0xbe669>
 <2><be9c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be9ca>   DW_AT_type        : <0xbe669>
 <2><be9ce>: Abbrev Number: 0
 <1><be9cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <be9d0>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <be9d4>   DW_AT_decl_file   : 8
    <be9d5>   DW_AT_decl_line   : 73
    <be9d6>   DW_AT_decl_column : 15
    <be9d7>   DW_AT_type        : <0xbe9b1>
 <1><be9db>: Abbrev Number: 3 (DW_TAG_typedef)
    <be9dc>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <be9e0>   DW_AT_decl_file   : 8
    <be9e1>   DW_AT_decl_line   : 75
    <be9e2>   DW_AT_decl_column : 15
    <be9e3>   DW_AT_type        : <0xbe9e7>
 <1><be9e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <be9e8>   DW_AT_byte_size   : 8
    <be9e8>   DW_AT_type        : <0xbe9ec>
 <1><be9ec>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <be9ed>   DW_AT_prototyped  : 1
    <be9ed>   DW_AT_type        : <0xbe5d6>
    <be9f1>   DW_AT_sibling     : <0xbea00>
 <2><be9f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be9f6>   DW_AT_type        : <0xbe7aa>
 <2><be9fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be9fb>   DW_AT_type        : <0xbea00>
 <2><be9ff>: Abbrev Number: 0
 <1><bea00>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bea01>   DW_AT_byte_size   : 8
    <bea01>   DW_AT_type        : <0xbe732>
 <1><bea05>: Abbrev Number: 3 (DW_TAG_typedef)
    <bea06>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <bea0a>   DW_AT_decl_file   : 8
    <bea0b>   DW_AT_decl_line   : 76
    <bea0c>   DW_AT_decl_column : 15
    <bea0d>   DW_AT_type        : <0xbea11>
 <1><bea11>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bea12>   DW_AT_byte_size   : 8
    <bea12>   DW_AT_type        : <0xbea16>
 <1><bea16>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <bea17>   DW_AT_prototyped  : 1
    <bea17>   DW_AT_type        : <0xbe5d6>
    <bea1b>   DW_AT_sibling     : <0xbea2f>
 <2><bea1f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bea20>   DW_AT_type        : <0xbe7aa>
 <2><bea24>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bea25>   DW_AT_type        : <0xbe74c>
 <2><bea29>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bea2a>   DW_AT_type        : <0xbe63b>
 <2><bea2e>: Abbrev Number: 0
 <1><bea2f>: Abbrev Number: 3 (DW_TAG_typedef)
    <bea30>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <bea34>   DW_AT_decl_file   : 8
    <bea35>   DW_AT_decl_line   : 77
    <bea36>   DW_AT_decl_column : 15
    <bea37>   DW_AT_type        : <0xbe87f>
 <1><bea3b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <bea3c>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <bea40>   DW_AT_byte_size   : 112
    <bea41>   DW_AT_decl_file   : 8
    <bea42>   DW_AT_decl_line   : 80
    <bea43>   DW_AT_decl_column : 16
    <bea44>   DW_AT_sibling     : <0xbeaff>
 <2><bea48>: Abbrev Number: 2 (DW_TAG_member)
    <bea49>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <bea4d>   DW_AT_decl_file   : 8
    <bea4e>   DW_AT_decl_line   : 81
    <bea4f>   DW_AT_decl_column : 25
    <bea50>   DW_AT_type        : <0xbe873>
    <bea54>   DW_AT_data_member_location: 0
 <2><bea55>: Abbrev Number: 2 (DW_TAG_member)
    <bea56>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <bea5a>   DW_AT_decl_file   : 8
    <bea5b>   DW_AT_decl_line   : 82
    <bea5c>   DW_AT_decl_column : 25
    <bea5d>   DW_AT_type        : <0xbe893>
    <bea61>   DW_AT_data_member_location: 8
 <2><bea62>: Abbrev Number: 2 (DW_TAG_member)
    <bea63>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <bea67>   DW_AT_decl_file   : 8
    <bea68>   DW_AT_decl_line   : 83
    <bea69>   DW_AT_decl_column : 25
    <bea6a>   DW_AT_type        : <0xbe89f>
    <bea6e>   DW_AT_data_member_location: 16
 <2><bea6f>: Abbrev Number: 2 (DW_TAG_member)
    <bea70>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <bea74>   DW_AT_decl_file   : 8
    <bea75>   DW_AT_decl_line   : 84
    <bea76>   DW_AT_decl_column : 25
    <bea77>   DW_AT_type        : <0xbe8c9>
    <bea7b>   DW_AT_data_member_location: 24
 <2><bea7c>: Abbrev Number: 2 (DW_TAG_member)
    <bea7d>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <bea81>   DW_AT_decl_file   : 8
    <bea82>   DW_AT_decl_line   : 85
    <bea83>   DW_AT_decl_column : 25
    <bea84>   DW_AT_type        : <0xbe8f3>
    <bea88>   DW_AT_data_member_location: 32
 <2><bea89>: Abbrev Number: 2 (DW_TAG_member)
    <bea8a>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <bea8e>   DW_AT_decl_file   : 8
    <bea8f>   DW_AT_decl_line   : 86
    <bea90>   DW_AT_decl_column : 25
    <bea91>   DW_AT_type        : <0xbe922>
    <bea95>   DW_AT_data_member_location: 40
 <2><bea96>: Abbrev Number: 2 (DW_TAG_member)
    <bea97>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <bea9b>   DW_AT_decl_file   : 8
    <bea9c>   DW_AT_decl_line   : 87
    <bea9d>   DW_AT_decl_column : 25
    <bea9e>   DW_AT_type        : <0xbe94c>
    <beaa2>   DW_AT_data_member_location: 48
 <2><beaa3>: Abbrev Number: 2 (DW_TAG_member)
    <beaa4>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <beaa8>   DW_AT_decl_file   : 8
    <beaa9>   DW_AT_decl_line   : 88
    <beaaa>   DW_AT_decl_column : 25
    <beaab>   DW_AT_type        : <0xbe976>
    <beaaf>   DW_AT_data_member_location: 56
 <2><beab0>: Abbrev Number: 2 (DW_TAG_member)
    <beab1>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <beab5>   DW_AT_decl_file   : 8
    <beab6>   DW_AT_decl_line   : 89
    <beab7>   DW_AT_decl_column : 25
    <beab8>   DW_AT_type        : <0xbe9a5>
    <beabc>   DW_AT_data_member_location: 64
 <2><beabd>: Abbrev Number: 2 (DW_TAG_member)
    <beabe>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <beac2>   DW_AT_decl_file   : 8
    <beac3>   DW_AT_decl_line   : 90
    <beac4>   DW_AT_decl_column : 25
    <beac5>   DW_AT_type        : <0xbe9cf>
    <beac9>   DW_AT_data_member_location: 72
 <2><beaca>: Abbrev Number: 2 (DW_TAG_member)
    <beacb>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <beacf>   DW_AT_decl_file   : 8
