    <81322>   DW_AT_type        : <0x81326>
 <1><81326>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <81327>   DW_AT_prototyped  : 1
    <81327>   DW_AT_type        : <0x81152>
    <8132b>   DW_AT_sibling     : <0x81349>
 <2><8132f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81330>   DW_AT_type        : <0x8131c>
 <2><81334>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81335>   DW_AT_type        : <0x8131c>
 <2><81339>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8133a>   DW_AT_type        : <0x8131c>
 <2><8133e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8133f>   DW_AT_type        : <0x8131c>
 <2><81343>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81344>   DW_AT_type        : <0x8131c>
 <2><81348>: Abbrev Number: 0
 <1><81349>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8134a>   DW_AT_byte_size   : 8
    <8134a>   DW_AT_type        : <0x812f7>
 <1><8134e>: Abbrev Number: 9 (DW_TAG_typedef)
    <8134f>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <81353>   DW_AT_decl_file   : 5
    <81354>   DW_AT_decl_line   : 13
    <81355>   DW_AT_decl_column : 30
    <81356>   DW_AT_type        : <0x8135a>
 <1><8135a>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <8135b>   DW_AT_prototyped  : 1
    <8135b>   DW_AT_type        : <0x81136>
    <8135f>   DW_AT_sibling     : <0x81373>
 <2><81363>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81364>   DW_AT_type        : <0x81136>
 <2><81368>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81369>   DW_AT_type        : <0x81136>
 <2><8136d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8136e>   DW_AT_type        : <0x8116a>
 <2><81372>: Abbrev Number: 0
 <1><81373>: Abbrev Number: 9 (DW_TAG_typedef)
    <81374>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <81378>   DW_AT_decl_file   : 5
    <81379>   DW_AT_decl_line   : 14
    <8137a>   DW_AT_decl_column : 15
    <8137b>   DW_AT_type        : <0x8137f>
 <1><8137f>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <81380>   DW_AT_prototyped  : 1
    <81380>   DW_AT_sibling     : <0x813b2>
 <2><81384>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81385>   DW_AT_type        : <0x813b2>
 <2><81389>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8138a>   DW_AT_type        : <0x813b2>
 <2><8138e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8138f>   DW_AT_type        : <0x81152>
 <2><81393>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81394>   DW_AT_type        : <0x81152>
 <2><81398>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81399>   DW_AT_type        : <0x81152>
 <2><8139d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8139e>   DW_AT_type        : <0x81152>
 <2><813a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <813a3>   DW_AT_type        : <0x81152>
 <2><813a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <813a8>   DW_AT_type        : <0x813b7>
 <2><813ac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <813ad>   DW_AT_type        : <0x8116a>
 <2><813b1>: Abbrev Number: 0
 <1><813b2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <813b3>   DW_AT_byte_size   : 8
    <813b3>   DW_AT_type        : <0x81123>
 <1><813b7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <813b8>   DW_AT_byte_size   : 8
    <813b8>   DW_AT_type        : <0x8134e>
 <1><813bc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <813bd>   DW_AT_byte_size   : 16
    <813be>   DW_AT_decl_file   : 5
    <813bf>   DW_AT_decl_line   : 26
    <813c0>   DW_AT_decl_column : 3
    <813c0>   DW_AT_sibling     : <0x813f9>
 <2><813c4>: Abbrev Number: 1 (DW_TAG_member)
    <813c5>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <813c9>   DW_AT_decl_file   : 5
    <813ca>   DW_AT_decl_line   : 27
    <813cb>   DW_AT_decl_column : 8
    <813cc>   DW_AT_type        : <0x81152>
    <813d0>   DW_AT_data_member_location: 0
 <2><813d1>: Abbrev Number: 1 (DW_TAG_member)
    <813d2>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <813d6>   DW_AT_decl_file   : 5
    <813d7>   DW_AT_decl_line   : 27
    <813d8>   DW_AT_decl_column : 16
    <813d9>   DW_AT_type        : <0x81152>
    <813dd>   DW_AT_data_member_location: 4
 <2><813de>: Abbrev Number: 1 (DW_TAG_member)
    <813df>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <813e3>   DW_AT_decl_file   : 5
    <813e4>   DW_AT_decl_line   : 27
    <813e5>   DW_AT_decl_column : 24
    <813e6>   DW_AT_type        : <0x81152>
    <813ea>   DW_AT_data_member_location: 8
 <2><813eb>: Abbrev Number: 1 (DW_TAG_member)
    <813ec>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <813f0>   DW_AT_decl_file   : 5
    <813f1>   DW_AT_decl_line   : 27
    <813f2>   DW_AT_decl_column : 32
    <813f3>   DW_AT_type        : <0x81152>
    <813f7>   DW_AT_data_member_location: 12
 <2><813f8>: Abbrev Number: 0
 <1><813f9>: Abbrev Number: 24 (DW_TAG_union_type)
    <813fa>   DW_AT_byte_size   : 16
    <813fa>   DW_AT_decl_file   : 5
    <813fb>   DW_AT_decl_line   : 25
    <813fc>   DW_AT_decl_column : 2
    <813fc>   DW_AT_sibling     : <0x81411>
 <2><81400>: Abbrev Number: 18 (DW_TAG_member)
    <81401>   DW_AT_type        : <0x813bc>
 <2><81405>: Abbrev Number: 25 (DW_TAG_member)
    <81406>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <8140a>   DW_AT_decl_file   : 5
    <8140b>   DW_AT_decl_line   : 29
    <8140c>   DW_AT_decl_column : 7
    <8140c>   DW_AT_type        : <0x81411>
 <2><81410>: Abbrev Number: 0
 <1><81411>: Abbrev Number: 30 (DW_TAG_array_type)
    <81412>   DW_AT_type        : <0x81152>
    <81416>   DW_AT_sibling     : <0x81421>
 <2><8141a>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <8141b>   DW_AT_type        : <0x8113d>
    <8141f>   DW_AT_upper_bound : 3
 <2><81420>: Abbrev Number: 0
 <1><81421>: Abbrev Number: 17 (DW_TAG_structure_type)
    <81422>   DW_AT_byte_size   : 16
    <81423>   DW_AT_decl_file   : 5
    <81424>   DW_AT_decl_line   : 32
    <81425>   DW_AT_decl_column : 3
    <81425>   DW_AT_sibling     : <0x8145e>
 <2><81429>: Abbrev Number: 1 (DW_TAG_member)
    <8142a>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <8142e>   DW_AT_decl_file   : 5
    <8142f>   DW_AT_decl_line   : 33
    <81430>   DW_AT_decl_column : 8
    <81431>   DW_AT_type        : <0x81152>
    <81435>   DW_AT_data_member_location: 0
 <2><81436>: Abbrev Number: 1 (DW_TAG_member)
    <81437>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <8143b>   DW_AT_decl_file   : 5
    <8143c>   DW_AT_decl_line   : 33
    <8143d>   DW_AT_decl_column : 20
    <8143e>   DW_AT_type        : <0x81152>
    <81442>   DW_AT_data_member_location: 4
 <2><81443>: Abbrev Number: 1 (DW_TAG_member)
    <81444>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <81448>   DW_AT_decl_file   : 5
    <81449>   DW_AT_decl_line   : 33
    <8144a>   DW_AT_decl_column : 32
    <8144b>   DW_AT_type        : <0x81152>
    <8144f>   DW_AT_data_member_location: 8
 <2><81450>: Abbrev Number: 1 (DW_TAG_member)
    <81451>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <81455>   DW_AT_decl_file   : 5
    <81456>   DW_AT_decl_line   : 33
    <81457>   DW_AT_decl_column : 44
    <81458>   DW_AT_type        : <0x81152>
    <8145c>   DW_AT_data_member_location: 12
 <2><8145d>: Abbrev Number: 0
 <1><8145e>: Abbrev Number: 24 (DW_TAG_union_type)
    <8145f>   DW_AT_byte_size   : 16
    <8145f>   DW_AT_decl_file   : 5
    <81460>   DW_AT_decl_line   : 31
    <81461>   DW_AT_decl_column : 2
    <81461>   DW_AT_sibling     : <0x81476>
 <2><81465>: Abbrev Number: 18 (DW_TAG_member)
    <81466>   DW_AT_type        : <0x81421>
 <2><8146a>: Abbrev Number: 25 (DW_TAG_member)
    <8146b>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <8146f>   DW_AT_decl_file   : 5
    <81470>   DW_AT_decl_line   : 35
    <81471>   DW_AT_decl_column : 7
    <81471>   DW_AT_type        : <0x81411>
 <2><81475>: Abbrev Number: 0
 <1><81476>: Abbrev Number: 14 (DW_TAG_structure_type)
    <81477>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <8147b>   DW_AT_byte_size   : 216
    <8147c>   DW_AT_decl_file   : 5
    <8147d>   DW_AT_decl_line   : 16
    <8147e>   DW_AT_decl_column : 16
    <8147f>   DW_AT_sibling     : <0x81593>
 <2><81483>: Abbrev Number: 6 (DW_TAG_member)
    <81484>   DW_AT_name        : id
    <81487>   DW_AT_decl_file   : 5
    <81488>   DW_AT_decl_line   : 17
    <81489>   DW_AT_decl_column : 6
    <8148a>   DW_AT_type        : <0x81152>
    <8148e>   DW_AT_data_member_location: 0
 <2><8148f>: Abbrev Number: 1 (DW_TAG_member)
    <81490>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <81494>   DW_AT_decl_file   : 5
    <81495>   DW_AT_decl_line   : 18
    <81496>   DW_AT_decl_column : 6
    <81497>   DW_AT_type        : <0x81152>
    <8149b>   DW_AT_data_member_location: 4
 <2><8149c>: Abbrev Number: 1 (DW_TAG_member)
    <8149d>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <814a1>   DW_AT_decl_file   : 5
    <814a2>   DW_AT_decl_line   : 19
    <814a3>   DW_AT_decl_column : 18
    <814a4>   DW_AT_type        : <0x81593>
    <814a8>   DW_AT_data_member_location: 8
 <2><814a9>: Abbrev Number: 1 (DW_TAG_member)
    <814aa>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <814ae>   DW_AT_decl_file   : 5
    <814af>   DW_AT_decl_line   : 20
    <814b0>   DW_AT_decl_column : 6
    <814b1>   DW_AT_type        : <0x81152>
    <814b5>   DW_AT_data_member_location: 16
 <2><814b6>: Abbrev Number: 1 (DW_TAG_member)
    <814b7>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <814bb>   DW_AT_decl_file   : 5
    <814bc>   DW_AT_decl_line   : 21
    <814bd>   DW_AT_decl_column : 6
    <814be>   DW_AT_type        : <0x81152>
    <814c2>   DW_AT_data_member_location: 20
 <2><814c3>: Abbrev Number: 1 (DW_TAG_member)
    <814c4>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <814c8>   DW_AT_decl_file   : 5
    <814c9>   DW_AT_decl_line   : 22
    <814ca>   DW_AT_decl_column : 6
    <814cb>   DW_AT_type        : <0x81152>
    <814cf>   DW_AT_data_member_location: 24
 <2><814d0>: Abbrev Number: 1 (DW_TAG_member)
    <814d1>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <814d5>   DW_AT_decl_file   : 5
    <814d6>   DW_AT_decl_line   : 23
    <814d7>   DW_AT_decl_column : 8
    <814d8>   DW_AT_type        : <0x8116a>
    <814dc>   DW_AT_data_member_location: 32
 <2><814dd>: Abbrev Number: 1 (DW_TAG_member)
    <814de>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <814e2>   DW_AT_decl_file   : 5
    <814e3>   DW_AT_decl_line   : 24
    <814e4>   DW_AT_decl_column : 8
    <814e5>   DW_AT_type        : <0x81237>
    <814e9>   DW_AT_data_member_location: 40
 <2><814ea>: Abbrev Number: 1 (DW_TAG_member)
    <814eb>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <814ef>   DW_AT_decl_file   : 5
    <814f0>   DW_AT_decl_line   : 24
    <814f1>   DW_AT_decl_column : 16
    <814f2>   DW_AT_type        : <0x81237>
    <814f6>   DW_AT_data_member_location: 44
 <2><814f7>: Abbrev Number: 26 (DW_TAG_member)
    <814f8>   DW_AT_type        : <0x813f9>
    <814fc>   DW_AT_data_member_location: 48
 <2><814fd>: Abbrev Number: 26 (DW_TAG_member)
    <814fe>   DW_AT_type        : <0x8145e>
    <81502>   DW_AT_data_member_location: 64
 <2><81503>: Abbrev Number: 1 (DW_TAG_member)
    <81504>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <81508>   DW_AT_decl_file   : 5
    <81509>   DW_AT_decl_line   : 37
    <8150a>   DW_AT_decl_column : 8
    <8150b>   DW_AT_type        : <0x81237>
    <8150f>   DW_AT_data_member_location: 80
 <2><81510>: Abbrev Number: 1 (DW_TAG_member)
    <81511>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <81515>   DW_AT_decl_file   : 5
    <81516>   DW_AT_decl_line   : 37
    <81517>   DW_AT_decl_column : 15
    <81518>   DW_AT_type        : <0x81237>
    <8151c>   DW_AT_data_member_location: 84
 <2><8151d>: Abbrev Number: 1 (DW_TAG_member)
    <8151e>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <81522>   DW_AT_decl_file   : 5
    <81523>   DW_AT_decl_line   : 37
    <81524>   DW_AT_decl_column : 22
    <81525>   DW_AT_type        : <0x81237>
    <81529>   DW_AT_data_member_location: 88
 <2><8152a>: Abbrev Number: 1 (DW_TAG_member)
    <8152b>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <8152f>   DW_AT_decl_file   : 5
    <81530>   DW_AT_decl_line   : 37
    <81531>   DW_AT_decl_column : 29
    <81532>   DW_AT_type        : <0x81237>
    <81536>   DW_AT_data_member_location: 92
 <2><81537>: Abbrev Number: 1 (DW_TAG_member)
    <81538>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <8153c>   DW_AT_decl_file   : 5
    <8153d>   DW_AT_decl_line   : 38
    <8153e>   DW_AT_decl_column : 15
    <8153f>   DW_AT_type        : <0x81136>
    <81543>   DW_AT_data_member_location: 96
 <2><81544>: Abbrev Number: 1 (DW_TAG_member)
    <81545>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <81549>   DW_AT_decl_file   : 5
    <8154a>   DW_AT_decl_line   : 38
    <8154b>   DW_AT_decl_column : 25
    <8154c>   DW_AT_type        : <0x81136>
    <81550>   DW_AT_data_member_location: 100
 <2><81551>: Abbrev Number: 1 (DW_TAG_member)
    <81552>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <81556>   DW_AT_decl_file   : 5
    <81557>   DW_AT_decl_line   : 39
    <81558>   DW_AT_decl_column : 9
    <81559>   DW_AT_type        : <0x815b7>
    <8155d>   DW_AT_data_member_location: 104
 <2><8155e>: Abbrev Number: 1 (DW_TAG_member)
    <8155f>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <81563>   DW_AT_decl_file   : 5
    <81564>   DW_AT_decl_line   : 40
    <81565>   DW_AT_decl_column : 17
    <81566>   DW_AT_type        : <0x815d5>
    <8156a>   DW_AT_data_member_location: 112
 <2><8156b>: Abbrev Number: 1 (DW_TAG_member)
    <8156c>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <81570>   DW_AT_decl_file   : 5
    <81571>   DW_AT_decl_line   : 41
    <81572>   DW_AT_decl_column : 10
    <81573>   DW_AT_type        : <0x815f3>
    <81577>   DW_AT_data_member_location: 120
 <2><81578>: Abbrev Number: 1 (DW_TAG_member)
    <81579>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <8157d>   DW_AT_decl_file   : 5
    <8157e>   DW_AT_decl_line   : 42
    <8157f>   DW_AT_decl_column : 11
    <81580>   DW_AT_type        : <0x815f8>
    <81584>   DW_AT_data_member_location: 128
 <2><81585>: Abbrev Number: 1 (DW_TAG_member)
    <81586>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8158a>   DW_AT_decl_file   : 5
    <8158b>   DW_AT_decl_line   : 43
    <8158c>   DW_AT_decl_column : 6
    <8158d>   DW_AT_type        : <0x81152>
    <81591>   DW_AT_data_member_location: 208
 <2><81592>: Abbrev Number: 0
 <1><81593>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81594>   DW_AT_byte_size   : 8
    <81594>   DW_AT_type        : <0x813b2>
 <1><81598>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <81599>   DW_AT_prototyped  : 1
    <81599>   DW_AT_sibling     : <0x815b2>
 <2><8159d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8159e>   DW_AT_type        : <0x815b2>
 <2><815a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815a3>   DW_AT_type        : <0x81152>
 <2><815a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815a8>   DW_AT_type        : <0x81152>
 <2><815ac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815ad>   DW_AT_type        : <0x81136>
 <2><815b1>: Abbrev Number: 0
 <1><815b2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <815b3>   DW_AT_byte_size   : 8
    <815b3>   DW_AT_type        : <0x81476>
 <1><815b7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <815b8>   DW_AT_byte_size   : 8
    <815b8>   DW_AT_type        : <0x81598>
 <1><815bc>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <815bd>   DW_AT_prototyped  : 1
    <815bd>   DW_AT_type        : <0x81136>
    <815c1>   DW_AT_sibling     : <0x815d5>
 <2><815c5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815c6>   DW_AT_type        : <0x815b2>
 <2><815ca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815cb>   DW_AT_type        : <0x81152>
 <2><815cf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815d0>   DW_AT_type        : <0x81152>
 <2><815d4>: Abbrev Number: 0
 <1><815d5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <815d6>   DW_AT_byte_size   : 8
    <815d6>   DW_AT_type        : <0x815bc>
 <1><815da>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <815db>   DW_AT_prototyped  : 1
    <815db>   DW_AT_type        : <0x8116a>
    <815df>   DW_AT_sibling     : <0x815f3>
 <2><815e3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815e4>   DW_AT_type        : <0x8116a>
 <2><815e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815e9>   DW_AT_type        : <0x81152>
 <2><815ed>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <815ee>   DW_AT_type        : <0x81178>
 <2><815f2>: Abbrev Number: 0
 <1><815f3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <815f4>   DW_AT_byte_size   : 8
    <815f4>   DW_AT_type        : <0x815da>
 <1><815f8>: Abbrev Number: 30 (DW_TAG_array_type)
    <815f9>   DW_AT_type        : <0x81608>
    <815fd>   DW_AT_sibling     : <0x81608>
 <2><81601>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <81602>   DW_AT_type        : <0x8113d>
    <81606>   DW_AT_upper_bound : 9
 <2><81607>: Abbrev Number: 0
 <1><81608>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81609>   DW_AT_byte_size   : 8
    <81609>   DW_AT_type        : <0x8160d>
 <1><8160d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8160e>   DW_AT_byte_size   : 8
    <8160e>   DW_AT_type        : <0x81373>
 <1><81612>: Abbrev Number: 9 (DW_TAG_typedef)
    <81613>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <81617>   DW_AT_decl_file   : 5
    <81618>   DW_AT_decl_line   : 44
    <81619>   DW_AT_decl_column : 3
    <8161a>   DW_AT_type        : <0x81476>
 <1><8161e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <8161f>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <81623>   DW_AT_byte_size   : 12
    <81624>   DW_AT_decl_file   : 6
    <81625>   DW_AT_decl_line   : 139
    <81626>   DW_AT_decl_column : 16
    <81627>   DW_AT_sibling     : <0x81650>
 <2><8162b>: Abbrev Number: 6 (DW_TAG_member)
    <8162c>   DW_AT_name        : ch
    <8162f>   DW_AT_decl_file   : 6
    <81630>   DW_AT_decl_line   : 140
    <81631>   DW_AT_decl_column : 14
    <81632>   DW_AT_type        : <0x81184>
    <81636>   DW_AT_data_member_location: 0
 <2><81637>: Abbrev Number: 6 (DW_TAG_member)
    <81638>   DW_AT_name        : fg
    <8163b>   DW_AT_decl_file   : 6
    <8163c>   DW_AT_decl_line   : 141
    <8163d>   DW_AT_decl_column : 14
    <8163e>   DW_AT_type        : <0x81136>
    <81642>   DW_AT_data_member_location: 4
 <2><81643>: Abbrev Number: 6 (DW_TAG_member)
    <81644>   DW_AT_name        : bg
    <81647>   DW_AT_decl_file   : 6
    <81648>   DW_AT_decl_line   : 141
    <81649>   DW_AT_decl_column : 18
    <8164a>   DW_AT_type        : <0x81136>
    <8164e>   DW_AT_data_member_location: 8
 <2><8164f>: Abbrev Number: 0
 <1><81650>: Abbrev Number: 9 (DW_TAG_typedef)
    <81651>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <81655>   DW_AT_decl_file   : 6
    <81656>   DW_AT_decl_line   : 142
    <81657>   DW_AT_decl_column : 3
    <81658>   DW_AT_type        : <0x8161e>
 <1><8165c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <8165d>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <81661>   DW_AT_byte_size   : 208
    <81662>   DW_AT_decl_file   : 6
    <81663>   DW_AT_decl_line   : 144
    <81664>   DW_AT_decl_column : 16
    <81665>   DW_AT_sibling     : <0x8181f>
 <2><81669>: Abbrev Number: 6 (DW_TAG_member)
    <8166a>   DW_AT_name        : id
    <8166d>   DW_AT_decl_file   : 6
    <8166e>   DW_AT_decl_line   : 146
    <8166f>   DW_AT_decl_column : 6
    <81670>   DW_AT_type        : <0x81152>
    <81674>   DW_AT_data_member_location: 0
 <2><81675>: Abbrev Number: 1 (DW_TAG_member)
    <81676>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <8167a>   DW_AT_decl_file   : 6
    <8167b>   DW_AT_decl_line   : 147
    <8167c>   DW_AT_decl_column : 9
    <8167d>   DW_AT_type        : <0x81152>
    <81681>   DW_AT_data_member_location: 4
 <2><81682>: Abbrev Number: 1 (DW_TAG_member)
    <81683>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <81687>   DW_AT_decl_file   : 6
    <81688>   DW_AT_decl_line   : 148
    <81689>   DW_AT_decl_column : 21
    <8168a>   DW_AT_type        : <0x81593>
    <8168e>   DW_AT_data_member_location: 8
 <2><8168f>: Abbrev Number: 1 (DW_TAG_member)
    <81690>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <81694>   DW_AT_decl_file   : 6
    <81695>   DW_AT_decl_line   : 149
    <81696>   DW_AT_decl_column : 9
    <81697>   DW_AT_type        : <0x81152>
    <8169b>   DW_AT_data_member_location: 16
 <2><8169c>: Abbrev Number: 1 (DW_TAG_member)
    <8169d>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <816a1>   DW_AT_decl_file   : 6
    <816a2>   DW_AT_decl_line   : 150
    <816a3>   DW_AT_decl_column : 9
    <816a4>   DW_AT_type        : <0x81152>
    <816a8>   DW_AT_data_member_location: 20
 <2><816a9>: Abbrev Number: 1 (DW_TAG_member)
    <816aa>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <816ae>   DW_AT_decl_file   : 6
    <816af>   DW_AT_decl_line   : 151
    <816b0>   DW_AT_decl_column : 20
    <816b1>   DW_AT_type        : <0x813b2>
    <816b5>   DW_AT_data_member_location: 24
 <2><816b6>: Abbrev Number: 6 (DW_TAG_member)
    <816b7>   DW_AT_name        : w
    <816b9>   DW_AT_decl_file   : 6
    <816ba>   DW_AT_decl_line   : 152
    <816bb>   DW_AT_decl_column : 9
    <816bc>   DW_AT_type        : <0x81152>
    <816c0>   DW_AT_data_member_location: 32
 <2><816c1>: Abbrev Number: 6 (DW_TAG_member)
    <816c2>   DW_AT_name        : h
    <816c4>   DW_AT_decl_file   : 6
    <816c5>   DW_AT_decl_line   : 152
    <816c6>   DW_AT_decl_column : 12
    <816c7>   DW_AT_type        : <0x81152>
    <816cb>   DW_AT_data_member_location: 36
 <2><816cc>: Abbrev Number: 1 (DW_TAG_member)
    <816cd>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <816d1>   DW_AT_decl_file   : 6
    <816d2>   DW_AT_decl_line   : 153
    <816d3>   DW_AT_decl_column : 9
    <816d4>   DW_AT_type        : <0x81152>
    <816d8>   DW_AT_data_member_location: 40
 <2><816d9>: Abbrev Number: 6 (DW_TAG_member)
    <816da>   DW_AT_name        : bpp
    <816de>   DW_AT_decl_file   : 6
    <816df>   DW_AT_decl_line   : 154
    <816e0>   DW_AT_decl_column : 9
    <816e1>   DW_AT_type        : <0x81152>
    <816e5>   DW_AT_data_member_location: 44
 <2><816e6>: Abbrev Number: 1 (DW_TAG_member)
    <816e7>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <816eb>   DW_AT_decl_file   : 6
    <816ec>   DW_AT_decl_line   : 155
    <816ed>   DW_AT_decl_column : 9
    <816ee>   DW_AT_type        : <0x81152>
    <816f2>   DW_AT_data_member_location: 48
 <2><816f3>: Abbrev Number: 1 (DW_TAG_member)
    <816f4>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <816f8>   DW_AT_decl_file   : 6
    <816f9>   DW_AT_decl_line   : 156
    <816fa>   DW_AT_decl_column : 19
    <816fb>   DW_AT_type        : <0x8181f>
    <816ff>   DW_AT_data_member_location: 56
 <2><81700>: Abbrev Number: 1 (DW_TAG_member)
    <81701>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <81705>   DW_AT_decl_file   : 6
    <81706>   DW_AT_decl_line   : 157
    <81707>   DW_AT_decl_column : 19
    <81708>   DW_AT_type        : <0x8181f>
    <8170c>   DW_AT_data_member_location: 64
 <2><8170d>: Abbrev Number: 1 (DW_TAG_member)
    <8170e>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <81712>   DW_AT_decl_file   : 6
    <81713>   DW_AT_decl_line   : 158
    <81714>   DW_AT_decl_column : 20
    <81715>   DW_AT_type        : <0x813b2>
    <81719>   DW_AT_data_member_location: 72
 <2><8171a>: Abbrev Number: 1 (DW_TAG_member)
    <8171b>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <8171f>   DW_AT_decl_file   : 6
    <81720>   DW_AT_decl_line   : 159
    <81721>   DW_AT_decl_column : 11
    <81722>   DW_AT_type        : <0x8116c>
    <81726>   DW_AT_data_member_location: 80
 <2><81727>: Abbrev Number: 1 (DW_TAG_member)
    <81728>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <8172c>   DW_AT_decl_file   : 6
    <8172d>   DW_AT_decl_line   : 160
    <8172e>   DW_AT_decl_column : 29
    <8172f>   DW_AT_type        : <0x818ed>
    <81733>   DW_AT_data_member_location: 88
 <2><81734>: Abbrev Number: 1 (DW_TAG_member)
    <81735>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <81739>   DW_AT_decl_file   : 6
    <8173a>   DW_AT_decl_line   : 161
    <8173b>   DW_AT_decl_column : 9
    <8173c>   DW_AT_type        : <0x81152>
    <81740>   DW_AT_data_member_location: 96
 <2><81741>: Abbrev Number: 1 (DW_TAG_member)
    <81742>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <81746>   DW_AT_decl_file   : 6
    <81747>   DW_AT_decl_line   : 162
    <81748>   DW_AT_decl_column : 27
    <81749>   DW_AT_type        : <0x8191d>
    <8174d>   DW_AT_data_member_location: 104
 <2><8174e>: Abbrev Number: 1 (DW_TAG_member)
    <8174f>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <81753>   DW_AT_decl_file   : 6
    <81754>   DW_AT_decl_line   : 163
    <81755>   DW_AT_decl_column : 9
    <81756>   DW_AT_type        : <0x81152>
    <8175a>   DW_AT_data_member_location: 112
 <2><8175b>: Abbrev Number: 1 (DW_TAG_member)
    <8175c>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <81760>   DW_AT_decl_file   : 6
    <81761>   DW_AT_decl_line   : 164
    <81762>   DW_AT_decl_column : 9
    <81763>   DW_AT_type        : <0x81152>
    <81767>   DW_AT_data_member_location: 116
 <2><81768>: Abbrev Number: 1 (DW_TAG_member)
    <81769>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <8176d>   DW_AT_decl_file   : 6
    <8176e>   DW_AT_decl_line   : 164
    <8176f>   DW_AT_decl_column : 19
    <81770>   DW_AT_type        : <0x81152>
    <81774>   DW_AT_data_member_location: 120
 <2><81775>: Abbrev Number: 1 (DW_TAG_member)
    <81776>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <8177a>   DW_AT_decl_file   : 6
    <8177b>   DW_AT_decl_line   : 165
    <8177c>   DW_AT_decl_column : 24
    <8177d>   DW_AT_type        : <0x81954>
    <81781>   DW_AT_data_member_location: 128
 <2><81782>: Abbrev Number: 1 (DW_TAG_member)
    <81783>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <81787>   DW_AT_decl_file   : 6
    <81788>   DW_AT_decl_line   : 166
    <81789>   DW_AT_decl_column : 9
    <8178a>   DW_AT_type        : <0x81152>
    <8178e>   DW_AT_data_member_location: 136
 <2><8178f>: Abbrev Number: 1 (DW_TAG_member)
    <81790>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <81794>   DW_AT_decl_file   : 6
    <81795>   DW_AT_decl_line   : 166
    <81796>   DW_AT_decl_column : 17
    <81797>   DW_AT_type        : <0x81152>
    <8179b>   DW_AT_data_member_location: 140
 <2><8179c>: Abbrev Number: 1 (DW_TAG_member)
    <8179d>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <817a1>   DW_AT_decl_file   : 6
    <817a2>   DW_AT_decl_line   : 167
    <817a3>   DW_AT_decl_column : 11
    <817a4>   DW_AT_type        : <0x81237>
    <817a8>   DW_AT_data_member_location: 144
 <2><817a9>: Abbrev Number: 6 (DW_TAG_member)
    <817aa>   DW_AT_name        : key
    <817ae>   DW_AT_decl_file   : 6
    <817af>   DW_AT_decl_line   : 168
    <817b0>   DW_AT_decl_column : 11
    <817b1>   DW_AT_type        : <0x8116c>
    <817b5>   DW_AT_data_member_location: 152
 <2><817b6>: Abbrev Number: 1 (DW_TAG_member)
    <817b7>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <817bb>   DW_AT_decl_file   : 6
    <817bc>   DW_AT_decl_line   : 169
    <817bd>   DW_AT_decl_column : 6
    <817be>   DW_AT_type        : <0x81152>
    <817c2>   DW_AT_data_member_location: 160
 <2><817c3>: Abbrev Number: 1 (DW_TAG_member)
    <817c4>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <817c8>   DW_AT_decl_file   : 6
    <817c9>   DW_AT_decl_line   : 170
    <817ca>   DW_AT_decl_column : 18
    <817cb>   DW_AT_type        : <0x81959>
    <817cf>   DW_AT_data_member_location: 168
 <2><817d0>: Abbrev Number: 1 (DW_TAG_member)
    <817d1>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <817d5>   DW_AT_decl_file   : 6
    <817d6>   DW_AT_decl_line   : 171
    <817d7>   DW_AT_decl_column : 12
    <817d8>   DW_AT_type        : <0x81349>
    <817dc>   DW_AT_data_member_location: 176
 <2><817dd>: Abbrev Number: 1 (DW_TAG_member)
    <817de>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <817e2>   DW_AT_decl_file   : 6
    <817e3>   DW_AT_decl_line   : 172
    <817e4>   DW_AT_decl_column : 9
    <817e5>   DW_AT_type        : <0x81152>
    <817e9>   DW_AT_data_member_location: 184
 <2><817ea>: Abbrev Number: 1 (DW_TAG_member)
    <817eb>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <817ef>   DW_AT_decl_file   : 6
    <817f0>   DW_AT_decl_line   : 172
    <817f1>   DW_AT_decl_column : 21
    <817f2>   DW_AT_type        : <0x81152>
    <817f6>   DW_AT_data_member_location: 188
 <2><817f7>: Abbrev Number: 1 (DW_TAG_member)
    <817f8>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <817fc>   DW_AT_decl_file   : 6
    <817fd>   DW_AT_decl_line   : 173
    <817fe>   DW_AT_decl_column : 11
    <817ff>   DW_AT_type        : <0x81963>
    <81803>   DW_AT_data_member_location: 192
 <2><81804>: Abbrev Number: 1 (DW_TAG_member)
    <81805>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <81809>   DW_AT_decl_file   : 6
    <8180a>   DW_AT_decl_line   : 174
    <8180b>   DW_AT_decl_column : 15
    <8180c>   DW_AT_type        : <0x81159>
    <81810>   DW_AT_data_member_location: 200
 <2><81811>: Abbrev Number: 1 (DW_TAG_member)
    <81812>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <81816>   DW_AT_decl_file   : 6
    <81817>   DW_AT_decl_line   : 175
    <81818>   DW_AT_decl_column : 6
    <81819>   DW_AT_type        : <0x81152>
    <8181d>   DW_AT_data_member_location: 204
 <2><8181e>: Abbrev Number: 0
 <1><8181f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81820>   DW_AT_byte_size   : 8
    <81820>   DW_AT_type        : <0x81136>
 <1><81824>: Abbrev Number: 14 (DW_TAG_structure_type)
    <81825>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <81829>   DW_AT_byte_size   : 112
    <8182a>   DW_AT_decl_file   : 6
    <8182b>   DW_AT_decl_line   : 178
    <8182c>   DW_AT_decl_column : 16
    <8182d>   DW_AT_sibling     : <0x818e8>
 <2><81831>: Abbrev Number: 1 (DW_TAG_member)
    <81832>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <81836>   DW_AT_decl_file   : 6
    <81837>   DW_AT_decl_line   : 188
    <81838>   DW_AT_decl_column : 8
    <81839>   DW_AT_type        : <0x8116c>
    <8183d>   DW_AT_data_member_location: 0
 <2><8183e>: Abbrev Number: 1 (DW_TAG_member)
    <8183f>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <81843>   DW_AT_decl_file   : 6
    <81844>   DW_AT_decl_line   : 208
    <81845>   DW_AT_decl_column : 8
    <81846>   DW_AT_type        : <0x8199c>
    <8184a>   DW_AT_data_member_location: 8
 <2><8184b>: Abbrev Number: 1 (DW_TAG_member)
    <8184c>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <81850>   DW_AT_decl_file   : 6
    <81851>   DW_AT_decl_line   : 222
    <81852>   DW_AT_decl_column : 9
    <81853>   DW_AT_type        : <0x8122a>
    <81857>   DW_AT_data_member_location: 16
 <2><81858>: Abbrev Number: 1 (DW_TAG_member)
    <81859>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <8185d>   DW_AT_decl_file   : 6
    <8185e>   DW_AT_decl_line   : 231
    <8185f>   DW_AT_decl_column : 9
    <81860>   DW_AT_type        : <0x8122a>
    <81864>   DW_AT_data_member_location: 24
 <2><81865>: Abbrev Number: 1 (DW_TAG_member)
    <81866>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <8186a>   DW_AT_decl_file   : 6
    <8186b>   DW_AT_decl_line   : 239
    <8186c>   DW_AT_decl_column : 9
    <8186d>   DW_AT_type        : <0x8122a>
    <81871>   DW_AT_data_member_location: 32
 <2><81872>: Abbrev Number: 1 (DW_TAG_member)
    <81873>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <81877>   DW_AT_decl_file   : 6
    <81878>   DW_AT_decl_line   : 248
    <81879>   DW_AT_decl_column : 9
    <8187a>   DW_AT_type        : <0x819bb>
    <8187e>   DW_AT_data_member_location: 40
 <2><8187f>: Abbrev Number: 8 (DW_TAG_member)
    <81880>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <81884>   DW_AT_decl_file   : 6
    <81884>   DW_AT_decl_line   : 258
    <81886>   DW_AT_decl_column : 9
    <81887>   DW_AT_type        : <0x8122a>
    <8188b>   DW_AT_data_member_location: 48
 <2><8188c>: Abbrev Number: 8 (DW_TAG_member)
    <8188d>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <81891>   DW_AT_decl_file   : 6
    <81891>   DW_AT_decl_line   : 274
    <81893>   DW_AT_decl_column : 8
    <81894>   DW_AT_type        : <0x81321>
    <81898>   DW_AT_data_member_location: 56
 <2><81899>: Abbrev Number: 8 (DW_TAG_member)
    <8189a>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <8189e>   DW_AT_decl_file   : 6
    <8189e>   DW_AT_decl_line   : 285
    <818a0>   DW_AT_decl_column : 9
    <818a1>   DW_AT_type        : <0x819bb>
    <818a5>   DW_AT_data_member_location: 64
 <2><818a6>: Abbrev Number: 8 (DW_TAG_member)
    <818a7>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <818ab>   DW_AT_decl_file   : 6
    <818ab>   DW_AT_decl_line   : 293
    <818ad>   DW_AT_decl_column : 9
    <818ae>   DW_AT_type        : <0x819cb>
    <818b2>   DW_AT_data_member_location: 72
 <2><818b3>: Abbrev Number: 8 (DW_TAG_member)
    <818b4>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <818b8>   DW_AT_decl_file   : 6
    <818b8>   DW_AT_decl_line   : 301
    <818ba>   DW_AT_decl_column : 8
    <818bb>   DW_AT_type        : <0x81303>
    <818bf>   DW_AT_data_member_location: 80
 <2><818c0>: Abbrev Number: 8 (DW_TAG_member)
    <818c1>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <818c5>   DW_AT_decl_file   : 6
    <818c5>   DW_AT_decl_line   : 314
    <818c7>   DW_AT_decl_column : 9
    <818c8>   DW_AT_type        : <0x819e4>
    <818cc>   DW_AT_data_member_location: 88
 <2><818cd>: Abbrev Number: 8 (DW_TAG_member)
    <818ce>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <818d2>   DW_AT_decl_file   : 6
    <818d2>   DW_AT_decl_line   : 321
    <818d4>   DW_AT_decl_column : 9
    <818d5>   DW_AT_type        : <0x8122a>
    <818d9>   DW_AT_data_member_location: 96
 <2><818da>: Abbrev Number: 8 (DW_TAG_member)
    <818db>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <818df>   DW_AT_decl_file   : 6
    <818df>   DW_AT_decl_line   : 328
    <818e1>   DW_AT_decl_column : 9
    <818e2>   DW_AT_type        : <0x8122a>
    <818e6>   DW_AT_data_member_location: 104
 <2><818e7>: Abbrev Number: 0
 <1><818e8>: Abbrev Number: 15 (DW_TAG_const_type)
    <818e9>   DW_AT_type        : <0x81824>
 <1><818ed>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <818ee>   DW_AT_byte_size   : 8
    <818ee>   DW_AT_type        : <0x818e8>
 <1><818f2>: Abbrev Number: 32 (DW_TAG_structure_type)
    <818f3>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <818f7>   DW_AT_byte_size   : 16
    <818f7>   DW_AT_decl_file   : 6
    <818f7>   DW_AT_decl_line   : 331
    <818f9>   DW_AT_decl_column : 16
    <818f9>   DW_AT_sibling     : <0x81918>
 <2><818fd>: Abbrev Number: 8 (DW_TAG_member)
    <818fe>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <81902>   DW_AT_decl_file   : 6
    <81902>   DW_AT_decl_line   : 333
    <81904>   DW_AT_decl_column : 12
    <81905>   DW_AT_type        : <0x8115e>
    <81909>   DW_AT_data_member_location: 0
 <2><8190a>: Abbrev Number: 8 (DW_TAG_member)
    <8190b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8190f>   DW_AT_decl_file   : 6
    <8190f>   DW_AT_decl_line   : 334
    <81911>   DW_AT_decl_column : 23
    <81912>   DW_AT_type        : <0x819e9>
    <81916>   DW_AT_data_member_location: 8
 <2><81917>: Abbrev Number: 0
 <1><81918>: Abbrev Number: 15 (DW_TAG_const_type)
    <81919>   DW_AT_type        : <0x818f2>
 <1><8191d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8191e>   DW_AT_byte_size   : 8
    <8191e>   DW_AT_type        : <0x81918>
 <1><81922>: Abbrev Number: 32 (DW_TAG_structure_type)
    <81923>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <81927>   DW_AT_byte_size   : 16
    <81927>   DW_AT_decl_file   : 6
    <81927>   DW_AT_decl_line   : 337
    <81929>   DW_AT_decl_column : 16
    <81929>   DW_AT_sibling     : <0x8194f>
 <2><8192d>: Abbrev Number: 33 (DW_TAG_member)
    <8192e>   DW_AT_name        : w
    <81930>   DW_AT_decl_file   : 6
    <81930>   DW_AT_decl_line   : 339
    <81932>   DW_AT_decl_column : 15
    <81932>   DW_AT_type        : <0x8115e>
    <81936>   DW_AT_data_member_location: 0
 <2><81937>: Abbrev Number: 33 (DW_TAG_member)
    <81938>   DW_AT_name        : h
    <8193a>   DW_AT_decl_file   : 6
    <8193a>   DW_AT_decl_line   : 340
    <8193c>   DW_AT_decl_column : 15
    <8193c>   DW_AT_type        : <0x8115e>
    <81940>   DW_AT_data_member_location: 4
 <2><81941>: Abbrev Number: 8 (DW_TAG_member)
    <81942>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <81946>   DW_AT_decl_file   : 6
    <81946>   DW_AT_decl_line   : 341
    <81948>   DW_AT_decl_column : 23
    <81949>   DW_AT_type        : <0x819e9>
    <8194d>   DW_AT_data_member_location: 8
 <2><8194e>: Abbrev Number: 0
 <1><8194f>: Abbrev Number: 15 (DW_TAG_const_type)
    <81950>   DW_AT_type        : <0x81922>
 <1><81954>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81955>   DW_AT_byte_size   : 8
    <81955>   DW_AT_type        : <0x8194f>
 <1><81959>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8195a>   DW_AT_byte_size   : 8
    <8195a>   DW_AT_type        : <0x8195e>
 <1><8195e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8195f>   DW_AT_byte_size   : 8
    <8195f>   DW_AT_type        : <0x81650>
 <1><81963>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81964>   DW_AT_byte_size   : 8
    <81964>   DW_AT_type        : <0x8123e>
 <1><81968>: Abbrev Number: 9 (DW_TAG_typedef)
    <81969>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <8196d>   DW_AT_decl_file   : 6
    <8196e>   DW_AT_decl_line   : 176
    <8196f>   DW_AT_decl_column : 3
    <81970>   DW_AT_type        : <0x8165c>
 <1><81974>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <81975>   DW_AT_prototyped  : 1
    <81975>   DW_AT_type        : <0x81152>
    <81979>   DW_AT_sibling     : <0x8199c>
 <2><8197d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8197e>   DW_AT_type        : <0x8116c>
 <2><81982>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81983>   DW_AT_type        : <0x81152>
 <2><81987>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81988>   DW_AT_type        : <0x81152>
 <2><8198c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8198d>   DW_AT_type        : <0x81152>
 <2><81991>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81992>   DW_AT_type        : <0x81152>
 <2><81996>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81997>   DW_AT_type        : <0x81152>
 <2><8199b>: Abbrev Number: 0
 <1><8199c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8199d>   DW_AT_byte_size   : 8
    <8199d>   DW_AT_type        : <0x81974>
 <1><819a1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <819a2>   DW_AT_prototyped  : 1
    <819a2>   DW_AT_sibling     : <0x819bb>
 <2><819a6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819a7>   DW_AT_type        : <0x81152>
 <2><819ab>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819ac>   DW_AT_type        : <0x81152>
 <2><819b0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819b1>   DW_AT_type        : <0x81152>
 <2><819b5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819b6>   DW_AT_type        : <0x81152>
 <2><819ba>: Abbrev Number: 0
 <1><819bb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <819bc>   DW_AT_byte_size   : 8
    <819bc>   DW_AT_type        : <0x819a1>
 <1><819c0>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <819c1>   DW_AT_prototyped  : 1
    <819c1>   DW_AT_sibling     : <0x819cb>
 <2><819c5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819c6>   DW_AT_type        : <0x8116c>
 <2><819ca>: Abbrev Number: 0
 <1><819cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <819cc>   DW_AT_byte_size   : 8
    <819cc>   DW_AT_type        : <0x819c0>
 <1><819d0>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <819d1>   DW_AT_prototyped  : 1
    <819d1>   DW_AT_type        : <0x8131c>
    <819d5>   DW_AT_sibling     : <0x819e4>
 <2><819d9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819da>   DW_AT_type        : <0x81152>
 <2><819de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819df>   DW_AT_type        : <0x8131c>
 <2><819e3>: Abbrev Number: 0
 <1><819e4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <819e5>   DW_AT_byte_size   : 8
    <819e5>   DW_AT_type        : <0x819d0>
 <1><819e9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <819ea>   DW_AT_byte_size   : 8
    <819ea>   DW_AT_type        : <0x8112a>
 <1><819ee>: Abbrev Number: 27 (DW_TAG_variable)
    <819ef>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <819f3>   DW_AT_decl_file   : 6
    <819f3>   DW_AT_decl_line   : 364
    <819f5>   DW_AT_decl_column : 15
    <819f6>   DW_AT_type        : <0x819fa>
    <819fa>   DW_AT_external    : 1
    <819fa>   DW_AT_declaration : 1
 <1><819fa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <819fb>   DW_AT_byte_size   : 8
    <819fb>   DW_AT_type        : <0x81968>
 <1><819ff>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <81a00>   DW_AT_prototyped  : 1
    <81a00>   DW_AT_type        : <0x8116a>
    <81a04>   DW_AT_sibling     : <0x81a18>
 <2><81a08>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81a09>   DW_AT_type        : <0x8116a>
 <2><81a0d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81a0e>   DW_AT_type        : <0x8119f>
 <2><81a12>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81a13>   DW_AT_type        : <0x81178>
 <2><81a17>: Abbrev Number: 0
 <1><81a18>: Abbrev Number: 27 (DW_TAG_variable)
    <81a19>   DW_AT_name        : (indirect string, offset: 0x16bb1): fb_hMemCpy
    <81a1d>   DW_AT_decl_file   : 6
    <81a1d>   DW_AT_decl_line   : 368
    <81a1f>   DW_AT_decl_column : 16
    <81a20>   DW_AT_type        : <0x81a24>
    <81a24>   DW_AT_external    : 1
    <81a24>   DW_AT_declaration : 1
 <1><81a24>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81a25>   DW_AT_byte_size   : 8
    <81a25>   DW_AT_type        : <0x819ff>
 <1><81a29>: Abbrev Number: 27 (DW_TAG_variable)
    <81a2a>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <81a2e>   DW_AT_decl_file   : 6
    <81a2e>   DW_AT_decl_line   : 369
    <81a30>   DW_AT_decl_column : 16
    <81a31>   DW_AT_type        : <0x815f3>
    <81a35>   DW_AT_external    : 1
    <81a35>   DW_AT_declaration : 1
 <1><81a35>: Abbrev Number: 14 (DW_TAG_structure_type)
    <81a36>   DW_AT_name        : (indirect string, offset: 0x17736): FB_GL_PARAMS
    <81a3a>   DW_AT_byte_size   : 80
    <81a3b>   DW_AT_decl_file   : 7
    <81a3c>   DW_AT_decl_line   : 90
    <81a3d>   DW_AT_decl_column : 16
    <81a3e>   DW_AT_sibling     : <0x81b2d>
 <2><81a42>: Abbrev Number: 1 (DW_TAG_member)
    <81a43>   DW_AT_name        : (indirect string, offset: 0x17f50): color_bits
    <81a47>   DW_AT_decl_file   : 7
    <81a48>   DW_AT_decl_line   : 91
    <81a49>   DW_AT_decl_column : 6
    <81a4a>   DW_AT_type        : <0x81152>
    <81a4e>   DW_AT_data_member_location: 0
 <2><81a4f>: Abbrev Number: 1 (DW_TAG_member)
    <81a50>   DW_AT_name        : (indirect string, offset: 0x172a4): color_red_bits
    <81a54>   DW_AT_decl_file   : 7
    <81a55>   DW_AT_decl_line   : 92
    <81a56>   DW_AT_decl_column : 6
    <81a57>   DW_AT_type        : <0x81152>
    <81a5b>   DW_AT_data_member_location: 4
 <2><81a5c>: Abbrev Number: 1 (DW_TAG_member)
    <81a5d>   DW_AT_name        : (indirect string, offset: 0x16fcc): color_green_bits
    <81a61>   DW_AT_decl_file   : 7
    <81a62>   DW_AT_decl_line   : 93
    <81a63>   DW_AT_decl_column : 6
    <81a64>   DW_AT_type        : <0x81152>
    <81a68>   DW_AT_data_member_location: 8
 <2><81a69>: Abbrev Number: 1 (DW_TAG_member)
    <81a6a>   DW_AT_name        : (indirect string, offset: 0x176ea): color_blue_bits
    <81a6e>   DW_AT_decl_file   : 7
    <81a6f>   DW_AT_decl_line   : 94
    <81a70>   DW_AT_decl_column : 6
    <81a71>   DW_AT_type        : <0x81152>
    <81a75>   DW_AT_data_member_location: 12
 <2><81a76>: Abbrev Number: 1 (DW_TAG_member)
    <81a77>   DW_AT_name        : (indirect string, offset: 0x17616): color_alpha_bits
    <81a7b>   DW_AT_decl_file   : 7
    <81a7c>   DW_AT_decl_line   : 95
    <81a7d>   DW_AT_decl_column : 6
    <81a7e>   DW_AT_type        : <0x81152>
    <81a82>   DW_AT_data_member_location: 16
 <2><81a83>: Abbrev Number: 1 (DW_TAG_member)
    <81a84>   DW_AT_name        : (indirect string, offset: 0x16eb5): depth_bits
    <81a88>   DW_AT_decl_file   : 7
    <81a89>   DW_AT_decl_line   : 96
    <81a8a>   DW_AT_decl_column : 6
    <81a8b>   DW_AT_type        : <0x81152>
    <81a8f>   DW_AT_data_member_location: 20
 <2><81a90>: Abbrev Number: 1 (DW_TAG_member)
    <81a91>   DW_AT_name        : (indirect string, offset: 0x174f6): stencil_bits
    <81a95>   DW_AT_decl_file   : 7
    <81a96>   DW_AT_decl_line   : 97
    <81a97>   DW_AT_decl_column : 6
    <81a98>   DW_AT_type        : <0x81152>
    <81a9c>   DW_AT_data_member_location: 24
 <2><81a9d>: Abbrev Number: 1 (DW_TAG_member)
    <81a9e>   DW_AT_name        : (indirect string, offset: 0x17503): accum_bits
    <81aa2>   DW_AT_decl_file   : 7
    <81aa3>   DW_AT_decl_line   : 98
    <81aa4>   DW_AT_decl_column : 6
    <81aa5>   DW_AT_type        : <0x81152>
    <81aa9>   DW_AT_data_member_location: 28
 <2><81aaa>: Abbrev Number: 1 (DW_TAG_member)
    <81aab>   DW_AT_name        : (indirect string, offset: 0x17095): accum_red_bits
    <81aaf>   DW_AT_decl_file   : 7
    <81ab0>   DW_AT_decl_line   : 99
    <81ab1>   DW_AT_decl_column : 6
    <81ab2>   DW_AT_type        : <0x81152>
    <81ab6>   DW_AT_data_member_location: 32
 <2><81ab7>: Abbrev Number: 1 (DW_TAG_member)
    <81ab8>   DW_AT_name        : (indirect string, offset: 0x1747e): accum_green_bits
    <81abc>   DW_AT_decl_file   : 7
    <81abd>   DW_AT_decl_line   : 100
    <81abe>   DW_AT_decl_column : 6
    <81abf>   DW_AT_type        : <0x81152>
    <81ac3>   DW_AT_data_member_location: 36
 <2><81ac4>: Abbrev Number: 1 (DW_TAG_member)
    <81ac5>   DW_AT_name        : (indirect string, offset: 0x174c2): accum_blue_bits
    <81ac9>   DW_AT_decl_file   : 7
    <81aca>   DW_AT_decl_line   : 101
    <81acb>   DW_AT_decl_column : 6
    <81acc>   DW_AT_type        : <0x81152>
    <81ad0>   DW_AT_data_member_location: 40
 <2><81ad1>: Abbrev Number: 1 (DW_TAG_member)
    <81ad2>   DW_AT_name        : (indirect string, offset: 0x17084): accum_alpha_bits
    <81ad6>   DW_AT_decl_file   : 7
    <81ad7>   DW_AT_decl_line   : 102
    <81ad8>   DW_AT_decl_column : 6
    <81ad9>   DW_AT_type        : <0x81152>
    <81add>   DW_AT_data_member_location: 44
 <2><81ade>: Abbrev Number: 1 (DW_TAG_member)
    <81adf>   DW_AT_name        : (indirect string, offset: 0x171c8): num_samples
    <81ae3>   DW_AT_decl_file   : 7
    <81ae4>   DW_AT_decl_line   : 103
    <81ae5>   DW_AT_decl_column : 6
    <81ae6>   DW_AT_type        : <0x81152>
    <81aea>   DW_AT_data_member_location: 48
 <2><81aeb>: Abbrev Number: 1 (DW_TAG_member)
    <81aec>   DW_AT_name        : (indirect string, offset: 0x1753f): init_mode_2d
    <81af0>   DW_AT_decl_file   : 7
    <81af1>   DW_AT_decl_line   : 104
    <81af2>   DW_AT_decl_column : 6
    <81af3>   DW_AT_type        : <0x81152>
    <81af7>   DW_AT_data_member_location: 52
 <2><81af8>: Abbrev Number: 1 (DW_TAG_member)
    <81af9>   DW_AT_name        : (indirect string, offset: 0x17544): mode_2d
    <81afd>   DW_AT_decl_file   : 7
    <81afe>   DW_AT_decl_line   : 105
    <81aff>   DW_AT_decl_column : 6
    <81b00>   DW_AT_type        : <0x81152>
    <81b04>   DW_AT_data_member_location: 56
 <2><81b05>: Abbrev Number: 1 (DW_TAG_member)
    <81b06>   DW_AT_name        : (indirect string, offset: 0x17534): init_scale
    <81b0a>   DW_AT_decl_file   : 7
    <81b0b>   DW_AT_decl_line   : 106
    <81b0c>   DW_AT_decl_column : 6
    <81b0d>   DW_AT_type        : <0x81152>
    <81b11>   DW_AT_data_member_location: 60
 <2><81b12>: Abbrev Number: 1 (DW_TAG_member)
    <81b13>   DW_AT_name        : (indirect string, offset: 0x17539): scale
    <81b17>   DW_AT_decl_file   : 7
    <81b18>   DW_AT_decl_line   : 107
    <81b19>   DW_AT_decl_column : 6
    <81b1a>   DW_AT_type        : <0x81152>
    <81b1e>   DW_AT_data_member_location: 64
 <2><81b1f>: Abbrev Number: 1 (DW_TAG_member)
    <81b20>   DW_AT_name        : (indirect string, offset: 0x17401): callback
    <81b24>   DW_AT_decl_file   : 7
    <81b25>   DW_AT_decl_line   : 108
    <81b26>   DW_AT_decl_column : 9
    <81b27>   DW_AT_type        : <0x8122a>
    <81b2b>   DW_AT_data_member_location: 72
 <2><81b2c>: Abbrev Number: 0
 <1><81b2d>: Abbrev Number: 9 (DW_TAG_typedef)
    <81b2e>   DW_AT_name        : (indirect string, offset: 0x17736): FB_GL_PARAMS
    <81b32>   DW_AT_decl_file   : 7
    <81b33>   DW_AT_decl_line   : 109
    <81b34>   DW_AT_decl_column : 3
    <81b35>   DW_AT_type        : <0x81a35>
 <1><81b39>: Abbrev Number: 48 (DW_TAG_variable)
    <81b3a>   DW_AT_name        : (indirect string, offset: 0x17054): __fb_gl_params
    <81b3e>   DW_AT_decl_file   : 7
    <81b3f>   DW_AT_decl_line   : 112
    <81b40>   DW_AT_decl_column : 21
    <81b41>   DW_AT_type        : <0x81b2d>
    <81b45>   DW_AT_external    : 1
    <81b45>   DW_AT_declaration : 1
 <1><81b45>: Abbrev Number: 28 (DW_TAG_subprogram)
    <81b46>   DW_AT_external    : 1
    <81b46>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <81b4a>   DW_AT_decl_file   : 6
    <81b4a>   DW_AT_decl_line   : 470
    <81b4c>   DW_AT_decl_column : 20
    <81b4d>   DW_AT_prototyped  : 1
    <81b4d>   DW_AT_declaration : 1
    <81b4d>   DW_AT_sibling     : <0x81b5c>
 <2><81b51>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b52>   DW_AT_type        : <0x81152>
 <2><81b56>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b57>   DW_AT_type        : <0x81152>
 <2><81b5b>: Abbrev Number: 0
 <1><81b5c>: Abbrev Number: 49 (DW_TAG_subprogram)
    <81b5d>   DW_AT_external    : 1
    <81b5d>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <81b61>   DW_AT_decl_file   : 6
    <81b62>   DW_AT_decl_line   : 469
    <81b64>   DW_AT_decl_column : 20
    <81b65>   DW_AT_prototyped  : 1
    <81b65>   DW_AT_declaration : 1
 <1><81b65>: Abbrev Number: 28 (DW_TAG_subprogram)
    <81b66>   DW_AT_external    : 1
    <81b66>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <81b6a>   DW_AT_decl_file   : 6
    <81b6a>   DW_AT_decl_line   : 410
    <81b6c>   DW_AT_decl_column : 13
    <81b6d>   DW_AT_prototyped  : 1
    <81b6d>   DW_AT_declaration : 1
    <81b6d>   DW_AT_sibling     : <0x81b7c>
 <2><81b71>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b72>   DW_AT_type        : <0x81b7c>
 <2><81b76>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b77>   DW_AT_type        : <0x81136>
 <2><81b7b>: Abbrev Number: 0
 <1><81b7c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <81b7d>   DW_AT_byte_size   : 8
    <81b7d>   DW_AT_type        : <0x81612>
 <1><81b81>: Abbrev Number: 28 (DW_TAG_subprogram)
    <81b82>   DW_AT_external    : 1
    <81b82>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <81b86>   DW_AT_decl_file   : 6
    <81b86>   DW_AT_decl_line   : 409
    <81b88>   DW_AT_decl_column : 13
    <81b89>   DW_AT_prototyped  : 1
    <81b89>   DW_AT_declaration : 1
    <81b89>   DW_AT_sibling     : <0x81b98>
 <2><81b8d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b8e>   DW_AT_type        : <0x81b7c>
 <2><81b92>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81b93>   DW_AT_type        : <0x8116a>
 <2><81b97>: Abbrev Number: 0
 <1><81b98>: Abbrev Number: 50 (DW_TAG_subprogram)
    <81b99>   DW_AT_external    : 1
    <81b99>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <81b9d>   DW_AT_decl_file   : 6
    <81b9e>   DW_AT_decl_line   : 396
    <81ba0>   DW_AT_decl_column : 19
    <81ba1>   DW_AT_prototyped  : 1
    <81ba1>   DW_AT_type        : <0x81b7c>
    <81ba5>   DW_AT_declaration : 1
 <1><81ba5>: Abbrev Number: 51 (DW_TAG_subprogram)
    <81ba6>   DW_AT_external    : 1
    <81ba6>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <81baa>   DW_AT_decl_file   : 8
    <81bab>   DW_AT_decl_line   : 50
    <81bac>   DW_AT_decl_column : 22
    <81bad>   DW_AT_prototyped  : 1
    <81bad>   DW_AT_type        : <0x81152>
    <81bb1>   DW_AT_declaration : 1
    <81bb1>   DW_AT_sibling     : <0x81bbb>
 <2><81bb5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <81bb6>   DW_AT_type        : <0x81152>
 <2><81bba>: Abbrev Number: 0
 <1><81bbb>: Abbrev Number: 34 (DW_TAG_subprogram)
    <81bbc>   DW_AT_external    : 1
    <81bbc>   DW_AT_name        : (indirect string, offset: 0x17fb5): fb_GfxPageSet
    <81bc0>   DW_AT_decl_file   : 1
    <81bc0>   DW_AT_decl_line   : 94
    <81bc1>   DW_AT_decl_column : 5
    <81bc1>   DW_AT_prototyped  : 1
    <81bc1>   DW_AT_type        : <0x81152>
    <81bc5>   DW_AT_low_pc      : 0x45e310
    <81bcd>   DW_AT_high_pc     : 0x2b1
    <81bd5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81bd7>   DW_AT_call_all_calls: 1
    <81bd7>   DW_AT_sibling     : <0x81cc6>
 <2><81bdb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <81bdc>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <81be0>   DW_AT_decl_file   : 1
    <81be0>   DW_AT_decl_line   : 94
    <81be1>   DW_AT_decl_column : 23
    <81be2>   DW_AT_type        : <0x81152>
    <81be6>   DW_AT_location    : 0x273ea (location list)
    <81bea>   DW_AT_GNU_locviews: 0x273e2
 <2><81bee>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <81bef>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <81bf3>   DW_AT_decl_file   : 1
    <81bf3>   DW_AT_decl_line   : 94
    <81bf4>   DW_AT_decl_column : 38
    <81bf5>   DW_AT_type        : <0x81152>
    <81bf9>   DW_AT_location    : 0x2740f (location list)
    <81bfd>   DW_AT_GNU_locviews: 0x27407
 <2><81c01>: Abbrev Number: 52 (DW_TAG_variable)
    <81c02>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <81c06>   DW_AT_decl_file   : 1
    <81c07>   DW_AT_decl_line   : 96
    <81c08>   DW_AT_decl_column : 13
    <81c09>   DW_AT_type        : <0x81b7c>
    <81c0d>   DW_AT_location    : 0x27434 (location list)
    <81c11>   DW_AT_GNU_locviews: 0x2742c
 <2><81c15>: Abbrev Number: 35 (DW_TAG_variable)
    <81c16>   DW_AT_name        : res
    <81c1a>   DW_AT_decl_file   : 1
    <81c1a>   DW_AT_decl_line   : 97
    <81c1b>   DW_AT_decl_column : 6
    <81c1c>   DW_AT_type        : <0x81152>
    <81c20>   DW_AT_location    : 0x27459 (location list)
    <81c24>   DW_AT_GNU_locviews: 0x27451
 <2><81c28>: Abbrev Number: 53 (DW_TAG_lexical_block)
    <81c29>   DW_AT_ranges      : 0x173ff
    <81c2d>   DW_AT_sibling     : <0x81c43>
 <3><81c31>: Abbrev Number: 35 (DW_TAG_variable)
    <81c32>   DW_AT_name        : i
    <81c34>   DW_AT_decl_file   : 1
    <81c34>   DW_AT_decl_line   : 116
    <81c35>   DW_AT_decl_column : 7
    <81c36>   DW_AT_type        : <0x81152>
    <81c3a>   DW_AT_location    : 0x2748a (location list)
    <81c3e>   DW_AT_GNU_locviews: 0x27476
 <3><81c42>: Abbrev Number: 0
 <2><81c43>: Abbrev Number: 21 (DW_TAG_call_site)
    <81c44>   DW_AT_call_return_pc: 0x45e332
    <81c4c>   DW_AT_call_origin : <0x81b98>
 <2><81c50>: Abbrev Number: 16 (DW_TAG_call_site)
    <81c51>   DW_AT_call_return_pc: 0x45e352
    <81c59>   DW_AT_call_origin : <0x81b81>
    <81c5d>   DW_AT_sibling     : <0x81c6d>
 <3><81c61>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81c62>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81c64>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><81c67>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81c68>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81c6a>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><81c6c>: Abbrev Number: 0
 <2><81c6d>: Abbrev Number: 16 (DW_TAG_call_site)
    <81c6e>   DW_AT_call_return_pc: 0x45e35f
    <81c76>   DW_AT_call_origin : <0x81b65>
    <81c7a>   DW_AT_sibling     : <0x81c8d>
 <3><81c7e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81c7f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81c81>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><81c84>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81c85>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81c87>   DW_AT_call_value  : 4 byte block: 40 44 24 1f 	(DW_OP_lit16; DW_OP_lit20; DW_OP_shl; DW_OP_neg)
 <3><81c8c>: Abbrev Number: 0
 <2><81c8d>: Abbrev Number: 21 (DW_TAG_call_site)
    <81c8e>   DW_AT_call_return_pc: 0x45e536
    <81c96>   DW_AT_call_origin : <0x81b5c>
 <2><81c9a>: Abbrev Number: 22 (DW_TAG_call_site)
    <81c9b>   DW_AT_call_return_pc: 0x45e562
    <81ca3>   DW_AT_sibling     : <0x81cad>
 <3><81ca7>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81ca8>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81caa>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><81cac>: Abbrev Number: 0
 <2><81cad>: Abbrev Number: 54 (DW_TAG_call_site)
    <81cae>   DW_AT_call_return_pc: 0x45e56e
    <81cb6>   DW_AT_call_origin : <0x81b45>
 <3><81cba>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81cbb>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81cbd>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><81cbf>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81cc0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81cc2>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><81cc4>: Abbrev Number: 0
 <2><81cc5>: Abbrev Number: 0
 <1><81cc6>: Abbrev Number: 34 (DW_TAG_subprogram)
    <81cc7>   DW_AT_external    : 1
    <81cc7>   DW_AT_name        : (indirect string, offset: 0x17fcd): fb_GfxPageCopy
    <81ccb>   DW_AT_decl_file   : 1
    <81ccb>   DW_AT_decl_line   : 89
    <81ccc>   DW_AT_decl_column : 5
    <81ccc>   DW_AT_prototyped  : 1
    <81ccc>   DW_AT_type        : <0x81152>
    <81cd0>   DW_AT_low_pc      : 0x45e300
    <81cd8>   DW_AT_high_pc     : 0x5
    <81ce0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81ce2>   DW_AT_call_all_calls: 1
    <81ce2>   DW_AT_sibling     : <0x81d29>
 <2><81ce6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <81ce7>   DW_AT_name        : (indirect string, offset: 0x17f99): from_page
    <81ceb>   DW_AT_decl_file   : 1
    <81ceb>   DW_AT_decl_line   : 89
    <81cec>   DW_AT_decl_column : 24
    <81ced>   DW_AT_type        : <0x81152>
    <81cf1>   DW_AT_location    : 0x274df (location list)
    <81cf5>   DW_AT_GNU_locviews: 0x274db
 <2><81cf9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <81cfa>   DW_AT_name        : (indirect string, offset: 0x17fa3): to_page
    <81cfe>   DW_AT_decl_file   : 1
    <81cfe>   DW_AT_decl_line   : 89
    <81cff>   DW_AT_decl_column : 39
    <81d00>   DW_AT_type        : <0x81152>
    <81d04>   DW_AT_location    : 0x274f5 (location list)
    <81d08>   DW_AT_GNU_locviews: 0x274f1
 <2><81d0c>: Abbrev Number: 36 (DW_TAG_call_site)
    <81d0d>   DW_AT_call_return_pc: 0x45e305
    <81d15>   DW_AT_call_tail_call: 1
    <81d15>   DW_AT_call_origin : <0x81d29>
 <3><81d19>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81d1a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81d1c>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><81d20>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81d21>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81d23>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><81d27>: Abbrev Number: 0
 <2><81d28>: Abbrev Number: 0
 <1><81d29>: Abbrev Number: 55 (DW_TAG_subprogram)
    <81d2a>   DW_AT_external    : 1
    <81d2a>   DW_AT_name        : (indirect string, offset: 0x12b8c): fb_GfxFlip
    <81d2e>   DW_AT_decl_file   : 1
    <81d2f>   DW_AT_decl_line   : 6
    <81d30>   DW_AT_decl_column : 12
    <81d31>   DW_AT_prototyped  : 1
    <81d31>   DW_AT_type        : <0x81152>
    <81d35>   DW_AT_inline      : 1	(inlined)
    <81d36>   DW_AT_sibling     : <0x81db0>
 <2><81d3a>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <81d3b>   DW_AT_name        : (indirect string, offset: 0x17f99): from_page
    <81d3f>   DW_AT_decl_file   : 1
    <81d3f>   DW_AT_decl_line   : 6
    <81d3f>   DW_AT_decl_column : 27
    <81d40>   DW_AT_type        : <0x81152>
 <2><81d44>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <81d45>   DW_AT_name        : (indirect string, offset: 0x17fa3): to_page
    <81d49>   DW_AT_decl_file   : 1
    <81d49>   DW_AT_decl_line   : 6
    <81d49>   DW_AT_decl_column : 42
    <81d4a>   DW_AT_type        : <0x81152>
 <2><81d4e>: Abbrev Number: 13 (DW_TAG_variable)
    <81d4f>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <81d53>   DW_AT_decl_file   : 1
    <81d53>   DW_AT_decl_line   : 8
    <81d54>   DW_AT_decl_column : 13
    <81d55>   DW_AT_type        : <0x81b7c>
 <2><81d59>: Abbrev Number: 13 (DW_TAG_variable)
    <81d5a>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <81d5e>   DW_AT_decl_file   : 1
    <81d5e>   DW_AT_decl_line   : 9
    <81d5f>   DW_AT_decl_column : 17
    <81d60>   DW_AT_type        : <0x813b2>
 <2><81d64>: Abbrev Number: 38 (DW_TAG_variable)
    <81d65>   DW_AT_name        : src
    <81d69>   DW_AT_decl_file   : 1
    <81d69>   DW_AT_decl_line   : 9
    <81d6a>   DW_AT_decl_column : 24
    <81d6b>   DW_AT_type        : <0x813b2>
 <2><81d6f>: Abbrev Number: 38 (DW_TAG_variable)
    <81d70>   DW_AT_name        : i
    <81d72>   DW_AT_decl_file   : 1
    <81d72>   DW_AT_decl_line   : 10
    <81d73>   DW_AT_decl_column : 6
    <81d74>   DW_AT_type        : <0x81152>
 <2><81d78>: Abbrev Number: 13 (DW_TAG_variable)
    <81d79>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <81d7d>   DW_AT_decl_file   : 1
    <81d7d>   DW_AT_decl_line   : 10
    <81d7e>   DW_AT_decl_column : 9
    <81d7f>   DW_AT_type        : <0x81152>
 <2><81d83>: Abbrev Number: 13 (DW_TAG_variable)
    <81d84>   DW_AT_name        : (indirect string, offset: 0x17fc3): text_size
    <81d88>   DW_AT_decl_file   : 1
    <81d88>   DW_AT_decl_line   : 10
    <81d89>   DW_AT_decl_column : 15
    <81d8a>   DW_AT_type        : <0x81152>
 <2><81d8e>: Abbrev Number: 13 (DW_TAG_variable)
    <81d8f>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <81d93>   DW_AT_decl_file   : 1
    <81d93>   DW_AT_decl_line   : 10
    <81d94>   DW_AT_decl_column : 26
    <81d95>   DW_AT_type        : <0x81152>
 <2><81d99>: Abbrev Number: 13 (DW_TAG_variable)
    <81d9a>   DW_AT_name        : (indirect string, offset: 0x17f90): src_page
    <81d9e>   DW_AT_decl_file   : 1
    <81d9e>   DW_AT_decl_line   : 11
    <81d9f>   DW_AT_decl_column : 6
    <81da0>   DW_AT_type        : <0x81152>
 <2><81da4>: Abbrev Number: 13 (DW_TAG_variable)
    <81da5>   DW_AT_name        : (indirect string, offset: 0x17fab): dest_page
    <81da9>   DW_AT_decl_file   : 1
    <81da9>   DW_AT_decl_line   : 11
    <81daa>   DW_AT_decl_column : 16
    <81dab>   DW_AT_type        : <0x81152>
 <2><81daf>: Abbrev Number: 0
 <1><81db0>: Abbrev Number: 56 (DW_TAG_subprogram)
    <81db1>   DW_AT_abstract_origin: <0x81d29>
    <81db5>   DW_AT_low_pc      : 0x45e0c0
    <81dbd>   DW_AT_high_pc     : 0x23c
    <81dc5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81dc7>   DW_AT_call_all_tail_calls: 1
 <2><81dc7>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <81dc8>   DW_AT_abstract_origin: <0x81d3a>
    <81dcc>   DW_AT_location    : 0x27517 (location list)
    <81dd0>   DW_AT_GNU_locviews: 0x27507
 <2><81dd4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <81dd5>   DW_AT_abstract_origin: <0x81d44>
    <81dd9>   DW_AT_location    : 0x27562 (location list)
    <81ddd>   DW_AT_GNU_locviews: 0x27550
 <2><81de1>: Abbrev Number: 12 (DW_TAG_variable)
    <81de2>   DW_AT_abstract_origin: <0x81d4e>
 <2><81de6>: Abbrev Number: 12 (DW_TAG_variable)
    <81de7>   DW_AT_abstract_origin: <0x81d59>
 <2><81deb>: Abbrev Number: 12 (DW_TAG_variable)
    <81dec>   DW_AT_abstract_origin: <0x81d64>
 <2><81df0>: Abbrev Number: 12 (DW_TAG_variable)
    <81df1>   DW_AT_abstract_origin: <0x81d6f>
 <2><81df5>: Abbrev Number: 12 (DW_TAG_variable)
    <81df6>   DW_AT_abstract_origin: <0x81d78>
 <2><81dfa>: Abbrev Number: 12 (DW_TAG_variable)
    <81dfb>   DW_AT_abstract_origin: <0x81d83>
 <2><81dff>: Abbrev Number: 57 (DW_TAG_variable)
    <81e00>   DW_AT_abstract_origin: <0x81d8e>
    <81e04>   DW_AT_const_value : 0
 <2><81e05>: Abbrev Number: 12 (DW_TAG_variable)
    <81e06>   DW_AT_abstract_origin: <0x81d99>
 <2><81e0a>: Abbrev Number: 12 (DW_TAG_variable)
    <81e0b>   DW_AT_abstract_origin: <0x81da4>
 <2><81e0f>: Abbrev Number: 58 (DW_TAG_inlined_subroutine)
    <81e10>   DW_AT_abstract_origin: <0x81d29>
    <81e14>   DW_AT_entry_pc    : 0x45e130
    <81e1c>   DW_AT_GNU_entry_view: 1
    <81e1d>   DW_AT_ranges      : 0x173e2
    <81e21>   DW_AT_call_file   : 1
    <81e22>   DW_AT_call_line   : 6
    <81e23>   DW_AT_call_column : 12
    <81e24>   DW_AT_sibling     : <0x81f8e>
 <3><81e28>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <81e29>   DW_AT_abstract_origin: <0x81d44>
    <81e2d>   DW_AT_location    : 0x275ad (location list)
    <81e31>   DW_AT_GNU_locviews: 0x275a7
 <3><81e35>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <81e36>   DW_AT_abstract_origin: <0x81d3a>
    <81e3a>   DW_AT_location    : 0x275c7 (location list)
    <81e3e>   DW_AT_GNU_locviews: 0x275c3
 <3><81e42>: Abbrev Number: 59 (DW_TAG_lexical_block)
    <81e43>   DW_AT_ranges      : 0x173ef
 <4><81e47>: Abbrev Number: 10 (DW_TAG_variable)
    <81e48>   DW_AT_abstract_origin: <0x81d4e>
    <81e4c>   DW_AT_location    : 0x275db (location list)
    <81e50>   DW_AT_GNU_locviews: 0x275d5
 <4><81e54>: Abbrev Number: 10 (DW_TAG_variable)
    <81e55>   DW_AT_abstract_origin: <0x81d59>
    <81e59>   DW_AT_location    : 0x275fa (location list)
    <81e5d>   DW_AT_GNU_locviews: 0x275f0
 <4><81e61>: Abbrev Number: 10 (DW_TAG_variable)
    <81e62>   DW_AT_abstract_origin: <0x81d64>
    <81e66>   DW_AT_location    : 0x27628 (location list)
    <81e6a>   DW_AT_GNU_locviews: 0x2761e
 <4><81e6e>: Abbrev Number: 10 (DW_TAG_variable)
    <81e6f>   DW_AT_abstract_origin: <0x81d6f>
    <81e73>   DW_AT_location    : 0x27654 (location list)
    <81e77>   DW_AT_GNU_locviews: 0x2764c
 <4><81e7b>: Abbrev Number: 10 (DW_TAG_variable)
    <81e7c>   DW_AT_abstract_origin: <0x81d78>
    <81e80>   DW_AT_location    : 0x27679 (location list)
    <81e84>   DW_AT_GNU_locviews: 0x27673
 <4><81e88>: Abbrev Number: 10 (DW_TAG_variable)
    <81e89>   DW_AT_abstract_origin: <0x81d83>
    <81e8d>   DW_AT_location    : 0x27697 (location list)
    <81e91>   DW_AT_GNU_locviews: 0x2768f
 <4><81e95>: Abbrev Number: 10 (DW_TAG_variable)
    <81e96>   DW_AT_abstract_origin: <0x81d8e>
    <81e9a>   DW_AT_location    : 0x276c2 (location list)
    <81e9e>   DW_AT_GNU_locviews: 0x276ba
 <4><81ea2>: Abbrev Number: 10 (DW_TAG_variable)
    <81ea3>   DW_AT_abstract_origin: <0x81d99>
    <81ea7>   DW_AT_location    : 0x276eb (location list)
    <81eab>   DW_AT_GNU_locviews: 0x276e5
 <4><81eaf>: Abbrev Number: 10 (DW_TAG_variable)
    <81eb0>   DW_AT_abstract_origin: <0x81da4>
    <81eb4>   DW_AT_location    : 0x27705 (location list)
    <81eb8>   DW_AT_GNU_locviews: 0x27701
 <4><81ebc>: Abbrev Number: 60 (DW_TAG_call_site)
    <81ebd>   DW_AT_call_return_pc: 0x45e129
    <81ec5>   DW_AT_call_tail_call: 1
    <81ec5>   DW_AT_call_origin : <0x81ba5>
 <4><81ec9>: Abbrev Number: 21 (DW_TAG_call_site)
    <81eca>   DW_AT_call_return_pc: 0x45e135
    <81ed2>   DW_AT_call_origin : <0x81b98>
 <4><81ed6>: Abbrev Number: 16 (DW_TAG_call_site)
    <81ed7>   DW_AT_call_return_pc: 0x45e142
    <81edf>   DW_AT_call_origin : <0x81b81>
    <81ee3>   DW_AT_sibling     : <0x81ef3>
 <5><81ee7>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81ee8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81eea>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><81eed>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81eee>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81ef0>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><81ef2>: Abbrev Number: 0
 <4><81ef3>: Abbrev Number: 16 (DW_TAG_call_site)
    <81ef4>   DW_AT_call_return_pc: 0x45e14f
    <81efc>   DW_AT_call_origin : <0x81b65>
    <81f00>   DW_AT_sibling     : <0x81f13>
 <5><81f04>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f05>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81f07>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><81f0a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f0b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81f0d>   DW_AT_call_value  : 4 byte block: 40 44 24 1f 	(DW_OP_lit16; DW_OP_lit20; DW_OP_shl; DW_OP_neg)
 <5><81f12>: Abbrev Number: 0
 <4><81f13>: Abbrev Number: 22 (DW_TAG_call_site)
    <81f14>   DW_AT_call_return_pc: 0x45e217
    <81f1c>   DW_AT_sibling     : <0x81f33>
 <5><81f20>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f21>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81f23>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><81f26>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f27>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81f29>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><81f2c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f2d>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <81f2f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><81f32>: Abbrev Number: 0
 <4><81f33>: Abbrev Number: 22 (DW_TAG_call_site)
    <81f34>   DW_AT_call_return_pc: 0x45e24c
    <81f3c>   DW_AT_sibling     : <0x81f50>
 <5><81f40>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f41>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <81f43>   DW_AT_call_value  : 11 byte block: 91 b4 7f 94 4 8 20 24 8 20 26 	(DW_OP_fbreg: -76; DW_OP_deref_size: 4; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <5><81f4f>: Abbrev Number: 0
 <4><81f50>: Abbrev Number: 22 (DW_TAG_call_site)
    <81f51>   DW_AT_call_return_pc: 0x45e271
    <81f59>   DW_AT_sibling     : <0x81f63>
 <5><81f5d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f5e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81f60>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><81f62>: Abbrev Number: 0
 <4><81f63>: Abbrev Number: 16 (DW_TAG_call_site)
    <81f64>   DW_AT_call_return_pc: 0x45e27d
    <81f6c>   DW_AT_call_origin : <0x81b45>
    <81f70>   DW_AT_sibling     : <0x81f7f>
 <5><81f74>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f75>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81f77>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><81f79>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f7a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <81f7c>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><81f7e>: Abbrev Number: 0
 <4><81f7f>: Abbrev Number: 21 (DW_TAG_call_site)
    <81f80>   DW_AT_call_return_pc: 0x45e2d5
    <81f88>   DW_AT_call_origin : <0x81b5c>
 <4><81f8c>: Abbrev Number: 0
 <3><81f8d>: Abbrev Number: 0
 <2><81f8e>: Abbrev Number: 36 (DW_TAG_call_site)
    <81f8f>   DW_AT_call_return_pc: 0x45e2ea
    <81f97>   DW_AT_call_tail_call: 1
    <81f97>   DW_AT_call_origin : <0x81ba5>
 <3><81f9b>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <81f9c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <81f9e>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><81fa0>: Abbrev Number: 0
 <2><81fa1>: Abbrev Number: 0
 <1><81fa2>: Abbrev Number: 0
  Compilation Unit @ offset 0x81fa3:
   Length:        0x1024 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x31c4
   Pointer Size:  8
 <0><81faf>: Abbrev Number: 34 (DW_TAG_compile_unit)
    <81fb0>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <81fb4>   DW_AT_language    : 29	(C11)
    <81fb5>   DW_AT_name        : (indirect line string, offset: 0x3c8): src/gfxlib2/gfx_paint.c
    <81fb9>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <81fbd>   DW_AT_low_pc      : 0x45e5d0
    <81fc5>   DW_AT_high_pc     : 0x656
    <81fcd>   DW_AT_stmt_list   : 0x5549f
 <1><81fd1>: Abbrev Number: 7 (DW_TAG_base_type)
    <81fd2>   DW_AT_byte_size   : 1
    <81fd3>   DW_AT_encoding    : 8	(unsigned char)
    <81fd4>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><81fd8>: Abbrev Number: 16 (DW_TAG_const_type)
    <81fd9>   DW_AT_type        : <0x81fd1>
 <1><81fdd>: Abbrev Number: 7 (DW_TAG_base_type)
    <81fde>   DW_AT_byte_size   : 2
    <81fdf>   DW_AT_encoding    : 7	(unsigned)
    <81fe0>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><81fe4>: Abbrev Number: 7 (DW_TAG_base_type)
    <81fe5>   DW_AT_byte_size   : 4
    <81fe6>   DW_AT_encoding    : 7	(unsigned)
    <81fe7>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><81feb>: Abbrev Number: 7 (DW_TAG_base_type)
    <81fec>   DW_AT_byte_size   : 8
    <81fed>   DW_AT_encoding    : 7	(unsigned)
    <81fee>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><81ff2>: Abbrev Number: 7 (DW_TAG_base_type)
    <81ff3>   DW_AT_byte_size   : 1
    <81ff4>   DW_AT_encoding    : 6	(signed char)
    <81ff5>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><81ff9>: Abbrev Number: 7 (DW_TAG_base_type)
    <81ffa>   DW_AT_byte_size   : 2
    <81ffb>   DW_AT_encoding    : 5	(signed)
    <81ffc>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><82000>: Abbrev Number: 35 (DW_TAG_base_type)
    <82001>   DW_AT_byte_size   : 4
    <82002>   DW_AT_encoding    : 5	(signed)
    <82003>   DW_AT_name        : int
 <1><82007>: Abbrev Number: 36 (DW_TAG_volatile_type)
    <82008>   DW_AT_type        : <0x82000>
 <1><8200c>: Abbrev Number: 16 (DW_TAG_const_type)
    <8200d>   DW_AT_type        : <0x82000>
 <1><82011>: Abbrev Number: 7 (DW_TAG_base_type)
    <82012>   DW_AT_byte_size   : 8
    <82013>   DW_AT_encoding    : 5	(signed)
    <82014>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><82018>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <82019>   DW_AT_byte_size   : 8
 <1><8201a>: Abbrev Number: 8 (DW_TAG_typedef)
    <8201b>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <8201f>   DW_AT_decl_file   : 2
    <82020>   DW_AT_decl_line   : 194
    <82021>   DW_AT_decl_column : 27
    <82022>   DW_AT_type        : <0x82011>
 <1><82026>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <82027>   DW_AT_byte_size   : 8
    <82027>   DW_AT_type        : <0x8202b>
 <1><8202b>: Abbrev Number: 7 (DW_TAG_base_type)
    <8202c>   DW_AT_byte_size   : 1
    <8202d>   DW_AT_encoding    : 6	(signed char)
    <8202e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><82032>: Abbrev Number: 8 (DW_TAG_typedef)
    <82033>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <82037>   DW_AT_decl_file   : 3
    <82038>   DW_AT_decl_line   : 209
    <82039>   DW_AT_decl_column : 23
    <8203a>   DW_AT_type        : <0x81feb>
 <1><8203e>: Abbrev Number: 38 (DW_TAG_typedef)
    <8203f>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <82043>   DW_AT_decl_file   : 3
    <82044>   DW_AT_decl_line   : 321
    <82046>   DW_AT_decl_column : 24
    <82047>   DW_AT_type        : <0x82000>
 <1><8204b>: Abbrev Number: 7 (DW_TAG_base_type)
    <8204c>   DW_AT_byte_size   : 8
    <8204d>   DW_AT_encoding    : 5	(signed)
    <8204e>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><82052>: Abbrev Number: 8 (DW_TAG_typedef)
    <82053>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <82057>   DW_AT_decl_file   : 4
    <82058>   DW_AT_decl_line   : 108
    <82059>   DW_AT_decl_column : 19
    <8205a>   DW_AT_type        : <0x8201a>
 <1><8205e>: Abbrev Number: 7 (DW_TAG_base_type)
    <8205f>   DW_AT_byte_size   : 8
    <82060>   DW_AT_encoding    : 7	(unsigned)
    <82061>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><82065>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <82066>   DW_AT_byte_size   : 8
    <82066>   DW_AT_type        : <0x8206a>
 <1><8206a>: Abbrev Number: 39 (DW_TAG_const_type)
 <1><8206b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8206c>   DW_AT_byte_size   : 8
    <8206c>   DW_AT_type        : <0x82070>
 <1><82070>: Abbrev Number: 40 (DW_TAG_subroutine_type)
    <82071>   DW_AT_prototyped  : 1
 <1><82071>: Abbrev Number: 13 (DW_TAG_structure_type)
    <82072>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <82076>   DW_AT_byte_size   : 24
    <82077>   DW_AT_decl_file   : 5
    <82078>   DW_AT_decl_line   : 82
    <82079>   DW_AT_decl_column : 16
    <8207a>   DW_AT_sibling     : <0x820a6>
 <2><8207e>: Abbrev Number: 1 (DW_TAG_member)
    <8207f>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <82083>   DW_AT_decl_file   : 5
    <82084>   DW_AT_decl_line   : 83
    <82085>   DW_AT_decl_column : 21
    <82086>   DW_AT_type        : <0x82026>
    <8208a>   DW_AT_data_member_location: 0
 <2><8208b>: Abbrev Number: 5 (DW_TAG_member)
    <8208c>   DW_AT_name        : len
    <82090>   DW_AT_decl_file   : 5
    <82091>   DW_AT_decl_line   : 84
    <82092>   DW_AT_decl_column : 21
    <82093>   DW_AT_type        : <0x82052>
    <82097>   DW_AT_data_member_location: 8
 <2><82098>: Abbrev Number: 1 (DW_TAG_member)
    <82099>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <8209d>   DW_AT_decl_file   : 5
    <8209e>   DW_AT_decl_line   : 85
    <8209f>   DW_AT_decl_column : 21
    <820a0>   DW_AT_type        : <0x82052>
    <820a4>   DW_AT_data_member_location: 16
 <2><820a5>: Abbrev Number: 0
 <1><820a6>: Abbrev Number: 8 (DW_TAG_typedef)
    <820a7>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <820ab>   DW_AT_decl_file   : 5
    <820ac>   DW_AT_decl_line   : 86
    <820ad>   DW_AT_decl_column : 3
    <820ae>   DW_AT_type        : <0x82071>
 <1><820b2>: Abbrev Number: 7 (DW_TAG_base_type)
    <820b3>   DW_AT_byte_size   : 8
    <820b4>   DW_AT_encoding    : 4	(float)
    <820b5>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><820b9>: Abbrev Number: 7 (DW_TAG_base_type)
    <820ba>   DW_AT_byte_size   : 4
    <820bb>   DW_AT_encoding    : 4	(float)
    <820bc>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><820c0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <820c1>   DW_AT_byte_size   : 8
    <820c1>   DW_AT_type        : <0x820a6>
 <1><820c5>: Abbrev Number: 8 (DW_TAG_typedef)
    <820c6>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <820ca>   DW_AT_decl_file   : 6
    <820cb>   DW_AT_decl_line   : 7
    <820cc>   DW_AT_decl_column : 25
    <820cd>   DW_AT_type        : <0x820d1>
 <1><820d1>: Abbrev Number: 41 (DW_TAG_structure_type)
    <820d2>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <820d6>   DW_AT_declaration : 1
 <1><820d6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <820d7>   DW_AT_byte_size   : 8
    <820d8>   DW_AT_decl_file   : 7
    <820d9>   DW_AT_decl_line   : 4
    <820da>   DW_AT_decl_column : 3
    <820da>   DW_AT_sibling     : <0x820f9>
 <2><820de>: Abbrev Number: 1 (DW_TAG_member)
    <820df>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <820e3>   DW_AT_decl_file   : 7
    <820e4>   DW_AT_decl_line   : 5
    <820e5>   DW_AT_decl_column : 8
    <820e6>   DW_AT_type        : <0x82000>
    <820ea>   DW_AT_data_member_location: 0
 <2><820eb>: Abbrev Number: 1 (DW_TAG_member)
    <820ec>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <820f0>   DW_AT_decl_file   : 7
    <820f1>   DW_AT_decl_line   : 6
    <820f2>   DW_AT_decl_column : 8
    <820f3>   DW_AT_type        : <0x82000>
    <820f7>   DW_AT_data_member_location: 4
 <2><820f8>: Abbrev Number: 0
 <1><820f9>: Abbrev Number: 18 (DW_TAG_structure_type)
    <820fa>   DW_AT_byte_size   : 16
    <820fb>   DW_AT_decl_file   : 7
    <820fc>   DW_AT_decl_line   : 8
    <820fd>   DW_AT_decl_column : 3
    <820fd>   DW_AT_sibling     : <0x82130>
 <2><82101>: Abbrev Number: 5 (DW_TAG_member)
    <82102>   DW_AT_name        : x
    <82104>   DW_AT_decl_file   : 7
    <82105>   DW_AT_decl_line   : 9
    <82106>   DW_AT_decl_column : 8
    <82107>   DW_AT_type        : <0x82000>
    <8210b>   DW_AT_data_member_location: 0
 <2><8210c>: Abbrev Number: 5 (DW_TAG_member)
    <8210d>   DW_AT_name        : y
    <8210f>   DW_AT_decl_file   : 7
    <82110>   DW_AT_decl_line   : 9
    <82111>   DW_AT_decl_column : 11
    <82112>   DW_AT_type        : <0x82000>
    <82116>   DW_AT_data_member_location: 4
 <2><82117>: Abbrev Number: 5 (DW_TAG_member)
    <82118>   DW_AT_name        : dx
    <8211b>   DW_AT_decl_file   : 7
    <8211c>   DW_AT_decl_line   : 10
    <8211d>   DW_AT_decl_column : 8
    <8211e>   DW_AT_type        : <0x82000>
    <82122>   DW_AT_data_member_location: 8
 <2><82123>: Abbrev Number: 5 (DW_TAG_member)
    <82124>   DW_AT_name        : dy
    <82127>   DW_AT_decl_file   : 7
    <82128>   DW_AT_decl_line   : 10
    <82129>   DW_AT_decl_column : 12
    <8212a>   DW_AT_type        : <0x82000>
    <8212e>   DW_AT_data_member_location: 12
 <2><8212f>: Abbrev Number: 0
 <1><82130>: Abbrev Number: 23 (DW_TAG_union_type)
    <82131>   DW_AT_byte_size   : 16
    <82131>   DW_AT_decl_file   : 7
    <82132>   DW_AT_decl_line   : 3
    <82133>   DW_AT_decl_column : 2
    <82133>   DW_AT_sibling     : <0x8215d>
 <2><82137>: Abbrev Number: 19 (DW_TAG_member)
    <82138>   DW_AT_type        : <0x820d6>
 <2><8213c>: Abbrev Number: 19 (DW_TAG_member)
    <8213d>   DW_AT_type        : <0x820f9>
 <2><82141>: Abbrev Number: 24 (DW_TAG_member)
    <82142>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <82146>   DW_AT_decl_file   : 7
    <82147>   DW_AT_decl_line   : 12
    <82148>   DW_AT_decl_column : 7
    <82148>   DW_AT_type        : <0x82000>
 <2><8214c>: Abbrev Number: 29 (DW_TAG_member)
    <8214d>   DW_AT_name        : z
    <8214f>   DW_AT_decl_file   : 7
    <8214f>   DW_AT_decl_line   : 13
    <82150>   DW_AT_decl_column : 7
    <82150>   DW_AT_type        : <0x82000>
 <2><82154>: Abbrev Number: 29 (DW_TAG_member)
    <82155>   DW_AT_name        : w
    <82157>   DW_AT_decl_file   : 7
    <82157>   DW_AT_decl_line   : 14
    <82158>   DW_AT_decl_column : 7
    <82158>   DW_AT_type        : <0x82000>
 <2><8215c>: Abbrev Number: 0
 <1><8215d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8215e>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <82162>   DW_AT_byte_size   : 20
    <82163>   DW_AT_decl_file   : 7
    <82164>   DW_AT_decl_line   : 1
    <82165>   DW_AT_decl_column : 8
    <82166>   DW_AT_sibling     : <0x8217e>
 <2><8216a>: Abbrev Number: 1 (DW_TAG_member)
    <8216b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8216f>   DW_AT_decl_file   : 7
    <82170>   DW_AT_decl_line   : 2
    <82171>   DW_AT_decl_column : 6
    <82172>   DW_AT_type        : <0x82000>
    <82176>   DW_AT_data_member_location: 0
 <2><82177>: Abbrev Number: 25 (DW_TAG_member)
    <82178>   DW_AT_type        : <0x82130>
    <8217c>   DW_AT_data_member_location: 4
 <2><8217d>: Abbrev Number: 0
 <1><8217e>: Abbrev Number: 8 (DW_TAG_typedef)
    <8217f>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <82183>   DW_AT_decl_file   : 7
    <82184>   DW_AT_decl_line   : 18
    <82185>   DW_AT_decl_column : 23
    <82186>   DW_AT_type        : <0x8215d>
 <1><8218a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8218b>   DW_AT_byte_size   : 8
    <8218b>   DW_AT_type        : <0x8218f>
 <1><8218f>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <82190>   DW_AT_prototyped  : 1
    <82190>   DW_AT_type        : <0x82000>
    <82194>   DW_AT_sibling     : <0x821a3>
 <2><82198>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82199>   DW_AT_type        : <0x82000>
 <2><8219d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8219e>   DW_AT_type        : <0x82000>
 <2><821a2>: Abbrev Number: 0
 <1><821a3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <821a4>   DW_AT_byte_size   : 8
    <821a4>   DW_AT_type        : <0x82000>
 <1><821a8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <821a9>   DW_AT_byte_size   : 8
    <821a9>   DW_AT_type        : <0x821ad>
 <1><821ad>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <821ae>   DW_AT_prototyped  : 1
    <821ae>   DW_AT_type        : <0x82000>
    <821b2>   DW_AT_sibling     : <0x821d0>
 <2><821b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821b7>   DW_AT_type        : <0x821a3>
 <2><821bb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821bc>   DW_AT_type        : <0x821a3>
 <2><821c0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821c1>   DW_AT_type        : <0x821a3>
 <2><821c5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821c6>   DW_AT_type        : <0x821a3>
 <2><821ca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821cb>   DW_AT_type        : <0x821a3>
 <2><821cf>: Abbrev Number: 0
 <1><821d0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <821d1>   DW_AT_byte_size   : 8
    <821d1>   DW_AT_type        : <0x8217e>
 <1><821d5>: Abbrev Number: 8 (DW_TAG_typedef)
    <821d6>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <821da>   DW_AT_decl_file   : 8
    <821db>   DW_AT_decl_line   : 13
    <821dc>   DW_AT_decl_column : 30
    <821dd>   DW_AT_type        : <0x821e1>
 <1><821e1>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <821e2>   DW_AT_prototyped  : 1
    <821e2>   DW_AT_type        : <0x81fe4>
    <821e6>   DW_AT_sibling     : <0x821fa>
 <2><821ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821eb>   DW_AT_type        : <0x81fe4>
 <2><821ef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821f0>   DW_AT_type        : <0x81fe4>
 <2><821f4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821f5>   DW_AT_type        : <0x82018>
 <2><821f9>: Abbrev Number: 0
 <1><821fa>: Abbrev Number: 8 (DW_TAG_typedef)
    <821fb>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <821ff>   DW_AT_decl_file   : 8
    <82200>   DW_AT_decl_line   : 14
    <82201>   DW_AT_decl_column : 15
    <82202>   DW_AT_type        : <0x82206>
 <1><82206>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <82207>   DW_AT_prototyped  : 1
    <82207>   DW_AT_sibling     : <0x82239>
 <2><8220b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8220c>   DW_AT_type        : <0x82239>
 <2><82210>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82211>   DW_AT_type        : <0x82239>
 <2><82215>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82216>   DW_AT_type        : <0x82000>
 <2><8221a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8221b>   DW_AT_type        : <0x82000>
 <2><8221f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82220>   DW_AT_type        : <0x82000>
 <2><82224>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82225>   DW_AT_type        : <0x82000>
 <2><82229>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8222a>   DW_AT_type        : <0x82000>
 <2><8222e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8222f>   DW_AT_type        : <0x8223e>
 <2><82233>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82234>   DW_AT_type        : <0x82018>
 <2><82238>: Abbrev Number: 0
 <1><82239>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8223a>   DW_AT_byte_size   : 8
    <8223a>   DW_AT_type        : <0x81fd1>
 <1><8223e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8223f>   DW_AT_byte_size   : 8
    <8223f>   DW_AT_type        : <0x821d5>
 <1><82243>: Abbrev Number: 18 (DW_TAG_structure_type)
    <82244>   DW_AT_byte_size   : 16
    <82245>   DW_AT_decl_file   : 8
    <82246>   DW_AT_decl_line   : 26
    <82247>   DW_AT_decl_column : 3
    <82247>   DW_AT_sibling     : <0x82280>
 <2><8224b>: Abbrev Number: 1 (DW_TAG_member)
    <8224c>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <82250>   DW_AT_decl_file   : 8
    <82251>   DW_AT_decl_line   : 27
    <82252>   DW_AT_decl_column : 8
    <82253>   DW_AT_type        : <0x82000>
    <82257>   DW_AT_data_member_location: 0
 <2><82258>: Abbrev Number: 1 (DW_TAG_member)
    <82259>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <8225d>   DW_AT_decl_file   : 8
    <8225e>   DW_AT_decl_line   : 27
    <8225f>   DW_AT_decl_column : 16
    <82260>   DW_AT_type        : <0x82000>
    <82264>   DW_AT_data_member_location: 4
 <2><82265>: Abbrev Number: 1 (DW_TAG_member)
    <82266>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <8226a>   DW_AT_decl_file   : 8
    <8226b>   DW_AT_decl_line   : 27
    <8226c>   DW_AT_decl_column : 24
    <8226d>   DW_AT_type        : <0x82000>
    <82271>   DW_AT_data_member_location: 8
 <2><82272>: Abbrev Number: 1 (DW_TAG_member)
    <82273>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <82277>   DW_AT_decl_file   : 8
    <82278>   DW_AT_decl_line   : 27
    <82279>   DW_AT_decl_column : 32
    <8227a>   DW_AT_type        : <0x82000>
    <8227e>   DW_AT_data_member_location: 12
 <2><8227f>: Abbrev Number: 0
 <1><82280>: Abbrev Number: 23 (DW_TAG_union_type)
    <82281>   DW_AT_byte_size   : 16
    <82281>   DW_AT_decl_file   : 8
    <82282>   DW_AT_decl_line   : 25
    <82283>   DW_AT_decl_column : 2
    <82283>   DW_AT_sibling     : <0x82298>
 <2><82287>: Abbrev Number: 19 (DW_TAG_member)
    <82288>   DW_AT_type        : <0x82243>
 <2><8228c>: Abbrev Number: 24 (DW_TAG_member)
    <8228d>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <82291>   DW_AT_decl_file   : 8
    <82292>   DW_AT_decl_line   : 29
    <82293>   DW_AT_decl_column : 7
    <82293>   DW_AT_type        : <0x82298>
 <2><82297>: Abbrev Number: 0
 <1><82298>: Abbrev Number: 26 (DW_TAG_array_type)
    <82299>   DW_AT_type        : <0x82000>
    <8229d>   DW_AT_sibling     : <0x822a8>
 <2><822a1>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <822a2>   DW_AT_type        : <0x81feb>
    <822a6>   DW_AT_upper_bound : 3
 <2><822a7>: Abbrev Number: 0
 <1><822a8>: Abbrev Number: 18 (DW_TAG_structure_type)
    <822a9>   DW_AT_byte_size   : 16
    <822aa>   DW_AT_decl_file   : 8
    <822ab>   DW_AT_decl_line   : 32
    <822ac>   DW_AT_decl_column : 3
    <822ac>   DW_AT_sibling     : <0x822e5>
 <2><822b0>: Abbrev Number: 1 (DW_TAG_member)
    <822b1>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <822b5>   DW_AT_decl_file   : 8
    <822b6>   DW_AT_decl_line   : 33
    <822b7>   DW_AT_decl_column : 8
    <822b8>   DW_AT_type        : <0x82000>
    <822bc>   DW_AT_data_member_location: 0
 <2><822bd>: Abbrev Number: 1 (DW_TAG_member)
    <822be>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <822c2>   DW_AT_decl_file   : 8
    <822c3>   DW_AT_decl_line   : 33
    <822c4>   DW_AT_decl_column : 20
    <822c5>   DW_AT_type        : <0x82000>
    <822c9>   DW_AT_data_member_location: 4
 <2><822ca>: Abbrev Number: 1 (DW_TAG_member)
    <822cb>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <822cf>   DW_AT_decl_file   : 8
    <822d0>   DW_AT_decl_line   : 33
    <822d1>   DW_AT_decl_column : 32
    <822d2>   DW_AT_type        : <0x82000>
    <822d6>   DW_AT_data_member_location: 8
 <2><822d7>: Abbrev Number: 1 (DW_TAG_member)
    <822d8>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <822dc>   DW_AT_decl_file   : 8
    <822dd>   DW_AT_decl_line   : 33
    <822de>   DW_AT_decl_column : 44
    <822df>   DW_AT_type        : <0x82000>
    <822e3>   DW_AT_data_member_location: 12
 <2><822e4>: Abbrev Number: 0
 <1><822e5>: Abbrev Number: 23 (DW_TAG_union_type)
    <822e6>   DW_AT_byte_size   : 16
    <822e6>   DW_AT_decl_file   : 8
    <822e7>   DW_AT_decl_line   : 31
    <822e8>   DW_AT_decl_column : 2
    <822e8>   DW_AT_sibling     : <0x822fd>
 <2><822ec>: Abbrev Number: 19 (DW_TAG_member)
    <822ed>   DW_AT_type        : <0x822a8>
 <2><822f1>: Abbrev Number: 24 (DW_TAG_member)
    <822f2>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <822f6>   DW_AT_decl_file   : 8
    <822f7>   DW_AT_decl_line   : 35
    <822f8>   DW_AT_decl_column : 7
    <822f8>   DW_AT_type        : <0x82298>
 <2><822fc>: Abbrev Number: 0
 <1><822fd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <822fe>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <82302>   DW_AT_byte_size   : 216
    <82303>   DW_AT_decl_file   : 8
    <82304>   DW_AT_decl_line   : 16
    <82305>   DW_AT_decl_column : 16
    <82306>   DW_AT_sibling     : <0x8241a>
 <2><8230a>: Abbrev Number: 5 (DW_TAG_member)
    <8230b>   DW_AT_name        : id
    <8230e>   DW_AT_decl_file   : 8
    <8230f>   DW_AT_decl_line   : 17
    <82310>   DW_AT_decl_column : 6
    <82311>   DW_AT_type        : <0x82000>
    <82315>   DW_AT_data_member_location: 0
 <2><82316>: Abbrev Number: 1 (DW_TAG_member)
    <82317>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <8231b>   DW_AT_decl_file   : 8
    <8231c>   DW_AT_decl_line   : 18
    <8231d>   DW_AT_decl_column : 6
    <8231e>   DW_AT_type        : <0x82000>
    <82322>   DW_AT_data_member_location: 4
 <2><82323>: Abbrev Number: 1 (DW_TAG_member)
    <82324>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <82328>   DW_AT_decl_file   : 8
    <82329>   DW_AT_decl_line   : 19
    <8232a>   DW_AT_decl_column : 18
    <8232b>   DW_AT_type        : <0x8241a>
    <8232f>   DW_AT_data_member_location: 8
 <2><82330>: Abbrev Number: 1 (DW_TAG_member)
    <82331>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <82335>   DW_AT_decl_file   : 8
    <82336>   DW_AT_decl_line   : 20
    <82337>   DW_AT_decl_column : 6
    <82338>   DW_AT_type        : <0x82000>
    <8233c>   DW_AT_data_member_location: 16
 <2><8233d>: Abbrev Number: 1 (DW_TAG_member)
    <8233e>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <82342>   DW_AT_decl_file   : 8
    <82343>   DW_AT_decl_line   : 21
    <82344>   DW_AT_decl_column : 6
    <82345>   DW_AT_type        : <0x82000>
    <82349>   DW_AT_data_member_location: 20
 <2><8234a>: Abbrev Number: 1 (DW_TAG_member)
    <8234b>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <8234f>   DW_AT_decl_file   : 8
    <82350>   DW_AT_decl_line   : 22
    <82351>   DW_AT_decl_column : 6
    <82352>   DW_AT_type        : <0x82000>
    <82356>   DW_AT_data_member_location: 24
 <2><82357>: Abbrev Number: 1 (DW_TAG_member)
    <82358>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <8235c>   DW_AT_decl_file   : 8
    <8235d>   DW_AT_decl_line   : 23
    <8235e>   DW_AT_decl_column : 8
    <8235f>   DW_AT_type        : <0x82018>
    <82363>   DW_AT_data_member_location: 32
 <2><82364>: Abbrev Number: 1 (DW_TAG_member)
    <82365>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <82369>   DW_AT_decl_file   : 8
    <8236a>   DW_AT_decl_line   : 24
    <8236b>   DW_AT_decl_column : 8
    <8236c>   DW_AT_type        : <0x820b9>
    <82370>   DW_AT_data_member_location: 40
 <2><82371>: Abbrev Number: 1 (DW_TAG_member)
    <82372>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <82376>   DW_AT_decl_file   : 8
    <82377>   DW_AT_decl_line   : 24
    <82378>   DW_AT_decl_column : 16
    <82379>   DW_AT_type        : <0x820b9>
    <8237d>   DW_AT_data_member_location: 44
 <2><8237e>: Abbrev Number: 25 (DW_TAG_member)
    <8237f>   DW_AT_type        : <0x82280>
    <82383>   DW_AT_data_member_location: 48
 <2><82384>: Abbrev Number: 25 (DW_TAG_member)
    <82385>   DW_AT_type        : <0x822e5>
    <82389>   DW_AT_data_member_location: 64
 <2><8238a>: Abbrev Number: 1 (DW_TAG_member)
    <8238b>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <8238f>   DW_AT_decl_file   : 8
    <82390>   DW_AT_decl_line   : 37
    <82391>   DW_AT_decl_column : 8
    <82392>   DW_AT_type        : <0x820b9>
    <82396>   DW_AT_data_member_location: 80
 <2><82397>: Abbrev Number: 1 (DW_TAG_member)
    <82398>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <8239c>   DW_AT_decl_file   : 8
    <8239d>   DW_AT_decl_line   : 37
    <8239e>   DW_AT_decl_column : 15
    <8239f>   DW_AT_type        : <0x820b9>
    <823a3>   DW_AT_data_member_location: 84
 <2><823a4>: Abbrev Number: 1 (DW_TAG_member)
    <823a5>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <823a9>   DW_AT_decl_file   : 8
    <823aa>   DW_AT_decl_line   : 37
    <823ab>   DW_AT_decl_column : 22
    <823ac>   DW_AT_type        : <0x820b9>
    <823b0>   DW_AT_data_member_location: 88
 <2><823b1>: Abbrev Number: 1 (DW_TAG_member)
    <823b2>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <823b6>   DW_AT_decl_file   : 8
    <823b7>   DW_AT_decl_line   : 37
    <823b8>   DW_AT_decl_column : 29
    <823b9>   DW_AT_type        : <0x820b9>
    <823bd>   DW_AT_data_member_location: 92
 <2><823be>: Abbrev Number: 1 (DW_TAG_member)
    <823bf>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <823c3>   DW_AT_decl_file   : 8
    <823c4>   DW_AT_decl_line   : 38
    <823c5>   DW_AT_decl_column : 15
    <823c6>   DW_AT_type        : <0x81fe4>
    <823ca>   DW_AT_data_member_location: 96
 <2><823cb>: Abbrev Number: 1 (DW_TAG_member)
    <823cc>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <823d0>   DW_AT_decl_file   : 8
    <823d1>   DW_AT_decl_line   : 38
    <823d2>   DW_AT_decl_column : 25
