    <7bbd3>   DW_AT_decl_column : 9
    <7bbd3>   DW_AT_type        : <0x7b1a1>
    <7bbd7>   DW_AT_location    : 0x237ea (location list)
    <7bbdb>   DW_AT_GNU_locviews: 0x237e8
 <2><7bbdf>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <7bbe0>   DW_AT_name        : fy
    <7bbe3>   DW_AT_decl_file   : 1
    <7bbe3>   DW_AT_decl_line   : 35
    <7bbe4>   DW_AT_decl_column : 9
    <7bbe4>   DW_AT_type        : <0x7b1a1>
    <7bbe8>   DW_AT_location    : 0x237f2 (location list)
    <7bbec>   DW_AT_GNU_locviews: 0x237f0
 <2><7bbf0>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <7bbf1>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7bbf5>   DW_AT_decl_file   : 1
    <7bbf5>   DW_AT_decl_line   : 36
    <7bbf6>   DW_AT_decl_column : 7
    <7bbf7>   DW_AT_type        : <0x7b059>
    <7bbfb>   DW_AT_location    : 0x2380e (location list)
    <7bbff>   DW_AT_GNU_locviews: 0x237f8
 <2><7bc03>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <7bc04>   DW_AT_name        : (indirect string, offset: 0x1a81f): string
    <7bc08>   DW_AT_decl_file   : 1
    <7bc08>   DW_AT_decl_line   : 37
    <7bc09>   DW_AT_decl_column : 13
    <7bc0a>   DW_AT_type        : <0x7b1a8>
    <7bc0e>   DW_AT_location    : 0x2387c (location list)
    <7bc12>   DW_AT_GNU_locviews: 0x23868
 <2><7bc16>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <7bc17>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7bc1b>   DW_AT_decl_file   : 1

    <7c0f9>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><7c0fd>: Abbrev Number: 11 (DW_TAG_base_type)
    <7c0fe>   DW_AT_byte_size   : 8
    <7c0ff>   DW_AT_encoding    : 7	(unsigned)
    <7c100>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><7c104>: Abbrev Number: 20 (DW_TAG_array_type)
    <7c105>   DW_AT_type        : <0x7c0ca>
    <7c109>   DW_AT_sibling     : <0x7c114>
 <2><7c10d>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <7c10e>   DW_AT_type        : <0x7c096>
    <7c112>   DW_AT_upper_bound : 7
 <2><7c113>: Abbrev Number: 0
 <1><7c114>: Abbrev Number: 47 (DW_TAG_enumeration_type)
    <7c115>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <7c119>   DW_AT_encoding    : 7	(unsigned)
    <7c11a>   DW_AT_byte_size   : 4
    <7c11b>   DW_AT_type        : <0x7c08f>
    <7c11f>   DW_AT_decl_file   : 9
    <7c120>   DW_AT_decl_line   : 1
    <7c121>   DW_AT_decl_column : 14
    <7c122>   DW_AT_sibling     : <0x7c199>
 <2><7c126>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c127>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <7c12b>   DW_AT_const_value : 0
 <2><7c12c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c12d>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <7c131>   DW_AT_const_value : 1
 <2><7c132>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c133>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <7c137>   DW_AT_const_value : 2
 <2><7c138>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c139>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <7c13d>   DW_AT_const_value : 3
 <2><7c13e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c13f>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <7c143>   DW_AT_const_value : 4
 <2><7c144>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c145>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <7c149>   DW_AT_const_value : 5
 <2><7c14a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c14b>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <7c14f>   DW_AT_const_value : 6
 <2><7c150>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c151>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <7c155>   DW_AT_const_value : 7
 <2><7c156>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c157>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <7c15b>   DW_AT_const_value : 8
 <2><7c15c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c15d>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <7c161>   DW_AT_const_value : 9
 <2><7c162>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c163>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <7c167>   DW_AT_const_value : 10
 <2><7c168>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c169>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <7c16d>   DW_AT_const_value : 11
 <2><7c16e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c16f>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <7c173>   DW_AT_const_value : 12
 <2><7c174>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c175>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <7c179>   DW_AT_const_value : 13
 <2><7c17a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c17b>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <7c17f>   DW_AT_const_value : 14
 <2><7c180>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c181>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <7c185>   DW_AT_const_value : 15
 <2><7c186>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c187>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <7c18b>   DW_AT_const_value : 16
 <2><7c18c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c18d>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <7c191>   DW_AT_const_value : 17
 <2><7c192>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7c193>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <7c197>   DW_AT_const_value : 18
 <2><7c198>: Abbrev Number: 0
 <1><7c199>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c19a>   DW_AT_byte_size   : 8
    <7c19a>   DW_AT_type        : <0x7c19e>
 <1><7c19e>: Abbrev Number: 48 (DW_TAG_subroutine_type)
    <7c19f>   DW_AT_prototyped  : 1
 <1><7c19f>: Abbrev Number: 11 (DW_TAG_base_type)
    <7c1a0>   DW_AT_byte_size   : 8
    <7c1a1>   DW_AT_encoding    : 4	(float)
    <7c1a2>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><7c1a6>: Abbrev Number: 11 (DW_TAG_base_type)
    <7c1a7>   DW_AT_byte_size   : 4
    <7c1a8>   DW_AT_encoding    : 4	(float)
    <7c1a9>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><7c1ad>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c1ae>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <7c1b2>   DW_AT_decl_file   : 4
    <7c1b3>   DW_AT_decl_line   : 7
    <7c1b4>   DW_AT_decl_column : 25
    <7c1b5>   DW_AT_type        : <0x7c1b9>
 <1><7c1b9>: Abbrev Number: 49 (DW_TAG_structure_type)
    <7c1ba>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <7c1be>   DW_AT_declaration : 1
 <1><7c1be>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7c1bf>   DW_AT_byte_size   : 8
    <7c1c0>   DW_AT_decl_file   : 5
    <7c1c1>   DW_AT_decl_line   : 4
    <7c1c2>   DW_AT_decl_column : 3
    <7c1c2>   DW_AT_sibling     : <0x7c1e1>
 <2><7c1c6>: Abbrev Number: 1 (DW_TAG_member)
    <7c1c7>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <7c1cb>   DW_AT_decl_file   : 5
    <7c1cc>   DW_AT_decl_line   : 5
    <7c1cd>   DW_AT_decl_column : 8
    <7c1ce>   DW_AT_type        : <0x7c0ab>
    <7c1d2>   DW_AT_data_member_location: 0
 <2><7c1d3>: Abbrev Number: 1 (DW_TAG_member)
    <7c1d4>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <7c1d8>   DW_AT_decl_file   : 5
    <7c1d9>   DW_AT_decl_line   : 6
    <7c1da>   DW_AT_decl_column : 8
    <7c1db>   DW_AT_type        : <0x7c0ab>
    <7c1df>   DW_AT_data_member_location: 4
 <2><7c1e0>: Abbrev Number: 0
 <1><7c1e1>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7c1e2>   DW_AT_byte_size   : 16
    <7c1e3>   DW_AT_decl_file   : 5
    <7c1e4>   DW_AT_decl_line   : 8
    <7c1e5>   DW_AT_decl_column : 3
    <7c1e5>   DW_AT_sibling     : <0x7c218>
 <2><7c1e9>: Abbrev Number: 10 (DW_TAG_member)
    <7c1ea>   DW_AT_name        : x
    <7c1ec>   DW_AT_decl_file   : 5
    <7c1ed>   DW_AT_decl_line   : 9
    <7c1ee>   DW_AT_decl_column : 8
    <7c1ef>   DW_AT_type        : <0x7c0ab>
    <7c1f3>   DW_AT_data_member_location: 0
 <2><7c1f4>: Abbrev Number: 10 (DW_TAG_member)
    <7c1f5>   DW_AT_name        : y
    <7c1f7>   DW_AT_decl_file   : 5
    <7c1f8>   DW_AT_decl_line   : 9
    <7c1f9>   DW_AT_decl_column : 11
    <7c1fa>   DW_AT_type        : <0x7c0ab>
    <7c1fe>   DW_AT_data_member_location: 4
 <2><7c1ff>: Abbrev Number: 10 (DW_TAG_member)
    <7c200>   DW_AT_name        : dx
    <7c203>   DW_AT_decl_file   : 5
    <7c204>   DW_AT_decl_line   : 10
    <7c205>   DW_AT_decl_column : 8
    <7c206>   DW_AT_type        : <0x7c0ab>
    <7c20a>   DW_AT_data_member_location: 8
 <2><7c20b>: Abbrev Number: 10 (DW_TAG_member)
    <7c20c>   DW_AT_name        : dy
    <7c20f>   DW_AT_decl_file   : 5
    <7c210>   DW_AT_decl_line   : 10
    <7c211>   DW_AT_decl_column : 12
    <7c212>   DW_AT_type        : <0x7c0ab>
    <7c216>   DW_AT_data_member_location: 12
 <2><7c217>: Abbrev Number: 0
 <1><7c218>: Abbrev Number: 29 (DW_TAG_union_type)
    <7c219>   DW_AT_byte_size   : 16
    <7c219>   DW_AT_decl_file   : 5
    <7c21a>   DW_AT_decl_line   : 3
    <7c21b>   DW_AT_decl_column : 2
    <7c21b>   DW_AT_sibling     : <0x7c245>
 <2><7c21f>: Abbrev Number: 22 (DW_TAG_member)
    <7c220>   DW_AT_type        : <0x7c1be>
 <2><7c224>: Abbrev Number: 22 (DW_TAG_member)
    <7c225>   DW_AT_type        : <0x7c1e1>
 <2><7c229>: Abbrev Number: 30 (DW_TAG_member)
    <7c22a>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <7c22e>   DW_AT_decl_file   : 5
    <7c22f>   DW_AT_decl_line   : 12
    <7c230>   DW_AT_decl_column : 7
    <7c230>   DW_AT_type        : <0x7c0ab>
 <2><7c234>: Abbrev Number: 35 (DW_TAG_member)
    <7c235>   DW_AT_name        : z
    <7c237>   DW_AT_decl_file   : 5
    <7c237>   DW_AT_decl_line   : 13
    <7c238>   DW_AT_decl_column : 7
    <7c238>   DW_AT_type        : <0x7c0ab>
 <2><7c23c>: Abbrev Number: 35 (DW_TAG_member)
    <7c23d>   DW_AT_name        : w
    <7c23f>   DW_AT_decl_file   : 5
    <7c23f>   DW_AT_decl_line   : 14
    <7c240>   DW_AT_decl_column : 7
    <7c240>   DW_AT_type        : <0x7c0ab>
 <2><7c244>: Abbrev Number: 0
 <1><7c245>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7c246>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <7c24a>   DW_AT_byte_size   : 20
    <7c24b>   DW_AT_decl_file   : 5
    <7c24c>   DW_AT_decl_line   : 1
    <7c24d>   DW_AT_decl_column : 8
    <7c24e>   DW_AT_sibling     : <0x7c266>
 <2><7c252>: Abbrev Number: 1 (DW_TAG_member)
    <7c253>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7c257>   DW_AT_decl_file   : 5
    <7c258>   DW_AT_decl_line   : 2
    <7c259>   DW_AT_decl_column : 6
    <7c25a>   DW_AT_type        : <0x7c0ab>
    <7c25e>   DW_AT_data_member_location: 0
 <2><7c25f>: Abbrev Number: 23 (DW_TAG_member)
    <7c260>   DW_AT_type        : <0x7c218>
    <7c264>   DW_AT_data_member_location: 4
 <2><7c265>: Abbrev Number: 0
 <1><7c266>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c267>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <7c26b>   DW_AT_decl_file   : 5
    <7c26c>   DW_AT_decl_line   : 18
    <7c26d>   DW_AT_decl_column : 23
    <7c26e>   DW_AT_type        : <0x7c245>
 <1><7c272>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c273>   DW_AT_byte_size   : 8
    <7c273>   DW_AT_type        : <0x7c277>
 <1><7c277>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c278>   DW_AT_prototyped  : 1
    <7c278>   DW_AT_type        : <0x7c0ab>
    <7c27c>   DW_AT_sibling     : <0x7c28b>
 <2><7c280>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c281>   DW_AT_type        : <0x7c0ab>
 <2><7c285>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c286>   DW_AT_type        : <0x7c0ab>
 <2><7c28a>: Abbrev Number: 0
 <1><7c28b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c28c>   DW_AT_byte_size   : 8
    <7c28c>   DW_AT_type        : <0x7c0ab>
 <1><7c290>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c291>   DW_AT_byte_size   : 8
    <7c291>   DW_AT_type        : <0x7c295>
 <1><7c295>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c296>   DW_AT_prototyped  : 1
    <7c296>   DW_AT_type        : <0x7c0ab>
    <7c29a>   DW_AT_sibling     : <0x7c2b8>
 <2><7c29e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c29f>   DW_AT_type        : <0x7c28b>
 <2><7c2a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2a4>   DW_AT_type        : <0x7c28b>
 <2><7c2a8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2a9>   DW_AT_type        : <0x7c28b>
 <2><7c2ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2ae>   DW_AT_type        : <0x7c28b>
 <2><7c2b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2b3>   DW_AT_type        : <0x7c28b>
 <2><7c2b7>: Abbrev Number: 0
 <1><7c2b8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c2b9>   DW_AT_byte_size   : 8
    <7c2b9>   DW_AT_type        : <0x7c266>
 <1><7c2bd>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c2be>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <7c2c2>   DW_AT_decl_file   : 6
    <7c2c3>   DW_AT_decl_line   : 13
    <7c2c4>   DW_AT_decl_column : 30
    <7c2c5>   DW_AT_type        : <0x7c2c9>
 <1><7c2c9>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c2ca>   DW_AT_prototyped  : 1
    <7c2ca>   DW_AT_type        : <0x7c08f>
    <7c2ce>   DW_AT_sibling     : <0x7c2e2>
 <2><7c2d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2d3>   DW_AT_type        : <0x7c08f>
 <2><7c2d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2d8>   DW_AT_type        : <0x7c08f>
 <2><7c2dc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2dd>   DW_AT_type        : <0x7c0c3>
 <2><7c2e1>: Abbrev Number: 0
 <1><7c2e2>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c2e3>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <7c2e7>   DW_AT_decl_file   : 6
    <7c2e8>   DW_AT_decl_line   : 14
    <7c2e9>   DW_AT_decl_column : 15
    <7c2ea>   DW_AT_type        : <0x7c2ee>
 <1><7c2ee>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7c2ef>   DW_AT_prototyped  : 1
    <7c2ef>   DW_AT_sibling     : <0x7c321>
 <2><7c2f3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2f4>   DW_AT_type        : <0x7c321>
 <2><7c2f8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2f9>   DW_AT_type        : <0x7c321>
 <2><7c2fd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c2fe>   DW_AT_type        : <0x7c0ab>
 <2><7c302>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c303>   DW_AT_type        : <0x7c0ab>
 <2><7c307>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c308>   DW_AT_type        : <0x7c0ab>
 <2><7c30c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c30d>   DW_AT_type        : <0x7c0ab>
 <2><7c311>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c312>   DW_AT_type        : <0x7c0ab>
 <2><7c316>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c317>   DW_AT_type        : <0x7c326>
 <2><7c31b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c31c>   DW_AT_type        : <0x7c0c3>
 <2><7c320>: Abbrev Number: 0
 <1><7c321>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c322>   DW_AT_byte_size   : 8
    <7c322>   DW_AT_type        : <0x7c07c>
 <1><7c326>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c327>   DW_AT_byte_size   : 8
    <7c327>   DW_AT_type        : <0x7c2bd>
 <1><7c32b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7c32c>   DW_AT_byte_size   : 16
    <7c32d>   DW_AT_decl_file   : 6
    <7c32e>   DW_AT_decl_line   : 26
    <7c32f>   DW_AT_decl_column : 3
    <7c32f>   DW_AT_sibling     : <0x7c368>
 <2><7c333>: Abbrev Number: 1 (DW_TAG_member)
    <7c334>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <7c338>   DW_AT_decl_file   : 6
    <7c339>   DW_AT_decl_line   : 27
    <7c33a>   DW_AT_decl_column : 8
    <7c33b>   DW_AT_type        : <0x7c0ab>
    <7c33f>   DW_AT_data_member_location: 0
 <2><7c340>: Abbrev Number: 1 (DW_TAG_member)
    <7c341>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <7c345>   DW_AT_decl_file   : 6
    <7c346>   DW_AT_decl_line   : 27
    <7c347>   DW_AT_decl_column : 16
    <7c348>   DW_AT_type        : <0x7c0ab>
    <7c34c>   DW_AT_data_member_location: 4
 <2><7c34d>: Abbrev Number: 1 (DW_TAG_member)
    <7c34e>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <7c352>   DW_AT_decl_file   : 6
    <7c353>   DW_AT_decl_line   : 27
    <7c354>   DW_AT_decl_column : 24
    <7c355>   DW_AT_type        : <0x7c0ab>
    <7c359>   DW_AT_data_member_location: 8
 <2><7c35a>: Abbrev Number: 1 (DW_TAG_member)
    <7c35b>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <7c35f>   DW_AT_decl_file   : 6
    <7c360>   DW_AT_decl_line   : 27
    <7c361>   DW_AT_decl_column : 32
    <7c362>   DW_AT_type        : <0x7c0ab>
    <7c366>   DW_AT_data_member_location: 12
 <2><7c367>: Abbrev Number: 0
 <1><7c368>: Abbrev Number: 29 (DW_TAG_union_type)
    <7c369>   DW_AT_byte_size   : 16
    <7c369>   DW_AT_decl_file   : 6
    <7c36a>   DW_AT_decl_line   : 25
    <7c36b>   DW_AT_decl_column : 2
    <7c36b>   DW_AT_sibling     : <0x7c380>
 <2><7c36f>: Abbrev Number: 22 (DW_TAG_member)
    <7c370>   DW_AT_type        : <0x7c32b>
 <2><7c374>: Abbrev Number: 30 (DW_TAG_member)
    <7c375>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <7c379>   DW_AT_decl_file   : 6
    <7c37a>   DW_AT_decl_line   : 29
    <7c37b>   DW_AT_decl_column : 7
    <7c37b>   DW_AT_type        : <0x7c380>
 <2><7c37f>: Abbrev Number: 0
 <1><7c380>: Abbrev Number: 20 (DW_TAG_array_type)
    <7c381>   DW_AT_type        : <0x7c0ab>
    <7c385>   DW_AT_sibling     : <0x7c390>
 <2><7c389>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <7c38a>   DW_AT_type        : <0x7c096>
    <7c38e>   DW_AT_upper_bound : 3
 <2><7c38f>: Abbrev Number: 0
 <1><7c390>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7c391>   DW_AT_byte_size   : 16
    <7c392>   DW_AT_decl_file   : 6
    <7c393>   DW_AT_decl_line   : 32
    <7c394>   DW_AT_decl_column : 3
    <7c394>   DW_AT_sibling     : <0x7c3cd>
 <2><7c398>: Abbrev Number: 1 (DW_TAG_member)
    <7c399>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <7c39d>   DW_AT_decl_file   : 6
    <7c39e>   DW_AT_decl_line   : 33
    <7c39f>   DW_AT_decl_column : 8
    <7c3a0>   DW_AT_type        : <0x7c0ab>
    <7c3a4>   DW_AT_data_member_location: 0
 <2><7c3a5>: Abbrev Number: 1 (DW_TAG_member)
    <7c3a6>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <7c3aa>   DW_AT_decl_file   : 6
    <7c3ab>   DW_AT_decl_line   : 33
    <7c3ac>   DW_AT_decl_column : 20
    <7c3ad>   DW_AT_type        : <0x7c0ab>
    <7c3b1>   DW_AT_data_member_location: 4
 <2><7c3b2>: Abbrev Number: 1 (DW_TAG_member)
    <7c3b3>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <7c3b7>   DW_AT_decl_file   : 6
    <7c3b8>   DW_AT_decl_line   : 33
    <7c3b9>   DW_AT_decl_column : 32
    <7c3ba>   DW_AT_type        : <0x7c0ab>
    <7c3be>   DW_AT_data_member_location: 8
 <2><7c3bf>: Abbrev Number: 1 (DW_TAG_member)
    <7c3c0>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <7c3c4>   DW_AT_decl_file   : 6
    <7c3c5>   DW_AT_decl_line   : 33
    <7c3c6>   DW_AT_decl_column : 44
    <7c3c7>   DW_AT_type        : <0x7c0ab>
    <7c3cb>   DW_AT_data_member_location: 12
 <2><7c3cc>: Abbrev Number: 0
 <1><7c3cd>: Abbrev Number: 29 (DW_TAG_union_type)
    <7c3ce>   DW_AT_byte_size   : 16
    <7c3ce>   DW_AT_decl_file   : 6
    <7c3cf>   DW_AT_decl_line   : 31
    <7c3d0>   DW_AT_decl_column : 2
    <7c3d0>   DW_AT_sibling     : <0x7c3e5>
 <2><7c3d4>: Abbrev Number: 22 (DW_TAG_member)
    <7c3d5>   DW_AT_type        : <0x7c390>
 <2><7c3d9>: Abbrev Number: 30 (DW_TAG_member)
    <7c3da>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <7c3de>   DW_AT_decl_file   : 6
    <7c3df>   DW_AT_decl_line   : 35
    <7c3e0>   DW_AT_decl_column : 7
    <7c3e0>   DW_AT_type        : <0x7c380>
 <2><7c3e4>: Abbrev Number: 0
 <1><7c3e5>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7c3e6>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <7c3ea>   DW_AT_byte_size   : 216
    <7c3eb>   DW_AT_decl_file   : 6
    <7c3ec>   DW_AT_decl_line   : 16
    <7c3ed>   DW_AT_decl_column : 16
    <7c3ee>   DW_AT_sibling     : <0x7c502>
 <2><7c3f2>: Abbrev Number: 10 (DW_TAG_member)
    <7c3f3>   DW_AT_name        : id
    <7c3f6>   DW_AT_decl_file   : 6
    <7c3f7>   DW_AT_decl_line   : 17
    <7c3f8>   DW_AT_decl_column : 6
    <7c3f9>   DW_AT_type        : <0x7c0ab>
    <7c3fd>   DW_AT_data_member_location: 0
 <2><7c3fe>: Abbrev Number: 1 (DW_TAG_member)
    <7c3ff>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <7c403>   DW_AT_decl_file   : 6
    <7c404>   DW_AT_decl_line   : 18
    <7c405>   DW_AT_decl_column : 6
    <7c406>   DW_AT_type        : <0x7c0ab>
    <7c40a>   DW_AT_data_member_location: 4
 <2><7c40b>: Abbrev Number: 1 (DW_TAG_member)
    <7c40c>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <7c410>   DW_AT_decl_file   : 6
    <7c411>   DW_AT_decl_line   : 19
    <7c412>   DW_AT_decl_column : 18
    <7c413>   DW_AT_type        : <0x7c502>
    <7c417>   DW_AT_data_member_location: 8
 <2><7c418>: Abbrev Number: 1 (DW_TAG_member)
    <7c419>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <7c41d>   DW_AT_decl_file   : 6
    <7c41e>   DW_AT_decl_line   : 20
    <7c41f>   DW_AT_decl_column : 6
    <7c420>   DW_AT_type        : <0x7c0ab>
    <7c424>   DW_AT_data_member_location: 16
 <2><7c425>: Abbrev Number: 1 (DW_TAG_member)
    <7c426>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <7c42a>   DW_AT_decl_file   : 6
    <7c42b>   DW_AT_decl_line   : 21
    <7c42c>   DW_AT_decl_column : 6
    <7c42d>   DW_AT_type        : <0x7c0ab>
    <7c431>   DW_AT_data_member_location: 20
 <2><7c432>: Abbrev Number: 1 (DW_TAG_member)
    <7c433>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <7c437>   DW_AT_decl_file   : 6
    <7c438>   DW_AT_decl_line   : 22
    <7c439>   DW_AT_decl_column : 6
    <7c43a>   DW_AT_type        : <0x7c0ab>
    <7c43e>   DW_AT_data_member_location: 24
 <2><7c43f>: Abbrev Number: 1 (DW_TAG_member)
    <7c440>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <7c444>   DW_AT_decl_file   : 6
    <7c445>   DW_AT_decl_line   : 23
    <7c446>   DW_AT_decl_column : 8
    <7c447>   DW_AT_type        : <0x7c0c3>
    <7c44b>   DW_AT_data_member_location: 32
 <2><7c44c>: Abbrev Number: 1 (DW_TAG_member)
    <7c44d>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <7c451>   DW_AT_decl_file   : 6
    <7c452>   DW_AT_decl_line   : 24
    <7c453>   DW_AT_decl_column : 8
    <7c454>   DW_AT_type        : <0x7c1a6>
    <7c458>   DW_AT_data_member_location: 40
 <2><7c459>: Abbrev Number: 1 (DW_TAG_member)
    <7c45a>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <7c45e>   DW_AT_decl_file   : 6
    <7c45f>   DW_AT_decl_line   : 24
    <7c460>   DW_AT_decl_column : 16
    <7c461>   DW_AT_type        : <0x7c1a6>
    <7c465>   DW_AT_data_member_location: 44
 <2><7c466>: Abbrev Number: 23 (DW_TAG_member)
    <7c467>   DW_AT_type        : <0x7c368>
    <7c46b>   DW_AT_data_member_location: 48
 <2><7c46c>: Abbrev Number: 23 (DW_TAG_member)
    <7c46d>   DW_AT_type        : <0x7c3cd>
    <7c471>   DW_AT_data_member_location: 64
 <2><7c472>: Abbrev Number: 1 (DW_TAG_member)
    <7c473>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <7c477>   DW_AT_decl_file   : 6
    <7c478>   DW_AT_decl_line   : 37
    <7c479>   DW_AT_decl_column : 8
    <7c47a>   DW_AT_type        : <0x7c1a6>
    <7c47e>   DW_AT_data_member_location: 80
 <2><7c47f>: Abbrev Number: 1 (DW_TAG_member)
    <7c480>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <7c484>   DW_AT_decl_file   : 6
    <7c485>   DW_AT_decl_line   : 37
    <7c486>   DW_AT_decl_column : 15
    <7c487>   DW_AT_type        : <0x7c1a6>
    <7c48b>   DW_AT_data_member_location: 84
 <2><7c48c>: Abbrev Number: 1 (DW_TAG_member)
    <7c48d>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <7c491>   DW_AT_decl_file   : 6
    <7c492>   DW_AT_decl_line   : 37
    <7c493>   DW_AT_decl_column : 22
    <7c494>   DW_AT_type        : <0x7c1a6>
    <7c498>   DW_AT_data_member_location: 88
 <2><7c499>: Abbrev Number: 1 (DW_TAG_member)
    <7c49a>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <7c49e>   DW_AT_decl_file   : 6
    <7c49f>   DW_AT_decl_line   : 37
    <7c4a0>   DW_AT_decl_column : 29
    <7c4a1>   DW_AT_type        : <0x7c1a6>
    <7c4a5>   DW_AT_data_member_location: 92
 <2><7c4a6>: Abbrev Number: 1 (DW_TAG_member)
    <7c4a7>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <7c4ab>   DW_AT_decl_file   : 6
    <7c4ac>   DW_AT_decl_line   : 38
    <7c4ad>   DW_AT_decl_column : 15
    <7c4ae>   DW_AT_type        : <0x7c08f>
    <7c4b2>   DW_AT_data_member_location: 96
 <2><7c4b3>: Abbrev Number: 1 (DW_TAG_member)
    <7c4b4>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <7c4b8>   DW_AT_decl_file   : 6
    <7c4b9>   DW_AT_decl_line   : 38
    <7c4ba>   DW_AT_decl_column : 25
    <7c4bb>   DW_AT_type        : <0x7c08f>
    <7c4bf>   DW_AT_data_member_location: 100
 <2><7c4c0>: Abbrev Number: 1 (DW_TAG_member)
    <7c4c1>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <7c4c5>   DW_AT_decl_file   : 6
    <7c4c6>   DW_AT_decl_line   : 39
    <7c4c7>   DW_AT_decl_column : 9
    <7c4c8>   DW_AT_type        : <0x7c526>
    <7c4cc>   DW_AT_data_member_location: 104
 <2><7c4cd>: Abbrev Number: 1 (DW_TAG_member)
    <7c4ce>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <7c4d2>   DW_AT_decl_file   : 6
    <7c4d3>   DW_AT_decl_line   : 40
    <7c4d4>   DW_AT_decl_column : 17
    <7c4d5>   DW_AT_type        : <0x7c544>
    <7c4d9>   DW_AT_data_member_location: 112
 <2><7c4da>: Abbrev Number: 1 (DW_TAG_member)
    <7c4db>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <7c4df>   DW_AT_decl_file   : 6
    <7c4e0>   DW_AT_decl_line   : 41
    <7c4e1>   DW_AT_decl_column : 10
    <7c4e2>   DW_AT_type        : <0x7c562>
    <7c4e6>   DW_AT_data_member_location: 120
 <2><7c4e7>: Abbrev Number: 1 (DW_TAG_member)
    <7c4e8>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <7c4ec>   DW_AT_decl_file   : 6
    <7c4ed>   DW_AT_decl_line   : 42
    <7c4ee>   DW_AT_decl_column : 11
    <7c4ef>   DW_AT_type        : <0x7c567>
    <7c4f3>   DW_AT_data_member_location: 128
 <2><7c4f4>: Abbrev Number: 1 (DW_TAG_member)
    <7c4f5>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7c4f9>   DW_AT_decl_file   : 6
    <7c4fa>   DW_AT_decl_line   : 43
    <7c4fb>   DW_AT_decl_column : 6
    <7c4fc>   DW_AT_type        : <0x7c0ab>
    <7c500>   DW_AT_data_member_location: 208
 <2><7c501>: Abbrev Number: 0
 <1><7c502>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c503>   DW_AT_byte_size   : 8
    <7c503>   DW_AT_type        : <0x7c321>
 <1><7c507>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7c508>   DW_AT_prototyped  : 1
    <7c508>   DW_AT_sibling     : <0x7c521>
 <2><7c50c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c50d>   DW_AT_type        : <0x7c521>
 <2><7c511>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c512>   DW_AT_type        : <0x7c0ab>
 <2><7c516>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c517>   DW_AT_type        : <0x7c0ab>
 <2><7c51b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c51c>   DW_AT_type        : <0x7c08f>
 <2><7c520>: Abbrev Number: 0
 <1><7c521>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c522>   DW_AT_byte_size   : 8
    <7c522>   DW_AT_type        : <0x7c3e5>
 <1><7c526>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c527>   DW_AT_byte_size   : 8
    <7c527>   DW_AT_type        : <0x7c507>
 <1><7c52b>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c52c>   DW_AT_prototyped  : 1
    <7c52c>   DW_AT_type        : <0x7c08f>
    <7c530>   DW_AT_sibling     : <0x7c544>
 <2><7c534>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c535>   DW_AT_type        : <0x7c521>
 <2><7c539>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c53a>   DW_AT_type        : <0x7c0ab>
 <2><7c53e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c53f>   DW_AT_type        : <0x7c0ab>
 <2><7c543>: Abbrev Number: 0
 <1><7c544>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c545>   DW_AT_byte_size   : 8
    <7c545>   DW_AT_type        : <0x7c52b>
 <1><7c549>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c54a>   DW_AT_prototyped  : 1
    <7c54a>   DW_AT_type        : <0x7c0c3>
    <7c54e>   DW_AT_sibling     : <0x7c562>
 <2><7c552>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c553>   DW_AT_type        : <0x7c0c3>
 <2><7c557>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c558>   DW_AT_type        : <0x7c0ab>
 <2><7c55c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c55d>   DW_AT_type        : <0x7c0dd>
 <2><7c561>: Abbrev Number: 0
 <1><7c562>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c563>   DW_AT_byte_size   : 8
    <7c563>   DW_AT_type        : <0x7c549>
 <1><7c567>: Abbrev Number: 20 (DW_TAG_array_type)
    <7c568>   DW_AT_type        : <0x7c577>
    <7c56c>   DW_AT_sibling     : <0x7c577>
 <2><7c570>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <7c571>   DW_AT_type        : <0x7c096>
    <7c575>   DW_AT_upper_bound : 9
 <2><7c576>: Abbrev Number: 0
 <1><7c577>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c578>   DW_AT_byte_size   : 8
    <7c578>   DW_AT_type        : <0x7c57c>
 <1><7c57c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c57d>   DW_AT_byte_size   : 8
    <7c57d>   DW_AT_type        : <0x7c2e2>
 <1><7c581>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c582>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <7c586>   DW_AT_decl_file   : 6
    <7c587>   DW_AT_decl_line   : 44
    <7c588>   DW_AT_decl_column : 3
    <7c589>   DW_AT_type        : <0x7c3e5>
 <1><7c58d>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7c58e>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <7c592>   DW_AT_byte_size   : 12
    <7c593>   DW_AT_decl_file   : 7
    <7c594>   DW_AT_decl_line   : 139
    <7c595>   DW_AT_decl_column : 16
    <7c596>   DW_AT_sibling     : <0x7c5bf>
 <2><7c59a>: Abbrev Number: 10 (DW_TAG_member)
    <7c59b>   DW_AT_name        : ch
    <7c59e>   DW_AT_decl_file   : 7
    <7c59f>   DW_AT_decl_line   : 140
    <7c5a0>   DW_AT_decl_column : 14
    <7c5a1>   DW_AT_type        : <0x7c0e9>
    <7c5a5>   DW_AT_data_member_location: 0
 <2><7c5a6>: Abbrev Number: 10 (DW_TAG_member)
    <7c5a7>   DW_AT_name        : fg
    <7c5aa>   DW_AT_decl_file   : 7
    <7c5ab>   DW_AT_decl_line   : 141
    <7c5ac>   DW_AT_decl_column : 14
    <7c5ad>   DW_AT_type        : <0x7c08f>
    <7c5b1>   DW_AT_data_member_location: 4
 <2><7c5b2>: Abbrev Number: 10 (DW_TAG_member)
    <7c5b3>   DW_AT_name        : bg
    <7c5b6>   DW_AT_decl_file   : 7
    <7c5b7>   DW_AT_decl_line   : 141
    <7c5b8>   DW_AT_decl_column : 18
    <7c5b9>   DW_AT_type        : <0x7c08f>
    <7c5bd>   DW_AT_data_member_location: 8
 <2><7c5be>: Abbrev Number: 0
 <1><7c5bf>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c5c0>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <7c5c4>   DW_AT_decl_file   : 7
    <7c5c5>   DW_AT_decl_line   : 142
    <7c5c6>   DW_AT_decl_column : 3
    <7c5c7>   DW_AT_type        : <0x7c58d>
 <1><7c5cb>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7c5cc>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7c5d0>   DW_AT_byte_size   : 208
    <7c5d1>   DW_AT_decl_file   : 7
    <7c5d2>   DW_AT_decl_line   : 144
    <7c5d3>   DW_AT_decl_column : 16
    <7c5d4>   DW_AT_sibling     : <0x7c78e>
 <2><7c5d8>: Abbrev Number: 10 (DW_TAG_member)
    <7c5d9>   DW_AT_name        : id
    <7c5dc>   DW_AT_decl_file   : 7
    <7c5dd>   DW_AT_decl_line   : 146
    <7c5de>   DW_AT_decl_column : 6
    <7c5df>   DW_AT_type        : <0x7c0ab>
    <7c5e3>   DW_AT_data_member_location: 0
 <2><7c5e4>: Abbrev Number: 1 (DW_TAG_member)
    <7c5e5>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <7c5e9>   DW_AT_decl_file   : 7
    <7c5ea>   DW_AT_decl_line   : 147
    <7c5eb>   DW_AT_decl_column : 9
    <7c5ec>   DW_AT_type        : <0x7c0ab>
    <7c5f0>   DW_AT_data_member_location: 4
 <2><7c5f1>: Abbrev Number: 1 (DW_TAG_member)
    <7c5f2>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <7c5f6>   DW_AT_decl_file   : 7
    <7c5f7>   DW_AT_decl_line   : 148
    <7c5f8>   DW_AT_decl_column : 21
    <7c5f9>   DW_AT_type        : <0x7c502>
    <7c5fd>   DW_AT_data_member_location: 8
 <2><7c5fe>: Abbrev Number: 1 (DW_TAG_member)
    <7c5ff>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <7c603>   DW_AT_decl_file   : 7
    <7c604>   DW_AT_decl_line   : 149
    <7c605>   DW_AT_decl_column : 9
    <7c606>   DW_AT_type        : <0x7c0ab>
    <7c60a>   DW_AT_data_member_location: 16
 <2><7c60b>: Abbrev Number: 1 (DW_TAG_member)
    <7c60c>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <7c610>   DW_AT_decl_file   : 7
    <7c611>   DW_AT_decl_line   : 150
    <7c612>   DW_AT_decl_column : 9
    <7c613>   DW_AT_type        : <0x7c0ab>
    <7c617>   DW_AT_data_member_location: 20
 <2><7c618>: Abbrev Number: 1 (DW_TAG_member)
    <7c619>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <7c61d>   DW_AT_decl_file   : 7
    <7c61e>   DW_AT_decl_line   : 151
    <7c61f>   DW_AT_decl_column : 20
    <7c620>   DW_AT_type        : <0x7c321>
    <7c624>   DW_AT_data_member_location: 24
 <2><7c625>: Abbrev Number: 10 (DW_TAG_member)
    <7c626>   DW_AT_name        : w
    <7c628>   DW_AT_decl_file   : 7
    <7c629>   DW_AT_decl_line   : 152
    <7c62a>   DW_AT_decl_column : 9
    <7c62b>   DW_AT_type        : <0x7c0ab>
    <7c62f>   DW_AT_data_member_location: 32
 <2><7c630>: Abbrev Number: 10 (DW_TAG_member)
    <7c631>   DW_AT_name        : h
    <7c633>   DW_AT_decl_file   : 7
    <7c634>   DW_AT_decl_line   : 152
    <7c635>   DW_AT_decl_column : 12
    <7c636>   DW_AT_type        : <0x7c0ab>
    <7c63a>   DW_AT_data_member_location: 36
 <2><7c63b>: Abbrev Number: 1 (DW_TAG_member)
    <7c63c>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <7c640>   DW_AT_decl_file   : 7
    <7c641>   DW_AT_decl_line   : 153
    <7c642>   DW_AT_decl_column : 9
    <7c643>   DW_AT_type        : <0x7c0ab>
    <7c647>   DW_AT_data_member_location: 40
 <2><7c648>: Abbrev Number: 10 (DW_TAG_member)
    <7c649>   DW_AT_name        : bpp
    <7c64d>   DW_AT_decl_file   : 7
    <7c64e>   DW_AT_decl_line   : 154
    <7c64f>   DW_AT_decl_column : 9
    <7c650>   DW_AT_type        : <0x7c0ab>
    <7c654>   DW_AT_data_member_location: 44
 <2><7c655>: Abbrev Number: 1 (DW_TAG_member)
    <7c656>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7c65a>   DW_AT_decl_file   : 7
    <7c65b>   DW_AT_decl_line   : 155
    <7c65c>   DW_AT_decl_column : 9
    <7c65d>   DW_AT_type        : <0x7c0ab>
    <7c661>   DW_AT_data_member_location: 48
 <2><7c662>: Abbrev Number: 1 (DW_TAG_member)
    <7c663>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <7c667>   DW_AT_decl_file   : 7
    <7c668>   DW_AT_decl_line   : 156
    <7c669>   DW_AT_decl_column : 19
    <7c66a>   DW_AT_type        : <0x7c78e>
    <7c66e>   DW_AT_data_member_location: 56
 <2><7c66f>: Abbrev Number: 1 (DW_TAG_member)
    <7c670>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <7c674>   DW_AT_decl_file   : 7
    <7c675>   DW_AT_decl_line   : 157
    <7c676>   DW_AT_decl_column : 19
    <7c677>   DW_AT_type        : <0x7c78e>
    <7c67b>   DW_AT_data_member_location: 64
 <2><7c67c>: Abbrev Number: 1 (DW_TAG_member)
    <7c67d>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <7c681>   DW_AT_decl_file   : 7
    <7c682>   DW_AT_decl_line   : 158
    <7c683>   DW_AT_decl_column : 20
    <7c684>   DW_AT_type        : <0x7c321>
    <7c688>   DW_AT_data_member_location: 72
 <2><7c689>: Abbrev Number: 1 (DW_TAG_member)
    <7c68a>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <7c68e>   DW_AT_decl_file   : 7
    <7c68f>   DW_AT_decl_line   : 159
    <7c690>   DW_AT_decl_column : 11
    <7c691>   DW_AT_type        : <0x7c0c5>
    <7c695>   DW_AT_data_member_location: 80
 <2><7c696>: Abbrev Number: 1 (DW_TAG_member)
    <7c697>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <7c69b>   DW_AT_decl_file   : 7
    <7c69c>   DW_AT_decl_line   : 160
    <7c69d>   DW_AT_decl_column : 29
    <7c69e>   DW_AT_type        : <0x7c85c>
    <7c6a2>   DW_AT_data_member_location: 88
 <2><7c6a3>: Abbrev Number: 1 (DW_TAG_member)
    <7c6a4>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <7c6a8>   DW_AT_decl_file   : 7
    <7c6a9>   DW_AT_decl_line   : 161
    <7c6aa>   DW_AT_decl_column : 9
    <7c6ab>   DW_AT_type        : <0x7c0ab>
    <7c6af>   DW_AT_data_member_location: 96
 <2><7c6b0>: Abbrev Number: 1 (DW_TAG_member)
    <7c6b1>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <7c6b5>   DW_AT_decl_file   : 7
    <7c6b6>   DW_AT_decl_line   : 162
    <7c6b7>   DW_AT_decl_column : 27
    <7c6b8>   DW_AT_type        : <0x7c88e>
    <7c6bc>   DW_AT_data_member_location: 104
 <2><7c6bd>: Abbrev Number: 1 (DW_TAG_member)
    <7c6be>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <7c6c2>   DW_AT_decl_file   : 7
    <7c6c3>   DW_AT_decl_line   : 163
    <7c6c4>   DW_AT_decl_column : 9
    <7c6c5>   DW_AT_type        : <0x7c0ab>
    <7c6c9>   DW_AT_data_member_location: 112
 <2><7c6ca>: Abbrev Number: 1 (DW_TAG_member)
    <7c6cb>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <7c6cf>   DW_AT_decl_file   : 7
    <7c6d0>   DW_AT_decl_line   : 164
    <7c6d1>   DW_AT_decl_column : 9
    <7c6d2>   DW_AT_type        : <0x7c0ab>
    <7c6d6>   DW_AT_data_member_location: 116
 <2><7c6d7>: Abbrev Number: 1 (DW_TAG_member)
    <7c6d8>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <7c6dc>   DW_AT_decl_file   : 7
    <7c6dd>   DW_AT_decl_line   : 164
    <7c6de>   DW_AT_decl_column : 19
    <7c6df>   DW_AT_type        : <0x7c0ab>
    <7c6e3>   DW_AT_data_member_location: 120
 <2><7c6e4>: Abbrev Number: 1 (DW_TAG_member)
    <7c6e5>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <7c6e9>   DW_AT_decl_file   : 7
    <7c6ea>   DW_AT_decl_line   : 165
    <7c6eb>   DW_AT_decl_column : 24
    <7c6ec>   DW_AT_type        : <0x7c8c9>
    <7c6f0>   DW_AT_data_member_location: 128
 <2><7c6f1>: Abbrev Number: 1 (DW_TAG_member)
    <7c6f2>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <7c6f6>   DW_AT_decl_file   : 7
    <7c6f7>   DW_AT_decl_line   : 166
    <7c6f8>   DW_AT_decl_column : 9
    <7c6f9>   DW_AT_type        : <0x7c0ab>
    <7c6fd>   DW_AT_data_member_location: 136
 <2><7c6fe>: Abbrev Number: 1 (DW_TAG_member)
    <7c6ff>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <7c703>   DW_AT_decl_file   : 7
    <7c704>   DW_AT_decl_line   : 166
    <7c705>   DW_AT_decl_column : 17
    <7c706>   DW_AT_type        : <0x7c0ab>
    <7c70a>   DW_AT_data_member_location: 140
 <2><7c70b>: Abbrev Number: 1 (DW_TAG_member)
    <7c70c>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <7c710>   DW_AT_decl_file   : 7
    <7c711>   DW_AT_decl_line   : 167
    <7c712>   DW_AT_decl_column : 11
    <7c713>   DW_AT_type        : <0x7c1a6>
    <7c717>   DW_AT_data_member_location: 144
 <2><7c718>: Abbrev Number: 10 (DW_TAG_member)
    <7c719>   DW_AT_name        : key
    <7c71d>   DW_AT_decl_file   : 7
    <7c71e>   DW_AT_decl_line   : 168
    <7c71f>   DW_AT_decl_column : 11
    <7c720>   DW_AT_type        : <0x7c0c5>
    <7c724>   DW_AT_data_member_location: 152
 <2><7c725>: Abbrev Number: 1 (DW_TAG_member)
    <7c726>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <7c72a>   DW_AT_decl_file   : 7
    <7c72b>   DW_AT_decl_line   : 169
    <7c72c>   DW_AT_decl_column : 6
    <7c72d>   DW_AT_type        : <0x7c0ab>
    <7c731>   DW_AT_data_member_location: 160
 <2><7c732>: Abbrev Number: 1 (DW_TAG_member)
    <7c733>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <7c737>   DW_AT_decl_file   : 7
    <7c738>   DW_AT_decl_line   : 170
    <7c739>   DW_AT_decl_column : 18
    <7c73a>   DW_AT_type        : <0x7c8ce>
    <7c73e>   DW_AT_data_member_location: 168
 <2><7c73f>: Abbrev Number: 1 (DW_TAG_member)
    <7c740>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <7c744>   DW_AT_decl_file   : 7
    <7c745>   DW_AT_decl_line   : 171
    <7c746>   DW_AT_decl_column : 12
    <7c747>   DW_AT_type        : <0x7c2b8>
    <7c74b>   DW_AT_data_member_location: 176
 <2><7c74c>: Abbrev Number: 1 (DW_TAG_member)
    <7c74d>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <7c751>   DW_AT_decl_file   : 7
    <7c752>   DW_AT_decl_line   : 172
    <7c753>   DW_AT_decl_column : 9
    <7c754>   DW_AT_type        : <0x7c0ab>
    <7c758>   DW_AT_data_member_location: 184
 <2><7c759>: Abbrev Number: 1 (DW_TAG_member)
    <7c75a>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <7c75e>   DW_AT_decl_file   : 7
    <7c75f>   DW_AT_decl_line   : 172
    <7c760>   DW_AT_decl_column : 21
    <7c761>   DW_AT_type        : <0x7c0ab>
    <7c765>   DW_AT_data_member_location: 188
 <2><7c766>: Abbrev Number: 1 (DW_TAG_member)
    <7c767>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <7c76b>   DW_AT_decl_file   : 7
    <7c76c>   DW_AT_decl_line   : 173
    <7c76d>   DW_AT_decl_column : 11
    <7c76e>   DW_AT_type        : <0x7c8d8>
    <7c772>   DW_AT_data_member_location: 192
 <2><7c773>: Abbrev Number: 1 (DW_TAG_member)
    <7c774>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7c778>   DW_AT_decl_file   : 7
    <7c779>   DW_AT_decl_line   : 174
    <7c77a>   DW_AT_decl_column : 15
    <7c77b>   DW_AT_type        : <0x7c0b2>
    <7c77f>   DW_AT_data_member_location: 200
 <2><7c780>: Abbrev Number: 1 (DW_TAG_member)
    <7c781>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <7c785>   DW_AT_decl_file   : 7
    <7c786>   DW_AT_decl_line   : 175
    <7c787>   DW_AT_decl_column : 6
    <7c788>   DW_AT_type        : <0x7c0ab>
    <7c78c>   DW_AT_data_member_location: 204
 <2><7c78d>: Abbrev Number: 0
 <1><7c78e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c78f>   DW_AT_byte_size   : 8
    <7c78f>   DW_AT_type        : <0x7c08f>
 <1><7c793>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7c794>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <7c798>   DW_AT_byte_size   : 112
    <7c799>   DW_AT_decl_file   : 7
    <7c79a>   DW_AT_decl_line   : 178
    <7c79b>   DW_AT_decl_column : 16
    <7c79c>   DW_AT_sibling     : <0x7c857>
 <2><7c7a0>: Abbrev Number: 1 (DW_TAG_member)
    <7c7a1>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <7c7a5>   DW_AT_decl_file   : 7
    <7c7a6>   DW_AT_decl_line   : 188
    <7c7a7>   DW_AT_decl_column : 8
    <7c7a8>   DW_AT_type        : <0x7c0c5>
    <7c7ac>   DW_AT_data_member_location: 0
 <2><7c7ad>: Abbrev Number: 1 (DW_TAG_member)
    <7c7ae>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <7c7b2>   DW_AT_decl_file   : 7
    <7c7b3>   DW_AT_decl_line   : 208
    <7c7b4>   DW_AT_decl_column : 8
    <7c7b5>   DW_AT_type        : <0x7c911>
    <7c7b9>   DW_AT_data_member_location: 8
 <2><7c7ba>: Abbrev Number: 1 (DW_TAG_member)
    <7c7bb>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <7c7bf>   DW_AT_decl_file   : 7
    <7c7c0>   DW_AT_decl_line   : 222
    <7c7c1>   DW_AT_decl_column : 9
    <7c7c2>   DW_AT_type        : <0x7c199>
    <7c7c6>   DW_AT_data_member_location: 16
 <2><7c7c7>: Abbrev Number: 1 (DW_TAG_member)
    <7c7c8>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <7c7cc>   DW_AT_decl_file   : 7
    <7c7cd>   DW_AT_decl_line   : 231
    <7c7ce>   DW_AT_decl_column : 9
    <7c7cf>   DW_AT_type        : <0x7c199>
    <7c7d3>   DW_AT_data_member_location: 24
 <2><7c7d4>: Abbrev Number: 1 (DW_TAG_member)
    <7c7d5>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <7c7d9>   DW_AT_decl_file   : 7
    <7c7da>   DW_AT_decl_line   : 239
    <7c7db>   DW_AT_decl_column : 9
    <7c7dc>   DW_AT_type        : <0x7c199>
    <7c7e0>   DW_AT_data_member_location: 32
 <2><7c7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7c7e2>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <7c7e6>   DW_AT_decl_file   : 7
    <7c7e7>   DW_AT_decl_line   : 248
    <7c7e8>   DW_AT_decl_column : 9
    <7c7e9>   DW_AT_type        : <0x7c930>
    <7c7ed>   DW_AT_data_member_location: 40
 <2><7c7ee>: Abbrev Number: 7 (DW_TAG_member)
    <7c7ef>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <7c7f3>   DW_AT_decl_file   : 7
    <7c7f3>   DW_AT_decl_line   : 258
    <7c7f5>   DW_AT_decl_column : 9
    <7c7f6>   DW_AT_type        : <0x7c199>
    <7c7fa>   DW_AT_data_member_location: 48
 <2><7c7fb>: Abbrev Number: 7 (DW_TAG_member)
    <7c7fc>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <7c800>   DW_AT_decl_file   : 7
    <7c800>   DW_AT_decl_line   : 274
    <7c802>   DW_AT_decl_column : 8
    <7c803>   DW_AT_type        : <0x7c290>
    <7c807>   DW_AT_data_member_location: 56
 <2><7c808>: Abbrev Number: 7 (DW_TAG_member)
    <7c809>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <7c80d>   DW_AT_decl_file   : 7
    <7c80d>   DW_AT_decl_line   : 285
    <7c80f>   DW_AT_decl_column : 9
    <7c810>   DW_AT_type        : <0x7c930>
    <7c814>   DW_AT_data_member_location: 64
 <2><7c815>: Abbrev Number: 7 (DW_TAG_member)
    <7c816>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <7c81a>   DW_AT_decl_file   : 7
    <7c81a>   DW_AT_decl_line   : 293
    <7c81c>   DW_AT_decl_column : 9
    <7c81d>   DW_AT_type        : <0x7c940>
    <7c821>   DW_AT_data_member_location: 72
 <2><7c822>: Abbrev Number: 7 (DW_TAG_member)
    <7c823>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <7c827>   DW_AT_decl_file   : 7
    <7c827>   DW_AT_decl_line   : 301
    <7c829>   DW_AT_decl_column : 8
    <7c82a>   DW_AT_type        : <0x7c272>
    <7c82e>   DW_AT_data_member_location: 80
 <2><7c82f>: Abbrev Number: 7 (DW_TAG_member)
    <7c830>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <7c834>   DW_AT_decl_file   : 7
    <7c834>   DW_AT_decl_line   : 314
    <7c836>   DW_AT_decl_column : 9
    <7c837>   DW_AT_type        : <0x7c959>
    <7c83b>   DW_AT_data_member_location: 88
 <2><7c83c>: Abbrev Number: 7 (DW_TAG_member)
    <7c83d>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <7c841>   DW_AT_decl_file   : 7
    <7c841>   DW_AT_decl_line   : 321
    <7c843>   DW_AT_decl_column : 9
    <7c844>   DW_AT_type        : <0x7c199>
    <7c848>   DW_AT_data_member_location: 96
 <2><7c849>: Abbrev Number: 7 (DW_TAG_member)
    <7c84a>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <7c84e>   DW_AT_decl_file   : 7
    <7c84e>   DW_AT_decl_line   : 328
    <7c850>   DW_AT_decl_column : 9
    <7c851>   DW_AT_type        : <0x7c199>
    <7c855>   DW_AT_data_member_location: 104
 <2><7c856>: Abbrev Number: 0
 <1><7c857>: Abbrev Number: 18 (DW_TAG_const_type)
    <7c858>   DW_AT_type        : <0x7c793>
 <1><7c85c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c85d>   DW_AT_byte_size   : 8
    <7c85d>   DW_AT_type        : <0x7c857>
 <1><7c861>: Abbrev Number: 31 (DW_TAG_structure_type)
    <7c862>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <7c866>   DW_AT_byte_size   : 16
    <7c867>   DW_AT_decl_file   : 7
    <7c867>   DW_AT_decl_line   : 331
    <7c869>   DW_AT_decl_column : 16
    <7c86a>   DW_AT_sibling     : <0x7c889>
 <2><7c86e>: Abbrev Number: 7 (DW_TAG_member)
    <7c86f>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <7c873>   DW_AT_decl_file   : 7
    <7c873>   DW_AT_decl_line   : 333
    <7c875>   DW_AT_decl_column : 12
    <7c876>   DW_AT_type        : <0x7c0b7>
    <7c87a>   DW_AT_data_member_location: 0
 <2><7c87b>: Abbrev Number: 7 (DW_TAG_member)
    <7c87c>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7c880>   DW_AT_decl_file   : 7
    <7c880>   DW_AT_decl_line   : 334
    <7c882>   DW_AT_decl_column : 23
    <7c883>   DW_AT_type        : <0x7c95e>
    <7c887>   DW_AT_data_member_location: 8
 <2><7c888>: Abbrev Number: 0
 <1><7c889>: Abbrev Number: 18 (DW_TAG_const_type)
    <7c88a>   DW_AT_type        : <0x7c861>
 <1><7c88e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c88f>   DW_AT_byte_size   : 8
    <7c88f>   DW_AT_type        : <0x7c889>
 <1><7c893>: Abbrev Number: 31 (DW_TAG_structure_type)
    <7c894>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <7c898>   DW_AT_byte_size   : 16
    <7c899>   DW_AT_decl_file   : 7
    <7c899>   DW_AT_decl_line   : 337
    <7c89b>   DW_AT_decl_column : 16
    <7c89c>   DW_AT_sibling     : <0x7c8c4>
 <2><7c8a0>: Abbrev Number: 25 (DW_TAG_member)
    <7c8a1>   DW_AT_name        : w
    <7c8a3>   DW_AT_decl_file   : 7
    <7c8a3>   DW_AT_decl_line   : 339
    <7c8a5>   DW_AT_decl_column : 15
    <7c8a6>   DW_AT_type        : <0x7c0b7>
    <7c8aa>   DW_AT_data_member_location: 0
 <2><7c8ab>: Abbrev Number: 25 (DW_TAG_member)
    <7c8ac>   DW_AT_name        : h
    <7c8ae>   DW_AT_decl_file   : 7
    <7c8ae>   DW_AT_decl_line   : 340
    <7c8b0>   DW_AT_decl_column : 15
    <7c8b1>   DW_AT_type        : <0x7c0b7>
    <7c8b5>   DW_AT_data_member_location: 4
 <2><7c8b6>: Abbrev Number: 7 (DW_TAG_member)
    <7c8b7>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7c8bb>   DW_AT_decl_file   : 7
    <7c8bb>   DW_AT_decl_line   : 341
    <7c8bd>   DW_AT_decl_column : 23
    <7c8be>   DW_AT_type        : <0x7c95e>
    <7c8c2>   DW_AT_data_member_location: 8
 <2><7c8c3>: Abbrev Number: 0
 <1><7c8c4>: Abbrev Number: 18 (DW_TAG_const_type)
    <7c8c5>   DW_AT_type        : <0x7c893>
 <1><7c8c9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c8ca>   DW_AT_byte_size   : 8
    <7c8ca>   DW_AT_type        : <0x7c8c4>
 <1><7c8ce>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c8cf>   DW_AT_byte_size   : 8
    <7c8cf>   DW_AT_type        : <0x7c8d3>
 <1><7c8d3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c8d4>   DW_AT_byte_size   : 8
    <7c8d4>   DW_AT_type        : <0x7c5bf>
 <1><7c8d8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c8d9>   DW_AT_byte_size   : 8
    <7c8d9>   DW_AT_type        : <0x7c1ad>
 <1><7c8dd>: Abbrev Number: 13 (DW_TAG_typedef)
    <7c8de>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7c8e2>   DW_AT_decl_file   : 7
    <7c8e3>   DW_AT_decl_line   : 176
    <7c8e4>   DW_AT_decl_column : 3
    <7c8e5>   DW_AT_type        : <0x7c5cb>
 <1><7c8e9>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c8ea>   DW_AT_prototyped  : 1
    <7c8ea>   DW_AT_type        : <0x7c0ab>
    <7c8ee>   DW_AT_sibling     : <0x7c911>
 <2><7c8f2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c8f3>   DW_AT_type        : <0x7c0c5>
 <2><7c8f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c8f8>   DW_AT_type        : <0x7c0ab>
 <2><7c8fc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c8fd>   DW_AT_type        : <0x7c0ab>
 <2><7c901>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c902>   DW_AT_type        : <0x7c0ab>
 <2><7c906>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c907>   DW_AT_type        : <0x7c0ab>
 <2><7c90b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c90c>   DW_AT_type        : <0x7c0ab>
 <2><7c910>: Abbrev Number: 0
 <1><7c911>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c912>   DW_AT_byte_size   : 8
    <7c912>   DW_AT_type        : <0x7c8e9>
 <1><7c916>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7c917>   DW_AT_prototyped  : 1
    <7c917>   DW_AT_sibling     : <0x7c930>
 <2><7c91b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c91c>   DW_AT_type        : <0x7c0ab>
 <2><7c920>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c921>   DW_AT_type        : <0x7c0ab>
 <2><7c925>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c926>   DW_AT_type        : <0x7c0ab>
 <2><7c92a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c92b>   DW_AT_type        : <0x7c0ab>
 <2><7c92f>: Abbrev Number: 0
 <1><7c930>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c931>   DW_AT_byte_size   : 8
    <7c931>   DW_AT_type        : <0x7c916>
 <1><7c935>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7c936>   DW_AT_prototyped  : 1
    <7c936>   DW_AT_sibling     : <0x7c940>
 <2><7c93a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c93b>   DW_AT_type        : <0x7c0c5>
 <2><7c93f>: Abbrev Number: 0
 <1><7c940>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c941>   DW_AT_byte_size   : 8
    <7c941>   DW_AT_type        : <0x7c935>
 <1><7c945>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7c946>   DW_AT_prototyped  : 1
    <7c946>   DW_AT_type        : <0x7c28b>
    <7c94a>   DW_AT_sibling     : <0x7c959>
 <2><7c94e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c94f>   DW_AT_type        : <0x7c0ab>
 <2><7c953>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c954>   DW_AT_type        : <0x7c28b>
 <2><7c958>: Abbrev Number: 0
 <1><7c959>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c95a>   DW_AT_byte_size   : 8
    <7c95a>   DW_AT_type        : <0x7c945>
 <1><7c95e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7c95f>   DW_AT_byte_size   : 8
    <7c95f>   DW_AT_type        : <0x7c083>
 <1><7c963>: Abbrev Number: 50 (DW_TAG_structure_type)
    <7c964>   DW_AT_byte_size   : 4
    <7c965>   DW_AT_decl_file   : 7
    <7c966>   DW_AT_decl_line   : 346
    <7c968>   DW_AT_decl_column : 3
    <7c969>   DW_AT_sibling     : <0x7c999>
 <2><7c96d>: Abbrev Number: 51 (DW_TAG_member)
    <7c96e>   DW_AT_name        : bpp
    <7c972>   DW_AT_decl_file   : 7
    <7c973>   DW_AT_decl_line   : 347
    <7c975>   DW_AT_decl_column : 19
    <7c976>   DW_AT_type        : <0x7c088>
    <7c97a>   DW_AT_bit_size    : 3
    <7c97b>   DW_AT_data_bit_offset: 0
 <2><7c97c>: Abbrev Number: 52 (DW_TAG_member)
    <7c97d>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7c981>   DW_AT_decl_file   : 7
    <7c982>   DW_AT_decl_line   : 348
    <7c984>   DW_AT_decl_column : 19
    <7c985>   DW_AT_type        : <0x7c088>
    <7c989>   DW_AT_bit_size    : 13
    <7c98a>   DW_AT_data_bit_offset: 3
 <2><7c98b>: Abbrev Number: 7 (DW_TAG_member)
    <7c98c>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7c990>   DW_AT_decl_file   : 7
    <7c990>   DW_AT_decl_line   : 349
    <7c992>   DW_AT_decl_column : 19
    <7c993>   DW_AT_type        : <0x7c088>
    <7c997>   DW_AT_data_member_location: 2
 <2><7c998>: Abbrev Number: 0
 <1><7c999>: Abbrev Number: 53 (DW_TAG_union_type)
    <7c99a>   DW_AT_byte_size   : 4
    <7c99b>   DW_AT_decl_file   : 7
    <7c99c>   DW_AT_decl_line   : 345
    <7c99e>   DW_AT_decl_column : 2
    <7c99f>   DW_AT_sibling     : <0x7c9be>
 <2><7c9a3>: Abbrev Number: 54 (DW_TAG_member)
    <7c9a4>   DW_AT_name        : old
    <7c9a8>   DW_AT_decl_file   : 7
    <7c9a9>   DW_AT_decl_line   : 350
    <7c9ab>   DW_AT_decl_column : 5
    <7c9ac>   DW_AT_type        : <0x7c963>
 <2><7c9b0>: Abbrev Number: 55 (DW_TAG_member)
    <7c9b1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7c9b5>   DW_AT_decl_file   : 7
    <7c9b6>   DW_AT_decl_line   : 351
    <7c9b8>   DW_AT_decl_column : 16
    <7c9b9>   DW_AT_type        : <0x7c08f>
 <2><7c9bd>: Abbrev Number: 0
 <1><7c9be>: Abbrev Number: 31 (DW_TAG_structure_type)
    <7c9bf>   DW_AT_name        : (indirect string, offset: 0x16c84): _PUT_HEADER
    <7c9c3>   DW_AT_byte_size   : 32
    <7c9c4>   DW_AT_decl_file   : 7
    <7c9c4>   DW_AT_decl_line   : 344
    <7c9c6>   DW_AT_decl_column : 8
    <7c9c7>   DW_AT_sibling     : <0x7ca2d>
 <2><7c9cb>: Abbrev Number: 23 (DW_TAG_member)
    <7c9cc>   DW_AT_type        : <0x7c999>
    <7c9d0>   DW_AT_data_member_location: 0
 <2><7c9d1>: Abbrev Number: 25 (DW_TAG_member)
    <7c9d2>   DW_AT_name        : bpp
    <7c9d6>   DW_AT_decl_file   : 7
    <7c9d6>   DW_AT_decl_line   : 353
    <7c9d8>   DW_AT_decl_column : 6
    <7c9d9>   DW_AT_type        : <0x7c0ab>
    <7c9dd>   DW_AT_data_member_location: 4
 <2><7c9de>: Abbrev Number: 7 (DW_TAG_member)
    <7c9df>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7c9e3>   DW_AT_decl_file   : 7
    <7c9e3>   DW_AT_decl_line   : 354
    <7c9e5>   DW_AT_decl_column : 15
    <7c9e6>   DW_AT_type        : <0x7c08f>
    <7c9ea>   DW_AT_data_member_location: 8
 <2><7c9eb>: Abbrev Number: 7 (DW_TAG_member)
    <7c9ec>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7c9f0>   DW_AT_decl_file   : 7
    <7c9f0>   DW_AT_decl_line   : 355
    <7c9f2>   DW_AT_decl_column : 15
    <7c9f3>   DW_AT_type        : <0x7c08f>
    <7c9f7>   DW_AT_data_member_location: 12
 <2><7c9f8>: Abbrev Number: 7 (DW_TAG_member)
    <7c9f9>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7c9fd>   DW_AT_decl_file   : 7
    <7c9fd>   DW_AT_decl_line   : 356
    <7c9ff>   DW_AT_decl_column : 15
    <7ca00>   DW_AT_type        : <0x7c08f>
    <7ca04>   DW_AT_data_member_location: 16
 <2><7ca05>: Abbrev Number: 25 (DW_TAG_member)
    <7ca06>   DW_AT_name        : tex
    <7ca0a>   DW_AT_decl_file   : 7
    <7ca0a>   DW_AT_decl_line   : 357
    <7ca0c>   DW_AT_decl_column : 15
    <7ca0d>   DW_AT_type        : <0x7c08f>
    <7ca11>   DW_AT_data_member_location: 20
 <2><7ca12>: Abbrev Number: 7 (DW_TAG_member)
    <7ca13>   DW_AT_name        : (indirect string, offset: 0x1d25a): _reserved
    <7ca17>   DW_AT_decl_file   : 7
    <7ca17>   DW_AT_decl_line   : 358
    <7ca19>   DW_AT_decl_column : 7
    <7ca1a>   DW_AT_type        : <0x7c104>
    <7ca1e>   DW_AT_data_member_location: 24
 <2><7ca1f>: Abbrev Number: 7 (DW_TAG_member)
    <7ca20>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7ca24>   DW_AT_decl_file   : 7
    <7ca24>   DW_AT_decl_line   : 359
    <7ca26>   DW_AT_decl_column : 16
    <7ca27>   DW_AT_type        : <0x7ca2d>
    <7ca2b>   DW_AT_data_member_location: 32
 <2><7ca2c>: Abbrev Number: 0
 <1><7ca2d>: Abbrev Number: 20 (DW_TAG_array_type)
    <7ca2e>   DW_AT_type        : <0x7c07c>
    <7ca32>   DW_AT_sibling     : <0x7ca3d>
 <2><7ca36>: Abbrev Number: 56 (DW_TAG_subrange_type)
    <7ca37>   DW_AT_type        : <0x7c096>
    <7ca3b>   DW_AT_count       : 0
 <2><7ca3c>: Abbrev Number: 0
 <1><7ca3d>: Abbrev Number: 34 (DW_TAG_typedef)
    <7ca3e>   DW_AT_name        : (indirect string, offset: 0x16c85): PUT_HEADER
    <7ca42>   DW_AT_decl_file   : 7
    <7ca43>   DW_AT_decl_line   : 361
    <7ca45>   DW_AT_decl_column : 28
    <7ca46>   DW_AT_type        : <0x7c9be>
 <1><7ca4a>: Abbrev Number: 36 (DW_TAG_variable)
    <7ca4b>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <7ca4f>   DW_AT_decl_file   : 7
    <7ca4f>   DW_AT_decl_line   : 364
    <7ca51>   DW_AT_decl_column : 15
    <7ca52>   DW_AT_type        : <0x7ca56>
    <7ca56>   DW_AT_external    : 1
    <7ca56>   DW_AT_declaration : 1
 <1><7ca56>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7ca57>   DW_AT_byte_size   : 8
    <7ca57>   DW_AT_type        : <0x7c8dd>
 <1><7ca5b>: Abbrev Number: 36 (DW_TAG_variable)
    <7ca5c>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <7ca60>   DW_AT_decl_file   : 7
    <7ca60>   DW_AT_decl_line   : 369
    <7ca62>   DW_AT_decl_column : 16
    <7ca63>   DW_AT_type        : <0x7c562>
    <7ca67>   DW_AT_external    : 1
    <7ca67>   DW_AT_declaration : 1
 <1><7ca67>: Abbrev Number: 32 (DW_TAG_subprogram)
    <7ca68>   DW_AT_external    : 1
    <7ca68>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <7ca6c>   DW_AT_decl_file   : 8
    <7ca6d>   DW_AT_decl_line   : 565
    <7ca6f>   DW_AT_decl_column : 13
    <7ca6f>   DW_AT_prototyped  : 1
    <7ca6f>   DW_AT_declaration : 1
    <7ca6f>   DW_AT_sibling     : <0x7ca79>
 <2><7ca73>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7ca74>   DW_AT_type        : <0x7c0c3>
 <2><7ca78>: Abbrev Number: 0
 <1><7ca79>: Abbrev Number: 32 (DW_TAG_subprogram)
    <7ca7a>   DW_AT_external    : 1
    <7ca7a>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <7ca7e>   DW_AT_decl_file   : 7
    <7ca7f>   DW_AT_decl_line   : 410
    <7ca81>   DW_AT_decl_column : 13
    <7ca81>   DW_AT_prototyped  : 1
    <7ca81>   DW_AT_declaration : 1
    <7ca81>   DW_AT_sibling     : <0x7ca90>
 <2><7ca85>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7ca86>   DW_AT_type        : <0x7ca90>
 <2><7ca8a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7ca8b>   DW_AT_type        : <0x7c08f>
 <2><7ca8f>: Abbrev Number: 0
 <1><7ca90>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7ca91>   DW_AT_byte_size   : 8
    <7ca91>   DW_AT_type        : <0x7c581>
 <1><7ca95>: Abbrev Number: 32 (DW_TAG_subprogram)
    <7ca96>   DW_AT_external    : 1
    <7ca96>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <7ca9a>   DW_AT_decl_file   : 7
    <7ca9b>   DW_AT_decl_line   : 409
    <7ca9d>   DW_AT_decl_column : 13
    <7ca9d>   DW_AT_prototyped  : 1
    <7ca9d>   DW_AT_declaration : 1
    <7ca9d>   DW_AT_sibling     : <0x7caac>
 <2><7caa1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7caa2>   DW_AT_type        : <0x7ca90>
 <2><7caa6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7caa7>   DW_AT_type        : <0x7c0c3>
 <2><7caab>: Abbrev Number: 0
 <1><7caac>: Abbrev Number: 57 (DW_TAG_subprogram)
    <7caad>   DW_AT_external    : 1
    <7caad>   DW_AT_name        : (indirect string, offset: 0xe63c): malloc
    <7cab1>   DW_AT_decl_file   : 8
    <7cab2>   DW_AT_decl_line   : 539
    <7cab4>   DW_AT_decl_column : 14
    <7cab5>   DW_AT_prototyped  : 1
    <7cab5>   DW_AT_type        : <0x7c0c3>
    <7cab9>   DW_AT_declaration : 1
    <7cab9>   DW_AT_sibling     : <0x7cac3>
 <2><7cabd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7cabe>   DW_AT_type        : <0x7c0dd>
 <2><7cac2>: Abbrev Number: 0
 <1><7cac3>: Abbrev Number: 58 (DW_TAG_subprogram)
    <7cac4>   DW_AT_external    : 1
    <7cac4>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <7cac8>   DW_AT_decl_file   : 7
    <7cac9>   DW_AT_decl_line   : 396
    <7cacb>   DW_AT_decl_column : 19
    <7cacc>   DW_AT_prototyped  : 1
    <7cacc>   DW_AT_type        : <0x7ca90>
    <7cad0>   DW_AT_declaration : 1
 <1><7cad0>: Abbrev Number: 59 (DW_TAG_subprogram)
    <7cad1>   DW_AT_external    : 1
    <7cad1>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <7cad5>   DW_AT_decl_file   : 9
    <7cad6>   DW_AT_decl_line   : 50
    <7cad7>   DW_AT_decl_column : 22
    <7cad8>   DW_AT_prototyped  : 1
    <7cad8>   DW_AT_type        : <0x7c0ab>
    <7cadc>   DW_AT_declaration : 1
    <7cadc>   DW_AT_sibling     : <0x7cae6>
 <2><7cae0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7cae1>   DW_AT_type        : <0x7c0ab>
 <2><7cae5>: Abbrev Number: 0
 <1><7cae6>: Abbrev Number: 60 (DW_TAG_subprogram)
    <7cae7>   DW_AT_external    : 1
    <7cae7>   DW_AT_name        : (indirect string, offset: 0x12ab1): fb_GfxImageDestroy
    <7caeb>   DW_AT_decl_file   : 1
    <7caec>   DW_AT_decl_line   : 96
    <7caed>   DW_AT_decl_column : 13
    <7caee>   DW_AT_prototyped  : 1
    <7caee>   DW_AT_low_pc      : 0x45bdf0
    <7caf6>   DW_AT_high_pc     : 0x11
    <7cafe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7cb00>   DW_AT_call_all_calls: 1
    <7cb00>   DW_AT_sibling     : <0x7cb25>
 <2><7cb04>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb05>   DW_AT_name        : (indirect string, offset: 0x1a6ec): image
    <7cb09>   DW_AT_decl_file   : 1
    <7cb09>   DW_AT_decl_line   : 96
    <7cb0a>   DW_AT_decl_column : 38
    <7cb0b>   DW_AT_type        : <0x7c0c3>
    <7cb0f>   DW_AT_location    : 0x23f35 (location list)
    <7cb13>   DW_AT_GNU_locviews: 0x23f2f
 <2><7cb17>: Abbrev Number: 61 (DW_TAG_call_site)
    <7cb18>   DW_AT_call_return_pc: 0x45bdfe
    <7cb20>   DW_AT_call_tail_call: 1
    <7cb20>   DW_AT_call_origin : <0x7ca67>
 <2><7cb24>: Abbrev Number: 0
 <1><7cb25>: Abbrev Number: 37 (DW_TAG_subprogram)
    <7cb26>   DW_AT_external    : 1
    <7cb26>   DW_AT_name        : (indirect string, offset: 0x17c1a): fb_GfxImageCreateQB
    <7cb2a>   DW_AT_decl_file   : 1
    <7cb2a>   DW_AT_decl_line   : 91
    <7cb2b>   DW_AT_decl_column : 14
    <7cb2b>   DW_AT_prototyped  : 1
    <7cb2b>   DW_AT_type        : <0x7c0c3>
    <7cb2f>   DW_AT_low_pc      : 0x45bc70
    <7cb37>   DW_AT_high_pc     : 0x179
    <7cb3f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7cb41>   DW_AT_call_all_calls: 1
    <7cb41>   DW_AT_sibling     : <0x7cddf>
 <2><7cb45>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb46>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7cb4a>   DW_AT_decl_file   : 1
    <7cb4a>   DW_AT_decl_line   : 91
    <7cb4b>   DW_AT_decl_column : 38
    <7cb4c>   DW_AT_type        : <0x7c0ab>
    <7cb50>   DW_AT_location    : 0x23f5a (location list)
    <7cb54>   DW_AT_GNU_locviews: 0x23f4e
 <2><7cb58>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb59>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7cb5d>   DW_AT_decl_file   : 1
    <7cb5d>   DW_AT_decl_line   : 91
    <7cb5e>   DW_AT_decl_column : 49
    <7cb5f>   DW_AT_type        : <0x7c0ab>
    <7cb63>   DW_AT_location    : 0x23f97 (location list)
    <7cb67>   DW_AT_GNU_locviews: 0x23f8b
 <2><7cb6b>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb6c>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7cb70>   DW_AT_decl_file   : 1
    <7cb70>   DW_AT_decl_line   : 91
    <7cb71>   DW_AT_decl_column : 70
    <7cb72>   DW_AT_type        : <0x7c08f>
    <7cb76>   DW_AT_location    : 0x23fe2 (location list)
    <7cb7a>   DW_AT_GNU_locviews: 0x23fc8
 <2><7cb7e>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb7f>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <7cb83>   DW_AT_decl_file   : 1
    <7cb83>   DW_AT_decl_line   : 91
    <7cb84>   DW_AT_decl_column : 81
    <7cb85>   DW_AT_type        : <0x7c0ab>
    <7cb89>   DW_AT_location    : 0x24059 (location list)
    <7cb8d>   DW_AT_GNU_locviews: 0x2404d
 <2><7cb91>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7cb92>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7cb96>   DW_AT_decl_file   : 1
    <7cb96>   DW_AT_decl_line   : 91
    <7cb97>   DW_AT_decl_column : 92
    <7cb98>   DW_AT_type        : <0x7c0ab>
    <7cb9c>   DW_AT_location    : 0x2409a (location list)
    <7cba0>   DW_AT_GNU_locviews: 0x2408c
 <2><7cba4>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <7cba5>   DW_AT_abstract_origin: <0x7d0af>
    <7cba9>   DW_AT_entry_pc    : 0x45bc70
    <7cbb1>   DW_AT_GNU_entry_view: 2
    <7cbb2>   DW_AT_ranges      : 0x1724e
    <7cbb6>   DW_AT_call_file   : 1
    <7cbb6>   DW_AT_call_line   : 93
    <7cbb7>   DW_AT_call_column : 9
 <3><7cbb7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbb8>   DW_AT_abstract_origin: <0x7d0f2>
    <7cbbc>   DW_AT_location    : 0x240d9 (location list)
    <7cbc0>   DW_AT_GNU_locviews: 0x240d5
 <3><7cbc4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbc5>   DW_AT_abstract_origin: <0x7d0e8>
    <7cbc9>   DW_AT_location    : 0x240f8 (location list)
    <7cbcd>   DW_AT_GNU_locviews: 0x240ea
 <3><7cbd1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbd2>   DW_AT_abstract_origin: <0x7d0de>
    <7cbd6>   DW_AT_location    : 0x24141 (location list)
    <7cbda>   DW_AT_GNU_locviews: 0x24133
 <3><7cbde>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbdf>   DW_AT_abstract_origin: <0x7d0d4>
    <7cbe3>   DW_AT_location    : 0x24198 (location list)
    <7cbe7>   DW_AT_GNU_locviews: 0x2417e
 <3><7cbeb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbec>   DW_AT_abstract_origin: <0x7d0ca>
    <7cbf0>   DW_AT_location    : 0x2420d (location list)
    <7cbf4>   DW_AT_GNU_locviews: 0x24203
 <3><7cbf8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cbf9>   DW_AT_abstract_origin: <0x7d0c0>
    <7cbfd>   DW_AT_location    : 0x2423e (location list)
    <7cc01>   DW_AT_GNU_locviews: 0x24234
 <3><7cc05>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <7cc06>   DW_AT_ranges      : 0x1724e
 <4><7cc0a>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc0b>   DW_AT_abstract_origin: <0x7d0fc>
 <4><7cc0f>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc10>   DW_AT_abstract_origin: <0x7d107>
 <4><7cc14>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc15>   DW_AT_abstract_origin: <0x7d112>
 <4><7cc19>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc1a>   DW_AT_abstract_origin: <0x7d11d>
 <4><7cc1e>: Abbrev Number: 39 (DW_TAG_variable)
    <7cc1f>   DW_AT_abstract_origin: <0x7d128>
    <7cc23>   DW_AT_const_value : 4
 <4><7cc23>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc24>   DW_AT_abstract_origin: <0x7d133>
 <4><7cc28>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc29>   DW_AT_abstract_origin: <0x7d13e>
 <4><7cc2d>: Abbrev Number: 9 (DW_TAG_variable)
    <7cc2e>   DW_AT_abstract_origin: <0x7d149>
 <4><7cc32>: Abbrev Number: 40 (DW_TAG_inlined_subroutine)
    <7cc33>   DW_AT_abstract_origin: <0x7d0af>
    <7cc37>   DW_AT_entry_pc    : 0x45bc9d
    <7cc3f>   DW_AT_GNU_entry_view: 0
    <7cc40>   DW_AT_ranges      : 0x1725e
    <7cc44>   DW_AT_call_file   : 1
    <7cc44>   DW_AT_call_line   : 5
    <7cc44>   DW_AT_call_column : 14
    <7cc44>   DW_AT_sibling     : <0x7cdc9>
 <5><7cc48>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc49>   DW_AT_abstract_origin: <0x7d0f2>
    <7cc4d>   DW_AT_location    : 0x2426b (location list)
    <7cc51>   DW_AT_GNU_locviews: 0x24265
 <5><7cc55>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc56>   DW_AT_abstract_origin: <0x7d0e8>
    <7cc5a>   DW_AT_location    : 0x24290 (location list)
    <7cc5e>   DW_AT_GNU_locviews: 0x24284
 <5><7cc62>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc63>   DW_AT_abstract_origin: <0x7d0de>
    <7cc67>   DW_AT_location    : 0x242cf (location list)
    <7cc6b>   DW_AT_GNU_locviews: 0x242c1
 <5><7cc6f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc70>   DW_AT_abstract_origin: <0x7d0d4>
    <7cc74>   DW_AT_location    : 0x24328 (location list)
    <7cc78>   DW_AT_GNU_locviews: 0x2430c
 <5><7cc7c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc7d>   DW_AT_abstract_origin: <0x7d0ca>
    <7cc81>   DW_AT_location    : 0x2439f (location list)
    <7cc85>   DW_AT_GNU_locviews: 0x24397
 <5><7cc89>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cc8a>   DW_AT_abstract_origin: <0x7d0c0>
    <7cc8e>   DW_AT_location    : 0x243c4 (location list)
    <7cc92>   DW_AT_GNU_locviews: 0x243bc
 <5><7cc96>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <7cc97>   DW_AT_ranges      : 0x1725e
 <6><7cc9b>: Abbrev Number: 8 (DW_TAG_variable)
    <7cc9c>   DW_AT_abstract_origin: <0x7d0fc>
    <7cca0>   DW_AT_location    : 0x243eb (location list)
    <7cca4>   DW_AT_GNU_locviews: 0x243e1
 <6><7cca8>: Abbrev Number: 8 (DW_TAG_variable)
    <7cca9>   DW_AT_abstract_origin: <0x7d107>
    <7ccad>   DW_AT_location    : 0x24413 (location list)
    <7ccb1>   DW_AT_GNU_locviews: 0x2440f
 <6><7ccb5>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccb6>   DW_AT_abstract_origin: <0x7d112>
    <7ccba>   DW_AT_location    : 0x24428 (location list)
    <7ccbe>   DW_AT_GNU_locviews: 0x24422
 <6><7ccc2>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccc3>   DW_AT_abstract_origin: <0x7d11d>
    <7ccc7>   DW_AT_location    : 0x2444a (location list)
    <7cccb>   DW_AT_GNU_locviews: 0x24442
 <6><7cccf>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccd0>   DW_AT_abstract_origin: <0x7d128>
    <7ccd4>   DW_AT_location    : 0x2447a (location list)
    <7ccd8>   DW_AT_GNU_locviews: 0x24476
 <6><7ccdc>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccdd>   DW_AT_abstract_origin: <0x7d133>
    <7cce1>   DW_AT_location    : 0x24491 (location list)
    <7cce5>   DW_AT_GNU_locviews: 0x2448b
 <6><7cce9>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccea>   DW_AT_abstract_origin: <0x7d13e>
    <7ccee>   DW_AT_location    : 0x244ab (location list)
    <7ccf2>   DW_AT_GNU_locviews: 0x244a7
 <6><7ccf6>: Abbrev Number: 8 (DW_TAG_variable)
    <7ccf7>   DW_AT_abstract_origin: <0x7d149>
    <7ccfb>   DW_AT_location    : 0x244c2 (location list)
    <7ccff>   DW_AT_GNU_locviews: 0x244bc
 <6><7cd03>: Abbrev Number: 41 (DW_TAG_call_site)
    <7cd04>   DW_AT_call_return_pc: 0x45bca2
    <7cd0c>   DW_AT_call_origin : <0x7cac3>
 <6><7cd10>: Abbrev Number: 14 (DW_TAG_call_site)
    <7cd11>   DW_AT_call_return_pc: 0x45bd29
    <7cd19>   DW_AT_call_origin : <0x7caac>
    <7cd1d>   DW_AT_sibling     : <0x7cd33>
 <7><7cd21>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd22>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cd24>   DW_AT_call_value  : 13 byte block: 91 bc 7f 94 4 23 1a 8 20 24 8 20 26 	(DW_OP_fbreg: -68; DW_OP_deref_size: 4; DW_OP_plus_uconst: 26; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <7><7cd32>: Abbrev Number: 0
 <6><7cd33>: Abbrev Number: 14 (DW_TAG_call_site)
    <7cd34>   DW_AT_call_return_pc: 0x45bd64
    <7cd3c>   DW_AT_call_origin : <0x7ca95>
    <7cd40>   DW_AT_sibling     : <0x7cd51>
 <7><7cd44>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd45>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cd47>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <7><7cd4a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd4b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7cd4d>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <7><7cd50>: Abbrev Number: 0
 <6><7cd51>: Abbrev Number: 14 (DW_TAG_call_site)
    <7cd52>   DW_AT_call_return_pc: 0x45bd71
    <7cd5a>   DW_AT_call_origin : <0x7ca79>
    <7cd5e>   DW_AT_sibling     : <0x7cd71>
 <7><7cd62>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd63>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cd65>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <7><7cd68>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd69>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7cd6b>   DW_AT_call_value  : 4 byte block: 40 44 24 1f 	(DW_OP_lit16; DW_OP_lit20; DW_OP_shl; DW_OP_neg)
 <7><7cd70>: Abbrev Number: 0
 <6><7cd71>: Abbrev Number: 33 (DW_TAG_call_site)
    <7cd72>   DW_AT_call_return_pc: 0x45bd86
    <7cd7a>   DW_AT_sibling     : <0x7cd9d>
 <7><7cd7e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd7f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cd81>   DW_AT_call_value  : 2 byte block: 7d 4 	(DW_OP_breg13 (r13): 4)
 <7><7cd84>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd85>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7cd87>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <7><7cd8a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cd8b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7cd8d>   DW_AT_call_value  : 14 byte block: 91 bc 7f 94 4 73 0 1b 8 20 24 8 20 26 	(DW_OP_fbreg: -68; DW_OP_deref_size: 4; DW_OP_breg3 (rbx): 0; DW_OP_div; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <7><7cd9c>: Abbrev Number: 0
 <6><7cd9d>: Abbrev Number: 14 (DW_TAG_call_site)
    <7cd9e>   DW_AT_call_return_pc: 0x45bd8d
    <7cda6>   DW_AT_call_origin : <0x7cad0>
    <7cdaa>   DW_AT_sibling     : <0x7cdb4>
 <7><7cdae>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cdaf>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cdb1>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <7><7cdb3>: Abbrev Number: 0
 <6><7cdb4>: Abbrev Number: 27 (DW_TAG_call_site)
    <7cdb5>   DW_AT_call_return_pc: 0x45bde7
    <7cdbd>   DW_AT_call_origin : <0x7cad0>
 <7><7cdc1>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cdc2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cdc4>   DW_AT_call_value  : 1 byte block: 34 	(DW_OP_lit4)
 <7><7cdc6>: Abbrev Number: 0
 <6><7cdc7>: Abbrev Number: 0
 <5><7cdc8>: Abbrev Number: 0
 <4><7cdc9>: Abbrev Number: 27 (DW_TAG_call_site)
    <7cdca>   DW_AT_call_return_pc: 0x45bccd
    <7cdd2>   DW_AT_call_origin : <0x7cad0>
 <5><7cdd6>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cdd7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cdd9>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><7cddb>: Abbrev Number: 0
 <4><7cddc>: Abbrev Number: 0
 <3><7cddd>: Abbrev Number: 0
 <2><7cdde>: Abbrev Number: 0
 <1><7cddf>: Abbrev Number: 37 (DW_TAG_subprogram)
    <7cde0>   DW_AT_external    : 1
    <7cde0>   DW_AT_name        : (indirect string, offset: 0xbbb9): fb_GfxImageCreate
    <7cde4>   DW_AT_decl_file   : 1
    <7cde4>   DW_AT_decl_line   : 86
    <7cde5>   DW_AT_decl_column : 14
    <7cde5>   DW_AT_prototyped  : 1
    <7cde5>   DW_AT_type        : <0x7c0c3>
    <7cde9>   DW_AT_low_pc      : 0x45bab0
    <7cdf1>   DW_AT_high_pc     : 0x1b2
    <7cdf9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7cdfb>   DW_AT_call_all_calls: 1
    <7cdfb>   DW_AT_sibling     : <0x7d0af>
 <2><7cdff>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7ce00>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7ce04>   DW_AT_decl_file   : 1
    <7ce04>   DW_AT_decl_line   : 86
    <7ce05>   DW_AT_decl_column : 36
    <7ce06>   DW_AT_type        : <0x7c0ab>
    <7ce0a>   DW_AT_location    : 0x244e7 (location list)
    <7ce0e>   DW_AT_GNU_locviews: 0x244d9
 <2><7ce12>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7ce13>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7ce17>   DW_AT_decl_file   : 1
    <7ce17>   DW_AT_decl_line   : 86
    <7ce18>   DW_AT_decl_column : 47
    <7ce19>   DW_AT_type        : <0x7c0ab>
    <7ce1d>   DW_AT_location    : 0x24529 (location list)
    <7ce21>   DW_AT_GNU_locviews: 0x2451b
 <2><7ce25>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7ce26>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7ce2a>   DW_AT_decl_file   : 1
    <7ce2a>   DW_AT_decl_line   : 86
    <7ce2b>   DW_AT_decl_column : 68
    <7ce2c>   DW_AT_type        : <0x7c08f>
    <7ce30>   DW_AT_location    : 0x24577 (location list)
    <7ce34>   DW_AT_GNU_locviews: 0x2455d
 <2><7ce38>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7ce39>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <7ce3d>   DW_AT_decl_file   : 1
    <7ce3d>   DW_AT_decl_line   : 86
    <7ce3e>   DW_AT_decl_column : 79
    <7ce3f>   DW_AT_type        : <0x7c0ab>
    <7ce43>   DW_AT_location    : 0x245e7 (location list)
    <7ce47>   DW_AT_GNU_locviews: 0x245db
 <2><7ce4b>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7ce4c>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7ce50>   DW_AT_decl_file   : 1
    <7ce50>   DW_AT_decl_line   : 86
    <7ce51>   DW_AT_decl_column : 90
    <7ce52>   DW_AT_type        : <0x7c0ab>
    <7ce56>   DW_AT_location    : 0x2461f (location list)
    <7ce5a>   DW_AT_GNU_locviews: 0x24611
 <2><7ce5e>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <7ce5f>   DW_AT_abstract_origin: <0x7d0af>
    <7ce63>   DW_AT_entry_pc    : 0x45bad8
    <7ce6b>   DW_AT_GNU_entry_view: 1
    <7ce6c>   DW_AT_ranges      : 0x17224
    <7ce70>   DW_AT_call_file   : 1
    <7ce70>   DW_AT_call_line   : 88
    <7ce71>   DW_AT_call_column : 9
 <3><7ce71>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7ce72>   DW_AT_abstract_origin: <0x7d0f2>
    <7ce76>   DW_AT_location    : 0x24657 (location list)
    <7ce7a>   DW_AT_GNU_locviews: 0x24653
 <3><7ce7e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7ce7f>   DW_AT_abstract_origin: <0x7d0e8>
    <7ce83>   DW_AT_location    : 0x24675 (location list)
    <7ce87>   DW_AT_GNU_locviews: 0x24667
 <3><7ce8b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7ce8c>   DW_AT_abstract_origin: <0x7d0de>
    <7ce90>   DW_AT_location    : 0x246b7 (location list)
    <7ce94>   DW_AT_GNU_locviews: 0x246a9
 <3><7ce98>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7ce99>   DW_AT_abstract_origin: <0x7d0d4>
    <7ce9d>   DW_AT_location    : 0x24705 (location list)
    <7cea1>   DW_AT_GNU_locviews: 0x246eb
 <3><7cea5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cea6>   DW_AT_abstract_origin: <0x7d0ca>
    <7ceaa>   DW_AT_location    : 0x24777 (location list)
    <7ceae>   DW_AT_GNU_locviews: 0x24769
 <3><7ceb2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7ceb3>   DW_AT_abstract_origin: <0x7d0c0>
    <7ceb7>   DW_AT_location    : 0x247b9 (location list)
    <7cebb>   DW_AT_GNU_locviews: 0x247ab
 <3><7cebf>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <7cec0>   DW_AT_ranges      : 0x17224
 <4><7cec4>: Abbrev Number: 9 (DW_TAG_variable)
    <7cec5>   DW_AT_abstract_origin: <0x7d0fc>
 <4><7cec9>: Abbrev Number: 9 (DW_TAG_variable)
    <7ceca>   DW_AT_abstract_origin: <0x7d107>
 <4><7cece>: Abbrev Number: 9 (DW_TAG_variable)
    <7cecf>   DW_AT_abstract_origin: <0x7d112>
 <4><7ced3>: Abbrev Number: 9 (DW_TAG_variable)
    <7ced4>   DW_AT_abstract_origin: <0x7d11d>
 <4><7ced8>: Abbrev Number: 39 (DW_TAG_variable)
    <7ced9>   DW_AT_abstract_origin: <0x7d128>
    <7cedd>   DW_AT_const_value : 4
 <4><7cedd>: Abbrev Number: 9 (DW_TAG_variable)
    <7cede>   DW_AT_abstract_origin: <0x7d133>
 <4><7cee2>: Abbrev Number: 9 (DW_TAG_variable)
    <7cee3>   DW_AT_abstract_origin: <0x7d13e>
 <4><7cee7>: Abbrev Number: 9 (DW_TAG_variable)
    <7cee8>   DW_AT_abstract_origin: <0x7d149>
 <4><7ceec>: Abbrev Number: 40 (DW_TAG_inlined_subroutine)
    <7ceed>   DW_AT_abstract_origin: <0x7d0af>
    <7cef1>   DW_AT_entry_pc    : 0x45baef
    <7cef9>   DW_AT_GNU_entry_view: 0
    <7cefa>   DW_AT_ranges      : 0x17237
    <7cefe>   DW_AT_call_file   : 1
    <7cefe>   DW_AT_call_line   : 5
    <7cefe>   DW_AT_call_column : 14
    <7cefe>   DW_AT_sibling     : <0x7d099>
 <5><7cf02>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf03>   DW_AT_abstract_origin: <0x7d0f2>
    <7cf07>   DW_AT_location    : 0x247f3 (location list)
    <7cf0b>   DW_AT_GNU_locviews: 0x247ed
 <5><7cf0f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf10>   DW_AT_abstract_origin: <0x7d0e8>
    <7cf14>   DW_AT_location    : 0x24815 (location list)
    <7cf18>   DW_AT_GNU_locviews: 0x24809
 <5><7cf1c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf1d>   DW_AT_abstract_origin: <0x7d0de>
    <7cf21>   DW_AT_location    : 0x2484f (location list)
    <7cf25>   DW_AT_GNU_locviews: 0x24841
 <5><7cf29>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf2a>   DW_AT_abstract_origin: <0x7d0d4>
    <7cf2e>   DW_AT_location    : 0x2489f (location list)
    <7cf32>   DW_AT_GNU_locviews: 0x24883
 <5><7cf36>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf37>   DW_AT_abstract_origin: <0x7d0ca>
    <7cf3b>   DW_AT_location    : 0x24915 (location list)
    <7cf3f>   DW_AT_GNU_locviews: 0x24909
 <5><7cf43>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7cf44>   DW_AT_abstract_origin: <0x7d0c0>
    <7cf48>   DW_AT_location    : 0x2494d (location list)
    <7cf4c>   DW_AT_GNU_locviews: 0x24941
 <5><7cf50>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <7cf51>   DW_AT_ranges      : 0x17237
 <6><7cf55>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf56>   DW_AT_abstract_origin: <0x7d0fc>
    <7cf5a>   DW_AT_location    : 0x24983 (location list)
    <7cf5e>   DW_AT_GNU_locviews: 0x24979
 <6><7cf62>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf63>   DW_AT_abstract_origin: <0x7d107>
    <7cf67>   DW_AT_location    : 0x249a4 (location list)
    <7cf6b>   DW_AT_GNU_locviews: 0x249a2
 <6><7cf6f>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf70>   DW_AT_abstract_origin: <0x7d112>
    <7cf74>   DW_AT_location    : 0x249b0 (location list)
    <7cf78>   DW_AT_GNU_locviews: 0x249ac
 <6><7cf7c>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf7d>   DW_AT_abstract_origin: <0x7d11d>
    <7cf81>   DW_AT_location    : 0x249c9 (location list)
    <7cf85>   DW_AT_GNU_locviews: 0x249bf
 <6><7cf89>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf8a>   DW_AT_abstract_origin: <0x7d128>
    <7cf8e>   DW_AT_location    : 0x249f8 (location list)
    <7cf92>   DW_AT_GNU_locviews: 0x249f4
 <6><7cf96>: Abbrev Number: 8 (DW_TAG_variable)
    <7cf97>   DW_AT_abstract_origin: <0x7d133>
    <7cf9b>   DW_AT_location    : 0x24a11 (location list)
    <7cf9f>   DW_AT_GNU_locviews: 0x24a0b
 <6><7cfa3>: Abbrev Number: 8 (DW_TAG_variable)
    <7cfa4>   DW_AT_abstract_origin: <0x7d13e>
    <7cfa8>   DW_AT_location    : 0x24a29 (location list)
    <7cfac>   DW_AT_GNU_locviews: 0x24a25
 <6><7cfb0>: Abbrev Number: 8 (DW_TAG_variable)
    <7cfb1>   DW_AT_abstract_origin: <0x7d149>
    <7cfb5>   DW_AT_location    : 0x24a40 (location list)
    <7cfb9>   DW_AT_GNU_locviews: 0x24a3a
 <6><7cfbd>: Abbrev Number: 41 (DW_TAG_call_site)
    <7cfbe>   DW_AT_call_return_pc: 0x45baf4
    <7cfc6>   DW_AT_call_origin : <0x7cac3>
 <6><7cfca>: Abbrev Number: 14 (DW_TAG_call_site)
    <7cfcb>   DW_AT_call_return_pc: 0x45bb88
    <7cfd3>   DW_AT_call_origin : <0x7caac>
    <7cfd7>   DW_AT_sibling     : <0x7cfe8>
 <7><7cfdb>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cfdc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cfde>   DW_AT_call_value  : 8 byte block: 73 36 8 20 24 8 20 26 	(DW_OP_breg3 (rbx): 54; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <7><7cfe7>: Abbrev Number: 0
 <6><7cfe8>: Abbrev Number: 33 (DW_TAG_call_site)
    <7cfe9>   DW_AT_call_return_pc: 0x45bbcc
    <7cff1>   DW_AT_sibling     : <0x7d006>
 <7><7cff5>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cff6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7cff8>   DW_AT_call_value  : 2 byte block: 7c 18 	(DW_OP_breg12 (r12): 24)
 <7><7cffb>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7cffc>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7cffe>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <7><7d000>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d001>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7d003>   DW_AT_call_value  : 1 byte block: 38 	(DW_OP_lit8)
 <7><7d005>: Abbrev Number: 0
 <6><7d006>: Abbrev Number: 14 (DW_TAG_call_site)
    <7d007>   DW_AT_call_return_pc: 0x45bbd7
    <7d00f>   DW_AT_call_origin : <0x7ca95>
    <7d013>   DW_AT_sibling     : <0x7d024>
 <7><7d017>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d018>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d01a>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <7><7d01d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d01e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7d020>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <7><7d023>: Abbrev Number: 0
 <6><7d024>: Abbrev Number: 14 (DW_TAG_call_site)
    <7d025>   DW_AT_call_return_pc: 0x45bbe4
    <7d02d>   DW_AT_call_origin : <0x7ca79>
    <7d031>   DW_AT_sibling     : <0x7d044>
 <7><7d035>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d036>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d038>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <7><7d03b>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d03c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7d03e>   DW_AT_call_value  : 4 byte block: 40 44 24 1f 	(DW_OP_lit16; DW_OP_lit20; DW_OP_shl; DW_OP_neg)
 <7><7d043>: Abbrev Number: 0
 <6><7d044>: Abbrev Number: 33 (DW_TAG_call_site)
    <7d045>   DW_AT_call_return_pc: 0x45bbf9
    <7d04d>   DW_AT_sibling     : <0x7d06d>
 <7><7d051>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d052>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d054>   DW_AT_call_value  : 2 byte block: 7c 20 	(DW_OP_breg12 (r12): 32)
 <7><7d057>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d058>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7d05a>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <7><7d05d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d05e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7d060>   DW_AT_call_value  : 11 byte block: 73 0 7f 0 1b 8 20 24 8 20 26 	(DW_OP_breg3 (rbx): 0; DW_OP_breg15 (r15): 0; DW_OP_div; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <7><7d06c>: Abbrev Number: 0
 <6><7d06d>: Abbrev Number: 14 (DW_TAG_call_site)
    <7d06e>   DW_AT_call_return_pc: 0x45bc00
    <7d076>   DW_AT_call_origin : <0x7cad0>
    <7d07a>   DW_AT_sibling     : <0x7d084>
 <7><7d07e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d07f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d081>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <7><7d083>: Abbrev Number: 0
 <6><7d084>: Abbrev Number: 27 (DW_TAG_call_site)
    <7d085>   DW_AT_call_return_pc: 0x45bc60
    <7d08d>   DW_AT_call_origin : <0x7cad0>
 <7><7d091>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d092>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d094>   DW_AT_call_value  : 1 byte block: 34 	(DW_OP_lit4)
 <7><7d096>: Abbrev Number: 0
 <6><7d097>: Abbrev Number: 0
 <5><7d098>: Abbrev Number: 0
 <4><7d099>: Abbrev Number: 27 (DW_TAG_call_site)
    <7d09a>   DW_AT_call_return_pc: 0x45bb25
    <7d0a2>   DW_AT_call_origin : <0x7cad0>
 <5><7d0a6>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <7d0a7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7d0a9>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><7d0ab>: Abbrev Number: 0
 <4><7d0ac>: Abbrev Number: 0
 <3><7d0ad>: Abbrev Number: 0
 <2><7d0ae>: Abbrev Number: 0
 <1><7d0af>: Abbrev Number: 62 (DW_TAG_subprogram)
    <7d0b0>   DW_AT_name        : (indirect string, offset: 0x17c3a): gfx_imagecreate
    <7d0b4>   DW_AT_decl_file   : 1
    <7d0b5>   DW_AT_decl_line   : 5
    <7d0b6>   DW_AT_decl_column : 14
    <7d0b7>   DW_AT_prototyped  : 1
    <7d0b7>   DW_AT_type        : <0x7c0c3>
    <7d0bb>   DW_AT_inline      : 1	(inlined)
    <7d0bc>   DW_AT_sibling     : <0x7d155>
 <2><7d0c0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0c1>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7d0c5>   DW_AT_decl_file   : 1
    <7d0c5>   DW_AT_decl_line   : 5
    <7d0c5>   DW_AT_decl_column : 34
    <7d0c6>   DW_AT_type        : <0x7c0ab>
 <2><7d0ca>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0cb>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7d0cf>   DW_AT_decl_file   : 1
    <7d0cf>   DW_AT_decl_line   : 5
    <7d0cf>   DW_AT_decl_column : 45
    <7d0d0>   DW_AT_type        : <0x7c0ab>
 <2><7d0d4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0d5>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7d0d9>   DW_AT_decl_file   : 1
    <7d0d9>   DW_AT_decl_line   : 5
    <7d0d9>   DW_AT_decl_column : 66
    <7d0da>   DW_AT_type        : <0x7c08f>
 <2><7d0de>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0df>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <7d0e3>   DW_AT_decl_file   : 1
    <7d0e3>   DW_AT_decl_line   : 5
    <7d0e3>   DW_AT_decl_column : 77
    <7d0e4>   DW_AT_type        : <0x7c0ab>
 <2><7d0e8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0e9>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7d0ed>   DW_AT_decl_file   : 1
    <7d0ed>   DW_AT_decl_line   : 5
    <7d0ed>   DW_AT_decl_column : 88
    <7d0ee>   DW_AT_type        : <0x7c0ab>
 <2><7d0f2>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7d0f3>   DW_AT_name        : (indirect string, offset: 0x16c96): usenewheader
    <7d0f7>   DW_AT_decl_file   : 1
    <7d0f7>   DW_AT_decl_line   : 5
    <7d0f7>   DW_AT_decl_column : 99
    <7d0f8>   DW_AT_type        : <0x7c0ab>
 <2><7d0fc>: Abbrev Number: 17 (DW_TAG_variable)
    <7d0fd>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7d101>   DW_AT_decl_file   : 1
    <7d101>   DW_AT_decl_line   : 7
    <7d102>   DW_AT_decl_column : 13
    <7d103>   DW_AT_type        : <0x7ca90>
 <2><7d107>: Abbrev Number: 17 (DW_TAG_variable)
    <7d108>   DW_AT_name        : (indirect string, offset: 0x1a6ec): image
    <7d10c>   DW_AT_decl_file   : 1
    <7d10c>   DW_AT_decl_line   : 8
    <7d10d>   DW_AT_decl_column : 14
    <7d10e>   DW_AT_type        : <0x7d155>
 <2><7d112>: Abbrev Number: 17 (DW_TAG_variable)
    <7d113>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <7d117>   DW_AT_decl_file   : 1
    <7d117>   DW_AT_decl_line   : 9
    <7d118>   DW_AT_decl_column : 6
    <7d119>   DW_AT_type        : <0x7c0ab>
 <2><7d11d>: Abbrev Number: 17 (DW_TAG_variable)
    <7d11e>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7d122>   DW_AT_decl_file   : 1
    <7d122>   DW_AT_decl_line   : 9
    <7d123>   DW_AT_decl_column : 12
    <7d124>   DW_AT_type        : <0x7c0ab>
 <2><7d128>: Abbrev Number: 17 (DW_TAG_variable)
    <7d129>   DW_AT_name        : (indirect string, offset: 0x17c2e): header_size
    <7d12d>   DW_AT_decl_file   : 1
    <7d12d>   DW_AT_decl_line   : 9
    <7d12e>   DW_AT_decl_column : 19
    <7d12f>   DW_AT_type        : <0x7c0ab>
 <2><7d133>: Abbrev Number: 42 (DW_TAG_variable)
    <7d134>   DW_AT_name        : bpp
    <7d138>   DW_AT_decl_file   : 1
    <7d138>   DW_AT_decl_line   : 10
    <7d139>   DW_AT_decl_column : 6
    <7d13a>   DW_AT_type        : <0x7c0ab>
 <2><7d13e>: Abbrev Number: 17 (DW_TAG_variable)
    <7d13f>   DW_AT_name        : (indirect string, offset: 0x1a409): p_size
    <7d143>   DW_AT_decl_file   : 1
    <7d143>   DW_AT_decl_line   : 52
    <7d144>   DW_AT_decl_column : 6
    <7d145>   DW_AT_type        : <0x7c0ab>
 <2><7d149>: Abbrev Number: 42 (DW_TAG_variable)
    <7d14a>   DW_AT_name        : tmp
    <7d14e>   DW_AT_decl_file   : 1
    <7d14e>   DW_AT_decl_line   : 53
    <7d14f>   DW_AT_decl_column : 8
    <7d150>   DW_AT_type        : <0x7c0c3>
 <2><7d154>: Abbrev Number: 0
 <1><7d155>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7d156>   DW_AT_byte_size   : 8
    <7d156>   DW_AT_type        : <0x7ca3d>
 <1><7d15a>: Abbrev Number: 0
  Compilation Unit @ offset 0x7d15b:
   Length:        0xc59 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x21df
   Pointer Size:  8
 <0><7d167>: Abbrev Number: 25 (DW_TAG_compile_unit)
    <7d168>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <7d16c>   DW_AT_language    : 29	(C11)
    <7d16d>   DW_AT_name        : (indirect line string, offset: 0x32e): src/gfxlib2/gfx_image_convert.c
    <7d171>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <7d175>   DW_AT_low_pc      : 0x45be10
    <7d17d>   DW_AT_high_pc     : 0x972
    <7d185>   DW_AT_stmt_list   : 0x534b7
 <1><7d189>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d18a>   DW_AT_byte_size   : 1
    <7d18b>   DW_AT_encoding    : 8	(unsigned char)
    <7d18c>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><7d190>: Abbrev Number: 12 (DW_TAG_const_type)
    <7d191>   DW_AT_type        : <0x7d189>
 <1><7d195>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d196>   DW_AT_byte_size   : 2
    <7d197>   DW_AT_encoding    : 7	(unsigned)
    <7d198>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><7d19c>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d19d>   DW_AT_byte_size   : 4
    <7d19e>   DW_AT_encoding    : 7	(unsigned)
    <7d19f>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><7d1a3>: Abbrev Number: 12 (DW_TAG_const_type)
    <7d1a4>   DW_AT_type        : <0x7d19c>
 <1><7d1a8>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1a9>   DW_AT_byte_size   : 8
    <7d1aa>   DW_AT_encoding    : 7	(unsigned)
    <7d1ab>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><7d1af>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1b0>   DW_AT_byte_size   : 1
    <7d1b1>   DW_AT_encoding    : 6	(signed char)
    <7d1b2>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><7d1b6>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1b7>   DW_AT_byte_size   : 2
    <7d1b8>   DW_AT_encoding    : 5	(signed)
    <7d1b9>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><7d1bd>: Abbrev Number: 26 (DW_TAG_base_type)
    <7d1be>   DW_AT_byte_size   : 4
    <7d1bf>   DW_AT_encoding    : 5	(signed)
    <7d1c0>   DW_AT_name        : int
 <1><7d1c4>: Abbrev Number: 27 (DW_TAG_volatile_type)
    <7d1c5>   DW_AT_type        : <0x7d1bd>
 <1><7d1c9>: Abbrev Number: 12 (DW_TAG_const_type)
    <7d1ca>   DW_AT_type        : <0x7d1bd>
 <1><7d1ce>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1cf>   DW_AT_byte_size   : 8
    <7d1d0>   DW_AT_encoding    : 5	(signed)
    <7d1d1>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><7d1d5>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <7d1d6>   DW_AT_byte_size   : 8
 <1><7d1d7>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <7d1d8>   DW_AT_byte_size   : 8
    <7d1d8>   DW_AT_type        : <0x7d1dc>
 <1><7d1dc>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1dd>   DW_AT_byte_size   : 1
    <7d1de>   DW_AT_encoding    : 6	(signed char)
    <7d1df>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><7d1e3>: Abbrev Number: 13 (DW_TAG_typedef)
    <7d1e4>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <7d1e8>   DW_AT_decl_file   : 2
    <7d1e9>   DW_AT_decl_line   : 209
    <7d1ea>   DW_AT_decl_column : 23
    <7d1eb>   DW_AT_type        : <0x7d1a8>
 <1><7d1ef>: Abbrev Number: 17 (DW_TAG_typedef)
    <7d1f0>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <7d1f4>   DW_AT_decl_file   : 2
    <7d1f5>   DW_AT_decl_line   : 321
    <7d1f7>   DW_AT_decl_column : 24
    <7d1f8>   DW_AT_type        : <0x7d1bd>
 <1><7d1fc>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d1fd>   DW_AT_byte_size   : 8
    <7d1fe>   DW_AT_encoding    : 5	(signed)
    <7d1ff>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><7d203>: Abbrev Number: 7 (DW_TAG_base_type)
    <7d204>   DW_AT_byte_size   : 8
    <7d205>   DW_AT_encoding    : 7	(unsigned)
    <7d206>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><7d20a>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <7d20b>   DW_AT_byte_size   : 8
    <7d20b>   DW_AT_type        : <0x7d20f>
 <1><7d20f>: Abbrev Number: 29 (DW_TAG_const_type)
 <1><7d210>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <7d211>   DW_AT_byte_size   : 8
    <7d211>   DW_AT_type        : <0x7d215>
 <1><7d215>: Abbrev Number: 30 (DW_TAG_subroutine_type)
