    <cd095>   DW_AT_data_member_location: 184
 <2><cd096>: Abbrev Number: 2 (DW_TAG_member)
    <cd097>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <cd09b>   DW_AT_decl_file   : 9
    <cd09c>   DW_AT_decl_line   : 118
    <cd09d>   DW_AT_decl_column : 22
    <cd09e>   DW_AT_type        : <0xccf0c>
    <cd0a2>   DW_AT_data_member_location: 192
 <2><cd0a3>: Abbrev Number: 2 (DW_TAG_member)
    <cd0a4>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <cd0a8>   DW_AT_decl_file   : 9
    <cd0a9>   DW_AT_decl_line   : 119
    <cd0aa>   DW_AT_decl_column : 23
    <cd0ab>   DW_AT_type        : <0xccf18>
    <cd0af>   DW_AT_data_member_location: 200
 <2><cd0b0>: Abbrev Number: 2 (DW_TAG_member)
    <cd0b1>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <cd0b5>   DW_AT_decl_file   : 9
    <cd0b6>   DW_AT_decl_line   : 120
    <cd0b7>   DW_AT_decl_column : 22
    <cd0b8>   DW_AT_type        : <0xccf24>
    <cd0bc>   DW_AT_data_member_location: 208
 <2><cd0bd>: Abbrev Number: 2 (DW_TAG_member)
    <cd0be>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <cd0c2>   DW_AT_decl_file   : 9
    <cd0c3>   DW_AT_decl_line   : 121
    <cd0c4>   DW_AT_decl_column : 23
    <cd0c5>   DW_AT_type        : <0xccf30>
    <cd0c9>   DW_AT_data_member_location: 216
 <2><cd0ca>: Abbrev Number: 0
 <1><cd0cb>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd0cc>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <cd0d0>   DW_AT_decl_file   : 9
    <cd0d1>   DW_AT_decl_line   : 122
    <cd0d2>   DW_AT_decl_column : 3
    <cd0d3>   DW_AT_type        : <0xccf51>
 <1><cd0d7>: Abbrev Number: 44 (DW_TAG_structure_type)
    <cd0d8>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <cd0dc>   DW_AT_byte_size   : 20848
    <cd0de>   DW_AT_decl_file   : 10
    <cd0df>   DW_AT_decl_line   : 349
    <cd0e1>   DW_AT_decl_column : 16
    <cd0e2>   DW_AT_sibling     : <0xcd157>
 <2><cd0e6>: Abbrev Number: 14 (DW_TAG_member)
    <cd0e7>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <cd0eb>   DW_AT_decl_file   : 10
    <cd0eb>   DW_AT_decl_line   : 350
    <cd0ed>   DW_AT_decl_column : 18
    <cd0ed>   DW_AT_type        : <0xcc6aa>
    <cd0f1>   DW_AT_data_member_location: 0
 <2><cd0f2>: Abbrev Number: 14 (DW_TAG_member)
    <cd0f3>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <cd0f7>   DW_AT_decl_file   : 10
    <cd0f7>   DW_AT_decl_line   : 351
    <cd0f9>   DW_AT_decl_column : 18
    <cd0f9>   DW_AT_type        : <0xcc738>
    <cd0fd>   DW_AT_data_member_location: 8
 <2><cd0fe>: Abbrev Number: 14 (DW_TAG_member)
    <cd0ff>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <cd103>   DW_AT_decl_file   : 10
    <cd103>   DW_AT_decl_line   : 352
    <cd105>   DW_AT_decl_column : 18
    <cd105>   DW_AT_type        : <0xcc784>
    <cd109>   DW_AT_data_member_location: 16
 <2><cd10a>: Abbrev Number: 14 (DW_TAG_member)
    <cd10b>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <cd10f>   DW_AT_decl_file   : 10
    <cd10f>   DW_AT_decl_line   : 353
    <cd111>   DW_AT_decl_column : 18
    <cd111>   DW_AT_type        : <0xcc6d2>
    <cd115>   DW_AT_data_member_location: 40
 <2><cd116>: Abbrev Number: 14 (DW_TAG_member)
    <cd117>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <cd11b>   DW_AT_decl_file   : 10
    <cd11b>   DW_AT_decl_line   : 354
    <cd11d>   DW_AT_decl_column : 18
    <cd11d>   DW_AT_type        : <0xcd0cb>
    <cd121>   DW_AT_data_member_location: 48
 <2><cd122>: Abbrev Number: 19 (DW_TAG_member)
    <cd123>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <cd127>   DW_AT_decl_file   : 10
    <cd127>   DW_AT_decl_line   : 355
    <cd129>   DW_AT_decl_column : 18
    <cd129>   DW_AT_type        : <0xcd157>
    <cd12d>   DW_AT_data_member_location: 272
 <2><cd12f>: Abbrev Number: 19 (DW_TAG_member)
    <cd130>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <cd134>   DW_AT_decl_file   : 10
    <cd134>   DW_AT_decl_line   : 356
    <cd136>   DW_AT_decl_column : 18
    <cd136>   DW_AT_type        : <0xcc6aa>
    <cd13a>   DW_AT_data_member_location: 20832
 <2><cd13c>: Abbrev Number: 19 (DW_TAG_member)
    <cd13d>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <cd141>   DW_AT_decl_file   : 10
    <cd141>   DW_AT_decl_line   : 357
    <cd143>   DW_AT_decl_column : 18
    <cd143>   DW_AT_type        : <0xcc6aa>
    <cd147>   DW_AT_data_member_location: 20836
 <2><cd149>: Abbrev Number: 19 (DW_TAG_member)
    <cd14a>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <cd14e>   DW_AT_decl_file   : 10
    <cd14e>   DW_AT_decl_line   : 358
    <cd150>   DW_AT_decl_column : 18
    <cd150>   DW_AT_type        : <0xcc749>
    <cd154>   DW_AT_data_member_location: 20840
 <2><cd156>: Abbrev Number: 0
 <1><cd157>: Abbrev Number: 20 (DW_TAG_array_type)
    <cd158>   DW_AT_type        : <0xccb65>
    <cd15c>   DW_AT_sibling     : <0xcd168>
 <2><cd160>: Abbrev Number: 45 (DW_TAG_subrange_type)
    <cd161>   DW_AT_type        : <0xcc695>
    <cd165>   DW_AT_upper_bound : 256
 <2><cd167>: Abbrev Number: 0
 <1><cd168>: Abbrev Number: 22 (DW_TAG_typedef)
    <cd169>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <cd16d>   DW_AT_decl_file   : 10
    <cd16e>   DW_AT_decl_line   : 359
    <cd170>   DW_AT_decl_column : 3
    <cd171>   DW_AT_type        : <0xcd0d7>
 <1><cd175>: Abbrev Number: 46 (DW_TAG_variable)
    <cd176>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <cd17a>   DW_AT_decl_file   : 10
    <cd17b>   DW_AT_decl_line   : 361
    <cd17d>   DW_AT_decl_column : 21
    <cd17e>   DW_AT_type        : <0xcd168>
    <cd182>   DW_AT_external    : 1
    <cd182>   DW_AT_declaration : 1
 <1><cd182>: Abbrev Number: 47 (DW_TAG_subprogram)
    <cd183>   DW_AT_external    : 1
    <cd183>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <cd187>   DW_AT_decl_file   : 11
    <cd188>   DW_AT_decl_line   : 61
    <cd189>   DW_AT_decl_column : 14
    <cd18a>   DW_AT_prototyped  : 1
    <cd18a>   DW_AT_type        : <0xcc6c4>
    <cd18e>   DW_AT_declaration : 1
    <cd18e>   DW_AT_sibling     : <0xcd1a2>
 <2><cd192>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd193>   DW_AT_type        : <0xcc6c4>
 <2><cd197>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd198>   DW_AT_type        : <0xcc6aa>
 <2><cd19c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd19d>   DW_AT_type        : <0xcc6de>
 <2><cd1a1>: Abbrev Number: 0
 <1><cd1a2>: Abbrev Number: 48 (DW_TAG_subprogram)
    <cd1a3>   DW_AT_external    : 1
    <cd1a3>   DW_AT_name        : (indirect string, offset: 0x1bbe5): fb_hFilePrintBufferEx
    <cd1a7>   DW_AT_decl_file   : 2
    <cd1a8>   DW_AT_decl_line   : 304
    <cd1aa>   DW_AT_decl_column : 21
    <cd1ab>   DW_AT_prototyped  : 1
    <cd1ab>   DW_AT_type        : <0xcc6aa>
    <cd1af>   DW_AT_declaration : 1
    <cd1af>   DW_AT_sibling     : <0xcd1c3>
 <2><cd1b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd1b4>   DW_AT_type        : <0xccb71>
 <2><cd1b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd1b9>   DW_AT_type        : <0xcc732>
 <2><cd1bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd1be>   DW_AT_type        : <0xcc6de>
 <2><cd1c2>: Abbrev Number: 0
 <1><cd1c3>: Abbrev Number: 49 (DW_TAG_subprogram)
    <cd1c4>   DW_AT_external    : 1
    <cd1c4>   DW_AT_name        : (indirect string, offset: 0x1bd04): fb_DevScrnInit_Write
    <cd1c8>   DW_AT_decl_file   : 12
    <cd1c9>   DW_AT_decl_line   : 56
    <cd1ca>   DW_AT_decl_column : 21
    <cd1cb>   DW_AT_prototyped  : 1
    <cd1cb>   DW_AT_declaration : 1
 <1><cd1cb>: Abbrev Number: 50 (DW_TAG_subprogram)
    <cd1cc>   DW_AT_external    : 1
    <cd1cc>   DW_AT_name        : (indirect string, offset: 0x1bced): fb_PrintPad
    <cd1d0>   DW_AT_decl_file   : 1
    <cd1d1>   DW_AT_decl_line   : 58
    <cd1d2>   DW_AT_decl_column : 13
    <cd1d3>   DW_AT_prototyped  : 1
    <cd1d3>   DW_AT_ranges      : 0x182aa
    <cd1d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd1d9>   DW_AT_call_all_calls: 1
    <cd1d9>   DW_AT_sibling     : <0xcd38f>
 <2><cd1dd>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <cd1de>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <cd1e2>   DW_AT_decl_file   : 1
    <cd1e2>   DW_AT_decl_line   : 58
    <cd1e2>   DW_AT_decl_column : 31
    <cd1e3>   DW_AT_type        : <0xcc6aa>
    <cd1e7>   DW_AT_location    : 0x3c7a1 (location list)
    <cd1eb>   DW_AT_GNU_locviews: 0x3c78f
 <2><cd1ef>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <cd1f0>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <cd1f4>   DW_AT_decl_file   : 1
    <cd1f4>   DW_AT_decl_line   : 58
    <cd1f4>   DW_AT_decl_column : 41
    <cd1f5>   DW_AT_type        : <0xcc6aa>
    <cd1f9>   DW_AT_location    : 0x3c801 (location list)
    <cd1fd>   DW_AT_GNU_locviews: 0x3c7f3
 <2><cd201>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <cd202>   DW_AT_abstract_origin: <0xcd38f>
    <cd206>   DW_AT_entry_pc    : 0x4743e7
    <cd20e>   DW_AT_GNU_entry_view: 0
    <cd20f>   DW_AT_ranges      : 0x182c0
    <cd213>   DW_AT_call_file   : 1
    <cd213>   DW_AT_call_line   : 60
    <cd214>   DW_AT_call_column : 5
    <cd215>   DW_AT_sibling     : <0xcd381>
 <3><cd219>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd21a>   DW_AT_abstract_origin: <0xcd3a8>
    <cd21e>   DW_AT_location    : 0x3c84f (location list)
    <cd222>   DW_AT_GNU_locviews: 0x3c847
 <3><cd226>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd227>   DW_AT_abstract_origin: <0xcd39c>
    <cd22b>   DW_AT_location    : 0x3c880 (location list)
    <cd22f>   DW_AT_GNU_locviews: 0x3c87c
 <3><cd233>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <cd234>   DW_AT_ranges      : 0x182c0
 <4><cd238>: Abbrev Number: 9 (DW_TAG_variable)
    <cd239>   DW_AT_abstract_origin: <0xcd3b4>
    <cd23d>   DW_AT_location    : 0x3c8a0 (location list)
    <cd241>   DW_AT_GNU_locviews: 0x3c89a
 <4><cd245>: Abbrev Number: 9 (DW_TAG_variable)
    <cd246>   DW_AT_abstract_origin: <0xcd3bf>
    <cd24a>   DW_AT_location    : 0x3c8ca (location list)
    <cd24e>   DW_AT_GNU_locviews: 0x3c8c2
 <4><cd252>: Abbrev Number: 9 (DW_TAG_variable)
    <cd253>   DW_AT_abstract_origin: <0xcd3ca>
    <cd257>   DW_AT_location    : 0x3c8fd (location list)
    <cd25b>   DW_AT_GNU_locviews: 0x3c8f5
 <4><cd25f>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <cd260>   DW_AT_abstract_origin: <0xcd43c>
    <cd264>   DW_AT_entry_pc    : 0x4743ec
    <cd26c>   DW_AT_GNU_entry_view: 1
    <cd26d>   DW_AT_ranges      : 0x182e1
    <cd271>   DW_AT_call_file   : 1
    <cd271>   DW_AT_call_line   : 40
    <cd272>   DW_AT_call_column : 18
    <cd273>   DW_AT_sibling     : <0xcd285>
 <5><cd277>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd278>   DW_AT_abstract_origin: <0xcd44d>
    <cd27c>   DW_AT_location    : 0x3c929 (location list)
    <cd280>   DW_AT_GNU_locviews: 0x3c921
 <5><cd284>: Abbrev Number: 0
 <4><cd285>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <cd286>   DW_AT_abstract_origin: <0xcd3d6>
    <cd28a>   DW_AT_entry_pc    : 0x47442a
    <cd292>   DW_AT_GNU_entry_view: 1
    <cd293>   DW_AT_ranges      : 0x182fb
    <cd297>   DW_AT_call_file   : 1
    <cd297>   DW_AT_call_line   : 53
    <cd298>   DW_AT_call_column : 5
    <cd299>   DW_AT_sibling     : <0xcd365>
 <5><cd29d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd29e>   DW_AT_abstract_origin: <0xcd3ef>
    <cd2a2>   DW_AT_location    : 0x3c953 (location list)
    <cd2a6>   DW_AT_GNU_locviews: 0x3c94f
 <5><cd2aa>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd2ab>   DW_AT_abstract_origin: <0xcd407>
    <cd2af>   DW_AT_location    : 0x3c971 (location list)
    <cd2b3>   DW_AT_GNU_locviews: 0x3c96d
 <5><cd2b7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd2b8>   DW_AT_abstract_origin: <0xcd3fb>
    <cd2bc>   DW_AT_location    : 0x3c98d (location list)
    <cd2c0>   DW_AT_GNU_locviews: 0x3c985
 <5><cd2c4>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd2c5>   DW_AT_abstract_origin: <0xcd3e3>
    <cd2c9>   DW_AT_location    : 0x3c9bd (location list)
    <cd2cd>   DW_AT_GNU_locviews: 0x3c9b7
 <5><cd2d1>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <cd2d2>   DW_AT_ranges      : 0x182fb
 <6><cd2d6>: Abbrev Number: 29 (DW_TAG_variable)
    <cd2d7>   DW_AT_abstract_origin: <0xcd413>
    <cd2db>   DW_AT_location    : 2 byte block: 91 49 	(DW_OP_fbreg: -55)
 <6><cd2de>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <cd2df>   DW_AT_abstract_origin: <0xcd41e>
    <cd2e3>   DW_AT_low_pc      : 0x47446e
    <cd2eb>   DW_AT_high_pc     : 0x2e
    <cd2f3>   DW_AT_sibling     : <0xcd343>
 <7><cd2f7>: Abbrev Number: 9 (DW_TAG_variable)
    <cd2f8>   DW_AT_abstract_origin: <0xcd41f>
    <cd2fc>   DW_AT_location    : 0x3c9d8 (location list)
    <cd300>   DW_AT_GNU_locviews: 0x3c9d6
 <7><cd304>: Abbrev Number: 31 (DW_TAG_call_site)
    <cd305>   DW_AT_call_return_pc: 0x474488
    <cd30d>   DW_AT_call_origin : <0xcd182>
    <cd311>   DW_AT_sibling     : <0xcd328>
 <8><cd315>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd316>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cd318>   DW_AT_call_value  : 2 byte block: 91 49 	(DW_OP_fbreg: -55)
 <8><cd31b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd31c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cd31e>   DW_AT_call_value  : 2 byte block: 8 20 	(DW_OP_const1u: 32)
 <8><cd321>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd322>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd324>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <8><cd327>: Abbrev Number: 0
 <7><cd328>: Abbrev Number: 32 (DW_TAG_call_site)
    <cd329>   DW_AT_call_return_pc: 0x47449c
    <cd331>   DW_AT_call_origin : <0xcd1a2>
 <8><cd335>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd336>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cd338>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <8><cd33b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd33c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd33e>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <8><cd341>: Abbrev Number: 0
 <7><cd342>: Abbrev Number: 0
 <6><cd343>: Abbrev Number: 33 (DW_TAG_call_site)
    <cd344>   DW_AT_call_return_pc: 0x47445d
    <cd34c>   DW_AT_call_tail_call: 1
    <cd34c>   DW_AT_call_origin : <0xcd1a2>
 <7><cd350>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd351>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cd353>   DW_AT_call_value  : 9 byte block: 3 e6 d3 47 0 0 0 0 0 	(DW_OP_addr: 47d3e6)
 <7><cd35d>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd35e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd360>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <7><cd362>: Abbrev Number: 0
 <6><cd363>: Abbrev Number: 0
 <5><cd364>: Abbrev Number: 0
 <4><cd365>: Abbrev Number: 16 (DW_TAG_call_site)
    <cd366>   DW_AT_call_return_pc: 0x4743ec
    <cd36e>   DW_AT_call_origin : <0xcd1c3>
 <4><cd372>: Abbrev Number: 16 (DW_TAG_call_site)
    <cd373>   DW_AT_call_return_pc: 0x405d86
    <cd37b>   DW_AT_call_origin : <0xcd1c3>
 <4><cd37f>: Abbrev Number: 0
 <3><cd380>: Abbrev Number: 0
 <2><cd381>: Abbrev Number: 16 (DW_TAG_call_site)
    <cd382>   DW_AT_call_return_pc: 0x4744c9
    <cd38a>   DW_AT_call_origin : <0xcd5d2>
 <2><cd38e>: Abbrev Number: 0
 <1><cd38f>: Abbrev Number: 51 (DW_TAG_subprogram)
    <cd390>   DW_AT_external    : 1
    <cd390>   DW_AT_name        : (indirect string, offset: 0x1bc28): fb_PrintPadEx
    <cd394>   DW_AT_decl_file   : 1
    <cd395>   DW_AT_decl_line   : 28
    <cd396>   DW_AT_decl_column : 6
    <cd397>   DW_AT_prototyped  : 1
    <cd397>   DW_AT_inline      : 1	(inlined)
    <cd398>   DW_AT_sibling     : <0xcd3d6>
 <2><cd39c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd39d>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <cd3a1>   DW_AT_decl_file   : 1
    <cd3a2>   DW_AT_decl_line   : 28
    <cd3a3>   DW_AT_decl_column : 31
    <cd3a4>   DW_AT_type        : <0xccb71>
 <2><cd3a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd3a9>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <cd3ad>   DW_AT_decl_file   : 1
    <cd3ae>   DW_AT_decl_line   : 28
    <cd3af>   DW_AT_decl_column : 43
    <cd3b0>   DW_AT_type        : <0xcc6aa>
 <2><cd3b4>: Abbrev Number: 17 (DW_TAG_variable)
    <cd3b5>   DW_AT_name        : (indirect string, offset: 0x1bcf9): tmp_handle
    <cd3b9>   DW_AT_decl_file   : 1
    <cd3b9>   DW_AT_decl_line   : 34
    <cd3ba>   DW_AT_decl_column : 14
    <cd3bb>   DW_AT_type        : <0xccb71>
 <2><cd3bf>: Abbrev Number: 17 (DW_TAG_variable)
    <cd3c0>   DW_AT_name        : (indirect string, offset: 0x1b002): old_x
    <cd3c4>   DW_AT_decl_file   : 1
    <cd3c4>   DW_AT_decl_line   : 35
    <cd3c5>   DW_AT_decl_column : 9
    <cd3c6>   DW_AT_type        : <0xcc6aa>
 <2><cd3ca>: Abbrev Number: 17 (DW_TAG_variable)
    <cd3cb>   DW_AT_name        : (indirect string, offset: 0x19d05): new_x
    <cd3cf>   DW_AT_decl_file   : 1
    <cd3cf>   DW_AT_decl_line   : 36
    <cd3d0>   DW_AT_decl_column : 9
    <cd3d1>   DW_AT_type        : <0xcc6aa>
 <2><cd3d5>: Abbrev Number: 0
 <1><cd3d6>: Abbrev Number: 52 (DW_TAG_subprogram)
    <cd3d7>   DW_AT_name        : (indirect string, offset: 0x1bcce): fb_hPrintPadEx
    <cd3db>   DW_AT_decl_file   : 1
    <cd3dc>   DW_AT_decl_line   : 7
    <cd3dd>   DW_AT_decl_column : 13
    <cd3de>   DW_AT_prototyped  : 1
    <cd3de>   DW_AT_inline      : 1	(inlined)
    <cd3df>   DW_AT_sibling     : <0xcd42c>
 <2><cd3e3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd3e4>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <cd3e8>   DW_AT_decl_file   : 1
    <cd3e9>   DW_AT_decl_line   : 7
    <cd3ea>   DW_AT_decl_column : 39
    <cd3eb>   DW_AT_type        : <0xccb71>
 <2><cd3ef>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd3f0>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <cd3f4>   DW_AT_decl_file   : 1
    <cd3f5>   DW_AT_decl_line   : 7
    <cd3f6>   DW_AT_decl_column : 51
    <cd3f7>   DW_AT_type        : <0xcc6aa>
 <2><cd3fb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd3fc>   DW_AT_name        : (indirect string, offset: 0x1b097): current_x
    <cd400>   DW_AT_decl_file   : 1
    <cd401>   DW_AT_decl_line   : 7
    <cd402>   DW_AT_decl_column : 61
    <cd403>   DW_AT_type        : <0xcc6aa>
 <2><cd407>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd408>   DW_AT_name        : (indirect string, offset: 0x19d05): new_x
    <cd40c>   DW_AT_decl_file   : 1
    <cd40d>   DW_AT_decl_line   : 7
    <cd40e>   DW_AT_decl_column : 76
    <cd40f>   DW_AT_type        : <0xcc6aa>
 <2><cd413>: Abbrev Number: 17 (DW_TAG_variable)
    <cd414>   DW_AT_name        : (indirect string, offset: 0x1bcdd): tab_char_buffer
    <cd418>   DW_AT_decl_file   : 1
    <cd418>   DW_AT_decl_line   : 13
    <cd419>   DW_AT_decl_column : 10
    <cd41a>   DW_AT_type        : <0xcd42c>
 <2><cd41e>: Abbrev Number: 53 (DW_TAG_lexical_block)
 <3><cd41f>: Abbrev Number: 17 (DW_TAG_variable)
    <cd420>   DW_AT_name        : (indirect string, offset: 0x18d05): count
    <cd424>   DW_AT_decl_file   : 1
    <cd424>   DW_AT_decl_line   : 17
    <cd425>   DW_AT_decl_column : 16
    <cd426>   DW_AT_type        : <0xcc6de>
 <3><cd42a>: Abbrev Number: 0
 <2><cd42b>: Abbrev Number: 0
 <1><cd42c>: Abbrev Number: 20 (DW_TAG_array_type)
    <cd42d>   DW_AT_type        : <0xcc6d7>
    <cd431>   DW_AT_sibling     : <0xcd43c>
 <2><cd435>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <cd436>   DW_AT_type        : <0xcc695>
    <cd43a>   DW_AT_upper_bound : 14
 <2><cd43b>: Abbrev Number: 0
 <1><cd43c>: Abbrev Number: 54 (DW_TAG_subprogram)
    <cd43d>   DW_AT_name        : (indirect string, offset: 0x1b241): FB_HANDLE_DEREF
    <cd441>   DW_AT_decl_file   : 2
    <cd442>   DW_AT_decl_line   : 144
    <cd443>   DW_AT_decl_column : 28
    <cd444>   DW_AT_prototyped  : 1
    <cd444>   DW_AT_type        : <0xccb71>
    <cd448>   DW_AT_inline      : 3	(declared as inline and inlined)
    <cd449>   DW_AT_sibling     : <0xcd45a>
 <2><cd44d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <cd44e>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <cd452>   DW_AT_decl_file   : 2
    <cd453>   DW_AT_decl_line   : 144
    <cd454>   DW_AT_decl_column : 54
    <cd455>   DW_AT_type        : <0xccb71>
 <2><cd459>: Abbrev Number: 0
 <1><cd45a>: Abbrev Number: 55 (DW_TAG_subprogram)
    <cd45b>   DW_AT_abstract_origin: <0xcd38f>
    <cd45f>   DW_AT_ranges      : 0x18266
    <cd463>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd465>   DW_AT_call_all_calls: 1
    <cd465>   DW_AT_sibling     : <0xcd5d2>
 <2><cd469>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd46a>   DW_AT_abstract_origin: <0xcd39c>
    <cd46e>   DW_AT_location    : 0x3c9f5 (location list)
    <cd472>   DW_AT_GNU_locviews: 0x3c9e5
 <2><cd476>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd477>   DW_AT_abstract_origin: <0xcd3a8>
    <cd47b>   DW_AT_location    : 0x3ca45 (location list)
    <cd47f>   DW_AT_GNU_locviews: 0x3ca3f
 <2><cd483>: Abbrev Number: 9 (DW_TAG_variable)
    <cd484>   DW_AT_abstract_origin: <0xcd3b4>
    <cd488>   DW_AT_location    : 0x3ca72 (location list)
    <cd48c>   DW_AT_GNU_locviews: 0x3ca6c
 <2><cd490>: Abbrev Number: 9 (DW_TAG_variable)
    <cd491>   DW_AT_abstract_origin: <0xcd3bf>
    <cd495>   DW_AT_location    : 0x3ca9c (location list)
    <cd499>   DW_AT_GNU_locviews: 0x3ca94
 <2><cd49d>: Abbrev Number: 9 (DW_TAG_variable)
    <cd49e>   DW_AT_abstract_origin: <0xcd3ca>
    <cd4a2>   DW_AT_location    : 0x3cacf (location list)
    <cd4a6>   DW_AT_GNU_locviews: 0x3cac7
 <2><cd4aa>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <cd4ab>   DW_AT_abstract_origin: <0xcd43c>
    <cd4af>   DW_AT_entry_pc    : 0x4742af
    <cd4b7>   DW_AT_GNU_entry_view: 1
    <cd4b8>   DW_AT_ranges      : 0x1827c
    <cd4bc>   DW_AT_call_file   : 1
    <cd4bc>   DW_AT_call_line   : 40
    <cd4bd>   DW_AT_call_column : 18
    <cd4be>   DW_AT_sibling     : <0xcd4d0>
 <3><cd4c2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd4c3>   DW_AT_abstract_origin: <0xcd44d>
    <cd4c7>   DW_AT_location    : 0x3caff (location list)
    <cd4cb>   DW_AT_GNU_locviews: 0x3caf3
 <3><cd4cf>: Abbrev Number: 0
 <2><cd4d0>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <cd4d1>   DW_AT_abstract_origin: <0xcd3d6>
    <cd4d5>   DW_AT_entry_pc    : 0x4742fa
    <cd4dd>   DW_AT_GNU_entry_view: 1
    <cd4de>   DW_AT_ranges      : 0x18291
    <cd4e2>   DW_AT_call_file   : 1
    <cd4e2>   DW_AT_call_line   : 53
    <cd4e3>   DW_AT_call_column : 5
    <cd4e4>   DW_AT_sibling     : <0xcd5b7>
 <3><cd4e8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd4e9>   DW_AT_abstract_origin: <0xcd3ef>
    <cd4ed>   DW_AT_location    : 0x3cb3c (location list)
    <cd4f1>   DW_AT_GNU_locviews: 0x3cb38
 <3><cd4f5>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd4f6>   DW_AT_abstract_origin: <0xcd407>
    <cd4fa>   DW_AT_location    : 0x3cb5a (location list)
    <cd4fe>   DW_AT_GNU_locviews: 0x3cb56
 <3><cd502>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd503>   DW_AT_abstract_origin: <0xcd3fb>
    <cd507>   DW_AT_location    : 0x3cb76 (location list)
    <cd50b>   DW_AT_GNU_locviews: 0x3cb6e
 <3><cd50f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <cd510>   DW_AT_abstract_origin: <0xcd3e3>
    <cd514>   DW_AT_location    : 0x3cba8 (location list)
    <cd518>   DW_AT_GNU_locviews: 0x3cba0
 <3><cd51c>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <cd51d>   DW_AT_ranges      : 0x18291
 <4><cd521>: Abbrev Number: 29 (DW_TAG_variable)
    <cd522>   DW_AT_abstract_origin: <0xcd413>
    <cd526>   DW_AT_location    : 2 byte block: 91 49 	(DW_OP_fbreg: -55)
 <4><cd529>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <cd52a>   DW_AT_abstract_origin: <0xcd41e>
    <cd52e>   DW_AT_low_pc      : 0x47433e
    <cd536>   DW_AT_high_pc     : 0x2e
    <cd53e>   DW_AT_sibling     : <0xcd58e>
 <5><cd542>: Abbrev Number: 9 (DW_TAG_variable)
    <cd543>   DW_AT_abstract_origin: <0xcd41f>
    <cd547>   DW_AT_location    : 0x3cbcb (location list)
    <cd54b>   DW_AT_GNU_locviews: 0x3cbc9
 <5><cd54f>: Abbrev Number: 31 (DW_TAG_call_site)
    <cd550>   DW_AT_call_return_pc: 0x474358
    <cd558>   DW_AT_call_origin : <0xcd182>
    <cd55c>   DW_AT_sibling     : <0xcd573>
 <6><cd560>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd561>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cd563>   DW_AT_call_value  : 2 byte block: 91 49 	(DW_OP_fbreg: -55)
 <6><cd566>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd567>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cd569>   DW_AT_call_value  : 2 byte block: 8 20 	(DW_OP_const1u: 32)
 <6><cd56c>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd56d>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd56f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><cd572>: Abbrev Number: 0
 <5><cd573>: Abbrev Number: 32 (DW_TAG_call_site)
    <cd574>   DW_AT_call_return_pc: 0x47436c
    <cd57c>   DW_AT_call_origin : <0xcd1a2>
 <6><cd580>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd581>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cd583>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <6><cd586>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd587>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd589>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><cd58c>: Abbrev Number: 0
 <5><cd58d>: Abbrev Number: 0
 <4><cd58e>: Abbrev Number: 33 (DW_TAG_call_site)
    <cd58f>   DW_AT_call_return_pc: 0x474329
    <cd597>   DW_AT_call_tail_call: 1
    <cd597>   DW_AT_call_origin : <0xcd1a2>
 <5><cd59b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd59c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cd59e>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <5><cd5a2>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd5a3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cd5a5>   DW_AT_call_value  : 9 byte block: 3 e6 d3 47 0 0 0 0 0 	(DW_OP_addr: 47d3e6)
 <5><cd5af>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <cd5b0>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cd5b2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><cd5b4>: Abbrev Number: 0
 <4><cd5b5>: Abbrev Number: 0
 <3><cd5b6>: Abbrev Number: 0
 <2><cd5b7>: Abbrev Number: 16 (DW_TAG_call_site)
    <cd5b8>   DW_AT_call_return_pc: 0x4742af
    <cd5c0>   DW_AT_call_origin : <0xcd1c3>
 <2><cd5c4>: Abbrev Number: 16 (DW_TAG_call_site)
    <cd5c5>   DW_AT_call_return_pc: 0x474389
    <cd5cd>   DW_AT_call_origin : <0xcd5d2>
 <2><cd5d1>: Abbrev Number: 0
 <1><cd5d2>: Abbrev Number: 56 (DW_TAG_subprogram)
    <cd5d3>   DW_AT_external    : 1
    <cd5d3>   DW_AT_declaration : 1
    <cd5d3>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <cd5d7>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><cd5db>: Abbrev Number: 0
  Compilation Unit @ offset 0xcd5dc:
   Length:        0xd65 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x11620
   Pointer Size:  8
 <0><cd5e8>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <cd5e9>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <cd5ed>   DW_AT_language    : 29	(C11)
    <cd5ee>   DW_AT_name        : (indirect line string, offset: 0x117b): src/rtlib/io_printvoid.c
    <cd5f2>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <cd5f6>   DW_AT_low_pc      : 0x4744d0
    <cd5fe>   DW_AT_high_pc     : 0xeb
    <cd606>   DW_AT_stmt_list   : 0x68ea0
 <1><cd60a>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd60b>   DW_AT_byte_size   : 1
    <cd60c>   DW_AT_encoding    : 8	(unsigned char)
    <cd60d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><cd611>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd612>   DW_AT_byte_size   : 2
    <cd613>   DW_AT_encoding    : 7	(unsigned)
    <cd614>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><cd618>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd619>   DW_AT_byte_size   : 4
    <cd61a>   DW_AT_encoding    : 7	(unsigned)
    <cd61b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><cd61f>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd620>   DW_AT_byte_size   : 8
    <cd621>   DW_AT_encoding    : 7	(unsigned)
    <cd622>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><cd626>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd627>   DW_AT_byte_size   : 1
    <cd628>   DW_AT_encoding    : 6	(signed char)
    <cd629>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><cd62d>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd62e>   DW_AT_byte_size   : 2
    <cd62f>   DW_AT_encoding    : 5	(signed)
    <cd630>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><cd634>: Abbrev Number: 27 (DW_TAG_base_type)
    <cd635>   DW_AT_byte_size   : 4
    <cd636>   DW_AT_encoding    : 5	(signed)
    <cd637>   DW_AT_name        : int
 <1><cd63b>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd63c>   DW_AT_byte_size   : 8
    <cd63d>   DW_AT_encoding    : 5	(signed)
    <cd63e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><cd642>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd643>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <cd647>   DW_AT_decl_file   : 2
    <cd648>   DW_AT_decl_line   : 153
    <cd649>   DW_AT_decl_column : 27
    <cd64a>   DW_AT_type        : <0xcd63b>
 <1><cd64e>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <cd64f>   DW_AT_byte_size   : 8
 <1><cd650>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd651>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <cd655>   DW_AT_decl_file   : 2
    <cd656>   DW_AT_decl_line   : 194
    <cd657>   DW_AT_decl_column : 27
    <cd658>   DW_AT_type        : <0xcd63b>
 <1><cd65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd65d>   DW_AT_byte_size   : 8
    <cd65d>   DW_AT_type        : <0xcd661>
 <1><cd661>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd662>   DW_AT_byte_size   : 1
    <cd663>   DW_AT_encoding    : 6	(signed char)
    <cd664>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><cd668>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd669>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <cd66d>   DW_AT_decl_file   : 3
    <cd66e>   DW_AT_decl_line   : 209
    <cd66f>   DW_AT_decl_column : 23
    <cd670>   DW_AT_type        : <0xcd61f>
 <1><cd674>: Abbrev Number: 16 (DW_TAG_typedef)
    <cd675>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <cd679>   DW_AT_decl_file   : 3
    <cd67a>   DW_AT_decl_line   : 321
    <cd67c>   DW_AT_decl_column : 24
    <cd67d>   DW_AT_type        : <0xcd634>
 <1><cd681>: Abbrev Number: 29 (DW_TAG_const_type)
    <cd682>   DW_AT_type        : <0xcd674>
 <1><cd686>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd687>   DW_AT_byte_size   : 8
    <cd688>   DW_AT_encoding    : 5	(signed)
    <cd689>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><cd68d>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd68e>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <cd692>   DW_AT_decl_file   : 4
    <cd693>   DW_AT_decl_line   : 87
    <cd694>   DW_AT_decl_column : 19
    <cd695>   DW_AT_type        : <0xcd642>
 <1><cd699>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd69a>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <cd69e>   DW_AT_decl_file   : 4
    <cd69f>   DW_AT_decl_line   : 108
    <cd6a0>   DW_AT_decl_column : 19
    <cd6a1>   DW_AT_type        : <0xcd650>
 <1><cd6a5>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd6a6>   DW_AT_byte_size   : 8
    <cd6a7>   DW_AT_encoding    : 7	(unsigned)
    <cd6a8>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><cd6ac>: Abbrev Number: 17 (DW_TAG_array_type)
    <cd6ad>   DW_AT_type        : <0xcd661>
    <cd6b1>   DW_AT_sibling     : <0xcd6bc>
 <2><cd6b5>: Abbrev Number: 30 (DW_TAG_subrange_type)
    <cd6b6>   DW_AT_type        : <0xcd61f>
    <cd6ba>   DW_AT_upper_bound : 3
 <2><cd6bb>: Abbrev Number: 0
 <1><cd6bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd6bd>   DW_AT_byte_size   : 8
    <cd6bd>   DW_AT_type        : <0xcd6c1>
 <1><cd6c1>: Abbrev Number: 31 (DW_TAG_const_type)
 <1><cd6c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd6c3>   DW_AT_byte_size   : 8
    <cd6c3>   DW_AT_type        : <0xcd65c>
 <1><cd6c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd6c8>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <cd6cc>   DW_AT_decl_file   : 5
    <cd6cd>   DW_AT_decl_line   : 22
    <cd6ce>   DW_AT_decl_column : 15
    <cd6cf>   DW_AT_type        : <0xcd68d>
 <1><cd6d3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd6d4>   DW_AT_byte_size   : 8
    <cd6d4>   DW_AT_type        : <0xcd6d8>
 <1><cd6d8>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <cd6d9>   DW_AT_prototyped  : 1
 <1><cd6d9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cd6da>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <cd6de>   DW_AT_byte_size   : 24
    <cd6df>   DW_AT_decl_file   : 6
    <cd6e0>   DW_AT_decl_line   : 82
    <cd6e1>   DW_AT_decl_column : 16
    <cd6e2>   DW_AT_sibling     : <0xcd70e>
 <2><cd6e6>: Abbrev Number: 2 (DW_TAG_member)
    <cd6e7>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <cd6eb>   DW_AT_decl_file   : 6
    <cd6ec>   DW_AT_decl_line   : 83
    <cd6ed>   DW_AT_decl_column : 21
    <cd6ee>   DW_AT_type        : <0xcd65c>
    <cd6f2>   DW_AT_data_member_location: 0
 <2><cd6f3>: Abbrev Number: 9 (DW_TAG_member)
    <cd6f4>   DW_AT_name        : len
    <cd6f8>   DW_AT_decl_file   : 6
    <cd6f9>   DW_AT_decl_line   : 84
    <cd6fa>   DW_AT_decl_column : 21
    <cd6fb>   DW_AT_type        : <0xcd699>
    <cd6ff>   DW_AT_data_member_location: 8
 <2><cd700>: Abbrev Number: 2 (DW_TAG_member)
    <cd701>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <cd705>   DW_AT_decl_file   : 6
    <cd706>   DW_AT_decl_line   : 85
    <cd707>   DW_AT_decl_column : 21
    <cd708>   DW_AT_type        : <0xcd699>
    <cd70c>   DW_AT_data_member_location: 16
 <2><cd70d>: Abbrev Number: 0
 <1><cd70e>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd70f>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <cd713>   DW_AT_decl_file   : 6
    <cd714>   DW_AT_decl_line   : 86
    <cd715>   DW_AT_decl_column : 3
    <cd716>   DW_AT_type        : <0xcd6d9>
 <1><cd71a>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd71b>   DW_AT_byte_size   : 8
    <cd71c>   DW_AT_encoding    : 4	(float)
    <cd71d>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><cd721>: Abbrev Number: 6 (DW_TAG_base_type)
    <cd722>   DW_AT_byte_size   : 4
    <cd723>   DW_AT_encoding    : 4	(float)
    <cd724>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><cd728>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd729>   DW_AT_byte_size   : 8
    <cd729>   DW_AT_type        : <0xcd674>
 <1><cd72d>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <cd72e>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <cd732>   DW_AT_encoding    : 7	(unsigned)
    <cd733>   DW_AT_byte_size   : 4
    <cd734>   DW_AT_type        : <0xcd618>
    <cd738>   DW_AT_decl_file   : 7
    <cd739>   DW_AT_decl_line   : 25
    <cd73a>   DW_AT_decl_column : 14
    <cd73b>   DW_AT_sibling     : <0xcd758>
 <2><cd73f>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cd740>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <cd744>   DW_AT_const_value : 0
 <2><cd745>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cd746>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <cd74a>   DW_AT_const_value : 1
 <2><cd74b>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cd74c>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <cd750>   DW_AT_const_value : 2
 <2><cd751>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cd752>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <cd756>   DW_AT_const_value : 3
 <2><cd757>: Abbrev Number: 0
 <1><cd758>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd759>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <cd75d>   DW_AT_decl_file   : 7
    <cd75e>   DW_AT_decl_line   : 30
    <cd75f>   DW_AT_decl_column : 3
    <cd760>   DW_AT_type        : <0xcd72d>
 <1><cd764>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd765>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <cd769>   DW_AT_decl_file   : 7
    <cd76a>   DW_AT_decl_line   : 54
    <cd76b>   DW_AT_decl_column : 15
    <cd76c>   DW_AT_type        : <0xcd770>
 <1><cd770>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd771>   DW_AT_byte_size   : 8
    <cd771>   DW_AT_type        : <0xcd775>
 <1><cd775>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd776>   DW_AT_prototyped  : 1
    <cd776>   DW_AT_type        : <0xcd634>
    <cd77a>   DW_AT_sibling     : <0xcd789>
 <2><cd77e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd77f>   DW_AT_type        : <0xcd789>
 <2><cd783>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd784>   DW_AT_type        : <0xcd634>
 <2><cd788>: Abbrev Number: 0
 <1><cd789>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd78a>   DW_AT_byte_size   : 8
    <cd78a>   DW_AT_type        : <0xcd78e>
 <1><cd78e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cd78f>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <cd793>   DW_AT_byte_size   : 80
    <cd794>   DW_AT_decl_file   : 7
    <cd795>   DW_AT_decl_line   : 97
    <cd796>   DW_AT_decl_column : 16
    <cd797>   DW_AT_sibling     : <0xcd852>
 <2><cd79b>: Abbrev Number: 2 (DW_TAG_member)
    <cd79c>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <cd7a0>   DW_AT_decl_file   : 7
    <cd7a1>   DW_AT_decl_line   : 98
    <cd7a2>   DW_AT_decl_column : 21
    <cd7a3>   DW_AT_type        : <0xcd634>
    <cd7a7>   DW_AT_data_member_location: 0
 <2><cd7a8>: Abbrev Number: 9 (DW_TAG_member)
    <cd7a9>   DW_AT_name        : len
    <cd7ad>   DW_AT_decl_file   : 7
    <cd7ae>   DW_AT_decl_line   : 99
    <cd7af>   DW_AT_decl_column : 21
    <cd7b0>   DW_AT_type        : <0xcd634>
    <cd7b4>   DW_AT_data_member_location: 4
 <2><cd7b5>: Abbrev Number: 2 (DW_TAG_member)
    <cd7b6>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <cd7ba>   DW_AT_decl_file   : 7
    <cd7bb>   DW_AT_decl_line   : 100
    <cd7bc>   DW_AT_decl_column : 21
    <cd7bd>   DW_AT_type        : <0xcd758>
    <cd7c1>   DW_AT_data_member_location: 8
 <2><cd7c2>: Abbrev Number: 2 (DW_TAG_member)
    <cd7c3>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <cd7c7>   DW_AT_decl_file   : 7
    <cd7c8>   DW_AT_decl_line   : 101
    <cd7c9>   DW_AT_decl_column : 21
    <cd7ca>   DW_AT_type        : <0xcd6c7>
    <cd7ce>   DW_AT_data_member_location: 16
 <2><cd7cf>: Abbrev Number: 2 (DW_TAG_member)
    <cd7d0>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <cd7d4>   DW_AT_decl_file   : 7
    <cd7d5>   DW_AT_decl_line   : 102
    <cd7d6>   DW_AT_decl_column : 21
    <cd7d7>   DW_AT_type        : <0xcd634>
    <cd7db>   DW_AT_data_member_location: 24
 <2><cd7dc>: Abbrev Number: 2 (DW_TAG_member)
    <cd7dd>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <cd7e1>   DW_AT_decl_file   : 7
    <cd7e2>   DW_AT_decl_line   : 103
    <cd7e3>   DW_AT_decl_column : 21
    <cd7e4>   DW_AT_type        : <0xcd634>
    <cd7e8>   DW_AT_data_member_location: 28
 <2><cd7e9>: Abbrev Number: 2 (DW_TAG_member)
    <cd7ea>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <cd7ee>   DW_AT_decl_file   : 7
    <cd7ef>   DW_AT_decl_line   : 104
    <cd7f0>   DW_AT_decl_column : 21
    <cd7f1>   DW_AT_type        : <0xcd634>
    <cd7f5>   DW_AT_data_member_location: 32
 <2><cd7f6>: Abbrev Number: 2 (DW_TAG_member)
    <cd7f7>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <cd7fb>   DW_AT_decl_file   : 7
    <cd7fc>   DW_AT_decl_line   : 105
    <cd7fd>   DW_AT_decl_column : 21
    <cd7fe>   DW_AT_type        : <0xcd618>
    <cd802>   DW_AT_data_member_location: 36
 <2><cd803>: Abbrev Number: 2 (DW_TAG_member)
    <cd804>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <cd808>   DW_AT_decl_file   : 7
    <cd809>   DW_AT_decl_line   : 106
    <cd80a>   DW_AT_decl_column : 21
    <cd80b>   DW_AT_type        : <0xcd618>
    <cd80f>   DW_AT_data_member_location: 40
 <2><cd810>: Abbrev Number: 2 (DW_TAG_member)
    <cd811>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <cd815>   DW_AT_decl_file   : 7
    <cd816>   DW_AT_decl_line   : 109
    <cd817>   DW_AT_decl_column : 21
    <cd818>   DW_AT_type        : <0xcd6ac>
    <cd81c>   DW_AT_data_member_location: 44
 <2><cd81d>: Abbrev Number: 2 (DW_TAG_member)
    <cd81e>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <cd822>   DW_AT_decl_file   : 7
    <cd823>   DW_AT_decl_line   : 110
    <cd824>   DW_AT_decl_column : 21
    <cd825>   DW_AT_type        : <0xcd668>
    <cd829>   DW_AT_data_member_location: 48
 <2><cd82a>: Abbrev Number: 2 (DW_TAG_member)
    <cd82b>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <cd82f>   DW_AT_decl_file   : 7
    <cd830>   DW_AT_decl_line   : 112
    <cd831>   DW_AT_decl_column : 22
    <cd832>   DW_AT_type        : <0xcdaea>
    <cd836>   DW_AT_data_member_location: 56
 <2><cd837>: Abbrev Number: 2 (DW_TAG_member)
    <cd838>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <cd83c>   DW_AT_decl_file   : 7
    <cd83d>   DW_AT_decl_line   : 114
    <cd83e>   DW_AT_decl_column : 14
    <cd83f>   DW_AT_type        : <0xcd64e>
    <cd843>   DW_AT_data_member_location: 64
 <2><cd844>: Abbrev Number: 2 (DW_TAG_member)
    <cd845>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <cd849>   DW_AT_decl_file   : 7
    <cd84a>   DW_AT_decl_line   : 116
    <cd84b>   DW_AT_decl_column : 22
    <cd84c>   DW_AT_type        : <0xcd789>
    <cd850>   DW_AT_data_member_location: 72
 <2><cd851>: Abbrev Number: 0
 <1><cd852>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd853>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <cd857>   DW_AT_decl_file   : 7
    <cd858>   DW_AT_decl_line   : 59
    <cd859>   DW_AT_decl_column : 15
    <cd85a>   DW_AT_type        : <0xcd85e>
 <1><cd85e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd85f>   DW_AT_byte_size   : 8
    <cd85f>   DW_AT_type        : <0xcd863>
 <1><cd863>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd864>   DW_AT_prototyped  : 1
    <cd864>   DW_AT_type        : <0xcd634>
    <cd868>   DW_AT_sibling     : <0xcd872>
 <2><cd86c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd86d>   DW_AT_type        : <0xcd789>
 <2><cd871>: Abbrev Number: 0
 <1><cd872>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd873>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <cd877>   DW_AT_decl_file   : 7
    <cd878>   DW_AT_decl_line   : 60
    <cd879>   DW_AT_decl_column : 15
    <cd87a>   DW_AT_type        : <0xcd85e>
 <1><cd87e>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd87f>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <cd883>   DW_AT_decl_file   : 7
    <cd884>   DW_AT_decl_line   : 61
    <cd885>   DW_AT_decl_column : 15
    <cd886>   DW_AT_type        : <0xcd88a>
 <1><cd88a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd88b>   DW_AT_byte_size   : 8
    <cd88b>   DW_AT_type        : <0xcd88f>
 <1><cd88f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd890>   DW_AT_prototyped  : 1
    <cd890>   DW_AT_type        : <0xcd634>
    <cd894>   DW_AT_sibling     : <0xcd8a8>
 <2><cd898>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd899>   DW_AT_type        : <0xcd789>
 <2><cd89d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd89e>   DW_AT_type        : <0xcd6c7>
 <2><cd8a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8a3>   DW_AT_type        : <0xcd634>
 <2><cd8a7>: Abbrev Number: 0
 <1><cd8a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd8a9>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <cd8ad>   DW_AT_decl_file   : 7
    <cd8ae>   DW_AT_decl_line   : 62
    <cd8af>   DW_AT_decl_column : 15
    <cd8b0>   DW_AT_type        : <0xcd8b4>
 <1><cd8b4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd8b5>   DW_AT_byte_size   : 8
    <cd8b5>   DW_AT_type        : <0xcd8b9>
 <1><cd8b9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd8ba>   DW_AT_prototyped  : 1
    <cd8ba>   DW_AT_type        : <0xcd634>
    <cd8be>   DW_AT_sibling     : <0xcd8cd>
 <2><cd8c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8c3>   DW_AT_type        : <0xcd789>
 <2><cd8c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8c8>   DW_AT_type        : <0xcd8cd>
 <2><cd8cc>: Abbrev Number: 0
 <1><cd8cd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd8ce>   DW_AT_byte_size   : 8
    <cd8ce>   DW_AT_type        : <0xcd6c7>
 <1><cd8d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd8d3>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <cd8d7>   DW_AT_decl_file   : 7
    <cd8d8>   DW_AT_decl_line   : 63
    <cd8d9>   DW_AT_decl_column : 15
    <cd8da>   DW_AT_type        : <0xcd8de>
 <1><cd8de>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd8df>   DW_AT_byte_size   : 8
    <cd8df>   DW_AT_type        : <0xcd8e3>
 <1><cd8e3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd8e4>   DW_AT_prototyped  : 1
    <cd8e4>   DW_AT_type        : <0xcd634>
    <cd8e8>   DW_AT_sibling     : <0xcd8fc>
 <2><cd8ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8ed>   DW_AT_type        : <0xcd789>
 <2><cd8f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8f2>   DW_AT_type        : <0xcd64e>
 <2><cd8f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd8f7>   DW_AT_type        : <0xcd8fc>
 <2><cd8fb>: Abbrev Number: 0
 <1><cd8fc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd8fd>   DW_AT_byte_size   : 8
    <cd8fd>   DW_AT_type        : <0xcd668>
 <1><cd901>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd902>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <cd906>   DW_AT_decl_file   : 7
    <cd907>   DW_AT_decl_line   : 65
    <cd908>   DW_AT_decl_column : 15
    <cd909>   DW_AT_type        : <0xcd90d>
 <1><cd90d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd90e>   DW_AT_byte_size   : 8
    <cd90e>   DW_AT_type        : <0xcd912>
 <1><cd912>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd913>   DW_AT_prototyped  : 1
    <cd913>   DW_AT_type        : <0xcd634>
    <cd917>   DW_AT_sibling     : <0xcd92b>
 <2><cd91b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd91c>   DW_AT_type        : <0xcd789>
 <2><cd920>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd921>   DW_AT_type        : <0xcd728>
 <2><cd925>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd926>   DW_AT_type        : <0xcd8fc>
 <2><cd92a>: Abbrev Number: 0
 <1><cd92b>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd92c>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <cd930>   DW_AT_decl_file   : 7
    <cd931>   DW_AT_decl_line   : 67
    <cd932>   DW_AT_decl_column : 15
    <cd933>   DW_AT_type        : <0xcd937>
 <1><cd937>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd938>   DW_AT_byte_size   : 8
    <cd938>   DW_AT_type        : <0xcd93c>
 <1><cd93c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd93d>   DW_AT_prototyped  : 1
    <cd93d>   DW_AT_type        : <0xcd634>
    <cd941>   DW_AT_sibling     : <0xcd955>
 <2><cd945>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd946>   DW_AT_type        : <0xcd789>
 <2><cd94a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd94b>   DW_AT_type        : <0xcd6bc>
 <2><cd94f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd950>   DW_AT_type        : <0xcd668>
 <2><cd954>: Abbrev Number: 0
 <1><cd955>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd956>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <cd95a>   DW_AT_decl_file   : 7
    <cd95b>   DW_AT_decl_line   : 69
    <cd95c>   DW_AT_decl_column : 15
    <cd95d>   DW_AT_type        : <0xcd961>
 <1><cd961>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd962>   DW_AT_byte_size   : 8
    <cd962>   DW_AT_type        : <0xcd966>
 <1><cd966>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd967>   DW_AT_prototyped  : 1
    <cd967>   DW_AT_type        : <0xcd634>
    <cd96b>   DW_AT_sibling     : <0xcd97f>
 <2><cd96f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd970>   DW_AT_type        : <0xcd789>
 <2><cd974>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd975>   DW_AT_type        : <0xcd97f>
 <2><cd979>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd97a>   DW_AT_type        : <0xcd668>
 <2><cd97e>: Abbrev Number: 0
 <1><cd97f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd980>   DW_AT_byte_size   : 8
    <cd980>   DW_AT_type        : <0xcd681>
 <1><cd984>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd985>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <cd989>   DW_AT_decl_file   : 7
    <cd98a>   DW_AT_decl_line   : 71
    <cd98b>   DW_AT_decl_column : 15
    <cd98c>   DW_AT_type        : <0xcd990>
 <1><cd990>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd991>   DW_AT_byte_size   : 8
    <cd991>   DW_AT_type        : <0xcd995>
 <1><cd995>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd996>   DW_AT_prototyped  : 1
    <cd996>   DW_AT_type        : <0xcd634>
    <cd99a>   DW_AT_sibling     : <0xcd9ae>
 <2><cd99e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd99f>   DW_AT_type        : <0xcd789>
 <2><cd9a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd9a4>   DW_AT_type        : <0xcd6c7>
 <2><cd9a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd9a9>   DW_AT_type        : <0xcd6c7>
 <2><cd9ad>: Abbrev Number: 0
 <1><cd9ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd9af>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <cd9b3>   DW_AT_decl_file   : 7
    <cd9b4>   DW_AT_decl_line   : 73
    <cd9b5>   DW_AT_decl_column : 15
    <cd9b6>   DW_AT_type        : <0xcd990>
 <1><cd9ba>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd9bb>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <cd9bf>   DW_AT_decl_file   : 7
    <cd9c0>   DW_AT_decl_line   : 75
    <cd9c1>   DW_AT_decl_column : 15
    <cd9c2>   DW_AT_type        : <0xcd9c6>
 <1><cd9c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd9c7>   DW_AT_byte_size   : 8
    <cd9c7>   DW_AT_type        : <0xcd9cb>
 <1><cd9cb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd9cc>   DW_AT_prototyped  : 1
    <cd9cc>   DW_AT_type        : <0xcd634>
    <cd9d0>   DW_AT_sibling     : <0xcd9df>
 <2><cd9d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd9d5>   DW_AT_type        : <0xcd789>
 <2><cd9d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd9da>   DW_AT_type        : <0xcd9df>
 <2><cd9de>: Abbrev Number: 0
 <1><cd9df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd9e0>   DW_AT_byte_size   : 8
    <cd9e0>   DW_AT_type        : <0xcd70e>
 <1><cd9e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd9e5>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <cd9e9>   DW_AT_decl_file   : 7
    <cd9ea>   DW_AT_decl_line   : 76
    <cd9eb>   DW_AT_decl_column : 15
    <cd9ec>   DW_AT_type        : <0xcd9f0>
 <1><cd9f0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cd9f1>   DW_AT_byte_size   : 8
    <cd9f1>   DW_AT_type        : <0xcd9f5>
 <1><cd9f5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cd9f6>   DW_AT_prototyped  : 1
    <cd9f6>   DW_AT_type        : <0xcd634>
    <cd9fa>   DW_AT_sibling     : <0xcda0e>
 <2><cd9fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cd9ff>   DW_AT_type        : <0xcd789>
 <2><cda03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cda04>   DW_AT_type        : <0xcd728>
 <2><cda08>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cda09>   DW_AT_type        : <0xcd699>
 <2><cda0d>: Abbrev Number: 0
 <1><cda0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <cda0f>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <cda13>   DW_AT_decl_file   : 7
    <cda14>   DW_AT_decl_line   : 77
    <cda15>   DW_AT_decl_column : 15
    <cda16>   DW_AT_type        : <0xcd85e>
 <1><cda1a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cda1b>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <cda1f>   DW_AT_byte_size   : 112
    <cda20>   DW_AT_decl_file   : 7
    <cda21>   DW_AT_decl_line   : 80
    <cda22>   DW_AT_decl_column : 16
    <cda23>   DW_AT_sibling     : <0xcdade>
 <2><cda27>: Abbrev Number: 2 (DW_TAG_member)
    <cda28>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <cda2c>   DW_AT_decl_file   : 7
    <cda2d>   DW_AT_decl_line   : 81
    <cda2e>   DW_AT_decl_column : 25
    <cda2f>   DW_AT_type        : <0xcd852>
    <cda33>   DW_AT_data_member_location: 0
 <2><cda34>: Abbrev Number: 2 (DW_TAG_member)
    <cda35>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <cda39>   DW_AT_decl_file   : 7
    <cda3a>   DW_AT_decl_line   : 82
    <cda3b>   DW_AT_decl_column : 25
    <cda3c>   DW_AT_type        : <0xcd872>
    <cda40>   DW_AT_data_member_location: 8
 <2><cda41>: Abbrev Number: 2 (DW_TAG_member)
    <cda42>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <cda46>   DW_AT_decl_file   : 7
    <cda47>   DW_AT_decl_line   : 83
    <cda48>   DW_AT_decl_column : 25
    <cda49>   DW_AT_type        : <0xcd87e>
    <cda4d>   DW_AT_data_member_location: 16
 <2><cda4e>: Abbrev Number: 2 (DW_TAG_member)
    <cda4f>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <cda53>   DW_AT_decl_file   : 7
    <cda54>   DW_AT_decl_line   : 84
    <cda55>   DW_AT_decl_column : 25
    <cda56>   DW_AT_type        : <0xcd8a8>
    <cda5a>   DW_AT_data_member_location: 24
 <2><cda5b>: Abbrev Number: 2 (DW_TAG_member)
    <cda5c>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <cda60>   DW_AT_decl_file   : 7
    <cda61>   DW_AT_decl_line   : 85
    <cda62>   DW_AT_decl_column : 25
    <cda63>   DW_AT_type        : <0xcd8d2>
    <cda67>   DW_AT_data_member_location: 32
 <2><cda68>: Abbrev Number: 2 (DW_TAG_member)
    <cda69>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <cda6d>   DW_AT_decl_file   : 7
    <cda6e>   DW_AT_decl_line   : 86
    <cda6f>   DW_AT_decl_column : 25
    <cda70>   DW_AT_type        : <0xcd901>
    <cda74>   DW_AT_data_member_location: 40
 <2><cda75>: Abbrev Number: 2 (DW_TAG_member)
    <cda76>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <cda7a>   DW_AT_decl_file   : 7
    <cda7b>   DW_AT_decl_line   : 87
    <cda7c>   DW_AT_decl_column : 25
    <cda7d>   DW_AT_type        : <0xcd92b>
    <cda81>   DW_AT_data_member_location: 48
 <2><cda82>: Abbrev Number: 2 (DW_TAG_member)
    <cda83>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <cda87>   DW_AT_decl_file   : 7
    <cda88>   DW_AT_decl_line   : 88
    <cda89>   DW_AT_decl_column : 25
    <cda8a>   DW_AT_type        : <0xcd955>
    <cda8e>   DW_AT_data_member_location: 56
 <2><cda8f>: Abbrev Number: 2 (DW_TAG_member)
    <cda90>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <cda94>   DW_AT_decl_file   : 7
    <cda95>   DW_AT_decl_line   : 89
    <cda96>   DW_AT_decl_column : 25
    <cda97>   DW_AT_type        : <0xcd984>
    <cda9b>   DW_AT_data_member_location: 64
 <2><cda9c>: Abbrev Number: 2 (DW_TAG_member)
    <cda9d>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <cdaa1>   DW_AT_decl_file   : 7
    <cdaa2>   DW_AT_decl_line   : 90
    <cdaa3>   DW_AT_decl_column : 25
    <cdaa4>   DW_AT_type        : <0xcd9ae>
    <cdaa8>   DW_AT_data_member_location: 72
 <2><cdaa9>: Abbrev Number: 2 (DW_TAG_member)
    <cdaaa>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <cdaae>   DW_AT_decl_file   : 7
    <cdaaf>   DW_AT_decl_line   : 91
    <cdab0>   DW_AT_decl_column : 25
    <cdab1>   DW_AT_type        : <0xcd9ba>
    <cdab5>   DW_AT_data_member_location: 80
 <2><cdab6>: Abbrev Number: 2 (DW_TAG_member)
    <cdab7>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <cdabb>   DW_AT_decl_file   : 7
    <cdabc>   DW_AT_decl_line   : 92
    <cdabd>   DW_AT_decl_column : 25
    <cdabe>   DW_AT_type        : <0xcd9e4>
    <cdac2>   DW_AT_data_member_location: 88
 <2><cdac3>: Abbrev Number: 2 (DW_TAG_member)
    <cdac4>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <cdac8>   DW_AT_decl_file   : 7
    <cdac9>   DW_AT_decl_line   : 93
    <cdaca>   DW_AT_decl_column : 25
    <cdacb>   DW_AT_type        : <0xcd764>
    <cdacf>   DW_AT_data_member_location: 96
 <2><cdad0>: Abbrev Number: 2 (DW_TAG_member)
    <cdad1>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <cdad5>   DW_AT_decl_file   : 7
    <cdad6>   DW_AT_decl_line   : 94
    <cdad7>   DW_AT_decl_column : 25
    <cdad8>   DW_AT_type        : <0xcda0e>
    <cdadc>   DW_AT_data_member_location: 104
 <2><cdadd>: Abbrev Number: 0
 <1><cdade>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdadf>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <cdae3>   DW_AT_decl_file   : 7
    <cdae4>   DW_AT_decl_line   : 95
    <cdae5>   DW_AT_decl_column : 3
    <cdae6>   DW_AT_type        : <0xcda1a>
 <1><cdaea>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdaeb>   DW_AT_byte_size   : 8
    <cdaeb>   DW_AT_type        : <0xcdade>
 <1><cdaef>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdaf0>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <cdaf4>   DW_AT_decl_file   : 7
    <cdaf5>   DW_AT_decl_line   : 117
    <cdaf6>   DW_AT_decl_column : 3
    <cdaf7>   DW_AT_type        : <0xcd78e>
 <1><cdafb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdafc>   DW_AT_byte_size   : 8
    <cdafc>   DW_AT_type        : <0xcdaef>
 <1><cdb00>: Abbrev Number: 18 (DW_TAG_structure_type)
    <cdb01>   DW_AT_byte_size   : 8
    <cdb02>   DW_AT_decl_file   : 8
    <cdb02>   DW_AT_decl_line   : 4
    <cdb03>   DW_AT_decl_column : 3
    <cdb03>   DW_AT_sibling     : <0xcdb22>
 <2><cdb07>: Abbrev Number: 2 (DW_TAG_member)
    <cdb08>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <cdb0c>   DW_AT_decl_file   : 8
    <cdb0d>   DW_AT_decl_line   : 5
    <cdb0e>   DW_AT_decl_column : 8
    <cdb0f>   DW_AT_type        : <0xcd634>
    <cdb13>   DW_AT_data_member_location: 0
 <2><cdb14>: Abbrev Number: 2 (DW_TAG_member)
    <cdb15>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <cdb19>   DW_AT_decl_file   : 8
    <cdb1a>   DW_AT_decl_line   : 6
    <cdb1b>   DW_AT_decl_column : 8
    <cdb1c>   DW_AT_type        : <0xcd634>
    <cdb20>   DW_AT_data_member_location: 4
 <2><cdb21>: Abbrev Number: 0
 <1><cdb22>: Abbrev Number: 18 (DW_TAG_structure_type)
    <cdb23>   DW_AT_byte_size   : 16
    <cdb24>   DW_AT_decl_file   : 8
    <cdb24>   DW_AT_decl_line   : 8
    <cdb25>   DW_AT_decl_column : 3
    <cdb25>   DW_AT_sibling     : <0xcdb58>
 <2><cdb29>: Abbrev Number: 9 (DW_TAG_member)
    <cdb2a>   DW_AT_name        : x
    <cdb2c>   DW_AT_decl_file   : 8
    <cdb2d>   DW_AT_decl_line   : 9
    <cdb2e>   DW_AT_decl_column : 8
    <cdb2f>   DW_AT_type        : <0xcd634>
    <cdb33>   DW_AT_data_member_location: 0
 <2><cdb34>: Abbrev Number: 9 (DW_TAG_member)
    <cdb35>   DW_AT_name        : y
    <cdb37>   DW_AT_decl_file   : 8
    <cdb38>   DW_AT_decl_line   : 9
    <cdb39>   DW_AT_decl_column : 11
    <cdb3a>   DW_AT_type        : <0xcd634>
    <cdb3e>   DW_AT_data_member_location: 4
 <2><cdb3f>: Abbrev Number: 9 (DW_TAG_member)
    <cdb40>   DW_AT_name        : dx
    <cdb43>   DW_AT_decl_file   : 8
    <cdb44>   DW_AT_decl_line   : 10
    <cdb45>   DW_AT_decl_column : 8
    <cdb46>   DW_AT_type        : <0xcd634>
    <cdb4a>   DW_AT_data_member_location: 8
 <2><cdb4b>: Abbrev Number: 9 (DW_TAG_member)
    <cdb4c>   DW_AT_name        : dy
    <cdb4f>   DW_AT_decl_file   : 8
    <cdb50>   DW_AT_decl_line   : 10
    <cdb51>   DW_AT_decl_column : 12
    <cdb52>   DW_AT_type        : <0xcd634>
    <cdb56>   DW_AT_data_member_location: 12
 <2><cdb57>: Abbrev Number: 0
 <1><cdb58>: Abbrev Number: 34 (DW_TAG_union_type)
    <cdb59>   DW_AT_byte_size   : 16
    <cdb5a>   DW_AT_decl_file   : 8
    <cdb5b>   DW_AT_decl_line   : 3
    <cdb5c>   DW_AT_decl_column : 2
    <cdb5d>   DW_AT_sibling     : <0xcdb88>
 <2><cdb61>: Abbrev Number: 19 (DW_TAG_member)
    <cdb62>   DW_AT_type        : <0xcdb00>
 <2><cdb66>: Abbrev Number: 19 (DW_TAG_member)
    <cdb67>   DW_AT_type        : <0xcdb22>
 <2><cdb6b>: Abbrev Number: 35 (DW_TAG_member)
    <cdb6c>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <cdb70>   DW_AT_decl_file   : 8
    <cdb71>   DW_AT_decl_line   : 12
    <cdb72>   DW_AT_decl_column : 7
    <cdb73>   DW_AT_type        : <0xcd634>
 <2><cdb77>: Abbrev Number: 20 (DW_TAG_member)
    <cdb78>   DW_AT_name        : z
    <cdb7a>   DW_AT_decl_file   : 8
    <cdb7a>   DW_AT_decl_line   : 13
    <cdb7b>   DW_AT_decl_column : 7
    <cdb7b>   DW_AT_type        : <0xcd634>
 <2><cdb7f>: Abbrev Number: 20 (DW_TAG_member)
    <cdb80>   DW_AT_name        : w
    <cdb82>   DW_AT_decl_file   : 8
    <cdb82>   DW_AT_decl_line   : 14
    <cdb83>   DW_AT_decl_column : 7
    <cdb83>   DW_AT_type        : <0xcd634>
 <2><cdb87>: Abbrev Number: 0
 <1><cdb88>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cdb89>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <cdb8d>   DW_AT_byte_size   : 20
    <cdb8e>   DW_AT_decl_file   : 8
    <cdb8f>   DW_AT_decl_line   : 1
    <cdb90>   DW_AT_decl_column : 8
    <cdb91>   DW_AT_sibling     : <0xcdba9>
 <2><cdb95>: Abbrev Number: 2 (DW_TAG_member)
    <cdb96>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <cdb9a>   DW_AT_decl_file   : 8
    <cdb9b>   DW_AT_decl_line   : 2
    <cdb9c>   DW_AT_decl_column : 6
    <cdb9d>   DW_AT_type        : <0xcd634>
    <cdba1>   DW_AT_data_member_location: 0
 <2><cdba2>: Abbrev Number: 36 (DW_TAG_member)
    <cdba3>   DW_AT_type        : <0xcdb58>
    <cdba7>   DW_AT_data_member_location: 4
 <2><cdba8>: Abbrev Number: 0
 <1><cdba9>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdbaa>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <cdbae>   DW_AT_decl_file   : 8
    <cdbaf>   DW_AT_decl_line   : 18
    <cdbb0>   DW_AT_decl_column : 23
    <cdbb1>   DW_AT_type        : <0xcdb88>
 <1><cdbb5>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdbb6>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <cdbba>   DW_AT_decl_file   : 9
    <cdbbb>   DW_AT_decl_line   : 1
    <cdbbc>   DW_AT_decl_column : 23
    <cdbbd>   DW_AT_type        : <0xcdbc1>
 <1><cdbc1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdbc2>   DW_AT_byte_size   : 8
    <cdbc2>   DW_AT_type        : <0xcdbc6>
 <1><cdbc6>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <cdbc7>   DW_AT_prototyped  : 1
    <cdbc7>   DW_AT_type        : <0xcd9df>
 <1><cdbcb>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdbcc>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <cdbd0>   DW_AT_decl_file   : 9
    <cdbd1>   DW_AT_decl_line   : 2
    <cdbd2>   DW_AT_decl_column : 23
    <cdbd3>   DW_AT_type        : <0xcdbd7>
 <1><cdbd7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdbd8>   DW_AT_byte_size   : 8
    <cdbd8>   DW_AT_type        : <0xcdbdc>
 <1><cdbdc>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <cdbdd>   DW_AT_prototyped  : 1
    <cdbdd>   DW_AT_type        : <0xcd634>
 <1><cdbe1>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdbe2>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <cdbe6>   DW_AT_decl_file   : 9
    <cdbe7>   DW_AT_decl_line   : 3
    <cdbe8>   DW_AT_decl_column : 23
    <cdbe9>   DW_AT_type        : <0xcdbd7>
 <1><cdbed>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdbee>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <cdbf2>   DW_AT_decl_file   : 9
    <cdbf3>   DW_AT_decl_line   : 10
    <cdbf4>   DW_AT_decl_column : 23
    <cdbf5>   DW_AT_type        : <0xcdbf9>
 <1><cdbf9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdbfa>   DW_AT_byte_size   : 8
    <cdbfa>   DW_AT_type        : <0xcdbfe>
 <1><cdbfe>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdbff>   DW_AT_prototyped  : 1
    <cdbff>   DW_AT_sibling     : <0xcdc09>
 <2><cdc03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc04>   DW_AT_type        : <0xcd634>
 <2><cdc08>: Abbrev Number: 0
 <1><cdc09>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc0a>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <cdc0e>   DW_AT_decl_file   : 9
    <cdc0f>   DW_AT_decl_line   : 14
    <cdc10>   DW_AT_decl_column : 23
    <cdc11>   DW_AT_type        : <0xcdc15>
 <1><cdc15>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdc16>   DW_AT_byte_size   : 8
    <cdc16>   DW_AT_type        : <0xcdc1a>
 <1><cdc1a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdc1b>   DW_AT_prototyped  : 1
    <cdc1b>   DW_AT_type        : <0xcd634>
    <cdc1f>   DW_AT_sibling     : <0xcdc33>
 <2><cdc23>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc24>   DW_AT_type        : <0xcd634>
 <2><cdc28>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc29>   DW_AT_type        : <0xcd634>
 <2><cdc2d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc2e>   DW_AT_type        : <0xcd634>
 <2><cdc32>: Abbrev Number: 0
 <1><cdc33>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc34>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <cdc38>   DW_AT_decl_file   : 9
    <cdc39>   DW_AT_decl_line   : 18
    <cdc3a>   DW_AT_decl_column : 23
    <cdc3b>   DW_AT_type        : <0xcdc15>
 <1><cdc3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc40>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <cdc44>   DW_AT_decl_file   : 9
    <cdc45>   DW_AT_decl_line   : 24
    <cdc46>   DW_AT_decl_column : 23
    <cdc47>   DW_AT_type        : <0xcd6d3>
 <1><cdc4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc4c>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <cdc50>   DW_AT_decl_file   : 9
    <cdc51>   DW_AT_decl_line   : 28
    <cdc52>   DW_AT_decl_column : 23
    <cdc53>   DW_AT_type        : <0xcdc57>
 <1><cdc57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdc58>   DW_AT_byte_size   : 8
    <cdc58>   DW_AT_type        : <0xcdc5c>
 <1><cdc5c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdc5d>   DW_AT_prototyped  : 1
    <cdc5d>   DW_AT_type        : <0xcd634>
    <cdc61>   DW_AT_sibling     : <0xcdc70>
 <2><cdc65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc66>   DW_AT_type        : <0xcd634>
 <2><cdc6a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc6b>   DW_AT_type        : <0xcd634>
 <2><cdc6f>: Abbrev Number: 0
 <1><cdc70>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc71>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <cdc75>   DW_AT_decl_file   : 9
    <cdc76>   DW_AT_decl_line   : 34
    <cdc77>   DW_AT_decl_column : 23
    <cdc78>   DW_AT_type        : <0xcdbd7>
 <1><cdc7c>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc7d>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <cdc81>   DW_AT_decl_file   : 9
    <cdc82>   DW_AT_decl_line   : 35
    <cdc83>   DW_AT_decl_column : 23
    <cdc84>   DW_AT_type        : <0xcdbd7>
 <1><cdc88>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdc89>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <cdc8d>   DW_AT_decl_file   : 9
    <cdc8e>   DW_AT_decl_line   : 36
    <cdc8f>   DW_AT_decl_column : 23
    <cdc90>   DW_AT_type        : <0xcdc94>
 <1><cdc94>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdc95>   DW_AT_byte_size   : 8
    <cdc95>   DW_AT_type        : <0xcdc99>
 <1><cdc99>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdc9a>   DW_AT_prototyped  : 1
    <cdc9a>   DW_AT_sibling     : <0xcdca9>
 <2><cdc9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdc9f>   DW_AT_type        : <0xcdca9>
 <2><cdca3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdca4>   DW_AT_type        : <0xcdca9>
 <2><cdca8>: Abbrev Number: 0
 <1><cdca9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdcaa>   DW_AT_byte_size   : 8
    <cdcaa>   DW_AT_type        : <0xcd634>
 <1><cdcae>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdcaf>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <cdcb3>   DW_AT_decl_file   : 9
    <cdcb4>   DW_AT_decl_line   : 37
    <cdcb5>   DW_AT_decl_column : 23
    <cdcb6>   DW_AT_type        : <0xcdc94>
 <1><cdcba>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdcbb>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <cdcbf>   DW_AT_decl_file   : 9
    <cdcc0>   DW_AT_decl_line   : 45
    <cdcc1>   DW_AT_decl_column : 24
    <cdcc2>   DW_AT_type        : <0xcdcc6>
 <1><cdcc6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdcc7>   DW_AT_byte_size   : 8
    <cdcc7>   DW_AT_type        : <0xcdccb>
 <1><cdccb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdccc>   DW_AT_prototyped  : 1
    <cdccc>   DW_AT_type        : <0xcd618>
    <cdcd0>   DW_AT_sibling     : <0xcdce4>
 <2><cdcd4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdcd5>   DW_AT_type        : <0xcd634>
 <2><cdcd9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdcda>   DW_AT_type        : <0xcd634>
 <2><cdcde>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdcdf>   DW_AT_type        : <0xcd634>
 <2><cdce3>: Abbrev Number: 0
 <1><cdce4>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdce5>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <cdce9>   DW_AT_decl_file   : 9
    <cdcea>   DW_AT_decl_line   : 48
    <cdceb>   DW_AT_decl_column : 23
    <cdcec>   DW_AT_type        : <0xcdcf0>
 <1><cdcf0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdcf1>   DW_AT_byte_size   : 8
    <cdcf1>   DW_AT_type        : <0xcdcf5>
 <1><cdcf5>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdcf6>   DW_AT_prototyped  : 1
    <cdcf6>   DW_AT_sibling     : <0xcdd0a>
 <2><cdcfa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdcfb>   DW_AT_type        : <0xcd6bc>
 <2><cdcff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd00>   DW_AT_type        : <0xcd668>
 <2><cdd04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd05>   DW_AT_type        : <0xcd634>
 <2><cdd09>: Abbrev Number: 0
 <1><cdd0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdd0b>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <cdd0f>   DW_AT_decl_file   : 9
    <cdd10>   DW_AT_decl_line   : 49
    <cdd11>   DW_AT_decl_column : 23
    <cdd12>   DW_AT_type        : <0xcdd16>
 <1><cdd16>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdd17>   DW_AT_byte_size   : 8
    <cdd17>   DW_AT_type        : <0xcdd1b>
 <1><cdd1b>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdd1c>   DW_AT_prototyped  : 1
    <cdd1c>   DW_AT_sibling     : <0xcdd30>
 <2><cdd20>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd21>   DW_AT_type        : <0xcd97f>
 <2><cdd25>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd26>   DW_AT_type        : <0xcd668>
 <2><cdd2a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd2b>   DW_AT_type        : <0xcd634>
 <2><cdd2f>: Abbrev Number: 0
 <1><cdd30>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdd31>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <cdd35>   DW_AT_decl_file   : 9
    <cdd36>   DW_AT_decl_line   : 51
    <cdd37>   DW_AT_decl_column : 24
    <cdd38>   DW_AT_type        : <0xcdd3c>
 <1><cdd3c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdd3d>   DW_AT_byte_size   : 8
    <cdd3d>   DW_AT_type        : <0xcdd41>
 <1><cdd41>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdd42>   DW_AT_prototyped  : 1
    <cdd42>   DW_AT_type        : <0xcd65c>
    <cdd46>   DW_AT_sibling     : <0xcdd55>
 <2><cdd4a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd4b>   DW_AT_type        : <0xcd65c>
 <2><cdd4f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd50>   DW_AT_type        : <0xcd699>
 <2><cdd54>: Abbrev Number: 0
 <1><cdd55>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdd56>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <cdd5a>   DW_AT_decl_file   : 9
    <cdd5b>   DW_AT_decl_line   : 54
    <cdd5c>   DW_AT_decl_column : 23
    <cdd5d>   DW_AT_type        : <0xcdd61>
 <1><cdd61>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdd62>   DW_AT_byte_size   : 8
    <cdd62>   DW_AT_type        : <0xcdd66>
 <1><cdd66>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdd67>   DW_AT_prototyped  : 1
    <cdd67>   DW_AT_type        : <0xcd634>
    <cdd6b>   DW_AT_sibling     : <0xcdd8e>
 <2><cdd6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd70>   DW_AT_type        : <0xcd9df>
 <2><cdd74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd75>   DW_AT_type        : <0xcd64e>
 <2><cdd79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd7a>   DW_AT_type        : <0xcd699>
 <2><cdd7e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd7f>   DW_AT_type        : <0xcd634>
 <2><cdd83>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd84>   DW_AT_type        : <0xcd634>
 <2><cdd88>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdd89>   DW_AT_type        : <0xcd634>
 <2><cdd8d>: Abbrev Number: 0
 <1><cdd8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdd8f>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <cdd93>   DW_AT_decl_file   : 9
    <cdd94>   DW_AT_decl_line   : 56
    <cdd95>   DW_AT_decl_column : 23
    <cdd96>   DW_AT_type        : <0xcdd9a>
 <1><cdd9a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdd9b>   DW_AT_byte_size   : 8
    <cdd9b>   DW_AT_type        : <0xcdd9f>
 <1><cdd9f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cdda0>   DW_AT_prototyped  : 1
    <cdda0>   DW_AT_type        : <0xcd634>
    <cdda4>   DW_AT_sibling     : <0xcddc2>
 <2><cdda8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdda9>   DW_AT_type        : <0xcd97f>
 <2><cddad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cddae>   DW_AT_type        : <0xcd728>
 <2><cddb2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cddb3>   DW_AT_type        : <0xcd699>
 <2><cddb7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cddb8>   DW_AT_type        : <0xcd634>
 <2><cddbc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cddbd>   DW_AT_type        : <0xcd634>
 <2><cddc1>: Abbrev Number: 0
 <1><cddc2>: Abbrev Number: 3 (DW_TAG_typedef)
    <cddc3>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <cddc7>   DW_AT_decl_file   : 9
    <cddc8>   DW_AT_decl_line   : 67
    <cddc9>   DW_AT_decl_column : 23
    <cddca>   DW_AT_type        : <0xcddce>
 <1><cddce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cddcf>   DW_AT_byte_size   : 8
    <cddcf>   DW_AT_type        : <0xcddd3>
 <1><cddd3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cddd4>   DW_AT_prototyped  : 1
    <cddd4>   DW_AT_type        : <0xcd634>
    <cddd8>   DW_AT_sibling     : <0xcdde2>
 <2><cdddc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cdddd>   DW_AT_type        : <0xcd634>
 <2><cdde1>: Abbrev Number: 0
 <1><cdde2>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdde3>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <cdde7>   DW_AT_decl_file   : 9
    <cdde8>   DW_AT_decl_line   : 68
    <cdde9>   DW_AT_decl_column : 23
    <cddea>   DW_AT_type        : <0xcddee>
 <1><cddee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cddef>   DW_AT_byte_size   : 8
    <cddef>   DW_AT_type        : <0xcddf3>
 <1><cddf3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cddf4>   DW_AT_prototyped  : 1
    <cddf4>   DW_AT_type        : <0xcd634>
    <cddf8>   DW_AT_sibling     : <0xcde16>
 <2><cddfc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cddfd>   DW_AT_type        : <0xcdca9>
 <2><cde01>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde02>   DW_AT_type        : <0xcdca9>
 <2><cde06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde07>   DW_AT_type        : <0xcdca9>
 <2><cde0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde0c>   DW_AT_type        : <0xcdca9>
 <2><cde10>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde11>   DW_AT_type        : <0xcdca9>
 <2><cde15>: Abbrev Number: 0
 <1><cde16>: Abbrev Number: 3 (DW_TAG_typedef)
    <cde17>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <cde1b>   DW_AT_decl_file   : 9
    <cde1c>   DW_AT_decl_line   : 69
    <cde1d>   DW_AT_decl_column : 23
    <cde1e>   DW_AT_type        : <0xcde22>
 <1><cde22>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cde23>   DW_AT_byte_size   : 8
    <cde23>   DW_AT_type        : <0xcde27>
 <1><cde27>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cde28>   DW_AT_prototyped  : 1
    <cde28>   DW_AT_type        : <0xcd634>
    <cde2c>   DW_AT_sibling     : <0xcde45>
 <2><cde30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde31>   DW_AT_type        : <0xcd634>
 <2><cde35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde36>   DW_AT_type        : <0xcd634>
 <2><cde3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde3b>   DW_AT_type        : <0xcd634>
 <2><cde3f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde40>   DW_AT_type        : <0xcd634>
 <2><cde44>: Abbrev Number: 0
 <1><cde45>: Abbrev Number: 3 (DW_TAG_typedef)
    <cde46>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <cde4a>   DW_AT_decl_file   : 9
    <cde4b>   DW_AT_decl_line   : 73
    <cde4c>   DW_AT_decl_column : 23
    <cde4d>   DW_AT_type        : <0xcde51>
 <1><cde51>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cde52>   DW_AT_byte_size   : 8
    <cde52>   DW_AT_type        : <0xcde56>
 <1><cde56>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cde57>   DW_AT_prototyped  : 1
    <cde57>   DW_AT_type        : <0xcd634>
    <cde5b>   DW_AT_sibling     : <0xcde65>
 <2><cde5f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde60>   DW_AT_type        : <0xcd611>
 <2><cde64>: Abbrev Number: 0
 <1><cde65>: Abbrev Number: 3 (DW_TAG_typedef)
    <cde66>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <cde6a>   DW_AT_decl_file   : 9
    <cde6b>   DW_AT_decl_line   : 74
    <cde6c>   DW_AT_decl_column : 23
    <cde6d>   DW_AT_type        : <0xcde71>
 <1><cde71>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cde72>   DW_AT_byte_size   : 8
    <cde72>   DW_AT_type        : <0xcde76>
 <1><cde76>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cde77>   DW_AT_prototyped  : 1
    <cde77>   DW_AT_type        : <0xcd634>
    <cde7b>   DW_AT_sibling     : <0xcde8a>
 <2><cde7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde80>   DW_AT_type        : <0xcd611>
 <2><cde84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cde85>   DW_AT_type        : <0xcd60a>
 <2><cde89>: Abbrev Number: 0
 <1><cde8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <cde8b>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <cde8f>   DW_AT_decl_file   : 9
    <cde90>   DW_AT_decl_line   : 80
    <cde91>   DW_AT_decl_column : 23
    <cde92>   DW_AT_type        : <0xcdbf9>
 <1><cde96>: Abbrev Number: 3 (DW_TAG_typedef)
    <cde97>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <cde9b>   DW_AT_decl_file   : 9
    <cde9c>   DW_AT_decl_line   : 83
    <cde9d>   DW_AT_decl_column : 23
    <cde9e>   DW_AT_type        : <0xcddce>
 <1><cdea2>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdea3>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <cdea7>   DW_AT_decl_file   : 9
    <cdea8>   DW_AT_decl_line   : 86
    <cdea9>   DW_AT_decl_column : 23
    <cdeaa>   DW_AT_type        : <0xcdc57>
 <1><cdeae>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdeaf>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <cdeb3>   DW_AT_decl_file   : 9
    <cdeb4>   DW_AT_decl_line   : 89
    <cdeb5>   DW_AT_decl_column : 23
    <cdeb6>   DW_AT_type        : <0xcdc57>
 <1><cdeba>: Abbrev Number: 3 (DW_TAG_typedef)
    <cdebb>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <cdebf>   DW_AT_decl_file   : 9
    <cdec0>   DW_AT_decl_line   : 91
    <cdec1>   DW_AT_decl_column : 23
    <cdec2>   DW_AT_type        : <0xcdec6>
 <1><cdec6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cdec7>   DW_AT_byte_size   : 8
    <cdec7>   DW_AT_type        : <0xcdecb>
 <1><cdecb>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdecc>   DW_AT_prototyped  : 1
    <cdecc>   DW_AT_sibling     : <0xcded6>
 <2><cded0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cded1>   DW_AT_type        : <0xcded6>
 <2><cded5>: Abbrev Number: 0
 <1><cded6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cded7>   DW_AT_byte_size   : 8
    <cded7>   DW_AT_type        : <0xcdba9>
 <1><cdedb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cdedc>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <cdee0>   DW_AT_byte_size   : 224
    <cdee1>   DW_AT_decl_file   : 9
    <cdee2>   DW_AT_decl_line   : 93
    <cdee3>   DW_AT_decl_column : 16
    <cdee4>   DW_AT_sibling     : <0xce055>
 <2><cdee8>: Abbrev Number: 2 (DW_TAG_member)
    <cdee9>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <cdeed>   DW_AT_decl_file   : 9
    <cdeee>   DW_AT_decl_line   : 94
    <cdeef>   DW_AT_decl_column : 23
    <cdef0>   DW_AT_type        : <0xcdbb5>
    <cdef4>   DW_AT_data_member_location: 0
 <2><cdef5>: Abbrev Number: 2 (DW_TAG_member)
    <cdef6>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <cdefa>   DW_AT_decl_file   : 9
    <cdefb>   DW_AT_decl_line   : 95
    <cdefc>   DW_AT_decl_column : 23
    <cdefd>   DW_AT_type        : <0xcdbcb>
    <cdf01>   DW_AT_data_member_location: 8
 <2><cdf02>: Abbrev Number: 2 (DW_TAG_member)
    <cdf03>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <cdf07>   DW_AT_decl_file   : 9
    <cdf08>   DW_AT_decl_line   : 96
    <cdf09>   DW_AT_decl_column : 23
    <cdf0a>   DW_AT_type        : <0xcdbe1>
    <cdf0e>   DW_AT_data_member_location: 16
 <2><cdf0f>: Abbrev Number: 2 (DW_TAG_member)
    <cdf10>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <cdf14>   DW_AT_decl_file   : 9
    <cdf15>   DW_AT_decl_line   : 97
    <cdf16>   DW_AT_decl_column : 23
    <cdf17>   DW_AT_type        : <0xcdbed>
    <cdf1b>   DW_AT_data_member_location: 24
 <2><cdf1c>: Abbrev Number: 2 (DW_TAG_member)
    <cdf1d>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <cdf21>   DW_AT_decl_file   : 9
    <cdf22>   DW_AT_decl_line   : 98
    <cdf23>   DW_AT_decl_column : 23
    <cdf24>   DW_AT_type        : <0xcdc09>
    <cdf28>   DW_AT_data_member_location: 32
 <2><cdf29>: Abbrev Number: 2 (DW_TAG_member)
    <cdf2a>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <cdf2e>   DW_AT_decl_file   : 9
    <cdf2f>   DW_AT_decl_line   : 99
    <cdf30>   DW_AT_decl_column : 23
    <cdf31>   DW_AT_type        : <0xcdc33>
    <cdf35>   DW_AT_data_member_location: 40
 <2><cdf36>: Abbrev Number: 2 (DW_TAG_member)
    <cdf37>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <cdf3b>   DW_AT_decl_file   : 9
    <cdf3c>   DW_AT_decl_line   : 100
    <cdf3d>   DW_AT_decl_column : 23
    <cdf3e>   DW_AT_type        : <0xcdc4b>
    <cdf42>   DW_AT_data_member_location: 48
 <2><cdf43>: Abbrev Number: 2 (DW_TAG_member)
    <cdf44>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <cdf48>   DW_AT_decl_file   : 9
    <cdf49>   DW_AT_decl_line   : 101
    <cdf4a>   DW_AT_decl_column : 23
    <cdf4b>   DW_AT_type        : <0xcdc70>
    <cdf4f>   DW_AT_data_member_location: 56
 <2><cdf50>: Abbrev Number: 2 (DW_TAG_member)
    <cdf51>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <cdf55>   DW_AT_decl_file   : 9
    <cdf56>   DW_AT_decl_line   : 102
    <cdf57>   DW_AT_decl_column : 23
    <cdf58>   DW_AT_type        : <0xcdc7c>
    <cdf5c>   DW_AT_data_member_location: 64
 <2><cdf5d>: Abbrev Number: 2 (DW_TAG_member)
    <cdf5e>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <cdf62>   DW_AT_decl_file   : 9
    <cdf63>   DW_AT_decl_line   : 103
    <cdf64>   DW_AT_decl_column : 23
    <cdf65>   DW_AT_type        : <0xcdc88>
    <cdf69>   DW_AT_data_member_location: 72
 <2><cdf6a>: Abbrev Number: 2 (DW_TAG_member)
    <cdf6b>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <cdf6f>   DW_AT_decl_file   : 9
    <cdf70>   DW_AT_decl_line   : 104
    <cdf71>   DW_AT_decl_column : 23
    <cdf72>   DW_AT_type        : <0xcdcae>
    <cdf76>   DW_AT_data_member_location: 80
 <2><cdf77>: Abbrev Number: 2 (DW_TAG_member)
    <cdf78>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <cdf7c>   DW_AT_decl_file   : 9
    <cdf7d>   DW_AT_decl_line   : 105
    <cdf7e>   DW_AT_decl_column : 24
    <cdf7f>   DW_AT_type        : <0xcdce4>
    <cdf83>   DW_AT_data_member_location: 88
 <2><cdf84>: Abbrev Number: 2 (DW_TAG_member)
    <cdf85>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <cdf89>   DW_AT_decl_file   : 9
    <cdf8a>   DW_AT_decl_line   : 106
    <cdf8b>   DW_AT_decl_column : 25
    <cdf8c>   DW_AT_type        : <0xcdd0a>
    <cdf90>   DW_AT_data_member_location: 96
 <2><cdf91>: Abbrev Number: 2 (DW_TAG_member)
    <cdf92>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <cdf96>   DW_AT_decl_file   : 9
    <cdf97>   DW_AT_decl_line   : 107
    <cdf98>   DW_AT_decl_column : 23
    <cdf99>   DW_AT_type        : <0xcdd30>
    <cdf9d>   DW_AT_data_member_location: 104
 <2><cdf9e>: Abbrev Number: 2 (DW_TAG_member)
    <cdf9f>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <cdfa3>   DW_AT_decl_file   : 9
    <cdfa4>   DW_AT_decl_line   : 108
    <cdfa5>   DW_AT_decl_column : 23
    <cdfa6>   DW_AT_type        : <0xcddc2>
    <cdfaa>   DW_AT_data_member_location: 112
 <2><cdfab>: Abbrev Number: 2 (DW_TAG_member)
    <cdfac>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <cdfb0>   DW_AT_decl_file   : 9
    <cdfb1>   DW_AT_decl_line   : 109
    <cdfb2>   DW_AT_decl_column : 23
    <cdfb3>   DW_AT_type        : <0xcdde2>
    <cdfb7>   DW_AT_data_member_location: 120
 <2><cdfb8>: Abbrev Number: 2 (DW_TAG_member)
    <cdfb9>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <cdfbd>   DW_AT_decl_file   : 9
    <cdfbe>   DW_AT_decl_line   : 110
    <cdfbf>   DW_AT_decl_column : 23
    <cdfc0>   DW_AT_type        : <0xcde16>
    <cdfc4>   DW_AT_data_member_location: 128
 <2><cdfc5>: Abbrev Number: 2 (DW_TAG_member)
    <cdfc6>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <cdfca>   DW_AT_decl_file   : 9
    <cdfcb>   DW_AT_decl_line   : 111
    <cdfcc>   DW_AT_decl_column : 23
    <cdfcd>   DW_AT_type        : <0xcde45>
    <cdfd1>   DW_AT_data_member_location: 136
 <2><cdfd2>: Abbrev Number: 2 (DW_TAG_member)
    <cdfd3>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <cdfd7>   DW_AT_decl_file   : 9
    <cdfd8>   DW_AT_decl_line   : 112
    <cdfd9>   DW_AT_decl_column : 23
    <cdfda>   DW_AT_type        : <0xcde65>
    <cdfde>   DW_AT_data_member_location: 144
 <2><cdfdf>: Abbrev Number: 2 (DW_TAG_member)
    <cdfe0>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <cdfe4>   DW_AT_decl_file   : 9
    <cdfe5>   DW_AT_decl_line   : 113
    <cdfe6>   DW_AT_decl_column : 25
    <cdfe7>   DW_AT_type        : <0xcdc3f>
    <cdfeb>   DW_AT_data_member_location: 152
 <2><cdfec>: Abbrev Number: 2 (DW_TAG_member)
    <cdfed>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <cdff1>   DW_AT_decl_file   : 9
    <cdff2>   DW_AT_decl_line   : 114
    <cdff3>   DW_AT_decl_column : 24
    <cdff4>   DW_AT_type        : <0xcdd55>
    <cdff8>   DW_AT_data_member_location: 160
 <2><cdff9>: Abbrev Number: 2 (DW_TAG_member)
    <cdffa>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <cdffe>   DW_AT_decl_file   : 9
    <cdfff>   DW_AT_decl_line   : 115
    <ce000>   DW_AT_decl_column : 25
    <ce001>   DW_AT_type        : <0xcdd8e>
    <ce005>   DW_AT_data_member_location: 168
 <2><ce006>: Abbrev Number: 2 (DW_TAG_member)
    <ce007>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <ce00b>   DW_AT_decl_file   : 9
    <ce00c>   DW_AT_decl_line   : 116
    <ce00d>   DW_AT_decl_column : 23
    <ce00e>   DW_AT_type        : <0xcdcba>
    <ce012>   DW_AT_data_member_location: 176
 <2><ce013>: Abbrev Number: 2 (DW_TAG_member)
    <ce014>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <ce018>   DW_AT_decl_file   : 9
    <ce019>   DW_AT_decl_line   : 117
    <ce01a>   DW_AT_decl_column : 23
    <ce01b>   DW_AT_type        : <0xcde8a>
    <ce01f>   DW_AT_data_member_location: 184
 <2><ce020>: Abbrev Number: 2 (DW_TAG_member)
    <ce021>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <ce025>   DW_AT_decl_file   : 9
    <ce026>   DW_AT_decl_line   : 118
    <ce027>   DW_AT_decl_column : 22
    <ce028>   DW_AT_type        : <0xcde96>
    <ce02c>   DW_AT_data_member_location: 192
 <2><ce02d>: Abbrev Number: 2 (DW_TAG_member)
    <ce02e>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <ce032>   DW_AT_decl_file   : 9
    <ce033>   DW_AT_decl_line   : 119
    <ce034>   DW_AT_decl_column : 23
    <ce035>   DW_AT_type        : <0xcdea2>
    <ce039>   DW_AT_data_member_location: 200
 <2><ce03a>: Abbrev Number: 2 (DW_TAG_member)
    <ce03b>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <ce03f>   DW_AT_decl_file   : 9
    <ce040>   DW_AT_decl_line   : 120
    <ce041>   DW_AT_decl_column : 22
    <ce042>   DW_AT_type        : <0xcdeae>
    <ce046>   DW_AT_data_member_location: 208
 <2><ce047>: Abbrev Number: 2 (DW_TAG_member)
    <ce048>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <ce04c>   DW_AT_decl_file   : 9
    <ce04d>   DW_AT_decl_line   : 121
    <ce04e>   DW_AT_decl_column : 23
    <ce04f>   DW_AT_type        : <0xcdeba>
    <ce053>   DW_AT_data_member_location: 216
 <2><ce054>: Abbrev Number: 0
 <1><ce055>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce056>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <ce05a>   DW_AT_decl_file   : 9
    <ce05b>   DW_AT_decl_line   : 122
    <ce05c>   DW_AT_decl_column : 3
    <ce05d>   DW_AT_type        : <0xcdedb>
 <1><ce061>: Abbrev Number: 37 (DW_TAG_structure_type)
    <ce062>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <ce066>   DW_AT_byte_size   : 20848
    <ce068>   DW_AT_decl_file   : 10
    <ce069>   DW_AT_decl_line   : 349
    <ce06b>   DW_AT_decl_column : 16
    <ce06c>   DW_AT_sibling     : <0xce0e1>
 <2><ce070>: Abbrev Number: 12 (DW_TAG_member)
    <ce071>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <ce075>   DW_AT_decl_file   : 10
    <ce075>   DW_AT_decl_line   : 350
    <ce077>   DW_AT_decl_column : 18
    <ce077>   DW_AT_type        : <0xcd634>
    <ce07b>   DW_AT_data_member_location: 0
 <2><ce07c>: Abbrev Number: 12 (DW_TAG_member)
    <ce07d>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <ce081>   DW_AT_decl_file   : 10
    <ce081>   DW_AT_decl_line   : 351
    <ce083>   DW_AT_decl_column : 18
    <ce083>   DW_AT_type        : <0xcd6c2>
    <ce087>   DW_AT_data_member_location: 8
 <2><ce088>: Abbrev Number: 12 (DW_TAG_member)
    <ce089>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <ce08d>   DW_AT_decl_file   : 10
    <ce08d>   DW_AT_decl_line   : 352
    <ce08f>   DW_AT_decl_column : 18
    <ce08f>   DW_AT_type        : <0xcd70e>
    <ce093>   DW_AT_data_member_location: 16
 <2><ce094>: Abbrev Number: 12 (DW_TAG_member)
    <ce095>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <ce099>   DW_AT_decl_file   : 10
    <ce099>   DW_AT_decl_line   : 353
    <ce09b>   DW_AT_decl_column : 18
    <ce09b>   DW_AT_type        : <0xcd65c>
    <ce09f>   DW_AT_data_member_location: 40
 <2><ce0a0>: Abbrev Number: 12 (DW_TAG_member)
    <ce0a1>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <ce0a5>   DW_AT_decl_file   : 10
    <ce0a5>   DW_AT_decl_line   : 354
    <ce0a7>   DW_AT_decl_column : 18
    <ce0a7>   DW_AT_type        : <0xce055>
    <ce0ab>   DW_AT_data_member_location: 48
 <2><ce0ac>: Abbrev Number: 14 (DW_TAG_member)
    <ce0ad>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <ce0b1>   DW_AT_decl_file   : 10
    <ce0b1>   DW_AT_decl_line   : 355
    <ce0b3>   DW_AT_decl_column : 18
    <ce0b3>   DW_AT_type        : <0xce0e1>
    <ce0b7>   DW_AT_data_member_location: 272
 <2><ce0b9>: Abbrev Number: 14 (DW_TAG_member)
    <ce0ba>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <ce0be>   DW_AT_decl_file   : 10
    <ce0be>   DW_AT_decl_line   : 356
    <ce0c0>   DW_AT_decl_column : 18
    <ce0c0>   DW_AT_type        : <0xcd634>
    <ce0c4>   DW_AT_data_member_location: 20832
 <2><ce0c6>: Abbrev Number: 14 (DW_TAG_member)
    <ce0c7>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <ce0cb>   DW_AT_decl_file   : 10
    <ce0cb>   DW_AT_decl_line   : 357
    <ce0cd>   DW_AT_decl_column : 18
    <ce0cd>   DW_AT_type        : <0xcd634>
    <ce0d1>   DW_AT_data_member_location: 20836
 <2><ce0d3>: Abbrev Number: 14 (DW_TAG_member)
    <ce0d4>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <ce0d8>   DW_AT_decl_file   : 10
    <ce0d8>   DW_AT_decl_line   : 358
    <ce0da>   DW_AT_decl_column : 18
    <ce0da>   DW_AT_type        : <0xcd6d3>
    <ce0de>   DW_AT_data_member_location: 20840
 <2><ce0e0>: Abbrev Number: 0
 <1><ce0e1>: Abbrev Number: 17 (DW_TAG_array_type)
    <ce0e2>   DW_AT_type        : <0xcdaef>
    <ce0e6>   DW_AT_sibling     : <0xce0f2>
 <2><ce0ea>: Abbrev Number: 38 (DW_TAG_subrange_type)
    <ce0eb>   DW_AT_type        : <0xcd61f>
    <ce0ef>   DW_AT_upper_bound : 256
 <2><ce0f1>: Abbrev Number: 0
 <1><ce0f2>: Abbrev Number: 16 (DW_TAG_typedef)
    <ce0f3>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <ce0f7>   DW_AT_decl_file   : 10
    <ce0f8>   DW_AT_decl_line   : 359
    <ce0fa>   DW_AT_decl_column : 3
    <ce0fb>   DW_AT_type        : <0xce061>
 <1><ce0ff>: Abbrev Number: 39 (DW_TAG_variable)
    <ce100>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <ce104>   DW_AT_decl_file   : 10
    <ce105>   DW_AT_decl_line   : 361
    <ce107>   DW_AT_decl_column : 21
    <ce108>   DW_AT_type        : <0xce0f2>
    <ce10c>   DW_AT_external    : 1
    <ce10c>   DW_AT_declaration : 1
 <1><ce10c>: Abbrev Number: 40 (DW_TAG_subprogram)
    <ce10d>   DW_AT_external    : 1
    <ce10d>   DW_AT_name        : (indirect string, offset: 0x1bc28): fb_PrintPadEx
    <ce111>   DW_AT_decl_file   : 11
    <ce112>   DW_AT_decl_line   : 92
    <ce113>   DW_AT_decl_column : 21
    <ce114>   DW_AT_prototyped  : 1
    <ce114>   DW_AT_declaration : 1
    <ce114>   DW_AT_sibling     : <0xce123>
 <2><ce118>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ce119>   DW_AT_type        : <0xcdafb>
 <2><ce11d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ce11e>   DW_AT_type        : <0xcd634>
 <2><ce122>: Abbrev Number: 0
 <1><ce123>: Abbrev Number: 41 (DW_TAG_subprogram)
    <ce124>   DW_AT_external    : 1
    <ce124>   DW_AT_name        : (indirect string, offset: 0x1bbe5): fb_hFilePrintBufferEx
    <ce128>   DW_AT_decl_file   : 7
    <ce129>   DW_AT_decl_line   : 304
    <ce12b>   DW_AT_decl_column : 21
    <ce12c>   DW_AT_prototyped  : 1
    <ce12c>   DW_AT_type        : <0xcd634>
    <ce130>   DW_AT_declaration : 1
    <ce130>   DW_AT_sibling     : <0xce144>
 <2><ce134>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ce135>   DW_AT_type        : <0xcdafb>
 <2><ce139>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ce13a>   DW_AT_type        : <0xcd6bc>
 <2><ce13e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ce13f>   DW_AT_type        : <0xcd668>
 <2><ce143>: Abbrev Number: 0
 <1><ce144>: Abbrev Number: 42 (DW_TAG_subprogram)
    <ce145>   DW_AT_external    : 1
    <ce145>   DW_AT_name        : (indirect string, offset: 0xd17d): fb_PrintVoid
    <ce149>   DW_AT_decl_file   : 1
    <ce14a>   DW_AT_decl_line   : 30
    <ce14b>   DW_AT_decl_column : 13
    <ce14c>   DW_AT_prototyped  : 1
    <ce14c>   DW_AT_low_pc      : 0x474520
    <ce154>   DW_AT_high_pc     : 0x9b
    <ce15c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ce15e>   DW_AT_call_all_calls: 1
    <ce15e>   DW_AT_sibling     : <0xce250>
 <2><ce162>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ce163>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <ce167>   DW_AT_decl_file   : 1
    <ce167>   DW_AT_decl_line   : 30
    <ce167>   DW_AT_decl_column : 32
    <ce168>   DW_AT_type        : <0xcd634>
    <ce16c>   DW_AT_location    : 0x3cbee (location list)
    <ce170>   DW_AT_GNU_locviews: 0x3cbe4
 <2><ce174>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ce175>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <ce179>   DW_AT_decl_file   : 1
    <ce179>   DW_AT_decl_line   : 30
    <ce179>   DW_AT_decl_column : 42
    <ce17a>   DW_AT_type        : <0xcd634>
    <ce17e>   DW_AT_location    : 0x3cc23 (location list)
    <ce182>   DW_AT_GNU_locviews: 0x3cc17
 <2><ce186>: Abbrev Number: 43 (DW_TAG_inlined_subroutine)
    <ce187>   DW_AT_abstract_origin: <0xce250>
    <ce18b>   DW_AT_entry_pc    : 0x474548
    <ce193>   DW_AT_GNU_entry_view: 0
    <ce194>   DW_AT_ranges      : 0x18336
    <ce198>   DW_AT_call_file   : 1
    <ce199>   DW_AT_call_line   : 32
    <ce19a>   DW_AT_call_column : 5
 <3><ce19b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce19c>   DW_AT_abstract_origin: <0xce267>
    <ce1a0>   DW_AT_location    : 0x3cc62 (location list)
    <ce1a4>   DW_AT_GNU_locviews: 0x3cc56
 <3><ce1a8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce1a9>   DW_AT_abstract_origin: <0xce25d>
    <ce1ad>   DW_AT_location    : 0x3cc9b (location list)
    <ce1b1>   DW_AT_GNU_locviews: 0x3cc95
 <3><ce1b5>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <ce1b6>   DW_AT_abstract_origin: <0xce250>
    <ce1ba>   DW_AT_entry_pc    : 0x474560
    <ce1c2>   DW_AT_GNU_entry_view: 0
    <ce1c3>   DW_AT_low_pc      : 0x474560
    <ce1cb>   DW_AT_high_pc     : 0x18
    <ce1d3>   DW_AT_call_file   : 1
