 <3><90ab6>: Abbrev Number: 0
 <2><90ab7>: Abbrev Number: 8 (DW_TAG_call_site)
    <90ab8>   DW_AT_call_return_pc: 0x4636cc
    <90ac0>   DW_AT_call_origin : <0x91f56>
 <2><90ac4>: Abbrev Number: 0
 <1><90ac5>: Abbrev Number: 39 (DW_TAG_subprogram)
    <90ac6>   DW_AT_external    : 1
    <90ac6>   DW_AT_name        : (indirect string, offset: 0x19293): fb_hX11WaitVSync
    <90aca>   DW_AT_decl_file   : 1
    <90aca>   DW_AT_decl_line   : 684
    <90acc>   DW_AT_decl_column : 6
    <90acc>   DW_AT_prototyped  : 1
    <90acc>   DW_AT_low_pc      : 0x463590
    <90ad4>   DW_AT_high_pc     : 0x1e
    <90adc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <90ade>   DW_AT_call_all_calls: 1
    <90ade>   DW_AT_sibling     : <0x90af0>
 <2><90ae2>: Abbrev Number: 47 (DW_TAG_call_site)
    <90ae3>   DW_AT_call_return_pc: 0x4635ae
    <90aeb>   DW_AT_call_tail_call: 1
    <90aeb>   DW_AT_call_origin : <0x901aa>
 <2><90aef>: Abbrev Number: 0
 <1><90af0>: Abbrev Number: 39 (DW_TAG_subprogram)
    <90af1>   DW_AT_external    : 1
    <90af1>   DW_AT_name        : (indirect string, offset: 0x18c30): fb_hX11SetPalette
    <90af5>   DW_AT_decl_file   : 1
    <90af5>   DW_AT_decl_line   : 670
    <90af7>   DW_AT_decl_column : 6
    <90af7>   DW_AT_prototyped  : 1
    <90af7>   DW_AT_low_pc      : 0x463500
    <90aff>   DW_AT_high_pc     : 0x8c
    <90b07>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <90b09>   DW_AT_call_all_calls: 1

    <91f9a>   DW_AT_type        : <0x91f9e>
 <1><91f9e>: Abbrev Number: 4 (DW_TAG_base_type)
    <91f9f>   DW_AT_byte_size   : 1
    <91fa0>   DW_AT_encoding    : 6	(signed char)
    <91fa1>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><91fa5>: Abbrev Number: 0
  Compilation Unit @ offset 0x91fa6:
   Length:        0xb5d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x5de6
   Pointer Size:  8
 <0><91fb2>: Abbrev Number: 30 (DW_TAG_compile_unit)
    <91fb3>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <91fb7>   DW_AT_language    : 29	(C11)
    <91fb8>   DW_AT_name        : (indirect line string, offset: 0x6f6): src/gfxlib2/gfx_box.c
    <91fbc>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <91fc0>   DW_AT_low_pc      : 0x463ee0
    <91fc8>   DW_AT_high_pc     : 0x597
    <91fd0>   DW_AT_stmt_list   : 0x596aa
 <1><91fd4>: Abbrev Number: 6 (DW_TAG_base_type)
    <91fd5>   DW_AT_byte_size   : 1
    <91fd6>   DW_AT_encoding    : 8	(unsigned char)
    <91fd7>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><91fdb>: Abbrev Number: 12 (DW_TAG_const_type)
    <91fdc>   DW_AT_type        : <0x91fd4>
 <1><91fe0>: Abbrev Number: 6 (DW_TAG_base_type)
    <91fe1>   DW_AT_byte_size   : 2
    <91fe2>   DW_AT_encoding    : 7	(unsigned)
    <91fe3>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><91fe7>: Abbrev Number: 6 (DW_TAG_base_type)
    <91fe8>   DW_AT_byte_size   : 4
    <91fe9>   DW_AT_encoding    : 7	(unsigned)
    <91fea>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><91fee>: Abbrev Number: 6 (DW_TAG_base_type)
    <91fef>   DW_AT_byte_size   : 8
    <91ff0>   DW_AT_encoding    : 7	(unsigned)
    <91ff1>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><91ff5>: Abbrev Number: 6 (DW_TAG_base_type)
    <91ff6>   DW_AT_byte_size   : 1
    <91ff7>   DW_AT_encoding    : 6	(signed char)
    <91ff8>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><91ffc>: Abbrev Number: 6 (DW_TAG_base_type)
    <91ffd>   DW_AT_byte_size   : 2
    <91ffe>   DW_AT_encoding    : 5	(signed)
    <91fff>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><92003>: Abbrev Number: 31 (DW_TAG_base_type)
    <92004>   DW_AT_byte_size   : 4
    <92005>   DW_AT_encoding    : 5	(signed)
    <92006>   DW_AT_name        : int
 <1><9200a>: Abbrev Number: 32 (DW_TAG_volatile_type)
    <9200b>   DW_AT_type        : <0x92003>
 <1><9200f>: Abbrev Number: 12 (DW_TAG_const_type)
    <92010>   DW_AT_type        : <0x92003>
 <1><92014>: Abbrev Number: 6 (DW_TAG_base_type)
    <92015>   DW_AT_byte_size   : 8
    <92016>   DW_AT_encoding    : 5	(signed)
    <92017>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9201b>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <9201c>   DW_AT_byte_size   : 8
 <1><9201d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9201e>   DW_AT_byte_size   : 8
    <9201e>   DW_AT_type        : <0x92022>
 <1><92022>: Abbrev Number: 6 (DW_TAG_base_type)
    <92023>   DW_AT_byte_size   : 1
    <92024>   DW_AT_encoding    : 6	(signed char)
    <92025>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><92029>: Abbrev Number: 8 (DW_TAG_typedef)
    <9202a>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <9202e>   DW_AT_decl_file   : 2
    <9202f>   DW_AT_decl_line   : 209
    <92030>   DW_AT_decl_column : 23
    <92031>   DW_AT_type        : <0x91fee>
 <1><92035>: Abbrev Number: 34 (DW_TAG_typedef)
    <92036>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <9203a>   DW_AT_decl_file   : 2
    <9203b>   DW_AT_decl_line   : 321
    <9203d>   DW_AT_decl_column : 24
    <9203e>   DW_AT_type        : <0x92003>
 <1><92042>: Abbrev Number: 6 (DW_TAG_base_type)
    <92043>   DW_AT_byte_size   : 8
    <92044>   DW_AT_encoding    : 5	(signed)
    <92045>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><92049>: Abbrev Number: 6 (DW_TAG_base_type)
    <9204a>   DW_AT_byte_size   : 8
    <9204b>   DW_AT_encoding    : 7	(unsigned)
    <9204c>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><92050>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92051>   DW_AT_byte_size   : 8
    <92051>   DW_AT_type        : <0x92055>
 <1><92055>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <92056>   DW_AT_prototyped  : 1
 <1><92056>: Abbrev Number: 6 (DW_TAG_base_type)
    <92057>   DW_AT_byte_size   : 8
    <92058>   DW_AT_encoding    : 4	(float)
    <92059>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9205d>: Abbrev Number: 6 (DW_TAG_base_type)
    <9205e>   DW_AT_byte_size   : 4
    <9205f>   DW_AT_encoding    : 4	(float)
    <92060>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><92064>: Abbrev Number: 8 (DW_TAG_typedef)
    <92065>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <92069>   DW_AT_decl_file   : 3
    <9206a>   DW_AT_decl_line   : 7
    <9206b>   DW_AT_decl_column : 25
    <9206c>   DW_AT_type        : <0x92070>
 <1><92070>: Abbrev Number: 36 (DW_TAG_structure_type)
    <92071>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <92075>   DW_AT_declaration : 1
 <1><92075>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92076>   DW_AT_byte_size   : 8
    <92077>   DW_AT_decl_file   : 4
    <92078>   DW_AT_decl_line   : 4
    <92079>   DW_AT_decl_column : 3
    <92079>   DW_AT_sibling     : <0x92098>
 <2><9207d>: Abbrev Number: 1 (DW_TAG_member)
    <9207e>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <92082>   DW_AT_decl_file   : 4
    <92083>   DW_AT_decl_line   : 5
    <92084>   DW_AT_decl_column : 8
    <92085>   DW_AT_type        : <0x92003>
    <92089>   DW_AT_data_member_location: 0
 <2><9208a>: Abbrev Number: 1 (DW_TAG_member)
    <9208b>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9208f>   DW_AT_decl_file   : 4
    <92090>   DW_AT_decl_line   : 6
    <92091>   DW_AT_decl_column : 8
    <92092>   DW_AT_type        : <0x92003>
    <92096>   DW_AT_data_member_location: 4
 <2><92097>: Abbrev Number: 0
 <1><92098>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92099>   DW_AT_byte_size   : 16
    <9209a>   DW_AT_decl_file   : 4
    <9209b>   DW_AT_decl_line   : 8
    <9209c>   DW_AT_decl_column : 3
    <9209c>   DW_AT_sibling     : <0x920cf>
 <2><920a0>: Abbrev Number: 5 (DW_TAG_member)
    <920a1>   DW_AT_name        : x
    <920a3>   DW_AT_decl_file   : 4
    <920a4>   DW_AT_decl_line   : 9
    <920a5>   DW_AT_decl_column : 8
    <920a6>   DW_AT_type        : <0x92003>
    <920aa>   DW_AT_data_member_location: 0
 <2><920ab>: Abbrev Number: 5 (DW_TAG_member)
    <920ac>   DW_AT_name        : y
    <920ae>   DW_AT_decl_file   : 4
    <920af>   DW_AT_decl_line   : 9
    <920b0>   DW_AT_decl_column : 11
    <920b1>   DW_AT_type        : <0x92003>
    <920b5>   DW_AT_data_member_location: 4
 <2><920b6>: Abbrev Number: 5 (DW_TAG_member)
    <920b7>   DW_AT_name        : dx
    <920ba>   DW_AT_decl_file   : 4
    <920bb>   DW_AT_decl_line   : 10
    <920bc>   DW_AT_decl_column : 8
    <920bd>   DW_AT_type        : <0x92003>
    <920c1>   DW_AT_data_member_location: 8
 <2><920c2>: Abbrev Number: 5 (DW_TAG_member)
    <920c3>   DW_AT_name        : dy
    <920c6>   DW_AT_decl_file   : 4
    <920c7>   DW_AT_decl_line   : 10
    <920c8>   DW_AT_decl_column : 12
    <920c9>   DW_AT_type        : <0x92003>
    <920cd>   DW_AT_data_member_location: 12
 <2><920ce>: Abbrev Number: 0
 <1><920cf>: Abbrev Number: 19 (DW_TAG_union_type)
    <920d0>   DW_AT_byte_size   : 16
    <920d0>   DW_AT_decl_file   : 4
    <920d1>   DW_AT_decl_line   : 3
    <920d2>   DW_AT_decl_column : 2
    <920d2>   DW_AT_sibling     : <0x920fc>
 <2><920d6>: Abbrev Number: 15 (DW_TAG_member)
    <920d7>   DW_AT_type        : <0x92075>
 <2><920db>: Abbrev Number: 15 (DW_TAG_member)
    <920dc>   DW_AT_type        : <0x92098>
 <2><920e0>: Abbrev Number: 20 (DW_TAG_member)
    <920e1>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <920e5>   DW_AT_decl_file   : 4
    <920e6>   DW_AT_decl_line   : 12
    <920e7>   DW_AT_decl_column : 7
    <920e7>   DW_AT_type        : <0x92003>
 <2><920eb>: Abbrev Number: 22 (DW_TAG_member)
    <920ec>   DW_AT_name        : z
    <920ee>   DW_AT_decl_file   : 4
    <920ee>   DW_AT_decl_line   : 13
    <920ef>   DW_AT_decl_column : 7
    <920ef>   DW_AT_type        : <0x92003>
 <2><920f3>: Abbrev Number: 22 (DW_TAG_member)
    <920f4>   DW_AT_name        : w
    <920f6>   DW_AT_decl_file   : 4
    <920f6>   DW_AT_decl_line   : 14
    <920f7>   DW_AT_decl_column : 7
    <920f7>   DW_AT_type        : <0x92003>
 <2><920fb>: Abbrev Number: 0
 <1><920fc>: Abbrev Number: 13 (DW_TAG_structure_type)
    <920fd>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <92101>   DW_AT_byte_size   : 20
    <92102>   DW_AT_decl_file   : 4
    <92103>   DW_AT_decl_line   : 1
    <92104>   DW_AT_decl_column : 8
    <92105>   DW_AT_sibling     : <0x9211d>
 <2><92109>: Abbrev Number: 1 (DW_TAG_member)
    <9210a>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9210e>   DW_AT_decl_file   : 4
    <9210f>   DW_AT_decl_line   : 2
    <92110>   DW_AT_decl_column : 6
    <92111>   DW_AT_type        : <0x92003>
    <92115>   DW_AT_data_member_location: 0
 <2><92116>: Abbrev Number: 21 (DW_TAG_member)
    <92117>   DW_AT_type        : <0x920cf>
    <9211b>   DW_AT_data_member_location: 4
 <2><9211c>: Abbrev Number: 0
 <1><9211d>: Abbrev Number: 8 (DW_TAG_typedef)
    <9211e>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <92122>   DW_AT_decl_file   : 4
    <92123>   DW_AT_decl_line   : 18
    <92124>   DW_AT_decl_column : 23
    <92125>   DW_AT_type        : <0x920fc>
 <1><92129>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9212a>   DW_AT_byte_size   : 8
    <9212a>   DW_AT_type        : <0x9212e>
 <1><9212e>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <9212f>   DW_AT_prototyped  : 1
    <9212f>   DW_AT_type        : <0x92003>
    <92133>   DW_AT_sibling     : <0x92142>
 <2><92137>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92138>   DW_AT_type        : <0x92003>
 <2><9213c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9213d>   DW_AT_type        : <0x92003>
 <2><92141>: Abbrev Number: 0
 <1><92142>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92143>   DW_AT_byte_size   : 8
    <92143>   DW_AT_type        : <0x92003>
 <1><92147>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92148>   DW_AT_byte_size   : 8
    <92148>   DW_AT_type        : <0x9214c>
 <1><9214c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <9214d>   DW_AT_prototyped  : 1
    <9214d>   DW_AT_type        : <0x92003>
    <92151>   DW_AT_sibling     : <0x9216f>
 <2><92155>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92156>   DW_AT_type        : <0x92142>
 <2><9215a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9215b>   DW_AT_type        : <0x92142>
 <2><9215f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92160>   DW_AT_type        : <0x92142>
 <2><92164>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92165>   DW_AT_type        : <0x92142>
 <2><92169>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9216a>   DW_AT_type        : <0x92142>
 <2><9216e>: Abbrev Number: 0
 <1><9216f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92170>   DW_AT_byte_size   : 8
    <92170>   DW_AT_type        : <0x9211d>
 <1><92174>: Abbrev Number: 8 (DW_TAG_typedef)
    <92175>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <92179>   DW_AT_decl_file   : 5
    <9217a>   DW_AT_decl_line   : 13
    <9217b>   DW_AT_decl_column : 30
    <9217c>   DW_AT_type        : <0x92180>
 <1><92180>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <92181>   DW_AT_prototyped  : 1
    <92181>   DW_AT_type        : <0x91fe7>
    <92185>   DW_AT_sibling     : <0x92199>
 <2><92189>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9218a>   DW_AT_type        : <0x91fe7>
 <2><9218e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9218f>   DW_AT_type        : <0x91fe7>
 <2><92193>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92194>   DW_AT_type        : <0x9201b>
 <2><92198>: Abbrev Number: 0
 <1><92199>: Abbrev Number: 8 (DW_TAG_typedef)
    <9219a>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <9219e>   DW_AT_decl_file   : 5
    <9219f>   DW_AT_decl_line   : 14
    <921a0>   DW_AT_decl_column : 15
    <921a1>   DW_AT_type        : <0x921a5>
 <1><921a5>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <921a6>   DW_AT_prototyped  : 1
    <921a6>   DW_AT_sibling     : <0x921d8>
 <2><921aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921ab>   DW_AT_type        : <0x921d8>
 <2><921af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921b0>   DW_AT_type        : <0x921d8>
 <2><921b4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921b5>   DW_AT_type        : <0x92003>
 <2><921b9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921ba>   DW_AT_type        : <0x92003>
 <2><921be>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921bf>   DW_AT_type        : <0x92003>
 <2><921c3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921c4>   DW_AT_type        : <0x92003>
 <2><921c8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921c9>   DW_AT_type        : <0x92003>
 <2><921cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921ce>   DW_AT_type        : <0x921dd>
 <2><921d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921d3>   DW_AT_type        : <0x9201b>
 <2><921d7>: Abbrev Number: 0
 <1><921d8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <921d9>   DW_AT_byte_size   : 8
    <921d9>   DW_AT_type        : <0x91fd4>
 <1><921dd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <921de>   DW_AT_byte_size   : 8
    <921de>   DW_AT_type        : <0x92174>
 <1><921e2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <921e3>   DW_AT_byte_size   : 16
    <921e4>   DW_AT_decl_file   : 5
    <921e5>   DW_AT_decl_line   : 26
    <921e6>   DW_AT_decl_column : 3
    <921e6>   DW_AT_sibling     : <0x9221f>
 <2><921ea>: Abbrev Number: 1 (DW_TAG_member)
    <921eb>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <921ef>   DW_AT_decl_file   : 5
    <921f0>   DW_AT_decl_line   : 27
    <921f1>   DW_AT_decl_column : 8
    <921f2>   DW_AT_type        : <0x92003>
    <921f6>   DW_AT_data_member_location: 0
 <2><921f7>: Abbrev Number: 1 (DW_TAG_member)
    <921f8>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <921fc>   DW_AT_decl_file   : 5
    <921fd>   DW_AT_decl_line   : 27
    <921fe>   DW_AT_decl_column : 16
    <921ff>   DW_AT_type        : <0x92003>
    <92203>   DW_AT_data_member_location: 4
 <2><92204>: Abbrev Number: 1 (DW_TAG_member)
    <92205>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <92209>   DW_AT_decl_file   : 5
    <9220a>   DW_AT_decl_line   : 27
    <9220b>   DW_AT_decl_column : 24
    <9220c>   DW_AT_type        : <0x92003>
    <92210>   DW_AT_data_member_location: 8
 <2><92211>: Abbrev Number: 1 (DW_TAG_member)
    <92212>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <92216>   DW_AT_decl_file   : 5
    <92217>   DW_AT_decl_line   : 27
    <92218>   DW_AT_decl_column : 32
    <92219>   DW_AT_type        : <0x92003>
    <9221d>   DW_AT_data_member_location: 12
 <2><9221e>: Abbrev Number: 0
 <1><9221f>: Abbrev Number: 19 (DW_TAG_union_type)
    <92220>   DW_AT_byte_size   : 16
    <92220>   DW_AT_decl_file   : 5
    <92221>   DW_AT_decl_line   : 25
    <92222>   DW_AT_decl_column : 2
    <92222>   DW_AT_sibling     : <0x92237>
 <2><92226>: Abbrev Number: 15 (DW_TAG_member)
    <92227>   DW_AT_type        : <0x921e2>
 <2><9222b>: Abbrev Number: 20 (DW_TAG_member)
    <9222c>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <92230>   DW_AT_decl_file   : 5
    <92231>   DW_AT_decl_line   : 29
    <92232>   DW_AT_decl_column : 7
    <92232>   DW_AT_type        : <0x92237>
 <2><92236>: Abbrev Number: 0
 <1><92237>: Abbrev Number: 23 (DW_TAG_array_type)
    <92238>   DW_AT_type        : <0x92003>
    <9223c>   DW_AT_sibling     : <0x92247>
 <2><92240>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <92241>   DW_AT_type        : <0x91fee>
    <92245>   DW_AT_upper_bound : 3
 <2><92246>: Abbrev Number: 0
 <1><92247>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92248>   DW_AT_byte_size   : 16
    <92249>   DW_AT_decl_file   : 5
    <9224a>   DW_AT_decl_line   : 32
    <9224b>   DW_AT_decl_column : 3
    <9224b>   DW_AT_sibling     : <0x92284>
 <2><9224f>: Abbrev Number: 1 (DW_TAG_member)
    <92250>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <92254>   DW_AT_decl_file   : 5
    <92255>   DW_AT_decl_line   : 33
    <92256>   DW_AT_decl_column : 8
    <92257>   DW_AT_type        : <0x92003>
    <9225b>   DW_AT_data_member_location: 0
 <2><9225c>: Abbrev Number: 1 (DW_TAG_member)
    <9225d>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <92261>   DW_AT_decl_file   : 5
    <92262>   DW_AT_decl_line   : 33
    <92263>   DW_AT_decl_column : 20
    <92264>   DW_AT_type        : <0x92003>
    <92268>   DW_AT_data_member_location: 4
 <2><92269>: Abbrev Number: 1 (DW_TAG_member)
    <9226a>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <9226e>   DW_AT_decl_file   : 5
    <9226f>   DW_AT_decl_line   : 33
    <92270>   DW_AT_decl_column : 32
    <92271>   DW_AT_type        : <0x92003>
    <92275>   DW_AT_data_member_location: 8
 <2><92276>: Abbrev Number: 1 (DW_TAG_member)
    <92277>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <9227b>   DW_AT_decl_file   : 5
    <9227c>   DW_AT_decl_line   : 33
    <9227d>   DW_AT_decl_column : 44
    <9227e>   DW_AT_type        : <0x92003>
    <92282>   DW_AT_data_member_location: 12
 <2><92283>: Abbrev Number: 0
 <1><92284>: Abbrev Number: 19 (DW_TAG_union_type)
    <92285>   DW_AT_byte_size   : 16
    <92285>   DW_AT_decl_file   : 5
    <92286>   DW_AT_decl_line   : 31
    <92287>   DW_AT_decl_column : 2
    <92287>   DW_AT_sibling     : <0x9229c>
 <2><9228b>: Abbrev Number: 15 (DW_TAG_member)
    <9228c>   DW_AT_type        : <0x92247>
 <2><92290>: Abbrev Number: 20 (DW_TAG_member)
    <92291>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <92295>   DW_AT_decl_file   : 5
    <92296>   DW_AT_decl_line   : 35
    <92297>   DW_AT_decl_column : 7
    <92297>   DW_AT_type        : <0x92237>
 <2><9229b>: Abbrev Number: 0
 <1><9229c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9229d>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <922a1>   DW_AT_byte_size   : 216
    <922a2>   DW_AT_decl_file   : 5
    <922a3>   DW_AT_decl_line   : 16
    <922a4>   DW_AT_decl_column : 16
    <922a5>   DW_AT_sibling     : <0x923b9>
 <2><922a9>: Abbrev Number: 5 (DW_TAG_member)
    <922aa>   DW_AT_name        : id
    <922ad>   DW_AT_decl_file   : 5
    <922ae>   DW_AT_decl_line   : 17
    <922af>   DW_AT_decl_column : 6
    <922b0>   DW_AT_type        : <0x92003>
    <922b4>   DW_AT_data_member_location: 0
 <2><922b5>: Abbrev Number: 1 (DW_TAG_member)
    <922b6>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <922ba>   DW_AT_decl_file   : 5
    <922bb>   DW_AT_decl_line   : 18
    <922bc>   DW_AT_decl_column : 6
    <922bd>   DW_AT_type        : <0x92003>
    <922c1>   DW_AT_data_member_location: 4
 <2><922c2>: Abbrev Number: 1 (DW_TAG_member)
    <922c3>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <922c7>   DW_AT_decl_file   : 5
    <922c8>   DW_AT_decl_line   : 19
    <922c9>   DW_AT_decl_column : 18
    <922ca>   DW_AT_type        : <0x923b9>
    <922ce>   DW_AT_data_member_location: 8
 <2><922cf>: Abbrev Number: 1 (DW_TAG_member)
    <922d0>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <922d4>   DW_AT_decl_file   : 5
    <922d5>   DW_AT_decl_line   : 20
    <922d6>   DW_AT_decl_column : 6
    <922d7>   DW_AT_type        : <0x92003>
    <922db>   DW_AT_data_member_location: 16
 <2><922dc>: Abbrev Number: 1 (DW_TAG_member)
    <922dd>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <922e1>   DW_AT_decl_file   : 5
    <922e2>   DW_AT_decl_line   : 21
    <922e3>   DW_AT_decl_column : 6
    <922e4>   DW_AT_type        : <0x92003>
    <922e8>   DW_AT_data_member_location: 20
 <2><922e9>: Abbrev Number: 1 (DW_TAG_member)
    <922ea>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <922ee>   DW_AT_decl_file   : 5
    <922ef>   DW_AT_decl_line   : 22
    <922f0>   DW_AT_decl_column : 6
    <922f1>   DW_AT_type        : <0x92003>
    <922f5>   DW_AT_data_member_location: 24
 <2><922f6>: Abbrev Number: 1 (DW_TAG_member)
    <922f7>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <922fb>   DW_AT_decl_file   : 5
    <922fc>   DW_AT_decl_line   : 23
    <922fd>   DW_AT_decl_column : 8
    <922fe>   DW_AT_type        : <0x9201b>
    <92302>   DW_AT_data_member_location: 32
 <2><92303>: Abbrev Number: 1 (DW_TAG_member)
    <92304>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <92308>   DW_AT_decl_file   : 5
    <92309>   DW_AT_decl_line   : 24
    <9230a>   DW_AT_decl_column : 8
    <9230b>   DW_AT_type        : <0x9205d>
    <9230f>   DW_AT_data_member_location: 40
 <2><92310>: Abbrev Number: 1 (DW_TAG_member)
    <92311>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <92315>   DW_AT_decl_file   : 5
    <92316>   DW_AT_decl_line   : 24
    <92317>   DW_AT_decl_column : 16
    <92318>   DW_AT_type        : <0x9205d>
    <9231c>   DW_AT_data_member_location: 44
 <2><9231d>: Abbrev Number: 21 (DW_TAG_member)
    <9231e>   DW_AT_type        : <0x9221f>
    <92322>   DW_AT_data_member_location: 48
 <2><92323>: Abbrev Number: 21 (DW_TAG_member)
    <92324>   DW_AT_type        : <0x92284>
    <92328>   DW_AT_data_member_location: 64
 <2><92329>: Abbrev Number: 1 (DW_TAG_member)
    <9232a>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <9232e>   DW_AT_decl_file   : 5
    <9232f>   DW_AT_decl_line   : 37
    <92330>   DW_AT_decl_column : 8
    <92331>   DW_AT_type        : <0x9205d>
    <92335>   DW_AT_data_member_location: 80
 <2><92336>: Abbrev Number: 1 (DW_TAG_member)
    <92337>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <9233b>   DW_AT_decl_file   : 5
    <9233c>   DW_AT_decl_line   : 37
    <9233d>   DW_AT_decl_column : 15
    <9233e>   DW_AT_type        : <0x9205d>
    <92342>   DW_AT_data_member_location: 84
 <2><92343>: Abbrev Number: 1 (DW_TAG_member)
    <92344>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <92348>   DW_AT_decl_file   : 5
    <92349>   DW_AT_decl_line   : 37
    <9234a>   DW_AT_decl_column : 22
    <9234b>   DW_AT_type        : <0x9205d>
    <9234f>   DW_AT_data_member_location: 88
 <2><92350>: Abbrev Number: 1 (DW_TAG_member)
    <92351>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <92355>   DW_AT_decl_file   : 5
    <92356>   DW_AT_decl_line   : 37
    <92357>   DW_AT_decl_column : 29
    <92358>   DW_AT_type        : <0x9205d>
    <9235c>   DW_AT_data_member_location: 92
 <2><9235d>: Abbrev Number: 1 (DW_TAG_member)
    <9235e>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <92362>   DW_AT_decl_file   : 5
    <92363>   DW_AT_decl_line   : 38
    <92364>   DW_AT_decl_column : 15
    <92365>   DW_AT_type        : <0x91fe7>
    <92369>   DW_AT_data_member_location: 96
 <2><9236a>: Abbrev Number: 1 (DW_TAG_member)
    <9236b>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <9236f>   DW_AT_decl_file   : 5
    <92370>   DW_AT_decl_line   : 38
    <92371>   DW_AT_decl_column : 25
    <92372>   DW_AT_type        : <0x91fe7>
    <92376>   DW_AT_data_member_location: 100
 <2><92377>: Abbrev Number: 1 (DW_TAG_member)
    <92378>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <9237c>   DW_AT_decl_file   : 5
    <9237d>   DW_AT_decl_line   : 39
    <9237e>   DW_AT_decl_column : 9
    <9237f>   DW_AT_type        : <0x923dd>
    <92383>   DW_AT_data_member_location: 104
 <2><92384>: Abbrev Number: 1 (DW_TAG_member)
    <92385>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <92389>   DW_AT_decl_file   : 5
    <9238a>   DW_AT_decl_line   : 40
    <9238b>   DW_AT_decl_column : 17
    <9238c>   DW_AT_type        : <0x923fb>
    <92390>   DW_AT_data_member_location: 112
 <2><92391>: Abbrev Number: 1 (DW_TAG_member)
    <92392>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <92396>   DW_AT_decl_file   : 5
    <92397>   DW_AT_decl_line   : 41
    <92398>   DW_AT_decl_column : 10
    <92399>   DW_AT_type        : <0x92419>
    <9239d>   DW_AT_data_member_location: 120
 <2><9239e>: Abbrev Number: 1 (DW_TAG_member)
    <9239f>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <923a3>   DW_AT_decl_file   : 5
    <923a4>   DW_AT_decl_line   : 42
    <923a5>   DW_AT_decl_column : 11
    <923a6>   DW_AT_type        : <0x9241e>
    <923aa>   DW_AT_data_member_location: 128
 <2><923ab>: Abbrev Number: 1 (DW_TAG_member)
    <923ac>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <923b0>   DW_AT_decl_file   : 5
    <923b1>   DW_AT_decl_line   : 43
    <923b2>   DW_AT_decl_column : 6
    <923b3>   DW_AT_type        : <0x92003>
    <923b7>   DW_AT_data_member_location: 208
 <2><923b8>: Abbrev Number: 0
 <1><923b9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <923ba>   DW_AT_byte_size   : 8
    <923ba>   DW_AT_type        : <0x921d8>
 <1><923be>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <923bf>   DW_AT_prototyped  : 1
    <923bf>   DW_AT_sibling     : <0x923d8>
 <2><923c3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923c4>   DW_AT_type        : <0x923d8>
 <2><923c8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923c9>   DW_AT_type        : <0x92003>
 <2><923cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923ce>   DW_AT_type        : <0x92003>
 <2><923d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923d3>   DW_AT_type        : <0x91fe7>
 <2><923d7>: Abbrev Number: 0
 <1><923d8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <923d9>   DW_AT_byte_size   : 8
    <923d9>   DW_AT_type        : <0x9229c>
 <1><923dd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <923de>   DW_AT_byte_size   : 8
    <923de>   DW_AT_type        : <0x923be>
 <1><923e2>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <923e3>   DW_AT_prototyped  : 1
    <923e3>   DW_AT_type        : <0x91fe7>
    <923e7>   DW_AT_sibling     : <0x923fb>
 <2><923eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923ec>   DW_AT_type        : <0x923d8>
 <2><923f0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923f1>   DW_AT_type        : <0x92003>
 <2><923f5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923f6>   DW_AT_type        : <0x92003>
 <2><923fa>: Abbrev Number: 0
 <1><923fb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <923fc>   DW_AT_byte_size   : 8
    <923fc>   DW_AT_type        : <0x923e2>
 <1><92400>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <92401>   DW_AT_prototyped  : 1
    <92401>   DW_AT_type        : <0x9201b>
    <92405>   DW_AT_sibling     : <0x92419>
 <2><92409>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9240a>   DW_AT_type        : <0x9201b>
 <2><9240e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9240f>   DW_AT_type        : <0x92003>
 <2><92413>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92414>   DW_AT_type        : <0x92029>
 <2><92418>: Abbrev Number: 0
 <1><92419>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9241a>   DW_AT_byte_size   : 8
    <9241a>   DW_AT_type        : <0x92400>
 <1><9241e>: Abbrev Number: 23 (DW_TAG_array_type)
    <9241f>   DW_AT_type        : <0x9242e>
    <92423>   DW_AT_sibling     : <0x9242e>
 <2><92427>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <92428>   DW_AT_type        : <0x91fee>
    <9242c>   DW_AT_upper_bound : 9
 <2><9242d>: Abbrev Number: 0
 <1><9242e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9242f>   DW_AT_byte_size   : 8
    <9242f>   DW_AT_type        : <0x92433>
 <1><92433>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92434>   DW_AT_byte_size   : 8
    <92434>   DW_AT_type        : <0x92199>
 <1><92438>: Abbrev Number: 8 (DW_TAG_typedef)
    <92439>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <9243d>   DW_AT_decl_file   : 5
    <9243e>   DW_AT_decl_line   : 44
    <9243f>   DW_AT_decl_column : 3
    <92440>   DW_AT_type        : <0x9229c>
 <1><92444>: Abbrev Number: 13 (DW_TAG_structure_type)
    <92445>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <92449>   DW_AT_byte_size   : 12
    <9244a>   DW_AT_decl_file   : 6
    <9244b>   DW_AT_decl_line   : 139
    <9244c>   DW_AT_decl_column : 16
    <9244d>   DW_AT_sibling     : <0x92476>
 <2><92451>: Abbrev Number: 5 (DW_TAG_member)
    <92452>   DW_AT_name        : ch
    <92455>   DW_AT_decl_file   : 6
    <92456>   DW_AT_decl_line   : 140
    <92457>   DW_AT_decl_column : 14
    <92458>   DW_AT_type        : <0x92035>
    <9245c>   DW_AT_data_member_location: 0
 <2><9245d>: Abbrev Number: 5 (DW_TAG_member)
    <9245e>   DW_AT_name        : fg
    <92461>   DW_AT_decl_file   : 6
    <92462>   DW_AT_decl_line   : 141
    <92463>   DW_AT_decl_column : 14
    <92464>   DW_AT_type        : <0x91fe7>
    <92468>   DW_AT_data_member_location: 4
 <2><92469>: Abbrev Number: 5 (DW_TAG_member)
    <9246a>   DW_AT_name        : bg
    <9246d>   DW_AT_decl_file   : 6
    <9246e>   DW_AT_decl_line   : 141
    <9246f>   DW_AT_decl_column : 18
    <92470>   DW_AT_type        : <0x91fe7>
    <92474>   DW_AT_data_member_location: 8
 <2><92475>: Abbrev Number: 0
 <1><92476>: Abbrev Number: 8 (DW_TAG_typedef)
    <92477>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <9247b>   DW_AT_decl_file   : 6
    <9247c>   DW_AT_decl_line   : 142
    <9247d>   DW_AT_decl_column : 3
    <9247e>   DW_AT_type        : <0x92444>
 <1><92482>: Abbrev Number: 13 (DW_TAG_structure_type)
    <92483>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <92487>   DW_AT_byte_size   : 208
    <92488>   DW_AT_decl_file   : 6
    <92489>   DW_AT_decl_line   : 144
    <9248a>   DW_AT_decl_column : 16
    <9248b>   DW_AT_sibling     : <0x92645>
 <2><9248f>: Abbrev Number: 5 (DW_TAG_member)
    <92490>   DW_AT_name        : id
    <92493>   DW_AT_decl_file   : 6
    <92494>   DW_AT_decl_line   : 146
    <92495>   DW_AT_decl_column : 6
    <92496>   DW_AT_type        : <0x92003>
    <9249a>   DW_AT_data_member_location: 0
 <2><9249b>: Abbrev Number: 1 (DW_TAG_member)
    <9249c>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <924a0>   DW_AT_decl_file   : 6
    <924a1>   DW_AT_decl_line   : 147
    <924a2>   DW_AT_decl_column : 9
    <924a3>   DW_AT_type        : <0x92003>
    <924a7>   DW_AT_data_member_location: 4
 <2><924a8>: Abbrev Number: 1 (DW_TAG_member)
    <924a9>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <924ad>   DW_AT_decl_file   : 6
    <924ae>   DW_AT_decl_line   : 148
    <924af>   DW_AT_decl_column : 21
    <924b0>   DW_AT_type        : <0x923b9>
    <924b4>   DW_AT_data_member_location: 8
 <2><924b5>: Abbrev Number: 1 (DW_TAG_member)
    <924b6>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <924ba>   DW_AT_decl_file   : 6
    <924bb>   DW_AT_decl_line   : 149
    <924bc>   DW_AT_decl_column : 9
    <924bd>   DW_AT_type        : <0x92003>
    <924c1>   DW_AT_data_member_location: 16
 <2><924c2>: Abbrev Number: 1 (DW_TAG_member)
    <924c3>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <924c7>   DW_AT_decl_file   : 6
    <924c8>   DW_AT_decl_line   : 150
    <924c9>   DW_AT_decl_column : 9
    <924ca>   DW_AT_type        : <0x92003>
    <924ce>   DW_AT_data_member_location: 20
 <2><924cf>: Abbrev Number: 1 (DW_TAG_member)
    <924d0>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <924d4>   DW_AT_decl_file   : 6
    <924d5>   DW_AT_decl_line   : 151
    <924d6>   DW_AT_decl_column : 20
    <924d7>   DW_AT_type        : <0x921d8>
    <924db>   DW_AT_data_member_location: 24
 <2><924dc>: Abbrev Number: 5 (DW_TAG_member)
    <924dd>   DW_AT_name        : w
    <924df>   DW_AT_decl_file   : 6
    <924e0>   DW_AT_decl_line   : 152
    <924e1>   DW_AT_decl_column : 9
    <924e2>   DW_AT_type        : <0x92003>
    <924e6>   DW_AT_data_member_location: 32
 <2><924e7>: Abbrev Number: 5 (DW_TAG_member)
    <924e8>   DW_AT_name        : h
    <924ea>   DW_AT_decl_file   : 6
    <924eb>   DW_AT_decl_line   : 152
    <924ec>   DW_AT_decl_column : 12
    <924ed>   DW_AT_type        : <0x92003>
    <924f1>   DW_AT_data_member_location: 36
 <2><924f2>: Abbrev Number: 1 (DW_TAG_member)
    <924f3>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <924f7>   DW_AT_decl_file   : 6
    <924f8>   DW_AT_decl_line   : 153
    <924f9>   DW_AT_decl_column : 9
    <924fa>   DW_AT_type        : <0x92003>
    <924fe>   DW_AT_data_member_location: 40
 <2><924ff>: Abbrev Number: 5 (DW_TAG_member)
    <92500>   DW_AT_name        : bpp
    <92504>   DW_AT_decl_file   : 6
    <92505>   DW_AT_decl_line   : 154
    <92506>   DW_AT_decl_column : 9
    <92507>   DW_AT_type        : <0x92003>
    <9250b>   DW_AT_data_member_location: 44
 <2><9250c>: Abbrev Number: 1 (DW_TAG_member)
    <9250d>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <92511>   DW_AT_decl_file   : 6
    <92512>   DW_AT_decl_line   : 155
    <92513>   DW_AT_decl_column : 9
    <92514>   DW_AT_type        : <0x92003>
    <92518>   DW_AT_data_member_location: 48
 <2><92519>: Abbrev Number: 1 (DW_TAG_member)
    <9251a>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <9251e>   DW_AT_decl_file   : 6
    <9251f>   DW_AT_decl_line   : 156
    <92520>   DW_AT_decl_column : 19
    <92521>   DW_AT_type        : <0x92645>
    <92525>   DW_AT_data_member_location: 56
 <2><92526>: Abbrev Number: 1 (DW_TAG_member)
    <92527>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <9252b>   DW_AT_decl_file   : 6
    <9252c>   DW_AT_decl_line   : 157
    <9252d>   DW_AT_decl_column : 19
    <9252e>   DW_AT_type        : <0x92645>
    <92532>   DW_AT_data_member_location: 64
 <2><92533>: Abbrev Number: 1 (DW_TAG_member)
    <92534>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <92538>   DW_AT_decl_file   : 6
    <92539>   DW_AT_decl_line   : 158
    <9253a>   DW_AT_decl_column : 20
    <9253b>   DW_AT_type        : <0x921d8>
    <9253f>   DW_AT_data_member_location: 72
 <2><92540>: Abbrev Number: 1 (DW_TAG_member)
    <92541>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <92545>   DW_AT_decl_file   : 6
    <92546>   DW_AT_decl_line   : 159
    <92547>   DW_AT_decl_column : 11
    <92548>   DW_AT_type        : <0x9201d>
    <9254c>   DW_AT_data_member_location: 80
 <2><9254d>: Abbrev Number: 1 (DW_TAG_member)
    <9254e>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <92552>   DW_AT_decl_file   : 6
    <92553>   DW_AT_decl_line   : 160
    <92554>   DW_AT_decl_column : 29
    <92555>   DW_AT_type        : <0x92713>
    <92559>   DW_AT_data_member_location: 88
 <2><9255a>: Abbrev Number: 1 (DW_TAG_member)
    <9255b>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <9255f>   DW_AT_decl_file   : 6
    <92560>   DW_AT_decl_line   : 161
    <92561>   DW_AT_decl_column : 9
    <92562>   DW_AT_type        : <0x92003>
    <92566>   DW_AT_data_member_location: 96
 <2><92567>: Abbrev Number: 1 (DW_TAG_member)
    <92568>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <9256c>   DW_AT_decl_file   : 6
    <9256d>   DW_AT_decl_line   : 162
    <9256e>   DW_AT_decl_column : 27
    <9256f>   DW_AT_type        : <0x92743>
    <92573>   DW_AT_data_member_location: 104
 <2><92574>: Abbrev Number: 1 (DW_TAG_member)
    <92575>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <92579>   DW_AT_decl_file   : 6
    <9257a>   DW_AT_decl_line   : 163
    <9257b>   DW_AT_decl_column : 9
    <9257c>   DW_AT_type        : <0x92003>
    <92580>   DW_AT_data_member_location: 112
 <2><92581>: Abbrev Number: 1 (DW_TAG_member)
    <92582>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <92586>   DW_AT_decl_file   : 6
    <92587>   DW_AT_decl_line   : 164
    <92588>   DW_AT_decl_column : 9
    <92589>   DW_AT_type        : <0x92003>
    <9258d>   DW_AT_data_member_location: 116
 <2><9258e>: Abbrev Number: 1 (DW_TAG_member)
    <9258f>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <92593>   DW_AT_decl_file   : 6
    <92594>   DW_AT_decl_line   : 164
    <92595>   DW_AT_decl_column : 19
    <92596>   DW_AT_type        : <0x92003>
    <9259a>   DW_AT_data_member_location: 120
 <2><9259b>: Abbrev Number: 1 (DW_TAG_member)
    <9259c>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <925a0>   DW_AT_decl_file   : 6
    <925a1>   DW_AT_decl_line   : 165
    <925a2>   DW_AT_decl_column : 24
    <925a3>   DW_AT_type        : <0x9277a>
    <925a7>   DW_AT_data_member_location: 128
 <2><925a8>: Abbrev Number: 1 (DW_TAG_member)
    <925a9>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <925ad>   DW_AT_decl_file   : 6
    <925ae>   DW_AT_decl_line   : 166
    <925af>   DW_AT_decl_column : 9
    <925b0>   DW_AT_type        : <0x92003>
    <925b4>   DW_AT_data_member_location: 136
 <2><925b5>: Abbrev Number: 1 (DW_TAG_member)
    <925b6>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <925ba>   DW_AT_decl_file   : 6
    <925bb>   DW_AT_decl_line   : 166
    <925bc>   DW_AT_decl_column : 17
    <925bd>   DW_AT_type        : <0x92003>
    <925c1>   DW_AT_data_member_location: 140
 <2><925c2>: Abbrev Number: 1 (DW_TAG_member)
    <925c3>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <925c7>   DW_AT_decl_file   : 6
    <925c8>   DW_AT_decl_line   : 167
    <925c9>   DW_AT_decl_column : 11
    <925ca>   DW_AT_type        : <0x9205d>
    <925ce>   DW_AT_data_member_location: 144
 <2><925cf>: Abbrev Number: 5 (DW_TAG_member)
    <925d0>   DW_AT_name        : key
    <925d4>   DW_AT_decl_file   : 6
    <925d5>   DW_AT_decl_line   : 168
    <925d6>   DW_AT_decl_column : 11
    <925d7>   DW_AT_type        : <0x9201d>
    <925db>   DW_AT_data_member_location: 152
 <2><925dc>: Abbrev Number: 1 (DW_TAG_member)
    <925dd>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <925e1>   DW_AT_decl_file   : 6
    <925e2>   DW_AT_decl_line   : 169
    <925e3>   DW_AT_decl_column : 6
    <925e4>   DW_AT_type        : <0x92003>
    <925e8>   DW_AT_data_member_location: 160
 <2><925e9>: Abbrev Number: 1 (DW_TAG_member)
    <925ea>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <925ee>   DW_AT_decl_file   : 6
    <925ef>   DW_AT_decl_line   : 170
    <925f0>   DW_AT_decl_column : 18
    <925f1>   DW_AT_type        : <0x9277f>
    <925f5>   DW_AT_data_member_location: 168
 <2><925f6>: Abbrev Number: 1 (DW_TAG_member)
    <925f7>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <925fb>   DW_AT_decl_file   : 6
    <925fc>   DW_AT_decl_line   : 171
    <925fd>   DW_AT_decl_column : 12
    <925fe>   DW_AT_type        : <0x9216f>
    <92602>   DW_AT_data_member_location: 176
 <2><92603>: Abbrev Number: 1 (DW_TAG_member)
    <92604>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <92608>   DW_AT_decl_file   : 6
    <92609>   DW_AT_decl_line   : 172
    <9260a>   DW_AT_decl_column : 9
    <9260b>   DW_AT_type        : <0x92003>
    <9260f>   DW_AT_data_member_location: 184
 <2><92610>: Abbrev Number: 1 (DW_TAG_member)
    <92611>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <92615>   DW_AT_decl_file   : 6
    <92616>   DW_AT_decl_line   : 172
    <92617>   DW_AT_decl_column : 21
    <92618>   DW_AT_type        : <0x92003>
    <9261c>   DW_AT_data_member_location: 188
 <2><9261d>: Abbrev Number: 1 (DW_TAG_member)
    <9261e>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <92622>   DW_AT_decl_file   : 6
    <92623>   DW_AT_decl_line   : 173
    <92624>   DW_AT_decl_column : 11
    <92625>   DW_AT_type        : <0x92789>
    <92629>   DW_AT_data_member_location: 192
 <2><9262a>: Abbrev Number: 1 (DW_TAG_member)
    <9262b>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <9262f>   DW_AT_decl_file   : 6
    <92630>   DW_AT_decl_line   : 174
    <92631>   DW_AT_decl_column : 15
    <92632>   DW_AT_type        : <0x9200a>
    <92636>   DW_AT_data_member_location: 200
 <2><92637>: Abbrev Number: 1 (DW_TAG_member)
    <92638>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <9263c>   DW_AT_decl_file   : 6
    <9263d>   DW_AT_decl_line   : 175
    <9263e>   DW_AT_decl_column : 6
    <9263f>   DW_AT_type        : <0x92003>
    <92643>   DW_AT_data_member_location: 204
 <2><92644>: Abbrev Number: 0
 <1><92645>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92646>   DW_AT_byte_size   : 8
    <92646>   DW_AT_type        : <0x91fe7>
 <1><9264a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9264b>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <9264f>   DW_AT_byte_size   : 112
    <92650>   DW_AT_decl_file   : 6
    <92651>   DW_AT_decl_line   : 178
    <92652>   DW_AT_decl_column : 16
    <92653>   DW_AT_sibling     : <0x9270e>
 <2><92657>: Abbrev Number: 1 (DW_TAG_member)
    <92658>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <9265c>   DW_AT_decl_file   : 6
    <9265d>   DW_AT_decl_line   : 188
    <9265e>   DW_AT_decl_column : 8
    <9265f>   DW_AT_type        : <0x9201d>
    <92663>   DW_AT_data_member_location: 0
 <2><92664>: Abbrev Number: 1 (DW_TAG_member)
    <92665>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <92669>   DW_AT_decl_file   : 6
    <9266a>   DW_AT_decl_line   : 208
    <9266b>   DW_AT_decl_column : 8
    <9266c>   DW_AT_type        : <0x927c2>
    <92670>   DW_AT_data_member_location: 8
 <2><92671>: Abbrev Number: 1 (DW_TAG_member)
    <92672>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <92676>   DW_AT_decl_file   : 6
    <92677>   DW_AT_decl_line   : 222
    <92678>   DW_AT_decl_column : 9
    <92679>   DW_AT_type        : <0x92050>
    <9267d>   DW_AT_data_member_location: 16
 <2><9267e>: Abbrev Number: 1 (DW_TAG_member)
    <9267f>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <92683>   DW_AT_decl_file   : 6
    <92684>   DW_AT_decl_line   : 231
    <92685>   DW_AT_decl_column : 9
    <92686>   DW_AT_type        : <0x92050>
    <9268a>   DW_AT_data_member_location: 24
 <2><9268b>: Abbrev Number: 1 (DW_TAG_member)
    <9268c>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <92690>   DW_AT_decl_file   : 6
    <92691>   DW_AT_decl_line   : 239
    <92692>   DW_AT_decl_column : 9
    <92693>   DW_AT_type        : <0x92050>
    <92697>   DW_AT_data_member_location: 32
 <2><92698>: Abbrev Number: 1 (DW_TAG_member)
    <92699>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <9269d>   DW_AT_decl_file   : 6
    <9269e>   DW_AT_decl_line   : 248
    <9269f>   DW_AT_decl_column : 9
    <926a0>   DW_AT_type        : <0x927e1>
    <926a4>   DW_AT_data_member_location: 40
 <2><926a5>: Abbrev Number: 7 (DW_TAG_member)
    <926a6>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <926aa>   DW_AT_decl_file   : 6
    <926aa>   DW_AT_decl_line   : 258
    <926ac>   DW_AT_decl_column : 9
    <926ad>   DW_AT_type        : <0x92050>
    <926b1>   DW_AT_data_member_location: 48
 <2><926b2>: Abbrev Number: 7 (DW_TAG_member)
    <926b3>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <926b7>   DW_AT_decl_file   : 6
    <926b7>   DW_AT_decl_line   : 274
    <926b9>   DW_AT_decl_column : 8
    <926ba>   DW_AT_type        : <0x92147>
    <926be>   DW_AT_data_member_location: 56
 <2><926bf>: Abbrev Number: 7 (DW_TAG_member)
    <926c0>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <926c4>   DW_AT_decl_file   : 6
    <926c4>   DW_AT_decl_line   : 285
    <926c6>   DW_AT_decl_column : 9
    <926c7>   DW_AT_type        : <0x927e1>
    <926cb>   DW_AT_data_member_location: 64
 <2><926cc>: Abbrev Number: 7 (DW_TAG_member)
    <926cd>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <926d1>   DW_AT_decl_file   : 6
    <926d1>   DW_AT_decl_line   : 293
    <926d3>   DW_AT_decl_column : 9
    <926d4>   DW_AT_type        : <0x927f1>
    <926d8>   DW_AT_data_member_location: 72
 <2><926d9>: Abbrev Number: 7 (DW_TAG_member)
    <926da>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <926de>   DW_AT_decl_file   : 6
    <926de>   DW_AT_decl_line   : 301
    <926e0>   DW_AT_decl_column : 8
    <926e1>   DW_AT_type        : <0x92129>
    <926e5>   DW_AT_data_member_location: 80
 <2><926e6>: Abbrev Number: 7 (DW_TAG_member)
    <926e7>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <926eb>   DW_AT_decl_file   : 6
    <926eb>   DW_AT_decl_line   : 314
    <926ed>   DW_AT_decl_column : 9
    <926ee>   DW_AT_type        : <0x9280a>
    <926f2>   DW_AT_data_member_location: 88
 <2><926f3>: Abbrev Number: 7 (DW_TAG_member)
    <926f4>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <926f8>   DW_AT_decl_file   : 6
    <926f8>   DW_AT_decl_line   : 321
    <926fa>   DW_AT_decl_column : 9
    <926fb>   DW_AT_type        : <0x92050>
    <926ff>   DW_AT_data_member_location: 96
 <2><92700>: Abbrev Number: 7 (DW_TAG_member)
    <92701>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <92705>   DW_AT_decl_file   : 6
    <92705>   DW_AT_decl_line   : 328
    <92707>   DW_AT_decl_column : 9
    <92708>   DW_AT_type        : <0x92050>
    <9270c>   DW_AT_data_member_location: 104
 <2><9270d>: Abbrev Number: 0
 <1><9270e>: Abbrev Number: 12 (DW_TAG_const_type)
    <9270f>   DW_AT_type        : <0x9264a>
 <1><92713>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92714>   DW_AT_byte_size   : 8
    <92714>   DW_AT_type        : <0x9270e>
 <1><92718>: Abbrev Number: 25 (DW_TAG_structure_type)
    <92719>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <9271d>   DW_AT_byte_size   : 16
    <9271d>   DW_AT_decl_file   : 6
    <9271d>   DW_AT_decl_line   : 331
    <9271f>   DW_AT_decl_column : 16
    <9271f>   DW_AT_sibling     : <0x9273e>
 <2><92723>: Abbrev Number: 7 (DW_TAG_member)
    <92724>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <92728>   DW_AT_decl_file   : 6
    <92728>   DW_AT_decl_line   : 333
    <9272a>   DW_AT_decl_column : 12
    <9272b>   DW_AT_type        : <0x9200f>
    <9272f>   DW_AT_data_member_location: 0
 <2><92730>: Abbrev Number: 7 (DW_TAG_member)
    <92731>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <92735>   DW_AT_decl_file   : 6
    <92735>   DW_AT_decl_line   : 334
    <92737>   DW_AT_decl_column : 23
    <92738>   DW_AT_type        : <0x9280f>
    <9273c>   DW_AT_data_member_location: 8
 <2><9273d>: Abbrev Number: 0
 <1><9273e>: Abbrev Number: 12 (DW_TAG_const_type)
    <9273f>   DW_AT_type        : <0x92718>
 <1><92743>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92744>   DW_AT_byte_size   : 8
    <92744>   DW_AT_type        : <0x9273e>
 <1><92748>: Abbrev Number: 25 (DW_TAG_structure_type)
    <92749>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <9274d>   DW_AT_byte_size   : 16
    <9274d>   DW_AT_decl_file   : 6
    <9274d>   DW_AT_decl_line   : 337
    <9274f>   DW_AT_decl_column : 16
    <9274f>   DW_AT_sibling     : <0x92775>
 <2><92753>: Abbrev Number: 26 (DW_TAG_member)
    <92754>   DW_AT_name        : w
    <92756>   DW_AT_decl_file   : 6
    <92756>   DW_AT_decl_line   : 339
    <92758>   DW_AT_decl_column : 15
    <92758>   DW_AT_type        : <0x9200f>
    <9275c>   DW_AT_data_member_location: 0
 <2><9275d>: Abbrev Number: 26 (DW_TAG_member)
    <9275e>   DW_AT_name        : h
    <92760>   DW_AT_decl_file   : 6
    <92760>   DW_AT_decl_line   : 340
    <92762>   DW_AT_decl_column : 15
    <92762>   DW_AT_type        : <0x9200f>
    <92766>   DW_AT_data_member_location: 4
 <2><92767>: Abbrev Number: 7 (DW_TAG_member)
    <92768>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9276c>   DW_AT_decl_file   : 6
    <9276c>   DW_AT_decl_line   : 341
    <9276e>   DW_AT_decl_column : 23
    <9276f>   DW_AT_type        : <0x9280f>
    <92773>   DW_AT_data_member_location: 8
 <2><92774>: Abbrev Number: 0
 <1><92775>: Abbrev Number: 12 (DW_TAG_const_type)
    <92776>   DW_AT_type        : <0x92748>
 <1><9277a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9277b>   DW_AT_byte_size   : 8
    <9277b>   DW_AT_type        : <0x92775>
 <1><9277f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92780>   DW_AT_byte_size   : 8
    <92780>   DW_AT_type        : <0x92784>
 <1><92784>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92785>   DW_AT_byte_size   : 8
    <92785>   DW_AT_type        : <0x92476>
 <1><92789>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9278a>   DW_AT_byte_size   : 8
    <9278a>   DW_AT_type        : <0x92064>
 <1><9278e>: Abbrev Number: 8 (DW_TAG_typedef)
    <9278f>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <92793>   DW_AT_decl_file   : 6
    <92794>   DW_AT_decl_line   : 176
    <92795>   DW_AT_decl_column : 3
    <92796>   DW_AT_type        : <0x92482>
 <1><9279a>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <9279b>   DW_AT_prototyped  : 1
    <9279b>   DW_AT_type        : <0x92003>
    <9279f>   DW_AT_sibling     : <0x927c2>
 <2><927a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927a4>   DW_AT_type        : <0x9201d>
 <2><927a8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927a9>   DW_AT_type        : <0x92003>
 <2><927ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927ae>   DW_AT_type        : <0x92003>
 <2><927b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927b3>   DW_AT_type        : <0x92003>
 <2><927b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927b8>   DW_AT_type        : <0x92003>
 <2><927bc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927bd>   DW_AT_type        : <0x92003>
 <2><927c1>: Abbrev Number: 0
 <1><927c2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <927c3>   DW_AT_byte_size   : 8
    <927c3>   DW_AT_type        : <0x9279a>
 <1><927c7>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <927c8>   DW_AT_prototyped  : 1
    <927c8>   DW_AT_sibling     : <0x927e1>
 <2><927cc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927cd>   DW_AT_type        : <0x92003>
 <2><927d1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927d2>   DW_AT_type        : <0x92003>
 <2><927d6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927d7>   DW_AT_type        : <0x92003>
 <2><927db>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927dc>   DW_AT_type        : <0x92003>
 <2><927e0>: Abbrev Number: 0
 <1><927e1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <927e2>   DW_AT_byte_size   : 8
    <927e2>   DW_AT_type        : <0x927c7>
 <1><927e6>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <927e7>   DW_AT_prototyped  : 1
    <927e7>   DW_AT_sibling     : <0x927f1>
 <2><927eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <927ec>   DW_AT_type        : <0x9201d>
 <2><927f0>: Abbrev Number: 0
 <1><927f1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <927f2>   DW_AT_byte_size   : 8
    <927f2>   DW_AT_type        : <0x927e6>
 <1><927f6>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <927f7>   DW_AT_prototyped  : 1
    <927f7>   DW_AT_type        : <0x92142>
    <927fb>   DW_AT_sibling     : <0x9280a>
 <2><927ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92800>   DW_AT_type        : <0x92003>
 <2><92804>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92805>   DW_AT_type        : <0x92142>
 <2><92809>: Abbrev Number: 0
 <1><9280a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9280b>   DW_AT_byte_size   : 8
    <9280b>   DW_AT_type        : <0x927f6>
 <1><9280f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92810>   DW_AT_byte_size   : 8
    <92810>   DW_AT_type        : <0x91fdb>
 <1><92814>: Abbrev Number: 27 (DW_TAG_variable)
    <92815>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <92819>   DW_AT_decl_file   : 6
    <92819>   DW_AT_decl_line   : 364
    <9281b>   DW_AT_decl_column : 15
    <9281c>   DW_AT_type        : <0x92820>
    <92820>   DW_AT_external    : 1
    <92820>   DW_AT_declaration : 1
 <1><92820>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92821>   DW_AT_byte_size   : 8
    <92821>   DW_AT_type        : <0x9278e>
 <1><92825>: Abbrev Number: 27 (DW_TAG_variable)
    <92826>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <9282a>   DW_AT_decl_file   : 6
    <9282a>   DW_AT_decl_line   : 369
    <9282c>   DW_AT_decl_column : 16
    <9282d>   DW_AT_type        : <0x92419>
    <92831>   DW_AT_external    : 1
    <92831>   DW_AT_declaration : 1
 <1><92831>: Abbrev Number: 37 (DW_TAG_subprogram)
    <92832>   DW_AT_external    : 1
    <92832>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <92836>   DW_AT_decl_file   : 6
    <92837>   DW_AT_decl_line   : 470
    <92839>   DW_AT_decl_column : 20
    <9283a>   DW_AT_prototyped  : 1
    <9283a>   DW_AT_declaration : 1
    <9283a>   DW_AT_sibling     : <0x92849>
 <2><9283e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9283f>   DW_AT_type        : <0x92003>
 <2><92843>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92844>   DW_AT_type        : <0x92003>
 <2><92848>: Abbrev Number: 0
 <1><92849>: Abbrev Number: 38 (DW_TAG_subprogram)
    <9284a>   DW_AT_external    : 1
    <9284a>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <9284e>   DW_AT_decl_file   : 6
    <9284f>   DW_AT_decl_line   : 469
    <92851>   DW_AT_decl_column : 20
    <92852>   DW_AT_prototyped  : 1
    <92852>   DW_AT_declaration : 1
 <1><92852>: Abbrev Number: 39 (DW_TAG_subprogram)
    <92853>   DW_AT_external    : 1
    <92853>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <92857>   DW_AT_decl_file   : 6
    <92858>   DW_AT_decl_line   : 396
    <9285a>   DW_AT_decl_column : 19
    <9285b>   DW_AT_prototyped  : 1
    <9285b>   DW_AT_type        : <0x9285f>
    <9285f>   DW_AT_declaration : 1
 <1><9285f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92860>   DW_AT_byte_size   : 8
    <92860>   DW_AT_type        : <0x92438>
 <1><92864>: Abbrev Number: 40 (DW_TAG_subprogram)
    <92865>   DW_AT_external    : 1
    <92865>   DW_AT_name        : (indirect string, offset: 0x17dac): fb_hGfxBox
    <92869>   DW_AT_decl_file   : 1
    <9286a>   DW_AT_decl_line   : 10
    <9286b>   DW_AT_decl_column : 6
    <9286c>   DW_AT_prototyped  : 1
    <9286c>   DW_AT_low_pc      : 0x463ee0
    <92874>   DW_AT_high_pc     : 0x597
    <9287c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9287e>   DW_AT_call_all_calls: 1
 <2><9287e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <9287f>   DW_AT_name        : x1
    <92882>   DW_AT_decl_file   : 1
    <92882>   DW_AT_decl_line   : 10
    <92882>   DW_AT_decl_column : 21
    <92883>   DW_AT_type        : <0x92003>
    <92887>   DW_AT_location    : 0x2b767 (location list)
    <9288b>   DW_AT_GNU_locviews: 0x2b74d
 <2><9288f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <92890>   DW_AT_name        : y1
    <92893>   DW_AT_decl_file   : 1
    <92893>   DW_AT_decl_line   : 10
    <92893>   DW_AT_decl_column : 29
    <92894>   DW_AT_type        : <0x92003>
    <92898>   DW_AT_location    : 0x2b7d1 (location list)
    <9289c>   DW_AT_GNU_locviews: 0x2b7cd
 <2><928a0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <928a1>   DW_AT_name        : x2
    <928a4>   DW_AT_decl_file   : 1
    <928a4>   DW_AT_decl_line   : 10
    <928a4>   DW_AT_decl_column : 37
    <928a5>   DW_AT_type        : <0x92003>
    <928a9>   DW_AT_location    : 0x2b7f9 (location list)
    <928ad>   DW_AT_GNU_locviews: 0x2b7df
 <2><928b1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <928b2>   DW_AT_name        : y2
    <928b5>   DW_AT_decl_file   : 1
    <928b5>   DW_AT_decl_line   : 10
    <928b5>   DW_AT_decl_column : 45
    <928b6>   DW_AT_type        : <0x92003>
    <928ba>   DW_AT_location    : 0x2b879 (location list)
    <928be>   DW_AT_GNU_locviews: 0x2b85f
 <2><928c2>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <928c3>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <928c7>   DW_AT_decl_file   : 1
    <928c7>   DW_AT_decl_line   : 10
    <928c7>   DW_AT_decl_column : 62
    <928c8>   DW_AT_type        : <0x91fe7>
    <928cc>   DW_AT_location    : 0x2b8f6 (location list)
    <928d0>   DW_AT_GNU_locviews: 0x2b8dc
 <2><928d4>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <928d5>   DW_AT_name        : (indirect string, offset: 0x19c7a): full
    <928d9>   DW_AT_decl_file   : 1
    <928d9>   DW_AT_decl_line   : 10
    <928d9>   DW_AT_decl_column : 73
    <928da>   DW_AT_type        : <0x92003>
    <928de>   DW_AT_location    : 0x2b96b (location list)
    <928e2>   DW_AT_GNU_locviews: 0x2b951
 <2><928e6>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <928e7>   DW_AT_name        : (indirect string, offset: 0x18eb7): style
    <928eb>   DW_AT_decl_file   : 1
    <928ec>   DW_AT_decl_line   : 10
    <928ed>   DW_AT_decl_column : 92
    <928ee>   DW_AT_type        : <0x91fe7>
    <928f2>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><928f5>: Abbrev Number: 11 (DW_TAG_variable)
    <928f6>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <928fa>   DW_AT_decl_file   : 1
    <928fa>   DW_AT_decl_line   : 12
    <928fb>   DW_AT_decl_column : 13
    <928fc>   DW_AT_type        : <0x9285f>
    <92900>   DW_AT_location    : 0x2b9e6 (location list)
    <92904>   DW_AT_GNU_locviews: 0x2b9d2
 <2><92908>: Abbrev Number: 11 (DW_TAG_variable)
    <92909>   DW_AT_name        : (indirect string, offset: 0x16c6a): dest
    <9290d>   DW_AT_decl_file   : 1
    <9290d>   DW_AT_decl_line   : 13
    <9290e>   DW_AT_decl_column : 17
    <9290f>   DW_AT_type        : <0x921d8>
    <92913>   DW_AT_location    : 0x2ba2a (location list)
    <92917>   DW_AT_GNU_locviews: 0x2ba28
 <2><9291b>: Abbrev Number: 18 (DW_TAG_variable)
    <9291c>   DW_AT_name        : rot
    <92920>   DW_AT_decl_file   : 1
    <92920>   DW_AT_decl_line   : 13
    <92921>   DW_AT_decl_column : 23
    <92922>   DW_AT_type        : <0x91fd4>
    <92926>   DW_AT_location    : 0x2ba4e (location list)
    <9292a>   DW_AT_GNU_locviews: 0x2ba32
 <2><9292e>: Abbrev Number: 11 (DW_TAG_variable)
    <9292f>   DW_AT_name        : (indirect string, offset: 0x19c7f): clipped_x1
    <92933>   DW_AT_decl_file   : 1
    <92933>   DW_AT_decl_line   : 14
    <92934>   DW_AT_decl_column : 6
    <92935>   DW_AT_type        : <0x92003>
    <92939>   DW_AT_location    : 0x2bb59 (location list)
    <9293d>   DW_AT_GNU_locviews: 0x2bb51
 <2><92941>: Abbrev Number: 11 (DW_TAG_variable)
    <92942>   DW_AT_name        : (indirect string, offset: 0x19c95): clipped_y1
    <92946>   DW_AT_decl_file   : 1
    <92946>   DW_AT_decl_line   : 14
    <92947>   DW_AT_decl_column : 18
    <92948>   DW_AT_type        : <0x92003>
    <9294c>   DW_AT_location    : 0x2bb7e (location list)
    <92950>   DW_AT_GNU_locviews: 0x2bb7c
 <2><92954>: Abbrev Number: 11 (DW_TAG_variable)
    <92955>   DW_AT_name        : (indirect string, offset: 0x19c8a): clipped_x2
    <92959>   DW_AT_decl_file   : 1
    <92959>   DW_AT_decl_line   : 14
    <9295a>   DW_AT_decl_column : 30
    <9295b>   DW_AT_type        : <0x92003>
    <9295f>   DW_AT_location    : 0x2bb90 (location list)
    <92963>   DW_AT_GNU_locviews: 0x2bb88
 <2><92967>: Abbrev Number: 11 (DW_TAG_variable)
    <92968>   DW_AT_name        : (indirect string, offset: 0x19ca0): clipped_y2
    <9296c>   DW_AT_decl_file   : 1
    <9296c>   DW_AT_decl_line   : 14
    <9296d>   DW_AT_decl_column : 42
    <9296e>   DW_AT_type        : <0x92003>
    <92972>   DW_AT_location    : 0x2bbb5 (location list)
    <92976>   DW_AT_GNU_locviews: 0x2bbb3
 <2><9297a>: Abbrev Number: 18 (DW_TAG_variable)
    <9297b>   DW_AT_name        : w
    <9297d>   DW_AT_decl_file   : 1
    <9297d>   DW_AT_decl_line   : 14
    <9297e>   DW_AT_decl_column : 54
    <9297f>   DW_AT_type        : <0x92003>
    <92983>   DW_AT_location    : 0x2bbd5 (location list)
    <92987>   DW_AT_GNU_locviews: 0x2bbbf
 <2><9298b>: Abbrev Number: 18 (DW_TAG_variable)
    <9298c>   DW_AT_name        : h
    <9298e>   DW_AT_decl_file   : 1
    <9298e>   DW_AT_decl_line   : 14
    <9298f>   DW_AT_decl_column : 57
    <92990>   DW_AT_type        : <0x92003>
    <92994>   DW_AT_location    : 0x2bc3f (location list)
    <92998>   DW_AT_GNU_locviews: 0x2bc27
 <2><9299c>: Abbrev Number: 18 (DW_TAG_variable)
    <9299d>   DW_AT_name        : bit
    <929a1>   DW_AT_decl_file   : 1
    <929a1>   DW_AT_decl_line   : 14
    <929a2>   DW_AT_decl_column : 60
    <929a3>   DW_AT_type        : <0x92003>
    <929a7>   DW_AT_location    : 0x2bcd2 (location list)
    <929ab>   DW_AT_GNU_locviews: 0x2bca0
 <2><929af>: Abbrev Number: 29 (DW_TAG_call_site)
    <929b0>   DW_AT_call_return_pc: 0x463f0c
    <929b8>   DW_AT_call_origin : <0x92852>
 <2><929bc>: Abbrev Number: 29 (DW_TAG_call_site)
    <929bd>   DW_AT_call_return_pc: 0x463f86
    <929c5>   DW_AT_call_origin : <0x92849>
 <2><929c9>: Abbrev Number: 10 (DW_TAG_call_site)
    <929ca>   DW_AT_call_return_pc: 0x463fcd
    <929d2>   DW_AT_sibling     : <0x929e9>
 <3><929d6>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <929d7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <929d9>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><929dc>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <929dd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <929df>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><929e2>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <929e3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <929e5>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><929e8>: Abbrev Number: 0
 <2><929e9>: Abbrev Number: 42 (DW_TAG_call_site)
    <929ea>   DW_AT_call_return_pc: 0x46400b
    <929f2>   DW_AT_call_tail_call: 1
    <929f2>   DW_AT_call_origin : <0x92831>
    <929f6>   DW_AT_sibling     : <0x92a05>
 <3><929fa>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <929fb>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <929fd>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><929ff>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a00>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92a02>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><92a04>: Abbrev Number: 0
 <2><92a05>: Abbrev Number: 10 (DW_TAG_call_site)
    <92a06>   DW_AT_call_return_pc: 0x4640a5
    <92a0e>   DW_AT_sibling     : <0x92a2b>
 <3><92a12>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a13>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <92a15>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><92a18>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a19>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92a1b>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><92a1e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a1f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92a21>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><92a24>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a25>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <92a27>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><92a2a>: Abbrev Number: 0
 <2><92a2b>: Abbrev Number: 10 (DW_TAG_call_site)
    <92a2c>   DW_AT_call_return_pc: 0x46414e
    <92a34>   DW_AT_sibling     : <0x92a54>
 <3><92a38>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a39>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <92a3b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><92a3e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a3f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92a41>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><92a44>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a45>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92a47>   DW_AT_call_value  : 5 byte block: 91 9c 7f 94 4 	(DW_OP_fbreg: -100; DW_OP_deref_size: 4)
 <3><92a4d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a4e>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <92a50>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><92a53>: Abbrev Number: 0
 <2><92a54>: Abbrev Number: 10 (DW_TAG_call_site)
    <92a55>   DW_AT_call_return_pc: 0x464237
    <92a5d>   DW_AT_sibling     : <0x92a7f>
 <3><92a61>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a62>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92a64>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><92a67>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a68>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92a6a>   DW_AT_call_value  : 19 byte block: 91 b0 7f 94 4 91 ac 7f 94 4 1c 23 1 8 20 24 8 20 26 	(DW_OP_fbreg: -80; DW_OP_deref_size: 4; DW_OP_fbreg: -84; DW_OP_deref_size: 4; DW_OP_minus; DW_OP_plus_uconst: 1; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <3><92a7e>: Abbrev Number: 0
 <2><92a7f>: Abbrev Number: 10 (DW_TAG_call_site)
    <92a80>   DW_AT_call_return_pc: 0x464271
    <92a88>   DW_AT_sibling     : <0x92a93>
 <3><92a8c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92a8d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92a8f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><92a92>: Abbrev Number: 0
 <2><92a93>: Abbrev Number: 10 (DW_TAG_call_site)
    <92a94>   DW_AT_call_return_pc: 0x4642c4
    <92a9c>   DW_AT_sibling     : <0x92ab9>
 <3><92aa0>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92aa1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <92aa3>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><92aa6>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92aa7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92aa9>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><92aac>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92aad>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92aaf>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><92ab2>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92ab3>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <92ab5>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><92ab8>: Abbrev Number: 0
 <2><92ab9>: Abbrev Number: 10 (DW_TAG_call_site)
    <92aba>   DW_AT_call_return_pc: 0x464364
    <92ac2>   DW_AT_sibling     : <0x92adf>
 <3><92ac6>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92ac7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <92ac9>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><92acc>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92acd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92acf>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><92ad2>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92ad3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92ad5>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><92ad8>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92ad9>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <92adb>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><92ade>: Abbrev Number: 0
 <2><92adf>: Abbrev Number: 43 (DW_TAG_call_site)
    <92ae0>   DW_AT_call_return_pc: 0x4643a8
 <3><92ae8>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92ae9>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <92aeb>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><92aed>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <92aee>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <92af0>   DW_AT_call_value  : 19 byte block: 91 a4 7f 94 4 91 a8 7f 94 4 1c 23 1 8 20 24 8 20 26 	(DW_OP_fbreg: -92; DW_OP_deref_size: 4; DW_OP_fbreg: -88; DW_OP_deref_size: 4; DW_OP_minus; DW_OP_plus_uconst: 1; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <3><92b04>: Abbrev Number: 0
 <2><92b05>: Abbrev Number: 0
 <1><92b06>: Abbrev Number: 0
  Compilation Unit @ offset 0x92b07:
   Length:        0xc20 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x6049
   Pointer Size:  8
 <0><92b13>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <92b14>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <92b18>   DW_AT_language    : 29	(C11)
    <92b19>   DW_AT_name        : (indirect line string, offset: 0x70c): src/gfxlib2/gfx_cls.c
    <92b1d>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <92b21>   DW_AT_low_pc      : 0x464480
    <92b29>   DW_AT_high_pc     : 0x286
    <92b31>   DW_AT_stmt_list   : 0x59bbc
 <1><92b35>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b36>   DW_AT_byte_size   : 1
    <92b37>   DW_AT_encoding    : 8	(unsigned char)
    <92b38>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><92b3c>: Abbrev Number: 12 (DW_TAG_const_type)
    <92b3d>   DW_AT_type        : <0x92b35>
 <1><92b41>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b42>   DW_AT_byte_size   : 2
    <92b43>   DW_AT_encoding    : 7	(unsigned)
    <92b44>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><92b48>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b49>   DW_AT_byte_size   : 4
    <92b4a>   DW_AT_encoding    : 7	(unsigned)
    <92b4b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><92b4f>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b50>   DW_AT_byte_size   : 8
    <92b51>   DW_AT_encoding    : 7	(unsigned)
    <92b52>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><92b56>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b57>   DW_AT_byte_size   : 1
    <92b58>   DW_AT_encoding    : 6	(signed char)
    <92b59>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><92b5d>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b5e>   DW_AT_byte_size   : 2
    <92b5f>   DW_AT_encoding    : 5	(signed)
    <92b60>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><92b64>: Abbrev Number: 32 (DW_TAG_base_type)
    <92b65>   DW_AT_byte_size   : 4
    <92b66>   DW_AT_encoding    : 5	(signed)
    <92b67>   DW_AT_name        : int
 <1><92b6b>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <92b6c>   DW_AT_type        : <0x92b64>
 <1><92b70>: Abbrev Number: 12 (DW_TAG_const_type)
    <92b71>   DW_AT_type        : <0x92b64>
 <1><92b75>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b76>   DW_AT_byte_size   : 8
    <92b77>   DW_AT_encoding    : 5	(signed)
    <92b78>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><92b7c>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <92b7d>   DW_AT_byte_size   : 8
 <1><92b7e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92b7f>   DW_AT_byte_size   : 8
    <92b7f>   DW_AT_type        : <0x92b83>
 <1><92b83>: Abbrev Number: 7 (DW_TAG_base_type)
    <92b84>   DW_AT_byte_size   : 1
    <92b85>   DW_AT_encoding    : 6	(signed char)
    <92b86>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><92b8a>: Abbrev Number: 9 (DW_TAG_typedef)
    <92b8b>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <92b8f>   DW_AT_decl_file   : 2
    <92b90>   DW_AT_decl_line   : 209
    <92b91>   DW_AT_decl_column : 23
    <92b92>   DW_AT_type        : <0x92b4f>
 <1><92b96>: Abbrev Number: 35 (DW_TAG_typedef)
    <92b97>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <92b9b>   DW_AT_decl_file   : 2
    <92b9c>   DW_AT_decl_line   : 321
    <92b9e>   DW_AT_decl_column : 24
    <92b9f>   DW_AT_type        : <0x92b64>
 <1><92ba3>: Abbrev Number: 7 (DW_TAG_base_type)
    <92ba4>   DW_AT_byte_size   : 8
    <92ba5>   DW_AT_encoding    : 5	(signed)
    <92ba6>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><92baa>: Abbrev Number: 7 (DW_TAG_base_type)
    <92bab>   DW_AT_byte_size   : 8
    <92bac>   DW_AT_encoding    : 7	(unsigned)
    <92bad>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><92bb1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92bb2>   DW_AT_byte_size   : 8
    <92bb2>   DW_AT_type        : <0x92bb6>
 <1><92bb6>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <92bb7>   DW_AT_prototyped  : 1
 <1><92bb7>: Abbrev Number: 7 (DW_TAG_base_type)
    <92bb8>   DW_AT_byte_size   : 8
    <92bb9>   DW_AT_encoding    : 4	(float)
    <92bba>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><92bbe>: Abbrev Number: 7 (DW_TAG_base_type)
    <92bbf>   DW_AT_byte_size   : 4
    <92bc0>   DW_AT_encoding    : 4	(float)
    <92bc1>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><92bc5>: Abbrev Number: 9 (DW_TAG_typedef)
    <92bc6>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <92bca>   DW_AT_decl_file   : 3
    <92bcb>   DW_AT_decl_line   : 7
    <92bcc>   DW_AT_decl_column : 25
    <92bcd>   DW_AT_type        : <0x92bd1>
 <1><92bd1>: Abbrev Number: 37 (DW_TAG_structure_type)
    <92bd2>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <92bd6>   DW_AT_declaration : 1
 <1><92bd6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92bd7>   DW_AT_byte_size   : 8
    <92bd8>   DW_AT_decl_file   : 4
    <92bd9>   DW_AT_decl_line   : 4
    <92bda>   DW_AT_decl_column : 3
    <92bda>   DW_AT_sibling     : <0x92bf9>
 <2><92bde>: Abbrev Number: 1 (DW_TAG_member)
    <92bdf>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <92be3>   DW_AT_decl_file   : 4
    <92be4>   DW_AT_decl_line   : 5
    <92be5>   DW_AT_decl_column : 8
    <92be6>   DW_AT_type        : <0x92b64>
    <92bea>   DW_AT_data_member_location: 0
 <2><92beb>: Abbrev Number: 1 (DW_TAG_member)
    <92bec>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <92bf0>   DW_AT_decl_file   : 4
    <92bf1>   DW_AT_decl_line   : 6
    <92bf2>   DW_AT_decl_column : 8
    <92bf3>   DW_AT_type        : <0x92b64>
    <92bf7>   DW_AT_data_member_location: 4
 <2><92bf8>: Abbrev Number: 0
 <1><92bf9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92bfa>   DW_AT_byte_size   : 16
    <92bfb>   DW_AT_decl_file   : 4
    <92bfc>   DW_AT_decl_line   : 8
    <92bfd>   DW_AT_decl_column : 3
    <92bfd>   DW_AT_sibling     : <0x92c30>
 <2><92c01>: Abbrev Number: 6 (DW_TAG_member)
    <92c02>   DW_AT_name        : x
    <92c04>   DW_AT_decl_file   : 4
    <92c05>   DW_AT_decl_line   : 9
    <92c06>   DW_AT_decl_column : 8
    <92c07>   DW_AT_type        : <0x92b64>
    <92c0b>   DW_AT_data_member_location: 0
 <2><92c0c>: Abbrev Number: 6 (DW_TAG_member)
    <92c0d>   DW_AT_name        : y
    <92c0f>   DW_AT_decl_file   : 4
    <92c10>   DW_AT_decl_line   : 9
    <92c11>   DW_AT_decl_column : 11
    <92c12>   DW_AT_type        : <0x92b64>
    <92c16>   DW_AT_data_member_location: 4
 <2><92c17>: Abbrev Number: 6 (DW_TAG_member)
    <92c18>   DW_AT_name        : dx
    <92c1b>   DW_AT_decl_file   : 4
    <92c1c>   DW_AT_decl_line   : 10
    <92c1d>   DW_AT_decl_column : 8
    <92c1e>   DW_AT_type        : <0x92b64>
    <92c22>   DW_AT_data_member_location: 8
 <2><92c23>: Abbrev Number: 6 (DW_TAG_member)
    <92c24>   DW_AT_name        : dy
    <92c27>   DW_AT_decl_file   : 4
    <92c28>   DW_AT_decl_line   : 10
    <92c29>   DW_AT_decl_column : 12
    <92c2a>   DW_AT_type        : <0x92b64>
    <92c2e>   DW_AT_data_member_location: 12
 <2><92c2f>: Abbrev Number: 0
 <1><92c30>: Abbrev Number: 19 (DW_TAG_union_type)
    <92c31>   DW_AT_byte_size   : 16
    <92c31>   DW_AT_decl_file   : 4
    <92c32>   DW_AT_decl_line   : 3
    <92c33>   DW_AT_decl_column : 2
    <92c33>   DW_AT_sibling     : <0x92c5d>
 <2><92c37>: Abbrev Number: 15 (DW_TAG_member)
    <92c38>   DW_AT_type        : <0x92bd6>
 <2><92c3c>: Abbrev Number: 15 (DW_TAG_member)
    <92c3d>   DW_AT_type        : <0x92bf9>
 <2><92c41>: Abbrev Number: 20 (DW_TAG_member)
    <92c42>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <92c46>   DW_AT_decl_file   : 4
    <92c47>   DW_AT_decl_line   : 12
    <92c48>   DW_AT_decl_column : 7
    <92c48>   DW_AT_type        : <0x92b64>
 <2><92c4c>: Abbrev Number: 23 (DW_TAG_member)
    <92c4d>   DW_AT_name        : z
    <92c4f>   DW_AT_decl_file   : 4
    <92c4f>   DW_AT_decl_line   : 13
    <92c50>   DW_AT_decl_column : 7
    <92c50>   DW_AT_type        : <0x92b64>
 <2><92c54>: Abbrev Number: 23 (DW_TAG_member)
    <92c55>   DW_AT_name        : w
    <92c57>   DW_AT_decl_file   : 4
    <92c57>   DW_AT_decl_line   : 14
    <92c58>   DW_AT_decl_column : 7
    <92c58>   DW_AT_type        : <0x92b64>
 <2><92c5c>: Abbrev Number: 0
 <1><92c5d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <92c5e>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <92c62>   DW_AT_byte_size   : 20
    <92c63>   DW_AT_decl_file   : 4
    <92c64>   DW_AT_decl_line   : 1
    <92c65>   DW_AT_decl_column : 8
    <92c66>   DW_AT_sibling     : <0x92c7e>
 <2><92c6a>: Abbrev Number: 1 (DW_TAG_member)
    <92c6b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <92c6f>   DW_AT_decl_file   : 4
    <92c70>   DW_AT_decl_line   : 2
    <92c71>   DW_AT_decl_column : 6
    <92c72>   DW_AT_type        : <0x92b64>
    <92c76>   DW_AT_data_member_location: 0
 <2><92c77>: Abbrev Number: 21 (DW_TAG_member)
    <92c78>   DW_AT_type        : <0x92c30>
    <92c7c>   DW_AT_data_member_location: 4
 <2><92c7d>: Abbrev Number: 0
 <1><92c7e>: Abbrev Number: 9 (DW_TAG_typedef)
    <92c7f>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <92c83>   DW_AT_decl_file   : 4
    <92c84>   DW_AT_decl_line   : 18
    <92c85>   DW_AT_decl_column : 23
    <92c86>   DW_AT_type        : <0x92c5d>
 <1><92c8a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92c8b>   DW_AT_byte_size   : 8
    <92c8b>   DW_AT_type        : <0x92c8f>
 <1><92c8f>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <92c90>   DW_AT_prototyped  : 1
    <92c90>   DW_AT_type        : <0x92b64>
    <92c94>   DW_AT_sibling     : <0x92ca3>
 <2><92c98>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92c99>   DW_AT_type        : <0x92b64>
 <2><92c9d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92c9e>   DW_AT_type        : <0x92b64>
 <2><92ca2>: Abbrev Number: 0
 <1><92ca3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92ca4>   DW_AT_byte_size   : 8
    <92ca4>   DW_AT_type        : <0x92b64>
 <1><92ca8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92ca9>   DW_AT_byte_size   : 8
    <92ca9>   DW_AT_type        : <0x92cad>
 <1><92cad>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <92cae>   DW_AT_prototyped  : 1
    <92cae>   DW_AT_type        : <0x92b64>
    <92cb2>   DW_AT_sibling     : <0x92cd0>
 <2><92cb6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cb7>   DW_AT_type        : <0x92ca3>
 <2><92cbb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cbc>   DW_AT_type        : <0x92ca3>
 <2><92cc0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cc1>   DW_AT_type        : <0x92ca3>
 <2><92cc5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cc6>   DW_AT_type        : <0x92ca3>
 <2><92cca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92ccb>   DW_AT_type        : <0x92ca3>
 <2><92ccf>: Abbrev Number: 0
 <1><92cd0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92cd1>   DW_AT_byte_size   : 8
    <92cd1>   DW_AT_type        : <0x92c7e>
 <1><92cd5>: Abbrev Number: 9 (DW_TAG_typedef)
    <92cd6>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <92cda>   DW_AT_decl_file   : 5
    <92cdb>   DW_AT_decl_line   : 13
    <92cdc>   DW_AT_decl_column : 30
    <92cdd>   DW_AT_type        : <0x92ce1>
 <1><92ce1>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <92ce2>   DW_AT_prototyped  : 1
    <92ce2>   DW_AT_type        : <0x92b48>
    <92ce6>   DW_AT_sibling     : <0x92cfa>
 <2><92cea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92ceb>   DW_AT_type        : <0x92b48>
 <2><92cef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cf0>   DW_AT_type        : <0x92b48>
 <2><92cf4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92cf5>   DW_AT_type        : <0x92b7c>
 <2><92cf9>: Abbrev Number: 0
 <1><92cfa>: Abbrev Number: 9 (DW_TAG_typedef)
    <92cfb>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <92cff>   DW_AT_decl_file   : 5
    <92d00>   DW_AT_decl_line   : 14
    <92d01>   DW_AT_decl_column : 15
    <92d02>   DW_AT_type        : <0x92d06>
 <1><92d06>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <92d07>   DW_AT_prototyped  : 1
    <92d07>   DW_AT_sibling     : <0x92d39>
 <2><92d0b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d0c>   DW_AT_type        : <0x92d39>
 <2><92d10>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d11>   DW_AT_type        : <0x92d39>
 <2><92d15>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d16>   DW_AT_type        : <0x92b64>
 <2><92d1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d1b>   DW_AT_type        : <0x92b64>
 <2><92d1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d20>   DW_AT_type        : <0x92b64>
 <2><92d24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d25>   DW_AT_type        : <0x92b64>
 <2><92d29>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d2a>   DW_AT_type        : <0x92b64>
 <2><92d2e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d2f>   DW_AT_type        : <0x92d3e>
 <2><92d33>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92d34>   DW_AT_type        : <0x92b7c>
 <2><92d38>: Abbrev Number: 0
 <1><92d39>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92d3a>   DW_AT_byte_size   : 8
    <92d3a>   DW_AT_type        : <0x92b35>
 <1><92d3e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92d3f>   DW_AT_byte_size   : 8
    <92d3f>   DW_AT_type        : <0x92cd5>
 <1><92d43>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92d44>   DW_AT_byte_size   : 16
    <92d45>   DW_AT_decl_file   : 5
    <92d46>   DW_AT_decl_line   : 26
    <92d47>   DW_AT_decl_column : 3
    <92d47>   DW_AT_sibling     : <0x92d80>
 <2><92d4b>: Abbrev Number: 1 (DW_TAG_member)
    <92d4c>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <92d50>   DW_AT_decl_file   : 5
    <92d51>   DW_AT_decl_line   : 27
    <92d52>   DW_AT_decl_column : 8
    <92d53>   DW_AT_type        : <0x92b64>
    <92d57>   DW_AT_data_member_location: 0
 <2><92d58>: Abbrev Number: 1 (DW_TAG_member)
    <92d59>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <92d5d>   DW_AT_decl_file   : 5
    <92d5e>   DW_AT_decl_line   : 27
    <92d5f>   DW_AT_decl_column : 16
    <92d60>   DW_AT_type        : <0x92b64>
    <92d64>   DW_AT_data_member_location: 4
 <2><92d65>: Abbrev Number: 1 (DW_TAG_member)
    <92d66>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <92d6a>   DW_AT_decl_file   : 5
    <92d6b>   DW_AT_decl_line   : 27
    <92d6c>   DW_AT_decl_column : 24
    <92d6d>   DW_AT_type        : <0x92b64>
    <92d71>   DW_AT_data_member_location: 8
 <2><92d72>: Abbrev Number: 1 (DW_TAG_member)
    <92d73>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <92d77>   DW_AT_decl_file   : 5
    <92d78>   DW_AT_decl_line   : 27
    <92d79>   DW_AT_decl_column : 32
    <92d7a>   DW_AT_type        : <0x92b64>
    <92d7e>   DW_AT_data_member_location: 12
 <2><92d7f>: Abbrev Number: 0
 <1><92d80>: Abbrev Number: 19 (DW_TAG_union_type)
    <92d81>   DW_AT_byte_size   : 16
    <92d81>   DW_AT_decl_file   : 5
    <92d82>   DW_AT_decl_line   : 25
    <92d83>   DW_AT_decl_column : 2
    <92d83>   DW_AT_sibling     : <0x92d98>
 <2><92d87>: Abbrev Number: 15 (DW_TAG_member)
    <92d88>   DW_AT_type        : <0x92d43>
 <2><92d8c>: Abbrev Number: 20 (DW_TAG_member)
    <92d8d>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <92d91>   DW_AT_decl_file   : 5
    <92d92>   DW_AT_decl_line   : 29
    <92d93>   DW_AT_decl_column : 7
    <92d93>   DW_AT_type        : <0x92d98>
 <2><92d97>: Abbrev Number: 0
 <1><92d98>: Abbrev Number: 24 (DW_TAG_array_type)
    <92d99>   DW_AT_type        : <0x92b64>
    <92d9d>   DW_AT_sibling     : <0x92da8>
 <2><92da1>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <92da2>   DW_AT_type        : <0x92b4f>
    <92da6>   DW_AT_upper_bound : 3
 <2><92da7>: Abbrev Number: 0
 <1><92da8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <92da9>   DW_AT_byte_size   : 16
    <92daa>   DW_AT_decl_file   : 5
    <92dab>   DW_AT_decl_line   : 32
    <92dac>   DW_AT_decl_column : 3
    <92dac>   DW_AT_sibling     : <0x92de5>
 <2><92db0>: Abbrev Number: 1 (DW_TAG_member)
    <92db1>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <92db5>   DW_AT_decl_file   : 5
    <92db6>   DW_AT_decl_line   : 33
    <92db7>   DW_AT_decl_column : 8
    <92db8>   DW_AT_type        : <0x92b64>
    <92dbc>   DW_AT_data_member_location: 0
 <2><92dbd>: Abbrev Number: 1 (DW_TAG_member)
    <92dbe>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <92dc2>   DW_AT_decl_file   : 5
    <92dc3>   DW_AT_decl_line   : 33
    <92dc4>   DW_AT_decl_column : 20
    <92dc5>   DW_AT_type        : <0x92b64>
    <92dc9>   DW_AT_data_member_location: 4
 <2><92dca>: Abbrev Number: 1 (DW_TAG_member)
    <92dcb>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <92dcf>   DW_AT_decl_file   : 5
    <92dd0>   DW_AT_decl_line   : 33
    <92dd1>   DW_AT_decl_column : 32
    <92dd2>   DW_AT_type        : <0x92b64>
    <92dd6>   DW_AT_data_member_location: 8
 <2><92dd7>: Abbrev Number: 1 (DW_TAG_member)
    <92dd8>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <92ddc>   DW_AT_decl_file   : 5
    <92ddd>   DW_AT_decl_line   : 33
    <92dde>   DW_AT_decl_column : 44
    <92ddf>   DW_AT_type        : <0x92b64>
    <92de3>   DW_AT_data_member_location: 12
 <2><92de4>: Abbrev Number: 0
 <1><92de5>: Abbrev Number: 19 (DW_TAG_union_type)
    <92de6>   DW_AT_byte_size   : 16
    <92de6>   DW_AT_decl_file   : 5
    <92de7>   DW_AT_decl_line   : 31
    <92de8>   DW_AT_decl_column : 2
    <92de8>   DW_AT_sibling     : <0x92dfd>
 <2><92dec>: Abbrev Number: 15 (DW_TAG_member)
    <92ded>   DW_AT_type        : <0x92da8>
 <2><92df1>: Abbrev Number: 20 (DW_TAG_member)
    <92df2>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <92df6>   DW_AT_decl_file   : 5
    <92df7>   DW_AT_decl_line   : 35
    <92df8>   DW_AT_decl_column : 7
    <92df8>   DW_AT_type        : <0x92d98>
 <2><92dfc>: Abbrev Number: 0
 <1><92dfd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <92dfe>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <92e02>   DW_AT_byte_size   : 216
    <92e03>   DW_AT_decl_file   : 5
    <92e04>   DW_AT_decl_line   : 16
    <92e05>   DW_AT_decl_column : 16
    <92e06>   DW_AT_sibling     : <0x92f1a>
 <2><92e0a>: Abbrev Number: 6 (DW_TAG_member)
    <92e0b>   DW_AT_name        : id
    <92e0e>   DW_AT_decl_file   : 5
    <92e0f>   DW_AT_decl_line   : 17
    <92e10>   DW_AT_decl_column : 6
    <92e11>   DW_AT_type        : <0x92b64>
    <92e15>   DW_AT_data_member_location: 0
 <2><92e16>: Abbrev Number: 1 (DW_TAG_member)
    <92e17>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <92e1b>   DW_AT_decl_file   : 5
    <92e1c>   DW_AT_decl_line   : 18
    <92e1d>   DW_AT_decl_column : 6
    <92e1e>   DW_AT_type        : <0x92b64>
    <92e22>   DW_AT_data_member_location: 4
 <2><92e23>: Abbrev Number: 1 (DW_TAG_member)
    <92e24>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <92e28>   DW_AT_decl_file   : 5
    <92e29>   DW_AT_decl_line   : 19
    <92e2a>   DW_AT_decl_column : 18
    <92e2b>   DW_AT_type        : <0x92f1a>
    <92e2f>   DW_AT_data_member_location: 8
 <2><92e30>: Abbrev Number: 1 (DW_TAG_member)
    <92e31>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <92e35>   DW_AT_decl_file   : 5
    <92e36>   DW_AT_decl_line   : 20
    <92e37>   DW_AT_decl_column : 6
    <92e38>   DW_AT_type        : <0x92b64>
    <92e3c>   DW_AT_data_member_location: 16
 <2><92e3d>: Abbrev Number: 1 (DW_TAG_member)
    <92e3e>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <92e42>   DW_AT_decl_file   : 5
    <92e43>   DW_AT_decl_line   : 21
    <92e44>   DW_AT_decl_column : 6
    <92e45>   DW_AT_type        : <0x92b64>
    <92e49>   DW_AT_data_member_location: 20
 <2><92e4a>: Abbrev Number: 1 (DW_TAG_member)
    <92e4b>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <92e4f>   DW_AT_decl_file   : 5
    <92e50>   DW_AT_decl_line   : 22
    <92e51>   DW_AT_decl_column : 6
    <92e52>   DW_AT_type        : <0x92b64>
    <92e56>   DW_AT_data_member_location: 24
 <2><92e57>: Abbrev Number: 1 (DW_TAG_member)
    <92e58>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <92e5c>   DW_AT_decl_file   : 5
    <92e5d>   DW_AT_decl_line   : 23
    <92e5e>   DW_AT_decl_column : 8
    <92e5f>   DW_AT_type        : <0x92b7c>
    <92e63>   DW_AT_data_member_location: 32
 <2><92e64>: Abbrev Number: 1 (DW_TAG_member)
    <92e65>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <92e69>   DW_AT_decl_file   : 5
    <92e6a>   DW_AT_decl_line   : 24
    <92e6b>   DW_AT_decl_column : 8
    <92e6c>   DW_AT_type        : <0x92bbe>
    <92e70>   DW_AT_data_member_location: 40
 <2><92e71>: Abbrev Number: 1 (DW_TAG_member)
    <92e72>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <92e76>   DW_AT_decl_file   : 5
    <92e77>   DW_AT_decl_line   : 24
    <92e78>   DW_AT_decl_column : 16
    <92e79>   DW_AT_type        : <0x92bbe>
    <92e7d>   DW_AT_data_member_location: 44
 <2><92e7e>: Abbrev Number: 21 (DW_TAG_member)
    <92e7f>   DW_AT_type        : <0x92d80>
    <92e83>   DW_AT_data_member_location: 48
 <2><92e84>: Abbrev Number: 21 (DW_TAG_member)
    <92e85>   DW_AT_type        : <0x92de5>
    <92e89>   DW_AT_data_member_location: 64
 <2><92e8a>: Abbrev Number: 1 (DW_TAG_member)
    <92e8b>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <92e8f>   DW_AT_decl_file   : 5
    <92e90>   DW_AT_decl_line   : 37
    <92e91>   DW_AT_decl_column : 8
    <92e92>   DW_AT_type        : <0x92bbe>
    <92e96>   DW_AT_data_member_location: 80
 <2><92e97>: Abbrev Number: 1 (DW_TAG_member)
    <92e98>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <92e9c>   DW_AT_decl_file   : 5
    <92e9d>   DW_AT_decl_line   : 37
    <92e9e>   DW_AT_decl_column : 15
    <92e9f>   DW_AT_type        : <0x92bbe>
    <92ea3>   DW_AT_data_member_location: 84
 <2><92ea4>: Abbrev Number: 1 (DW_TAG_member)
    <92ea5>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <92ea9>   DW_AT_decl_file   : 5
    <92eaa>   DW_AT_decl_line   : 37
    <92eab>   DW_AT_decl_column : 22
    <92eac>   DW_AT_type        : <0x92bbe>
    <92eb0>   DW_AT_data_member_location: 88
 <2><92eb1>: Abbrev Number: 1 (DW_TAG_member)
    <92eb2>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <92eb6>   DW_AT_decl_file   : 5
    <92eb7>   DW_AT_decl_line   : 37
    <92eb8>   DW_AT_decl_column : 29
    <92eb9>   DW_AT_type        : <0x92bbe>
    <92ebd>   DW_AT_data_member_location: 92
 <2><92ebe>: Abbrev Number: 1 (DW_TAG_member)
    <92ebf>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <92ec3>   DW_AT_decl_file   : 5
    <92ec4>   DW_AT_decl_line   : 38
    <92ec5>   DW_AT_decl_column : 15
    <92ec6>   DW_AT_type        : <0x92b48>
    <92eca>   DW_AT_data_member_location: 96
 <2><92ecb>: Abbrev Number: 1 (DW_TAG_member)
    <92ecc>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <92ed0>   DW_AT_decl_file   : 5
    <92ed1>   DW_AT_decl_line   : 38
    <92ed2>   DW_AT_decl_column : 25
    <92ed3>   DW_AT_type        : <0x92b48>
    <92ed7>   DW_AT_data_member_location: 100
 <2><92ed8>: Abbrev Number: 1 (DW_TAG_member)
    <92ed9>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <92edd>   DW_AT_decl_file   : 5
    <92ede>   DW_AT_decl_line   : 39
    <92edf>   DW_AT_decl_column : 9
    <92ee0>   DW_AT_type        : <0x92f3e>
    <92ee4>   DW_AT_data_member_location: 104
 <2><92ee5>: Abbrev Number: 1 (DW_TAG_member)
    <92ee6>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <92eea>   DW_AT_decl_file   : 5
    <92eeb>   DW_AT_decl_line   : 40
    <92eec>   DW_AT_decl_column : 17
    <92eed>   DW_AT_type        : <0x92f5c>
    <92ef1>   DW_AT_data_member_location: 112
 <2><92ef2>: Abbrev Number: 1 (DW_TAG_member)
    <92ef3>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <92ef7>   DW_AT_decl_file   : 5
    <92ef8>   DW_AT_decl_line   : 41
    <92ef9>   DW_AT_decl_column : 10
    <92efa>   DW_AT_type        : <0x92f7a>
    <92efe>   DW_AT_data_member_location: 120
 <2><92eff>: Abbrev Number: 1 (DW_TAG_member)
    <92f00>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <92f04>   DW_AT_decl_file   : 5
    <92f05>   DW_AT_decl_line   : 42
    <92f06>   DW_AT_decl_column : 11
    <92f07>   DW_AT_type        : <0x92f7f>
    <92f0b>   DW_AT_data_member_location: 128
 <2><92f0c>: Abbrev Number: 1 (DW_TAG_member)
    <92f0d>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <92f11>   DW_AT_decl_file   : 5
    <92f12>   DW_AT_decl_line   : 43
    <92f13>   DW_AT_decl_column : 6
    <92f14>   DW_AT_type        : <0x92b64>
    <92f18>   DW_AT_data_member_location: 208
 <2><92f19>: Abbrev Number: 0
 <1><92f1a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f1b>   DW_AT_byte_size   : 8
    <92f1b>   DW_AT_type        : <0x92d39>
 <1><92f1f>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <92f20>   DW_AT_prototyped  : 1
    <92f20>   DW_AT_sibling     : <0x92f39>
 <2><92f24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f25>   DW_AT_type        : <0x92f39>
 <2><92f29>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f2a>   DW_AT_type        : <0x92b64>
 <2><92f2e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f2f>   DW_AT_type        : <0x92b64>
 <2><92f33>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f34>   DW_AT_type        : <0x92b48>
 <2><92f38>: Abbrev Number: 0
 <1><92f39>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f3a>   DW_AT_byte_size   : 8
    <92f3a>   DW_AT_type        : <0x92dfd>
 <1><92f3e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f3f>   DW_AT_byte_size   : 8
    <92f3f>   DW_AT_type        : <0x92f1f>
 <1><92f43>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <92f44>   DW_AT_prototyped  : 1
    <92f44>   DW_AT_type        : <0x92b48>
    <92f48>   DW_AT_sibling     : <0x92f5c>
 <2><92f4c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f4d>   DW_AT_type        : <0x92f39>
 <2><92f51>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f52>   DW_AT_type        : <0x92b64>
 <2><92f56>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f57>   DW_AT_type        : <0x92b64>
 <2><92f5b>: Abbrev Number: 0
 <1><92f5c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f5d>   DW_AT_byte_size   : 8
    <92f5d>   DW_AT_type        : <0x92f43>
 <1><92f61>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <92f62>   DW_AT_prototyped  : 1
    <92f62>   DW_AT_type        : <0x92b7c>
    <92f66>   DW_AT_sibling     : <0x92f7a>
 <2><92f6a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f6b>   DW_AT_type        : <0x92b7c>
 <2><92f6f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f70>   DW_AT_type        : <0x92b64>
 <2><92f74>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <92f75>   DW_AT_type        : <0x92b8a>
 <2><92f79>: Abbrev Number: 0
 <1><92f7a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f7b>   DW_AT_byte_size   : 8
    <92f7b>   DW_AT_type        : <0x92f61>
 <1><92f7f>: Abbrev Number: 24 (DW_TAG_array_type)
    <92f80>   DW_AT_type        : <0x92f8f>
    <92f84>   DW_AT_sibling     : <0x92f8f>
 <2><92f88>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <92f89>   DW_AT_type        : <0x92b4f>
    <92f8d>   DW_AT_upper_bound : 9
 <2><92f8e>: Abbrev Number: 0
 <1><92f8f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f90>   DW_AT_byte_size   : 8
    <92f90>   DW_AT_type        : <0x92f94>
 <1><92f94>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92f95>   DW_AT_byte_size   : 8
    <92f95>   DW_AT_type        : <0x92cfa>
 <1><92f99>: Abbrev Number: 9 (DW_TAG_typedef)
    <92f9a>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <92f9e>   DW_AT_decl_file   : 5
    <92f9f>   DW_AT_decl_line   : 44
    <92fa0>   DW_AT_decl_column : 3
    <92fa1>   DW_AT_type        : <0x92dfd>
 <1><92fa5>: Abbrev Number: 13 (DW_TAG_structure_type)
