 <5><ef5aa>: Abbrev Number: 0
 <4><ef5ab>: Abbrev Number: 6 (DW_TAG_call_site)
    <ef5ac>   DW_AT_call_return_pc: 0x47a289
    <ef5b4>   DW_AT_call_origin : <0xee006>
 <4><ef5b8>: Abbrev Number: 0
 <3><ef5b9>: Abbrev Number: 0
 <2><ef5ba>: Abbrev Number: 4 (DW_TAG_call_site)
    <ef5bb>   DW_AT_call_return_pc: 0x479fa6
    <ef5c3>   DW_AT_call_origin : <0xedef4>
    <ef5c7>   DW_AT_sibling     : <0xef5d6>
 <3><ef5cb>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ef5cc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ef5ce>   DW_AT_call_value  : 1 byte block: 46 	(DW_OP_lit22)
 <3><ef5d0>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ef5d1>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ef5d3>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><ef5d5>: Abbrev Number: 0
 <2><ef5d6>: Abbrev Number: 4 (DW_TAG_call_site)
    <ef5d7>   DW_AT_call_return_pc: 0x47a0e4
    <ef5df>   DW_AT_call_origin : <0xedf2f>
    <ef5e3>   DW_AT_sibling     : <0xef5ff>
 <3><ef5e7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ef5e8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ef5ea>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><ef5ec>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ef5ed>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ef5ef>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><ef5f1>: Abbrev Number: 1 (DW_TAG_call_site_parameter)

 <1><efa8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <efa8e>   DW_AT_byte_size   : 1
    <efa8f>   DW_AT_encoding    : 8	(unsigned char)
    <efa90>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><efa94>: Abbrev Number: 6 (DW_TAG_base_type)
    <efa95>   DW_AT_byte_size   : 2
    <efa96>   DW_AT_encoding    : 7	(unsigned)
    <efa97>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><efa9b>: Abbrev Number: 6 (DW_TAG_base_type)
    <efa9c>   DW_AT_byte_size   : 4
    <efa9d>   DW_AT_encoding    : 7	(unsigned)
    <efa9e>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><efaa2>: Abbrev Number: 6 (DW_TAG_base_type)
    <efaa3>   DW_AT_byte_size   : 8
    <efaa4>   DW_AT_encoding    : 7	(unsigned)
    <efaa5>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><efaa9>: Abbrev Number: 6 (DW_TAG_base_type)
    <efaaa>   DW_AT_byte_size   : 1
    <efaab>   DW_AT_encoding    : 6	(signed char)
    <efaac>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><efab0>: Abbrev Number: 6 (DW_TAG_base_type)
    <efab1>   DW_AT_byte_size   : 2
    <efab2>   DW_AT_encoding    : 5	(signed)
    <efab3>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><efab7>: Abbrev Number: 23 (DW_TAG_base_type)
    <efab8>   DW_AT_byte_size   : 4
    <efab9>   DW_AT_encoding    : 5	(signed)
    <efaba>   DW_AT_name        : int
 <1><efabe>: Abbrev Number: 6 (DW_TAG_base_type)
    <efabf>   DW_AT_byte_size   : 8
    <efac0>   DW_AT_encoding    : 5	(signed)
    <efac1>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><efac5>: Abbrev Number: 3 (DW_TAG_typedef)
    <efac6>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <efaca>   DW_AT_decl_file   : 2
    <efacb>   DW_AT_decl_line   : 153
    <efacc>   DW_AT_decl_column : 27
    <efacd>   DW_AT_type        : <0xefabe>
 <1><efad1>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <efad2>   DW_AT_byte_size   : 8
 <1><efad3>: Abbrev Number: 3 (DW_TAG_typedef)
    <efad4>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <efad8>   DW_AT_decl_file   : 2
    <efad9>   DW_AT_decl_line   : 194
    <efada>   DW_AT_decl_column : 27
    <efadb>   DW_AT_type        : <0xefabe>
 <1><efadf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efae0>   DW_AT_byte_size   : 8
    <efae0>   DW_AT_type        : <0xefae4>
 <1><efae4>: Abbrev Number: 6 (DW_TAG_base_type)
    <efae5>   DW_AT_byte_size   : 1
    <efae6>   DW_AT_encoding    : 6	(signed char)
    <efae7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><efaeb>: Abbrev Number: 3 (DW_TAG_typedef)
    <efaec>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <efaf0>   DW_AT_decl_file   : 3
    <efaf1>   DW_AT_decl_line   : 209
    <efaf2>   DW_AT_decl_column : 23
    <efaf3>   DW_AT_type        : <0xefaa2>
 <1><efaf7>: Abbrev Number: 15 (DW_TAG_typedef)
    <efaf8>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <efafc>   DW_AT_decl_file   : 3
    <efafd>   DW_AT_decl_line   : 321
    <efaff>   DW_AT_decl_column : 24
    <efb00>   DW_AT_type        : <0xefab7>
 <1><efb04>: Abbrev Number: 25 (DW_TAG_const_type)
    <efb05>   DW_AT_type        : <0xefaf7>
 <1><efb09>: Abbrev Number: 6 (DW_TAG_base_type)
    <efb0a>   DW_AT_byte_size   : 8
    <efb0b>   DW_AT_encoding    : 5	(signed)
    <efb0c>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><efb10>: Abbrev Number: 3 (DW_TAG_typedef)
    <efb11>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <efb15>   DW_AT_decl_file   : 4
    <efb16>   DW_AT_decl_line   : 87
    <efb17>   DW_AT_decl_column : 19
    <efb18>   DW_AT_type        : <0xefac5>
 <1><efb1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <efb1d>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <efb21>   DW_AT_decl_file   : 4
    <efb22>   DW_AT_decl_line   : 108
    <efb23>   DW_AT_decl_column : 19
    <efb24>   DW_AT_type        : <0xefad3>
 <1><efb28>: Abbrev Number: 6 (DW_TAG_base_type)
    <efb29>   DW_AT_byte_size   : 8
    <efb2a>   DW_AT_encoding    : 7	(unsigned)
    <efb2b>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><efb2f>: Abbrev Number: 16 (DW_TAG_array_type)
    <efb30>   DW_AT_type        : <0xefae4>
    <efb34>   DW_AT_sibling     : <0xefb3f>
 <2><efb38>: Abbrev Number: 26 (DW_TAG_subrange_type)
    <efb39>   DW_AT_type        : <0xefaa2>
    <efb3d>   DW_AT_upper_bound : 3
 <2><efb3e>: Abbrev Number: 0
 <1><efb3f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efb40>   DW_AT_byte_size   : 8
    <efb40>   DW_AT_type        : <0xefb44>
 <1><efb44>: Abbrev Number: 27 (DW_TAG_const_type)
 <1><efb45>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efb46>   DW_AT_byte_size   : 8
    <efb46>   DW_AT_type        : <0xefadf>
 <1><efb4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <efb4b>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <efb4f>   DW_AT_decl_file   : 5
    <efb50>   DW_AT_decl_line   : 22
    <efb51>   DW_AT_decl_column : 15
    <efb52>   DW_AT_type        : <0xefb10>
 <1><efb56>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efb57>   DW_AT_byte_size   : 8
    <efb57>   DW_AT_type        : <0xefb5b>
 <1><efb5b>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <efb5c>   DW_AT_prototyped  : 1
 <1><efb5c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <efb5d>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <efb61>   DW_AT_byte_size   : 24
    <efb62>   DW_AT_decl_file   : 6
    <efb63>   DW_AT_decl_line   : 82
    <efb64>   DW_AT_decl_column : 16
    <efb65>   DW_AT_sibling     : <0xefb91>
 <2><efb69>: Abbrev Number: 2 (DW_TAG_member)
    <efb6a>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <efb6e>   DW_AT_decl_file   : 6
    <efb6f>   DW_AT_decl_line   : 83
    <efb70>   DW_AT_decl_column : 21
    <efb71>   DW_AT_type        : <0xefadf>
    <efb75>   DW_AT_data_member_location: 0
 <2><efb76>: Abbrev Number: 7 (DW_TAG_member)
    <efb77>   DW_AT_name        : len
    <efb7b>   DW_AT_decl_file   : 6
    <efb7c>   DW_AT_decl_line   : 84
    <efb7d>   DW_AT_decl_column : 21
    <efb7e>   DW_AT_type        : <0xefb1c>
    <efb82>   DW_AT_data_member_location: 8
 <2><efb83>: Abbrev Number: 2 (DW_TAG_member)
    <efb84>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <efb88>   DW_AT_decl_file   : 6
    <efb89>   DW_AT_decl_line   : 85
    <efb8a>   DW_AT_decl_column : 21
    <efb8b>   DW_AT_type        : <0xefb1c>
    <efb8f>   DW_AT_data_member_location: 16
 <2><efb90>: Abbrev Number: 0
 <1><efb91>: Abbrev Number: 3 (DW_TAG_typedef)
    <efb92>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <efb96>   DW_AT_decl_file   : 6
    <efb97>   DW_AT_decl_line   : 86
    <efb98>   DW_AT_decl_column : 3
    <efb99>   DW_AT_type        : <0xefb5c>
 <1><efb9d>: Abbrev Number: 6 (DW_TAG_base_type)
    <efb9e>   DW_AT_byte_size   : 8
    <efb9f>   DW_AT_encoding    : 4	(float)
    <efba0>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><efba4>: Abbrev Number: 6 (DW_TAG_base_type)
    <efba5>   DW_AT_byte_size   : 4
    <efba6>   DW_AT_encoding    : 4	(float)
    <efba7>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><efbab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efbac>   DW_AT_byte_size   : 8
    <efbac>   DW_AT_type        : <0xefaf7>
 <1><efbb0>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <efbb1>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <efbb5>   DW_AT_encoding    : 7	(unsigned)
    <efbb6>   DW_AT_byte_size   : 4
    <efbb7>   DW_AT_type        : <0xefa9b>
    <efbbb>   DW_AT_decl_file   : 7
    <efbbc>   DW_AT_decl_line   : 25
    <efbbd>   DW_AT_decl_column : 14
    <efbbe>   DW_AT_sibling     : <0xefbdb>
 <2><efbc2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <efbc3>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <efbc7>   DW_AT_const_value : 0
 <2><efbc8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <efbc9>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <efbcd>   DW_AT_const_value : 1
 <2><efbce>: Abbrev Number: 12 (DW_TAG_enumerator)
    <efbcf>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <efbd3>   DW_AT_const_value : 2
 <2><efbd4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <efbd5>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <efbd9>   DW_AT_const_value : 3
 <2><efbda>: Abbrev Number: 0
 <1><efbdb>: Abbrev Number: 3 (DW_TAG_typedef)
    <efbdc>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <efbe0>   DW_AT_decl_file   : 7
    <efbe1>   DW_AT_decl_line   : 30
    <efbe2>   DW_AT_decl_column : 3
    <efbe3>   DW_AT_type        : <0xefbb0>
 <1><efbe7>: Abbrev Number: 3 (DW_TAG_typedef)
    <efbe8>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <efbec>   DW_AT_decl_file   : 7
    <efbed>   DW_AT_decl_line   : 54
    <efbee>   DW_AT_decl_column : 15
    <efbef>   DW_AT_type        : <0xefbf3>
 <1><efbf3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efbf4>   DW_AT_byte_size   : 8
    <efbf4>   DW_AT_type        : <0xefbf8>
 <1><efbf8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efbf9>   DW_AT_prototyped  : 1
    <efbf9>   DW_AT_type        : <0xefab7>
    <efbfd>   DW_AT_sibling     : <0xefc0c>
 <2><efc01>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efc02>   DW_AT_type        : <0xefc0c>
 <2><efc06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efc07>   DW_AT_type        : <0xefab7>
 <2><efc0b>: Abbrev Number: 0
 <1><efc0c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efc0d>   DW_AT_byte_size   : 8
    <efc0d>   DW_AT_type        : <0xefc11>
 <1><efc11>: Abbrev Number: 8 (DW_TAG_structure_type)
    <efc12>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <efc16>   DW_AT_byte_size   : 80
    <efc17>   DW_AT_decl_file   : 7
    <efc18>   DW_AT_decl_line   : 97
    <efc19>   DW_AT_decl_column : 16
    <efc1a>   DW_AT_sibling     : <0xefcd5>
 <2><efc1e>: Abbrev Number: 2 (DW_TAG_member)
    <efc1f>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <efc23>   DW_AT_decl_file   : 7
    <efc24>   DW_AT_decl_line   : 98
    <efc25>   DW_AT_decl_column : 21
    <efc26>   DW_AT_type        : <0xefab7>
    <efc2a>   DW_AT_data_member_location: 0
 <2><efc2b>: Abbrev Number: 7 (DW_TAG_member)
    <efc2c>   DW_AT_name        : len
    <efc30>   DW_AT_decl_file   : 7
    <efc31>   DW_AT_decl_line   : 99
    <efc32>   DW_AT_decl_column : 21
    <efc33>   DW_AT_type        : <0xefab7>
    <efc37>   DW_AT_data_member_location: 4
 <2><efc38>: Abbrev Number: 2 (DW_TAG_member)
    <efc39>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <efc3d>   DW_AT_decl_file   : 7
    <efc3e>   DW_AT_decl_line   : 100
    <efc3f>   DW_AT_decl_column : 21
    <efc40>   DW_AT_type        : <0xefbdb>
    <efc44>   DW_AT_data_member_location: 8
 <2><efc45>: Abbrev Number: 2 (DW_TAG_member)
    <efc46>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <efc4a>   DW_AT_decl_file   : 7
    <efc4b>   DW_AT_decl_line   : 101
    <efc4c>   DW_AT_decl_column : 21
    <efc4d>   DW_AT_type        : <0xefb4a>
    <efc51>   DW_AT_data_member_location: 16
 <2><efc52>: Abbrev Number: 2 (DW_TAG_member)
    <efc53>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <efc57>   DW_AT_decl_file   : 7
    <efc58>   DW_AT_decl_line   : 102
    <efc59>   DW_AT_decl_column : 21
    <efc5a>   DW_AT_type        : <0xefab7>
    <efc5e>   DW_AT_data_member_location: 24
 <2><efc5f>: Abbrev Number: 2 (DW_TAG_member)
    <efc60>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <efc64>   DW_AT_decl_file   : 7
    <efc65>   DW_AT_decl_line   : 103
    <efc66>   DW_AT_decl_column : 21
    <efc67>   DW_AT_type        : <0xefab7>
    <efc6b>   DW_AT_data_member_location: 28
 <2><efc6c>: Abbrev Number: 2 (DW_TAG_member)
    <efc6d>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <efc71>   DW_AT_decl_file   : 7
    <efc72>   DW_AT_decl_line   : 104
    <efc73>   DW_AT_decl_column : 21
    <efc74>   DW_AT_type        : <0xefab7>
    <efc78>   DW_AT_data_member_location: 32
 <2><efc79>: Abbrev Number: 2 (DW_TAG_member)
    <efc7a>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <efc7e>   DW_AT_decl_file   : 7
    <efc7f>   DW_AT_decl_line   : 105
    <efc80>   DW_AT_decl_column : 21
    <efc81>   DW_AT_type        : <0xefa9b>
    <efc85>   DW_AT_data_member_location: 36
 <2><efc86>: Abbrev Number: 2 (DW_TAG_member)
    <efc87>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <efc8b>   DW_AT_decl_file   : 7
    <efc8c>   DW_AT_decl_line   : 106
    <efc8d>   DW_AT_decl_column : 21
    <efc8e>   DW_AT_type        : <0xefa9b>
    <efc92>   DW_AT_data_member_location: 40
 <2><efc93>: Abbrev Number: 2 (DW_TAG_member)
    <efc94>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <efc98>   DW_AT_decl_file   : 7
    <efc99>   DW_AT_decl_line   : 109
    <efc9a>   DW_AT_decl_column : 21
    <efc9b>   DW_AT_type        : <0xefb2f>
    <efc9f>   DW_AT_data_member_location: 44
 <2><efca0>: Abbrev Number: 2 (DW_TAG_member)
    <efca1>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <efca5>   DW_AT_decl_file   : 7
    <efca6>   DW_AT_decl_line   : 110
    <efca7>   DW_AT_decl_column : 21
    <efca8>   DW_AT_type        : <0xefaeb>
    <efcac>   DW_AT_data_member_location: 48
 <2><efcad>: Abbrev Number: 2 (DW_TAG_member)
    <efcae>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <efcb2>   DW_AT_decl_file   : 7
    <efcb3>   DW_AT_decl_line   : 112
    <efcb4>   DW_AT_decl_column : 22
    <efcb5>   DW_AT_type        : <0xeff6d>
    <efcb9>   DW_AT_data_member_location: 56
 <2><efcba>: Abbrev Number: 2 (DW_TAG_member)
    <efcbb>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <efcbf>   DW_AT_decl_file   : 7
    <efcc0>   DW_AT_decl_line   : 114
    <efcc1>   DW_AT_decl_column : 14
    <efcc2>   DW_AT_type        : <0xefad1>
    <efcc6>   DW_AT_data_member_location: 64
 <2><efcc7>: Abbrev Number: 2 (DW_TAG_member)
    <efcc8>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <efccc>   DW_AT_decl_file   : 7
    <efccd>   DW_AT_decl_line   : 116
    <efcce>   DW_AT_decl_column : 22
    <efccf>   DW_AT_type        : <0xefc0c>
    <efcd3>   DW_AT_data_member_location: 72
 <2><efcd4>: Abbrev Number: 0
 <1><efcd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <efcd6>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <efcda>   DW_AT_decl_file   : 7
    <efcdb>   DW_AT_decl_line   : 59
    <efcdc>   DW_AT_decl_column : 15
    <efcdd>   DW_AT_type        : <0xefce1>
 <1><efce1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efce2>   DW_AT_byte_size   : 8
    <efce2>   DW_AT_type        : <0xefce6>
 <1><efce6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efce7>   DW_AT_prototyped  : 1
    <efce7>   DW_AT_type        : <0xefab7>
    <efceb>   DW_AT_sibling     : <0xefcf5>
 <2><efcef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efcf0>   DW_AT_type        : <0xefc0c>
 <2><efcf4>: Abbrev Number: 0
 <1><efcf5>: Abbrev Number: 3 (DW_TAG_typedef)
    <efcf6>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <efcfa>   DW_AT_decl_file   : 7
    <efcfb>   DW_AT_decl_line   : 60
    <efcfc>   DW_AT_decl_column : 15
    <efcfd>   DW_AT_type        : <0xefce1>
 <1><efd01>: Abbrev Number: 3 (DW_TAG_typedef)
    <efd02>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <efd06>   DW_AT_decl_file   : 7
    <efd07>   DW_AT_decl_line   : 61
    <efd08>   DW_AT_decl_column : 15
    <efd09>   DW_AT_type        : <0xefd0d>
 <1><efd0d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd0e>   DW_AT_byte_size   : 8
    <efd0e>   DW_AT_type        : <0xefd12>
 <1><efd12>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efd13>   DW_AT_prototyped  : 1
    <efd13>   DW_AT_type        : <0xefab7>
    <efd17>   DW_AT_sibling     : <0xefd2b>
 <2><efd1b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd1c>   DW_AT_type        : <0xefc0c>
 <2><efd20>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd21>   DW_AT_type        : <0xefb4a>
 <2><efd25>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd26>   DW_AT_type        : <0xefab7>
 <2><efd2a>: Abbrev Number: 0
 <1><efd2b>: Abbrev Number: 3 (DW_TAG_typedef)
    <efd2c>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <efd30>   DW_AT_decl_file   : 7
    <efd31>   DW_AT_decl_line   : 62
    <efd32>   DW_AT_decl_column : 15
    <efd33>   DW_AT_type        : <0xefd37>
 <1><efd37>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd38>   DW_AT_byte_size   : 8
    <efd38>   DW_AT_type        : <0xefd3c>
 <1><efd3c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efd3d>   DW_AT_prototyped  : 1
    <efd3d>   DW_AT_type        : <0xefab7>
    <efd41>   DW_AT_sibling     : <0xefd50>
 <2><efd45>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd46>   DW_AT_type        : <0xefc0c>
 <2><efd4a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd4b>   DW_AT_type        : <0xefd50>
 <2><efd4f>: Abbrev Number: 0
 <1><efd50>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd51>   DW_AT_byte_size   : 8
    <efd51>   DW_AT_type        : <0xefb4a>
 <1><efd55>: Abbrev Number: 3 (DW_TAG_typedef)
    <efd56>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <efd5a>   DW_AT_decl_file   : 7
    <efd5b>   DW_AT_decl_line   : 63
    <efd5c>   DW_AT_decl_column : 15
    <efd5d>   DW_AT_type        : <0xefd61>
 <1><efd61>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd62>   DW_AT_byte_size   : 8
    <efd62>   DW_AT_type        : <0xefd66>
 <1><efd66>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efd67>   DW_AT_prototyped  : 1
    <efd67>   DW_AT_type        : <0xefab7>
    <efd6b>   DW_AT_sibling     : <0xefd7f>
 <2><efd6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd70>   DW_AT_type        : <0xefc0c>
 <2><efd74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd75>   DW_AT_type        : <0xefad1>
 <2><efd79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd7a>   DW_AT_type        : <0xefd7f>
 <2><efd7e>: Abbrev Number: 0
 <1><efd7f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd80>   DW_AT_byte_size   : 8
    <efd80>   DW_AT_type        : <0xefaeb>
 <1><efd84>: Abbrev Number: 3 (DW_TAG_typedef)
    <efd85>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <efd89>   DW_AT_decl_file   : 7
    <efd8a>   DW_AT_decl_line   : 65
    <efd8b>   DW_AT_decl_column : 15
    <efd8c>   DW_AT_type        : <0xefd90>
 <1><efd90>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efd91>   DW_AT_byte_size   : 8
    <efd91>   DW_AT_type        : <0xefd95>
 <1><efd95>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efd96>   DW_AT_prototyped  : 1
    <efd96>   DW_AT_type        : <0xefab7>
    <efd9a>   DW_AT_sibling     : <0xefdae>
 <2><efd9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efd9f>   DW_AT_type        : <0xefc0c>
 <2><efda3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efda4>   DW_AT_type        : <0xefbab>
 <2><efda8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efda9>   DW_AT_type        : <0xefd7f>
 <2><efdad>: Abbrev Number: 0
 <1><efdae>: Abbrev Number: 3 (DW_TAG_typedef)
    <efdaf>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <efdb3>   DW_AT_decl_file   : 7
    <efdb4>   DW_AT_decl_line   : 67
    <efdb5>   DW_AT_decl_column : 15
    <efdb6>   DW_AT_type        : <0xefdba>
 <1><efdba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efdbb>   DW_AT_byte_size   : 8
    <efdbb>   DW_AT_type        : <0xefdbf>
 <1><efdbf>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efdc0>   DW_AT_prototyped  : 1
    <efdc0>   DW_AT_type        : <0xefab7>
    <efdc4>   DW_AT_sibling     : <0xefdd8>
 <2><efdc8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdc9>   DW_AT_type        : <0xefc0c>
 <2><efdcd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdce>   DW_AT_type        : <0xefb3f>
 <2><efdd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdd3>   DW_AT_type        : <0xefaeb>
 <2><efdd7>: Abbrev Number: 0
 <1><efdd8>: Abbrev Number: 3 (DW_TAG_typedef)
    <efdd9>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <efddd>   DW_AT_decl_file   : 7
    <efdde>   DW_AT_decl_line   : 69
    <efddf>   DW_AT_decl_column : 15
    <efde0>   DW_AT_type        : <0xefde4>
 <1><efde4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efde5>   DW_AT_byte_size   : 8
    <efde5>   DW_AT_type        : <0xefde9>
 <1><efde9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efdea>   DW_AT_prototyped  : 1
    <efdea>   DW_AT_type        : <0xefab7>
    <efdee>   DW_AT_sibling     : <0xefe02>
 <2><efdf2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdf3>   DW_AT_type        : <0xefc0c>
 <2><efdf7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdf8>   DW_AT_type        : <0xefe02>
 <2><efdfc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efdfd>   DW_AT_type        : <0xefaeb>
 <2><efe01>: Abbrev Number: 0
 <1><efe02>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efe03>   DW_AT_byte_size   : 8
    <efe03>   DW_AT_type        : <0xefb04>
 <1><efe07>: Abbrev Number: 3 (DW_TAG_typedef)
    <efe08>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <efe0c>   DW_AT_decl_file   : 7
    <efe0d>   DW_AT_decl_line   : 71
    <efe0e>   DW_AT_decl_column : 15
    <efe0f>   DW_AT_type        : <0xefe13>
 <1><efe13>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efe14>   DW_AT_byte_size   : 8
    <efe14>   DW_AT_type        : <0xefe18>
 <1><efe18>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efe19>   DW_AT_prototyped  : 1
    <efe19>   DW_AT_type        : <0xefab7>
    <efe1d>   DW_AT_sibling     : <0xefe31>
 <2><efe21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe22>   DW_AT_type        : <0xefc0c>
 <2><efe26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe27>   DW_AT_type        : <0xefb4a>
 <2><efe2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe2c>   DW_AT_type        : <0xefb4a>
 <2><efe30>: Abbrev Number: 0
 <1><efe31>: Abbrev Number: 3 (DW_TAG_typedef)
    <efe32>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <efe36>   DW_AT_decl_file   : 7
    <efe37>   DW_AT_decl_line   : 73
    <efe38>   DW_AT_decl_column : 15
    <efe39>   DW_AT_type        : <0xefe13>
 <1><efe3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <efe3e>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <efe42>   DW_AT_decl_file   : 7
    <efe43>   DW_AT_decl_line   : 75
    <efe44>   DW_AT_decl_column : 15
    <efe45>   DW_AT_type        : <0xefe49>
 <1><efe49>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efe4a>   DW_AT_byte_size   : 8
    <efe4a>   DW_AT_type        : <0xefe4e>
 <1><efe4e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efe4f>   DW_AT_prototyped  : 1
    <efe4f>   DW_AT_type        : <0xefab7>
    <efe53>   DW_AT_sibling     : <0xefe62>
 <2><efe57>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe58>   DW_AT_type        : <0xefc0c>
 <2><efe5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe5d>   DW_AT_type        : <0xefe62>
 <2><efe61>: Abbrev Number: 0
 <1><efe62>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efe63>   DW_AT_byte_size   : 8
    <efe63>   DW_AT_type        : <0xefb91>
 <1><efe67>: Abbrev Number: 3 (DW_TAG_typedef)
    <efe68>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <efe6c>   DW_AT_decl_file   : 7
    <efe6d>   DW_AT_decl_line   : 76
    <efe6e>   DW_AT_decl_column : 15
    <efe6f>   DW_AT_type        : <0xefe73>
 <1><efe73>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <efe74>   DW_AT_byte_size   : 8
    <efe74>   DW_AT_type        : <0xefe78>
 <1><efe78>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <efe79>   DW_AT_prototyped  : 1
    <efe79>   DW_AT_type        : <0xefab7>
    <efe7d>   DW_AT_sibling     : <0xefe91>
 <2><efe81>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe82>   DW_AT_type        : <0xefc0c>
 <2><efe86>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe87>   DW_AT_type        : <0xefbab>
 <2><efe8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <efe8c>   DW_AT_type        : <0xefb1c>
 <2><efe90>: Abbrev Number: 0
 <1><efe91>: Abbrev Number: 3 (DW_TAG_typedef)
    <efe92>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <efe96>   DW_AT_decl_file   : 7
    <efe97>   DW_AT_decl_line   : 77
    <efe98>   DW_AT_decl_column : 15
    <efe99>   DW_AT_type        : <0xefce1>
 <1><efe9d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <efe9e>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <efea2>   DW_AT_byte_size   : 112
    <efea3>   DW_AT_decl_file   : 7
    <efea4>   DW_AT_decl_line   : 80
    <efea5>   DW_AT_decl_column : 16
    <efea6>   DW_AT_sibling     : <0xeff61>
 <2><efeaa>: Abbrev Number: 2 (DW_TAG_member)
    <efeab>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <efeaf>   DW_AT_decl_file   : 7
    <efeb0>   DW_AT_decl_line   : 81
    <efeb1>   DW_AT_decl_column : 25
    <efeb2>   DW_AT_type        : <0xefcd5>
    <efeb6>   DW_AT_data_member_location: 0
 <2><efeb7>: Abbrev Number: 2 (DW_TAG_member)
    <efeb8>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <efebc>   DW_AT_decl_file   : 7
    <efebd>   DW_AT_decl_line   : 82
    <efebe>   DW_AT_decl_column : 25
    <efebf>   DW_AT_type        : <0xefcf5>
    <efec3>   DW_AT_data_member_location: 8
 <2><efec4>: Abbrev Number: 2 (DW_TAG_member)
    <efec5>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <efec9>   DW_AT_decl_file   : 7
    <efeca>   DW_AT_decl_line   : 83
    <efecb>   DW_AT_decl_column : 25
    <efecc>   DW_AT_type        : <0xefd01>
    <efed0>   DW_AT_data_member_location: 16
 <2><efed1>: Abbrev Number: 2 (DW_TAG_member)
    <efed2>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <efed6>   DW_AT_decl_file   : 7
    <efed7>   DW_AT_decl_line   : 84
    <efed8>   DW_AT_decl_column : 25
    <efed9>   DW_AT_type        : <0xefd2b>
    <efedd>   DW_AT_data_member_location: 24
 <2><efede>: Abbrev Number: 2 (DW_TAG_member)
    <efedf>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <efee3>   DW_AT_decl_file   : 7
    <efee4>   DW_AT_decl_line   : 85
    <efee5>   DW_AT_decl_column : 25
    <efee6>   DW_AT_type        : <0xefd55>
    <efeea>   DW_AT_data_member_location: 32
 <2><efeeb>: Abbrev Number: 2 (DW_TAG_member)
    <efeec>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <efef0>   DW_AT_decl_file   : 7
    <efef1>   DW_AT_decl_line   : 86
    <efef2>   DW_AT_decl_column : 25
    <efef3>   DW_AT_type        : <0xefd84>
    <efef7>   DW_AT_data_member_location: 40
 <2><efef8>: Abbrev Number: 2 (DW_TAG_member)
    <efef9>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <efefd>   DW_AT_decl_file   : 7
    <efefe>   DW_AT_decl_line   : 87
    <efeff>   DW_AT_decl_column : 25
    <eff00>   DW_AT_type        : <0xefdae>
    <eff04>   DW_AT_data_member_location: 48
 <2><eff05>: Abbrev Number: 2 (DW_TAG_member)
    <eff06>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <eff0a>   DW_AT_decl_file   : 7
    <eff0b>   DW_AT_decl_line   : 88
    <eff0c>   DW_AT_decl_column : 25
    <eff0d>   DW_AT_type        : <0xefdd8>
    <eff11>   DW_AT_data_member_location: 56
 <2><eff12>: Abbrev Number: 2 (DW_TAG_member)
    <eff13>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <eff17>   DW_AT_decl_file   : 7
    <eff18>   DW_AT_decl_line   : 89
    <eff19>   DW_AT_decl_column : 25
    <eff1a>   DW_AT_type        : <0xefe07>
    <eff1e>   DW_AT_data_member_location: 64
 <2><eff1f>: Abbrev Number: 2 (DW_TAG_member)
    <eff20>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <eff24>   DW_AT_decl_file   : 7
    <eff25>   DW_AT_decl_line   : 90
    <eff26>   DW_AT_decl_column : 25
    <eff27>   DW_AT_type        : <0xefe31>
    <eff2b>   DW_AT_data_member_location: 72
 <2><eff2c>: Abbrev Number: 2 (DW_TAG_member)
    <eff2d>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <eff31>   DW_AT_decl_file   : 7
    <eff32>   DW_AT_decl_line   : 91
    <eff33>   DW_AT_decl_column : 25
    <eff34>   DW_AT_type        : <0xefe3d>
    <eff38>   DW_AT_data_member_location: 80
 <2><eff39>: Abbrev Number: 2 (DW_TAG_member)
    <eff3a>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <eff3e>   DW_AT_decl_file   : 7
    <eff3f>   DW_AT_decl_line   : 92
    <eff40>   DW_AT_decl_column : 25
    <eff41>   DW_AT_type        : <0xefe67>
    <eff45>   DW_AT_data_member_location: 88
 <2><eff46>: Abbrev Number: 2 (DW_TAG_member)
    <eff47>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <eff4b>   DW_AT_decl_file   : 7
    <eff4c>   DW_AT_decl_line   : 93
    <eff4d>   DW_AT_decl_column : 25
    <eff4e>   DW_AT_type        : <0xefbe7>
    <eff52>   DW_AT_data_member_location: 96
 <2><eff53>: Abbrev Number: 2 (DW_TAG_member)
    <eff54>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <eff58>   DW_AT_decl_file   : 7
    <eff59>   DW_AT_decl_line   : 94
    <eff5a>   DW_AT_decl_column : 25
    <eff5b>   DW_AT_type        : <0xefe91>
    <eff5f>   DW_AT_data_member_location: 104
 <2><eff60>: Abbrev Number: 0
 <1><eff61>: Abbrev Number: 3 (DW_TAG_typedef)
    <eff62>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <eff66>   DW_AT_decl_file   : 7
    <eff67>   DW_AT_decl_line   : 95
    <eff68>   DW_AT_decl_column : 3
    <eff69>   DW_AT_type        : <0xefe9d>
 <1><eff6d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <eff6e>   DW_AT_byte_size   : 8
    <eff6e>   DW_AT_type        : <0xeff61>
 <1><eff72>: Abbrev Number: 3 (DW_TAG_typedef)
    <eff73>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <eff77>   DW_AT_decl_file   : 7
    <eff78>   DW_AT_decl_line   : 117
    <eff79>   DW_AT_decl_column : 3
    <eff7a>   DW_AT_type        : <0xefc11>
 <1><eff7e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <eff7f>   DW_AT_byte_size   : 8
    <eff80>   DW_AT_decl_file   : 8
    <eff80>   DW_AT_decl_line   : 4
    <eff81>   DW_AT_decl_column : 3
    <eff81>   DW_AT_sibling     : <0xeffa0>
 <2><eff85>: Abbrev Number: 2 (DW_TAG_member)
    <eff86>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <eff8a>   DW_AT_decl_file   : 8
    <eff8b>   DW_AT_decl_line   : 5
    <eff8c>   DW_AT_decl_column : 8
    <eff8d>   DW_AT_type        : <0xefab7>
    <eff91>   DW_AT_data_member_location: 0
 <2><eff92>: Abbrev Number: 2 (DW_TAG_member)
    <eff93>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <eff97>   DW_AT_decl_file   : 8
    <eff98>   DW_AT_decl_line   : 6
    <eff99>   DW_AT_decl_column : 8
    <eff9a>   DW_AT_type        : <0xefab7>
    <eff9e>   DW_AT_data_member_location: 4
 <2><eff9f>: Abbrev Number: 0
 <1><effa0>: Abbrev Number: 17 (DW_TAG_structure_type)
    <effa1>   DW_AT_byte_size   : 16
    <effa2>   DW_AT_decl_file   : 8
    <effa2>   DW_AT_decl_line   : 8
    <effa3>   DW_AT_decl_column : 3
    <effa3>   DW_AT_sibling     : <0xeffd6>
 <2><effa7>: Abbrev Number: 7 (DW_TAG_member)
    <effa8>   DW_AT_name        : x
    <effaa>   DW_AT_decl_file   : 8
    <effab>   DW_AT_decl_line   : 9
    <effac>   DW_AT_decl_column : 8
    <effad>   DW_AT_type        : <0xefab7>
    <effb1>   DW_AT_data_member_location: 0
 <2><effb2>: Abbrev Number: 7 (DW_TAG_member)
    <effb3>   DW_AT_name        : y
    <effb5>   DW_AT_decl_file   : 8
    <effb6>   DW_AT_decl_line   : 9
    <effb7>   DW_AT_decl_column : 11
    <effb8>   DW_AT_type        : <0xefab7>
    <effbc>   DW_AT_data_member_location: 4
 <2><effbd>: Abbrev Number: 7 (DW_TAG_member)
    <effbe>   DW_AT_name        : dx
    <effc1>   DW_AT_decl_file   : 8
    <effc2>   DW_AT_decl_line   : 10
    <effc3>   DW_AT_decl_column : 8
    <effc4>   DW_AT_type        : <0xefab7>
    <effc8>   DW_AT_data_member_location: 8
 <2><effc9>: Abbrev Number: 7 (DW_TAG_member)
    <effca>   DW_AT_name        : dy
    <effcd>   DW_AT_decl_file   : 8
    <effce>   DW_AT_decl_line   : 10
    <effcf>   DW_AT_decl_column : 12
    <effd0>   DW_AT_type        : <0xefab7>
    <effd4>   DW_AT_data_member_location: 12
 <2><effd5>: Abbrev Number: 0
 <1><effd6>: Abbrev Number: 30 (DW_TAG_union_type)
    <effd7>   DW_AT_byte_size   : 16
    <effd8>   DW_AT_decl_file   : 8
    <effd9>   DW_AT_decl_line   : 3
    <effda>   DW_AT_decl_column : 2
    <effdb>   DW_AT_sibling     : <0xf0006>
 <2><effdf>: Abbrev Number: 18 (DW_TAG_member)
    <effe0>   DW_AT_type        : <0xeff7e>
 <2><effe4>: Abbrev Number: 18 (DW_TAG_member)
    <effe5>   DW_AT_type        : <0xeffa0>
 <2><effe9>: Abbrev Number: 31 (DW_TAG_member)
    <effea>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <effee>   DW_AT_decl_file   : 8
    <effef>   DW_AT_decl_line   : 12
    <efff0>   DW_AT_decl_column : 7
    <efff1>   DW_AT_type        : <0xefab7>
 <2><efff5>: Abbrev Number: 19 (DW_TAG_member)
    <efff6>   DW_AT_name        : z
    <efff8>   DW_AT_decl_file   : 8
    <efff8>   DW_AT_decl_line   : 13
    <efff9>   DW_AT_decl_column : 7
    <efff9>   DW_AT_type        : <0xefab7>
 <2><efffd>: Abbrev Number: 19 (DW_TAG_member)
    <efffe>   DW_AT_name        : w
    <f0000>   DW_AT_decl_file   : 8
    <f0000>   DW_AT_decl_line   : 14
    <f0001>   DW_AT_decl_column : 7
    <f0001>   DW_AT_type        : <0xefab7>
 <2><f0005>: Abbrev Number: 0
 <1><f0006>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f0007>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <f000b>   DW_AT_byte_size   : 20
    <f000c>   DW_AT_decl_file   : 8
    <f000d>   DW_AT_decl_line   : 1
    <f000e>   DW_AT_decl_column : 8
    <f000f>   DW_AT_sibling     : <0xf0027>
 <2><f0013>: Abbrev Number: 2 (DW_TAG_member)
    <f0014>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f0018>   DW_AT_decl_file   : 8
    <f0019>   DW_AT_decl_line   : 2
    <f001a>   DW_AT_decl_column : 6
    <f001b>   DW_AT_type        : <0xefab7>
    <f001f>   DW_AT_data_member_location: 0
 <2><f0020>: Abbrev Number: 32 (DW_TAG_member)
    <f0021>   DW_AT_type        : <0xeffd6>
    <f0025>   DW_AT_data_member_location: 4
 <2><f0026>: Abbrev Number: 0
 <1><f0027>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0028>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <f002c>   DW_AT_decl_file   : 8
    <f002d>   DW_AT_decl_line   : 18
    <f002e>   DW_AT_decl_column : 23
    <f002f>   DW_AT_type        : <0xf0006>
 <1><f0033>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0034>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <f0038>   DW_AT_decl_file   : 9
    <f0039>   DW_AT_decl_line   : 1
    <f003a>   DW_AT_decl_column : 23
    <f003b>   DW_AT_type        : <0xf003f>
 <1><f003f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0040>   DW_AT_byte_size   : 8
    <f0040>   DW_AT_type        : <0xf0044>
 <1><f0044>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <f0045>   DW_AT_prototyped  : 1
    <f0045>   DW_AT_type        : <0xefe62>
 <1><f0049>: Abbrev Number: 3 (DW_TAG_typedef)
    <f004a>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <f004e>   DW_AT_decl_file   : 9
    <f004f>   DW_AT_decl_line   : 2
    <f0050>   DW_AT_decl_column : 23
    <f0051>   DW_AT_type        : <0xf0055>
 <1><f0055>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0056>   DW_AT_byte_size   : 8
    <f0056>   DW_AT_type        : <0xf005a>
 <1><f005a>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <f005b>   DW_AT_prototyped  : 1
    <f005b>   DW_AT_type        : <0xefab7>
 <1><f005f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0060>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <f0064>   DW_AT_decl_file   : 9
    <f0065>   DW_AT_decl_line   : 3
    <f0066>   DW_AT_decl_column : 23
    <f0067>   DW_AT_type        : <0xf0055>
 <1><f006b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f006c>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <f0070>   DW_AT_decl_file   : 9
    <f0071>   DW_AT_decl_line   : 10
    <f0072>   DW_AT_decl_column : 23
    <f0073>   DW_AT_type        : <0xf0077>
 <1><f0077>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0078>   DW_AT_byte_size   : 8
    <f0078>   DW_AT_type        : <0xf007c>
 <1><f007c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f007d>   DW_AT_prototyped  : 1
    <f007d>   DW_AT_sibling     : <0xf0087>
 <2><f0081>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0082>   DW_AT_type        : <0xefab7>
 <2><f0086>: Abbrev Number: 0
 <1><f0087>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0088>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <f008c>   DW_AT_decl_file   : 9
    <f008d>   DW_AT_decl_line   : 14
    <f008e>   DW_AT_decl_column : 23
    <f008f>   DW_AT_type        : <0xf0093>
 <1><f0093>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0094>   DW_AT_byte_size   : 8
    <f0094>   DW_AT_type        : <0xf0098>
 <1><f0098>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0099>   DW_AT_prototyped  : 1
    <f0099>   DW_AT_type        : <0xefab7>
    <f009d>   DW_AT_sibling     : <0xf00b1>
 <2><f00a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f00a2>   DW_AT_type        : <0xefab7>
 <2><f00a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f00a7>   DW_AT_type        : <0xefab7>
 <2><f00ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f00ac>   DW_AT_type        : <0xefab7>
 <2><f00b0>: Abbrev Number: 0
 <1><f00b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <f00b2>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <f00b6>   DW_AT_decl_file   : 9
    <f00b7>   DW_AT_decl_line   : 18
    <f00b8>   DW_AT_decl_column : 23
    <f00b9>   DW_AT_type        : <0xf0093>
 <1><f00bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <f00be>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <f00c2>   DW_AT_decl_file   : 9
    <f00c3>   DW_AT_decl_line   : 24
    <f00c4>   DW_AT_decl_column : 23
    <f00c5>   DW_AT_type        : <0xefb56>
 <1><f00c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <f00ca>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <f00ce>   DW_AT_decl_file   : 9
    <f00cf>   DW_AT_decl_line   : 28
    <f00d0>   DW_AT_decl_column : 23
    <f00d1>   DW_AT_type        : <0xf00d5>
 <1><f00d5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f00d6>   DW_AT_byte_size   : 8
    <f00d6>   DW_AT_type        : <0xf00da>
 <1><f00da>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f00db>   DW_AT_prototyped  : 1
    <f00db>   DW_AT_type        : <0xefab7>
    <f00df>   DW_AT_sibling     : <0xf00ee>
 <2><f00e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f00e4>   DW_AT_type        : <0xefab7>
 <2><f00e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f00e9>   DW_AT_type        : <0xefab7>
 <2><f00ed>: Abbrev Number: 0
 <1><f00ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <f00ef>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <f00f3>   DW_AT_decl_file   : 9
    <f00f4>   DW_AT_decl_line   : 34
    <f00f5>   DW_AT_decl_column : 23
    <f00f6>   DW_AT_type        : <0xf0055>
 <1><f00fa>: Abbrev Number: 3 (DW_TAG_typedef)
    <f00fb>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <f00ff>   DW_AT_decl_file   : 9
    <f0100>   DW_AT_decl_line   : 35
    <f0101>   DW_AT_decl_column : 23
    <f0102>   DW_AT_type        : <0xf0055>
 <1><f0106>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0107>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <f010b>   DW_AT_decl_file   : 9
    <f010c>   DW_AT_decl_line   : 36
    <f010d>   DW_AT_decl_column : 23
    <f010e>   DW_AT_type        : <0xf0112>
 <1><f0112>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0113>   DW_AT_byte_size   : 8
    <f0113>   DW_AT_type        : <0xf0117>
 <1><f0117>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f0118>   DW_AT_prototyped  : 1
    <f0118>   DW_AT_sibling     : <0xf0127>
 <2><f011c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f011d>   DW_AT_type        : <0xf0127>
 <2><f0121>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0122>   DW_AT_type        : <0xf0127>
 <2><f0126>: Abbrev Number: 0
 <1><f0127>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0128>   DW_AT_byte_size   : 8
    <f0128>   DW_AT_type        : <0xefab7>
 <1><f012c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f012d>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <f0131>   DW_AT_decl_file   : 9
    <f0132>   DW_AT_decl_line   : 37
    <f0133>   DW_AT_decl_column : 23
    <f0134>   DW_AT_type        : <0xf0112>
 <1><f0138>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0139>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <f013d>   DW_AT_decl_file   : 9
    <f013e>   DW_AT_decl_line   : 45
    <f013f>   DW_AT_decl_column : 24
    <f0140>   DW_AT_type        : <0xf0144>
 <1><f0144>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0145>   DW_AT_byte_size   : 8
    <f0145>   DW_AT_type        : <0xf0149>
 <1><f0149>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f014a>   DW_AT_prototyped  : 1
    <f014a>   DW_AT_type        : <0xefa9b>
    <f014e>   DW_AT_sibling     : <0xf0162>
 <2><f0152>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0153>   DW_AT_type        : <0xefab7>
 <2><f0157>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0158>   DW_AT_type        : <0xefab7>
 <2><f015c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f015d>   DW_AT_type        : <0xefab7>
 <2><f0161>: Abbrev Number: 0
 <1><f0162>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0163>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <f0167>   DW_AT_decl_file   : 9
    <f0168>   DW_AT_decl_line   : 48
    <f0169>   DW_AT_decl_column : 23
    <f016a>   DW_AT_type        : <0xf016e>
 <1><f016e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f016f>   DW_AT_byte_size   : 8
    <f016f>   DW_AT_type        : <0xf0173>
 <1><f0173>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f0174>   DW_AT_prototyped  : 1
    <f0174>   DW_AT_sibling     : <0xf0188>
 <2><f0178>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0179>   DW_AT_type        : <0xefb3f>
 <2><f017d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f017e>   DW_AT_type        : <0xefaeb>
 <2><f0182>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0183>   DW_AT_type        : <0xefab7>
 <2><f0187>: Abbrev Number: 0
 <1><f0188>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0189>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <f018d>   DW_AT_decl_file   : 9
    <f018e>   DW_AT_decl_line   : 49
    <f018f>   DW_AT_decl_column : 23
    <f0190>   DW_AT_type        : <0xf0194>
 <1><f0194>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0195>   DW_AT_byte_size   : 8
    <f0195>   DW_AT_type        : <0xf0199>
 <1><f0199>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f019a>   DW_AT_prototyped  : 1
    <f019a>   DW_AT_sibling     : <0xf01ae>
 <2><f019e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f019f>   DW_AT_type        : <0xefe02>
 <2><f01a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01a4>   DW_AT_type        : <0xefaeb>
 <2><f01a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01a9>   DW_AT_type        : <0xefab7>
 <2><f01ad>: Abbrev Number: 0
 <1><f01ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <f01af>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <f01b3>   DW_AT_decl_file   : 9
    <f01b4>   DW_AT_decl_line   : 51
    <f01b5>   DW_AT_decl_column : 24
    <f01b6>   DW_AT_type        : <0xf01ba>
 <1><f01ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f01bb>   DW_AT_byte_size   : 8
    <f01bb>   DW_AT_type        : <0xf01bf>
 <1><f01bf>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f01c0>   DW_AT_prototyped  : 1
    <f01c0>   DW_AT_type        : <0xefadf>
    <f01c4>   DW_AT_sibling     : <0xf01d3>
 <2><f01c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01c9>   DW_AT_type        : <0xefadf>
 <2><f01cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01ce>   DW_AT_type        : <0xefb1c>
 <2><f01d2>: Abbrev Number: 0
 <1><f01d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <f01d4>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <f01d8>   DW_AT_decl_file   : 9
    <f01d9>   DW_AT_decl_line   : 54
    <f01da>   DW_AT_decl_column : 23
    <f01db>   DW_AT_type        : <0xf01df>
 <1><f01df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f01e0>   DW_AT_byte_size   : 8
    <f01e0>   DW_AT_type        : <0xf01e4>
 <1><f01e4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f01e5>   DW_AT_prototyped  : 1
    <f01e5>   DW_AT_type        : <0xefab7>
    <f01e9>   DW_AT_sibling     : <0xf020c>
 <2><f01ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01ee>   DW_AT_type        : <0xefe62>
 <2><f01f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01f3>   DW_AT_type        : <0xefad1>
 <2><f01f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01f8>   DW_AT_type        : <0xefb1c>
 <2><f01fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f01fd>   DW_AT_type        : <0xefab7>
 <2><f0201>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0202>   DW_AT_type        : <0xefab7>
 <2><f0206>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0207>   DW_AT_type        : <0xefab7>
 <2><f020b>: Abbrev Number: 0
 <1><f020c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f020d>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <f0211>   DW_AT_decl_file   : 9
    <f0212>   DW_AT_decl_line   : 56
    <f0213>   DW_AT_decl_column : 23
    <f0214>   DW_AT_type        : <0xf0218>
 <1><f0218>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0219>   DW_AT_byte_size   : 8
    <f0219>   DW_AT_type        : <0xf021d>
 <1><f021d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f021e>   DW_AT_prototyped  : 1
    <f021e>   DW_AT_type        : <0xefab7>
    <f0222>   DW_AT_sibling     : <0xf0240>
 <2><f0226>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0227>   DW_AT_type        : <0xefe02>
 <2><f022b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f022c>   DW_AT_type        : <0xefbab>
 <2><f0230>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0231>   DW_AT_type        : <0xefb1c>
 <2><f0235>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0236>   DW_AT_type        : <0xefab7>
 <2><f023a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f023b>   DW_AT_type        : <0xefab7>
 <2><f023f>: Abbrev Number: 0
 <1><f0240>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0241>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <f0245>   DW_AT_decl_file   : 9
    <f0246>   DW_AT_decl_line   : 67
    <f0247>   DW_AT_decl_column : 23
    <f0248>   DW_AT_type        : <0xf024c>
 <1><f024c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f024d>   DW_AT_byte_size   : 8
    <f024d>   DW_AT_type        : <0xf0251>
 <1><f0251>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0252>   DW_AT_prototyped  : 1
    <f0252>   DW_AT_type        : <0xefab7>
    <f0256>   DW_AT_sibling     : <0xf0260>
 <2><f025a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f025b>   DW_AT_type        : <0xefab7>
 <2><f025f>: Abbrev Number: 0
 <1><f0260>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0261>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <f0265>   DW_AT_decl_file   : 9
    <f0266>   DW_AT_decl_line   : 68
    <f0267>   DW_AT_decl_column : 23
    <f0268>   DW_AT_type        : <0xf026c>
 <1><f026c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f026d>   DW_AT_byte_size   : 8
    <f026d>   DW_AT_type        : <0xf0271>
 <1><f0271>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0272>   DW_AT_prototyped  : 1
    <f0272>   DW_AT_type        : <0xefab7>
    <f0276>   DW_AT_sibling     : <0xf0294>
 <2><f027a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f027b>   DW_AT_type        : <0xf0127>
 <2><f027f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0280>   DW_AT_type        : <0xf0127>
 <2><f0284>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0285>   DW_AT_type        : <0xf0127>
 <2><f0289>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f028a>   DW_AT_type        : <0xf0127>
 <2><f028e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f028f>   DW_AT_type        : <0xf0127>
 <2><f0293>: Abbrev Number: 0
 <1><f0294>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0295>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <f0299>   DW_AT_decl_file   : 9
    <f029a>   DW_AT_decl_line   : 69
    <f029b>   DW_AT_decl_column : 23
    <f029c>   DW_AT_type        : <0xf02a0>
 <1><f02a0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f02a1>   DW_AT_byte_size   : 8
    <f02a1>   DW_AT_type        : <0xf02a5>
 <1><f02a5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f02a6>   DW_AT_prototyped  : 1
    <f02a6>   DW_AT_type        : <0xefab7>
    <f02aa>   DW_AT_sibling     : <0xf02c3>
 <2><f02ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02af>   DW_AT_type        : <0xefab7>
 <2><f02b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02b4>   DW_AT_type        : <0xefab7>
 <2><f02b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02b9>   DW_AT_type        : <0xefab7>
 <2><f02bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02be>   DW_AT_type        : <0xefab7>
 <2><f02c2>: Abbrev Number: 0
 <1><f02c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <f02c4>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <f02c8>   DW_AT_decl_file   : 9
    <f02c9>   DW_AT_decl_line   : 73
    <f02ca>   DW_AT_decl_column : 23
    <f02cb>   DW_AT_type        : <0xf02cf>
 <1><f02cf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f02d0>   DW_AT_byte_size   : 8
    <f02d0>   DW_AT_type        : <0xf02d4>
 <1><f02d4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f02d5>   DW_AT_prototyped  : 1
    <f02d5>   DW_AT_type        : <0xefab7>
    <f02d9>   DW_AT_sibling     : <0xf02e3>
 <2><f02dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02de>   DW_AT_type        : <0xefa94>
 <2><f02e2>: Abbrev Number: 0
 <1><f02e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <f02e4>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <f02e8>   DW_AT_decl_file   : 9
    <f02e9>   DW_AT_decl_line   : 74
    <f02ea>   DW_AT_decl_column : 23
    <f02eb>   DW_AT_type        : <0xf02ef>
 <1><f02ef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f02f0>   DW_AT_byte_size   : 8
    <f02f0>   DW_AT_type        : <0xf02f4>
 <1><f02f4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f02f5>   DW_AT_prototyped  : 1
    <f02f5>   DW_AT_type        : <0xefab7>
    <f02f9>   DW_AT_sibling     : <0xf0308>
 <2><f02fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f02fe>   DW_AT_type        : <0xefa94>
 <2><f0302>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0303>   DW_AT_type        : <0xefa8d>
 <2><f0307>: Abbrev Number: 0
 <1><f0308>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0309>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <f030d>   DW_AT_decl_file   : 9
    <f030e>   DW_AT_decl_line   : 80
    <f030f>   DW_AT_decl_column : 23
    <f0310>   DW_AT_type        : <0xf0077>
 <1><f0314>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0315>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <f0319>   DW_AT_decl_file   : 9
    <f031a>   DW_AT_decl_line   : 83
    <f031b>   DW_AT_decl_column : 23
    <f031c>   DW_AT_type        : <0xf024c>
 <1><f0320>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0321>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <f0325>   DW_AT_decl_file   : 9
    <f0326>   DW_AT_decl_line   : 86
    <f0327>   DW_AT_decl_column : 23
    <f0328>   DW_AT_type        : <0xf00d5>
 <1><f032c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f032d>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <f0331>   DW_AT_decl_file   : 9
    <f0332>   DW_AT_decl_line   : 89
    <f0333>   DW_AT_decl_column : 23
    <f0334>   DW_AT_type        : <0xf00d5>
 <1><f0338>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0339>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <f033d>   DW_AT_decl_file   : 9
    <f033e>   DW_AT_decl_line   : 91
    <f033f>   DW_AT_decl_column : 23
    <f0340>   DW_AT_type        : <0xf0344>
 <1><f0344>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0345>   DW_AT_byte_size   : 8
    <f0345>   DW_AT_type        : <0xf0349>
 <1><f0349>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f034a>   DW_AT_prototyped  : 1
    <f034a>   DW_AT_sibling     : <0xf0354>
 <2><f034e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f034f>   DW_AT_type        : <0xf0354>
 <2><f0353>: Abbrev Number: 0
 <1><f0354>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0355>   DW_AT_byte_size   : 8
    <f0355>   DW_AT_type        : <0xf0027>
 <1><f0359>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f035a>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f035e>   DW_AT_byte_size   : 224
    <f035f>   DW_AT_decl_file   : 9
    <f0360>   DW_AT_decl_line   : 93
    <f0361>   DW_AT_decl_column : 16
    <f0362>   DW_AT_sibling     : <0xf04d3>
 <2><f0366>: Abbrev Number: 2 (DW_TAG_member)
    <f0367>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <f036b>   DW_AT_decl_file   : 9
    <f036c>   DW_AT_decl_line   : 94
    <f036d>   DW_AT_decl_column : 23
    <f036e>   DW_AT_type        : <0xf0033>
    <f0372>   DW_AT_data_member_location: 0
 <2><f0373>: Abbrev Number: 2 (DW_TAG_member)
    <f0374>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <f0378>   DW_AT_decl_file   : 9
    <f0379>   DW_AT_decl_line   : 95
    <f037a>   DW_AT_decl_column : 23
    <f037b>   DW_AT_type        : <0xf0049>
    <f037f>   DW_AT_data_member_location: 8
 <2><f0380>: Abbrev Number: 2 (DW_TAG_member)
    <f0381>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <f0385>   DW_AT_decl_file   : 9
    <f0386>   DW_AT_decl_line   : 96
    <f0387>   DW_AT_decl_column : 23
    <f0388>   DW_AT_type        : <0xf005f>
    <f038c>   DW_AT_data_member_location: 16
 <2><f038d>: Abbrev Number: 2 (DW_TAG_member)
    <f038e>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <f0392>   DW_AT_decl_file   : 9
    <f0393>   DW_AT_decl_line   : 97
    <f0394>   DW_AT_decl_column : 23
    <f0395>   DW_AT_type        : <0xf006b>
    <f0399>   DW_AT_data_member_location: 24
 <2><f039a>: Abbrev Number: 2 (DW_TAG_member)
    <f039b>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <f039f>   DW_AT_decl_file   : 9
    <f03a0>   DW_AT_decl_line   : 98
    <f03a1>   DW_AT_decl_column : 23
    <f03a2>   DW_AT_type        : <0xf0087>
    <f03a6>   DW_AT_data_member_location: 32
 <2><f03a7>: Abbrev Number: 2 (DW_TAG_member)
    <f03a8>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <f03ac>   DW_AT_decl_file   : 9
    <f03ad>   DW_AT_decl_line   : 99
    <f03ae>   DW_AT_decl_column : 23
    <f03af>   DW_AT_type        : <0xf00b1>
    <f03b3>   DW_AT_data_member_location: 40
 <2><f03b4>: Abbrev Number: 2 (DW_TAG_member)
    <f03b5>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <f03b9>   DW_AT_decl_file   : 9
    <f03ba>   DW_AT_decl_line   : 100
    <f03bb>   DW_AT_decl_column : 23
    <f03bc>   DW_AT_type        : <0xf00c9>
    <f03c0>   DW_AT_data_member_location: 48
 <2><f03c1>: Abbrev Number: 2 (DW_TAG_member)
    <f03c2>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <f03c6>   DW_AT_decl_file   : 9
    <f03c7>   DW_AT_decl_line   : 101
    <f03c8>   DW_AT_decl_column : 23
    <f03c9>   DW_AT_type        : <0xf00ee>
    <f03cd>   DW_AT_data_member_location: 56
 <2><f03ce>: Abbrev Number: 2 (DW_TAG_member)
    <f03cf>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <f03d3>   DW_AT_decl_file   : 9
    <f03d4>   DW_AT_decl_line   : 102
    <f03d5>   DW_AT_decl_column : 23
    <f03d6>   DW_AT_type        : <0xf00fa>
    <f03da>   DW_AT_data_member_location: 64
 <2><f03db>: Abbrev Number: 2 (DW_TAG_member)
    <f03dc>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <f03e0>   DW_AT_decl_file   : 9
    <f03e1>   DW_AT_decl_line   : 103
    <f03e2>   DW_AT_decl_column : 23
    <f03e3>   DW_AT_type        : <0xf0106>
    <f03e7>   DW_AT_data_member_location: 72
 <2><f03e8>: Abbrev Number: 2 (DW_TAG_member)
    <f03e9>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <f03ed>   DW_AT_decl_file   : 9
    <f03ee>   DW_AT_decl_line   : 104
    <f03ef>   DW_AT_decl_column : 23
    <f03f0>   DW_AT_type        : <0xf012c>
    <f03f4>   DW_AT_data_member_location: 80
 <2><f03f5>: Abbrev Number: 2 (DW_TAG_member)
    <f03f6>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <f03fa>   DW_AT_decl_file   : 9
    <f03fb>   DW_AT_decl_line   : 105
    <f03fc>   DW_AT_decl_column : 24
    <f03fd>   DW_AT_type        : <0xf0162>
    <f0401>   DW_AT_data_member_location: 88
 <2><f0402>: Abbrev Number: 2 (DW_TAG_member)
    <f0403>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <f0407>   DW_AT_decl_file   : 9
    <f0408>   DW_AT_decl_line   : 106
    <f0409>   DW_AT_decl_column : 25
    <f040a>   DW_AT_type        : <0xf0188>
    <f040e>   DW_AT_data_member_location: 96
 <2><f040f>: Abbrev Number: 2 (DW_TAG_member)
    <f0410>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <f0414>   DW_AT_decl_file   : 9
    <f0415>   DW_AT_decl_line   : 107
    <f0416>   DW_AT_decl_column : 23
    <f0417>   DW_AT_type        : <0xf01ae>
    <f041b>   DW_AT_data_member_location: 104
 <2><f041c>: Abbrev Number: 2 (DW_TAG_member)
    <f041d>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <f0421>   DW_AT_decl_file   : 9
    <f0422>   DW_AT_decl_line   : 108
    <f0423>   DW_AT_decl_column : 23
    <f0424>   DW_AT_type        : <0xf0240>
    <f0428>   DW_AT_data_member_location: 112
 <2><f0429>: Abbrev Number: 2 (DW_TAG_member)
    <f042a>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <f042e>   DW_AT_decl_file   : 9
    <f042f>   DW_AT_decl_line   : 109
    <f0430>   DW_AT_decl_column : 23
    <f0431>   DW_AT_type        : <0xf0260>
    <f0435>   DW_AT_data_member_location: 120
 <2><f0436>: Abbrev Number: 2 (DW_TAG_member)
    <f0437>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <f043b>   DW_AT_decl_file   : 9
    <f043c>   DW_AT_decl_line   : 110
    <f043d>   DW_AT_decl_column : 23
    <f043e>   DW_AT_type        : <0xf0294>
    <f0442>   DW_AT_data_member_location: 128
 <2><f0443>: Abbrev Number: 2 (DW_TAG_member)
    <f0444>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <f0448>   DW_AT_decl_file   : 9
    <f0449>   DW_AT_decl_line   : 111
    <f044a>   DW_AT_decl_column : 23
    <f044b>   DW_AT_type        : <0xf02c3>
    <f044f>   DW_AT_data_member_location: 136
 <2><f0450>: Abbrev Number: 2 (DW_TAG_member)
    <f0451>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <f0455>   DW_AT_decl_file   : 9
    <f0456>   DW_AT_decl_line   : 112
    <f0457>   DW_AT_decl_column : 23
    <f0458>   DW_AT_type        : <0xf02e3>
    <f045c>   DW_AT_data_member_location: 144
 <2><f045d>: Abbrev Number: 2 (DW_TAG_member)
    <f045e>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <f0462>   DW_AT_decl_file   : 9
    <f0463>   DW_AT_decl_line   : 113
    <f0464>   DW_AT_decl_column : 25
    <f0465>   DW_AT_type        : <0xf00bd>
    <f0469>   DW_AT_data_member_location: 152
 <2><f046a>: Abbrev Number: 2 (DW_TAG_member)
    <f046b>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <f046f>   DW_AT_decl_file   : 9
    <f0470>   DW_AT_decl_line   : 114
    <f0471>   DW_AT_decl_column : 24
    <f0472>   DW_AT_type        : <0xf01d3>
    <f0476>   DW_AT_data_member_location: 160
 <2><f0477>: Abbrev Number: 2 (DW_TAG_member)
    <f0478>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <f047c>   DW_AT_decl_file   : 9
    <f047d>   DW_AT_decl_line   : 115
    <f047e>   DW_AT_decl_column : 25
    <f047f>   DW_AT_type        : <0xf020c>
    <f0483>   DW_AT_data_member_location: 168
 <2><f0484>: Abbrev Number: 2 (DW_TAG_member)
    <f0485>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <f0489>   DW_AT_decl_file   : 9
    <f048a>   DW_AT_decl_line   : 116
    <f048b>   DW_AT_decl_column : 23
    <f048c>   DW_AT_type        : <0xf0138>
    <f0490>   DW_AT_data_member_location: 176
 <2><f0491>: Abbrev Number: 2 (DW_TAG_member)
    <f0492>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <f0496>   DW_AT_decl_file   : 9
    <f0497>   DW_AT_decl_line   : 117
    <f0498>   DW_AT_decl_column : 23
    <f0499>   DW_AT_type        : <0xf0308>
    <f049d>   DW_AT_data_member_location: 184
 <2><f049e>: Abbrev Number: 2 (DW_TAG_member)
    <f049f>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <f04a3>   DW_AT_decl_file   : 9
    <f04a4>   DW_AT_decl_line   : 118
    <f04a5>   DW_AT_decl_column : 22
    <f04a6>   DW_AT_type        : <0xf0314>
    <f04aa>   DW_AT_data_member_location: 192
 <2><f04ab>: Abbrev Number: 2 (DW_TAG_member)
    <f04ac>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <f04b0>   DW_AT_decl_file   : 9
    <f04b1>   DW_AT_decl_line   : 119
    <f04b2>   DW_AT_decl_column : 23
    <f04b3>   DW_AT_type        : <0xf0320>
    <f04b7>   DW_AT_data_member_location: 200
 <2><f04b8>: Abbrev Number: 2 (DW_TAG_member)
    <f04b9>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <f04bd>   DW_AT_decl_file   : 9
    <f04be>   DW_AT_decl_line   : 120
    <f04bf>   DW_AT_decl_column : 22
    <f04c0>   DW_AT_type        : <0xf032c>
    <f04c4>   DW_AT_data_member_location: 208
 <2><f04c5>: Abbrev Number: 2 (DW_TAG_member)
    <f04c6>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <f04ca>   DW_AT_decl_file   : 9
    <f04cb>   DW_AT_decl_line   : 121
    <f04cc>   DW_AT_decl_column : 23
    <f04cd>   DW_AT_type        : <0xf0338>
    <f04d1>   DW_AT_data_member_location: 216
 <2><f04d2>: Abbrev Number: 0
 <1><f04d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <f04d4>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f04d8>   DW_AT_decl_file   : 9
    <f04d9>   DW_AT_decl_line   : 122
    <f04da>   DW_AT_decl_column : 3
    <f04db>   DW_AT_type        : <0xf0359>
 <1><f04df>: Abbrev Number: 33 (DW_TAG_structure_type)
    <f04e0>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <f04e4>   DW_AT_byte_size   : 20848
    <f04e6>   DW_AT_decl_file   : 10
    <f04e7>   DW_AT_decl_line   : 349
    <f04e9>   DW_AT_decl_column : 16
    <f04ea>   DW_AT_sibling     : <0xf055f>
 <2><f04ee>: Abbrev Number: 10 (DW_TAG_member)
    <f04ef>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <f04f3>   DW_AT_decl_file   : 10
    <f04f3>   DW_AT_decl_line   : 350
    <f04f5>   DW_AT_decl_column : 18
    <f04f5>   DW_AT_type        : <0xefab7>
    <f04f9>   DW_AT_data_member_location: 0
 <2><f04fa>: Abbrev Number: 10 (DW_TAG_member)
    <f04fb>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <f04ff>   DW_AT_decl_file   : 10
    <f04ff>   DW_AT_decl_line   : 351
    <f0501>   DW_AT_decl_column : 18
    <f0501>   DW_AT_type        : <0xefb45>
    <f0505>   DW_AT_data_member_location: 8
 <2><f0506>: Abbrev Number: 10 (DW_TAG_member)
    <f0507>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <f050b>   DW_AT_decl_file   : 10
    <f050b>   DW_AT_decl_line   : 352
    <f050d>   DW_AT_decl_column : 18
    <f050d>   DW_AT_type        : <0xefb91>
    <f0511>   DW_AT_data_member_location: 16
 <2><f0512>: Abbrev Number: 10 (DW_TAG_member)
    <f0513>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <f0517>   DW_AT_decl_file   : 10
    <f0517>   DW_AT_decl_line   : 353
    <f0519>   DW_AT_decl_column : 18
    <f0519>   DW_AT_type        : <0xefadf>
    <f051d>   DW_AT_data_member_location: 40
 <2><f051e>: Abbrev Number: 10 (DW_TAG_member)
    <f051f>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f0523>   DW_AT_decl_file   : 10
    <f0523>   DW_AT_decl_line   : 354
    <f0525>   DW_AT_decl_column : 18
    <f0525>   DW_AT_type        : <0xf04d3>
    <f0529>   DW_AT_data_member_location: 48
 <2><f052a>: Abbrev Number: 13 (DW_TAG_member)
    <f052b>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <f052f>   DW_AT_decl_file   : 10
    <f052f>   DW_AT_decl_line   : 355
    <f0531>   DW_AT_decl_column : 18
    <f0531>   DW_AT_type        : <0xf055f>
    <f0535>   DW_AT_data_member_location: 272
 <2><f0537>: Abbrev Number: 13 (DW_TAG_member)
    <f0538>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <f053c>   DW_AT_decl_file   : 10
    <f053c>   DW_AT_decl_line   : 356
    <f053e>   DW_AT_decl_column : 18
    <f053e>   DW_AT_type        : <0xefab7>
    <f0542>   DW_AT_data_member_location: 20832
 <2><f0544>: Abbrev Number: 13 (DW_TAG_member)
    <f0545>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <f0549>   DW_AT_decl_file   : 10
    <f0549>   DW_AT_decl_line   : 357
    <f054b>   DW_AT_decl_column : 18
    <f054b>   DW_AT_type        : <0xefab7>
    <f054f>   DW_AT_data_member_location: 20836
 <2><f0551>: Abbrev Number: 13 (DW_TAG_member)
    <f0552>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <f0556>   DW_AT_decl_file   : 10
    <f0556>   DW_AT_decl_line   : 358
    <f0558>   DW_AT_decl_column : 18
    <f0558>   DW_AT_type        : <0xefb56>
    <f055c>   DW_AT_data_member_location: 20840
 <2><f055e>: Abbrev Number: 0
 <1><f055f>: Abbrev Number: 16 (DW_TAG_array_type)
    <f0560>   DW_AT_type        : <0xeff72>
    <f0564>   DW_AT_sibling     : <0xf0570>
 <2><f0568>: Abbrev Number: 34 (DW_TAG_subrange_type)
    <f0569>   DW_AT_type        : <0xefaa2>
    <f056d>   DW_AT_upper_bound : 256
 <2><f056f>: Abbrev Number: 0
 <1><f0570>: Abbrev Number: 15 (DW_TAG_typedef)
    <f0571>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <f0575>   DW_AT_decl_file   : 10
    <f0576>   DW_AT_decl_line   : 359
    <f0578>   DW_AT_decl_column : 3
    <f0579>   DW_AT_type        : <0xf04df>
 <1><f057d>: Abbrev Number: 35 (DW_TAG_variable)
    <f057e>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <f0582>   DW_AT_decl_file   : 10
    <f0583>   DW_AT_decl_line   : 361
    <f0585>   DW_AT_decl_column : 21
    <f0586>   DW_AT_type        : <0xf0570>
    <f058a>   DW_AT_external    : 1
    <f058a>   DW_AT_declaration : 1
 <1><f058a>: Abbrev Number: 36 (DW_TAG_subprogram)
    <f058b>   DW_AT_external    : 1
    <f058b>   DW_AT_name        : (indirect string, offset: 0x1da7f): fb_ConsoleGetMouse
    <f058f>   DW_AT_decl_file   : 11
    <f0590>   DW_AT_decl_line   : 75
    <f0591>   DW_AT_decl_column : 21
    <f0592>   DW_AT_prototyped  : 1
    <f0592>   DW_AT_type        : <0xefab7>
    <f0596>   DW_AT_declaration : 1
    <f0596>   DW_AT_sibling     : <0xf05b4>
 <2><f059a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f059b>   DW_AT_type        : <0xf0127>
 <2><f059f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f05a0>   DW_AT_type        : <0xf0127>
 <2><f05a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f05a5>   DW_AT_type        : <0xf0127>
 <2><f05a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f05aa>   DW_AT_type        : <0xf0127>
 <2><f05ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f05af>   DW_AT_type        : <0xf0127>
 <2><f05b3>: Abbrev Number: 0
 <1><f05b4>: Abbrev Number: 37 (DW_TAG_subprogram)
    <f05b5>   DW_AT_external    : 1
    <f05b5>   DW_AT_name        : (indirect string, offset: 0x1b5f7): fb_GetMouse
    <f05b9>   DW_AT_decl_file   : 1
    <f05ba>   DW_AT_decl_line   : 3
    <f05bb>   DW_AT_decl_column : 12
    <f05bc>   DW_AT_prototyped  : 1
    <f05bc>   DW_AT_type        : <0xefab7>
    <f05c0>   DW_AT_low_pc      : 0x47afb0
    <f05c8>   DW_AT_high_pc     : 0x15
    <f05d0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f05d2>   DW_AT_call_all_calls: 1
 <2><f05d2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f05d3>   DW_AT_name        : x
    <f05d5>   DW_AT_decl_file   : 1
    <f05d5>   DW_AT_decl_line   : 3
    <f05d5>   DW_AT_decl_column : 30
    <f05d6>   DW_AT_type        : <0xf0127>
    <f05da>   DW_AT_location    : 0x44805 (location list)
    <f05de>   DW_AT_GNU_locviews: 0x447fd
 <2><f05e2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f05e3>   DW_AT_name        : y
    <f05e5>   DW_AT_decl_file   : 1
    <f05e5>   DW_AT_decl_line   : 3
    <f05e5>   DW_AT_decl_column : 38
    <f05e6>   DW_AT_type        : <0xf0127>
    <f05ea>   DW_AT_location    : 0x44828 (location list)
    <f05ee>   DW_AT_GNU_locviews: 0x44820
 <2><f05f2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f05f3>   DW_AT_name        : z
    <f05f5>   DW_AT_decl_file   : 1
    <f05f5>   DW_AT_decl_line   : 3
    <f05f5>   DW_AT_decl_column : 46
    <f05f6>   DW_AT_type        : <0xf0127>
    <f05fa>   DW_AT_location    : 0x4484b (location list)
    <f05fe>   DW_AT_GNU_locviews: 0x44843
 <2><f0602>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <f0603>   DW_AT_name        : (indirect string, offset: 0x192ee): buttons
    <f0607>   DW_AT_decl_file   : 1
    <f0607>   DW_AT_decl_line   : 3
    <f0607>   DW_AT_decl_column : 54
    <f0608>   DW_AT_type        : <0xf0127>
    <f060c>   DW_AT_location    : 0x4486e (location list)
    <f0610>   DW_AT_GNU_locviews: 0x44866
 <2><f0614>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <f0615>   DW_AT_name        : (indirect string, offset: 0x19429): clip
    <f0619>   DW_AT_decl_file   : 1
    <f0619>   DW_AT_decl_line   : 3
    <f0619>   DW_AT_decl_column : 68
    <f061a>   DW_AT_type        : <0xf0127>
    <f061e>   DW_AT_location    : 0x44891 (location list)
    <f0622>   DW_AT_GNU_locviews: 0x44889
 <2><f0626>: Abbrev Number: 38 (DW_TAG_variable)
    <f0627>   DW_AT_name        : res
    <f062b>   DW_AT_decl_file   : 1
    <f062c>   DW_AT_decl_line   : 5
    <f062d>   DW_AT_decl_column : 6
    <f062e>   DW_AT_type        : <0xefab7>
 <2><f0632>: Abbrev Number: 39 (DW_TAG_call_site)
    <f0633>   DW_AT_call_return_pc: 0x47afbe
    <f063b>   DW_AT_call_tail_call: 1
    <f063b>   DW_AT_sibling     : <0xf0663>
 <3><f063f>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <f0640>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f0642>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><f0646>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <f0647>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f0649>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><f064d>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <f064e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f0650>   DW_AT_call_value  : 3 byte block: a3 1 51 	(DW_OP_entry_value: (DW_OP_reg1 (rdx)))
 <3><f0654>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <f0655>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f0657>   DW_AT_call_value  : 3 byte block: a3 1 52 	(DW_OP_entry_value: (DW_OP_reg2 (rcx)))
 <3><f065b>: Abbrev Number: 11 (DW_TAG_call_site_parameter)
    <f065c>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <f065e>   DW_AT_call_value  : 3 byte block: a3 1 58 	(DW_OP_entry_value: (DW_OP_reg8 (r8)))
 <3><f0662>: Abbrev Number: 0
 <2><f0663>: Abbrev Number: 40 (DW_TAG_call_site)
    <f0664>   DW_AT_call_return_pc: 0x47afc5
    <f066c>   DW_AT_call_tail_call: 1
    <f066c>   DW_AT_call_origin : <0xf058a>
 <2><f0670>: Abbrev Number: 0
 <1><f0671>: Abbrev Number: 0
  Compilation Unit @ offset 0xf0672:
   Length:        0xb58 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x19f5f
   Pointer Size:  8
 <0><f067e>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <f067f>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <f0683>   DW_AT_language    : 29	(C11)
    <f0684>   DW_AT_name        : (indirect line string, offset: 0x19a2): src/rtlib/hook_view_update.c
    <f0688>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <f068c>   DW_AT_low_pc      : 0x47afd0
    <f0694>   DW_AT_high_pc     : 0x15
    <f069c>   DW_AT_stmt_list   : 0x70b8e
 <1><f06a0>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06a1>   DW_AT_byte_size   : 1
    <f06a2>   DW_AT_encoding    : 8	(unsigned char)
    <f06a3>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f06a7>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06a8>   DW_AT_byte_size   : 2
    <f06a9>   DW_AT_encoding    : 7	(unsigned)
    <f06aa>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f06ae>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06af>   DW_AT_byte_size   : 4
    <f06b0>   DW_AT_encoding    : 7	(unsigned)
    <f06b1>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f06b5>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06b6>   DW_AT_byte_size   : 8
    <f06b7>   DW_AT_encoding    : 7	(unsigned)
    <f06b8>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f06bc>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06bd>   DW_AT_byte_size   : 1
    <f06be>   DW_AT_encoding    : 6	(signed char)
    <f06bf>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f06c3>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06c4>   DW_AT_byte_size   : 2
    <f06c5>   DW_AT_encoding    : 5	(signed)
    <f06c6>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f06ca>: Abbrev Number: 20 (DW_TAG_base_type)
    <f06cb>   DW_AT_byte_size   : 4
    <f06cc>   DW_AT_encoding    : 5	(signed)
    <f06cd>   DW_AT_name        : int
 <1><f06d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06d2>   DW_AT_byte_size   : 8
    <f06d3>   DW_AT_encoding    : 5	(signed)
    <f06d4>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f06d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <f06d9>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f06dd>   DW_AT_decl_file   : 2
    <f06de>   DW_AT_decl_line   : 153
    <f06df>   DW_AT_decl_column : 27
    <f06e0>   DW_AT_type        : <0xf06d1>
 <1><f06e4>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <f06e5>   DW_AT_byte_size   : 8
 <1><f06e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <f06e7>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <f06eb>   DW_AT_decl_file   : 2
    <f06ec>   DW_AT_decl_line   : 194
    <f06ed>   DW_AT_decl_column : 27
    <f06ee>   DW_AT_type        : <0xf06d1>
 <1><f06f2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f06f3>   DW_AT_byte_size   : 8
    <f06f3>   DW_AT_type        : <0xf06f7>
 <1><f06f7>: Abbrev Number: 6 (DW_TAG_base_type)
    <f06f8>   DW_AT_byte_size   : 1
    <f06f9>   DW_AT_encoding    : 6	(signed char)
    <f06fa>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f06fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <f06ff>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f0703>   DW_AT_decl_file   : 3
    <f0704>   DW_AT_decl_line   : 209
    <f0705>   DW_AT_decl_column : 23
    <f0706>   DW_AT_type        : <0xf06b5>
 <1><f070a>: Abbrev Number: 13 (DW_TAG_typedef)
    <f070b>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <f070f>   DW_AT_decl_file   : 3
    <f0710>   DW_AT_decl_line   : 321
    <f0712>   DW_AT_decl_column : 24
    <f0713>   DW_AT_type        : <0xf06ca>
 <1><f0717>: Abbrev Number: 22 (DW_TAG_const_type)
    <f0718>   DW_AT_type        : <0xf070a>
 <1><f071c>: Abbrev Number: 6 (DW_TAG_base_type)
    <f071d>   DW_AT_byte_size   : 8
    <f071e>   DW_AT_encoding    : 5	(signed)
    <f071f>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f0723>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0724>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <f0728>   DW_AT_decl_file   : 4
    <f0729>   DW_AT_decl_line   : 87
    <f072a>   DW_AT_decl_column : 19
    <f072b>   DW_AT_type        : <0xf06d8>
 <1><f072f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0730>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <f0734>   DW_AT_decl_file   : 4
    <f0735>   DW_AT_decl_line   : 108
    <f0736>   DW_AT_decl_column : 19
    <f0737>   DW_AT_type        : <0xf06e6>
 <1><f073b>: Abbrev Number: 6 (DW_TAG_base_type)
    <f073c>   DW_AT_byte_size   : 8
    <f073d>   DW_AT_encoding    : 7	(unsigned)
    <f073e>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f0742>: Abbrev Number: 14 (DW_TAG_array_type)
    <f0743>   DW_AT_type        : <0xf06f7>
    <f0747>   DW_AT_sibling     : <0xf0752>
 <2><f074b>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <f074c>   DW_AT_type        : <0xf06b5>
    <f0750>   DW_AT_upper_bound : 3
 <2><f0751>: Abbrev Number: 0
 <1><f0752>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0753>   DW_AT_byte_size   : 8
    <f0753>   DW_AT_type        : <0xf0757>
 <1><f0757>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><f0758>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0759>   DW_AT_byte_size   : 8
    <f0759>   DW_AT_type        : <0xf06f2>
 <1><f075d>: Abbrev Number: 3 (DW_TAG_typedef)
    <f075e>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <f0762>   DW_AT_decl_file   : 5
    <f0763>   DW_AT_decl_line   : 22
    <f0764>   DW_AT_decl_column : 15
    <f0765>   DW_AT_type        : <0xf0723>
 <1><f0769>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f076a>   DW_AT_byte_size   : 8
    <f076a>   DW_AT_type        : <0xf076e>
 <1><f076e>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <f076f>   DW_AT_prototyped  : 1
 <1><f076f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f0770>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <f0774>   DW_AT_byte_size   : 24
    <f0775>   DW_AT_decl_file   : 6
    <f0776>   DW_AT_decl_line   : 82
    <f0777>   DW_AT_decl_column : 16
    <f0778>   DW_AT_sibling     : <0xf07a4>
 <2><f077c>: Abbrev Number: 2 (DW_TAG_member)
    <f077d>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <f0781>   DW_AT_decl_file   : 6
    <f0782>   DW_AT_decl_line   : 83
    <f0783>   DW_AT_decl_column : 21
    <f0784>   DW_AT_type        : <0xf06f2>
    <f0788>   DW_AT_data_member_location: 0
 <2><f0789>: Abbrev Number: 7 (DW_TAG_member)
    <f078a>   DW_AT_name        : len
    <f078e>   DW_AT_decl_file   : 6
    <f078f>   DW_AT_decl_line   : 84
    <f0790>   DW_AT_decl_column : 21
    <f0791>   DW_AT_type        : <0xf072f>
    <f0795>   DW_AT_data_member_location: 8
 <2><f0796>: Abbrev Number: 2 (DW_TAG_member)
    <f0797>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f079b>   DW_AT_decl_file   : 6
    <f079c>   DW_AT_decl_line   : 85
    <f079d>   DW_AT_decl_column : 21
    <f079e>   DW_AT_type        : <0xf072f>
    <f07a2>   DW_AT_data_member_location: 16
 <2><f07a3>: Abbrev Number: 0
 <1><f07a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <f07a5>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <f07a9>   DW_AT_decl_file   : 6
    <f07aa>   DW_AT_decl_line   : 86
    <f07ab>   DW_AT_decl_column : 3
    <f07ac>   DW_AT_type        : <0xf076f>
 <1><f07b0>: Abbrev Number: 6 (DW_TAG_base_type)
    <f07b1>   DW_AT_byte_size   : 8
    <f07b2>   DW_AT_encoding    : 4	(float)
    <f07b3>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><f07b7>: Abbrev Number: 6 (DW_TAG_base_type)
    <f07b8>   DW_AT_byte_size   : 4
    <f07b9>   DW_AT_encoding    : 4	(float)
    <f07ba>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><f07be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f07bf>   DW_AT_byte_size   : 8
    <f07bf>   DW_AT_type        : <0xf070a>
 <1><f07c3>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <f07c4>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <f07c8>   DW_AT_encoding    : 7	(unsigned)
    <f07c9>   DW_AT_byte_size   : 4
    <f07ca>   DW_AT_type        : <0xf06ae>
    <f07ce>   DW_AT_decl_file   : 7
    <f07cf>   DW_AT_decl_line   : 25
    <f07d0>   DW_AT_decl_column : 14
    <f07d1>   DW_AT_sibling     : <0xf07ee>
 <2><f07d5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f07d6>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <f07da>   DW_AT_const_value : 0
 <2><f07db>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f07dc>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <f07e0>   DW_AT_const_value : 1
 <2><f07e1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f07e2>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <f07e6>   DW_AT_const_value : 2
 <2><f07e7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f07e8>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <f07ec>   DW_AT_const_value : 3
 <2><f07ed>: Abbrev Number: 0
 <1><f07ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <f07ef>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <f07f3>   DW_AT_decl_file   : 7
    <f07f4>   DW_AT_decl_line   : 30
    <f07f5>   DW_AT_decl_column : 3
    <f07f6>   DW_AT_type        : <0xf07c3>
 <1><f07fa>: Abbrev Number: 3 (DW_TAG_typedef)
    <f07fb>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <f07ff>   DW_AT_decl_file   : 7
    <f0800>   DW_AT_decl_line   : 54
    <f0801>   DW_AT_decl_column : 15
    <f0802>   DW_AT_type        : <0xf0806>
 <1><f0806>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0807>   DW_AT_byte_size   : 8
    <f0807>   DW_AT_type        : <0xf080b>
 <1><f080b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f080c>   DW_AT_prototyped  : 1
    <f080c>   DW_AT_type        : <0xf06ca>
    <f0810>   DW_AT_sibling     : <0xf081f>
 <2><f0814>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0815>   DW_AT_type        : <0xf081f>
 <2><f0819>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f081a>   DW_AT_type        : <0xf06ca>
 <2><f081e>: Abbrev Number: 0
 <1><f081f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0820>   DW_AT_byte_size   : 8
    <f0820>   DW_AT_type        : <0xf0824>
 <1><f0824>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f0825>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <f0829>   DW_AT_byte_size   : 80
    <f082a>   DW_AT_decl_file   : 7
    <f082b>   DW_AT_decl_line   : 97
    <f082c>   DW_AT_decl_column : 16
    <f082d>   DW_AT_sibling     : <0xf08e8>
 <2><f0831>: Abbrev Number: 2 (DW_TAG_member)
    <f0832>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <f0836>   DW_AT_decl_file   : 7
    <f0837>   DW_AT_decl_line   : 98
    <f0838>   DW_AT_decl_column : 21
    <f0839>   DW_AT_type        : <0xf06ca>
    <f083d>   DW_AT_data_member_location: 0
 <2><f083e>: Abbrev Number: 7 (DW_TAG_member)
    <f083f>   DW_AT_name        : len
    <f0843>   DW_AT_decl_file   : 7
    <f0844>   DW_AT_decl_line   : 99
    <f0845>   DW_AT_decl_column : 21
    <f0846>   DW_AT_type        : <0xf06ca>
    <f084a>   DW_AT_data_member_location: 4
 <2><f084b>: Abbrev Number: 2 (DW_TAG_member)
    <f084c>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <f0850>   DW_AT_decl_file   : 7
    <f0851>   DW_AT_decl_line   : 100
    <f0852>   DW_AT_decl_column : 21
    <f0853>   DW_AT_type        : <0xf07ee>
    <f0857>   DW_AT_data_member_location: 8
 <2><f0858>: Abbrev Number: 2 (DW_TAG_member)
    <f0859>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f085d>   DW_AT_decl_file   : 7
    <f085e>   DW_AT_decl_line   : 101
    <f085f>   DW_AT_decl_column : 21
    <f0860>   DW_AT_type        : <0xf075d>
    <f0864>   DW_AT_data_member_location: 16
 <2><f0865>: Abbrev Number: 2 (DW_TAG_member)
    <f0866>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f086a>   DW_AT_decl_file   : 7
    <f086b>   DW_AT_decl_line   : 102
    <f086c>   DW_AT_decl_column : 21
    <f086d>   DW_AT_type        : <0xf06ca>
    <f0871>   DW_AT_data_member_location: 24
 <2><f0872>: Abbrev Number: 2 (DW_TAG_member)
    <f0873>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <f0877>   DW_AT_decl_file   : 7
    <f0878>   DW_AT_decl_line   : 103
    <f0879>   DW_AT_decl_column : 21
    <f087a>   DW_AT_type        : <0xf06ca>
    <f087e>   DW_AT_data_member_location: 28
 <2><f087f>: Abbrev Number: 2 (DW_TAG_member)
    <f0880>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <f0884>   DW_AT_decl_file   : 7
    <f0885>   DW_AT_decl_line   : 104
    <f0886>   DW_AT_decl_column : 21
    <f0887>   DW_AT_type        : <0xf06ca>
    <f088b>   DW_AT_data_member_location: 32
 <2><f088c>: Abbrev Number: 2 (DW_TAG_member)
    <f088d>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <f0891>   DW_AT_decl_file   : 7
    <f0892>   DW_AT_decl_line   : 105
    <f0893>   DW_AT_decl_column : 21
    <f0894>   DW_AT_type        : <0xf06ae>
    <f0898>   DW_AT_data_member_location: 36
 <2><f0899>: Abbrev Number: 2 (DW_TAG_member)
    <f089a>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <f089e>   DW_AT_decl_file   : 7
    <f089f>   DW_AT_decl_line   : 106
    <f08a0>   DW_AT_decl_column : 21
    <f08a1>   DW_AT_type        : <0xf06ae>
    <f08a5>   DW_AT_data_member_location: 40
 <2><f08a6>: Abbrev Number: 2 (DW_TAG_member)
    <f08a7>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <f08ab>   DW_AT_decl_file   : 7
    <f08ac>   DW_AT_decl_line   : 109
    <f08ad>   DW_AT_decl_column : 21
    <f08ae>   DW_AT_type        : <0xf0742>
    <f08b2>   DW_AT_data_member_location: 44
 <2><f08b3>: Abbrev Number: 2 (DW_TAG_member)
    <f08b4>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <f08b8>   DW_AT_decl_file   : 7
    <f08b9>   DW_AT_decl_line   : 110
    <f08ba>   DW_AT_decl_column : 21
    <f08bb>   DW_AT_type        : <0xf06fe>
    <f08bf>   DW_AT_data_member_location: 48
 <2><f08c0>: Abbrev Number: 2 (DW_TAG_member)
    <f08c1>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f08c5>   DW_AT_decl_file   : 7
    <f08c6>   DW_AT_decl_line   : 112
    <f08c7>   DW_AT_decl_column : 22
    <f08c8>   DW_AT_type        : <0xf0b80>
    <f08cc>   DW_AT_data_member_location: 56
 <2><f08cd>: Abbrev Number: 2 (DW_TAG_member)
    <f08ce>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <f08d2>   DW_AT_decl_file   : 7
    <f08d3>   DW_AT_decl_line   : 114
    <f08d4>   DW_AT_decl_column : 14
    <f08d5>   DW_AT_type        : <0xf06e4>
    <f08d9>   DW_AT_data_member_location: 64
 <2><f08da>: Abbrev Number: 2 (DW_TAG_member)
    <f08db>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <f08df>   DW_AT_decl_file   : 7
    <f08e0>   DW_AT_decl_line   : 116
    <f08e1>   DW_AT_decl_column : 22
    <f08e2>   DW_AT_type        : <0xf081f>
    <f08e6>   DW_AT_data_member_location: 72
 <2><f08e7>: Abbrev Number: 0
 <1><f08e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <f08e9>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <f08ed>   DW_AT_decl_file   : 7
    <f08ee>   DW_AT_decl_line   : 59
    <f08ef>   DW_AT_decl_column : 15
    <f08f0>   DW_AT_type        : <0xf08f4>
 <1><f08f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f08f5>   DW_AT_byte_size   : 8
    <f08f5>   DW_AT_type        : <0xf08f9>
 <1><f08f9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f08fa>   DW_AT_prototyped  : 1
    <f08fa>   DW_AT_type        : <0xf06ca>
    <f08fe>   DW_AT_sibling     : <0xf0908>
 <2><f0902>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0903>   DW_AT_type        : <0xf081f>
 <2><f0907>: Abbrev Number: 0
 <1><f0908>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0909>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <f090d>   DW_AT_decl_file   : 7
    <f090e>   DW_AT_decl_line   : 60
    <f090f>   DW_AT_decl_column : 15
    <f0910>   DW_AT_type        : <0xf08f4>
 <1><f0914>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0915>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <f0919>   DW_AT_decl_file   : 7
    <f091a>   DW_AT_decl_line   : 61
    <f091b>   DW_AT_decl_column : 15
    <f091c>   DW_AT_type        : <0xf0920>
 <1><f0920>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0921>   DW_AT_byte_size   : 8
    <f0921>   DW_AT_type        : <0xf0925>
 <1><f0925>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0926>   DW_AT_prototyped  : 1
    <f0926>   DW_AT_type        : <0xf06ca>
    <f092a>   DW_AT_sibling     : <0xf093e>
 <2><f092e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f092f>   DW_AT_type        : <0xf081f>
 <2><f0933>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0934>   DW_AT_type        : <0xf075d>
 <2><f0938>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0939>   DW_AT_type        : <0xf06ca>
 <2><f093d>: Abbrev Number: 0
 <1><f093e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f093f>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <f0943>   DW_AT_decl_file   : 7
    <f0944>   DW_AT_decl_line   : 62
    <f0945>   DW_AT_decl_column : 15
    <f0946>   DW_AT_type        : <0xf094a>
 <1><f094a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f094b>   DW_AT_byte_size   : 8
    <f094b>   DW_AT_type        : <0xf094f>
 <1><f094f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0950>   DW_AT_prototyped  : 1
    <f0950>   DW_AT_type        : <0xf06ca>
    <f0954>   DW_AT_sibling     : <0xf0963>
 <2><f0958>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0959>   DW_AT_type        : <0xf081f>
 <2><f095d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f095e>   DW_AT_type        : <0xf0963>
 <2><f0962>: Abbrev Number: 0
 <1><f0963>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0964>   DW_AT_byte_size   : 8
    <f0964>   DW_AT_type        : <0xf075d>
 <1><f0968>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0969>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <f096d>   DW_AT_decl_file   : 7
    <f096e>   DW_AT_decl_line   : 63
    <f096f>   DW_AT_decl_column : 15
    <f0970>   DW_AT_type        : <0xf0974>
 <1><f0974>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0975>   DW_AT_byte_size   : 8
    <f0975>   DW_AT_type        : <0xf0979>
 <1><f0979>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f097a>   DW_AT_prototyped  : 1
    <f097a>   DW_AT_type        : <0xf06ca>
    <f097e>   DW_AT_sibling     : <0xf0992>
 <2><f0982>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0983>   DW_AT_type        : <0xf081f>
 <2><f0987>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0988>   DW_AT_type        : <0xf06e4>
 <2><f098c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f098d>   DW_AT_type        : <0xf0992>
 <2><f0991>: Abbrev Number: 0
 <1><f0992>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0993>   DW_AT_byte_size   : 8
    <f0993>   DW_AT_type        : <0xf06fe>
 <1><f0997>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0998>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <f099c>   DW_AT_decl_file   : 7
    <f099d>   DW_AT_decl_line   : 65
    <f099e>   DW_AT_decl_column : 15
    <f099f>   DW_AT_type        : <0xf09a3>
 <1><f09a3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f09a4>   DW_AT_byte_size   : 8
    <f09a4>   DW_AT_type        : <0xf09a8>
 <1><f09a8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f09a9>   DW_AT_prototyped  : 1
    <f09a9>   DW_AT_type        : <0xf06ca>
    <f09ad>   DW_AT_sibling     : <0xf09c1>
 <2><f09b1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09b2>   DW_AT_type        : <0xf081f>
 <2><f09b6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09b7>   DW_AT_type        : <0xf07be>
 <2><f09bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09bc>   DW_AT_type        : <0xf0992>
 <2><f09c0>: Abbrev Number: 0
 <1><f09c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <f09c2>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <f09c6>   DW_AT_decl_file   : 7
    <f09c7>   DW_AT_decl_line   : 67
    <f09c8>   DW_AT_decl_column : 15
    <f09c9>   DW_AT_type        : <0xf09cd>
 <1><f09cd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f09ce>   DW_AT_byte_size   : 8
    <f09ce>   DW_AT_type        : <0xf09d2>
 <1><f09d2>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f09d3>   DW_AT_prototyped  : 1
    <f09d3>   DW_AT_type        : <0xf06ca>
    <f09d7>   DW_AT_sibling     : <0xf09eb>
 <2><f09db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09dc>   DW_AT_type        : <0xf081f>
 <2><f09e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09e1>   DW_AT_type        : <0xf0752>
 <2><f09e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f09e6>   DW_AT_type        : <0xf06fe>
 <2><f09ea>: Abbrev Number: 0
 <1><f09eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <f09ec>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <f09f0>   DW_AT_decl_file   : 7
    <f09f1>   DW_AT_decl_line   : 69
    <f09f2>   DW_AT_decl_column : 15
    <f09f3>   DW_AT_type        : <0xf09f7>
 <1><f09f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f09f8>   DW_AT_byte_size   : 8
    <f09f8>   DW_AT_type        : <0xf09fc>
 <1><f09fc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f09fd>   DW_AT_prototyped  : 1
    <f09fd>   DW_AT_type        : <0xf06ca>
    <f0a01>   DW_AT_sibling     : <0xf0a15>
 <2><f0a05>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a06>   DW_AT_type        : <0xf081f>
 <2><f0a0a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a0b>   DW_AT_type        : <0xf0a15>
 <2><f0a0f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a10>   DW_AT_type        : <0xf06fe>
 <2><f0a14>: Abbrev Number: 0
 <1><f0a15>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0a16>   DW_AT_byte_size   : 8
    <f0a16>   DW_AT_type        : <0xf0717>
 <1><f0a1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0a1b>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <f0a1f>   DW_AT_decl_file   : 7
    <f0a20>   DW_AT_decl_line   : 71
    <f0a21>   DW_AT_decl_column : 15
    <f0a22>   DW_AT_type        : <0xf0a26>
 <1><f0a26>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0a27>   DW_AT_byte_size   : 8
    <f0a27>   DW_AT_type        : <0xf0a2b>
 <1><f0a2b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0a2c>   DW_AT_prototyped  : 1
    <f0a2c>   DW_AT_type        : <0xf06ca>
    <f0a30>   DW_AT_sibling     : <0xf0a44>
 <2><f0a34>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a35>   DW_AT_type        : <0xf081f>
 <2><f0a39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a3a>   DW_AT_type        : <0xf075d>
 <2><f0a3e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a3f>   DW_AT_type        : <0xf075d>
 <2><f0a43>: Abbrev Number: 0
 <1><f0a44>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0a45>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <f0a49>   DW_AT_decl_file   : 7
    <f0a4a>   DW_AT_decl_line   : 73
    <f0a4b>   DW_AT_decl_column : 15
    <f0a4c>   DW_AT_type        : <0xf0a26>
 <1><f0a50>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0a51>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <f0a55>   DW_AT_decl_file   : 7
    <f0a56>   DW_AT_decl_line   : 75
    <f0a57>   DW_AT_decl_column : 15
    <f0a58>   DW_AT_type        : <0xf0a5c>
 <1><f0a5c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0a5d>   DW_AT_byte_size   : 8
    <f0a5d>   DW_AT_type        : <0xf0a61>
 <1><f0a61>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0a62>   DW_AT_prototyped  : 1
    <f0a62>   DW_AT_type        : <0xf06ca>
    <f0a66>   DW_AT_sibling     : <0xf0a75>
 <2><f0a6a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a6b>   DW_AT_type        : <0xf081f>
 <2><f0a6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a70>   DW_AT_type        : <0xf0a75>
 <2><f0a74>: Abbrev Number: 0
 <1><f0a75>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0a76>   DW_AT_byte_size   : 8
    <f0a76>   DW_AT_type        : <0xf07a4>
 <1><f0a7a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0a7b>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <f0a7f>   DW_AT_decl_file   : 7
    <f0a80>   DW_AT_decl_line   : 76
    <f0a81>   DW_AT_decl_column : 15
    <f0a82>   DW_AT_type        : <0xf0a86>
 <1><f0a86>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f0a87>   DW_AT_byte_size   : 8
    <f0a87>   DW_AT_type        : <0xf0a8b>
 <1><f0a8b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f0a8c>   DW_AT_prototyped  : 1
    <f0a8c>   DW_AT_type        : <0xf06ca>
    <f0a90>   DW_AT_sibling     : <0xf0aa4>
 <2><f0a94>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a95>   DW_AT_type        : <0xf081f>
 <2><f0a99>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a9a>   DW_AT_type        : <0xf07be>
 <2><f0a9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f0a9f>   DW_AT_type        : <0xf072f>
 <2><f0aa3>: Abbrev Number: 0
 <1><f0aa4>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0aa5>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <f0aa9>   DW_AT_decl_file   : 7
    <f0aaa>   DW_AT_decl_line   : 77
