    <7e864>   DW_AT_data_member_location: 8
 <2><7e865>: Abbrev Number: 5 (DW_TAG_member)
    <7e866>   DW_AT_name        : dy
    <7e869>   DW_AT_decl_file   : 4
    <7e86a>   DW_AT_decl_line   : 10
    <7e86b>   DW_AT_decl_column : 12
    <7e86c>   DW_AT_type        : <0x7e7a6>
    <7e870>   DW_AT_data_member_location: 12
 <2><7e871>: Abbrev Number: 0
 <1><7e872>: Abbrev Number: 23 (DW_TAG_union_type)
    <7e873>   DW_AT_byte_size   : 16
    <7e873>   DW_AT_decl_file   : 4
    <7e874>   DW_AT_decl_line   : 3
    <7e875>   DW_AT_decl_column : 2
    <7e875>   DW_AT_sibling     : <0x7e89f>
 <2><7e879>: Abbrev Number: 20 (DW_TAG_member)
    <7e87a>   DW_AT_type        : <0x7e818>
 <2><7e87e>: Abbrev Number: 20 (DW_TAG_member)
    <7e87f>   DW_AT_type        : <0x7e83b>
 <2><7e883>: Abbrev Number: 24 (DW_TAG_member)
    <7e884>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <7e888>   DW_AT_decl_file   : 4
    <7e889>   DW_AT_decl_line   : 12
    <7e88a>   DW_AT_decl_column : 7
    <7e88a>   DW_AT_type        : <0x7e7a6>
 <2><7e88e>: Abbrev Number: 27 (DW_TAG_member)
    <7e88f>   DW_AT_name        : z
    <7e891>   DW_AT_decl_file   : 4
    <7e891>   DW_AT_decl_line   : 13
    <7e892>   DW_AT_decl_column : 7
    <7e892>   DW_AT_type        : <0x7e7a6>
 <2><7e896>: Abbrev Number: 27 (DW_TAG_member)
    <7e897>   DW_AT_name        : w
    <7e899>   DW_AT_decl_file   : 4
    <7e899>   DW_AT_decl_line   : 14
    <7e89a>   DW_AT_decl_column : 7
    <7e89a>   DW_AT_type        : <0x7e7a6>
 <2><7e89e>: Abbrev Number: 0
 <1><7e89f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7e8a0>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <7e8a4>   DW_AT_byte_size   : 20
    <7e8a5>   DW_AT_decl_file   : 4
    <7e8a6>   DW_AT_decl_line   : 1
    <7e8a7>   DW_AT_decl_column : 8
    <7e8a8>   DW_AT_sibling     : <0x7e8c0>
 <2><7e8ac>: Abbrev Number: 2 (DW_TAG_member)
    <7e8ad>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7e8b1>   DW_AT_decl_file   : 4
    <7e8b2>   DW_AT_decl_line   : 2
    <7e8b3>   DW_AT_decl_column : 6
    <7e8b4>   DW_AT_type        : <0x7e7a6>
    <7e8b8>   DW_AT_data_member_location: 0
 <2><7e8b9>: Abbrev Number: 25 (DW_TAG_member)
    <7e8ba>   DW_AT_type        : <0x7e872>
    <7e8be>   DW_AT_data_member_location: 4
 <2><7e8bf>: Abbrev Number: 0
 <1><7e8c0>: Abbrev Number: 10 (DW_TAG_typedef)
    <7e8c1>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <7e8c5>   DW_AT_decl_file   : 4
    <7e8c6>   DW_AT_decl_line   : 18
    <7e8c7>   DW_AT_decl_column : 23
    <7e8c8>   DW_AT_type        : <0x7e89f>
 <1><7e8cc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e8cd>   DW_AT_byte_size   : 8
    <7e8cd>   DW_AT_type        : <0x7e8d1>
 <1><7e8d1>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7e8d2>   DW_AT_prototyped  : 1
    <7e8d2>   DW_AT_type        : <0x7e7a6>
    <7e8d6>   DW_AT_sibling     : <0x7e8e5>
 <2><7e8da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8db>   DW_AT_type        : <0x7e7a6>
 <2><7e8df>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8e0>   DW_AT_type        : <0x7e7a6>
 <2><7e8e4>: Abbrev Number: 0
 <1><7e8e5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e8e6>   DW_AT_byte_size   : 8
    <7e8e6>   DW_AT_type        : <0x7e7a6>
 <1><7e8ea>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e8eb>   DW_AT_byte_size   : 8
    <7e8eb>   DW_AT_type        : <0x7e8ef>
 <1><7e8ef>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7e8f0>   DW_AT_prototyped  : 1
    <7e8f0>   DW_AT_type        : <0x7e7a6>
    <7e8f4>   DW_AT_sibling     : <0x7e912>
 <2><7e8f8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8f9>   DW_AT_type        : <0x7e8e5>
 <2><7e8fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8fe>   DW_AT_type        : <0x7e8e5>
 <2><7e902>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e903>   DW_AT_type        : <0x7e8e5>
 <2><7e907>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e908>   DW_AT_type        : <0x7e8e5>
 <2><7e90c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e90d>   DW_AT_type        : <0x7e8e5>
 <2><7e911>: Abbrev Number: 0
 <1><7e912>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e913>   DW_AT_byte_size   : 8
    <7e913>   DW_AT_type        : <0x7e8c0>
 <1><7e917>: Abbrev Number: 10 (DW_TAG_typedef)
    <7e918>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <7e91c>   DW_AT_decl_file   : 5
    <7e91d>   DW_AT_decl_line   : 13
    <7e91e>   DW_AT_decl_column : 30
    <7e91f>   DW_AT_type        : <0x7e923>
 <1><7e923>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7e924>   DW_AT_prototyped  : 1
    <7e924>   DW_AT_type        : <0x7e78a>
    <7e928>   DW_AT_sibling     : <0x7e93c>
 <2><7e92c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e92d>   DW_AT_type        : <0x7e78a>
 <2><7e931>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e932>   DW_AT_type        : <0x7e78a>
 <2><7e936>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e937>   DW_AT_type        : <0x7e7be>
 <2><7e93b>: Abbrev Number: 0
 <1><7e93c>: Abbrev Number: 10 (DW_TAG_typedef)
    <7e93d>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <7e941>   DW_AT_decl_file   : 5
    <7e942>   DW_AT_decl_line   : 14
    <7e943>   DW_AT_decl_column : 15
    <7e944>   DW_AT_type        : <0x7e948>
 <1><7e948>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <7e949>   DW_AT_prototyped  : 1
    <7e949>   DW_AT_sibling     : <0x7e97b>
 <2><7e94d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e94e>   DW_AT_type        : <0x7e97b>
 <2><7e952>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e953>   DW_AT_type        : <0x7e97b>
 <2><7e957>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e958>   DW_AT_type        : <0x7e7a6>
 <2><7e95c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e95d>   DW_AT_type        : <0x7e7a6>
 <2><7e961>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e962>   DW_AT_type        : <0x7e7a6>
 <2><7e966>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e967>   DW_AT_type        : <0x7e7a6>
 <2><7e96b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e96c>   DW_AT_type        : <0x7e7a6>
 <2><7e970>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e971>   DW_AT_type        : <0x7e980>
 <2><7e975>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e976>   DW_AT_type        : <0x7e7be>
 <2><7e97a>: Abbrev Number: 0
 <1><7e97b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e97c>   DW_AT_byte_size   : 8
    <7e97c>   DW_AT_type        : <0x7e777>
 <1><7e980>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7e981>   DW_AT_byte_size   : 8
    <7e981>   DW_AT_type        : <0x7e917>
 <1><7e985>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7e986>   DW_AT_byte_size   : 16
    <7e987>   DW_AT_decl_file   : 5
    <7e988>   DW_AT_decl_line   : 26
    <7e989>   DW_AT_decl_column : 3
    <7e989>   DW_AT_sibling     : <0x7e9c2>
 <2><7e98d>: Abbrev Number: 2 (DW_TAG_member)
    <7e98e>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <7e992>   DW_AT_decl_file   : 5
    <7e993>   DW_AT_decl_line   : 27
    <7e994>   DW_AT_decl_column : 8
    <7e995>   DW_AT_type        : <0x7e7a6>
    <7e999>   DW_AT_data_member_location: 0
 <2><7e99a>: Abbrev Number: 2 (DW_TAG_member)
    <7e99b>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <7e99f>   DW_AT_decl_file   : 5
    <7e9a0>   DW_AT_decl_line   : 27
    <7e9a1>   DW_AT_decl_column : 16
    <7e9a2>   DW_AT_type        : <0x7e7a6>
    <7e9a6>   DW_AT_data_member_location: 4
 <2><7e9a7>: Abbrev Number: 2 (DW_TAG_member)
    <7e9a8>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <7e9ac>   DW_AT_decl_file   : 5
    <7e9ad>   DW_AT_decl_line   : 27
    <7e9ae>   DW_AT_decl_column : 24
    <7e9af>   DW_AT_type        : <0x7e7a6>
    <7e9b3>   DW_AT_data_member_location: 8
 <2><7e9b4>: Abbrev Number: 2 (DW_TAG_member)
    <7e9b5>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <7e9b9>   DW_AT_decl_file   : 5
    <7e9ba>   DW_AT_decl_line   : 27
    <7e9bb>   DW_AT_decl_column : 32
    <7e9bc>   DW_AT_type        : <0x7e7a6>
    <7e9c0>   DW_AT_data_member_location: 12
 <2><7e9c1>: Abbrev Number: 0
 <1><7e9c2>: Abbrev Number: 23 (DW_TAG_union_type)
    <7e9c3>   DW_AT_byte_size   : 16
    <7e9c3>   DW_AT_decl_file   : 5
    <7e9c4>   DW_AT_decl_line   : 25
    <7e9c5>   DW_AT_decl_column : 2
    <7e9c5>   DW_AT_sibling     : <0x7e9da>
 <2><7e9c9>: Abbrev Number: 20 (DW_TAG_member)
    <7e9ca>   DW_AT_type        : <0x7e985>
 <2><7e9ce>: Abbrev Number: 24 (DW_TAG_member)
    <7e9cf>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <7e9d3>   DW_AT_decl_file   : 5
    <7e9d4>   DW_AT_decl_line   : 29
    <7e9d5>   DW_AT_decl_column : 7
    <7e9d5>   DW_AT_type        : <0x7e9da>
 <2><7e9d9>: Abbrev Number: 0
 <1><7e9da>: Abbrev Number: 28 (DW_TAG_array_type)
    <7e9db>   DW_AT_type        : <0x7e7a6>
    <7e9df>   DW_AT_sibling     : <0x7e9ea>
 <2><7e9e3>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <7e9e4>   DW_AT_type        : <0x7e791>
    <7e9e8>   DW_AT_upper_bound : 3
 <2><7e9e9>: Abbrev Number: 0
 <1><7e9ea>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7e9eb>   DW_AT_byte_size   : 16
    <7e9ec>   DW_AT_decl_file   : 5
    <7e9ed>   DW_AT_decl_line   : 32
    <7e9ee>   DW_AT_decl_column : 3
    <7e9ee>   DW_AT_sibling     : <0x7ea27>
 <2><7e9f2>: Abbrev Number: 2 (DW_TAG_member)
    <7e9f3>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <7e9f7>   DW_AT_decl_file   : 5
    <7e9f8>   DW_AT_decl_line   : 33
    <7e9f9>   DW_AT_decl_column : 8
    <7e9fa>   DW_AT_type        : <0x7e7a6>
    <7e9fe>   DW_AT_data_member_location: 0
 <2><7e9ff>: Abbrev Number: 2 (DW_TAG_member)
    <7ea00>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <7ea04>   DW_AT_decl_file   : 5
    <7ea05>   DW_AT_decl_line   : 33
    <7ea06>   DW_AT_decl_column : 20
    <7ea07>   DW_AT_type        : <0x7e7a6>
    <7ea0b>   DW_AT_data_member_location: 4
 <2><7ea0c>: Abbrev Number: 2 (DW_TAG_member)
    <7ea0d>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <7ea11>   DW_AT_decl_file   : 5
    <7ea12>   DW_AT_decl_line   : 33
    <7ea13>   DW_AT_decl_column : 32
    <7ea14>   DW_AT_type        : <0x7e7a6>
    <7ea18>   DW_AT_data_member_location: 8
 <2><7ea19>: Abbrev Number: 2 (DW_TAG_member)
    <7ea1a>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <7ea1e>   DW_AT_decl_file   : 5
    <7ea1f>   DW_AT_decl_line   : 33
    <7ea20>   DW_AT_decl_column : 44
    <7ea21>   DW_AT_type        : <0x7e7a6>
    <7ea25>   DW_AT_data_member_location: 12
 <2><7ea26>: Abbrev Number: 0
 <1><7ea27>: Abbrev Number: 23 (DW_TAG_union_type)
    <7ea28>   DW_AT_byte_size   : 16
    <7ea28>   DW_AT_decl_file   : 5
    <7ea29>   DW_AT_decl_line   : 31
    <7ea2a>   DW_AT_decl_column : 2
    <7ea2a>   DW_AT_sibling     : <0x7ea3f>
 <2><7ea2e>: Abbrev Number: 20 (DW_TAG_member)
    <7ea2f>   DW_AT_type        : <0x7e9ea>
 <2><7ea33>: Abbrev Number: 24 (DW_TAG_member)
    <7ea34>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <7ea38>   DW_AT_decl_file   : 5
    <7ea39>   DW_AT_decl_line   : 35
    <7ea3a>   DW_AT_decl_column : 7
    <7ea3a>   DW_AT_type        : <0x7e9da>
 <2><7ea3e>: Abbrev Number: 0
 <1><7ea3f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7ea40>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <7ea44>   DW_AT_byte_size   : 216
    <7ea45>   DW_AT_decl_file   : 5
    <7ea46>   DW_AT_decl_line   : 16
    <7ea47>   DW_AT_decl_column : 16
    <7ea48>   DW_AT_sibling     : <0x7eb5c>
 <2><7ea4c>: Abbrev Number: 5 (DW_TAG_member)
    <7ea4d>   DW_AT_name        : id
    <7ea50>   DW_AT_decl_file   : 5
    <7ea51>   DW_AT_decl_line   : 17
    <7ea52>   DW_AT_decl_column : 6
    <7ea53>   DW_AT_type        : <0x7e7a6>
    <7ea57>   DW_AT_data_member_location: 0
 <2><7ea58>: Abbrev Number: 2 (DW_TAG_member)
    <7ea59>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <7ea5d>   DW_AT_decl_file   : 5
    <7ea5e>   DW_AT_decl_line   : 18
    <7ea5f>   DW_AT_decl_column : 6
    <7ea60>   DW_AT_type        : <0x7e7a6>
    <7ea64>   DW_AT_data_member_location: 4
 <2><7ea65>: Abbrev Number: 2 (DW_TAG_member)
    <7ea66>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <7ea6a>   DW_AT_decl_file   : 5
    <7ea6b>   DW_AT_decl_line   : 19
    <7ea6c>   DW_AT_decl_column : 18
    <7ea6d>   DW_AT_type        : <0x7eb5c>
    <7ea71>   DW_AT_data_member_location: 8
 <2><7ea72>: Abbrev Number: 2 (DW_TAG_member)
    <7ea73>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <7ea77>   DW_AT_decl_file   : 5
    <7ea78>   DW_AT_decl_line   : 20
    <7ea79>   DW_AT_decl_column : 6
    <7ea7a>   DW_AT_type        : <0x7e7a6>
    <7ea7e>   DW_AT_data_member_location: 16
 <2><7ea7f>: Abbrev Number: 2 (DW_TAG_member)
    <7ea80>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <7ea84>   DW_AT_decl_file   : 5
    <7ea85>   DW_AT_decl_line   : 21
    <7ea86>   DW_AT_decl_column : 6
    <7ea87>   DW_AT_type        : <0x7e7a6>
    <7ea8b>   DW_AT_data_member_location: 20
 <2><7ea8c>: Abbrev Number: 2 (DW_TAG_member)
    <7ea8d>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <7ea91>   DW_AT_decl_file   : 5
    <7ea92>   DW_AT_decl_line   : 22
    <7ea93>   DW_AT_decl_column : 6
    <7ea94>   DW_AT_type        : <0x7e7a6>
    <7ea98>   DW_AT_data_member_location: 24
 <2><7ea99>: Abbrev Number: 2 (DW_TAG_member)
    <7ea9a>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <7ea9e>   DW_AT_decl_file   : 5
    <7ea9f>   DW_AT_decl_line   : 23
    <7eaa0>   DW_AT_decl_column : 8
    <7eaa1>   DW_AT_type        : <0x7e7be>
    <7eaa5>   DW_AT_data_member_location: 32
 <2><7eaa6>: Abbrev Number: 2 (DW_TAG_member)
    <7eaa7>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <7eaab>   DW_AT_decl_file   : 5
    <7eaac>   DW_AT_decl_line   : 24
    <7eaad>   DW_AT_decl_column : 8
    <7eaae>   DW_AT_type        : <0x7e800>
    <7eab2>   DW_AT_data_member_location: 40
 <2><7eab3>: Abbrev Number: 2 (DW_TAG_member)
    <7eab4>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <7eab8>   DW_AT_decl_file   : 5
    <7eab9>   DW_AT_decl_line   : 24
    <7eaba>   DW_AT_decl_column : 16
    <7eabb>   DW_AT_type        : <0x7e800>
    <7eabf>   DW_AT_data_member_location: 44
 <2><7eac0>: Abbrev Number: 25 (DW_TAG_member)
    <7eac1>   DW_AT_type        : <0x7e9c2>
    <7eac5>   DW_AT_data_member_location: 48
 <2><7eac6>: Abbrev Number: 25 (DW_TAG_member)
    <7eac7>   DW_AT_type        : <0x7ea27>
    <7eacb>   DW_AT_data_member_location: 64
 <2><7eacc>: Abbrev Number: 2 (DW_TAG_member)
    <7eacd>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <7ead1>   DW_AT_decl_file   : 5
    <7ead2>   DW_AT_decl_line   : 37
    <7ead3>   DW_AT_decl_column : 8
    <7ead4>   DW_AT_type        : <0x7e800>
    <7ead8>   DW_AT_data_member_location: 80
 <2><7ead9>: Abbrev Number: 2 (DW_TAG_member)
    <7eada>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <7eade>   DW_AT_decl_file   : 5
    <7eadf>   DW_AT_decl_line   : 37
    <7eae0>   DW_AT_decl_column : 15
    <7eae1>   DW_AT_type        : <0x7e800>
    <7eae5>   DW_AT_data_member_location: 84
 <2><7eae6>: Abbrev Number: 2 (DW_TAG_member)
    <7eae7>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <7eaeb>   DW_AT_decl_file   : 5
    <7eaec>   DW_AT_decl_line   : 37
    <7eaed>   DW_AT_decl_column : 22
    <7eaee>   DW_AT_type        : <0x7e800>
    <7eaf2>   DW_AT_data_member_location: 88
 <2><7eaf3>: Abbrev Number: 2 (DW_TAG_member)
    <7eaf4>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <7eaf8>   DW_AT_decl_file   : 5
    <7eaf9>   DW_AT_decl_line   : 37
    <7eafa>   DW_AT_decl_column : 29
    <7eafb>   DW_AT_type        : <0x7e800>
    <7eaff>   DW_AT_data_member_location: 92
 <2><7eb00>: Abbrev Number: 2 (DW_TAG_member)
    <7eb01>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <7eb05>   DW_AT_decl_file   : 5
    <7eb06>   DW_AT_decl_line   : 38
    <7eb07>   DW_AT_decl_column : 15
    <7eb08>   DW_AT_type        : <0x7e78a>
    <7eb0c>   DW_AT_data_member_location: 96
 <2><7eb0d>: Abbrev Number: 2 (DW_TAG_member)
    <7eb0e>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <7eb12>   DW_AT_decl_file   : 5
    <7eb13>   DW_AT_decl_line   : 38
    <7eb14>   DW_AT_decl_column : 25
    <7eb15>   DW_AT_type        : <0x7e78a>
    <7eb19>   DW_AT_data_member_location: 100
 <2><7eb1a>: Abbrev Number: 2 (DW_TAG_member)
    <7eb1b>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <7eb1f>   DW_AT_decl_file   : 5
    <7eb20>   DW_AT_decl_line   : 39
    <7eb21>   DW_AT_decl_column : 9
    <7eb22>   DW_AT_type        : <0x7eb80>
    <7eb26>   DW_AT_data_member_location: 104
 <2><7eb27>: Abbrev Number: 2 (DW_TAG_member)
    <7eb28>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <7eb2c>   DW_AT_decl_file   : 5
    <7eb2d>   DW_AT_decl_line   : 40
    <7eb2e>   DW_AT_decl_column : 17
    <7eb2f>   DW_AT_type        : <0x7eb9e>
    <7eb33>   DW_AT_data_member_location: 112
 <2><7eb34>: Abbrev Number: 2 (DW_TAG_member)
    <7eb35>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <7eb39>   DW_AT_decl_file   : 5
    <7eb3a>   DW_AT_decl_line   : 41
    <7eb3b>   DW_AT_decl_column : 10
    <7eb3c>   DW_AT_type        : <0x7ebbc>
    <7eb40>   DW_AT_data_member_location: 120
 <2><7eb41>: Abbrev Number: 2 (DW_TAG_member)
    <7eb42>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <7eb46>   DW_AT_decl_file   : 5
    <7eb47>   DW_AT_decl_line   : 42
    <7eb48>   DW_AT_decl_column : 11
    <7eb49>   DW_AT_type        : <0x7ebc1>
    <7eb4d>   DW_AT_data_member_location: 128
 <2><7eb4e>: Abbrev Number: 2 (DW_TAG_member)
    <7eb4f>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7eb53>   DW_AT_decl_file   : 5
    <7eb54>   DW_AT_decl_line   : 43
    <7eb55>   DW_AT_decl_column : 6
    <7eb56>   DW_AT_type        : <0x7e7a6>
    <7eb5a>   DW_AT_data_member_location: 208
 <2><7eb5b>: Abbrev Number: 0
 <1><7eb5c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eb5d>   DW_AT_byte_size   : 8
    <7eb5d>   DW_AT_type        : <0x7e97b>
 <1><7eb61>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <7eb62>   DW_AT_prototyped  : 1
    <7eb62>   DW_AT_sibling     : <0x7eb7b>
 <2><7eb66>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb67>   DW_AT_type        : <0x7eb7b>
 <2><7eb6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb6c>   DW_AT_type        : <0x7e7a6>
 <2><7eb70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb71>   DW_AT_type        : <0x7e7a6>
 <2><7eb75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb76>   DW_AT_type        : <0x7e78a>
 <2><7eb7a>: Abbrev Number: 0
 <1><7eb7b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eb7c>   DW_AT_byte_size   : 8
    <7eb7c>   DW_AT_type        : <0x7ea3f>
 <1><7eb80>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eb81>   DW_AT_byte_size   : 8
    <7eb81>   DW_AT_type        : <0x7eb61>
 <1><7eb85>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7eb86>   DW_AT_prototyped  : 1
    <7eb86>   DW_AT_type        : <0x7e78a>
    <7eb8a>   DW_AT_sibling     : <0x7eb9e>
 <2><7eb8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb8f>   DW_AT_type        : <0x7eb7b>
 <2><7eb93>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb94>   DW_AT_type        : <0x7e7a6>
 <2><7eb98>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb99>   DW_AT_type        : <0x7e7a6>
 <2><7eb9d>: Abbrev Number: 0
 <1><7eb9e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eb9f>   DW_AT_byte_size   : 8
    <7eb9f>   DW_AT_type        : <0x7eb85>
 <1><7eba3>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7eba4>   DW_AT_prototyped  : 1
    <7eba4>   DW_AT_type        : <0x7e7be>
    <7eba8>   DW_AT_sibling     : <0x7ebbc>
 <2><7ebac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ebad>   DW_AT_type        : <0x7e7be>
 <2><7ebb1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ebb2>   DW_AT_type        : <0x7e7a6>
 <2><7ebb6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ebb7>   DW_AT_type        : <0x7e7cc>
 <2><7ebbb>: Abbrev Number: 0
 <1><7ebbc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ebbd>   DW_AT_byte_size   : 8
    <7ebbd>   DW_AT_type        : <0x7eba3>
 <1><7ebc1>: Abbrev Number: 28 (DW_TAG_array_type)
    <7ebc2>   DW_AT_type        : <0x7ebd1>
    <7ebc6>   DW_AT_sibling     : <0x7ebd1>
 <2><7ebca>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <7ebcb>   DW_AT_type        : <0x7e791>
    <7ebcf>   DW_AT_upper_bound : 9
 <2><7ebd0>: Abbrev Number: 0
 <1><7ebd1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ebd2>   DW_AT_byte_size   : 8
    <7ebd2>   DW_AT_type        : <0x7ebd6>
 <1><7ebd6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ebd7>   DW_AT_byte_size   : 8
    <7ebd7>   DW_AT_type        : <0x7e93c>
 <1><7ebdb>: Abbrev Number: 10 (DW_TAG_typedef)
    <7ebdc>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <7ebe0>   DW_AT_decl_file   : 5
    <7ebe1>   DW_AT_decl_line   : 44
    <7ebe2>   DW_AT_decl_column : 3
    <7ebe3>   DW_AT_type        : <0x7ea3f>
 <1><7ebe7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7ebe8>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <7ebec>   DW_AT_byte_size   : 12
    <7ebed>   DW_AT_decl_file   : 6
    <7ebee>   DW_AT_decl_line   : 139
    <7ebef>   DW_AT_decl_column : 16
    <7ebf0>   DW_AT_sibling     : <0x7ec19>
 <2><7ebf4>: Abbrev Number: 5 (DW_TAG_member)
    <7ebf5>   DW_AT_name        : ch
    <7ebf8>   DW_AT_decl_file   : 6
    <7ebf9>   DW_AT_decl_line   : 140
    <7ebfa>   DW_AT_decl_column : 14
    <7ebfb>   DW_AT_type        : <0x7e7d8>
    <7ebff>   DW_AT_data_member_location: 0
 <2><7ec00>: Abbrev Number: 5 (DW_TAG_member)
    <7ec01>   DW_AT_name        : fg
    <7ec04>   DW_AT_decl_file   : 6
    <7ec05>   DW_AT_decl_line   : 141
    <7ec06>   DW_AT_decl_column : 14
    <7ec07>   DW_AT_type        : <0x7e78a>
    <7ec0b>   DW_AT_data_member_location: 4
 <2><7ec0c>: Abbrev Number: 5 (DW_TAG_member)
    <7ec0d>   DW_AT_name        : bg
    <7ec10>   DW_AT_decl_file   : 6
    <7ec11>   DW_AT_decl_line   : 141
    <7ec12>   DW_AT_decl_column : 18
    <7ec13>   DW_AT_type        : <0x7e78a>
    <7ec17>   DW_AT_data_member_location: 8
 <2><7ec18>: Abbrev Number: 0
 <1><7ec19>: Abbrev Number: 10 (DW_TAG_typedef)
    <7ec1a>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <7ec1e>   DW_AT_decl_file   : 6
    <7ec1f>   DW_AT_decl_line   : 142
    <7ec20>   DW_AT_decl_column : 3
    <7ec21>   DW_AT_type        : <0x7ebe7>
 <1><7ec25>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7ec26>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7ec2a>   DW_AT_byte_size   : 208
    <7ec2b>   DW_AT_decl_file   : 6
    <7ec2c>   DW_AT_decl_line   : 144
    <7ec2d>   DW_AT_decl_column : 16
    <7ec2e>   DW_AT_sibling     : <0x7ede8>
 <2><7ec32>: Abbrev Number: 5 (DW_TAG_member)
    <7ec33>   DW_AT_name        : id
    <7ec36>   DW_AT_decl_file   : 6
    <7ec37>   DW_AT_decl_line   : 146
    <7ec38>   DW_AT_decl_column : 6
    <7ec39>   DW_AT_type        : <0x7e7a6>
    <7ec3d>   DW_AT_data_member_location: 0
 <2><7ec3e>: Abbrev Number: 2 (DW_TAG_member)
    <7ec3f>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <7ec43>   DW_AT_decl_file   : 6
    <7ec44>   DW_AT_decl_line   : 147
    <7ec45>   DW_AT_decl_column : 9
    <7ec46>   DW_AT_type        : <0x7e7a6>
    <7ec4a>   DW_AT_data_member_location: 4
 <2><7ec4b>: Abbrev Number: 2 (DW_TAG_member)
    <7ec4c>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <7ec50>   DW_AT_decl_file   : 6
    <7ec51>   DW_AT_decl_line   : 148
    <7ec52>   DW_AT_decl_column : 21
    <7ec53>   DW_AT_type        : <0x7eb5c>
    <7ec57>   DW_AT_data_member_location: 8
 <2><7ec58>: Abbrev Number: 2 (DW_TAG_member)
    <7ec59>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <7ec5d>   DW_AT_decl_file   : 6
    <7ec5e>   DW_AT_decl_line   : 149
    <7ec5f>   DW_AT_decl_column : 9
    <7ec60>   DW_AT_type        : <0x7e7a6>
    <7ec64>   DW_AT_data_member_location: 16
 <2><7ec65>: Abbrev Number: 2 (DW_TAG_member)
    <7ec66>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <7ec6a>   DW_AT_decl_file   : 6
    <7ec6b>   DW_AT_decl_line   : 150
    <7ec6c>   DW_AT_decl_column : 9
    <7ec6d>   DW_AT_type        : <0x7e7a6>
    <7ec71>   DW_AT_data_member_location: 20
 <2><7ec72>: Abbrev Number: 2 (DW_TAG_member)
    <7ec73>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <7ec77>   DW_AT_decl_file   : 6
    <7ec78>   DW_AT_decl_line   : 151
    <7ec79>   DW_AT_decl_column : 20
    <7ec7a>   DW_AT_type        : <0x7e97b>
    <7ec7e>   DW_AT_data_member_location: 24
 <2><7ec7f>: Abbrev Number: 5 (DW_TAG_member)
    <7ec80>   DW_AT_name        : w
    <7ec82>   DW_AT_decl_file   : 6
    <7ec83>   DW_AT_decl_line   : 152
    <7ec84>   DW_AT_decl_column : 9
    <7ec85>   DW_AT_type        : <0x7e7a6>
    <7ec89>   DW_AT_data_member_location: 32
 <2><7ec8a>: Abbrev Number: 5 (DW_TAG_member)
    <7ec8b>   DW_AT_name        : h
    <7ec8d>   DW_AT_decl_file   : 6
    <7ec8e>   DW_AT_decl_line   : 152
    <7ec8f>   DW_AT_decl_column : 12
    <7ec90>   DW_AT_type        : <0x7e7a6>
    <7ec94>   DW_AT_data_member_location: 36
 <2><7ec95>: Abbrev Number: 2 (DW_TAG_member)
    <7ec96>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <7ec9a>   DW_AT_decl_file   : 6
    <7ec9b>   DW_AT_decl_line   : 153
    <7ec9c>   DW_AT_decl_column : 9
    <7ec9d>   DW_AT_type        : <0x7e7a6>
    <7eca1>   DW_AT_data_member_location: 40
 <2><7eca2>: Abbrev Number: 5 (DW_TAG_member)
    <7eca3>   DW_AT_name        : bpp
    <7eca7>   DW_AT_decl_file   : 6
    <7eca8>   DW_AT_decl_line   : 154
    <7eca9>   DW_AT_decl_column : 9
    <7ecaa>   DW_AT_type        : <0x7e7a6>
    <7ecae>   DW_AT_data_member_location: 44
 <2><7ecaf>: Abbrev Number: 2 (DW_TAG_member)
    <7ecb0>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7ecb4>   DW_AT_decl_file   : 6
    <7ecb5>   DW_AT_decl_line   : 155
    <7ecb6>   DW_AT_decl_column : 9
    <7ecb7>   DW_AT_type        : <0x7e7a6>
    <7ecbb>   DW_AT_data_member_location: 48
 <2><7ecbc>: Abbrev Number: 2 (DW_TAG_member)
    <7ecbd>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <7ecc1>   DW_AT_decl_file   : 6
    <7ecc2>   DW_AT_decl_line   : 156
    <7ecc3>   DW_AT_decl_column : 19
    <7ecc4>   DW_AT_type        : <0x7ede8>
    <7ecc8>   DW_AT_data_member_location: 56
 <2><7ecc9>: Abbrev Number: 2 (DW_TAG_member)
    <7ecca>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <7ecce>   DW_AT_decl_file   : 6
    <7eccf>   DW_AT_decl_line   : 157
    <7ecd0>   DW_AT_decl_column : 19
    <7ecd1>   DW_AT_type        : <0x7ede8>
    <7ecd5>   DW_AT_data_member_location: 64
 <2><7ecd6>: Abbrev Number: 2 (DW_TAG_member)
    <7ecd7>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <7ecdb>   DW_AT_decl_file   : 6
    <7ecdc>   DW_AT_decl_line   : 158
    <7ecdd>   DW_AT_decl_column : 20
    <7ecde>   DW_AT_type        : <0x7e97b>
    <7ece2>   DW_AT_data_member_location: 72
 <2><7ece3>: Abbrev Number: 2 (DW_TAG_member)
    <7ece4>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <7ece8>   DW_AT_decl_file   : 6
    <7ece9>   DW_AT_decl_line   : 159
    <7ecea>   DW_AT_decl_column : 11
    <7eceb>   DW_AT_type        : <0x7e7c0>
    <7ecef>   DW_AT_data_member_location: 80
 <2><7ecf0>: Abbrev Number: 2 (DW_TAG_member)
    <7ecf1>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <7ecf5>   DW_AT_decl_file   : 6
    <7ecf6>   DW_AT_decl_line   : 160
    <7ecf7>   DW_AT_decl_column : 29
    <7ecf8>   DW_AT_type        : <0x7eeb6>
    <7ecfc>   DW_AT_data_member_location: 88
 <2><7ecfd>: Abbrev Number: 2 (DW_TAG_member)
    <7ecfe>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <7ed02>   DW_AT_decl_file   : 6
    <7ed03>   DW_AT_decl_line   : 161
    <7ed04>   DW_AT_decl_column : 9
    <7ed05>   DW_AT_type        : <0x7e7a6>
    <7ed09>   DW_AT_data_member_location: 96
 <2><7ed0a>: Abbrev Number: 2 (DW_TAG_member)
    <7ed0b>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <7ed0f>   DW_AT_decl_file   : 6
    <7ed10>   DW_AT_decl_line   : 162
    <7ed11>   DW_AT_decl_column : 27
    <7ed12>   DW_AT_type        : <0x7eee6>
    <7ed16>   DW_AT_data_member_location: 104
 <2><7ed17>: Abbrev Number: 2 (DW_TAG_member)
    <7ed18>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <7ed1c>   DW_AT_decl_file   : 6
    <7ed1d>   DW_AT_decl_line   : 163
    <7ed1e>   DW_AT_decl_column : 9
    <7ed1f>   DW_AT_type        : <0x7e7a6>
    <7ed23>   DW_AT_data_member_location: 112
 <2><7ed24>: Abbrev Number: 2 (DW_TAG_member)
    <7ed25>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <7ed29>   DW_AT_decl_file   : 6
    <7ed2a>   DW_AT_decl_line   : 164
    <7ed2b>   DW_AT_decl_column : 9
    <7ed2c>   DW_AT_type        : <0x7e7a6>
    <7ed30>   DW_AT_data_member_location: 116
 <2><7ed31>: Abbrev Number: 2 (DW_TAG_member)
    <7ed32>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <7ed36>   DW_AT_decl_file   : 6
    <7ed37>   DW_AT_decl_line   : 164
    <7ed38>   DW_AT_decl_column : 19
    <7ed39>   DW_AT_type        : <0x7e7a6>
    <7ed3d>   DW_AT_data_member_location: 120
 <2><7ed3e>: Abbrev Number: 2 (DW_TAG_member)
    <7ed3f>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <7ed43>   DW_AT_decl_file   : 6
    <7ed44>   DW_AT_decl_line   : 165
    <7ed45>   DW_AT_decl_column : 24
    <7ed46>   DW_AT_type        : <0x7ef1d>
    <7ed4a>   DW_AT_data_member_location: 128
 <2><7ed4b>: Abbrev Number: 2 (DW_TAG_member)
    <7ed4c>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <7ed50>   DW_AT_decl_file   : 6
    <7ed51>   DW_AT_decl_line   : 166
    <7ed52>   DW_AT_decl_column : 9
    <7ed53>   DW_AT_type        : <0x7e7a6>
    <7ed57>   DW_AT_data_member_location: 136
 <2><7ed58>: Abbrev Number: 2 (DW_TAG_member)
    <7ed59>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <7ed5d>   DW_AT_decl_file   : 6
    <7ed5e>   DW_AT_decl_line   : 166
    <7ed5f>   DW_AT_decl_column : 17
    <7ed60>   DW_AT_type        : <0x7e7a6>
    <7ed64>   DW_AT_data_member_location: 140
 <2><7ed65>: Abbrev Number: 2 (DW_TAG_member)
    <7ed66>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <7ed6a>   DW_AT_decl_file   : 6
    <7ed6b>   DW_AT_decl_line   : 167
    <7ed6c>   DW_AT_decl_column : 11
    <7ed6d>   DW_AT_type        : <0x7e800>
    <7ed71>   DW_AT_data_member_location: 144
 <2><7ed72>: Abbrev Number: 5 (DW_TAG_member)
    <7ed73>   DW_AT_name        : key
    <7ed77>   DW_AT_decl_file   : 6
    <7ed78>   DW_AT_decl_line   : 168
    <7ed79>   DW_AT_decl_column : 11
    <7ed7a>   DW_AT_type        : <0x7e7c0>
    <7ed7e>   DW_AT_data_member_location: 152
 <2><7ed7f>: Abbrev Number: 2 (DW_TAG_member)
    <7ed80>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <7ed84>   DW_AT_decl_file   : 6
    <7ed85>   DW_AT_decl_line   : 169
    <7ed86>   DW_AT_decl_column : 6
    <7ed87>   DW_AT_type        : <0x7e7a6>
    <7ed8b>   DW_AT_data_member_location: 160
 <2><7ed8c>: Abbrev Number: 2 (DW_TAG_member)
    <7ed8d>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <7ed91>   DW_AT_decl_file   : 6
    <7ed92>   DW_AT_decl_line   : 170
    <7ed93>   DW_AT_decl_column : 18
    <7ed94>   DW_AT_type        : <0x7ef22>
    <7ed98>   DW_AT_data_member_location: 168
 <2><7ed99>: Abbrev Number: 2 (DW_TAG_member)
    <7ed9a>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <7ed9e>   DW_AT_decl_file   : 6
    <7ed9f>   DW_AT_decl_line   : 171
    <7eda0>   DW_AT_decl_column : 12
    <7eda1>   DW_AT_type        : <0x7e912>
    <7eda5>   DW_AT_data_member_location: 176
 <2><7eda6>: Abbrev Number: 2 (DW_TAG_member)
    <7eda7>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <7edab>   DW_AT_decl_file   : 6
    <7edac>   DW_AT_decl_line   : 172
    <7edad>   DW_AT_decl_column : 9
    <7edae>   DW_AT_type        : <0x7e7a6>
    <7edb2>   DW_AT_data_member_location: 184
 <2><7edb3>: Abbrev Number: 2 (DW_TAG_member)
    <7edb4>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <7edb8>   DW_AT_decl_file   : 6
    <7edb9>   DW_AT_decl_line   : 172
    <7edba>   DW_AT_decl_column : 21
    <7edbb>   DW_AT_type        : <0x7e7a6>
    <7edbf>   DW_AT_data_member_location: 188
 <2><7edc0>: Abbrev Number: 2 (DW_TAG_member)
    <7edc1>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <7edc5>   DW_AT_decl_file   : 6
    <7edc6>   DW_AT_decl_line   : 173
    <7edc7>   DW_AT_decl_column : 11
    <7edc8>   DW_AT_type        : <0x7ef2c>
    <7edcc>   DW_AT_data_member_location: 192
 <2><7edcd>: Abbrev Number: 2 (DW_TAG_member)
    <7edce>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7edd2>   DW_AT_decl_file   : 6
    <7edd3>   DW_AT_decl_line   : 174
    <7edd4>   DW_AT_decl_column : 15
    <7edd5>   DW_AT_type        : <0x7e7ad>
    <7edd9>   DW_AT_data_member_location: 200
 <2><7edda>: Abbrev Number: 2 (DW_TAG_member)
    <7eddb>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <7eddf>   DW_AT_decl_file   : 6
    <7ede0>   DW_AT_decl_line   : 175
    <7ede1>   DW_AT_decl_column : 6
    <7ede2>   DW_AT_type        : <0x7e7a6>
    <7ede6>   DW_AT_data_member_location: 204
 <2><7ede7>: Abbrev Number: 0
 <1><7ede8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ede9>   DW_AT_byte_size   : 8
    <7ede9>   DW_AT_type        : <0x7e78a>
 <1><7eded>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7edee>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <7edf2>   DW_AT_byte_size   : 112
    <7edf3>   DW_AT_decl_file   : 6
    <7edf4>   DW_AT_decl_line   : 178
    <7edf5>   DW_AT_decl_column : 16
    <7edf6>   DW_AT_sibling     : <0x7eeb1>
 <2><7edfa>: Abbrev Number: 2 (DW_TAG_member)
    <7edfb>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <7edff>   DW_AT_decl_file   : 6
    <7ee00>   DW_AT_decl_line   : 188
    <7ee01>   DW_AT_decl_column : 8
    <7ee02>   DW_AT_type        : <0x7e7c0>
    <7ee06>   DW_AT_data_member_location: 0
 <2><7ee07>: Abbrev Number: 2 (DW_TAG_member)
    <7ee08>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <7ee0c>   DW_AT_decl_file   : 6
    <7ee0d>   DW_AT_decl_line   : 208
    <7ee0e>   DW_AT_decl_column : 8
    <7ee0f>   DW_AT_type        : <0x7ef65>
    <7ee13>   DW_AT_data_member_location: 8
 <2><7ee14>: Abbrev Number: 2 (DW_TAG_member)
    <7ee15>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <7ee19>   DW_AT_decl_file   : 6
    <7ee1a>   DW_AT_decl_line   : 222
    <7ee1b>   DW_AT_decl_column : 9
    <7ee1c>   DW_AT_type        : <0x7e7f3>
    <7ee20>   DW_AT_data_member_location: 16
 <2><7ee21>: Abbrev Number: 2 (DW_TAG_member)
    <7ee22>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <7ee26>   DW_AT_decl_file   : 6
    <7ee27>   DW_AT_decl_line   : 231
    <7ee28>   DW_AT_decl_column : 9
    <7ee29>   DW_AT_type        : <0x7e7f3>
    <7ee2d>   DW_AT_data_member_location: 24
 <2><7ee2e>: Abbrev Number: 2 (DW_TAG_member)
    <7ee2f>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <7ee33>   DW_AT_decl_file   : 6
    <7ee34>   DW_AT_decl_line   : 239
    <7ee35>   DW_AT_decl_column : 9
    <7ee36>   DW_AT_type        : <0x7e7f3>
    <7ee3a>   DW_AT_data_member_location: 32
 <2><7ee3b>: Abbrev Number: 2 (DW_TAG_member)
    <7ee3c>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <7ee40>   DW_AT_decl_file   : 6
    <7ee41>   DW_AT_decl_line   : 248
    <7ee42>   DW_AT_decl_column : 9
    <7ee43>   DW_AT_type        : <0x7ef84>
    <7ee47>   DW_AT_data_member_location: 40
 <2><7ee48>: Abbrev Number: 7 (DW_TAG_member)
    <7ee49>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <7ee4d>   DW_AT_decl_file   : 6
    <7ee4d>   DW_AT_decl_line   : 258
    <7ee4f>   DW_AT_decl_column : 9
    <7ee50>   DW_AT_type        : <0x7e7f3>
    <7ee54>   DW_AT_data_member_location: 48
 <2><7ee55>: Abbrev Number: 7 (DW_TAG_member)
    <7ee56>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <7ee5a>   DW_AT_decl_file   : 6
    <7ee5a>   DW_AT_decl_line   : 274
    <7ee5c>   DW_AT_decl_column : 8
    <7ee5d>   DW_AT_type        : <0x7e8ea>
    <7ee61>   DW_AT_data_member_location: 56
 <2><7ee62>: Abbrev Number: 7 (DW_TAG_member)
    <7ee63>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <7ee67>   DW_AT_decl_file   : 6
    <7ee67>   DW_AT_decl_line   : 285
    <7ee69>   DW_AT_decl_column : 9
    <7ee6a>   DW_AT_type        : <0x7ef84>
    <7ee6e>   DW_AT_data_member_location: 64
 <2><7ee6f>: Abbrev Number: 7 (DW_TAG_member)
    <7ee70>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <7ee74>   DW_AT_decl_file   : 6
    <7ee74>   DW_AT_decl_line   : 293
    <7ee76>   DW_AT_decl_column : 9
    <7ee77>   DW_AT_type        : <0x7ef94>
    <7ee7b>   DW_AT_data_member_location: 72
 <2><7ee7c>: Abbrev Number: 7 (DW_TAG_member)
    <7ee7d>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <7ee81>   DW_AT_decl_file   : 6
    <7ee81>   DW_AT_decl_line   : 301
    <7ee83>   DW_AT_decl_column : 8
    <7ee84>   DW_AT_type        : <0x7e8cc>
    <7ee88>   DW_AT_data_member_location: 80
 <2><7ee89>: Abbrev Number: 7 (DW_TAG_member)
    <7ee8a>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <7ee8e>   DW_AT_decl_file   : 6
    <7ee8e>   DW_AT_decl_line   : 314
    <7ee90>   DW_AT_decl_column : 9
    <7ee91>   DW_AT_type        : <0x7efad>
    <7ee95>   DW_AT_data_member_location: 88
 <2><7ee96>: Abbrev Number: 7 (DW_TAG_member)
    <7ee97>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <7ee9b>   DW_AT_decl_file   : 6
    <7ee9b>   DW_AT_decl_line   : 321
    <7ee9d>   DW_AT_decl_column : 9
    <7ee9e>   DW_AT_type        : <0x7e7f3>
    <7eea2>   DW_AT_data_member_location: 96
 <2><7eea3>: Abbrev Number: 7 (DW_TAG_member)
    <7eea4>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <7eea8>   DW_AT_decl_file   : 6
    <7eea8>   DW_AT_decl_line   : 328
    <7eeaa>   DW_AT_decl_column : 9
    <7eeab>   DW_AT_type        : <0x7e7f3>
    <7eeaf>   DW_AT_data_member_location: 104
 <2><7eeb0>: Abbrev Number: 0
 <1><7eeb1>: Abbrev Number: 16 (DW_TAG_const_type)
    <7eeb2>   DW_AT_type        : <0x7eded>
 <1><7eeb6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eeb7>   DW_AT_byte_size   : 8
    <7eeb7>   DW_AT_type        : <0x7eeb1>
 <1><7eebb>: Abbrev Number: 30 (DW_TAG_structure_type)
    <7eebc>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <7eec0>   DW_AT_byte_size   : 16
    <7eec0>   DW_AT_decl_file   : 6
    <7eec0>   DW_AT_decl_line   : 331
    <7eec2>   DW_AT_decl_column : 16
    <7eec2>   DW_AT_sibling     : <0x7eee1>
 <2><7eec6>: Abbrev Number: 7 (DW_TAG_member)
    <7eec7>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <7eecb>   DW_AT_decl_file   : 6
    <7eecb>   DW_AT_decl_line   : 333
    <7eecd>   DW_AT_decl_column : 12
    <7eece>   DW_AT_type        : <0x7e7b2>
    <7eed2>   DW_AT_data_member_location: 0
 <2><7eed3>: Abbrev Number: 7 (DW_TAG_member)
    <7eed4>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7eed8>   DW_AT_decl_file   : 6
    <7eed8>   DW_AT_decl_line   : 334
    <7eeda>   DW_AT_decl_column : 23
    <7eedb>   DW_AT_type        : <0x7efb2>
    <7eedf>   DW_AT_data_member_location: 8
 <2><7eee0>: Abbrev Number: 0
 <1><7eee1>: Abbrev Number: 16 (DW_TAG_const_type)
    <7eee2>   DW_AT_type        : <0x7eebb>
 <1><7eee6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7eee7>   DW_AT_byte_size   : 8
    <7eee7>   DW_AT_type        : <0x7eee1>
 <1><7eeeb>: Abbrev Number: 30 (DW_TAG_structure_type)
    <7eeec>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <7eef0>   DW_AT_byte_size   : 16
    <7eef0>   DW_AT_decl_file   : 6
    <7eef0>   DW_AT_decl_line   : 337
    <7eef2>   DW_AT_decl_column : 16
    <7eef2>   DW_AT_sibling     : <0x7ef18>
 <2><7eef6>: Abbrev Number: 31 (DW_TAG_member)
    <7eef7>   DW_AT_name        : w
    <7eef9>   DW_AT_decl_file   : 6
    <7eef9>   DW_AT_decl_line   : 339
    <7eefb>   DW_AT_decl_column : 15
    <7eefb>   DW_AT_type        : <0x7e7b2>
    <7eeff>   DW_AT_data_member_location: 0
 <2><7ef00>: Abbrev Number: 31 (DW_TAG_member)
    <7ef01>   DW_AT_name        : h
    <7ef03>   DW_AT_decl_file   : 6
    <7ef03>   DW_AT_decl_line   : 340
    <7ef05>   DW_AT_decl_column : 15
    <7ef05>   DW_AT_type        : <0x7e7b2>
    <7ef09>   DW_AT_data_member_location: 4
 <2><7ef0a>: Abbrev Number: 7 (DW_TAG_member)
    <7ef0b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7ef0f>   DW_AT_decl_file   : 6
    <7ef0f>   DW_AT_decl_line   : 341
    <7ef11>   DW_AT_decl_column : 23
    <7ef12>   DW_AT_type        : <0x7efb2>
    <7ef16>   DW_AT_data_member_location: 8
 <2><7ef17>: Abbrev Number: 0
 <1><7ef18>: Abbrev Number: 16 (DW_TAG_const_type)
    <7ef19>   DW_AT_type        : <0x7eeeb>
 <1><7ef1d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef1e>   DW_AT_byte_size   : 8
    <7ef1e>   DW_AT_type        : <0x7ef18>
 <1><7ef22>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef23>   DW_AT_byte_size   : 8
    <7ef23>   DW_AT_type        : <0x7ef27>
 <1><7ef27>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef28>   DW_AT_byte_size   : 8
    <7ef28>   DW_AT_type        : <0x7ec19>
 <1><7ef2c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef2d>   DW_AT_byte_size   : 8
    <7ef2d>   DW_AT_type        : <0x7e807>
 <1><7ef31>: Abbrev Number: 10 (DW_TAG_typedef)
    <7ef32>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7ef36>   DW_AT_decl_file   : 6
    <7ef37>   DW_AT_decl_line   : 176
    <7ef38>   DW_AT_decl_column : 3
    <7ef39>   DW_AT_type        : <0x7ec25>
 <1><7ef3d>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7ef3e>   DW_AT_prototyped  : 1
    <7ef3e>   DW_AT_type        : <0x7e7a6>
    <7ef42>   DW_AT_sibling     : <0x7ef65>
 <2><7ef46>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef47>   DW_AT_type        : <0x7e7c0>
 <2><7ef4b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef4c>   DW_AT_type        : <0x7e7a6>
 <2><7ef50>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef51>   DW_AT_type        : <0x7e7a6>
 <2><7ef55>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef56>   DW_AT_type        : <0x7e7a6>
 <2><7ef5a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef5b>   DW_AT_type        : <0x7e7a6>
 <2><7ef5f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef60>   DW_AT_type        : <0x7e7a6>
 <2><7ef64>: Abbrev Number: 0
 <1><7ef65>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef66>   DW_AT_byte_size   : 8
    <7ef66>   DW_AT_type        : <0x7ef3d>
 <1><7ef6a>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <7ef6b>   DW_AT_prototyped  : 1
    <7ef6b>   DW_AT_sibling     : <0x7ef84>
 <2><7ef6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef70>   DW_AT_type        : <0x7e7a6>
 <2><7ef74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef75>   DW_AT_type        : <0x7e7a6>
 <2><7ef79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef7a>   DW_AT_type        : <0x7e7a6>
 <2><7ef7e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef7f>   DW_AT_type        : <0x7e7a6>
 <2><7ef83>: Abbrev Number: 0
 <1><7ef84>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef85>   DW_AT_byte_size   : 8
    <7ef85>   DW_AT_type        : <0x7ef6a>
 <1><7ef89>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <7ef8a>   DW_AT_prototyped  : 1
    <7ef8a>   DW_AT_sibling     : <0x7ef94>
 <2><7ef8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef8f>   DW_AT_type        : <0x7e7c0>
 <2><7ef93>: Abbrev Number: 0
 <1><7ef94>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7ef95>   DW_AT_byte_size   : 8
    <7ef95>   DW_AT_type        : <0x7ef89>
 <1><7ef99>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <7ef9a>   DW_AT_prototyped  : 1
    <7ef9a>   DW_AT_type        : <0x7e8e5>
    <7ef9e>   DW_AT_sibling     : <0x7efad>
 <2><7efa2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efa3>   DW_AT_type        : <0x7e7a6>
 <2><7efa7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efa8>   DW_AT_type        : <0x7e8e5>
 <2><7efac>: Abbrev Number: 0
 <1><7efad>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7efae>   DW_AT_byte_size   : 8
    <7efae>   DW_AT_type        : <0x7ef99>
 <1><7efb2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7efb3>   DW_AT_byte_size   : 8
    <7efb3>   DW_AT_type        : <0x7e77e>
 <1><7efb7>: Abbrev Number: 32 (DW_TAG_variable)
    <7efb8>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <7efbc>   DW_AT_decl_file   : 6
    <7efbc>   DW_AT_decl_line   : 364
    <7efbe>   DW_AT_decl_column : 15
    <7efbf>   DW_AT_type        : <0x7efc3>
    <7efc3>   DW_AT_external    : 1
    <7efc3>   DW_AT_declaration : 1
 <1><7efc3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7efc4>   DW_AT_byte_size   : 8
    <7efc4>   DW_AT_type        : <0x7ef31>
 <1><7efc8>: Abbrev Number: 32 (DW_TAG_variable)
    <7efc9>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <7efcd>   DW_AT_decl_file   : 6
    <7efcd>   DW_AT_decl_line   : 369
    <7efcf>   DW_AT_decl_column : 16
    <7efd0>   DW_AT_type        : <0x7ebbc>
    <7efd4>   DW_AT_external    : 1
    <7efd4>   DW_AT_declaration : 1
 <1><7efd4>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7efd5>   DW_AT_external    : 1
    <7efd5>   DW_AT_name        : (indirect string, offset: 0x17dac): fb_hGfxBox
    <7efd9>   DW_AT_decl_file   : 6
    <7efd9>   DW_AT_decl_line   : 415
    <7efdb>   DW_AT_decl_column : 13
    <7efdc>   DW_AT_prototyped  : 1
    <7efdc>   DW_AT_declaration : 1
    <7efdc>   DW_AT_sibling     : <0x7f004>
 <2><7efe0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efe1>   DW_AT_type        : <0x7e7a6>
 <2><7efe5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efe6>   DW_AT_type        : <0x7e7a6>
 <2><7efea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efeb>   DW_AT_type        : <0x7e7a6>
 <2><7efef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eff0>   DW_AT_type        : <0x7e7a6>
 <2><7eff4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eff5>   DW_AT_type        : <0x7e78a>
 <2><7eff9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7effa>   DW_AT_type        : <0x7e7a6>
 <2><7effe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7efff>   DW_AT_type        : <0x7e78a>
 <2><7f003>: Abbrev Number: 0
 <1><7f004>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f005>   DW_AT_external    : 1
    <7f005>   DW_AT_name        : (indirect string, offset: 0x17b97): fb_hFixCoordsOrder
    <7f009>   DW_AT_decl_file   : 6
    <7f009>   DW_AT_decl_line   : 413
    <7f00b>   DW_AT_decl_column : 13
    <7f00c>   DW_AT_prototyped  : 1
    <7f00c>   DW_AT_declaration : 1
    <7f00c>   DW_AT_sibling     : <0x7f025>
 <2><7f010>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f011>   DW_AT_type        : <0x7e8e5>
 <2><7f015>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f016>   DW_AT_type        : <0x7e8e5>
 <2><7f01a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f01b>   DW_AT_type        : <0x7e8e5>
 <2><7f01f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f020>   DW_AT_type        : <0x7e8e5>
 <2><7f024>: Abbrev Number: 0
 <1><7f025>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f026>   DW_AT_external    : 1
    <7f026>   DW_AT_name        : (indirect string, offset: 0x16de3): fb_hTranslateCoord
    <7f02a>   DW_AT_decl_file   : 6
    <7f02a>   DW_AT_decl_line   : 411
    <7f02c>   DW_AT_decl_column : 13
    <7f02d>   DW_AT_prototyped  : 1
    <7f02d>   DW_AT_declaration : 1
    <7f02d>   DW_AT_sibling     : <0x7f04b>
 <2><7f031>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f032>   DW_AT_type        : <0x7f04b>
 <2><7f036>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f037>   DW_AT_type        : <0x7e800>
 <2><7f03b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f03c>   DW_AT_type        : <0x7e800>
 <2><7f040>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f041>   DW_AT_type        : <0x7e8e5>
 <2><7f045>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f046>   DW_AT_type        : <0x7e8e5>
 <2><7f04a>: Abbrev Number: 0
 <1><7f04b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7f04c>   DW_AT_byte_size   : 8
    <7f04c>   DW_AT_type        : <0x7ebdb>
 <1><7f050>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f051>   DW_AT_external    : 1
    <7f051>   DW_AT_name        : (indirect string, offset: 0x16e2a): fb_hFixRelative
    <7f055>   DW_AT_decl_file   : 6
    <7f055>   DW_AT_decl_line   : 412
    <7f057>   DW_AT_decl_column : 13
    <7f058>   DW_AT_prototyped  : 1
    <7f058>   DW_AT_declaration : 1
    <7f058>   DW_AT_sibling     : <0x7f07b>
 <2><7f05c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f05d>   DW_AT_type        : <0x7f04b>
 <2><7f061>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f062>   DW_AT_type        : <0x7e7a6>
 <2><7f066>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f067>   DW_AT_type        : <0x7f07b>
 <2><7f06b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f06c>   DW_AT_type        : <0x7f07b>
 <2><7f070>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f071>   DW_AT_type        : <0x7f07b>
 <2><7f075>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f076>   DW_AT_type        : <0x7f07b>
 <2><7f07a>: Abbrev Number: 0
 <1><7f07b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7f07c>   DW_AT_byte_size   : 8
    <7f07c>   DW_AT_type        : <0x7e800>
 <1><7f080>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f081>   DW_AT_external    : 1
    <7f081>   DW_AT_name        : (indirect string, offset: 0x165a6): fb_hSetPixelTransfer
    <7f085>   DW_AT_decl_file   : 6
    <7f085>   DW_AT_decl_line   : 410
    <7f087>   DW_AT_decl_column : 13
    <7f088>   DW_AT_prototyped  : 1
    <7f088>   DW_AT_declaration : 1
    <7f088>   DW_AT_sibling     : <0x7f097>
 <2><7f08c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f08d>   DW_AT_type        : <0x7f04b>
 <2><7f091>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f092>   DW_AT_type        : <0x7e78a>
 <2><7f096>: Abbrev Number: 0
 <1><7f097>: Abbrev Number: 43 (DW_TAG_subprogram)
    <7f098>   DW_AT_external    : 1
    <7f098>   DW_AT_name        : (indirect string, offset: 0x16da4): fb_hFixColor
    <7f09c>   DW_AT_decl_file   : 6
    <7f09d>   DW_AT_decl_line   : 405
    <7f09f>   DW_AT_decl_column : 21
    <7f0a0>   DW_AT_prototyped  : 1
    <7f0a0>   DW_AT_type        : <0x7e78a>
    <7f0a4>   DW_AT_declaration : 1
    <7f0a4>   DW_AT_sibling     : <0x7f0b3>
 <2><7f0a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0a9>   DW_AT_type        : <0x7e7a6>
 <2><7f0ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0ae>   DW_AT_type        : <0x7e78a>
 <2><7f0b2>: Abbrev Number: 0
 <1><7f0b3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f0b4>   DW_AT_external    : 1
    <7f0b4>   DW_AT_name        : (indirect string, offset: 0x16772): fb_hPrepareTarget
    <7f0b8>   DW_AT_decl_file   : 6
    <7f0b8>   DW_AT_decl_line   : 409
    <7f0ba>   DW_AT_decl_column : 13
    <7f0bb>   DW_AT_prototyped  : 1
    <7f0bb>   DW_AT_declaration : 1
    <7f0bb>   DW_AT_sibling     : <0x7f0ca>
 <2><7f0bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0c0>   DW_AT_type        : <0x7f04b>
 <2><7f0c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0c5>   DW_AT_type        : <0x7e7be>
 <2><7f0c9>: Abbrev Number: 0
 <1><7f0ca>: Abbrev Number: 44 (DW_TAG_subprogram)
    <7f0cb>   DW_AT_external    : 1
    <7f0cb>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <7f0cf>   DW_AT_decl_file   : 6
    <7f0d0>   DW_AT_decl_line   : 396
    <7f0d2>   DW_AT_decl_column : 19
    <7f0d3>   DW_AT_prototyped  : 1
    <7f0d3>   DW_AT_type        : <0x7f04b>
    <7f0d7>   DW_AT_declaration : 1
 <1><7f0d7>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7f0d8>   DW_AT_external    : 1
    <7f0d8>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <7f0dc>   DW_AT_decl_file   : 6
    <7f0dc>   DW_AT_decl_line   : 470
    <7f0de>   DW_AT_decl_column : 20
    <7f0df>   DW_AT_prototyped  : 1
    <7f0df>   DW_AT_declaration : 1
    <7f0df>   DW_AT_sibling     : <0x7f0ee>
 <2><7f0e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0e4>   DW_AT_type        : <0x7e7a6>
 <2><7f0e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f0e9>   DW_AT_type        : <0x7e7a6>
 <2><7f0ed>: Abbrev Number: 0
 <1><7f0ee>: Abbrev Number: 45 (DW_TAG_subprogram)
    <7f0ef>   DW_AT_external    : 1
    <7f0ef>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <7f0f3>   DW_AT_decl_file   : 6
    <7f0f4>   DW_AT_decl_line   : 469
    <7f0f6>   DW_AT_decl_column : 20
    <7f0f7>   DW_AT_prototyped  : 1
    <7f0f7>   DW_AT_declaration : 1
 <1><7f0f7>: Abbrev Number: 33 (DW_TAG_subprogram)
    <7f0f8>   DW_AT_external    : 1
    <7f0f8>   DW_AT_name        : (indirect string, offset: 0x49a5): fb_GfxLine
    <7f0fc>   DW_AT_decl_file   : 1
    <7f0fc>   DW_AT_decl_line   : 203
    <7f0fd>   DW_AT_decl_column : 13
    <7f0fe>   DW_AT_prototyped  : 1
    <7f0fe>   DW_AT_low_pc      : 0x45d230
    <7f106>   DW_AT_high_pc     : 0x197
    <7f10e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7f110>   DW_AT_call_all_calls: 1
    <7f110>   DW_AT_sibling     : <0x7f367>
 <2><7f114>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f115>   DW_AT_name        : (indirect string, offset: 0x167a7): target
    <7f119>   DW_AT_decl_file   : 1
    <7f119>   DW_AT_decl_line   : 203
    <7f11a>   DW_AT_decl_column : 30
    <7f11b>   DW_AT_type        : <0x7e7be>
    <7f11f>   DW_AT_location    : 0x26277 (location list)
    <7f123>   DW_AT_GNU_locviews: 0x2626d
 <2><7f127>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f128>   DW_AT_name        : fx1
    <7f12c>   DW_AT_decl_file   : 1
    <7f12c>   DW_AT_decl_line   : 203
    <7f12d>   DW_AT_decl_column : 44
    <7f12e>   DW_AT_type        : <0x7e800>
    <7f132>   DW_AT_location    : 0x262a3 (location list)
    <7f136>   DW_AT_GNU_locviews: 0x262a1
 <2><7f13a>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f13b>   DW_AT_name        : fy1
    <7f13f>   DW_AT_decl_file   : 1
    <7f13f>   DW_AT_decl_line   : 203
    <7f140>   DW_AT_decl_column : 55
    <7f141>   DW_AT_type        : <0x7e800>
    <7f145>   DW_AT_location    : 0x262ad (location list)
    <7f149>   DW_AT_GNU_locviews: 0x262ab
 <2><7f14d>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f14e>   DW_AT_name        : fx2
    <7f152>   DW_AT_decl_file   : 1
    <7f152>   DW_AT_decl_line   : 203
    <7f153>   DW_AT_decl_column : 66
    <7f154>   DW_AT_type        : <0x7e800>
    <7f158>   DW_AT_location    : 0x262b7 (location list)
    <7f15c>   DW_AT_GNU_locviews: 0x262b5
 <2><7f160>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f161>   DW_AT_name        : fy2
    <7f165>   DW_AT_decl_file   : 1
    <7f165>   DW_AT_decl_line   : 203
    <7f166>   DW_AT_decl_column : 77
    <7f167>   DW_AT_type        : <0x7e800>
    <7f16b>   DW_AT_location    : 0x262c1 (location list)
    <7f16f>   DW_AT_GNU_locviews: 0x262bf
 <2><7f173>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f174>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7f178>   DW_AT_decl_file   : 1
    <7f178>   DW_AT_decl_line   : 203
    <7f179>   DW_AT_decl_column : 95
    <7f17a>   DW_AT_type        : <0x7e78a>
    <7f17e>   DW_AT_location    : 0x262d3 (location list)
    <7f182>   DW_AT_GNU_locviews: 0x262c9
 <2><7f186>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f187>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7f18b>   DW_AT_decl_file   : 1
    <7f18b>   DW_AT_decl_line   : 203
    <7f18c>   DW_AT_decl_column : 106
    <7f18d>   DW_AT_type        : <0x7e7a6>
    <7f191>   DW_AT_location    : 0x26301 (location list)
    <7f195>   DW_AT_GNU_locviews: 0x262f7
 <2><7f199>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f19a>   DW_AT_name        : (indirect string, offset: 0x18eb7): style
    <7f19e>   DW_AT_decl_file   : 1
    <7f19e>   DW_AT_decl_line   : 203
    <7f19f>   DW_AT_decl_column : 125
    <7f1a0>   DW_AT_type        : <0x7e78a>
    <7f1a4>   DW_AT_location    : 0x26335 (location list)
    <7f1a8>   DW_AT_GNU_locviews: 0x2632b
 <2><7f1ac>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f1ad>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7f1b1>   DW_AT_decl_file   : 1
    <7f1b1>   DW_AT_decl_line   : 203
    <7f1b2>   DW_AT_decl_column : 136
    <7f1b3>   DW_AT_type        : <0x7e7a6>
    <7f1b7>   DW_AT_location    : 0x26366 (location list)
    <7f1bb>   DW_AT_GNU_locviews: 0x2635c
 <2><7f1bf>: Abbrev Number: 15 (DW_TAG_variable)
    <7f1c0>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7f1c4>   DW_AT_decl_file   : 1
    <7f1c4>   DW_AT_decl_line   : 205
    <7f1c5>   DW_AT_decl_column : 13
    <7f1c6>   DW_AT_type        : <0x7f04b>
    <7f1ca>   DW_AT_location    : 0x26396 (location list)
    <7f1ce>   DW_AT_GNU_locviews: 0x26390
 <2><7f1d2>: Abbrev Number: 22 (DW_TAG_variable)
    <7f1d3>   DW_AT_name        : x1
    <7f1d6>   DW_AT_decl_file   : 1
    <7f1d6>   DW_AT_decl_line   : 206
    <7f1d6>   DW_AT_decl_column : 6
    <7f1d7>   DW_AT_type        : <0x7e7a6>
    <7f1db>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><7f1df>: Abbrev Number: 22 (DW_TAG_variable)
    <7f1e0>   DW_AT_name        : y1
    <7f1e3>   DW_AT_decl_file   : 1
    <7f1e3>   DW_AT_decl_line   : 206
    <7f1e3>   DW_AT_decl_column : 10
    <7f1e4>   DW_AT_type        : <0x7e7a6>
    <7f1e8>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><7f1ec>: Abbrev Number: 22 (DW_TAG_variable)
    <7f1ed>   DW_AT_name        : x2
    <7f1f0>   DW_AT_decl_file   : 1
    <7f1f0>   DW_AT_decl_line   : 206
    <7f1f0>   DW_AT_decl_column : 14
    <7f1f1>   DW_AT_type        : <0x7e7a6>
    <7f1f5>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><7f1f9>: Abbrev Number: 22 (DW_TAG_variable)
    <7f1fa>   DW_AT_name        : y2
    <7f1fd>   DW_AT_decl_file   : 1
    <7f1fd>   DW_AT_decl_line   : 206
    <7f1fd>   DW_AT_decl_column : 18
    <7f1fe>   DW_AT_type        : <0x7e7a6>
    <7f202>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7f206>: Abbrev Number: 26 (DW_TAG_call_site)
    <7f207>   DW_AT_call_return_pc: 0x45d287
    <7f20f>   DW_AT_call_origin : <0x7f0ca>
 <2><7f213>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f214>   DW_AT_call_return_pc: 0x45d295
    <7f21c>   DW_AT_call_origin : <0x7f0b3>
    <7f220>   DW_AT_sibling     : <0x7f231>
 <3><7f224>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f225>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f227>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f22a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f22b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f22d>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><7f230>: Abbrev Number: 0
 <2><7f231>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f232>   DW_AT_call_return_pc: 0x45d2b5
    <7f23a>   DW_AT_call_origin : <0x7f080>
    <7f23e>   DW_AT_sibling     : <0x7f24f>
 <3><7f242>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f243>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f245>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f248>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f249>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f24b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f24e>: Abbrev Number: 0
 <2><7f24f>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f250>   DW_AT_call_return_pc: 0x45d2d9
    <7f258>   DW_AT_call_origin : <0x7f050>
    <7f25c>   DW_AT_sibling     : <0x7f289>
 <3><7f260>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f261>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f263>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f266>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f267>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f269>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><7f26c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f26d>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f26f>   DW_AT_call_value  : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <3><7f273>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f274>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7f276>   DW_AT_call_value  : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <3><7f27a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f27b>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <7f27d>   DW_AT_call_value  : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <3><7f281>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f282>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7f284>   DW_AT_call_value  : 3 byte block: 91 90 7f 	(DW_OP_fbreg: -112)
 <3><7f288>: Abbrev Number: 0
 <2><7f289>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f28a>   DW_AT_call_return_pc: 0x45d2f3
    <7f292>   DW_AT_call_origin : <0x7f025>
    <7f296>   DW_AT_sibling     : <0x7f2af>
 <3><7f29a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f29b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f29d>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f2a0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2a1>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f2a3>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><7f2a7>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2a8>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f2aa>   DW_AT_call_value  : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><7f2ae>: Abbrev Number: 0
 <2><7f2af>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f2b0>   DW_AT_call_return_pc: 0x45d320
    <7f2b8>   DW_AT_call_origin : <0x7f025>
    <7f2bc>   DW_AT_sibling     : <0x7f2d5>
 <3><7f2c0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2c1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f2c3>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f2c6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2c7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f2c9>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><7f2cd>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2ce>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f2d0>   DW_AT_call_value  : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <3><7f2d4>: Abbrev Number: 0
 <2><7f2d5>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f2d6>   DW_AT_call_return_pc: 0x45d34f
    <7f2de>   DW_AT_call_origin : <0x7f367>
    <7f2e2>   DW_AT_sibling     : <0x7f2f3>
 <3><7f2e6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2e7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f2e9>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f2ec>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f2ed>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7f2ef>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f2f2>: Abbrev Number: 0
 <2><7f2f3>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f2f4>   DW_AT_call_return_pc: 0x45d37b
    <7f2fc>   DW_AT_call_origin : <0x7f097>
    <7f300>   DW_AT_sibling     : <0x7f30b>
 <3><7f304>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f305>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f307>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f30a>: Abbrev Number: 0
 <2><7f30b>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f30c>   DW_AT_call_return_pc: 0x45d396
    <7f314>   DW_AT_call_origin : <0x7f004>
    <7f318>   DW_AT_sibling     : <0x7f331>
 <3><7f31c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f31d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f31f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><7f322>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f323>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f325>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><7f328>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f329>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f32b>   DW_AT_call_value  : 4 byte block: 91 80 7f 6 	(DW_OP_fbreg: -128; DW_OP_deref)
 <3><7f330>: Abbrev Number: 0
 <2><7f331>: Abbrev Number: 8 (DW_TAG_call_site)
    <7f332>   DW_AT_call_return_pc: 0x45d3be
    <7f33a>   DW_AT_call_origin : <0x7efd4>
    <7f33e>   DW_AT_sibling     : <0x7f359>
 <3><7f342>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f343>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <7f345>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f348>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f349>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <7f34b>   DW_AT_call_value  : 12 byte block: 7d 0 8 20 24 40 4d 24 29 8 ff 1a 	(DW_OP_breg13 (r13): 0; DW_OP_const1u: 32; DW_OP_shl; DW_OP_lit16; DW_OP_lit29; DW_OP_shl; DW_OP_eq; DW_OP_const1u: 255; DW_OP_and)
 <3><7f358>: Abbrev Number: 0
 <2><7f359>: Abbrev Number: 26 (DW_TAG_call_site)
    <7f35a>   DW_AT_call_return_pc: 0x45d3c7
    <7f362>   DW_AT_call_origin : <0x7f671>
 <2><7f366>: Abbrev Number: 0
 <1><7f367>: Abbrev Number: 33 (DW_TAG_subprogram)
    <7f368>   DW_AT_external    : 1
    <7f368>   DW_AT_name        : (indirect string, offset: 0x17ddd): fb_GfxDrawLine
    <7f36c>   DW_AT_decl_file   : 1
    <7f36c>   DW_AT_decl_line   : 18
    <7f36d>   DW_AT_decl_column : 6
    <7f36e>   DW_AT_prototyped  : 1
    <7f36e>   DW_AT_low_pc      : 0x45cad0
    <7f376>   DW_AT_high_pc     : 0x75e
    <7f37e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7f380>   DW_AT_call_all_calls: 1
    <7f380>   DW_AT_sibling     : <0x7f653>
 <2><7f384>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f385>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7f389>   DW_AT_decl_file   : 1
    <7f389>   DW_AT_decl_line   : 18
    <7f38a>   DW_AT_decl_column : 32
    <7f38b>   DW_AT_type        : <0x7f04b>
    <7f38f>   DW_AT_location    : 0x263d2 (location list)
    <7f393>   DW_AT_GNU_locviews: 0x263ac
 <2><7f397>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f398>   DW_AT_name        : x1
    <7f39b>   DW_AT_decl_file   : 1
    <7f39b>   DW_AT_decl_line   : 18
    <7f39c>   DW_AT_decl_column : 45
    <7f39d>   DW_AT_type        : <0x7e7a6>
    <7f3a1>   DW_AT_location    : 0x26485 (location list)
    <7f3a5>   DW_AT_GNU_locviews: 0x26465
 <2><7f3a9>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f3aa>   DW_AT_name        : y1
    <7f3ad>   DW_AT_decl_file   : 1
    <7f3ad>   DW_AT_decl_line   : 18
    <7f3ae>   DW_AT_decl_column : 53
    <7f3af>   DW_AT_type        : <0x7e7a6>
    <7f3b3>   DW_AT_location    : 0x26536 (location list)
    <7f3b7>   DW_AT_GNU_locviews: 0x26500
 <2><7f3bb>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f3bc>   DW_AT_name        : x2
    <7f3bf>   DW_AT_decl_file   : 1
    <7f3bf>   DW_AT_decl_line   : 18
    <7f3c0>   DW_AT_decl_column : 61
    <7f3c1>   DW_AT_type        : <0x7e7a6>
    <7f3c5>   DW_AT_location    : 0x26615 (location list)
    <7f3c9>   DW_AT_GNU_locviews: 0x26609
 <2><7f3cd>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <7f3ce>   DW_AT_name        : y2
    <7f3d1>   DW_AT_decl_file   : 1
    <7f3d1>   DW_AT_decl_line   : 18
    <7f3d2>   DW_AT_decl_column : 69
    <7f3d3>   DW_AT_type        : <0x7e7a6>
    <7f3d7>   DW_AT_location    : 0x2668f (location list)
    <7f3db>   DW_AT_GNU_locviews: 0x26671
 <2><7f3df>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f3e0>   DW_AT_name        : (indirect string, offset: 0x18d57): color
    <7f3e4>   DW_AT_decl_file   : 1
    <7f3e4>   DW_AT_decl_line   : 18
    <7f3e5>   DW_AT_decl_column : 86
    <7f3e6>   DW_AT_type        : <0x7e78a>
    <7f3ea>   DW_AT_location    : 0x26720 (location list)
    <7f3ee>   DW_AT_GNU_locviews: 0x266fa
 <2><7f3f2>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f3f3>   DW_AT_name        : (indirect string, offset: 0x18eb7): style
    <7f3f7>   DW_AT_decl_file   : 1
    <7f3f7>   DW_AT_decl_line   : 18
    <7f3f8>   DW_AT_decl_column : 106
    <7f3f9>   DW_AT_type        : <0x7e78a>
    <7f3fd>   DW_AT_location    : 0x267c9 (location list)
    <7f401>   DW_AT_GNU_locviews: 0x267b5
 <2><7f405>: Abbrev Number: 9 (DW_TAG_variable)
    <7f406>   DW_AT_name        : x
    <7f408>   DW_AT_decl_file   : 1
    <7f408>   DW_AT_decl_line   : 20
    <7f408>   DW_AT_decl_column : 6
    <7f409>   DW_AT_type        : <0x7e7a6>
    <7f40d>   DW_AT_location    : 0x26830 (location list)
    <7f411>   DW_AT_GNU_locviews: 0x26816
 <2><7f415>: Abbrev Number: 9 (DW_TAG_variable)
    <7f416>   DW_AT_name        : y
    <7f418>   DW_AT_decl_file   : 1
    <7f418>   DW_AT_decl_line   : 20
    <7f418>   DW_AT_decl_column : 9
    <7f419>   DW_AT_type        : <0x7e7a6>
    <7f41d>   DW_AT_location    : 0x268a6 (location list)
    <7f421>   DW_AT_GNU_locviews: 0x2688e
 <2><7f425>: Abbrev Number: 9 (DW_TAG_variable)
    <7f426>   DW_AT_name        : d
    <7f428>   DW_AT_decl_file   : 1
    <7f428>   DW_AT_decl_line   : 20
    <7f428>   DW_AT_decl_column : 12
    <7f429>   DW_AT_type        : <0x7e7a6>
    <7f42d>   DW_AT_location    : 0x26921 (location list)
    <7f431>   DW_AT_GNU_locviews: 0x268fd
 <2><7f435>: Abbrev Number: 9 (DW_TAG_variable)
    <7f436>   DW_AT_name        : dx
    <7f439>   DW_AT_decl_file   : 1
    <7f439>   DW_AT_decl_line   : 20
    <7f439>   DW_AT_decl_column : 15
    <7f43a>   DW_AT_type        : <0x7e7a6>
    <7f43e>   DW_AT_location    : 0x26a4e (location list)
    <7f442>   DW_AT_GNU_locviews: 0x26a28
 <2><7f446>: Abbrev Number: 9 (DW_TAG_variable)
    <7f447>   DW_AT_name        : dy
    <7f44a>   DW_AT_decl_file   : 1
    <7f44a>   DW_AT_decl_line   : 20
    <7f44a>   DW_AT_decl_column : 19
    <7f44b>   DW_AT_type        : <0x7e7a6>
    <7f44f>   DW_AT_location    : 0x26b33 (location list)
    <7f453>   DW_AT_GNU_locviews: 0x26b0d
 <2><7f457>: Abbrev Number: 9 (DW_TAG_variable)
    <7f458>   DW_AT_name        : ax
    <7f45b>   DW_AT_decl_file   : 1
    <7f45b>   DW_AT_decl_line   : 20
    <7f45b>   DW_AT_decl_column : 23
    <7f45c>   DW_AT_type        : <0x7e7a6>
    <7f460>   DW_AT_location    : 0x26c52 (location list)
    <7f464>   DW_AT_GNU_locviews: 0x26c50
 <2><7f468>: Abbrev Number: 9 (DW_TAG_variable)
    <7f469>   DW_AT_name        : ay
    <7f46c>   DW_AT_decl_file   : 1
    <7f46c>   DW_AT_decl_line   : 20
    <7f46c>   DW_AT_decl_column : 27
    <7f46d>   DW_AT_type        : <0x7e7a6>
    <7f471>   DW_AT_location    : 0x26c5d (location list)
    <7f475>   DW_AT_GNU_locviews: 0x26c5b
 <2><7f479>: Abbrev Number: 15 (DW_TAG_variable)
    <7f47a>   DW_AT_name        : (indirect string, offset: 0x17dce): skip
    <7f47e>   DW_AT_decl_file   : 1
    <7f47e>   DW_AT_decl_line   : 20
    <7f47f>   DW_AT_decl_column : 31
    <7f480>   DW_AT_type        : <0x7e7a6>
    <7f484>   DW_AT_location    : 0x26c72 (location list)
    <7f488>   DW_AT_GNU_locviews: 0x26c66
 <2><7f48c>: Abbrev Number: 9 (DW_TAG_variable)
    <7f48d>   DW_AT_name        : rot
    <7f491>   DW_AT_decl_file   : 1
    <7f491>   DW_AT_decl_line   : 20
    <7f491>   DW_AT_decl_column : 37
    <7f492>   DW_AT_type        : <0x7e7a6>
    <7f496>   DW_AT_location    : 0x26cd4 (location list)
    <7f49a>   DW_AT_GNU_locviews: 0x26cb2
 <2><7f49e>: Abbrev Number: 9 (DW_TAG_variable)
    <7f49f>   DW_AT_name        : bit
    <7f4a3>   DW_AT_decl_file   : 1
    <7f4a3>   DW_AT_decl_line   : 20
    <7f4a3>   DW_AT_decl_column : 42
    <7f4a4>   DW_AT_type        : <0x7e7a6>
    <7f4a8>   DW_AT_location    : 0x26d90 (location list)
    <7f4ac>   DW_AT_GNU_locviews: 0x26d76
 <2><7f4b0>: Abbrev Number: 15 (DW_TAG_variable)
    <7f4b1>   DW_AT_name        : (indirect string, offset: 0x17dd8): xmin
    <7f4b5>   DW_AT_decl_file   : 1
    <7f4b5>   DW_AT_decl_line   : 21
    <7f4b6>   DW_AT_decl_column : 6
    <7f4b7>   DW_AT_type        : <0x7e7a6>
    <7f4bb>   DW_AT_location    : 0x26dfe (location list)
    <7f4bf>   DW_AT_GNU_locviews: 0x26dec
 <2><7f4c3>: Abbrev Number: 15 (DW_TAG_variable)
    <7f4c4>   DW_AT_name        : (indirect string, offset: 0x17dd3): xmax
    <7f4c8>   DW_AT_decl_file   : 1
    <7f4c8>   DW_AT_decl_line   : 21
    <7f4c9>   DW_AT_decl_column : 30
    <7f4ca>   DW_AT_type        : <0x7e7a6>
    <7f4ce>   DW_AT_location    : 0x26e4b (location list)
    <7f4d2>   DW_AT_GNU_locviews: 0x26e41
 <2><7f4d6>: Abbrev Number: 15 (DW_TAG_variable)
    <7f4d7>   DW_AT_name        : (indirect string, offset: 0x17dc9): ymin
    <7f4db>   DW_AT_decl_file   : 1
    <7f4db>   DW_AT_decl_line   : 22
    <7f4dc>   DW_AT_decl_column : 6
    <7f4dd>   DW_AT_type        : <0x7e7a6>
    <7f4e1>   DW_AT_location    : 0x26eaa (location list)
    <7f4e5>   DW_AT_GNU_locviews: 0x26ea2
 <2><7f4e9>: Abbrev Number: 15 (DW_TAG_variable)
    <7f4ea>   DW_AT_name        : (indirect string, offset: 0x17dc4): ymax
    <7f4ee>   DW_AT_decl_file   : 1
    <7f4ee>   DW_AT_decl_line   : 22
    <7f4ef>   DW_AT_decl_column : 30
    <7f4f0>   DW_AT_type        : <0x7e7a6>
    <7f4f4>   DW_AT_location    : 0x26ed1 (location list)
    <7f4f8>   DW_AT_GNU_locviews: 0x26ec9
 <2><7f4fc>: Abbrev Number: 46 (DW_TAG_label)
    <7f4fd>   DW_AT_name        : (indirect string, offset: 0x17da7): done
    <7f501>   DW_AT_decl_file   : 1
    <7f502>   DW_AT_decl_line   : 199
    <7f503>   DW_AT_decl_column : 2
    <7f504>   DW_AT_low_pc      : 0x45ccbd
 <2><7f50c>: Abbrev Number: 34 (DW_TAG_inlined_subroutine)
    <7f50d>   DW_AT_abstract_origin: <0x7f653>
    <7f511>   DW_AT_entry_pc    : 0x45cbcd
    <7f519>   DW_AT_GNU_entry_view: 1
    <7f51b>   DW_AT_ranges      : 0x172b1
    <7f51f>   DW_AT_call_file   : 1
    <7f51f>   DW_AT_call_line   : 57
    <7f520>   DW_AT_call_column : 12
    <7f520>   DW_AT_sibling     : <0x7f532>
 <3><7f524>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <7f525>   DW_AT_abstract_origin: <0x7f664>
    <7f529>   DW_AT_location    : 0x26f33 (location list)
    <7f52d>   DW_AT_GNU_locviews: 0x26f1b
 <3><7f531>: Abbrev Number: 0
 <2><7f532>: Abbrev Number: 34 (DW_TAG_inlined_subroutine)
    <7f533>   DW_AT_abstract_origin: <0x7f653>
    <7f537>   DW_AT_entry_pc    : 0x45ced7
    <7f53f>   DW_AT_GNU_entry_view: 1
    <7f541>   DW_AT_ranges      : 0x172d0
    <7f545>   DW_AT_call_file   : 1
    <7f545>   DW_AT_call_line   : 81
    <7f546>   DW_AT_call_column : 12
    <7f546>   DW_AT_sibling     : <0x7f558>
 <3><7f54a>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <7f54b>   DW_AT_abstract_origin: <0x7f664>
    <7f54f>   DW_AT_location    : 0x26fcf (location list)
    <7f553>   DW_AT_GNU_locviews: 0x26fbd
 <3><7f557>: Abbrev Number: 0
 <2><7f558>: Abbrev Number: 26 (DW_TAG_call_site)
    <7f559>   DW_AT_call_return_pc: 0x45cb88
    <7f561>   DW_AT_call_origin : <0x7f0ee>
 <2><7f565>: Abbrev Number: 18 (DW_TAG_call_site)
    <7f566>   DW_AT_call_return_pc: 0x45cc85
    <7f56e>   DW_AT_sibling     : <0x7f58b>
 <3><7f572>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f573>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f575>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><7f578>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f579>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f57b>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f57e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f57f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f581>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><7f584>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f585>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7f587>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f58a>: Abbrev Number: 0
 <2><7f58b>: Abbrev Number: 47 (DW_TAG_call_site)
    <7f58c>   DW_AT_call_return_pc: 0x45ccd7
    <7f594>   DW_AT_call_tail_call: 1
    <7f594>   DW_AT_call_origin : <0x7f0d7>
    <7f598>   DW_AT_sibling     : <0x7f5a7>
 <3><7f59c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f59d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f59f>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><7f5a1>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5a2>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f5a4>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><7f5a6>: Abbrev Number: 0
 <2><7f5a7>: Abbrev Number: 18 (DW_TAG_call_site)
    <7f5a8>   DW_AT_call_return_pc: 0x45ce69
    <7f5b0>   DW_AT_sibling     : <0x7f5d2>
 <3><7f5b4>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5b5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f5b7>   DW_AT_call_value  : 4 byte block: 91 98 7f 6 	(DW_OP_fbreg: -104; DW_OP_deref)
 <3><7f5bc>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5bd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f5bf>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><7f5c2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5c3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f5c5>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f5c8>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5c9>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7f5cb>   DW_AT_call_value  : 5 byte block: 91 b0 7f 94 4 	(DW_OP_fbreg: -80; DW_OP_deref_size: 4)
 <3><7f5d1>: Abbrev Number: 0
 <2><7f5d2>: Abbrev Number: 18 (DW_TAG_call_site)
    <7f5d3>   DW_AT_call_return_pc: 0x45cf84
    <7f5db>   DW_AT_sibling     : <0x7f5f8>
 <3><7f5df>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5e0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f5e2>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><7f5e5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5e6>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f5e8>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><7f5eb>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5ec>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f5ee>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><7f5f1>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f5f2>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7f5f4>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f5f7>: Abbrev Number: 0
 <2><7f5f8>: Abbrev Number: 18 (DW_TAG_call_site)
    <7f5f9>   DW_AT_call_return_pc: 0x45d024
    <7f601>   DW_AT_sibling     : <0x7f617>
 <3><7f605>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f606>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f608>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><7f60a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f60b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f60d>   DW_AT_call_value  : 8 byte block: 7f 1 8 20 24 8 20 26 	(DW_OP_breg15 (r15): 1; DW_OP_const1u: 32; DW_OP_shl; DW_OP_const1u: 32; DW_OP_shra)
 <3><7f616>: Abbrev Number: 0
 <2><7f617>: Abbrev Number: 18 (DW_TAG_call_site)
    <7f618>   DW_AT_call_return_pc: 0x45d0d6
    <7f620>   DW_AT_sibling     : <0x7f642>
 <3><7f624>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f625>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7f627>   DW_AT_call_value  : 4 byte block: 91 98 7f 6 	(DW_OP_fbreg: -104; DW_OP_deref)
 <3><7f62c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f62d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f62f>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f632>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f633>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7f635>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><7f638>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f639>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7f63b>   DW_AT_call_value  : 5 byte block: 91 b4 7f 94 4 	(DW_OP_fbreg: -76; DW_OP_deref_size: 4)
 <3><7f641>: Abbrev Number: 0
 <2><7f642>: Abbrev Number: 48 (DW_TAG_call_site)
    <7f643>   DW_AT_call_return_pc: 0x45d196
 <3><7f64b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <7f64c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7f64e>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><7f651>: Abbrev Number: 0
 <2><7f652>: Abbrev Number: 0
 <1><7f653>: Abbrev Number: 49 (DW_TAG_subprogram)
    <7f654>   DW_AT_name        : (indirect string, offset: 0x17db7): reverse_mask
    <7f658>   DW_AT_decl_file   : 1
    <7f659>   DW_AT_decl_line   : 5
    <7f65a>   DW_AT_decl_column : 12
    <7f65b>   DW_AT_prototyped  : 1
    <7f65b>   DW_AT_type        : <0x7e7a6>
    <7f65f>   DW_AT_inline      : 1	(inlined)
    <7f660>   DW_AT_sibling     : <0x7f671>
 <2><7f664>: Abbrev Number: 50 (DW_TAG_formal_parameter)
    <7f665>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <7f669>   DW_AT_decl_file   : 1
    <7f66a>   DW_AT_decl_line   : 5
    <7f66b>   DW_AT_decl_column : 29
    <7f66c>   DW_AT_type        : <0x7e7a6>
 <2><7f670>: Abbrev Number: 0
 <1><7f671>: Abbrev Number: 51 (DW_TAG_subprogram)
    <7f672>   DW_AT_external    : 1
    <7f672>   DW_AT_declaration : 1
    <7f672>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <7f676>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><7f67a>: Abbrev Number: 0
  Compilation Unit @ offset 0x7f67b:
   Length:        0x1a76 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x29b8
   Pointer Size:  8
 <0><7f687>: Abbrev Number: 45 (DW_TAG_compile_unit)
    <7f688>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <7f68c>   DW_AT_language    : 29	(C11)
    <7f68d>   DW_AT_name        : (indirect line string, offset: 0x382): src/gfxlib2/gfx_opengl.c
    <7f691>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <7f695>   DW_AT_low_pc      : 0x45d3d0
    <7f69d>   DW_AT_high_pc     : 0xce7
    <7f6a5>   DW_AT_stmt_list   : 0x549b5
 <1><7f6a9>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6aa>   DW_AT_byte_size   : 8
    <7f6ab>   DW_AT_encoding    : 4	(float)
    <7f6ac>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><7f6b0>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6b1>   DW_AT_byte_size   : 1
    <7f6b2>   DW_AT_encoding    : 8	(unsigned char)
    <7f6b3>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><7f6b7>: Abbrev Number: 12 (DW_TAG_const_type)
    <7f6b8>   DW_AT_type        : <0x7f6b0>
 <1><7f6bc>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6bd>   DW_AT_byte_size   : 2
    <7f6be>   DW_AT_encoding    : 7	(unsigned)
    <7f6bf>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><7f6c3>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6c4>   DW_AT_byte_size   : 4
    <7f6c5>   DW_AT_encoding    : 7	(unsigned)
    <7f6c6>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><7f6ca>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6cb>   DW_AT_byte_size   : 8
    <7f6cc>   DW_AT_encoding    : 7	(unsigned)
    <7f6cd>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><7f6d1>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6d2>   DW_AT_byte_size   : 1
    <7f6d3>   DW_AT_encoding    : 6	(signed char)
    <7f6d4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><7f6d8>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6d9>   DW_AT_byte_size   : 2
    <7f6da>   DW_AT_encoding    : 5	(signed)
    <7f6db>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><7f6df>: Abbrev Number: 46 (DW_TAG_base_type)
    <7f6e0>   DW_AT_byte_size   : 4
    <7f6e1>   DW_AT_encoding    : 5	(signed)
    <7f6e2>   DW_AT_name        : int
 <1><7f6e6>: Abbrev Number: 47 (DW_TAG_volatile_type)
    <7f6e7>   DW_AT_type        : <0x7f6df>
 <1><7f6eb>: Abbrev Number: 12 (DW_TAG_const_type)
    <7f6ec>   DW_AT_type        : <0x7f6df>
 <1><7f6f0>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f6f1>   DW_AT_byte_size   : 8
    <7f6f2>   DW_AT_encoding    : 5	(signed)
    <7f6f3>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><7f6f7>: Abbrev Number: 48 (DW_TAG_pointer_type)
    <7f6f8>   DW_AT_byte_size   : 8
 <1><7f6f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f6fa>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <7f6fe>   DW_AT_decl_file   : 2
    <7f6ff>   DW_AT_decl_line   : 194
    <7f700>   DW_AT_decl_column : 27
    <7f701>   DW_AT_type        : <0x7f6f0>
 <1><7f705>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f706>   DW_AT_byte_size   : 8
    <7f706>   DW_AT_type        : <0x7f70a>
 <1><7f70a>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f70b>   DW_AT_byte_size   : 1
    <7f70c>   DW_AT_encoding    : 6	(signed char)
    <7f70d>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><7f711>: Abbrev Number: 12 (DW_TAG_const_type)
    <7f712>   DW_AT_type        : <0x7f70a>
 <1><7f716>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f717>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <7f71b>   DW_AT_decl_file   : 3
    <7f71c>   DW_AT_decl_line   : 209
    <7f71d>   DW_AT_decl_column : 23
    <7f71e>   DW_AT_type        : <0x7f6ca>
 <1><7f722>: Abbrev Number: 34 (DW_TAG_typedef)
    <7f723>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <7f727>   DW_AT_decl_file   : 3
    <7f728>   DW_AT_decl_line   : 321
    <7f72a>   DW_AT_decl_column : 24
    <7f72b>   DW_AT_type        : <0x7f6df>
 <1><7f72f>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f730>   DW_AT_byte_size   : 8
    <7f731>   DW_AT_encoding    : 5	(signed)
    <7f732>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><7f736>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f737>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <7f73b>   DW_AT_decl_file   : 4
    <7f73c>   DW_AT_decl_line   : 108
    <7f73d>   DW_AT_decl_column : 19
    <7f73e>   DW_AT_type        : <0x7f6f9>
 <1><7f742>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f743>   DW_AT_byte_size   : 8
    <7f744>   DW_AT_encoding    : 7	(unsigned)
    <7f745>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><7f749>: Abbrev Number: 14 (DW_TAG_array_type)
    <7f74a>   DW_AT_type        : <0x7f70a>
    <7f74e>   DW_AT_sibling     : <0x7f759>
 <2><7f752>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <7f753>   DW_AT_type        : <0x7f6ca>
    <7f757>   DW_AT_upper_bound : 7
 <2><7f758>: Abbrev Number: 0
 <1><7f759>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f75a>   DW_AT_byte_size   : 8
    <7f75a>   DW_AT_type        : <0x7f711>
 <1><7f75e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f75f>   DW_AT_byte_size   : 8
    <7f75f>   DW_AT_type        : <0x7f763>
 <1><7f763>: Abbrev Number: 49 (DW_TAG_subroutine_type)
    <7f764>   DW_AT_prototyped  : 1
 <1><7f764>: Abbrev Number: 9 (DW_TAG_base_type)
    <7f765>   DW_AT_byte_size   : 4
    <7f766>   DW_AT_encoding    : 4	(float)
    <7f767>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><7f76b>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f76c>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <7f770>   DW_AT_decl_file   : 5
    <7f771>   DW_AT_decl_line   : 7
    <7f772>   DW_AT_decl_column : 25
    <7f773>   DW_AT_type        : <0x7f777>
 <1><7f777>: Abbrev Number: 50 (DW_TAG_structure_type)
    <7f778>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <7f77c>   DW_AT_declaration : 1
 <1><7f77c>: Abbrev Number: 35 (DW_TAG_structure_type)
    <7f77d>   DW_AT_byte_size   : 8
    <7f77e>   DW_AT_decl_file   : 6
    <7f77e>   DW_AT_decl_line   : 4
    <7f77f>   DW_AT_decl_column : 3
    <7f77f>   DW_AT_sibling     : <0x7f79e>
 <2><7f783>: Abbrev Number: 3 (DW_TAG_member)
    <7f784>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <7f788>   DW_AT_decl_file   : 6
    <7f789>   DW_AT_decl_line   : 5
    <7f78a>   DW_AT_decl_column : 8
    <7f78b>   DW_AT_type        : <0x7f6df>
    <7f78f>   DW_AT_data_member_location: 0
 <2><7f790>: Abbrev Number: 3 (DW_TAG_member)
    <7f791>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <7f795>   DW_AT_decl_file   : 6
    <7f796>   DW_AT_decl_line   : 6
    <7f797>   DW_AT_decl_column : 8
    <7f798>   DW_AT_type        : <0x7f6df>
    <7f79c>   DW_AT_data_member_location: 4
 <2><7f79d>: Abbrev Number: 0
 <1><7f79e>: Abbrev Number: 35 (DW_TAG_structure_type)
    <7f79f>   DW_AT_byte_size   : 16
    <7f7a0>   DW_AT_decl_file   : 6
    <7f7a0>   DW_AT_decl_line   : 8
    <7f7a1>   DW_AT_decl_column : 3
    <7f7a1>   DW_AT_sibling     : <0x7f7d4>
 <2><7f7a5>: Abbrev Number: 10 (DW_TAG_member)
    <7f7a6>   DW_AT_name        : x
    <7f7a8>   DW_AT_decl_file   : 6
    <7f7a9>   DW_AT_decl_line   : 9
    <7f7aa>   DW_AT_decl_column : 8
    <7f7ab>   DW_AT_type        : <0x7f6df>
    <7f7af>   DW_AT_data_member_location: 0
 <2><7f7b0>: Abbrev Number: 10 (DW_TAG_member)
    <7f7b1>   DW_AT_name        : y
    <7f7b3>   DW_AT_decl_file   : 6
    <7f7b4>   DW_AT_decl_line   : 9
    <7f7b5>   DW_AT_decl_column : 11
    <7f7b6>   DW_AT_type        : <0x7f6df>
    <7f7ba>   DW_AT_data_member_location: 4
 <2><7f7bb>: Abbrev Number: 10 (DW_TAG_member)
    <7f7bc>   DW_AT_name        : dx
    <7f7bf>   DW_AT_decl_file   : 6
    <7f7c0>   DW_AT_decl_line   : 10
    <7f7c1>   DW_AT_decl_column : 8
    <7f7c2>   DW_AT_type        : <0x7f6df>
    <7f7c6>   DW_AT_data_member_location: 8
 <2><7f7c7>: Abbrev Number: 10 (DW_TAG_member)
    <7f7c8>   DW_AT_name        : dy
    <7f7cb>   DW_AT_decl_file   : 6
    <7f7cc>   DW_AT_decl_line   : 10
    <7f7cd>   DW_AT_decl_column : 12
    <7f7ce>   DW_AT_type        : <0x7f6df>
    <7f7d2>   DW_AT_data_member_location: 12
 <2><7f7d3>: Abbrev Number: 0
 <1><7f7d4>: Abbrev Number: 51 (DW_TAG_union_type)
    <7f7d5>   DW_AT_byte_size   : 16
    <7f7d6>   DW_AT_decl_file   : 6
    <7f7d7>   DW_AT_decl_line   : 3
    <7f7d8>   DW_AT_decl_column : 2
    <7f7d9>   DW_AT_sibling     : <0x7f804>
 <2><7f7dd>: Abbrev Number: 36 (DW_TAG_member)
    <7f7de>   DW_AT_type        : <0x7f77c>
 <2><7f7e2>: Abbrev Number: 36 (DW_TAG_member)
    <7f7e3>   DW_AT_type        : <0x7f79e>
 <2><7f7e7>: Abbrev Number: 52 (DW_TAG_member)
    <7f7e8>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <7f7ec>   DW_AT_decl_file   : 6
    <7f7ed>   DW_AT_decl_line   : 12
    <7f7ee>   DW_AT_decl_column : 7
    <7f7ef>   DW_AT_type        : <0x7f6df>
 <2><7f7f3>: Abbrev Number: 37 (DW_TAG_member)
    <7f7f4>   DW_AT_name        : z
    <7f7f6>   DW_AT_decl_file   : 6
    <7f7f6>   DW_AT_decl_line   : 13
    <7f7f7>   DW_AT_decl_column : 7
    <7f7f7>   DW_AT_type        : <0x7f6df>
 <2><7f7fb>: Abbrev Number: 37 (DW_TAG_member)
    <7f7fc>   DW_AT_name        : w
    <7f7fe>   DW_AT_decl_file   : 6
    <7f7fe>   DW_AT_decl_line   : 14
    <7f7ff>   DW_AT_decl_column : 7
    <7f7ff>   DW_AT_type        : <0x7f6df>
 <2><7f803>: Abbrev Number: 0
 <1><7f804>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7f805>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <7f809>   DW_AT_byte_size   : 20
    <7f80a>   DW_AT_decl_file   : 6
    <7f80b>   DW_AT_decl_line   : 1
    <7f80c>   DW_AT_decl_column : 8
    <7f80d>   DW_AT_sibling     : <0x7f825>
 <2><7f811>: Abbrev Number: 3 (DW_TAG_member)
    <7f812>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7f816>   DW_AT_decl_file   : 6
    <7f817>   DW_AT_decl_line   : 2
    <7f818>   DW_AT_decl_column : 6
    <7f819>   DW_AT_type        : <0x7f6df>
    <7f81d>   DW_AT_data_member_location: 0
 <2><7f81e>: Abbrev Number: 38 (DW_TAG_member)
    <7f81f>   DW_AT_type        : <0x7f7d4>
    <7f823>   DW_AT_data_member_location: 4
 <2><7f824>: Abbrev Number: 0
 <1><7f825>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f826>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <7f82a>   DW_AT_decl_file   : 6
    <7f82b>   DW_AT_decl_line   : 18
    <7f82c>   DW_AT_decl_column : 23
    <7f82d>   DW_AT_type        : <0x7f804>
 <1><7f831>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f832>   DW_AT_byte_size   : 8
    <7f832>   DW_AT_type        : <0x7f836>
 <1><7f836>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <7f837>   DW_AT_prototyped  : 1
    <7f837>   DW_AT_type        : <0x7f6df>
    <7f83b>   DW_AT_sibling     : <0x7f84a>
 <2><7f83f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f840>   DW_AT_type        : <0x7f6df>
 <2><7f844>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f845>   DW_AT_type        : <0x7f6df>
 <2><7f849>: Abbrev Number: 0
 <1><7f84a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f84b>   DW_AT_byte_size   : 8
    <7f84b>   DW_AT_type        : <0x7f6df>
 <1><7f84f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f850>   DW_AT_byte_size   : 8
    <7f850>   DW_AT_type        : <0x7f854>
 <1><7f854>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <7f855>   DW_AT_prototyped  : 1
    <7f855>   DW_AT_type        : <0x7f6df>
    <7f859>   DW_AT_sibling     : <0x7f877>
 <2><7f85d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f85e>   DW_AT_type        : <0x7f84a>
 <2><7f862>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f863>   DW_AT_type        : <0x7f84a>
 <2><7f867>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f868>   DW_AT_type        : <0x7f84a>
 <2><7f86c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f86d>   DW_AT_type        : <0x7f84a>
 <2><7f871>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f872>   DW_AT_type        : <0x7f84a>
 <2><7f876>: Abbrev Number: 0
 <1><7f877>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f878>   DW_AT_byte_size   : 8
    <7f878>   DW_AT_type        : <0x7f825>
 <1><7f87c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f87d>   DW_AT_byte_size   : 8
    <7f87d>   DW_AT_type        : <0x7f6b0>
 <1><7f881>: Abbrev Number: 14 (DW_TAG_array_type)
    <7f882>   DW_AT_type        : <0x7f6df>
    <7f886>   DW_AT_sibling     : <0x7f891>
 <2><7f88a>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <7f88b>   DW_AT_type        : <0x7f6ca>
    <7f88f>   DW_AT_upper_bound : 3
 <2><7f890>: Abbrev Number: 0
 <1><7f891>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f892>   DW_AT_byte_size   : 8
    <7f892>   DW_AT_type        : <0x7f87c>
 <1><7f896>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <7f897>   DW_AT_prototyped  : 1
    <7f897>   DW_AT_type        : <0x7f6f7>
    <7f89b>   DW_AT_sibling     : <0x7f8af>
 <2><7f89f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f8a0>   DW_AT_type        : <0x7f6f7>
 <2><7f8a4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f8a5>   DW_AT_type        : <0x7f6df>
 <2><7f8a9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f8aa>   DW_AT_type        : <0x7f716>
 <2><7f8ae>: Abbrev Number: 0
 <1><7f8af>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7f8b0>   DW_AT_byte_size   : 8
    <7f8b0>   DW_AT_type        : <0x7f896>
 <1><7f8b4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7f8b5>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <7f8b9>   DW_AT_byte_size   : 12
    <7f8ba>   DW_AT_decl_file   : 7
    <7f8bb>   DW_AT_decl_line   : 139
    <7f8bc>   DW_AT_decl_column : 16
    <7f8bd>   DW_AT_sibling     : <0x7f8e6>
 <2><7f8c1>: Abbrev Number: 10 (DW_TAG_member)
    <7f8c2>   DW_AT_name        : ch
    <7f8c5>   DW_AT_decl_file   : 7
    <7f8c6>   DW_AT_decl_line   : 140
    <7f8c7>   DW_AT_decl_column : 14
    <7f8c8>   DW_AT_type        : <0x7f722>
    <7f8cc>   DW_AT_data_member_location: 0
 <2><7f8cd>: Abbrev Number: 10 (DW_TAG_member)
    <7f8ce>   DW_AT_name        : fg
    <7f8d1>   DW_AT_decl_file   : 7
    <7f8d2>   DW_AT_decl_line   : 141
    <7f8d3>   DW_AT_decl_column : 14
    <7f8d4>   DW_AT_type        : <0x7f6c3>
    <7f8d8>   DW_AT_data_member_location: 4
 <2><7f8d9>: Abbrev Number: 10 (DW_TAG_member)
    <7f8da>   DW_AT_name        : bg
    <7f8dd>   DW_AT_decl_file   : 7
    <7f8de>   DW_AT_decl_line   : 141
    <7f8df>   DW_AT_decl_column : 18
    <7f8e0>   DW_AT_type        : <0x7f6c3>
    <7f8e4>   DW_AT_data_member_location: 8
 <2><7f8e5>: Abbrev Number: 0
 <1><7f8e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f8e7>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <7f8eb>   DW_AT_decl_file   : 7
    <7f8ec>   DW_AT_decl_line   : 142
    <7f8ed>   DW_AT_decl_column : 3
    <7f8ee>   DW_AT_type        : <0x7f8b4>
 <1><7f8f2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7f8f3>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7f8f7>   DW_AT_byte_size   : 208
    <7f8f8>   DW_AT_decl_file   : 7
    <7f8f9>   DW_AT_decl_line   : 144
    <7f8fa>   DW_AT_decl_column : 16
    <7f8fb>   DW_AT_sibling     : <0x7fab5>
 <2><7f8ff>: Abbrev Number: 10 (DW_TAG_member)
    <7f900>   DW_AT_name        : id
    <7f903>   DW_AT_decl_file   : 7
    <7f904>   DW_AT_decl_line   : 146
    <7f905>   DW_AT_decl_column : 6
    <7f906>   DW_AT_type        : <0x7f6df>
    <7f90a>   DW_AT_data_member_location: 0
 <2><7f90b>: Abbrev Number: 3 (DW_TAG_member)
    <7f90c>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <7f910>   DW_AT_decl_file   : 7
    <7f911>   DW_AT_decl_line   : 147
    <7f912>   DW_AT_decl_column : 9
    <7f913>   DW_AT_type        : <0x7f6df>
    <7f917>   DW_AT_data_member_location: 4
 <2><7f918>: Abbrev Number: 3 (DW_TAG_member)
    <7f919>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <7f91d>   DW_AT_decl_file   : 7
    <7f91e>   DW_AT_decl_line   : 148
    <7f91f>   DW_AT_decl_column : 21
    <7f920>   DW_AT_type        : <0x7f891>
    <7f924>   DW_AT_data_member_location: 8
 <2><7f925>: Abbrev Number: 3 (DW_TAG_member)
    <7f926>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <7f92a>   DW_AT_decl_file   : 7
    <7f92b>   DW_AT_decl_line   : 149
