 <2><9e1cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e1ce>   DW_AT_type        : <0x9e038>
 <2><9e1d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e1d3>   DW_AT_type        : <0x9e038>
 <2><9e1d7>: Abbrev Number: 0
 <1><9e1d8>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9e1d9>   DW_AT_external    : 1
    <9e1d9>   DW_AT_name        : (indirect string, offset: 0x1a785): fb_ConReadLine
    <9e1dd>   DW_AT_decl_file   : 7
    <9e1de>   DW_AT_decl_line   : 96
    <9e1df>   DW_AT_decl_column : 21
    <9e1e0>   DW_AT_prototyped  : 1
    <9e1e0>   DW_AT_type        : <0x9e182>
    <9e1e4>   DW_AT_declaration : 1
    <9e1e4>   DW_AT_sibling     : <0x9e1ee>
 <2><9e1e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e1e9>   DW_AT_type        : <0x9e038>
 <2><9e1ed>: Abbrev Number: 0
 <1><9e1ee>: Abbrev Number: 8 (DW_TAG_subprogram)
    <9e1ef>   DW_AT_external    : 1
    <9e1ef>   DW_AT_name        : (indirect string, offset: 0x1a7b8): fb_PrintFixString
    <9e1f3>   DW_AT_decl_file   : 8
    <9e1f3>   DW_AT_decl_line   : 116
    <9e1f4>   DW_AT_decl_column : 21
    <9e1f4>   DW_AT_prototyped  : 1
    <9e1f4>   DW_AT_declaration : 1
    <9e1f4>   DW_AT_sibling     : <0x9e208>
 <2><9e1f8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e1f9>   DW_AT_type        : <0x9e038>
 <2><9e1fd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e1fe>   DW_AT_type        : <0x9e0a3>
 <2><9e202>: Abbrev Number: 2 (DW_TAG_formal_parameter)

    <9e3df>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><9e3e3>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e3e4>   DW_AT_byte_size   : 4
    <9e3e5>   DW_AT_encoding    : 7	(unsigned)
    <9e3e6>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><9e3ea>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e3eb>   DW_AT_byte_size   : 8
    <9e3ec>   DW_AT_encoding    : 7	(unsigned)
    <9e3ed>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><9e3f1>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e3f2>   DW_AT_byte_size   : 1
    <9e3f3>   DW_AT_encoding    : 6	(signed char)
    <9e3f4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><9e3f8>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e3f9>   DW_AT_byte_size   : 2
    <9e3fa>   DW_AT_encoding    : 5	(signed)
    <9e3fb>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><9e3ff>: Abbrev Number: 16 (DW_TAG_base_type)
    <9e400>   DW_AT_byte_size   : 4
    <9e401>   DW_AT_encoding    : 5	(signed)
    <9e402>   DW_AT_name        : int
 <1><9e406>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e407>   DW_AT_byte_size   : 8
    <9e408>   DW_AT_encoding    : 5	(signed)
    <9e409>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9e40d>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e40e>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <9e412>   DW_AT_decl_file   : 2
    <9e413>   DW_AT_decl_line   : 194
    <9e414>   DW_AT_decl_column : 27
    <9e415>   DW_AT_type        : <0x9e406>
 <1><9e419>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e41a>   DW_AT_byte_size   : 1
    <9e41b>   DW_AT_encoding    : 6	(signed char)
    <9e41c>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><9e420>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e421>   DW_AT_byte_size   : 8
    <9e422>   DW_AT_encoding    : 5	(signed)
    <9e423>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><9e427>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e428>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <9e42c>   DW_AT_decl_file   : 3
    <9e42d>   DW_AT_decl_line   : 108
    <9e42e>   DW_AT_decl_column : 19
    <9e42f>   DW_AT_type        : <0x9e40d>
 <1><9e433>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e434>   DW_AT_byte_size   : 8
    <9e435>   DW_AT_encoding    : 7	(unsigned)
    <9e436>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9e43a>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e43b>   DW_AT_byte_size   : 8
    <9e43c>   DW_AT_encoding    : 4	(float)
    <9e43d>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9e441>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e442>   DW_AT_byte_size   : 4
    <9e443>   DW_AT_encoding    : 4	(float)
    <9e444>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9e448>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e449>   DW_AT_byte_size   : 8
    <9e449>   DW_AT_type        : <0x9e3d0>
 <1><9e44d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e44e>   DW_AT_byte_size   : 8
    <9e44e>   DW_AT_type        : <0x9e3d7>
 <1><9e452>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <9e453>   DW_AT_encoding    : 7	(void)
    <9e453>   DW_AT_byte_size   : 4
    <9e453>   DW_AT_type        : <0x9e3e3>
    <9e457>   DW_AT_decl_file   : 4
    <9e457>   DW_AT_decl_line   : 376
    <9e459>   DW_AT_decl_column : 6
    <9e459>   DW_AT_sibling     : <0x9e476>
 <2><9e45d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e45e>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <9e462>   DW_AT_const_value : 0
 <2><9e463>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e464>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <9e468>   DW_AT_const_value : 1
 <2><9e469>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e46a>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <9e46e>   DW_AT_const_value : 2
 <2><9e46f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e470>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <9e474>   DW_AT_const_value : 3
 <2><9e475>: Abbrev Number: 0
 <1><9e476>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <9e477>   DW_AT_encoding    : 7	(void)
    <9e477>   DW_AT_byte_size   : 4
    <9e477>   DW_AT_type        : <0x9e3e3>
    <9e47b>   DW_AT_decl_file   : 4
    <9e47b>   DW_AT_decl_line   : 384
    <9e47d>   DW_AT_decl_column : 6
    <9e47d>   DW_AT_sibling     : <0x9e4a0>
 <2><9e481>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e482>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <9e486>   DW_AT_const_value : 0
 <2><9e487>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e488>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <9e48c>   DW_AT_const_value : 1
 <2><9e48d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e48e>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <9e492>   DW_AT_const_value : 2
 <2><9e493>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e494>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <9e498>   DW_AT_const_value : 3
 <2><9e499>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9e49a>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <9e49e>   DW_AT_const_value : 4
 <2><9e49f>: Abbrev Number: 0
 <1><9e4a0>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9e4a1>   DW_AT_name        : (indirect string, offset: 0x1a869): LZW_ENTRY
    <9e4a5>   DW_AT_byte_size   : 6
    <9e4a6>   DW_AT_decl_file   : 5
    <9e4a7>   DW_AT_decl_line   : 44
    <9e4a8>   DW_AT_decl_column : 16
    <9e4a9>   DW_AT_sibling     : <0x9e4d2>
 <2><9e4ad>: Abbrev Number: 8 (DW_TAG_member)
    <9e4ae>   DW_AT_name        : (indirect string, offset: 0x1a881): code
    <9e4b2>   DW_AT_decl_file   : 5
    <9e4b2>   DW_AT_decl_line   : 46
    <9e4b3>   DW_AT_decl_column : 8
    <9e4b4>   DW_AT_type        : <0x9e3f8>
    <9e4b8>   DW_AT_data_member_location: 0
 <2><9e4b9>: Abbrev Number: 8 (DW_TAG_member)
    <9e4ba>   DW_AT_name        : (indirect string, offset: 0x1a82e): prefix
    <9e4be>   DW_AT_decl_file   : 5
    <9e4be>   DW_AT_decl_line   : 47
    <9e4bf>   DW_AT_decl_column : 17
    <9e4c0>   DW_AT_type        : <0x9e3dc>
    <9e4c4>   DW_AT_data_member_location: 2
 <2><9e4c5>: Abbrev Number: 8 (DW_TAG_member)
    <9e4c6>   DW_AT_name        : (indirect string, offset: 0x1bb97): value
    <9e4ca>   DW_AT_decl_file   : 5
    <9e4ca>   DW_AT_decl_line   : 48
    <9e4cb>   DW_AT_decl_column : 16
    <9e4cc>   DW_AT_type        : <0x9e3d0>
    <9e4d0>   DW_AT_data_member_location: 4
 <2><9e4d1>: Abbrev Number: 0
 <1><9e4d2>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e4d3>   DW_AT_name        : (indirect string, offset: 0x1a869): LZW_ENTRY
    <9e4d7>   DW_AT_decl_file   : 5
    <9e4d8>   DW_AT_decl_line   : 49
    <9e4d9>   DW_AT_decl_column : 3
    <9e4da>   DW_AT_type        : <0x9e4a0>
 <1><9e4de>: Abbrev Number: 10 (DW_TAG_array_type)
    <9e4df>   DW_AT_type        : <0x9e4d2>
    <9e4e3>   DW_AT_sibling     : <0x9e4ef>
 <2><9e4e7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e4e8>   DW_AT_type        : <0x9e3ea>
    <9e4ec>   DW_AT_upper_bound : 5020
 <2><9e4ee>: Abbrev Number: 0
 <1><9e4ef>: Abbrev Number: 18 (DW_TAG_variable)
    <9e4f0>   DW_AT_name        : (indirect string, offset: 0x1a85c): fb_lzw_entry
    <9e4f4>   DW_AT_decl_file   : 5
    <9e4f5>   DW_AT_decl_line   : 51
    <9e4f6>   DW_AT_decl_column : 18
    <9e4f7>   DW_AT_type        : <0x9e4de>
    <9e4fb>   DW_AT_external    : 1
    <9e4fb>   DW_AT_declaration : 1
 <1><9e4fb>: Abbrev Number: 19 (DW_TAG_variable)
    <9e4fc>   DW_AT_specification: <0x9e4ef>
    <9e500>   DW_AT_decl_file   : 1
    <9e501>   DW_AT_decl_line   : 8
    <9e502>   DW_AT_decl_column : 11
    <9e503>   DW_AT_location    : 9 byte block: 3 20 9d 4b 0 0 0 0 0 	(DW_OP_addr: 4b9d20)
 <1><9e50d>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9e50e>   DW_AT_external    : 1
    <9e50e>   DW_AT_name        : (indirect string, offset: 0x19d4f): fb_hDecode
    <9e512>   DW_AT_decl_file   : 1
    <9e513>   DW_AT_decl_line   : 24
    <9e514>   DW_AT_decl_column : 12
    <9e515>   DW_AT_prototyped  : 1
    <9e515>   DW_AT_type        : <0x9e3ff>
    <9e519>   DW_AT_low_pc      : 0x467f50
    <9e521>   DW_AT_high_pc     : 0x259
    <9e529>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9e52b>   DW_AT_call_all_calls: 1
    <9e52b>   DW_AT_sibling     : <0x9e6b3>
 <2><9e52f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9e530>   DW_AT_name        : (indirect string, offset: 0x1a873): in_buffer
    <9e534>   DW_AT_decl_file   : 1
    <9e534>   DW_AT_decl_line   : 26
    <9e535>   DW_AT_decl_column : 24
    <9e536>   DW_AT_type        : <0x9e44d>
    <9e53a>   DW_AT_location    : 0x2dfd9 (location list)
    <9e53e>   DW_AT_GNU_locviews: 0x2dfcd
 <2><9e542>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9e543>   DW_AT_name        : (indirect string, offset: 0x1a826): in_size
    <9e547>   DW_AT_decl_file   : 1
    <9e547>   DW_AT_decl_line   : 27
    <9e548>   DW_AT_decl_column : 11
    <9e549>   DW_AT_type        : <0x9e427>
    <9e54d>   DW_AT_location    : 0x2e011 (location list)
    <9e551>   DW_AT_GNU_locviews: 0x2e003
 <2><9e555>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9e556>   DW_AT_name        : (indirect string, offset: 0x1a851): out_buffer
    <9e55a>   DW_AT_decl_file   : 1
    <9e55a>   DW_AT_decl_line   : 28
    <9e55b>   DW_AT_decl_column : 18
    <9e55c>   DW_AT_type        : <0x9e448>
    <9e560>   DW_AT_location    : 0x2e048 (location list)
    <9e564>   DW_AT_GNU_locviews: 0x2e042
 <2><9e568>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9e569>   DW_AT_name        : (indirect string, offset: 0x1a83e): out_size
    <9e56d>   DW_AT_decl_file   : 1
    <9e56d>   DW_AT_decl_line   : 29
    <9e56e>   DW_AT_decl_column : 12
    <9e56f>   DW_AT_type        : <0x9e6b3>
    <9e573>   DW_AT_location    : 0x2e05f (location list)
    <9e577>   DW_AT_GNU_locviews: 0x2e059
 <2><9e57b>: Abbrev Number: 3 (DW_TAG_variable)
    <9e57c>   DW_AT_name        : (indirect string, offset: 0x1a835): new_code
    <9e580>   DW_AT_decl_file   : 1
    <9e580>   DW_AT_decl_line   : 32
    <9e581>   DW_AT_decl_column : 17
    <9e582>   DW_AT_type        : <0x9e3dc>
    <9e586>   DW_AT_location    : 0x2e083 (location list)
    <9e58a>   DW_AT_GNU_locviews: 0x2e075
 <2><9e58e>: Abbrev Number: 3 (DW_TAG_variable)
    <9e58f>   DW_AT_name        : (indirect string, offset: 0x1a87d): old_code
    <9e593>   DW_AT_decl_file   : 1
    <9e593>   DW_AT_decl_line   : 32
    <9e594>   DW_AT_decl_column : 27
    <9e595>   DW_AT_type        : <0x9e3dc>
    <9e599>   DW_AT_location    : 0x2e0ce (location list)
    <9e59d>   DW_AT_GNU_locviews: 0x2e0c0
 <2><9e5a1>: Abbrev Number: 3 (DW_TAG_variable)
    <9e5a2>   DW_AT_name        : (indirect string, offset: 0x1a847): next_code
    <9e5a6>   DW_AT_decl_file   : 1
    <9e5a6>   DW_AT_decl_line   : 32
    <9e5a7>   DW_AT_decl_column : 37
    <9e5a8>   DW_AT_type        : <0x9e3dc>
    <9e5ac>   DW_AT_location    : 0x2e10a (location list)
    <9e5b0>   DW_AT_GNU_locviews: 0x2e100
 <2><9e5b4>: Abbrev Number: 3 (DW_TAG_variable)
    <9e5b5>   DW_AT_name        : (indirect string, offset: 0x1c2e1): limit
    <9e5b9>   DW_AT_decl_file   : 1
    <9e5b9>   DW_AT_decl_line   : 33
    <9e5ba>   DW_AT_decl_column : 17
    <9e5bb>   DW_AT_type        : <0x9e448>
    <9e5bf>   DW_AT_location    : 0x2e132 (location list)
    <9e5c3>   DW_AT_GNU_locviews: 0x2e12e
 <2><9e5c7>: Abbrev Number: 21 (DW_TAG_variable)
    <9e5c8>   DW_AT_name        : (indirect string, offset: 0x1a80b): decode_stack
    <9e5cc>   DW_AT_decl_file   : 1
    <9e5cd>   DW_AT_decl_line   : 33
    <9e5ce>   DW_AT_decl_column : 24
    <9e5cf>   DW_AT_type        : <0x9e6b8>
    <9e5d3>   DW_AT_location    : 3 byte block: 91 b0 5f 	(DW_OP_fbreg: -4176)
 <2><9e5d7>: Abbrev Number: 3 (DW_TAG_variable)
    <9e5d8>   DW_AT_name        : (indirect string, offset: 0x1a81f): string
    <9e5dc>   DW_AT_decl_file   : 1
    <9e5dc>   DW_AT_decl_line   : 33
    <9e5dd>   DW_AT_decl_column : 49
    <9e5de>   DW_AT_type        : <0x9e448>
    <9e5e2>   DW_AT_location    : 0x2e146 (location list)
    <9e5e6>   DW_AT_GNU_locviews: 0x2e142
 <2><9e5ea>: Abbrev Number: 3 (DW_TAG_variable)
    <9e5eb>   DW_AT_name        : (indirect string, offset: 0x1a992): byte
    <9e5ef>   DW_AT_decl_file   : 1
    <9e5ef>   DW_AT_decl_line   : 33
    <9e5f0>   DW_AT_decl_column : 57
    <9e5f1>   DW_AT_type        : <0x9e3d0>
    <9e5f5>   DW_AT_location    : 0x2e161 (location list)
    <9e5f9>   DW_AT_GNU_locviews: 0x2e155
 <2><9e5fd>: Abbrev Number: 22 (DW_TAG_variable)
    <9e5fe>   DW_AT_name        : bit
    <9e602>   DW_AT_decl_file   : 1
    <9e603>   DW_AT_decl_line   : 33
    <9e604>   DW_AT_decl_column : 63
    <9e605>   DW_AT_type        : <0x9e3d0>
    <9e609>   DW_AT_location    : 0x2e19d (location list)
    <9e60d>   DW_AT_GNU_locviews: 0x2e191
 <2><9e611>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <9e612>   DW_AT_abstract_origin: <0x9e6c9>
    <9e616>   DW_AT_entry_pc    : 0x468031
    <9e61e>   DW_AT_GNU_entry_view: 1
    <9e61f>   DW_AT_low_pc      : 0x468031
    <9e627>   DW_AT_high_pc     : 0x39
    <9e62f>   DW_AT_call_file   : 1
    <9e630>   DW_AT_call_line   : 51
    <9e631>   DW_AT_call_column : 13
    <9e632>   DW_AT_sibling     : <0x9e65e>
 <3><9e636>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9e637>   DW_AT_abstract_origin: <0x9e6e4>
    <9e63b>   DW_AT_location    : 0x2e1c8 (location list)
    <9e63f>   DW_AT_GNU_locviews: 0x2e1c6
 <3><9e643>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9e644>   DW_AT_abstract_origin: <0x9e6da>
    <9e648>   DW_AT_location    : 0x2e1da (location list)
    <9e64c>   DW_AT_GNU_locviews: 0x2e1d6
 <3><9e650>: Abbrev Number: 12 (DW_TAG_variable)
    <9e651>   DW_AT_abstract_origin: <0x9e6ee>
    <9e655>   DW_AT_location    : 0x2e1ee (location list)
    <9e659>   DW_AT_GNU_locviews: 0x2e1ec
 <3><9e65d>: Abbrev Number: 0
 <2><9e65e>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <9e65f>   DW_AT_abstract_origin: <0x9e6c9>
    <9e663>   DW_AT_entry_pc    : 0x468144
    <9e66b>   DW_AT_GNU_entry_view: 0
    <9e66c>   DW_AT_ranges      : 0x17646
    <9e670>   DW_AT_call_file   : 1
    <9e671>   DW_AT_call_line   : 53
    <9e672>   DW_AT_call_column : 13
    <9e673>   DW_AT_sibling     : <0x9e6a5>
 <3><9e677>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9e678>   DW_AT_abstract_origin: <0x9e6e4>
    <9e67c>   DW_AT_location    : 0x2e1f9 (location list)
    <9e680>   DW_AT_GNU_locviews: 0x2e1f7
 <3><9e684>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9e685>   DW_AT_abstract_origin: <0x9e6da>
    <9e689>   DW_AT_location    : 0x2e20b (location list)
    <9e68d>   DW_AT_GNU_locviews: 0x2e207
 <3><9e691>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <9e692>   DW_AT_ranges      : 0x17646
 <4><9e696>: Abbrev Number: 12 (DW_TAG_variable)
    <9e697>   DW_AT_abstract_origin: <0x9e6ee>
    <9e69b>   DW_AT_location    : 0x2e21f (location list)
    <9e69f>   DW_AT_GNU_locviews: 0x2e21d
 <4><9e6a3>: Abbrev Number: 0
 <3><9e6a4>: Abbrev Number: 0
 <2><9e6a5>: Abbrev Number: 26 (DW_TAG_call_site)
    <9e6a6>   DW_AT_call_return_pc: 0x4681a9
    <9e6ae>   DW_AT_call_origin : <0x9e6fb>
 <2><9e6b2>: Abbrev Number: 0
 <1><9e6b3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9e6b4>   DW_AT_byte_size   : 8
    <9e6b4>   DW_AT_type        : <0x9e427>
 <1><9e6b8>: Abbrev Number: 10 (DW_TAG_array_type)
    <9e6b9>   DW_AT_type        : <0x9e3d0>
    <9e6bd>   DW_AT_sibling     : <0x9e6c9>
 <2><9e6c1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9e6c2>   DW_AT_type        : <0x9e3ea>
    <9e6c6>   DW_AT_upper_bound : 4094
 <2><9e6c8>: Abbrev Number: 0
 <1><9e6c9>: Abbrev Number: 27 (DW_TAG_subprogram)
    <9e6ca>   DW_AT_name        : (indirect string, offset: 0x1a818): decode_string
    <9e6ce>   DW_AT_decl_file   : 1
    <9e6cf>   DW_AT_decl_line   : 10
    <9e6d0>   DW_AT_decl_column : 23
    <9e6d1>   DW_AT_prototyped  : 1
    <9e6d1>   DW_AT_type        : <0x9e448>
    <9e6d5>   DW_AT_inline      : 1	(inlined)
    <9e6d6>   DW_AT_sibling     : <0x9e6fb>
 <2><9e6da>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9e6db>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <9e6df>   DW_AT_decl_file   : 1
    <9e6df>   DW_AT_decl_line   : 10
    <9e6df>   DW_AT_decl_column : 52
    <9e6e0>   DW_AT_type        : <0x9e448>
 <2><9e6e4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9e6e5>   DW_AT_name        : (indirect string, offset: 0x1a881): code
    <9e6e9>   DW_AT_decl_file   : 1
    <9e6e9>   DW_AT_decl_line   : 10
    <9e6e9>   DW_AT_decl_column : 64
    <9e6ea>   DW_AT_type        : <0x9e3ff>
 <2><9e6ee>: Abbrev Number: 28 (DW_TAG_variable)
    <9e6ef>   DW_AT_name        : (indirect string, offset: 0x1baf1): index
    <9e6f3>   DW_AT_decl_file   : 1
    <9e6f4>   DW_AT_decl_line   : 12
    <9e6f5>   DW_AT_decl_column : 6
    <9e6f6>   DW_AT_type        : <0x9e3ff>
 <2><9e6fa>: Abbrev Number: 0
 <1><9e6fb>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9e6fc>   DW_AT_external    : 1
    <9e6fc>   DW_AT_declaration : 1
    <9e6fc>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <9e700>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><9e704>: Abbrev Number: 0
  Compilation Unit @ offset 0x9e705:
   Length:        0x637 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x7f07
   Pointer Size:  8
 <0><9e711>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <9e712>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <9e716>   DW_AT_language    : 29	(C11)
    <9e717>   DW_AT_name        : (indirect line string, offset: 0x9ae): src/gfxlib2/gfx_multikey.c
    <9e71b>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <9e71f>   DW_AT_low_pc      : 0x4681b0
    <9e727>   DW_AT_high_pc     : 0x61
    <9e72f>   DW_AT_stmt_list   : 0x5cbc8
 <1><9e733>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e734>   DW_AT_byte_size   : 1
    <9e735>   DW_AT_encoding    : 8	(unsigned char)
    <9e736>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><9e73a>: Abbrev Number: 7 (DW_TAG_const_type)
    <9e73b>   DW_AT_type        : <0x9e733>
 <1><9e73f>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e740>   DW_AT_byte_size   : 2
    <9e741>   DW_AT_encoding    : 7	(unsigned)
    <9e742>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><9e746>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e747>   DW_AT_byte_size   : 4
    <9e748>   DW_AT_encoding    : 7	(unsigned)
    <9e749>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><9e74d>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e74e>   DW_AT_byte_size   : 8
    <9e74f>   DW_AT_encoding    : 7	(unsigned)
    <9e750>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><9e754>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e755>   DW_AT_byte_size   : 1
    <9e756>   DW_AT_encoding    : 6	(signed char)
    <9e757>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><9e75b>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e75c>   DW_AT_byte_size   : 2
    <9e75d>   DW_AT_encoding    : 5	(signed)
    <9e75e>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><9e762>: Abbrev Number: 19 (DW_TAG_base_type)
    <9e763>   DW_AT_byte_size   : 4
    <9e764>   DW_AT_encoding    : 5	(signed)
    <9e765>   DW_AT_name        : int
 <1><9e769>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <9e76a>   DW_AT_type        : <0x9e762>
 <1><9e76e>: Abbrev Number: 7 (DW_TAG_const_type)
    <9e76f>   DW_AT_type        : <0x9e762>
 <1><9e773>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e774>   DW_AT_byte_size   : 8
    <9e775>   DW_AT_encoding    : 5	(signed)
    <9e776>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9e77a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e77b>   DW_AT_byte_size   : 8
    <9e77b>   DW_AT_type        : <0x9e77f>
 <1><9e77f>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e780>   DW_AT_byte_size   : 1
    <9e781>   DW_AT_encoding    : 6	(signed char)
    <9e782>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><9e786>: Abbrev Number: 21 (DW_TAG_typedef)
    <9e787>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <9e78b>   DW_AT_decl_file   : 2
    <9e78c>   DW_AT_decl_line   : 321
    <9e78e>   DW_AT_decl_column : 24
    <9e78f>   DW_AT_type        : <0x9e762>
 <1><9e793>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e794>   DW_AT_byte_size   : 8
    <9e795>   DW_AT_encoding    : 5	(signed)
    <9e796>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><9e79a>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e79b>   DW_AT_byte_size   : 8
    <9e79c>   DW_AT_encoding    : 7	(unsigned)
    <9e79d>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9e7a1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e7a2>   DW_AT_byte_size   : 8
    <9e7a2>   DW_AT_type        : <0x9e7a6>
 <1><9e7a6>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <9e7a7>   DW_AT_prototyped  : 1
 <1><9e7a7>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e7a8>   DW_AT_byte_size   : 8
    <9e7a9>   DW_AT_encoding    : 4	(float)
    <9e7aa>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9e7ae>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e7af>   DW_AT_byte_size   : 4
    <9e7b0>   DW_AT_encoding    : 4	(float)
    <9e7b1>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9e7b5>: Abbrev Number: 8 (DW_TAG_typedef)
    <9e7b6>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <9e7ba>   DW_AT_decl_file   : 3
    <9e7bb>   DW_AT_decl_line   : 7
    <9e7bc>   DW_AT_decl_column : 25
    <9e7bd>   DW_AT_type        : <0x9e7c1>
 <1><9e7c1>: Abbrev Number: 23 (DW_TAG_structure_type)
    <9e7c2>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <9e7c6>   DW_AT_declaration : 1
 <1><9e7c6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9e7c7>   DW_AT_byte_size   : 8
    <9e7c8>   DW_AT_decl_file   : 4
    <9e7c8>   DW_AT_decl_line   : 4
    <9e7c9>   DW_AT_decl_column : 3
    <9e7c9>   DW_AT_sibling     : <0x9e7e8>
 <2><9e7cd>: Abbrev Number: 1 (DW_TAG_member)
    <9e7ce>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9e7d2>   DW_AT_decl_file   : 4
    <9e7d3>   DW_AT_decl_line   : 5
    <9e7d4>   DW_AT_decl_column : 8
    <9e7d5>   DW_AT_type        : <0x9e762>
    <9e7d9>   DW_AT_data_member_location: 0
 <2><9e7da>: Abbrev Number: 1 (DW_TAG_member)
    <9e7db>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9e7df>   DW_AT_decl_file   : 4
    <9e7e0>   DW_AT_decl_line   : 6
    <9e7e1>   DW_AT_decl_column : 8
    <9e7e2>   DW_AT_type        : <0x9e762>
    <9e7e6>   DW_AT_data_member_location: 4
 <2><9e7e7>: Abbrev Number: 0
 <1><9e7e8>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9e7e9>   DW_AT_byte_size   : 16
    <9e7ea>   DW_AT_decl_file   : 4
    <9e7ea>   DW_AT_decl_line   : 8
    <9e7eb>   DW_AT_decl_column : 3
    <9e7eb>   DW_AT_sibling     : <0x9e81e>
 <2><9e7ef>: Abbrev Number: 5 (DW_TAG_member)
    <9e7f0>   DW_AT_name        : x
    <9e7f2>   DW_AT_decl_file   : 4
    <9e7f3>   DW_AT_decl_line   : 9
    <9e7f4>   DW_AT_decl_column : 8
    <9e7f5>   DW_AT_type        : <0x9e762>
    <9e7f9>   DW_AT_data_member_location: 0
 <2><9e7fa>: Abbrev Number: 5 (DW_TAG_member)
    <9e7fb>   DW_AT_name        : y
    <9e7fd>   DW_AT_decl_file   : 4
    <9e7fe>   DW_AT_decl_line   : 9
    <9e7ff>   DW_AT_decl_column : 11
    <9e800>   DW_AT_type        : <0x9e762>
    <9e804>   DW_AT_data_member_location: 4
 <2><9e805>: Abbrev Number: 5 (DW_TAG_member)
    <9e806>   DW_AT_name        : dx
    <9e809>   DW_AT_decl_file   : 4
    <9e80a>   DW_AT_decl_line   : 10
    <9e80b>   DW_AT_decl_column : 8
    <9e80c>   DW_AT_type        : <0x9e762>
    <9e810>   DW_AT_data_member_location: 8
 <2><9e811>: Abbrev Number: 5 (DW_TAG_member)
    <9e812>   DW_AT_name        : dy
    <9e815>   DW_AT_decl_file   : 4
    <9e816>   DW_AT_decl_line   : 10
    <9e817>   DW_AT_decl_column : 12
    <9e818>   DW_AT_type        : <0x9e762>
    <9e81c>   DW_AT_data_member_location: 12
 <2><9e81d>: Abbrev Number: 0
 <1><9e81e>: Abbrev Number: 24 (DW_TAG_union_type)
    <9e81f>   DW_AT_byte_size   : 16
    <9e820>   DW_AT_decl_file   : 4
    <9e821>   DW_AT_decl_line   : 3
    <9e822>   DW_AT_decl_column : 2
    <9e823>   DW_AT_sibling     : <0x9e84e>
 <2><9e827>: Abbrev Number: 12 (DW_TAG_member)
    <9e828>   DW_AT_type        : <0x9e7c6>
 <2><9e82c>: Abbrev Number: 12 (DW_TAG_member)
    <9e82d>   DW_AT_type        : <0x9e7e8>
 <2><9e831>: Abbrev Number: 25 (DW_TAG_member)
    <9e832>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <9e836>   DW_AT_decl_file   : 4
    <9e837>   DW_AT_decl_line   : 12
    <9e838>   DW_AT_decl_column : 7
    <9e839>   DW_AT_type        : <0x9e762>
 <2><9e83d>: Abbrev Number: 13 (DW_TAG_member)
    <9e83e>   DW_AT_name        : z
    <9e840>   DW_AT_decl_file   : 4
    <9e840>   DW_AT_decl_line   : 13
    <9e841>   DW_AT_decl_column : 7
    <9e841>   DW_AT_type        : <0x9e762>
 <2><9e845>: Abbrev Number: 13 (DW_TAG_member)
    <9e846>   DW_AT_name        : w
    <9e848>   DW_AT_decl_file   : 4
    <9e848>   DW_AT_decl_line   : 14
    <9e849>   DW_AT_decl_column : 7
    <9e849>   DW_AT_type        : <0x9e762>
 <2><9e84d>: Abbrev Number: 0
 <1><9e84e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9e84f>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <9e853>   DW_AT_byte_size   : 20
    <9e854>   DW_AT_decl_file   : 4
    <9e855>   DW_AT_decl_line   : 1
    <9e856>   DW_AT_decl_column : 8
    <9e857>   DW_AT_sibling     : <0x9e86f>
 <2><9e85b>: Abbrev Number: 1 (DW_TAG_member)
    <9e85c>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9e860>   DW_AT_decl_file   : 4
    <9e861>   DW_AT_decl_line   : 2
    <9e862>   DW_AT_decl_column : 6
    <9e863>   DW_AT_type        : <0x9e762>
    <9e867>   DW_AT_data_member_location: 0
 <2><9e868>: Abbrev Number: 26 (DW_TAG_member)
    <9e869>   DW_AT_type        : <0x9e81e>
    <9e86d>   DW_AT_data_member_location: 4
 <2><9e86e>: Abbrev Number: 0
 <1><9e86f>: Abbrev Number: 8 (DW_TAG_typedef)
    <9e870>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <9e874>   DW_AT_decl_file   : 4
    <9e875>   DW_AT_decl_line   : 18
    <9e876>   DW_AT_decl_column : 23
    <9e877>   DW_AT_type        : <0x9e84e>
 <1><9e87b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e87c>   DW_AT_byte_size   : 8
    <9e87c>   DW_AT_type        : <0x9e880>
 <1><9e880>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <9e881>   DW_AT_prototyped  : 1
    <9e881>   DW_AT_type        : <0x9e762>
    <9e885>   DW_AT_sibling     : <0x9e894>
 <2><9e889>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e88a>   DW_AT_type        : <0x9e762>
 <2><9e88e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e88f>   DW_AT_type        : <0x9e762>
 <2><9e893>: Abbrev Number: 0
 <1><9e894>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e895>   DW_AT_byte_size   : 8
    <9e895>   DW_AT_type        : <0x9e762>
 <1><9e899>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e89a>   DW_AT_byte_size   : 8
    <9e89a>   DW_AT_type        : <0x9e89e>
 <1><9e89e>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <9e89f>   DW_AT_prototyped  : 1
    <9e89f>   DW_AT_type        : <0x9e762>
    <9e8a3>   DW_AT_sibling     : <0x9e8c1>
 <2><9e8a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e8a8>   DW_AT_type        : <0x9e894>
 <2><9e8ac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e8ad>   DW_AT_type        : <0x9e894>
 <2><9e8b1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e8b2>   DW_AT_type        : <0x9e894>
 <2><9e8b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e8b7>   DW_AT_type        : <0x9e894>
 <2><9e8bb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e8bc>   DW_AT_type        : <0x9e894>
 <2><9e8c0>: Abbrev Number: 0
 <1><9e8c1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e8c2>   DW_AT_byte_size   : 8
    <9e8c2>   DW_AT_type        : <0x9e86f>
 <1><9e8c6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e8c7>   DW_AT_byte_size   : 8
    <9e8c7>   DW_AT_type        : <0x9e733>
 <1><9e8cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9e8cc>   DW_AT_byte_size   : 8
    <9e8cc>   DW_AT_type        : <0x9e8c6>
 <1><9e8d0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9e8d1>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <9e8d5>   DW_AT_byte_size   : 12
    <9e8d6>   DW_AT_decl_file   : 5
    <9e8d7>   DW_AT_decl_line   : 139
    <9e8d8>   DW_AT_decl_column : 16
    <9e8d9>   DW_AT_sibling     : <0x9e902>
 <2><9e8dd>: Abbrev Number: 5 (DW_TAG_member)
    <9e8de>   DW_AT_name        : ch
    <9e8e1>   DW_AT_decl_file   : 5
    <9e8e2>   DW_AT_decl_line   : 140
    <9e8e3>   DW_AT_decl_column : 14
    <9e8e4>   DW_AT_type        : <0x9e786>
    <9e8e8>   DW_AT_data_member_location: 0
 <2><9e8e9>: Abbrev Number: 5 (DW_TAG_member)
    <9e8ea>   DW_AT_name        : fg
    <9e8ed>   DW_AT_decl_file   : 5
    <9e8ee>   DW_AT_decl_line   : 141
    <9e8ef>   DW_AT_decl_column : 14
    <9e8f0>   DW_AT_type        : <0x9e746>
    <9e8f4>   DW_AT_data_member_location: 4
 <2><9e8f5>: Abbrev Number: 5 (DW_TAG_member)
    <9e8f6>   DW_AT_name        : bg
    <9e8f9>   DW_AT_decl_file   : 5
    <9e8fa>   DW_AT_decl_line   : 141
    <9e8fb>   DW_AT_decl_column : 18
    <9e8fc>   DW_AT_type        : <0x9e746>
    <9e900>   DW_AT_data_member_location: 8
 <2><9e901>: Abbrev Number: 0
 <1><9e902>: Abbrev Number: 8 (DW_TAG_typedef)
    <9e903>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <9e907>   DW_AT_decl_file   : 5
    <9e908>   DW_AT_decl_line   : 142
    <9e909>   DW_AT_decl_column : 3
    <9e90a>   DW_AT_type        : <0x9e8d0>
 <1><9e90e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9e90f>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9e913>   DW_AT_byte_size   : 208
    <9e914>   DW_AT_decl_file   : 5
    <9e915>   DW_AT_decl_line   : 144
    <9e916>   DW_AT_decl_column : 16
    <9e917>   DW_AT_sibling     : <0x9ead1>
 <2><9e91b>: Abbrev Number: 5 (DW_TAG_member)
    <9e91c>   DW_AT_name        : id
    <9e91f>   DW_AT_decl_file   : 5
    <9e920>   DW_AT_decl_line   : 146
    <9e921>   DW_AT_decl_column : 6
    <9e922>   DW_AT_type        : <0x9e762>
    <9e926>   DW_AT_data_member_location: 0
 <2><9e927>: Abbrev Number: 1 (DW_TAG_member)
    <9e928>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <9e92c>   DW_AT_decl_file   : 5
    <9e92d>   DW_AT_decl_line   : 147
    <9e92e>   DW_AT_decl_column : 9
    <9e92f>   DW_AT_type        : <0x9e762>
    <9e933>   DW_AT_data_member_location: 4
 <2><9e934>: Abbrev Number: 1 (DW_TAG_member)
    <9e935>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <9e939>   DW_AT_decl_file   : 5
    <9e93a>   DW_AT_decl_line   : 148
    <9e93b>   DW_AT_decl_column : 21
    <9e93c>   DW_AT_type        : <0x9e8cb>
    <9e940>   DW_AT_data_member_location: 8
 <2><9e941>: Abbrev Number: 1 (DW_TAG_member)
    <9e942>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <9e946>   DW_AT_decl_file   : 5
    <9e947>   DW_AT_decl_line   : 149
    <9e948>   DW_AT_decl_column : 9
    <9e949>   DW_AT_type        : <0x9e762>
    <9e94d>   DW_AT_data_member_location: 16
 <2><9e94e>: Abbrev Number: 1 (DW_TAG_member)
    <9e94f>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <9e953>   DW_AT_decl_file   : 5
    <9e954>   DW_AT_decl_line   : 150
    <9e955>   DW_AT_decl_column : 9
    <9e956>   DW_AT_type        : <0x9e762>
    <9e95a>   DW_AT_data_member_location: 20
 <2><9e95b>: Abbrev Number: 1 (DW_TAG_member)
    <9e95c>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <9e960>   DW_AT_decl_file   : 5
    <9e961>   DW_AT_decl_line   : 151
    <9e962>   DW_AT_decl_column : 20
    <9e963>   DW_AT_type        : <0x9e8c6>
    <9e967>   DW_AT_data_member_location: 24
 <2><9e968>: Abbrev Number: 5 (DW_TAG_member)
    <9e969>   DW_AT_name        : w
    <9e96b>   DW_AT_decl_file   : 5
    <9e96c>   DW_AT_decl_line   : 152
    <9e96d>   DW_AT_decl_column : 9
    <9e96e>   DW_AT_type        : <0x9e762>
    <9e972>   DW_AT_data_member_location: 32
 <2><9e973>: Abbrev Number: 5 (DW_TAG_member)
    <9e974>   DW_AT_name        : h
    <9e976>   DW_AT_decl_file   : 5
    <9e977>   DW_AT_decl_line   : 152
    <9e978>   DW_AT_decl_column : 12
    <9e979>   DW_AT_type        : <0x9e762>
    <9e97d>   DW_AT_data_member_location: 36
 <2><9e97e>: Abbrev Number: 1 (DW_TAG_member)
    <9e97f>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <9e983>   DW_AT_decl_file   : 5
    <9e984>   DW_AT_decl_line   : 153
    <9e985>   DW_AT_decl_column : 9
    <9e986>   DW_AT_type        : <0x9e762>
    <9e98a>   DW_AT_data_member_location: 40
 <2><9e98b>: Abbrev Number: 5 (DW_TAG_member)
    <9e98c>   DW_AT_name        : bpp
    <9e990>   DW_AT_decl_file   : 5
    <9e991>   DW_AT_decl_line   : 154
    <9e992>   DW_AT_decl_column : 9
    <9e993>   DW_AT_type        : <0x9e762>
    <9e997>   DW_AT_data_member_location: 44
 <2><9e998>: Abbrev Number: 1 (DW_TAG_member)
    <9e999>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <9e99d>   DW_AT_decl_file   : 5
    <9e99e>   DW_AT_decl_line   : 155
    <9e99f>   DW_AT_decl_column : 9
    <9e9a0>   DW_AT_type        : <0x9e762>
    <9e9a4>   DW_AT_data_member_location: 48
 <2><9e9a5>: Abbrev Number: 1 (DW_TAG_member)
    <9e9a6>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <9e9aa>   DW_AT_decl_file   : 5
    <9e9ab>   DW_AT_decl_line   : 156
    <9e9ac>   DW_AT_decl_column : 19
    <9e9ad>   DW_AT_type        : <0x9ead1>
    <9e9b1>   DW_AT_data_member_location: 56
 <2><9e9b2>: Abbrev Number: 1 (DW_TAG_member)
    <9e9b3>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <9e9b7>   DW_AT_decl_file   : 5
    <9e9b8>   DW_AT_decl_line   : 157
    <9e9b9>   DW_AT_decl_column : 19
    <9e9ba>   DW_AT_type        : <0x9ead1>
    <9e9be>   DW_AT_data_member_location: 64
 <2><9e9bf>: Abbrev Number: 1 (DW_TAG_member)
    <9e9c0>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <9e9c4>   DW_AT_decl_file   : 5
    <9e9c5>   DW_AT_decl_line   : 158
    <9e9c6>   DW_AT_decl_column : 20
    <9e9c7>   DW_AT_type        : <0x9e8c6>
    <9e9cb>   DW_AT_data_member_location: 72
 <2><9e9cc>: Abbrev Number: 1 (DW_TAG_member)
    <9e9cd>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <9e9d1>   DW_AT_decl_file   : 5
    <9e9d2>   DW_AT_decl_line   : 159
    <9e9d3>   DW_AT_decl_column : 11
    <9e9d4>   DW_AT_type        : <0x9e77a>
    <9e9d8>   DW_AT_data_member_location: 80
 <2><9e9d9>: Abbrev Number: 1 (DW_TAG_member)
    <9e9da>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <9e9de>   DW_AT_decl_file   : 5
    <9e9df>   DW_AT_decl_line   : 160
    <9e9e0>   DW_AT_decl_column : 29
    <9e9e1>   DW_AT_type        : <0x9eb9f>
    <9e9e5>   DW_AT_data_member_location: 88
 <2><9e9e6>: Abbrev Number: 1 (DW_TAG_member)
    <9e9e7>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <9e9eb>   DW_AT_decl_file   : 5
    <9e9ec>   DW_AT_decl_line   : 161
    <9e9ed>   DW_AT_decl_column : 9
    <9e9ee>   DW_AT_type        : <0x9e762>
    <9e9f2>   DW_AT_data_member_location: 96
 <2><9e9f3>: Abbrev Number: 1 (DW_TAG_member)
    <9e9f4>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <9e9f8>   DW_AT_decl_file   : 5
    <9e9f9>   DW_AT_decl_line   : 162
    <9e9fa>   DW_AT_decl_column : 27
    <9e9fb>   DW_AT_type        : <0x9ebcf>
    <9e9ff>   DW_AT_data_member_location: 104
 <2><9ea00>: Abbrev Number: 1 (DW_TAG_member)
    <9ea01>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <9ea05>   DW_AT_decl_file   : 5
    <9ea06>   DW_AT_decl_line   : 163
    <9ea07>   DW_AT_decl_column : 9
    <9ea08>   DW_AT_type        : <0x9e762>
    <9ea0c>   DW_AT_data_member_location: 112
 <2><9ea0d>: Abbrev Number: 1 (DW_TAG_member)
    <9ea0e>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <9ea12>   DW_AT_decl_file   : 5
    <9ea13>   DW_AT_decl_line   : 164
    <9ea14>   DW_AT_decl_column : 9
    <9ea15>   DW_AT_type        : <0x9e762>
    <9ea19>   DW_AT_data_member_location: 116
 <2><9ea1a>: Abbrev Number: 1 (DW_TAG_member)
    <9ea1b>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <9ea1f>   DW_AT_decl_file   : 5
    <9ea20>   DW_AT_decl_line   : 164
    <9ea21>   DW_AT_decl_column : 19
    <9ea22>   DW_AT_type        : <0x9e762>
    <9ea26>   DW_AT_data_member_location: 120
 <2><9ea27>: Abbrev Number: 1 (DW_TAG_member)
    <9ea28>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <9ea2c>   DW_AT_decl_file   : 5
    <9ea2d>   DW_AT_decl_line   : 165
    <9ea2e>   DW_AT_decl_column : 24
    <9ea2f>   DW_AT_type        : <0x9ec06>
    <9ea33>   DW_AT_data_member_location: 128
 <2><9ea34>: Abbrev Number: 1 (DW_TAG_member)
    <9ea35>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <9ea39>   DW_AT_decl_file   : 5
    <9ea3a>   DW_AT_decl_line   : 166
    <9ea3b>   DW_AT_decl_column : 9
    <9ea3c>   DW_AT_type        : <0x9e762>
    <9ea40>   DW_AT_data_member_location: 136
 <2><9ea41>: Abbrev Number: 1 (DW_TAG_member)
    <9ea42>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <9ea46>   DW_AT_decl_file   : 5
    <9ea47>   DW_AT_decl_line   : 166
    <9ea48>   DW_AT_decl_column : 17
    <9ea49>   DW_AT_type        : <0x9e762>
    <9ea4d>   DW_AT_data_member_location: 140
 <2><9ea4e>: Abbrev Number: 1 (DW_TAG_member)
    <9ea4f>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <9ea53>   DW_AT_decl_file   : 5
    <9ea54>   DW_AT_decl_line   : 167
    <9ea55>   DW_AT_decl_column : 11
    <9ea56>   DW_AT_type        : <0x9e7ae>
    <9ea5a>   DW_AT_data_member_location: 144
 <2><9ea5b>: Abbrev Number: 5 (DW_TAG_member)
    <9ea5c>   DW_AT_name        : key
    <9ea60>   DW_AT_decl_file   : 5
    <9ea61>   DW_AT_decl_line   : 168
    <9ea62>   DW_AT_decl_column : 11
    <9ea63>   DW_AT_type        : <0x9e77a>
    <9ea67>   DW_AT_data_member_location: 152
 <2><9ea68>: Abbrev Number: 1 (DW_TAG_member)
    <9ea69>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <9ea6d>   DW_AT_decl_file   : 5
    <9ea6e>   DW_AT_decl_line   : 169
    <9ea6f>   DW_AT_decl_column : 6
    <9ea70>   DW_AT_type        : <0x9e762>
    <9ea74>   DW_AT_data_member_location: 160
 <2><9ea75>: Abbrev Number: 1 (DW_TAG_member)
    <9ea76>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <9ea7a>   DW_AT_decl_file   : 5
    <9ea7b>   DW_AT_decl_line   : 170
    <9ea7c>   DW_AT_decl_column : 18
    <9ea7d>   DW_AT_type        : <0x9ec0b>
    <9ea81>   DW_AT_data_member_location: 168
 <2><9ea82>: Abbrev Number: 1 (DW_TAG_member)
    <9ea83>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <9ea87>   DW_AT_decl_file   : 5
    <9ea88>   DW_AT_decl_line   : 171
    <9ea89>   DW_AT_decl_column : 12
    <9ea8a>   DW_AT_type        : <0x9e8c1>
    <9ea8e>   DW_AT_data_member_location: 176
 <2><9ea8f>: Abbrev Number: 1 (DW_TAG_member)
    <9ea90>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <9ea94>   DW_AT_decl_file   : 5
    <9ea95>   DW_AT_decl_line   : 172
    <9ea96>   DW_AT_decl_column : 9
    <9ea97>   DW_AT_type        : <0x9e762>
    <9ea9b>   DW_AT_data_member_location: 184
 <2><9ea9c>: Abbrev Number: 1 (DW_TAG_member)
    <9ea9d>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <9eaa1>   DW_AT_decl_file   : 5
    <9eaa2>   DW_AT_decl_line   : 172
    <9eaa3>   DW_AT_decl_column : 21
    <9eaa4>   DW_AT_type        : <0x9e762>
    <9eaa8>   DW_AT_data_member_location: 188
 <2><9eaa9>: Abbrev Number: 1 (DW_TAG_member)
    <9eaaa>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <9eaae>   DW_AT_decl_file   : 5
    <9eaaf>   DW_AT_decl_line   : 173
    <9eab0>   DW_AT_decl_column : 11
    <9eab1>   DW_AT_type        : <0x9ec15>
    <9eab5>   DW_AT_data_member_location: 192
 <2><9eab6>: Abbrev Number: 1 (DW_TAG_member)
    <9eab7>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <9eabb>   DW_AT_decl_file   : 5
    <9eabc>   DW_AT_decl_line   : 174
    <9eabd>   DW_AT_decl_column : 15
    <9eabe>   DW_AT_type        : <0x9e769>
    <9eac2>   DW_AT_data_member_location: 200
 <2><9eac3>: Abbrev Number: 1 (DW_TAG_member)
    <9eac4>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <9eac8>   DW_AT_decl_file   : 5
    <9eac9>   DW_AT_decl_line   : 175
    <9eaca>   DW_AT_decl_column : 6
    <9eacb>   DW_AT_type        : <0x9e762>
    <9eacf>   DW_AT_data_member_location: 204
 <2><9ead0>: Abbrev Number: 0
 <1><9ead1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ead2>   DW_AT_byte_size   : 8
    <9ead2>   DW_AT_type        : <0x9e746>
 <1><9ead6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9ead7>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <9eadb>   DW_AT_byte_size   : 112
    <9eadc>   DW_AT_decl_file   : 5
    <9eadd>   DW_AT_decl_line   : 178
    <9eade>   DW_AT_decl_column : 16
    <9eadf>   DW_AT_sibling     : <0x9eb9a>
 <2><9eae3>: Abbrev Number: 1 (DW_TAG_member)
    <9eae4>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <9eae8>   DW_AT_decl_file   : 5
    <9eae9>   DW_AT_decl_line   : 188
    <9eaea>   DW_AT_decl_column : 8
    <9eaeb>   DW_AT_type        : <0x9e77a>
    <9eaef>   DW_AT_data_member_location: 0
 <2><9eaf0>: Abbrev Number: 1 (DW_TAG_member)
    <9eaf1>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <9eaf5>   DW_AT_decl_file   : 5
    <9eaf6>   DW_AT_decl_line   : 208
    <9eaf7>   DW_AT_decl_column : 8
    <9eaf8>   DW_AT_type        : <0x9ec4e>
    <9eafc>   DW_AT_data_member_location: 8
 <2><9eafd>: Abbrev Number: 1 (DW_TAG_member)
    <9eafe>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <9eb02>   DW_AT_decl_file   : 5
    <9eb03>   DW_AT_decl_line   : 222
    <9eb04>   DW_AT_decl_column : 9
    <9eb05>   DW_AT_type        : <0x9e7a1>
    <9eb09>   DW_AT_data_member_location: 16
 <2><9eb0a>: Abbrev Number: 1 (DW_TAG_member)
    <9eb0b>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <9eb0f>   DW_AT_decl_file   : 5
    <9eb10>   DW_AT_decl_line   : 231
    <9eb11>   DW_AT_decl_column : 9
    <9eb12>   DW_AT_type        : <0x9e7a1>
    <9eb16>   DW_AT_data_member_location: 24
 <2><9eb17>: Abbrev Number: 1 (DW_TAG_member)
    <9eb18>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <9eb1c>   DW_AT_decl_file   : 5
    <9eb1d>   DW_AT_decl_line   : 239
    <9eb1e>   DW_AT_decl_column : 9
    <9eb1f>   DW_AT_type        : <0x9e7a1>
    <9eb23>   DW_AT_data_member_location: 32
 <2><9eb24>: Abbrev Number: 1 (DW_TAG_member)
    <9eb25>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <9eb29>   DW_AT_decl_file   : 5
    <9eb2a>   DW_AT_decl_line   : 248
    <9eb2b>   DW_AT_decl_column : 9
    <9eb2c>   DW_AT_type        : <0x9ec6d>
    <9eb30>   DW_AT_data_member_location: 40
 <2><9eb31>: Abbrev Number: 6 (DW_TAG_member)
    <9eb32>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <9eb36>   DW_AT_decl_file   : 5
    <9eb36>   DW_AT_decl_line   : 258
    <9eb38>   DW_AT_decl_column : 9
    <9eb39>   DW_AT_type        : <0x9e7a1>
    <9eb3d>   DW_AT_data_member_location: 48
 <2><9eb3e>: Abbrev Number: 6 (DW_TAG_member)
    <9eb3f>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <9eb43>   DW_AT_decl_file   : 5
    <9eb43>   DW_AT_decl_line   : 274
    <9eb45>   DW_AT_decl_column : 8
    <9eb46>   DW_AT_type        : <0x9e899>
    <9eb4a>   DW_AT_data_member_location: 56
 <2><9eb4b>: Abbrev Number: 6 (DW_TAG_member)
    <9eb4c>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <9eb50>   DW_AT_decl_file   : 5
    <9eb50>   DW_AT_decl_line   : 285
    <9eb52>   DW_AT_decl_column : 9
    <9eb53>   DW_AT_type        : <0x9ec6d>
    <9eb57>   DW_AT_data_member_location: 64
 <2><9eb58>: Abbrev Number: 6 (DW_TAG_member)
    <9eb59>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <9eb5d>   DW_AT_decl_file   : 5
    <9eb5d>   DW_AT_decl_line   : 293
    <9eb5f>   DW_AT_decl_column : 9
    <9eb60>   DW_AT_type        : <0x9ec7d>
    <9eb64>   DW_AT_data_member_location: 72
 <2><9eb65>: Abbrev Number: 6 (DW_TAG_member)
    <9eb66>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <9eb6a>   DW_AT_decl_file   : 5
    <9eb6a>   DW_AT_decl_line   : 301
    <9eb6c>   DW_AT_decl_column : 8
    <9eb6d>   DW_AT_type        : <0x9e87b>
    <9eb71>   DW_AT_data_member_location: 80
 <2><9eb72>: Abbrev Number: 6 (DW_TAG_member)
    <9eb73>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <9eb77>   DW_AT_decl_file   : 5
    <9eb77>   DW_AT_decl_line   : 314
    <9eb79>   DW_AT_decl_column : 9
    <9eb7a>   DW_AT_type        : <0x9ec96>
    <9eb7e>   DW_AT_data_member_location: 88
 <2><9eb7f>: Abbrev Number: 6 (DW_TAG_member)
    <9eb80>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <9eb84>   DW_AT_decl_file   : 5
    <9eb84>   DW_AT_decl_line   : 321
    <9eb86>   DW_AT_decl_column : 9
    <9eb87>   DW_AT_type        : <0x9e7a1>
    <9eb8b>   DW_AT_data_member_location: 96
 <2><9eb8c>: Abbrev Number: 6 (DW_TAG_member)
    <9eb8d>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <9eb91>   DW_AT_decl_file   : 5
    <9eb91>   DW_AT_decl_line   : 328
    <9eb93>   DW_AT_decl_column : 9
    <9eb94>   DW_AT_type        : <0x9e7a1>
    <9eb98>   DW_AT_data_member_location: 104
 <2><9eb99>: Abbrev Number: 0
 <1><9eb9a>: Abbrev Number: 7 (DW_TAG_const_type)
    <9eb9b>   DW_AT_type        : <0x9ead6>
 <1><9eb9f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9eba0>   DW_AT_byte_size   : 8
    <9eba0>   DW_AT_type        : <0x9eb9a>
 <1><9eba4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eba5>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <9eba9>   DW_AT_byte_size   : 16
    <9eba9>   DW_AT_decl_file   : 5
    <9eba9>   DW_AT_decl_line   : 331
    <9ebab>   DW_AT_decl_column : 16
    <9ebab>   DW_AT_sibling     : <0x9ebca>
 <2><9ebaf>: Abbrev Number: 6 (DW_TAG_member)
    <9ebb0>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <9ebb4>   DW_AT_decl_file   : 5
    <9ebb4>   DW_AT_decl_line   : 333
    <9ebb6>   DW_AT_decl_column : 12
    <9ebb7>   DW_AT_type        : <0x9e76e>
    <9ebbb>   DW_AT_data_member_location: 0
 <2><9ebbc>: Abbrev Number: 6 (DW_TAG_member)
    <9ebbd>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9ebc1>   DW_AT_decl_file   : 5
    <9ebc1>   DW_AT_decl_line   : 334
    <9ebc3>   DW_AT_decl_column : 23
    <9ebc4>   DW_AT_type        : <0x9ec9b>
    <9ebc8>   DW_AT_data_member_location: 8
 <2><9ebc9>: Abbrev Number: 0
 <1><9ebca>: Abbrev Number: 7 (DW_TAG_const_type)
    <9ebcb>   DW_AT_type        : <0x9eba4>
 <1><9ebcf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ebd0>   DW_AT_byte_size   : 8
    <9ebd0>   DW_AT_type        : <0x9ebca>
 <1><9ebd4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ebd5>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <9ebd9>   DW_AT_byte_size   : 16
    <9ebd9>   DW_AT_decl_file   : 5
    <9ebd9>   DW_AT_decl_line   : 337
    <9ebdb>   DW_AT_decl_column : 16
    <9ebdb>   DW_AT_sibling     : <0x9ec01>
 <2><9ebdf>: Abbrev Number: 15 (DW_TAG_member)
    <9ebe0>   DW_AT_name        : w
    <9ebe2>   DW_AT_decl_file   : 5
    <9ebe2>   DW_AT_decl_line   : 339
    <9ebe4>   DW_AT_decl_column : 15
    <9ebe4>   DW_AT_type        : <0x9e76e>
    <9ebe8>   DW_AT_data_member_location: 0
 <2><9ebe9>: Abbrev Number: 15 (DW_TAG_member)
    <9ebea>   DW_AT_name        : h
    <9ebec>   DW_AT_decl_file   : 5
    <9ebec>   DW_AT_decl_line   : 340
    <9ebee>   DW_AT_decl_column : 15
    <9ebee>   DW_AT_type        : <0x9e76e>
    <9ebf2>   DW_AT_data_member_location: 4
 <2><9ebf3>: Abbrev Number: 6 (DW_TAG_member)
    <9ebf4>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9ebf8>   DW_AT_decl_file   : 5
    <9ebf8>   DW_AT_decl_line   : 341
    <9ebfa>   DW_AT_decl_column : 23
    <9ebfb>   DW_AT_type        : <0x9ec9b>
    <9ebff>   DW_AT_data_member_location: 8
 <2><9ec00>: Abbrev Number: 0
 <1><9ec01>: Abbrev Number: 7 (DW_TAG_const_type)
    <9ec02>   DW_AT_type        : <0x9ebd4>
 <1><9ec06>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec07>   DW_AT_byte_size   : 8
    <9ec07>   DW_AT_type        : <0x9ec01>
 <1><9ec0b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec0c>   DW_AT_byte_size   : 8
    <9ec0c>   DW_AT_type        : <0x9ec10>
 <1><9ec10>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec11>   DW_AT_byte_size   : 8
    <9ec11>   DW_AT_type        : <0x9e902>
 <1><9ec15>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec16>   DW_AT_byte_size   : 8
    <9ec16>   DW_AT_type        : <0x9e7b5>
 <1><9ec1a>: Abbrev Number: 8 (DW_TAG_typedef)
    <9ec1b>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9ec1f>   DW_AT_decl_file   : 5
    <9ec20>   DW_AT_decl_line   : 176
    <9ec21>   DW_AT_decl_column : 3
    <9ec22>   DW_AT_type        : <0x9e90e>
 <1><9ec26>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <9ec27>   DW_AT_prototyped  : 1
    <9ec27>   DW_AT_type        : <0x9e762>
    <9ec2b>   DW_AT_sibling     : <0x9ec4e>
 <2><9ec2f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec30>   DW_AT_type        : <0x9e77a>
 <2><9ec34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec35>   DW_AT_type        : <0x9e762>
 <2><9ec39>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec3a>   DW_AT_type        : <0x9e762>
 <2><9ec3e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec3f>   DW_AT_type        : <0x9e762>
 <2><9ec43>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec44>   DW_AT_type        : <0x9e762>
 <2><9ec48>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec49>   DW_AT_type        : <0x9e762>
 <2><9ec4d>: Abbrev Number: 0
 <1><9ec4e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec4f>   DW_AT_byte_size   : 8
    <9ec4f>   DW_AT_type        : <0x9ec26>
 <1><9ec53>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <9ec54>   DW_AT_prototyped  : 1
    <9ec54>   DW_AT_sibling     : <0x9ec6d>
 <2><9ec58>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec59>   DW_AT_type        : <0x9e762>
 <2><9ec5d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec5e>   DW_AT_type        : <0x9e762>
 <2><9ec62>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec63>   DW_AT_type        : <0x9e762>
 <2><9ec67>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec68>   DW_AT_type        : <0x9e762>
 <2><9ec6c>: Abbrev Number: 0
 <1><9ec6d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec6e>   DW_AT_byte_size   : 8
    <9ec6e>   DW_AT_type        : <0x9ec53>
 <1><9ec72>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <9ec73>   DW_AT_prototyped  : 1
    <9ec73>   DW_AT_sibling     : <0x9ec7d>
 <2><9ec77>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec78>   DW_AT_type        : <0x9e77a>
 <2><9ec7c>: Abbrev Number: 0
 <1><9ec7d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec7e>   DW_AT_byte_size   : 8
    <9ec7e>   DW_AT_type        : <0x9ec72>
 <1><9ec82>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <9ec83>   DW_AT_prototyped  : 1
    <9ec83>   DW_AT_type        : <0x9e894>
    <9ec87>   DW_AT_sibling     : <0x9ec96>
 <2><9ec8b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec8c>   DW_AT_type        : <0x9e762>
 <2><9ec90>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ec91>   DW_AT_type        : <0x9e894>
 <2><9ec95>: Abbrev Number: 0
 <1><9ec96>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec97>   DW_AT_byte_size   : 8
    <9ec97>   DW_AT_type        : <0x9ec82>
 <1><9ec9b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ec9c>   DW_AT_byte_size   : 8
    <9ec9c>   DW_AT_type        : <0x9e73a>
 <1><9eca0>: Abbrev Number: 27 (DW_TAG_variable)
    <9eca1>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <9eca5>   DW_AT_decl_file   : 5
    <9eca6>   DW_AT_decl_line   : 364
    <9eca8>   DW_AT_decl_column : 15
    <9eca9>   DW_AT_type        : <0x9ecad>
    <9ecad>   DW_AT_external    : 1
    <9ecad>   DW_AT_declaration : 1
 <1><9ecad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ecae>   DW_AT_byte_size   : 8
    <9ecae>   DW_AT_type        : <0x9ec1a>
 <1><9ecb2>: Abbrev Number: 28 (DW_TAG_subprogram)
    <9ecb3>   DW_AT_external    : 1
    <9ecb3>   DW_AT_name        : (indirect string, offset: 0x12519): fb_GfxUnlock
    <9ecb7>   DW_AT_decl_file   : 5
    <9ecb8>   DW_AT_decl_line   : 470
    <9ecba>   DW_AT_decl_column : 20
    <9ecbb>   DW_AT_prototyped  : 1
    <9ecbb>   DW_AT_declaration : 1
    <9ecbb>   DW_AT_sibling     : <0x9ecca>
 <2><9ecbf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ecc0>   DW_AT_type        : <0x9e762>
 <2><9ecc4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ecc5>   DW_AT_type        : <0x9e762>
 <2><9ecc9>: Abbrev Number: 0
 <1><9ecca>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9eccb>   DW_AT_external    : 1
    <9eccb>   DW_AT_name        : (indirect string, offset: 0x122c4): fb_GfxLock
    <9eccf>   DW_AT_decl_file   : 5
    <9ecd0>   DW_AT_decl_line   : 469
    <9ecd2>   DW_AT_decl_column : 20
    <9ecd3>   DW_AT_prototyped  : 1
    <9ecd3>   DW_AT_declaration : 1
 <1><9ecd3>: Abbrev Number: 30 (DW_TAG_subprogram)
    <9ecd4>   DW_AT_external    : 1
    <9ecd4>   DW_AT_name        : (indirect string, offset: 0x1837f): fb_GfxMultikey
    <9ecd8>   DW_AT_decl_file   : 1
    <9ecd9>   DW_AT_decl_line   : 5
    <9ecda>   DW_AT_decl_column : 5
    <9ecdb>   DW_AT_prototyped  : 1
    <9ecdb>   DW_AT_type        : <0x9e762>
    <9ecdf>   DW_AT_low_pc      : 0x4681b0
    <9ece7>   DW_AT_high_pc     : 0x61
    <9ecef>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ecf1>   DW_AT_call_all_calls: 1
 <2><9ecf1>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <9ecf2>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9ecf6>   DW_AT_decl_file   : 1
    <9ecf7>   DW_AT_decl_line   : 5
    <9ecf8>   DW_AT_decl_column : 24
    <9ecf9>   DW_AT_type        : <0x9e762>
    <9ecfd>   DW_AT_location    : 0x2e23c (location list)
    <9ed01>   DW_AT_GNU_locviews: 0x2e234
 <2><9ed05>: Abbrev Number: 32 (DW_TAG_variable)
    <9ed06>   DW_AT_name        : (indirect string, offset: 0x1a7da): result
    <9ed0a>   DW_AT_decl_file   : 1
    <9ed0b>   DW_AT_decl_line   : 7
    <9ed0c>   DW_AT_decl_column : 6
    <9ed0d>   DW_AT_type        : <0x9e762>
    <9ed11>   DW_AT_location    : 0x2e25c (location list)
    <9ed15>   DW_AT_GNU_locviews: 0x2e254
 <2><9ed19>: Abbrev Number: 33 (DW_TAG_call_site)
    <9ed1a>   DW_AT_call_return_pc: 0x4681d5
    <9ed22>   DW_AT_call_origin : <0x9ecca>
 <2><9ed26>: Abbrev Number: 34 (DW_TAG_call_site)
    <9ed27>   DW_AT_call_return_pc: 0x4681fe
    <9ed2f>   DW_AT_call_origin : <0x9ecb2>
 <3><9ed33>: Abbrev Number: 17 (DW_TAG_call_site_parameter)
    <9ed34>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <9ed36>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><9ed38>: Abbrev Number: 17 (DW_TAG_call_site_parameter)
    <9ed39>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9ed3b>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><9ed3d>: Abbrev Number: 0
 <2><9ed3e>: Abbrev Number: 0
 <1><9ed3f>: Abbrev Number: 0
  Compilation Unit @ offset 0x9ed40:
   Length:        0x23da (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x80e7
   Pointer Size:  8
 <0><9ed4c>: Abbrev Number: 66 (DW_TAG_compile_unit)
    <9ed4d>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <9ed51>   DW_AT_language    : 29	(C11)
    <9ed52>   DW_AT_name        : (indirect line string, offset: 0x9c9): src/gfxlib2/gfx_print.c
    <9ed56>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <9ed5a>   DW_AT_low_pc      : 0x468220
    <9ed62>   DW_AT_high_pc     : 0x939
    <9ed6a>   DW_AT_stmt_list   : 0x5cc7d
 <1><9ed6e>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed6f>   DW_AT_byte_size   : 1
    <9ed70>   DW_AT_encoding    : 8	(unsigned char)
    <9ed71>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><9ed75>: Abbrev Number: 17 (DW_TAG_const_type)
    <9ed76>   DW_AT_type        : <0x9ed6e>
 <1><9ed7a>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed7b>   DW_AT_byte_size   : 2
    <9ed7c>   DW_AT_encoding    : 7	(unsigned)
    <9ed7d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><9ed81>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed82>   DW_AT_byte_size   : 4
    <9ed83>   DW_AT_encoding    : 7	(unsigned)
    <9ed84>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><9ed88>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed89>   DW_AT_byte_size   : 8
    <9ed8a>   DW_AT_encoding    : 7	(unsigned)
    <9ed8b>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><9ed8f>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed90>   DW_AT_byte_size   : 1
    <9ed91>   DW_AT_encoding    : 6	(signed char)
    <9ed92>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><9ed96>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ed97>   DW_AT_byte_size   : 2
    <9ed98>   DW_AT_encoding    : 5	(signed)
    <9ed99>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><9ed9d>: Abbrev Number: 67 (DW_TAG_base_type)
    <9ed9e>   DW_AT_byte_size   : 4
    <9ed9f>   DW_AT_encoding    : 5	(signed)
    <9eda0>   DW_AT_name        : int
 <1><9eda4>: Abbrev Number: 68 (DW_TAG_volatile_type)
    <9eda5>   DW_AT_type        : <0x9ed9d>
 <1><9eda9>: Abbrev Number: 17 (DW_TAG_const_type)
    <9edaa>   DW_AT_type        : <0x9ed9d>
 <1><9edae>: Abbrev Number: 15 (DW_TAG_base_type)
    <9edaf>   DW_AT_byte_size   : 8
    <9edb0>   DW_AT_encoding    : 5	(signed)
    <9edb1>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><9edb5>: Abbrev Number: 4 (DW_TAG_typedef)
    <9edb6>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <9edba>   DW_AT_decl_file   : 3
    <9edbb>   DW_AT_decl_line   : 153
    <9edbc>   DW_AT_decl_column : 27
    <9edbd>   DW_AT_type        : <0x9edae>
 <1><9edc1>: Abbrev Number: 69 (DW_TAG_pointer_type)
    <9edc2>   DW_AT_byte_size   : 8
 <1><9edc3>: Abbrev Number: 4 (DW_TAG_typedef)
    <9edc4>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <9edc8>   DW_AT_decl_file   : 3
    <9edc9>   DW_AT_decl_line   : 194
    <9edca>   DW_AT_decl_column : 27
    <9edcb>   DW_AT_type        : <0x9edae>
 <1><9edcf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9edd0>   DW_AT_byte_size   : 8
    <9edd0>   DW_AT_type        : <0x9edd4>
 <1><9edd4>: Abbrev Number: 15 (DW_TAG_base_type)
    <9edd5>   DW_AT_byte_size   : 1
    <9edd6>   DW_AT_encoding    : 6	(signed char)
    <9edd7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><9eddb>: Abbrev Number: 17 (DW_TAG_const_type)
    <9eddc>   DW_AT_type        : <0x9edd4>
 <1><9ede0>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ede1>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <9ede5>   DW_AT_decl_file   : 4
    <9ede6>   DW_AT_decl_line   : 209
    <9ede7>   DW_AT_decl_column : 23
    <9ede8>   DW_AT_type        : <0x9ed88>
 <1><9edec>: Abbrev Number: 49 (DW_TAG_typedef)
    <9eded>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <9edf1>   DW_AT_decl_file   : 4
    <9edf2>   DW_AT_decl_line   : 321
    <9edf4>   DW_AT_decl_column : 24
    <9edf5>   DW_AT_type        : <0x9ed9d>
 <1><9edf9>: Abbrev Number: 17 (DW_TAG_const_type)
    <9edfa>   DW_AT_type        : <0x9edec>
 <1><9edfe>: Abbrev Number: 15 (DW_TAG_base_type)
    <9edff>   DW_AT_byte_size   : 8
    <9ee00>   DW_AT_encoding    : 5	(signed)
    <9ee01>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><9ee05>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ee06>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <9ee0a>   DW_AT_decl_file   : 5
    <9ee0b>   DW_AT_decl_line   : 87
    <9ee0c>   DW_AT_decl_column : 19
    <9ee0d>   DW_AT_type        : <0x9edb5>
 <1><9ee11>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ee12>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <9ee16>   DW_AT_decl_file   : 5
    <9ee17>   DW_AT_decl_line   : 108
    <9ee18>   DW_AT_decl_column : 19
    <9ee19>   DW_AT_type        : <0x9edc3>
 <1><9ee1d>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ee1e>   DW_AT_byte_size   : 8
    <9ee1f>   DW_AT_encoding    : 7	(unsigned)
    <9ee20>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><9ee24>: Abbrev Number: 26 (DW_TAG_array_type)
    <9ee25>   DW_AT_type        : <0x9edd4>
    <9ee29>   DW_AT_sibling     : <0x9ee34>
 <2><9ee2d>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <9ee2e>   DW_AT_type        : <0x9ed88>
    <9ee32>   DW_AT_upper_bound : 3
 <2><9ee33>: Abbrev Number: 0
 <1><9ee34>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ee35>   DW_AT_byte_size   : 8
    <9ee35>   DW_AT_type        : <0x9ee39>
 <1><9ee39>: Abbrev Number: 70 (DW_TAG_const_type)
 <1><9ee3a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ee3b>   DW_AT_byte_size   : 8
    <9ee3b>   DW_AT_type        : <0x9eddb>
 <1><9ee3f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ee40>   DW_AT_byte_size   : 8
    <9ee40>   DW_AT_type        : <0x9edcf>
 <1><9ee44>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ee45>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <9ee49>   DW_AT_decl_file   : 6
    <9ee4a>   DW_AT_decl_line   : 22
    <9ee4b>   DW_AT_decl_column : 15
    <9ee4c>   DW_AT_type        : <0x9ee05>
 <1><9ee50>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ee51>   DW_AT_byte_size   : 8
    <9ee51>   DW_AT_type        : <0x9ee55>
 <1><9ee55>: Abbrev Number: 71 (DW_TAG_subroutine_type)
    <9ee56>   DW_AT_prototyped  : 1
 <1><9ee56>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ee57>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <9ee5b>   DW_AT_byte_size   : 24
    <9ee5c>   DW_AT_decl_file   : 7
    <9ee5d>   DW_AT_decl_line   : 82
    <9ee5e>   DW_AT_decl_column : 16
    <9ee5f>   DW_AT_sibling     : <0x9ee8b>
 <2><9ee63>: Abbrev Number: 2 (DW_TAG_member)
    <9ee64>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9ee68>   DW_AT_decl_file   : 7
    <9ee69>   DW_AT_decl_line   : 83
    <9ee6a>   DW_AT_decl_column : 21
    <9ee6b>   DW_AT_type        : <0x9edcf>
    <9ee6f>   DW_AT_data_member_location: 0
 <2><9ee70>: Abbrev Number: 10 (DW_TAG_member)
    <9ee71>   DW_AT_name        : len
    <9ee75>   DW_AT_decl_file   : 7
    <9ee76>   DW_AT_decl_line   : 84
    <9ee77>   DW_AT_decl_column : 21
    <9ee78>   DW_AT_type        : <0x9ee11>
    <9ee7c>   DW_AT_data_member_location: 8
 <2><9ee7d>: Abbrev Number: 2 (DW_TAG_member)
    <9ee7e>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <9ee82>   DW_AT_decl_file   : 7
    <9ee83>   DW_AT_decl_line   : 85
    <9ee84>   DW_AT_decl_column : 21
    <9ee85>   DW_AT_type        : <0x9ee11>
    <9ee89>   DW_AT_data_member_location: 16
 <2><9ee8a>: Abbrev Number: 0
 <1><9ee8b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ee8c>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <9ee90>   DW_AT_decl_file   : 7
    <9ee91>   DW_AT_decl_line   : 86
    <9ee92>   DW_AT_decl_column : 3
    <9ee93>   DW_AT_type        : <0x9ee56>
 <1><9ee97>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ee98>   DW_AT_byte_size   : 8
    <9ee99>   DW_AT_encoding    : 4	(float)
    <9ee9a>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><9ee9e>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ee9f>   DW_AT_byte_size   : 4
    <9eea0>   DW_AT_encoding    : 4	(float)
    <9eea1>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><9eea5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9eea6>   DW_AT_byte_size   : 8
    <9eea6>   DW_AT_type        : <0x9edec>
 <1><9eeaa>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eeab>   DW_AT_name        : (indirect string, offset: 0x1a980): _fb_Rect
    <9eeaf>   DW_AT_byte_size   : 16
    <9eeb0>   DW_AT_decl_file   : 2
    <9eeb1>   DW_AT_decl_line   : 1
    <9eeb2>   DW_AT_decl_column : 20
    <9eeb3>   DW_AT_sibling     : <0x9eeec>
 <2><9eeb7>: Abbrev Number: 2 (DW_TAG_member)
    <9eeb8>   DW_AT_name        : (indirect string, offset: 0x1a8ea): Left
    <9eebc>   DW_AT_decl_file   : 2
    <9eebd>   DW_AT_decl_line   : 2
    <9eebe>   DW_AT_decl_column : 13
    <9eebf>   DW_AT_type        : <0x9ed9d>
    <9eec3>   DW_AT_data_member_location: 0
 <2><9eec4>: Abbrev Number: 10 (DW_TAG_member)
    <9eec5>   DW_AT_name        : Top
    <9eec9>   DW_AT_decl_file   : 2
    <9eeca>   DW_AT_decl_line   : 2
    <9eecb>   DW_AT_decl_column : 19
    <9eecc>   DW_AT_type        : <0x9ed9d>
    <9eed0>   DW_AT_data_member_location: 4
 <2><9eed1>: Abbrev Number: 2 (DW_TAG_member)
    <9eed2>   DW_AT_name        : (indirect string, offset: 0x1a8d9): Right
    <9eed6>   DW_AT_decl_file   : 2
    <9eed7>   DW_AT_decl_line   : 2
    <9eed8>   DW_AT_decl_column : 24
    <9eed9>   DW_AT_type        : <0x9ed9d>
    <9eedd>   DW_AT_data_member_location: 8
 <2><9eede>: Abbrev Number: 2 (DW_TAG_member)
    <9eedf>   DW_AT_name        : (indirect string, offset: 0x1a9be): Bottom
    <9eee3>   DW_AT_decl_file   : 2
    <9eee4>   DW_AT_decl_line   : 2
    <9eee5>   DW_AT_decl_column : 31
    <9eee6>   DW_AT_type        : <0x9ed9d>
    <9eeea>   DW_AT_data_member_location: 12
 <2><9eeeb>: Abbrev Number: 0
 <1><9eeec>: Abbrev Number: 4 (DW_TAG_typedef)
    <9eeed>   DW_AT_name        : (indirect string, offset: 0x1a981): fb_Rect
    <9eef1>   DW_AT_decl_file   : 2
    <9eef2>   DW_AT_decl_line   : 3
    <9eef3>   DW_AT_decl_column : 7
    <9eef4>   DW_AT_type        : <0x9eeaa>
 <1><9eef8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9eef9>   DW_AT_name        : (indirect string, offset: 0x1a886): _fb_Coord
    <9eefd>   DW_AT_byte_size   : 8
    <9eefe>   DW_AT_decl_file   : 2
    <9eeff>   DW_AT_decl_line   : 5
    <9ef00>   DW_AT_decl_column : 20
    <9ef01>   DW_AT_sibling     : <0x9ef1c>
 <2><9ef05>: Abbrev Number: 10 (DW_TAG_member)
    <9ef06>   DW_AT_name        : X
    <9ef08>   DW_AT_decl_file   : 2
    <9ef09>   DW_AT_decl_line   : 6
    <9ef0a>   DW_AT_decl_column : 13
    <9ef0b>   DW_AT_type        : <0x9ed9d>
    <9ef0f>   DW_AT_data_member_location: 0
 <2><9ef10>: Abbrev Number: 10 (DW_TAG_member)
    <9ef11>   DW_AT_name        : Y
    <9ef13>   DW_AT_decl_file   : 2
    <9ef14>   DW_AT_decl_line   : 6
    <9ef15>   DW_AT_decl_column : 16
    <9ef16>   DW_AT_type        : <0x9ed9d>
    <9ef1a>   DW_AT_data_member_location: 4
 <2><9ef1b>: Abbrev Number: 0
 <1><9ef1c>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ef1d>   DW_AT_name        : (indirect string, offset: 0x1a887): fb_Coord
    <9ef21>   DW_AT_decl_file   : 2
    <9ef22>   DW_AT_decl_line   : 7
    <9ef23>   DW_AT_decl_column : 7
    <9ef24>   DW_AT_type        : <0x9eef8>
 <1><9ef28>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ef29>   DW_AT_name        : (indirect string, offset: 0x1a91e): fb_fnHookConScroll
    <9ef2d>   DW_AT_decl_file   : 2
    <9ef2e>   DW_AT_decl_line   : 11
    <9ef2f>   DW_AT_decl_column : 20
    <9ef30>   DW_AT_type        : <0x9ef34>
 <1><9ef34>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ef35>   DW_AT_byte_size   : 8
    <9ef35>   DW_AT_type        : <0x9ef39>
 <1><9ef39>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <9ef3a>   DW_AT_prototyped  : 1
    <9ef3a>   DW_AT_sibling     : <0x9ef5d>
 <2><9ef3e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef3f>   DW_AT_type        : <0x9ef5d>
 <2><9ef43>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef44>   DW_AT_type        : <0x9ed9d>
 <2><9ef48>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef49>   DW_AT_type        : <0x9ed9d>
 <2><9ef4d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef4e>   DW_AT_type        : <0x9ed9d>
 <2><9ef52>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef53>   DW_AT_type        : <0x9ed9d>
 <2><9ef57>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ef58>   DW_AT_type        : <0x9ed9d>
 <2><9ef5c>: Abbrev Number: 0
 <1><9ef5d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9ef5e>   DW_AT_byte_size   : 8
    <9ef5e>   DW_AT_type        : <0x9ef62>
 <1><9ef62>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9ef63>   DW_AT_name        : (indirect string, offset: 0x1aa50): _fb_ConHooks
    <9ef67>   DW_AT_byte_size   : 48
    <9ef68>   DW_AT_decl_file   : 2
    <9ef69>   DW_AT_decl_line   : 14
    <9ef6a>   DW_AT_decl_column : 20
    <9ef6b>   DW_AT_sibling     : <0x9efb1>
 <2><9ef6f>: Abbrev Number: 2 (DW_TAG_member)
    <9ef70>   DW_AT_name        : (indirect string, offset: 0x1aa2e): Opaque
    <9ef74>   DW_AT_decl_file   : 2
    <9ef75>   DW_AT_decl_line   : 15
    <9ef76>   DW_AT_decl_column : 35
    <9ef77>   DW_AT_type        : <0x9edc1>
    <9ef7b>   DW_AT_data_member_location: 0
 <2><9ef7c>: Abbrev Number: 2 (DW_TAG_member)
    <9ef7d>   DW_AT_name        : (indirect string, offset: 0x1a979): Scroll
    <9ef81>   DW_AT_decl_file   : 2
    <9ef82>   DW_AT_decl_line   : 17
    <9ef83>   DW_AT_decl_column : 35
    <9ef84>   DW_AT_type        : <0x9ef28>
    <9ef88>   DW_AT_data_member_location: 8
 <2><9ef89>: Abbrev Number: 2 (DW_TAG_member)
    <9ef8a>   DW_AT_name        : (indirect string, offset: 0x1bd13): Write
    <9ef8e>   DW_AT_decl_file   : 2
    <9ef8f>   DW_AT_decl_line   : 18
    <9ef90>   DW_AT_decl_column : 35
    <9ef91>   DW_AT_type        : <0x9efb1>
    <9ef95>   DW_AT_data_member_location: 16
 <2><9ef96>: Abbrev Number: 2 (DW_TAG_member)
    <9ef97>   DW_AT_name        : (indirect string, offset: 0x1aab9): Border
    <9ef9b>   DW_AT_decl_file   : 2
    <9ef9c>   DW_AT_decl_line   : 20
    <9ef9d>   DW_AT_decl_column : 35
    <9ef9e>   DW_AT_type        : <0x9eeec>
    <9efa2>   DW_AT_data_member_location: 24
 <2><9efa3>: Abbrev Number: 2 (DW_TAG_member)
    <9efa4>   DW_AT_name        : (indirect string, offset: 0x1a88a): Coord
    <9efa8>   DW_AT_decl_file   : 2
    <9efa9>   DW_AT_decl_line   : 21
    <9efaa>   DW_AT_decl_column : 35
    <9efab>   DW_AT_type        : <0x9ef1c>
    <9efaf>   DW_AT_data_member_location: 40
 <2><9efb0>: Abbrev Number: 0
 <1><9efb1>: Abbrev Number: 4 (DW_TAG_typedef)
    <9efb2>   DW_AT_name        : (indirect string, offset: 0x1aaf4): fb_fnHookConWrite
    <9efb6>   DW_AT_decl_file   : 2
    <9efb7>   DW_AT_decl_line   : 12
    <9efb8>   DW_AT_decl_column : 20
    <9efb9>   DW_AT_type        : <0x9efbd>
 <1><9efbd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9efbe>   DW_AT_byte_size   : 8
    <9efbe>   DW_AT_type        : <0x9efc2>
 <1><9efc2>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9efc3>   DW_AT_prototyped  : 1
    <9efc3>   DW_AT_type        : <0x9ed9d>
    <9efc7>   DW_AT_sibling     : <0x9efdb>
 <2><9efcb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9efcc>   DW_AT_type        : <0x9ef5d>
 <2><9efd0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9efd1>   DW_AT_type        : <0x9ee34>
 <2><9efd5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9efd6>   DW_AT_type        : <0x9ede0>
 <2><9efda>: Abbrev Number: 0
 <1><9efdb>: Abbrev Number: 4 (DW_TAG_typedef)
    <9efdc>   DW_AT_name        : (indirect string, offset: 0x1aa51): fb_ConHooks
    <9efe0>   DW_AT_decl_file   : 2
    <9efe1>   DW_AT_decl_line   : 22
    <9efe2>   DW_AT_decl_column : 7
    <9efe3>   DW_AT_type        : <0x9ef62>
 <1><9efe7>: Abbrev Number: 72 (DW_TAG_enumeration_type)
    <9efe8>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <9efec>   DW_AT_encoding    : 7	(unsigned)
    <9efed>   DW_AT_byte_size   : 4
    <9efee>   DW_AT_type        : <0x9ed81>
    <9eff2>   DW_AT_decl_file   : 8
    <9eff3>   DW_AT_decl_line   : 25
    <9eff4>   DW_AT_decl_column : 14
    <9eff5>   DW_AT_sibling     : <0x9f012>
 <2><9eff9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <9effa>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <9effe>   DW_AT_const_value : 0
 <2><9efff>: Abbrev Number: 27 (DW_TAG_enumerator)
    <9f000>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <9f004>   DW_AT_const_value : 1
 <2><9f005>: Abbrev Number: 27 (DW_TAG_enumerator)
    <9f006>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <9f00a>   DW_AT_const_value : 2
 <2><9f00b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <9f00c>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <9f010>   DW_AT_const_value : 3
 <2><9f011>: Abbrev Number: 0
 <1><9f012>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f013>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <9f017>   DW_AT_decl_file   : 8
    <9f018>   DW_AT_decl_line   : 30
    <9f019>   DW_AT_decl_column : 3
    <9f01a>   DW_AT_type        : <0x9efe7>
 <1><9f01e>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f01f>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <9f023>   DW_AT_decl_file   : 8
    <9f024>   DW_AT_decl_line   : 54
    <9f025>   DW_AT_decl_column : 15
    <9f026>   DW_AT_type        : <0x9f02a>
 <1><9f02a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f02b>   DW_AT_byte_size   : 8
    <9f02b>   DW_AT_type        : <0x9f02f>
 <1><9f02f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f030>   DW_AT_prototyped  : 1
    <9f030>   DW_AT_type        : <0x9ed9d>
    <9f034>   DW_AT_sibling     : <0x9f043>
 <2><9f038>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f039>   DW_AT_type        : <0x9f043>
 <2><9f03d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f03e>   DW_AT_type        : <0x9ed9d>
 <2><9f042>: Abbrev Number: 0
 <1><9f043>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f044>   DW_AT_byte_size   : 8
    <9f044>   DW_AT_type        : <0x9f048>
 <1><9f048>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f049>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <9f04d>   DW_AT_byte_size   : 80
    <9f04e>   DW_AT_decl_file   : 8
    <9f04f>   DW_AT_decl_line   : 97
    <9f050>   DW_AT_decl_column : 16
    <9f051>   DW_AT_sibling     : <0x9f10c>
 <2><9f055>: Abbrev Number: 2 (DW_TAG_member)
    <9f056>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <9f05a>   DW_AT_decl_file   : 8
    <9f05b>   DW_AT_decl_line   : 98
    <9f05c>   DW_AT_decl_column : 21
    <9f05d>   DW_AT_type        : <0x9ed9d>
    <9f061>   DW_AT_data_member_location: 0
 <2><9f062>: Abbrev Number: 10 (DW_TAG_member)
    <9f063>   DW_AT_name        : len
    <9f067>   DW_AT_decl_file   : 8
    <9f068>   DW_AT_decl_line   : 99
    <9f069>   DW_AT_decl_column : 21
    <9f06a>   DW_AT_type        : <0x9ed9d>
    <9f06e>   DW_AT_data_member_location: 4
 <2><9f06f>: Abbrev Number: 2 (DW_TAG_member)
    <9f070>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <9f074>   DW_AT_decl_file   : 8
    <9f075>   DW_AT_decl_line   : 100
    <9f076>   DW_AT_decl_column : 21
    <9f077>   DW_AT_type        : <0x9f012>
    <9f07b>   DW_AT_data_member_location: 8
 <2><9f07c>: Abbrev Number: 2 (DW_TAG_member)
    <9f07d>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <9f081>   DW_AT_decl_file   : 8
    <9f082>   DW_AT_decl_line   : 101
    <9f083>   DW_AT_decl_column : 21
    <9f084>   DW_AT_type        : <0x9ee44>
    <9f088>   DW_AT_data_member_location: 16
 <2><9f089>: Abbrev Number: 2 (DW_TAG_member)
    <9f08a>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <9f08e>   DW_AT_decl_file   : 8
    <9f08f>   DW_AT_decl_line   : 102
    <9f090>   DW_AT_decl_column : 21
    <9f091>   DW_AT_type        : <0x9ed9d>
    <9f095>   DW_AT_data_member_location: 24
 <2><9f096>: Abbrev Number: 2 (DW_TAG_member)
    <9f097>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <9f09b>   DW_AT_decl_file   : 8
    <9f09c>   DW_AT_decl_line   : 103
    <9f09d>   DW_AT_decl_column : 21
    <9f09e>   DW_AT_type        : <0x9ed9d>
    <9f0a2>   DW_AT_data_member_location: 28
 <2><9f0a3>: Abbrev Number: 2 (DW_TAG_member)
    <9f0a4>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <9f0a8>   DW_AT_decl_file   : 8
    <9f0a9>   DW_AT_decl_line   : 104
    <9f0aa>   DW_AT_decl_column : 21
    <9f0ab>   DW_AT_type        : <0x9ed9d>
    <9f0af>   DW_AT_data_member_location: 32
 <2><9f0b0>: Abbrev Number: 2 (DW_TAG_member)
    <9f0b1>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <9f0b5>   DW_AT_decl_file   : 8
    <9f0b6>   DW_AT_decl_line   : 105
    <9f0b7>   DW_AT_decl_column : 21
    <9f0b8>   DW_AT_type        : <0x9ed81>
    <9f0bc>   DW_AT_data_member_location: 36
 <2><9f0bd>: Abbrev Number: 2 (DW_TAG_member)
    <9f0be>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <9f0c2>   DW_AT_decl_file   : 8
    <9f0c3>   DW_AT_decl_line   : 106
    <9f0c4>   DW_AT_decl_column : 21
    <9f0c5>   DW_AT_type        : <0x9ed81>
    <9f0c9>   DW_AT_data_member_location: 40
 <2><9f0ca>: Abbrev Number: 2 (DW_TAG_member)
    <9f0cb>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <9f0cf>   DW_AT_decl_file   : 8
    <9f0d0>   DW_AT_decl_line   : 109
    <9f0d1>   DW_AT_decl_column : 21
    <9f0d2>   DW_AT_type        : <0x9ee24>
    <9f0d6>   DW_AT_data_member_location: 44
 <2><9f0d7>: Abbrev Number: 2 (DW_TAG_member)
    <9f0d8>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <9f0dc>   DW_AT_decl_file   : 8
    <9f0dd>   DW_AT_decl_line   : 110
    <9f0de>   DW_AT_decl_column : 21
    <9f0df>   DW_AT_type        : <0x9ede0>
    <9f0e3>   DW_AT_data_member_location: 48
 <2><9f0e4>: Abbrev Number: 2 (DW_TAG_member)
    <9f0e5>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <9f0e9>   DW_AT_decl_file   : 8
    <9f0ea>   DW_AT_decl_line   : 112
    <9f0eb>   DW_AT_decl_column : 22
    <9f0ec>   DW_AT_type        : <0x9f3a4>
    <9f0f0>   DW_AT_data_member_location: 56
 <2><9f0f1>: Abbrev Number: 2 (DW_TAG_member)
    <9f0f2>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <9f0f6>   DW_AT_decl_file   : 8
    <9f0f7>   DW_AT_decl_line   : 114
    <9f0f8>   DW_AT_decl_column : 14
    <9f0f9>   DW_AT_type        : <0x9edc1>
    <9f0fd>   DW_AT_data_member_location: 64
 <2><9f0fe>: Abbrev Number: 2 (DW_TAG_member)
    <9f0ff>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <9f103>   DW_AT_decl_file   : 8
    <9f104>   DW_AT_decl_line   : 116
    <9f105>   DW_AT_decl_column : 22
    <9f106>   DW_AT_type        : <0x9f043>
    <9f10a>   DW_AT_data_member_location: 72
 <2><9f10b>: Abbrev Number: 0
 <1><9f10c>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f10d>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <9f111>   DW_AT_decl_file   : 8
    <9f112>   DW_AT_decl_line   : 59
    <9f113>   DW_AT_decl_column : 15
    <9f114>   DW_AT_type        : <0x9f118>
 <1><9f118>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f119>   DW_AT_byte_size   : 8
    <9f119>   DW_AT_type        : <0x9f11d>
 <1><9f11d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f11e>   DW_AT_prototyped  : 1
    <9f11e>   DW_AT_type        : <0x9ed9d>
    <9f122>   DW_AT_sibling     : <0x9f12c>
 <2><9f126>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f127>   DW_AT_type        : <0x9f043>
 <2><9f12b>: Abbrev Number: 0
 <1><9f12c>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f12d>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <9f131>   DW_AT_decl_file   : 8
    <9f132>   DW_AT_decl_line   : 60
    <9f133>   DW_AT_decl_column : 15
    <9f134>   DW_AT_type        : <0x9f118>
 <1><9f138>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f139>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <9f13d>   DW_AT_decl_file   : 8
    <9f13e>   DW_AT_decl_line   : 61
    <9f13f>   DW_AT_decl_column : 15
    <9f140>   DW_AT_type        : <0x9f144>
 <1><9f144>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f145>   DW_AT_byte_size   : 8
    <9f145>   DW_AT_type        : <0x9f149>
 <1><9f149>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f14a>   DW_AT_prototyped  : 1
    <9f14a>   DW_AT_type        : <0x9ed9d>
    <9f14e>   DW_AT_sibling     : <0x9f162>
 <2><9f152>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f153>   DW_AT_type        : <0x9f043>
 <2><9f157>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f158>   DW_AT_type        : <0x9ee44>
 <2><9f15c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f15d>   DW_AT_type        : <0x9ed9d>
 <2><9f161>: Abbrev Number: 0
 <1><9f162>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f163>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <9f167>   DW_AT_decl_file   : 8
    <9f168>   DW_AT_decl_line   : 62
    <9f169>   DW_AT_decl_column : 15
    <9f16a>   DW_AT_type        : <0x9f16e>
 <1><9f16e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f16f>   DW_AT_byte_size   : 8
    <9f16f>   DW_AT_type        : <0x9f173>
 <1><9f173>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f174>   DW_AT_prototyped  : 1
    <9f174>   DW_AT_type        : <0x9ed9d>
    <9f178>   DW_AT_sibling     : <0x9f187>
 <2><9f17c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f17d>   DW_AT_type        : <0x9f043>
 <2><9f181>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f182>   DW_AT_type        : <0x9f187>
 <2><9f186>: Abbrev Number: 0
 <1><9f187>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f188>   DW_AT_byte_size   : 8
    <9f188>   DW_AT_type        : <0x9ee44>
 <1><9f18c>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f18d>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <9f191>   DW_AT_decl_file   : 8
    <9f192>   DW_AT_decl_line   : 63
    <9f193>   DW_AT_decl_column : 15
    <9f194>   DW_AT_type        : <0x9f198>
 <1><9f198>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f199>   DW_AT_byte_size   : 8
    <9f199>   DW_AT_type        : <0x9f19d>
 <1><9f19d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f19e>   DW_AT_prototyped  : 1
    <9f19e>   DW_AT_type        : <0x9ed9d>
    <9f1a2>   DW_AT_sibling     : <0x9f1b6>
 <2><9f1a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1a7>   DW_AT_type        : <0x9f043>
 <2><9f1ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1ac>   DW_AT_type        : <0x9edc1>
 <2><9f1b0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1b1>   DW_AT_type        : <0x9f1b6>
 <2><9f1b5>: Abbrev Number: 0
 <1><9f1b6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f1b7>   DW_AT_byte_size   : 8
    <9f1b7>   DW_AT_type        : <0x9ede0>
 <1><9f1bb>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f1bc>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <9f1c0>   DW_AT_decl_file   : 8
    <9f1c1>   DW_AT_decl_line   : 65
    <9f1c2>   DW_AT_decl_column : 15
    <9f1c3>   DW_AT_type        : <0x9f1c7>
 <1><9f1c7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f1c8>   DW_AT_byte_size   : 8
    <9f1c8>   DW_AT_type        : <0x9f1cc>
 <1><9f1cc>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f1cd>   DW_AT_prototyped  : 1
    <9f1cd>   DW_AT_type        : <0x9ed9d>
    <9f1d1>   DW_AT_sibling     : <0x9f1e5>
 <2><9f1d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1d6>   DW_AT_type        : <0x9f043>
 <2><9f1da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1db>   DW_AT_type        : <0x9eea5>
 <2><9f1df>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f1e0>   DW_AT_type        : <0x9f1b6>
 <2><9f1e4>: Abbrev Number: 0
 <1><9f1e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f1e6>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <9f1ea>   DW_AT_decl_file   : 8
    <9f1eb>   DW_AT_decl_line   : 67
    <9f1ec>   DW_AT_decl_column : 15
    <9f1ed>   DW_AT_type        : <0x9f1f1>
 <1><9f1f1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f1f2>   DW_AT_byte_size   : 8
    <9f1f2>   DW_AT_type        : <0x9f1f6>
 <1><9f1f6>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f1f7>   DW_AT_prototyped  : 1
    <9f1f7>   DW_AT_type        : <0x9ed9d>
    <9f1fb>   DW_AT_sibling     : <0x9f20f>
 <2><9f1ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f200>   DW_AT_type        : <0x9f043>
 <2><9f204>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f205>   DW_AT_type        : <0x9ee34>
 <2><9f209>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f20a>   DW_AT_type        : <0x9ede0>
 <2><9f20e>: Abbrev Number: 0
 <1><9f20f>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f210>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <9f214>   DW_AT_decl_file   : 8
    <9f215>   DW_AT_decl_line   : 69
    <9f216>   DW_AT_decl_column : 15
    <9f217>   DW_AT_type        : <0x9f21b>
 <1><9f21b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f21c>   DW_AT_byte_size   : 8
    <9f21c>   DW_AT_type        : <0x9f220>
 <1><9f220>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f221>   DW_AT_prototyped  : 1
    <9f221>   DW_AT_type        : <0x9ed9d>
    <9f225>   DW_AT_sibling     : <0x9f239>
 <2><9f229>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f22a>   DW_AT_type        : <0x9f043>
 <2><9f22e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f22f>   DW_AT_type        : <0x9f239>
 <2><9f233>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f234>   DW_AT_type        : <0x9ede0>
 <2><9f238>: Abbrev Number: 0
 <1><9f239>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f23a>   DW_AT_byte_size   : 8
    <9f23a>   DW_AT_type        : <0x9edf9>
 <1><9f23e>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f23f>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <9f243>   DW_AT_decl_file   : 8
    <9f244>   DW_AT_decl_line   : 71
    <9f245>   DW_AT_decl_column : 15
    <9f246>   DW_AT_type        : <0x9f24a>
 <1><9f24a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f24b>   DW_AT_byte_size   : 8
    <9f24b>   DW_AT_type        : <0x9f24f>
 <1><9f24f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f250>   DW_AT_prototyped  : 1
    <9f250>   DW_AT_type        : <0x9ed9d>
    <9f254>   DW_AT_sibling     : <0x9f268>
 <2><9f258>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f259>   DW_AT_type        : <0x9f043>
 <2><9f25d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f25e>   DW_AT_type        : <0x9ee44>
 <2><9f262>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f263>   DW_AT_type        : <0x9ee44>
 <2><9f267>: Abbrev Number: 0
 <1><9f268>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f269>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <9f26d>   DW_AT_decl_file   : 8
    <9f26e>   DW_AT_decl_line   : 73
    <9f26f>   DW_AT_decl_column : 15
    <9f270>   DW_AT_type        : <0x9f24a>
 <1><9f274>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f275>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <9f279>   DW_AT_decl_file   : 8
    <9f27a>   DW_AT_decl_line   : 75
    <9f27b>   DW_AT_decl_column : 15
    <9f27c>   DW_AT_type        : <0x9f280>
 <1><9f280>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f281>   DW_AT_byte_size   : 8
    <9f281>   DW_AT_type        : <0x9f285>
 <1><9f285>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f286>   DW_AT_prototyped  : 1
    <9f286>   DW_AT_type        : <0x9ed9d>
    <9f28a>   DW_AT_sibling     : <0x9f299>
 <2><9f28e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f28f>   DW_AT_type        : <0x9f043>
 <2><9f293>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f294>   DW_AT_type        : <0x9f299>
 <2><9f298>: Abbrev Number: 0
 <1><9f299>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f29a>   DW_AT_byte_size   : 8
    <9f29a>   DW_AT_type        : <0x9ee8b>
 <1><9f29e>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f29f>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <9f2a3>   DW_AT_decl_file   : 8
    <9f2a4>   DW_AT_decl_line   : 76
    <9f2a5>   DW_AT_decl_column : 15
    <9f2a6>   DW_AT_type        : <0x9f2aa>
 <1><9f2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f2ab>   DW_AT_byte_size   : 8
    <9f2ab>   DW_AT_type        : <0x9f2af>
 <1><9f2af>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9f2b0>   DW_AT_prototyped  : 1
    <9f2b0>   DW_AT_type        : <0x9ed9d>
    <9f2b4>   DW_AT_sibling     : <0x9f2c8>
 <2><9f2b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f2b9>   DW_AT_type        : <0x9f043>
 <2><9f2bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f2be>   DW_AT_type        : <0x9eea5>
 <2><9f2c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9f2c3>   DW_AT_type        : <0x9ee11>
 <2><9f2c7>: Abbrev Number: 0
 <1><9f2c8>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f2c9>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <9f2cd>   DW_AT_decl_file   : 8
    <9f2ce>   DW_AT_decl_line   : 77
    <9f2cf>   DW_AT_decl_column : 15
    <9f2d0>   DW_AT_type        : <0x9f118>
 <1><9f2d4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <9f2d5>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <9f2d9>   DW_AT_byte_size   : 112
    <9f2da>   DW_AT_decl_file   : 8
    <9f2db>   DW_AT_decl_line   : 80
    <9f2dc>   DW_AT_decl_column : 16
    <9f2dd>   DW_AT_sibling     : <0x9f398>
 <2><9f2e1>: Abbrev Number: 2 (DW_TAG_member)
    <9f2e2>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <9f2e6>   DW_AT_decl_file   : 8
    <9f2e7>   DW_AT_decl_line   : 81
    <9f2e8>   DW_AT_decl_column : 25
    <9f2e9>   DW_AT_type        : <0x9f10c>
    <9f2ed>   DW_AT_data_member_location: 0
 <2><9f2ee>: Abbrev Number: 2 (DW_TAG_member)
    <9f2ef>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <9f2f3>   DW_AT_decl_file   : 8
    <9f2f4>   DW_AT_decl_line   : 82
    <9f2f5>   DW_AT_decl_column : 25
    <9f2f6>   DW_AT_type        : <0x9f12c>
    <9f2fa>   DW_AT_data_member_location: 8
 <2><9f2fb>: Abbrev Number: 2 (DW_TAG_member)
    <9f2fc>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <9f300>   DW_AT_decl_file   : 8
    <9f301>   DW_AT_decl_line   : 83
    <9f302>   DW_AT_decl_column : 25
    <9f303>   DW_AT_type        : <0x9f138>
    <9f307>   DW_AT_data_member_location: 16
 <2><9f308>: Abbrev Number: 2 (DW_TAG_member)
    <9f309>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <9f30d>   DW_AT_decl_file   : 8
    <9f30e>   DW_AT_decl_line   : 84
    <9f30f>   DW_AT_decl_column : 25
    <9f310>   DW_AT_type        : <0x9f162>
    <9f314>   DW_AT_data_member_location: 24
 <2><9f315>: Abbrev Number: 2 (DW_TAG_member)
    <9f316>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <9f31a>   DW_AT_decl_file   : 8
    <9f31b>   DW_AT_decl_line   : 85
    <9f31c>   DW_AT_decl_column : 25
    <9f31d>   DW_AT_type        : <0x9f18c>
    <9f321>   DW_AT_data_member_location: 32
 <2><9f322>: Abbrev Number: 2 (DW_TAG_member)
    <9f323>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <9f327>   DW_AT_decl_file   : 8
    <9f328>   DW_AT_decl_line   : 86
    <9f329>   DW_AT_decl_column : 25
    <9f32a>   DW_AT_type        : <0x9f1bb>
    <9f32e>   DW_AT_data_member_location: 40
 <2><9f32f>: Abbrev Number: 2 (DW_TAG_member)
    <9f330>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <9f334>   DW_AT_decl_file   : 8
    <9f335>   DW_AT_decl_line   : 87
    <9f336>   DW_AT_decl_column : 25
    <9f337>   DW_AT_type        : <0x9f1e5>
    <9f33b>   DW_AT_data_member_location: 48
 <2><9f33c>: Abbrev Number: 2 (DW_TAG_member)
    <9f33d>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <9f341>   DW_AT_decl_file   : 8
    <9f342>   DW_AT_decl_line   : 88
    <9f343>   DW_AT_decl_column : 25
    <9f344>   DW_AT_type        : <0x9f20f>
    <9f348>   DW_AT_data_member_location: 56
 <2><9f349>: Abbrev Number: 2 (DW_TAG_member)
    <9f34a>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <9f34e>   DW_AT_decl_file   : 8
    <9f34f>   DW_AT_decl_line   : 89
    <9f350>   DW_AT_decl_column : 25
    <9f351>   DW_AT_type        : <0x9f23e>
    <9f355>   DW_AT_data_member_location: 64
 <2><9f356>: Abbrev Number: 2 (DW_TAG_member)
    <9f357>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <9f35b>   DW_AT_decl_file   : 8
    <9f35c>   DW_AT_decl_line   : 90
    <9f35d>   DW_AT_decl_column : 25
    <9f35e>   DW_AT_type        : <0x9f268>
    <9f362>   DW_AT_data_member_location: 72
 <2><9f363>: Abbrev Number: 2 (DW_TAG_member)
    <9f364>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <9f368>   DW_AT_decl_file   : 8
    <9f369>   DW_AT_decl_line   : 91
    <9f36a>   DW_AT_decl_column : 25
    <9f36b>   DW_AT_type        : <0x9f274>
    <9f36f>   DW_AT_data_member_location: 80
 <2><9f370>: Abbrev Number: 2 (DW_TAG_member)
    <9f371>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <9f375>   DW_AT_decl_file   : 8
    <9f376>   DW_AT_decl_line   : 92
    <9f377>   DW_AT_decl_column : 25
    <9f378>   DW_AT_type        : <0x9f29e>
    <9f37c>   DW_AT_data_member_location: 88
 <2><9f37d>: Abbrev Number: 2 (DW_TAG_member)
    <9f37e>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <9f382>   DW_AT_decl_file   : 8
    <9f383>   DW_AT_decl_line   : 93
    <9f384>   DW_AT_decl_column : 25
    <9f385>   DW_AT_type        : <0x9f01e>
    <9f389>   DW_AT_data_member_location: 96
 <2><9f38a>: Abbrev Number: 2 (DW_TAG_member)
    <9f38b>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <9f38f>   DW_AT_decl_file   : 8
    <9f390>   DW_AT_decl_line   : 94
    <9f391>   DW_AT_decl_column : 25
    <9f392>   DW_AT_type        : <0x9f2c8>
    <9f396>   DW_AT_data_member_location: 104
 <2><9f397>: Abbrev Number: 0
 <1><9f398>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f399>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <9f39d>   DW_AT_decl_file   : 8
    <9f39e>   DW_AT_decl_line   : 95
    <9f39f>   DW_AT_decl_column : 3
    <9f3a0>   DW_AT_type        : <0x9f2d4>
 <1><9f3a4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f3a5>   DW_AT_byte_size   : 8
    <9f3a5>   DW_AT_type        : <0x9f398>
 <1><9f3a9>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f3aa>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <9f3ae>   DW_AT_decl_file   : 8
    <9f3af>   DW_AT_decl_line   : 117
    <9f3b0>   DW_AT_decl_column : 3
    <9f3b1>   DW_AT_type        : <0x9f048>
 <1><9f3b5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9f3b6>   DW_AT_byte_size   : 8
    <9f3b6>   DW_AT_type        : <0x9f3a9>
 <1><9f3ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f3bb>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <9f3bf>   DW_AT_decl_file   : 9
    <9f3c0>   DW_AT_decl_line   : 7
    <9f3c1>   DW_AT_decl_column : 25
    <9f3c2>   DW_AT_type        : <0x9f3c6>
 <1><9f3c6>: Abbrev Number: 73 (DW_TAG_structure_type)
    <9f3c7>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <9f3cb>   DW_AT_declaration : 1
 <1><9f3cb>: Abbrev Number: 28 (DW_TAG_structure_type)
    <9f3cc>   DW_AT_byte_size   : 8
    <9f3cd>   DW_AT_decl_file   : 10
    <9f3ce>   DW_AT_decl_line   : 4
    <9f3cf>   DW_AT_decl_column : 3
    <9f3cf>   DW_AT_sibling     : <0x9f3ee>
 <2><9f3d3>: Abbrev Number: 2 (DW_TAG_member)
    <9f3d4>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <9f3d8>   DW_AT_decl_file   : 10
    <9f3d9>   DW_AT_decl_line   : 5
    <9f3da>   DW_AT_decl_column : 8
    <9f3db>   DW_AT_type        : <0x9ed9d>
    <9f3df>   DW_AT_data_member_location: 0
 <2><9f3e0>: Abbrev Number: 2 (DW_TAG_member)
    <9f3e1>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9f3e5>   DW_AT_decl_file   : 10
    <9f3e6>   DW_AT_decl_line   : 6
    <9f3e7>   DW_AT_decl_column : 8
    <9f3e8>   DW_AT_type        : <0x9ed9d>
    <9f3ec>   DW_AT_data_member_location: 4
 <2><9f3ed>: Abbrev Number: 0
 <1><9f3ee>: Abbrev Number: 28 (DW_TAG_structure_type)
    <9f3ef>   DW_AT_byte_size   : 16
    <9f3f0>   DW_AT_decl_file   : 10
    <9f3f1>   DW_AT_decl_line   : 8
    <9f3f2>   DW_AT_decl_column : 3
    <9f3f2>   DW_AT_sibling     : <0x9f425>
 <2><9f3f6>: Abbrev Number: 10 (DW_TAG_member)
    <9f3f7>   DW_AT_name        : x
    <9f3f9>   DW_AT_decl_file   : 10
    <9f3fa>   DW_AT_decl_line   : 9
    <9f3fb>   DW_AT_decl_column : 8
    <9f3fc>   DW_AT_type        : <0x9ed9d>
    <9f400>   DW_AT_data_member_location: 0
 <2><9f401>: Abbrev Number: 10 (DW_TAG_member)
    <9f402>   DW_AT_name        : y
    <9f404>   DW_AT_decl_file   : 10
    <9f405>   DW_AT_decl_line   : 9
    <9f406>   DW_AT_decl_column : 11
    <9f407>   DW_AT_type        : <0x9ed9d>
    <9f40b>   DW_AT_data_member_location: 4
 <2><9f40c>: Abbrev Number: 10 (DW_TAG_member)
    <9f40d>   DW_AT_name        : dx
    <9f410>   DW_AT_decl_file   : 10
    <9f411>   DW_AT_decl_line   : 10
    <9f412>   DW_AT_decl_column : 8
    <9f413>   DW_AT_type        : <0x9ed9d>
    <9f417>   DW_AT_data_member_location: 8
