    <8b99b>   DW_AT_decl_column : 23
    <8b99c>   DW_AT_type        : <0x8b959>
 <1><8b9a0>: Abbrev Number: 24 (DW_TAG_typedef)
    <8b9a1>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <8b9a5>   DW_AT_decl_file   : 2
    <8b9a6>   DW_AT_decl_line   : 321
    <8b9a8>   DW_AT_decl_column : 24
    <8b9a9>   DW_AT_type        : <0x8b96e>
 <1><8b9ad>: Abbrev Number: 5 (DW_TAG_base_type)
    <8b9ae>   DW_AT_byte_size   : 8
    <8b9af>   DW_AT_encoding    : 5	(signed)
    <8b9b0>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><8b9b4>: Abbrev Number: 5 (DW_TAG_base_type)
    <8b9b5>   DW_AT_byte_size   : 8
    <8b9b6>   DW_AT_encoding    : 7	(unsigned)
    <8b9b7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><8b9bb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8b9bc>   DW_AT_byte_size   : 8
    <8b9bc>   DW_AT_type        : <0x8b9c0>
 <1><8b9c0>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <8b9c1>   DW_AT_prototyped  : 1
 <1><8b9c1>: Abbrev Number: 5 (DW_TAG_base_type)
    <8b9c2>   DW_AT_byte_size   : 8
    <8b9c3>   DW_AT_encoding    : 4	(float)
    <8b9c4>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><8b9c8>: Abbrev Number: 5 (DW_TAG_base_type)
    <8b9c9>   DW_AT_byte_size   : 4
    <8b9ca>   DW_AT_encoding    : 4	(float)
    <8b9cb>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><8b9cf>: Abbrev Number: 8 (DW_TAG_typedef)
    <8b9d0>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <8b9d4>   DW_AT_decl_file   : 3
    <8b9d5>   DW_AT_decl_line   : 7
    <8b9d6>   DW_AT_decl_column : 25
    <8b9d7>   DW_AT_type        : <0x8b9db>
 <1><8b9db>: Abbrev Number: 35 (DW_TAG_structure_type)
    <8b9dc>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <8b9e0>   DW_AT_declaration : 1
 <1><8b9e0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8b9e1>   DW_AT_byte_size   : 8
    <8b9e2>   DW_AT_decl_file   : 4
    <8b9e3>   DW_AT_decl_line   : 4
    <8b9e4>   DW_AT_decl_column : 3
    <8b9e4>   DW_AT_sibling     : <0x8ba03>
 <2><8b9e8>: Abbrev Number: 1 (DW_TAG_member)
    <8b9e9>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <8b9ed>   DW_AT_decl_file   : 4
    <8b9ee>   DW_AT_decl_line   : 5
    <8b9ef>   DW_AT_decl_column : 8
    <8b9f0>   DW_AT_type        : <0x8b96e>
    <8b9f4>   DW_AT_data_member_location: 0
 <2><8b9f5>: Abbrev Number: 1 (DW_TAG_member)
    <8b9f6>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <8b9fa>   DW_AT_decl_file   : 4
    <8b9fb>   DW_AT_decl_line   : 6
    <8b9fc>   DW_AT_decl_column : 8
    <8b9fd>   DW_AT_type        : <0x8b96e>
    <8ba01>   DW_AT_data_member_location: 4
 <2><8ba02>: Abbrev Number: 0
 <1><8ba03>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8ba04>   DW_AT_byte_size   : 16
    <8ba05>   DW_AT_decl_file   : 4
    <8ba06>   DW_AT_decl_line   : 8
    <8ba07>   DW_AT_decl_column : 3
    <8ba07>   DW_AT_sibling     : <0x8ba3a>
 <2><8ba0b>: Abbrev Number: 4 (DW_TAG_member)
    <8ba0c>   DW_AT_name        : x
    <8ba0e>   DW_AT_decl_file   : 4
    <8ba0f>   DW_AT_decl_line   : 9
    <8ba10>   DW_AT_decl_column : 8
    <8ba11>   DW_AT_type        : <0x8b96e>
    <8ba15>   DW_AT_data_member_location: 0
 <2><8ba16>: Abbrev Number: 4 (DW_TAG_member)
    <8ba17>   DW_AT_name        : y
    <8ba19>   DW_AT_decl_file   : 4
    <8ba1a>   DW_AT_decl_line   : 9
    <8ba1b>   DW_AT_decl_column : 11
    <8ba1c>   DW_AT_type        : <0x8b96e>
    <8ba20>   DW_AT_data_member_location: 4
 <2><8ba21>: Abbrev Number: 4 (DW_TAG_member)
    <8ba22>   DW_AT_name        : dx
    <8ba25>   DW_AT_decl_file   : 4
    <8ba26>   DW_AT_decl_line   : 10
    <8ba27>   DW_AT_decl_column : 8
    <8ba28>   DW_AT_type        : <0x8b96e>
    <8ba2c>   DW_AT_data_member_location: 8
 <2><8ba2d>: Abbrev Number: 4 (DW_TAG_member)
    <8ba2e>   DW_AT_name        : dy
    <8ba31>   DW_AT_decl_file   : 4
    <8ba32>   DW_AT_decl_line   : 10
    <8ba33>   DW_AT_decl_column : 12
    <8ba34>   DW_AT_type        : <0x8b96e>
    <8ba38>   DW_AT_data_member_location: 12
 <2><8ba39>: Abbrev Number: 0
 <1><8ba3a>: Abbrev Number: 16 (DW_TAG_union_type)
    <8ba3b>   DW_AT_byte_size   : 16
    <8ba3b>   DW_AT_decl_file   : 4
    <8ba3c>   DW_AT_decl_line   : 3
    <8ba3d>   DW_AT_decl_column : 2
    <8ba3d>   DW_AT_sibling     : <0x8ba67>
 <2><8ba41>: Abbrev Number: 13 (DW_TAG_member)
    <8ba42>   DW_AT_type        : <0x8b9e0>
 <2><8ba46>: Abbrev Number: 13 (DW_TAG_member)
    <8ba47>   DW_AT_type        : <0x8ba03>
 <2><8ba4b>: Abbrev Number: 17 (DW_TAG_member)
    <8ba4c>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <8ba50>   DW_AT_decl_file   : 4
    <8ba51>   DW_AT_decl_line   : 12
    <8ba52>   DW_AT_decl_column : 7
    <8ba52>   DW_AT_type        : <0x8b96e>
 <2><8ba56>: Abbrev Number: 25 (DW_TAG_member)
    <8ba57>   DW_AT_name        : z
    <8ba59>   DW_AT_decl_file   : 4
    <8ba59>   DW_AT_decl_line   : 13
    <8ba5a>   DW_AT_decl_column : 7
    <8ba5a>   DW_AT_type        : <0x8b96e>
 <2><8ba5e>: Abbrev Number: 25 (DW_TAG_member)
    <8ba5f>   DW_AT_name        : w
    <8ba61>   DW_AT_decl_file   : 4
    <8ba61>   DW_AT_decl_line   : 14
    <8ba62>   DW_AT_decl_column : 7
    <8ba62>   DW_AT_type        : <0x8b96e>
 <2><8ba66>: Abbrev Number: 0
 <1><8ba67>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8ba68>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <8ba6c>   DW_AT_byte_size   : 20
    <8ba6d>   DW_AT_decl_file   : 4
    <8ba6e>   DW_AT_decl_line   : 1
    <8ba6f>   DW_AT_decl_column : 8
    <8ba70>   DW_AT_sibling     : <0x8ba88>
 <2><8ba74>: Abbrev Number: 1 (DW_TAG_member)
    <8ba75>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8ba79>   DW_AT_decl_file   : 4
    <8ba7a>   DW_AT_decl_line   : 2
    <8ba7b>   DW_AT_decl_column : 6
    <8ba7c>   DW_AT_type        : <0x8b96e>
    <8ba80>   DW_AT_data_member_location: 0
 <2><8ba81>: Abbrev Number: 18 (DW_TAG_member)
    <8ba82>   DW_AT_type        : <0x8ba3a>
    <8ba86>   DW_AT_data_member_location: 4
 <2><8ba87>: Abbrev Number: 0
 <1><8ba88>: Abbrev Number: 8 (DW_TAG_typedef)
    <8ba89>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <8ba8d>   DW_AT_decl_file   : 4
    <8ba8e>   DW_AT_decl_line   : 18
    <8ba8f>   DW_AT_decl_column : 23
    <8ba90>   DW_AT_type        : <0x8ba67>
 <1><8ba94>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8ba95>   DW_AT_byte_size   : 8
    <8ba95>   DW_AT_type        : <0x8ba99>
 <1><8ba99>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8ba9a>   DW_AT_prototyped  : 1
    <8ba9a>   DW_AT_type        : <0x8b96e>
    <8ba9e>   DW_AT_sibling     : <0x8baad>
 <2><8baa2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8baa3>   DW_AT_type        : <0x8b96e>
 <2><8baa7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8baa8>   DW_AT_type        : <0x8b96e>
 <2><8baac>: Abbrev Number: 0
 <1><8baad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8baae>   DW_AT_byte_size   : 8
    <8baae>   DW_AT_type        : <0x8b96e>
 <1><8bab2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bab3>   DW_AT_byte_size   : 8
    <8bab3>   DW_AT_type        : <0x8bab7>
 <1><8bab7>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8bab8>   DW_AT_prototyped  : 1
    <8bab8>   DW_AT_type        : <0x8b96e>
    <8babc>   DW_AT_sibling     : <0x8bada>
 <2><8bac0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bac1>   DW_AT_type        : <0x8baad>
 <2><8bac5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bac6>   DW_AT_type        : <0x8baad>
 <2><8baca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bacb>   DW_AT_type        : <0x8baad>
 <2><8bacf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bad0>   DW_AT_type        : <0x8baad>
 <2><8bad4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bad5>   DW_AT_type        : <0x8baad>
 <2><8bad9>: Abbrev Number: 0
 <1><8bada>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8badb>   DW_AT_byte_size   : 8
    <8badb>   DW_AT_type        : <0x8ba88>
 <1><8badf>: Abbrev Number: 8 (DW_TAG_typedef)
    <8bae0>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <8bae4>   DW_AT_decl_file   : 5
    <8bae5>   DW_AT_decl_line   : 13
    <8bae6>   DW_AT_decl_column : 30
    <8bae7>   DW_AT_type        : <0x8baeb>
 <1><8baeb>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8baec>   DW_AT_prototyped  : 1
    <8baec>   DW_AT_type        : <0x8b952>
    <8baf0>   DW_AT_sibling     : <0x8bb04>
 <2><8baf4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8baf5>   DW_AT_type        : <0x8b952>
 <2><8baf9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bafa>   DW_AT_type        : <0x8b952>
 <2><8bafe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8baff>   DW_AT_type        : <0x8b986>
 <2><8bb03>: Abbrev Number: 0
 <1><8bb04>: Abbrev Number: 8 (DW_TAG_typedef)
    <8bb05>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <8bb09>   DW_AT_decl_file   : 5
    <8bb0a>   DW_AT_decl_line   : 14
    <8bb0b>   DW_AT_decl_column : 15
    <8bb0c>   DW_AT_type        : <0x8bb10>
 <1><8bb10>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <8bb11>   DW_AT_prototyped  : 1
    <8bb11>   DW_AT_sibling     : <0x8bb43>
 <2><8bb15>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb16>   DW_AT_type        : <0x8bb43>
 <2><8bb1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb1b>   DW_AT_type        : <0x8bb43>
 <2><8bb1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb20>   DW_AT_type        : <0x8b96e>
 <2><8bb24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb25>   DW_AT_type        : <0x8b96e>
 <2><8bb29>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb2a>   DW_AT_type        : <0x8b96e>
 <2><8bb2e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb2f>   DW_AT_type        : <0x8b96e>
 <2><8bb33>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb34>   DW_AT_type        : <0x8b96e>
 <2><8bb38>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb39>   DW_AT_type        : <0x8bb48>
 <2><8bb3d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bb3e>   DW_AT_type        : <0x8b986>
 <2><8bb42>: Abbrev Number: 0
 <1><8bb43>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bb44>   DW_AT_byte_size   : 8
    <8bb44>   DW_AT_type        : <0x8b93f>
 <1><8bb48>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bb49>   DW_AT_byte_size   : 8
    <8bb49>   DW_AT_type        : <0x8badf>
 <1><8bb4d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8bb4e>   DW_AT_byte_size   : 16
    <8bb4f>   DW_AT_decl_file   : 5
    <8bb50>   DW_AT_decl_line   : 26
    <8bb51>   DW_AT_decl_column : 3
    <8bb51>   DW_AT_sibling     : <0x8bb8a>
 <2><8bb55>: Abbrev Number: 1 (DW_TAG_member)
    <8bb56>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <8bb5a>   DW_AT_decl_file   : 5
    <8bb5b>   DW_AT_decl_line   : 27
    <8bb5c>   DW_AT_decl_column : 8
    <8bb5d>   DW_AT_type        : <0x8b96e>
    <8bb61>   DW_AT_data_member_location: 0
 <2><8bb62>: Abbrev Number: 1 (DW_TAG_member)
    <8bb63>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <8bb67>   DW_AT_decl_file   : 5
    <8bb68>   DW_AT_decl_line   : 27
    <8bb69>   DW_AT_decl_column : 16
    <8bb6a>   DW_AT_type        : <0x8b96e>
    <8bb6e>   DW_AT_data_member_location: 4
 <2><8bb6f>: Abbrev Number: 1 (DW_TAG_member)
    <8bb70>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <8bb74>   DW_AT_decl_file   : 5
    <8bb75>   DW_AT_decl_line   : 27
    <8bb76>   DW_AT_decl_column : 24
    <8bb77>   DW_AT_type        : <0x8b96e>
    <8bb7b>   DW_AT_data_member_location: 8
 <2><8bb7c>: Abbrev Number: 1 (DW_TAG_member)
    <8bb7d>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <8bb81>   DW_AT_decl_file   : 5
    <8bb82>   DW_AT_decl_line   : 27
    <8bb83>   DW_AT_decl_column : 32
    <8bb84>   DW_AT_type        : <0x8b96e>
    <8bb88>   DW_AT_data_member_location: 12
 <2><8bb89>: Abbrev Number: 0
 <1><8bb8a>: Abbrev Number: 16 (DW_TAG_union_type)
    <8bb8b>   DW_AT_byte_size   : 16
    <8bb8b>   DW_AT_decl_file   : 5
    <8bb8c>   DW_AT_decl_line   : 25
    <8bb8d>   DW_AT_decl_column : 2
    <8bb8d>   DW_AT_sibling     : <0x8bba2>
 <2><8bb91>: Abbrev Number: 13 (DW_TAG_member)
    <8bb92>   DW_AT_type        : <0x8bb4d>
 <2><8bb96>: Abbrev Number: 17 (DW_TAG_member)
    <8bb97>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <8bb9b>   DW_AT_decl_file   : 5
    <8bb9c>   DW_AT_decl_line   : 29
    <8bb9d>   DW_AT_decl_column : 7
    <8bb9d>   DW_AT_type        : <0x8bba2>
 <2><8bba1>: Abbrev Number: 0
 <1><8bba2>: Abbrev Number: 19 (DW_TAG_array_type)
    <8bba3>   DW_AT_type        : <0x8b96e>
    <8bba7>   DW_AT_sibling     : <0x8bbb2>
 <2><8bbab>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <8bbac>   DW_AT_type        : <0x8b959>
    <8bbb0>   DW_AT_upper_bound : 3
 <2><8bbb1>: Abbrev Number: 0
 <1><8bbb2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8bbb3>   DW_AT_byte_size   : 16
    <8bbb4>   DW_AT_decl_file   : 5
    <8bbb5>   DW_AT_decl_line   : 32
    <8bbb6>   DW_AT_decl_column : 3
    <8bbb6>   DW_AT_sibling     : <0x8bbef>
 <2><8bbba>: Abbrev Number: 1 (DW_TAG_member)
    <8bbbb>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <8bbbf>   DW_AT_decl_file   : 5
    <8bbc0>   DW_AT_decl_line   : 33
    <8bbc1>   DW_AT_decl_column : 8
    <8bbc2>   DW_AT_type        : <0x8b96e>
    <8bbc6>   DW_AT_data_member_location: 0
 <2><8bbc7>: Abbrev Number: 1 (DW_TAG_member)
    <8bbc8>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <8bbcc>   DW_AT_decl_file   : 5
    <8bbcd>   DW_AT_decl_line   : 33
    <8bbce>   DW_AT_decl_column : 20
    <8bbcf>   DW_AT_type        : <0x8b96e>
    <8bbd3>   DW_AT_data_member_location: 4
 <2><8bbd4>: Abbrev Number: 1 (DW_TAG_member)
    <8bbd5>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <8bbd9>   DW_AT_decl_file   : 5
    <8bbda>   DW_AT_decl_line   : 33
    <8bbdb>   DW_AT_decl_column : 32
    <8bbdc>   DW_AT_type        : <0x8b96e>
    <8bbe0>   DW_AT_data_member_location: 8
 <2><8bbe1>: Abbrev Number: 1 (DW_TAG_member)
    <8bbe2>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <8bbe6>   DW_AT_decl_file   : 5
    <8bbe7>   DW_AT_decl_line   : 33
    <8bbe8>   DW_AT_decl_column : 44
    <8bbe9>   DW_AT_type        : <0x8b96e>
    <8bbed>   DW_AT_data_member_location: 12
 <2><8bbee>: Abbrev Number: 0
 <1><8bbef>: Abbrev Number: 16 (DW_TAG_union_type)
    <8bbf0>   DW_AT_byte_size   : 16
    <8bbf0>   DW_AT_decl_file   : 5
    <8bbf1>   DW_AT_decl_line   : 31
    <8bbf2>   DW_AT_decl_column : 2
    <8bbf2>   DW_AT_sibling     : <0x8bc07>
 <2><8bbf6>: Abbrev Number: 13 (DW_TAG_member)
    <8bbf7>   DW_AT_type        : <0x8bbb2>
 <2><8bbfb>: Abbrev Number: 17 (DW_TAG_member)
    <8bbfc>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <8bc00>   DW_AT_decl_file   : 5
    <8bc01>   DW_AT_decl_line   : 35
    <8bc02>   DW_AT_decl_column : 7
    <8bc02>   DW_AT_type        : <0x8bba2>
 <2><8bc06>: Abbrev Number: 0
 <1><8bc07>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8bc08>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <8bc0c>   DW_AT_byte_size   : 216
    <8bc0d>   DW_AT_decl_file   : 5
    <8bc0e>   DW_AT_decl_line   : 16
    <8bc0f>   DW_AT_decl_column : 16
    <8bc10>   DW_AT_sibling     : <0x8bd24>
 <2><8bc14>: Abbrev Number: 4 (DW_TAG_member)
    <8bc15>   DW_AT_name        : id
    <8bc18>   DW_AT_decl_file   : 5
    <8bc19>   DW_AT_decl_line   : 17
    <8bc1a>   DW_AT_decl_column : 6
    <8bc1b>   DW_AT_type        : <0x8b96e>
    <8bc1f>   DW_AT_data_member_location: 0
 <2><8bc20>: Abbrev Number: 1 (DW_TAG_member)
    <8bc21>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <8bc25>   DW_AT_decl_file   : 5
    <8bc26>   DW_AT_decl_line   : 18
    <8bc27>   DW_AT_decl_column : 6
    <8bc28>   DW_AT_type        : <0x8b96e>
    <8bc2c>   DW_AT_data_member_location: 4
 <2><8bc2d>: Abbrev Number: 1 (DW_TAG_member)
    <8bc2e>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <8bc32>   DW_AT_decl_file   : 5
    <8bc33>   DW_AT_decl_line   : 19
    <8bc34>   DW_AT_decl_column : 18
    <8bc35>   DW_AT_type        : <0x8bd24>
    <8bc39>   DW_AT_data_member_location: 8
 <2><8bc3a>: Abbrev Number: 1 (DW_TAG_member)
    <8bc3b>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <8bc3f>   DW_AT_decl_file   : 5
    <8bc40>   DW_AT_decl_line   : 20
    <8bc41>   DW_AT_decl_column : 6
    <8bc42>   DW_AT_type        : <0x8b96e>
    <8bc46>   DW_AT_data_member_location: 16
 <2><8bc47>: Abbrev Number: 1 (DW_TAG_member)
    <8bc48>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <8bc4c>   DW_AT_decl_file   : 5
    <8bc4d>   DW_AT_decl_line   : 21
    <8bc4e>   DW_AT_decl_column : 6
    <8bc4f>   DW_AT_type        : <0x8b96e>
    <8bc53>   DW_AT_data_member_location: 20
 <2><8bc54>: Abbrev Number: 1 (DW_TAG_member)
    <8bc55>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <8bc59>   DW_AT_decl_file   : 5
    <8bc5a>   DW_AT_decl_line   : 22
    <8bc5b>   DW_AT_decl_column : 6
    <8bc5c>   DW_AT_type        : <0x8b96e>
    <8bc60>   DW_AT_data_member_location: 24
 <2><8bc61>: Abbrev Number: 1 (DW_TAG_member)
    <8bc62>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <8bc66>   DW_AT_decl_file   : 5
    <8bc67>   DW_AT_decl_line   : 23
    <8bc68>   DW_AT_decl_column : 8
    <8bc69>   DW_AT_type        : <0x8b986>
    <8bc6d>   DW_AT_data_member_location: 32
 <2><8bc6e>: Abbrev Number: 1 (DW_TAG_member)
    <8bc6f>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <8bc73>   DW_AT_decl_file   : 5
    <8bc74>   DW_AT_decl_line   : 24
    <8bc75>   DW_AT_decl_column : 8
    <8bc76>   DW_AT_type        : <0x8b9c8>
    <8bc7a>   DW_AT_data_member_location: 40
 <2><8bc7b>: Abbrev Number: 1 (DW_TAG_member)
    <8bc7c>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <8bc80>   DW_AT_decl_file   : 5
    <8bc81>   DW_AT_decl_line   : 24
    <8bc82>   DW_AT_decl_column : 16
    <8bc83>   DW_AT_type        : <0x8b9c8>
    <8bc87>   DW_AT_data_member_location: 44
 <2><8bc88>: Abbrev Number: 18 (DW_TAG_member)
    <8bc89>   DW_AT_type        : <0x8bb8a>
    <8bc8d>   DW_AT_data_member_location: 48
 <2><8bc8e>: Abbrev Number: 18 (DW_TAG_member)
    <8bc8f>   DW_AT_type        : <0x8bbef>
    <8bc93>   DW_AT_data_member_location: 64
 <2><8bc94>: Abbrev Number: 1 (DW_TAG_member)
    <8bc95>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <8bc99>   DW_AT_decl_file   : 5
    <8bc9a>   DW_AT_decl_line   : 37
    <8bc9b>   DW_AT_decl_column : 8
    <8bc9c>   DW_AT_type        : <0x8b9c8>
    <8bca0>   DW_AT_data_member_location: 80
 <2><8bca1>: Abbrev Number: 1 (DW_TAG_member)
    <8bca2>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <8bca6>   DW_AT_decl_file   : 5
    <8bca7>   DW_AT_decl_line   : 37
    <8bca8>   DW_AT_decl_column : 15
    <8bca9>   DW_AT_type        : <0x8b9c8>
    <8bcad>   DW_AT_data_member_location: 84
 <2><8bcae>: Abbrev Number: 1 (DW_TAG_member)
    <8bcaf>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <8bcb3>   DW_AT_decl_file   : 5
    <8bcb4>   DW_AT_decl_line   : 37
    <8bcb5>   DW_AT_decl_column : 22
    <8bcb6>   DW_AT_type        : <0x8b9c8>
    <8bcba>   DW_AT_data_member_location: 88
 <2><8bcbb>: Abbrev Number: 1 (DW_TAG_member)
    <8bcbc>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <8bcc0>   DW_AT_decl_file   : 5
    <8bcc1>   DW_AT_decl_line   : 37
    <8bcc2>   DW_AT_decl_column : 29
    <8bcc3>   DW_AT_type        : <0x8b9c8>
    <8bcc7>   DW_AT_data_member_location: 92
 <2><8bcc8>: Abbrev Number: 1 (DW_TAG_member)
    <8bcc9>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <8bccd>   DW_AT_decl_file   : 5
    <8bcce>   DW_AT_decl_line   : 38
    <8bccf>   DW_AT_decl_column : 15
    <8bcd0>   DW_AT_type        : <0x8b952>
    <8bcd4>   DW_AT_data_member_location: 96
 <2><8bcd5>: Abbrev Number: 1 (DW_TAG_member)
    <8bcd6>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <8bcda>   DW_AT_decl_file   : 5
    <8bcdb>   DW_AT_decl_line   : 38
    <8bcdc>   DW_AT_decl_column : 25
    <8bcdd>   DW_AT_type        : <0x8b952>
    <8bce1>   DW_AT_data_member_location: 100
 <2><8bce2>: Abbrev Number: 1 (DW_TAG_member)
    <8bce3>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <8bce7>   DW_AT_decl_file   : 5
    <8bce8>   DW_AT_decl_line   : 39
    <8bce9>   DW_AT_decl_column : 9
    <8bcea>   DW_AT_type        : <0x8bd48>
    <8bcee>   DW_AT_data_member_location: 104
 <2><8bcef>: Abbrev Number: 1 (DW_TAG_member)
    <8bcf0>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <8bcf4>   DW_AT_decl_file   : 5
    <8bcf5>   DW_AT_decl_line   : 40
    <8bcf6>   DW_AT_decl_column : 17
    <8bcf7>   DW_AT_type        : <0x8bd66>
    <8bcfb>   DW_AT_data_member_location: 112
 <2><8bcfc>: Abbrev Number: 1 (DW_TAG_member)
    <8bcfd>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <8bd01>   DW_AT_decl_file   : 5
    <8bd02>   DW_AT_decl_line   : 41
    <8bd03>   DW_AT_decl_column : 10
    <8bd04>   DW_AT_type        : <0x8bd84>
    <8bd08>   DW_AT_data_member_location: 120
 <2><8bd09>: Abbrev Number: 1 (DW_TAG_member)
    <8bd0a>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <8bd0e>   DW_AT_decl_file   : 5
    <8bd0f>   DW_AT_decl_line   : 42
    <8bd10>   DW_AT_decl_column : 11
    <8bd11>   DW_AT_type        : <0x8bd89>
    <8bd15>   DW_AT_data_member_location: 128
 <2><8bd16>: Abbrev Number: 1 (DW_TAG_member)
    <8bd17>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8bd1b>   DW_AT_decl_file   : 5
    <8bd1c>   DW_AT_decl_line   : 43
    <8bd1d>   DW_AT_decl_column : 6
    <8bd1e>   DW_AT_type        : <0x8b96e>
    <8bd22>   DW_AT_data_member_location: 208
 <2><8bd23>: Abbrev Number: 0
 <1><8bd24>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd25>   DW_AT_byte_size   : 8
    <8bd25>   DW_AT_type        : <0x8bb43>
 <1><8bd29>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <8bd2a>   DW_AT_prototyped  : 1
    <8bd2a>   DW_AT_sibling     : <0x8bd43>
 <2><8bd2e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd2f>   DW_AT_type        : <0x8bd43>
 <2><8bd33>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd34>   DW_AT_type        : <0x8b96e>
 <2><8bd38>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd39>   DW_AT_type        : <0x8b96e>
 <2><8bd3d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd3e>   DW_AT_type        : <0x8b952>
 <2><8bd42>: Abbrev Number: 0
 <1><8bd43>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd44>   DW_AT_byte_size   : 8
    <8bd44>   DW_AT_type        : <0x8bc07>
 <1><8bd48>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd49>   DW_AT_byte_size   : 8
    <8bd49>   DW_AT_type        : <0x8bd29>
 <1><8bd4d>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8bd4e>   DW_AT_prototyped  : 1
    <8bd4e>   DW_AT_type        : <0x8b952>
    <8bd52>   DW_AT_sibling     : <0x8bd66>
 <2><8bd56>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd57>   DW_AT_type        : <0x8bd43>
 <2><8bd5b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd5c>   DW_AT_type        : <0x8b96e>
 <2><8bd60>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd61>   DW_AT_type        : <0x8b96e>
 <2><8bd65>: Abbrev Number: 0
 <1><8bd66>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd67>   DW_AT_byte_size   : 8
    <8bd67>   DW_AT_type        : <0x8bd4d>
 <1><8bd6b>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8bd6c>   DW_AT_prototyped  : 1
    <8bd6c>   DW_AT_type        : <0x8b986>
    <8bd70>   DW_AT_sibling     : <0x8bd84>
 <2><8bd74>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd75>   DW_AT_type        : <0x8b986>
 <2><8bd79>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd7a>   DW_AT_type        : <0x8b96e>
 <2><8bd7e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8bd7f>   DW_AT_type        : <0x8b994>
 <2><8bd83>: Abbrev Number: 0
 <1><8bd84>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd85>   DW_AT_byte_size   : 8
    <8bd85>   DW_AT_type        : <0x8bd6b>
 <1><8bd89>: Abbrev Number: 19 (DW_TAG_array_type)
    <8bd8a>   DW_AT_type        : <0x8bd99>
    <8bd8e>   DW_AT_sibling     : <0x8bd99>
 <2><8bd92>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <8bd93>   DW_AT_type        : <0x8b959>
    <8bd97>   DW_AT_upper_bound : 9
 <2><8bd98>: Abbrev Number: 0
 <1><8bd99>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd9a>   DW_AT_byte_size   : 8
    <8bd9a>   DW_AT_type        : <0x8bd9e>
 <1><8bd9e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bd9f>   DW_AT_byte_size   : 8
    <8bd9f>   DW_AT_type        : <0x8bb04>
 <1><8bda3>: Abbrev Number: 8 (DW_TAG_typedef)
    <8bda4>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <8bda8>   DW_AT_decl_file   : 5
    <8bda9>   DW_AT_decl_line   : 44
    <8bdaa>   DW_AT_decl_column : 3
    <8bdab>   DW_AT_type        : <0x8bc07>
 <1><8bdaf>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8bdb0>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <8bdb4>   DW_AT_byte_size   : 12
    <8bdb5>   DW_AT_decl_file   : 6
    <8bdb6>   DW_AT_decl_line   : 139
    <8bdb7>   DW_AT_decl_column : 16
    <8bdb8>   DW_AT_sibling     : <0x8bde1>
 <2><8bdbc>: Abbrev Number: 4 (DW_TAG_member)
    <8bdbd>   DW_AT_name        : ch
    <8bdc0>   DW_AT_decl_file   : 6
    <8bdc1>   DW_AT_decl_line   : 140
    <8bdc2>   DW_AT_decl_column : 14
    <8bdc3>   DW_AT_type        : <0x8b9a0>
    <8bdc7>   DW_AT_data_member_location: 0
 <2><8bdc8>: Abbrev Number: 4 (DW_TAG_member)
    <8bdc9>   DW_AT_name        : fg
    <8bdcc>   DW_AT_decl_file   : 6
    <8bdcd>   DW_AT_decl_line   : 141
    <8bdce>   DW_AT_decl_column : 14
    <8bdcf>   DW_AT_type        : <0x8b952>
    <8bdd3>   DW_AT_data_member_location: 4
 <2><8bdd4>: Abbrev Number: 4 (DW_TAG_member)
    <8bdd5>   DW_AT_name        : bg
    <8bdd8>   DW_AT_decl_file   : 6
    <8bdd9>   DW_AT_decl_line   : 141
    <8bdda>   DW_AT_decl_column : 18
    <8bddb>   DW_AT_type        : <0x8b952>
    <8bddf>   DW_AT_data_member_location: 8
 <2><8bde0>: Abbrev Number: 0
 <1><8bde1>: Abbrev Number: 8 (DW_TAG_typedef)
    <8bde2>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <8bde6>   DW_AT_decl_file   : 6
    <8bde7>   DW_AT_decl_line   : 142
    <8bde8>   DW_AT_decl_column : 3
    <8bde9>   DW_AT_type        : <0x8bdaf>
 <1><8bded>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8bdee>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <8bdf2>   DW_AT_byte_size   : 208
    <8bdf3>   DW_AT_decl_file   : 6
    <8bdf4>   DW_AT_decl_line   : 144
    <8bdf5>   DW_AT_decl_column : 16
    <8bdf6>   DW_AT_sibling     : <0x8bfb0>
 <2><8bdfa>: Abbrev Number: 4 (DW_TAG_member)
    <8bdfb>   DW_AT_name        : id
    <8bdfe>   DW_AT_decl_file   : 6
    <8bdff>   DW_AT_decl_line   : 146
    <8be00>   DW_AT_decl_column : 6
    <8be01>   DW_AT_type        : <0x8b96e>
    <8be05>   DW_AT_data_member_location: 0
 <2><8be06>: Abbrev Number: 1 (DW_TAG_member)
    <8be07>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <8be0b>   DW_AT_decl_file   : 6
    <8be0c>   DW_AT_decl_line   : 147
    <8be0d>   DW_AT_decl_column : 9
    <8be0e>   DW_AT_type        : <0x8b96e>
    <8be12>   DW_AT_data_member_location: 4
 <2><8be13>: Abbrev Number: 1 (DW_TAG_member)
    <8be14>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <8be18>   DW_AT_decl_file   : 6
    <8be19>   DW_AT_decl_line   : 148
    <8be1a>   DW_AT_decl_column : 21
    <8be1b>   DW_AT_type        : <0x8bd24>
    <8be1f>   DW_AT_data_member_location: 8
 <2><8be20>: Abbrev Number: 1 (DW_TAG_member)
    <8be21>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <8be25>   DW_AT_decl_file   : 6
    <8be26>   DW_AT_decl_line   : 149
    <8be27>   DW_AT_decl_column : 9
    <8be28>   DW_AT_type        : <0x8b96e>
    <8be2c>   DW_AT_data_member_location: 16
 <2><8be2d>: Abbrev Number: 1 (DW_TAG_member)
    <8be2e>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <8be32>   DW_AT_decl_file   : 6
    <8be33>   DW_AT_decl_line   : 150
    <8be34>   DW_AT_decl_column : 9
    <8be35>   DW_AT_type        : <0x8b96e>
    <8be39>   DW_AT_data_member_location: 20
 <2><8be3a>: Abbrev Number: 1 (DW_TAG_member)
    <8be3b>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <8be3f>   DW_AT_decl_file   : 6
    <8be40>   DW_AT_decl_line   : 151
    <8be41>   DW_AT_decl_column : 20
    <8be42>   DW_AT_type        : <0x8bb43>
    <8be46>   DW_AT_data_member_location: 24
 <2><8be47>: Abbrev Number: 4 (DW_TAG_member)
    <8be48>   DW_AT_name        : w
    <8be4a>   DW_AT_decl_file   : 6
    <8be4b>   DW_AT_decl_line   : 152
    <8be4c>   DW_AT_decl_column : 9
    <8be4d>   DW_AT_type        : <0x8b96e>
    <8be51>   DW_AT_data_member_location: 32
 <2><8be52>: Abbrev Number: 4 (DW_TAG_member)
    <8be53>   DW_AT_name        : h
    <8be55>   DW_AT_decl_file   : 6
    <8be56>   DW_AT_decl_line   : 152
    <8be57>   DW_AT_decl_column : 12
    <8be58>   DW_AT_type        : <0x8b96e>
    <8be5c>   DW_AT_data_member_location: 36
 <2><8be5d>: Abbrev Number: 1 (DW_TAG_member)
    <8be5e>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <8be62>   DW_AT_decl_file   : 6
    <8be63>   DW_AT_decl_line   : 153
    <8be64>   DW_AT_decl_column : 9
    <8be65>   DW_AT_type        : <0x8b96e>
    <8be69>   DW_AT_data_member_location: 40
 <2><8be6a>: Abbrev Number: 4 (DW_TAG_member)
    <8be6b>   DW_AT_name        : bpp
    <8be6f>   DW_AT_decl_file   : 6
    <8be70>   DW_AT_decl_line   : 154
    <8be71>   DW_AT_decl_column : 9
    <8be72>   DW_AT_type        : <0x8b96e>
    <8be76>   DW_AT_data_member_location: 44
 <2><8be77>: Abbrev Number: 1 (DW_TAG_member)
    <8be78>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8be7c>   DW_AT_decl_file   : 6
    <8be7d>   DW_AT_decl_line   : 155
    <8be7e>   DW_AT_decl_column : 9
    <8be7f>   DW_AT_type        : <0x8b96e>
    <8be83>   DW_AT_data_member_location: 48
 <2><8be84>: Abbrev Number: 1 (DW_TAG_member)
    <8be85>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <8be89>   DW_AT_decl_file   : 6
    <8be8a>   DW_AT_decl_line   : 156
    <8be8b>   DW_AT_decl_column : 19
    <8be8c>   DW_AT_type        : <0x8bfb0>
    <8be90>   DW_AT_data_member_location: 56
 <2><8be91>: Abbrev Number: 1 (DW_TAG_member)
    <8be92>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <8be96>   DW_AT_decl_file   : 6
    <8be97>   DW_AT_decl_line   : 157
    <8be98>   DW_AT_decl_column : 19
    <8be99>   DW_AT_type        : <0x8bfb0>
    <8be9d>   DW_AT_data_member_location: 64
 <2><8be9e>: Abbrev Number: 1 (DW_TAG_member)
    <8be9f>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <8bea3>   DW_AT_decl_file   : 6
    <8bea4>   DW_AT_decl_line   : 158
    <8bea5>   DW_AT_decl_column : 20
    <8bea6>   DW_AT_type        : <0x8bb43>
    <8beaa>   DW_AT_data_member_location: 72
 <2><8beab>: Abbrev Number: 1 (DW_TAG_member)
    <8beac>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <8beb0>   DW_AT_decl_file   : 6
    <8beb1>   DW_AT_decl_line   : 159
    <8beb2>   DW_AT_decl_column : 11
    <8beb3>   DW_AT_type        : <0x8b988>
    <8beb7>   DW_AT_data_member_location: 80
 <2><8beb8>: Abbrev Number: 1 (DW_TAG_member)
    <8beb9>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <8bebd>   DW_AT_decl_file   : 6
    <8bebe>   DW_AT_decl_line   : 160
    <8bebf>   DW_AT_decl_column : 29
    <8bec0>   DW_AT_type        : <0x8c07e>
    <8bec4>   DW_AT_data_member_location: 88
 <2><8bec5>: Abbrev Number: 1 (DW_TAG_member)
    <8bec6>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <8beca>   DW_AT_decl_file   : 6
    <8becb>   DW_AT_decl_line   : 161
    <8becc>   DW_AT_decl_column : 9
    <8becd>   DW_AT_type        : <0x8b96e>
    <8bed1>   DW_AT_data_member_location: 96
 <2><8bed2>: Abbrev Number: 1 (DW_TAG_member)
    <8bed3>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <8bed7>   DW_AT_decl_file   : 6
    <8bed8>   DW_AT_decl_line   : 162
    <8bed9>   DW_AT_decl_column : 27
    <8beda>   DW_AT_type        : <0x8c0ae>
    <8bede>   DW_AT_data_member_location: 104
 <2><8bedf>: Abbrev Number: 1 (DW_TAG_member)
    <8bee0>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <8bee4>   DW_AT_decl_file   : 6
    <8bee5>   DW_AT_decl_line   : 163
    <8bee6>   DW_AT_decl_column : 9
    <8bee7>   DW_AT_type        : <0x8b96e>
    <8beeb>   DW_AT_data_member_location: 112
 <2><8beec>: Abbrev Number: 1 (DW_TAG_member)
    <8beed>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <8bef1>   DW_AT_decl_file   : 6
    <8bef2>   DW_AT_decl_line   : 164
    <8bef3>   DW_AT_decl_column : 9
    <8bef4>   DW_AT_type        : <0x8b96e>
    <8bef8>   DW_AT_data_member_location: 116
 <2><8bef9>: Abbrev Number: 1 (DW_TAG_member)
    <8befa>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <8befe>   DW_AT_decl_file   : 6
    <8beff>   DW_AT_decl_line   : 164
    <8bf00>   DW_AT_decl_column : 19
    <8bf01>   DW_AT_type        : <0x8b96e>
    <8bf05>   DW_AT_data_member_location: 120
 <2><8bf06>: Abbrev Number: 1 (DW_TAG_member)
    <8bf07>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <8bf0b>   DW_AT_decl_file   : 6
    <8bf0c>   DW_AT_decl_line   : 165
    <8bf0d>   DW_AT_decl_column : 24
    <8bf0e>   DW_AT_type        : <0x8c0e5>
    <8bf12>   DW_AT_data_member_location: 128
 <2><8bf13>: Abbrev Number: 1 (DW_TAG_member)
    <8bf14>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <8bf18>   DW_AT_decl_file   : 6
    <8bf19>   DW_AT_decl_line   : 166
    <8bf1a>   DW_AT_decl_column : 9
    <8bf1b>   DW_AT_type        : <0x8b96e>
    <8bf1f>   DW_AT_data_member_location: 136
 <2><8bf20>: Abbrev Number: 1 (DW_TAG_member)
    <8bf21>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <8bf25>   DW_AT_decl_file   : 6
    <8bf26>   DW_AT_decl_line   : 166
    <8bf27>   DW_AT_decl_column : 17
    <8bf28>   DW_AT_type        : <0x8b96e>
    <8bf2c>   DW_AT_data_member_location: 140
 <2><8bf2d>: Abbrev Number: 1 (DW_TAG_member)
    <8bf2e>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <8bf32>   DW_AT_decl_file   : 6
    <8bf33>   DW_AT_decl_line   : 167
    <8bf34>   DW_AT_decl_column : 11
    <8bf35>   DW_AT_type        : <0x8b9c8>
    <8bf39>   DW_AT_data_member_location: 144
 <2><8bf3a>: Abbrev Number: 4 (DW_TAG_member)
    <8bf3b>   DW_AT_name        : key
    <8bf3f>   DW_AT_decl_file   : 6
    <8bf40>   DW_AT_decl_line   : 168
    <8bf41>   DW_AT_decl_column : 11
    <8bf42>   DW_AT_type        : <0x8b988>
    <8bf46>   DW_AT_data_member_location: 152
 <2><8bf47>: Abbrev Number: 1 (DW_TAG_member)
    <8bf48>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <8bf4c>   DW_AT_decl_file   : 6
    <8bf4d>   DW_AT_decl_line   : 169
    <8bf4e>   DW_AT_decl_column : 6
    <8bf4f>   DW_AT_type        : <0x8b96e>
    <8bf53>   DW_AT_data_member_location: 160
 <2><8bf54>: Abbrev Number: 1 (DW_TAG_member)
    <8bf55>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <8bf59>   DW_AT_decl_file   : 6
    <8bf5a>   DW_AT_decl_line   : 170
    <8bf5b>   DW_AT_decl_column : 18
    <8bf5c>   DW_AT_type        : <0x8c0ea>
    <8bf60>   DW_AT_data_member_location: 168
 <2><8bf61>: Abbrev Number: 1 (DW_TAG_member)
    <8bf62>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <8bf66>   DW_AT_decl_file   : 6
    <8bf67>   DW_AT_decl_line   : 171
    <8bf68>   DW_AT_decl_column : 12
    <8bf69>   DW_AT_type        : <0x8bada>
    <8bf6d>   DW_AT_data_member_location: 176
 <2><8bf6e>: Abbrev Number: 1 (DW_TAG_member)
    <8bf6f>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <8bf73>   DW_AT_decl_file   : 6
    <8bf74>   DW_AT_decl_line   : 172
    <8bf75>   DW_AT_decl_column : 9
    <8bf76>   DW_AT_type        : <0x8b96e>
    <8bf7a>   DW_AT_data_member_location: 184
 <2><8bf7b>: Abbrev Number: 1 (DW_TAG_member)
    <8bf7c>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <8bf80>   DW_AT_decl_file   : 6
    <8bf81>   DW_AT_decl_line   : 172
    <8bf82>   DW_AT_decl_column : 21
    <8bf83>   DW_AT_type        : <0x8b96e>
    <8bf87>   DW_AT_data_member_location: 188
 <2><8bf88>: Abbrev Number: 1 (DW_TAG_member)
    <8bf89>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <8bf8d>   DW_AT_decl_file   : 6
    <8bf8e>   DW_AT_decl_line   : 173
    <8bf8f>   DW_AT_decl_column : 11
    <8bf90>   DW_AT_type        : <0x8c0f4>
    <8bf94>   DW_AT_data_member_location: 192
 <2><8bf95>: Abbrev Number: 1 (DW_TAG_member)
    <8bf96>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8bf9a>   DW_AT_decl_file   : 6
    <8bf9b>   DW_AT_decl_line   : 174
    <8bf9c>   DW_AT_decl_column : 15
    <8bf9d>   DW_AT_type        : <0x8b975>
    <8bfa1>   DW_AT_data_member_location: 200
 <2><8bfa2>: Abbrev Number: 1 (DW_TAG_member)
    <8bfa3>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <8bfa7>   DW_AT_decl_file   : 6
    <8bfa8>   DW_AT_decl_line   : 175
    <8bfa9>   DW_AT_decl_column : 6
    <8bfaa>   DW_AT_type        : <0x8b96e>
    <8bfae>   DW_AT_data_member_location: 204
 <2><8bfaf>: Abbrev Number: 0
 <1><8bfb0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8bfb1>   DW_AT_byte_size   : 8
    <8bfb1>   DW_AT_type        : <0x8b952>
 <1><8bfb5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8bfb6>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <8bfba>   DW_AT_byte_size   : 112
    <8bfbb>   DW_AT_decl_file   : 6
    <8bfbc>   DW_AT_decl_line   : 178
    <8bfbd>   DW_AT_decl_column : 16
    <8bfbe>   DW_AT_sibling     : <0x8c079>
 <2><8bfc2>: Abbrev Number: 1 (DW_TAG_member)
    <8bfc3>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <8bfc7>   DW_AT_decl_file   : 6
    <8bfc8>   DW_AT_decl_line   : 188
    <8bfc9>   DW_AT_decl_column : 8
    <8bfca>   DW_AT_type        : <0x8b988>
    <8bfce>   DW_AT_data_member_location: 0
 <2><8bfcf>: Abbrev Number: 1 (DW_TAG_member)
    <8bfd0>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <8bfd4>   DW_AT_decl_file   : 6
    <8bfd5>   DW_AT_decl_line   : 208
    <8bfd6>   DW_AT_decl_column : 8
    <8bfd7>   DW_AT_type        : <0x8c12d>
    <8bfdb>   DW_AT_data_member_location: 8
 <2><8bfdc>: Abbrev Number: 1 (DW_TAG_member)
    <8bfdd>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <8bfe1>   DW_AT_decl_file   : 6
    <8bfe2>   DW_AT_decl_line   : 222
    <8bfe3>   DW_AT_decl_column : 9
    <8bfe4>   DW_AT_type        : <0x8b9bb>
    <8bfe8>   DW_AT_data_member_location: 16
 <2><8bfe9>: Abbrev Number: 1 (DW_TAG_member)
    <8bfea>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <8bfee>   DW_AT_decl_file   : 6
    <8bfef>   DW_AT_decl_line   : 231
    <8bff0>   DW_AT_decl_column : 9
    <8bff1>   DW_AT_type        : <0x8b9bb>
    <8bff5>   DW_AT_data_member_location: 24
 <2><8bff6>: Abbrev Number: 1 (DW_TAG_member)
    <8bff7>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <8bffb>   DW_AT_decl_file   : 6
    <8bffc>   DW_AT_decl_line   : 239
    <8bffd>   DW_AT_decl_column : 9
    <8bffe>   DW_AT_type        : <0x8b9bb>
    <8c002>   DW_AT_data_member_location: 32
 <2><8c003>: Abbrev Number: 1 (DW_TAG_member)
    <8c004>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <8c008>   DW_AT_decl_file   : 6
    <8c009>   DW_AT_decl_line   : 248
    <8c00a>   DW_AT_decl_column : 9
    <8c00b>   DW_AT_type        : <0x8c14c>
    <8c00f>   DW_AT_data_member_location: 40
 <2><8c010>: Abbrev Number: 6 (DW_TAG_member)
    <8c011>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <8c015>   DW_AT_decl_file   : 6
    <8c015>   DW_AT_decl_line   : 258
    <8c017>   DW_AT_decl_column : 9
    <8c018>   DW_AT_type        : <0x8b9bb>
    <8c01c>   DW_AT_data_member_location: 48
 <2><8c01d>: Abbrev Number: 6 (DW_TAG_member)
    <8c01e>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <8c022>   DW_AT_decl_file   : 6
    <8c022>   DW_AT_decl_line   : 274
    <8c024>   DW_AT_decl_column : 8
    <8c025>   DW_AT_type        : <0x8bab2>
    <8c029>   DW_AT_data_member_location: 56
 <2><8c02a>: Abbrev Number: 6 (DW_TAG_member)
    <8c02b>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <8c02f>   DW_AT_decl_file   : 6
    <8c02f>   DW_AT_decl_line   : 285
    <8c031>   DW_AT_decl_column : 9
    <8c032>   DW_AT_type        : <0x8c14c>
    <8c036>   DW_AT_data_member_location: 64
 <2><8c037>: Abbrev Number: 6 (DW_TAG_member)
    <8c038>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <8c03c>   DW_AT_decl_file   : 6
    <8c03c>   DW_AT_decl_line   : 293
    <8c03e>   DW_AT_decl_column : 9
    <8c03f>   DW_AT_type        : <0x8c15c>
    <8c043>   DW_AT_data_member_location: 72
 <2><8c044>: Abbrev Number: 6 (DW_TAG_member)
    <8c045>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <8c049>   DW_AT_decl_file   : 6
    <8c049>   DW_AT_decl_line   : 301
    <8c04b>   DW_AT_decl_column : 8
    <8c04c>   DW_AT_type        : <0x8ba94>
    <8c050>   DW_AT_data_member_location: 80
 <2><8c051>: Abbrev Number: 6 (DW_TAG_member)
    <8c052>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <8c056>   DW_AT_decl_file   : 6
    <8c056>   DW_AT_decl_line   : 314
    <8c058>   DW_AT_decl_column : 9
    <8c059>   DW_AT_type        : <0x8c175>
    <8c05d>   DW_AT_data_member_location: 88
 <2><8c05e>: Abbrev Number: 6 (DW_TAG_member)
    <8c05f>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <8c063>   DW_AT_decl_file   : 6
    <8c063>   DW_AT_decl_line   : 321
    <8c065>   DW_AT_decl_column : 9
    <8c066>   DW_AT_type        : <0x8b9bb>
    <8c06a>   DW_AT_data_member_location: 96
 <2><8c06b>: Abbrev Number: 6 (DW_TAG_member)
    <8c06c>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <8c070>   DW_AT_decl_file   : 6
    <8c070>   DW_AT_decl_line   : 328
    <8c072>   DW_AT_decl_column : 9
    <8c073>   DW_AT_type        : <0x8b9bb>
    <8c077>   DW_AT_data_member_location: 104
 <2><8c078>: Abbrev Number: 0
 <1><8c079>: Abbrev Number: 9 (DW_TAG_const_type)
    <8c07a>   DW_AT_type        : <0x8bfb5>
 <1><8c07e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c07f>   DW_AT_byte_size   : 8
    <8c07f>   DW_AT_type        : <0x8c079>
 <1><8c083>: Abbrev Number: 26 (DW_TAG_structure_type)
    <8c084>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <8c088>   DW_AT_byte_size   : 16
    <8c088>   DW_AT_decl_file   : 6
    <8c088>   DW_AT_decl_line   : 331
    <8c08a>   DW_AT_decl_column : 16
    <8c08a>   DW_AT_sibling     : <0x8c0a9>
 <2><8c08e>: Abbrev Number: 6 (DW_TAG_member)
    <8c08f>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <8c093>   DW_AT_decl_file   : 6
    <8c093>   DW_AT_decl_line   : 333
    <8c095>   DW_AT_decl_column : 12
    <8c096>   DW_AT_type        : <0x8b97a>
    <8c09a>   DW_AT_data_member_location: 0
 <2><8c09b>: Abbrev Number: 6 (DW_TAG_member)
    <8c09c>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8c0a0>   DW_AT_decl_file   : 6
    <8c0a0>   DW_AT_decl_line   : 334
    <8c0a2>   DW_AT_decl_column : 23
    <8c0a3>   DW_AT_type        : <0x8c17a>
    <8c0a7>   DW_AT_data_member_location: 8
 <2><8c0a8>: Abbrev Number: 0
 <1><8c0a9>: Abbrev Number: 9 (DW_TAG_const_type)
    <8c0aa>   DW_AT_type        : <0x8c083>
 <1><8c0ae>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c0af>   DW_AT_byte_size   : 8
    <8c0af>   DW_AT_type        : <0x8c0a9>
 <1><8c0b3>: Abbrev Number: 26 (DW_TAG_structure_type)
    <8c0b4>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <8c0b8>   DW_AT_byte_size   : 16
    <8c0b8>   DW_AT_decl_file   : 6
    <8c0b8>   DW_AT_decl_line   : 337
    <8c0ba>   DW_AT_decl_column : 16
    <8c0ba>   DW_AT_sibling     : <0x8c0e0>
 <2><8c0be>: Abbrev Number: 27 (DW_TAG_member)
    <8c0bf>   DW_AT_name        : w
    <8c0c1>   DW_AT_decl_file   : 6
    <8c0c1>   DW_AT_decl_line   : 339
    <8c0c3>   DW_AT_decl_column : 15
    <8c0c3>   DW_AT_type        : <0x8b97a>
    <8c0c7>   DW_AT_data_member_location: 0
 <2><8c0c8>: Abbrev Number: 27 (DW_TAG_member)
    <8c0c9>   DW_AT_name        : h
    <8c0cb>   DW_AT_decl_file   : 6
    <8c0cb>   DW_AT_decl_line   : 340
    <8c0cd>   DW_AT_decl_column : 15
    <8c0cd>   DW_AT_type        : <0x8b97a>
    <8c0d1>   DW_AT_data_member_location: 4
 <2><8c0d2>: Abbrev Number: 6 (DW_TAG_member)
    <8c0d3>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8c0d7>   DW_AT_decl_file   : 6
    <8c0d7>   DW_AT_decl_line   : 341
    <8c0d9>   DW_AT_decl_column : 23
    <8c0da>   DW_AT_type        : <0x8c17a>
    <8c0de>   DW_AT_data_member_location: 8
 <2><8c0df>: Abbrev Number: 0
 <1><8c0e0>: Abbrev Number: 9 (DW_TAG_const_type)
    <8c0e1>   DW_AT_type        : <0x8c0b3>
 <1><8c0e5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c0e6>   DW_AT_byte_size   : 8
    <8c0e6>   DW_AT_type        : <0x8c0e0>
 <1><8c0ea>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c0eb>   DW_AT_byte_size   : 8
    <8c0eb>   DW_AT_type        : <0x8c0ef>
 <1><8c0ef>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c0f0>   DW_AT_byte_size   : 8
    <8c0f0>   DW_AT_type        : <0x8bde1>
 <1><8c0f4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c0f5>   DW_AT_byte_size   : 8
    <8c0f5>   DW_AT_type        : <0x8b9cf>
 <1><8c0f9>: Abbrev Number: 8 (DW_TAG_typedef)
    <8c0fa>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <8c0fe>   DW_AT_decl_file   : 6
    <8c0ff>   DW_AT_decl_line   : 176
    <8c100>   DW_AT_decl_column : 3
    <8c101>   DW_AT_type        : <0x8bded>
 <1><8c105>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8c106>   DW_AT_prototyped  : 1
    <8c106>   DW_AT_type        : <0x8b96e>
    <8c10a>   DW_AT_sibling     : <0x8c12d>
 <2><8c10e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c10f>   DW_AT_type        : <0x8b988>
 <2><8c113>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c114>   DW_AT_type        : <0x8b96e>
 <2><8c118>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c119>   DW_AT_type        : <0x8b96e>
 <2><8c11d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c11e>   DW_AT_type        : <0x8b96e>
 <2><8c122>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c123>   DW_AT_type        : <0x8b96e>
 <2><8c127>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c128>   DW_AT_type        : <0x8b96e>
 <2><8c12c>: Abbrev Number: 0
 <1><8c12d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c12e>   DW_AT_byte_size   : 8
    <8c12e>   DW_AT_type        : <0x8c105>
 <1><8c132>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <8c133>   DW_AT_prototyped  : 1
    <8c133>   DW_AT_sibling     : <0x8c14c>
 <2><8c137>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c138>   DW_AT_type        : <0x8b96e>
 <2><8c13c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c13d>   DW_AT_type        : <0x8b96e>
 <2><8c141>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c142>   DW_AT_type        : <0x8b96e>
 <2><8c146>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c147>   DW_AT_type        : <0x8b96e>
 <2><8c14b>: Abbrev Number: 0
 <1><8c14c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c14d>   DW_AT_byte_size   : 8
    <8c14d>   DW_AT_type        : <0x8c132>
 <1><8c151>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <8c152>   DW_AT_prototyped  : 1
    <8c152>   DW_AT_sibling     : <0x8c15c>
 <2><8c156>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c157>   DW_AT_type        : <0x8b988>
 <2><8c15b>: Abbrev Number: 0
 <1><8c15c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c15d>   DW_AT_byte_size   : 8
    <8c15d>   DW_AT_type        : <0x8c151>
 <1><8c161>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <8c162>   DW_AT_prototyped  : 1
    <8c162>   DW_AT_type        : <0x8baad>
    <8c166>   DW_AT_sibling     : <0x8c175>
 <2><8c16a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c16b>   DW_AT_type        : <0x8b96e>
 <2><8c16f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c170>   DW_AT_type        : <0x8baad>
 <2><8c174>: Abbrev Number: 0
 <1><8c175>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c176>   DW_AT_byte_size   : 8
    <8c176>   DW_AT_type        : <0x8c161>
 <1><8c17a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c17b>   DW_AT_byte_size   : 8
    <8c17b>   DW_AT_type        : <0x8b946>
 <1><8c17f>: Abbrev Number: 24 (DW_TAG_typedef)
    <8c180>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <8c184>   DW_AT_decl_file   : 6
    <8c185>   DW_AT_decl_line   : 342
    <8c187>   DW_AT_decl_column : 3
    <8c188>   DW_AT_type        : <0x8c0b3>
 <1><8c18c>: Abbrev Number: 9 (DW_TAG_const_type)
    <8c18d>   DW_AT_type        : <0x8c17f>
 <1><8c191>: Abbrev Number: 28 (DW_TAG_variable)
    <8c192>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <8c196>   DW_AT_decl_file   : 6
    <8c196>   DW_AT_decl_line   : 364
    <8c198>   DW_AT_decl_column : 15
    <8c199>   DW_AT_type        : <0x8c19d>
    <8c19d>   DW_AT_external    : 1
    <8c19d>   DW_AT_declaration : 1
 <1><8c19d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c19e>   DW_AT_byte_size   : 8
    <8c19e>   DW_AT_type        : <0x8c0f9>
 <1><8c1a2>: Abbrev Number: 36 (DW_TAG_enumeration_type)
    <8c1a3>   DW_AT_encoding    : 7	(unsigned)
    <8c1a4>   DW_AT_byte_size   : 4
    <8c1a5>   DW_AT_type        : <0x8b952>
    <8c1a9>   DW_AT_decl_file   : 6
    <8c1aa>   DW_AT_decl_line   : 376
    <8c1ac>   DW_AT_decl_column : 6
    <8c1ad>   DW_AT_sibling     : <0x8c1ca>
 <2><8c1b1>: Abbrev Number: 15 (DW_TAG_enumerator)
    <8c1b2>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <8c1b6>   DW_AT_const_value : 0
 <2><8c1b7>: Abbrev Number: 15 (DW_TAG_enumerator)
    <8c1b8>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <8c1bc>   DW_AT_const_value : 1
 <2><8c1bd>: Abbrev Number: 15 (DW_TAG_enumerator)
    <8c1be>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <8c1c2>   DW_AT_const_value : 2
 <2><8c1c3>: Abbrev Number: 15 (DW_TAG_enumerator)
    <8c1c4>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <8c1c8>   DW_AT_const_value : 3
 <2><8c1c9>: Abbrev Number: 0
 <1><8c1ca>: Abbrev Number: 19 (DW_TAG_array_type)
    <8c1cb>   DW_AT_type        : <0x8c18c>
    <8c1cf>   DW_AT_sibling     : <0x8c1da>
 <2><8c1d3>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <8c1d4>   DW_AT_type        : <0x8b959>
    <8c1d8>   DW_AT_upper_bound : 2
 <2><8c1d9>: Abbrev Number: 0
 <1><8c1da>: Abbrev Number: 9 (DW_TAG_const_type)
    <8c1db>   DW_AT_type        : <0x8c1ca>
 <1><8c1df>: Abbrev Number: 28 (DW_TAG_variable)
    <8c1e0>   DW_AT_name        : (indirect string, offset: 0x183d0): __fb_font
    <8c1e4>   DW_AT_decl_file   : 6
    <8c1e4>   DW_AT_decl_line   : 392
    <8c1e6>   DW_AT_decl_column : 19
    <8c1e7>   DW_AT_type        : <0x8c1da>
    <8c1eb>   DW_AT_external    : 1
    <8c1eb>   DW_AT_declaration : 1
 <1><8c1eb>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8c1ec>   DW_AT_external    : 1
    <8c1ec>   DW_AT_name        : (indirect string, offset: 0x182e6): fb_GfxClear
    <8c1f0>   DW_AT_decl_file   : 6
    <8c1f0>   DW_AT_decl_line   : 495
    <8c1f2>   DW_AT_decl_column : 6
    <8c1f3>   DW_AT_prototyped  : 1
    <8c1f3>   DW_AT_declaration : 1
    <8c1f3>   DW_AT_sibling     : <0x8c1fd>
 <2><8c1f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c1f8>   DW_AT_type        : <0x8b96e>
 <2><8c1fc>: Abbrev Number: 0
 <1><8c1fd>: Abbrev Number: 37 (DW_TAG_subprogram)
    <8c1fe>   DW_AT_external    : 1
    <8c1fe>   DW_AT_name        : (indirect string, offset: 0x1851f): fb_ConsoleView
    <8c202>   DW_AT_decl_file   : 7
    <8c203>   DW_AT_decl_line   : 62
    <8c204>   DW_AT_decl_column : 21
    <8c205>   DW_AT_prototyped  : 1
    <8c205>   DW_AT_type        : <0x8b96e>
    <8c209>   DW_AT_declaration : 1
    <8c209>   DW_AT_sibling     : <0x8c218>
 <2><8c20d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c20e>   DW_AT_type        : <0x8b96e>
 <2><8c212>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c213>   DW_AT_type        : <0x8b96e>
 <2><8c217>: Abbrev Number: 0
 <1><8c218>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8c219>   DW_AT_external    : 1
    <8c219>   DW_AT_name        : (indirect string, offset: 0x18514): fb_GfxView
    <8c21d>   DW_AT_decl_file   : 6
    <8c21d>   DW_AT_decl_line   : 457
    <8c21f>   DW_AT_decl_column : 20
    <8c220>   DW_AT_prototyped  : 1
    <8c220>   DW_AT_declaration : 1
    <8c220>   DW_AT_sibling     : <0x8c248>
 <2><8c224>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c225>   DW_AT_type        : <0x8b96e>
 <2><8c229>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c22a>   DW_AT_type        : <0x8b96e>
 <2><8c22e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c22f>   DW_AT_type        : <0x8b96e>
 <2><8c233>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c234>   DW_AT_type        : <0x8b96e>
 <2><8c238>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c239>   DW_AT_type        : <0x8b952>
 <2><8c23d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c23e>   DW_AT_type        : <0x8b952>
 <2><8c242>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c243>   DW_AT_type        : <0x8b96e>
 <2><8c247>: Abbrev Number: 0
 <1><8c248>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8c249>   DW_AT_external    : 1
    <8c249>   DW_AT_name        : (indirect string, offset: 0x1833c): fb_hResetCharCells
    <8c24d>   DW_AT_decl_file   : 6
    <8c24d>   DW_AT_decl_line   : 419
    <8c24f>   DW_AT_decl_column : 13
    <8c250>   DW_AT_prototyped  : 1
    <8c250>   DW_AT_declaration : 1
    <8c250>   DW_AT_sibling     : <0x8c25f>
 <2><8c254>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c255>   DW_AT_type        : <0x8c25f>
 <2><8c259>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c25a>   DW_AT_type        : <0x8b96e>
 <2><8c25e>: Abbrev Number: 0
 <1><8c25f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c260>   DW_AT_byte_size   : 8
    <8c260>   DW_AT_type        : <0x8bda3>
 <1><8c264>: Abbrev Number: 38 (DW_TAG_subprogram)
    <8c265>   DW_AT_external    : 1
    <8c265>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <8c269>   DW_AT_decl_file   : 6
    <8c26a>   DW_AT_decl_line   : 396
    <8c26c>   DW_AT_decl_column : 19
    <8c26d>   DW_AT_prototyped  : 1
    <8c26d>   DW_AT_type        : <0x8c25f>
    <8c271>   DW_AT_declaration : 1
 <1><8c271>: Abbrev Number: 39 (DW_TAG_subprogram)
    <8c272>   DW_AT_external    : 1
    <8c272>   DW_AT_name        : (indirect string, offset: 0x18298): fb_GfxWidth
    <8c276>   DW_AT_decl_file   : 1
    <8c277>   DW_AT_decl_line   : 5
    <8c278>   DW_AT_decl_column : 5
    <8c279>   DW_AT_prototyped  : 1
    <8c279>   DW_AT_type        : <0x8b96e>
    <8c27d>   DW_AT_low_pc      : 0x461900
    <8c285>   DW_AT_high_pc     : 0x134
    <8c28d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8c28f>   DW_AT_call_all_calls: 1
    <8c28f>   DW_AT_sibling     : <0x8c38c>
 <2><8c293>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <8c294>   DW_AT_name        : w
    <8c296>   DW_AT_decl_file   : 1
    <8c296>   DW_AT_decl_line   : 5
    <8c296>   DW_AT_decl_column : 21
    <8c297>   DW_AT_type        : <0x8b96e>
    <8c29b>   DW_AT_location    : 0x2a9f6 (location list)
    <8c29f>   DW_AT_GNU_locviews: 0x2a9ec
 <2><8c2a3>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <8c2a4>   DW_AT_name        : h
    <8c2a6>   DW_AT_decl_file   : 1
    <8c2a6>   DW_AT_decl_line   : 5
    <8c2a6>   DW_AT_decl_column : 28
    <8c2a7>   DW_AT_type        : <0x8b96e>
    <8c2ab>   DW_AT_location    : 0x2aa20 (location list)
    <8c2af>   DW_AT_GNU_locviews: 0x2aa16
 <2><8c2b3>: Abbrev Number: 22 (DW_TAG_variable)
    <8c2b4>   DW_AT_name        : (indirect string, offset: 0x1852e): font_w
    <8c2b8>   DW_AT_decl_file   : 1
    <8c2b8>   DW_AT_decl_line   : 7
    <8c2b9>   DW_AT_decl_column : 6
    <8c2ba>   DW_AT_type        : <0x8b96e>
    <8c2be>   DW_AT_location    : 0x2aa4a (location list)
    <8c2c2>   DW_AT_GNU_locviews: 0x2aa44
 <2><8c2c6>: Abbrev Number: 22 (DW_TAG_variable)
    <8c2c7>   DW_AT_name        : (indirect string, offset: 0x18535): font_h
    <8c2cb>   DW_AT_decl_file   : 1
    <8c2cb>   DW_AT_decl_line   : 7
    <8c2cc>   DW_AT_decl_column : 14
    <8c2cd>   DW_AT_type        : <0x8b96e>
    <8c2d1>   DW_AT_location    : 0x2aa65 (location list)
    <8c2d5>   DW_AT_GNU_locviews: 0x2aa5f
 <2><8c2d9>: Abbrev Number: 22 (DW_TAG_variable)
    <8c2da>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <8c2de>   DW_AT_decl_file   : 1
    <8c2de>   DW_AT_decl_line   : 8
    <8c2df>   DW_AT_decl_column : 14
    <8c2e0>   DW_AT_type        : <0x8c38c>
    <8c2e4>   DW_AT_location    : 0x2aa80 (location list)
    <8c2e8>   DW_AT_GNU_locviews: 0x2aa7a
 <2><8c2ec>: Abbrev Number: 40 (DW_TAG_variable)
    <8c2ed>   DW_AT_name        : cur
    <8c2f1>   DW_AT_decl_file   : 1
    <8c2f2>   DW_AT_decl_line   : 9
    <8c2f3>   DW_AT_decl_column : 6
    <8c2f4>   DW_AT_type        : <0x8b96e>
    <8c2f8>   DW_AT_location    : 0x2aaa1 (location list)
    <8c2fc>   DW_AT_GNU_locviews: 0x2aa97
 <2><8c300>: Abbrev Number: 41 (DW_TAG_call_site)
    <8c301>   DW_AT_call_return_pc: 0x46199e
    <8c309>   DW_AT_call_origin : <0x8c264>
 <2><8c30d>: Abbrev Number: 23 (DW_TAG_call_site)
    <8c30e>   DW_AT_call_return_pc: 0x4619ab
    <8c316>   DW_AT_call_origin : <0x8c248>
    <8c31a>   DW_AT_sibling     : <0x8c324>
 <3><8c31e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c31f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8c321>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><8c323>: Abbrev Number: 0
 <2><8c324>: Abbrev Number: 23 (DW_TAG_call_site)
    <8c325>   DW_AT_call_return_pc: 0x4619d3
    <8c32d>   DW_AT_call_origin : <0x8c218>
    <8c331>   DW_AT_sibling     : <0x8c35c>
 <3><8c335>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c336>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8c338>   DW_AT_call_value  : 3 byte block: b 0 80 	(DW_OP_const2s: -32768)
 <3><8c33c>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c33d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8c33f>   DW_AT_call_value  : 3 byte block: b 0 80 	(DW_OP_const2s: -32768)
 <3><8c343>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c344>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <8c346>   DW_AT_call_value  : 3 byte block: b 0 80 	(DW_OP_const2s: -32768)
 <3><8c34a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c34b>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <8c34d>   DW_AT_call_value  : 3 byte block: b 0 80 	(DW_OP_const2s: -32768)
 <3><8c351>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c352>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <8c354>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8c356>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c357>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <8c359>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8c35b>: Abbrev Number: 0
 <2><8c35c>: Abbrev Number: 23 (DW_TAG_call_site)
    <8c35d>   DW_AT_call_return_pc: 0x4619dc
    <8c365>   DW_AT_call_origin : <0x8c1fd>
    <8c369>   DW_AT_sibling     : <0x8c378>
 <3><8c36d>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c36e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8c370>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8c372>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c373>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8c375>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8c377>: Abbrev Number: 0
 <2><8c378>: Abbrev Number: 42 (DW_TAG_call_site)
    <8c379>   DW_AT_call_return_pc: 0x4619e3
    <8c381>   DW_AT_call_origin : <0x8c1eb>
 <3><8c385>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <8c386>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8c388>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8c38a>: Abbrev Number: 0
 <2><8c38b>: Abbrev Number: 0
 <1><8c38c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8c38d>   DW_AT_byte_size   : 8
    <8c38d>   DW_AT_type        : <0x8c18c>
 <1><8c391>: Abbrev Number: 0
  Compilation Unit @ offset 0x8c392:
   Length:        0x5bca (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x57e7
   Pointer Size:  8
 <0><8c39e>: Abbrev Number: 68 (DW_TAG_compile_unit)
    <8c39f>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <8c3a3>   DW_AT_language    : 29	(C11)
    <8c3a4>   DW_AT_name        : (indirect line string, offset: 0x5c6): src/gfxlib2/unix/gfx_x11.c
    <8c3a8>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <8c3ac>   DW_AT_low_pc      : 0x461a40
    <8c3b4>   DW_AT_high_pc     : 0x2498
    <8c3bc>   DW_AT_stmt_list   : 0x58158
 <1><8c3c0>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3c1>   DW_AT_byte_size   : 8
    <8c3c2>   DW_AT_encoding    : 7	(unsigned)
    <8c3c3>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><8c3c7>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3c8>   DW_AT_byte_size   : 1
    <8c3c9>   DW_AT_encoding    : 8	(unsigned char)
    <8c3ca>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><8c3ce>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c3cf>   DW_AT_type        : <0x8c3c7>
 <1><8c3d3>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3d4>   DW_AT_byte_size   : 2
    <8c3d5>   DW_AT_encoding    : 7	(unsigned)
    <8c3d6>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><8c3da>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3db>   DW_AT_byte_size   : 4
    <8c3dc>   DW_AT_encoding    : 7	(unsigned)
    <8c3dd>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><8c3e1>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3e2>   DW_AT_byte_size   : 1
    <8c3e3>   DW_AT_encoding    : 6	(signed char)
    <8c3e4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><8c3e8>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c3e9>   DW_AT_byte_size   : 2
    <8c3ea>   DW_AT_encoding    : 5	(signed)
    <8c3eb>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><8c3ef>: Abbrev Number: 69 (DW_TAG_base_type)
    <8c3f0>   DW_AT_byte_size   : 4
    <8c3f1>   DW_AT_encoding    : 5	(signed)
    <8c3f2>   DW_AT_name        : int
 <1><8c3f6>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <8c3f7>   DW_AT_type        : <0x8c3ef>
 <1><8c3fb>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c3fc>   DW_AT_type        : <0x8c3ef>
 <1><8c400>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c401>   DW_AT_byte_size   : 8
    <8c402>   DW_AT_encoding    : 5	(signed)
    <8c403>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><8c407>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c408>   DW_AT_name        : (indirect string, offset: 0x194f0): __useconds_t
    <8c40c>   DW_AT_decl_file   : 2
    <8c40d>   DW_AT_decl_line   : 161
    <8c40e>   DW_AT_decl_column : 30
    <8c40f>   DW_AT_type        : <0x8c3da>
 <1><8c413>: Abbrev Number: 71 (DW_TAG_pointer_type)
    <8c414>   DW_AT_byte_size   : 8
 <1><8c415>: Abbrev Number: 35 (DW_TAG_restrict_type)
    <8c416>   DW_AT_type        : <0x8c413>
 <1><8c41a>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c41b>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <8c41f>   DW_AT_decl_file   : 2
    <8c420>   DW_AT_decl_line   : 194
    <8c421>   DW_AT_decl_column : 27
    <8c422>   DW_AT_type        : <0x8c400>
 <1><8c426>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c427>   DW_AT_byte_size   : 8
    <8c427>   DW_AT_type        : <0x8c42b>
 <1><8c42b>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c42c>   DW_AT_byte_size   : 1
    <8c42d>   DW_AT_encoding    : 6	(signed char)
    <8c42e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><8c432>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c433>   DW_AT_type        : <0x8c42b>
 <1><8c437>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c438>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <8c43c>   DW_AT_decl_file   : 3
    <8c43d>   DW_AT_decl_line   : 108
    <8c43e>   DW_AT_decl_column : 19
    <8c43f>   DW_AT_type        : <0x8c41a>
 <1><8c443>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c444>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <8c448>   DW_AT_decl_file   : 4
    <8c449>   DW_AT_decl_line   : 209
    <8c44a>   DW_AT_decl_column : 23
    <8c44b>   DW_AT_type        : <0x8c3c0>
 <1><8c44f>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c450>   DW_AT_name        : (indirect string, offset: 0x18e9a): __pthread_internal_list
    <8c454>   DW_AT_byte_size   : 16
    <8c455>   DW_AT_decl_file   : 5
    <8c456>   DW_AT_decl_line   : 49
    <8c457>   DW_AT_decl_column : 16
    <8c458>   DW_AT_sibling     : <0x8c477>
 <2><8c45c>: Abbrev Number: 4 (DW_TAG_member)
    <8c45d>   DW_AT_name        : (indirect string, offset: 0x18ed4): __prev
    <8c461>   DW_AT_decl_file   : 5
    <8c462>   DW_AT_decl_line   : 51
    <8c463>   DW_AT_decl_column : 35
    <8c464>   DW_AT_type        : <0x8c477>
    <8c468>   DW_AT_data_member_location: 0
 <2><8c469>: Abbrev Number: 4 (DW_TAG_member)
    <8c46a>   DW_AT_name        : (indirect string, offset: 0x190a3): __next
    <8c46e>   DW_AT_decl_file   : 5
    <8c46f>   DW_AT_decl_line   : 52
    <8c470>   DW_AT_decl_column : 35
    <8c471>   DW_AT_type        : <0x8c477>
    <8c475>   DW_AT_data_member_location: 8
 <2><8c476>: Abbrev Number: 0
 <1><8c477>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c478>   DW_AT_byte_size   : 8
    <8c478>   DW_AT_type        : <0x8c44f>
 <1><8c47c>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c47d>   DW_AT_name        : (indirect string, offset: 0x18905): __pthread_list_t
    <8c481>   DW_AT_decl_file   : 5
    <8c482>   DW_AT_decl_line   : 53
    <8c483>   DW_AT_decl_column : 3
    <8c484>   DW_AT_type        : <0x8c44f>
 <1><8c488>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c489>   DW_AT_name        : (indirect string, offset: 0x18599): __pthread_mutex_s
    <8c48d>   DW_AT_byte_size   : 40
    <8c48e>   DW_AT_decl_file   : 6
    <8c48f>   DW_AT_decl_line   : 22
    <8c490>   DW_AT_decl_column : 8
    <8c491>   DW_AT_sibling     : <0x8c4fe>
 <2><8c495>: Abbrev Number: 4 (DW_TAG_member)
    <8c496>   DW_AT_name        : (indirect string, offset: 0x188e1): __lock
    <8c49a>   DW_AT_decl_file   : 6
    <8c49b>   DW_AT_decl_line   : 24
    <8c49c>   DW_AT_decl_column : 7
    <8c49d>   DW_AT_type        : <0x8c3ef>
    <8c4a1>   DW_AT_data_member_location: 0
 <2><8c4a2>: Abbrev Number: 4 (DW_TAG_member)
    <8c4a3>   DW_AT_name        : (indirect string, offset: 0x18d03): __count
    <8c4a7>   DW_AT_decl_file   : 6
    <8c4a8>   DW_AT_decl_line   : 25
    <8c4a9>   DW_AT_decl_column : 16
    <8c4aa>   DW_AT_type        : <0x8c3da>
    <8c4ae>   DW_AT_data_member_location: 4
 <2><8c4af>: Abbrev Number: 4 (DW_TAG_member)
    <8c4b0>   DW_AT_name        : (indirect string, offset: 0x1885e): __owner
    <8c4b4>   DW_AT_decl_file   : 6
    <8c4b5>   DW_AT_decl_line   : 26
    <8c4b6>   DW_AT_decl_column : 7
    <8c4b7>   DW_AT_type        : <0x8c3ef>
    <8c4bb>   DW_AT_data_member_location: 8
 <2><8c4bc>: Abbrev Number: 4 (DW_TAG_member)
    <8c4bd>   DW_AT_name        : (indirect string, offset: 0x1952e): __nusers
    <8c4c1>   DW_AT_decl_file   : 6
    <8c4c2>   DW_AT_decl_line   : 28
    <8c4c3>   DW_AT_decl_column : 16
    <8c4c4>   DW_AT_type        : <0x8c3da>
    <8c4c8>   DW_AT_data_member_location: 12
 <2><8c4c9>: Abbrev Number: 4 (DW_TAG_member)
    <8c4ca>   DW_AT_name        : (indirect string, offset: 0x18b54): __kind
    <8c4ce>   DW_AT_decl_file   : 6
    <8c4cf>   DW_AT_decl_line   : 32
    <8c4d0>   DW_AT_decl_column : 7
    <8c4d1>   DW_AT_type        : <0x8c3ef>
    <8c4d5>   DW_AT_data_member_location: 16
 <2><8c4d6>: Abbrev Number: 4 (DW_TAG_member)
    <8c4d7>   DW_AT_name        : (indirect string, offset: 0x1950b): __spins
    <8c4db>   DW_AT_decl_file   : 6
    <8c4dc>   DW_AT_decl_line   : 34
    <8c4dd>   DW_AT_decl_column : 9
    <8c4de>   DW_AT_type        : <0x8c3e8>
    <8c4e2>   DW_AT_data_member_location: 20
 <2><8c4e3>: Abbrev Number: 4 (DW_TAG_member)
    <8c4e4>   DW_AT_name        : (indirect string, offset: 0x19127): __elision
    <8c4e8>   DW_AT_decl_file   : 6
    <8c4e9>   DW_AT_decl_line   : 35
    <8c4ea>   DW_AT_decl_column : 9
    <8c4eb>   DW_AT_type        : <0x8c3e8>
    <8c4ef>   DW_AT_data_member_location: 22
 <2><8c4f0>: Abbrev Number: 4 (DW_TAG_member)
    <8c4f1>   DW_AT_name        : (indirect string, offset: 0x1985e): __list
    <8c4f5>   DW_AT_decl_file   : 6
    <8c4f6>   DW_AT_decl_line   : 36
    <8c4f7>   DW_AT_decl_column : 20
    <8c4f8>   DW_AT_type        : <0x8c47c>
    <8c4fc>   DW_AT_data_member_location: 24
 <2><8c4fd>: Abbrev Number: 0
 <1><8c4fe>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8c4ff>   DW_AT_byte_size   : 8
    <8c500>   DW_AT_decl_file   : 5
    <8c501>   DW_AT_decl_line   : 97
    <8c502>   DW_AT_decl_column : 5
    <8c503>   DW_AT_sibling     : <0x8c522>
 <2><8c507>: Abbrev Number: 4 (DW_TAG_member)
    <8c508>   DW_AT_name        : (indirect string, offset: 0x1960c): __low
    <8c50c>   DW_AT_decl_file   : 5
    <8c50d>   DW_AT_decl_line   : 99
    <8c50e>   DW_AT_decl_column : 20
    <8c50f>   DW_AT_type        : <0x8c3da>
    <8c513>   DW_AT_data_member_location: 0
 <2><8c514>: Abbrev Number: 4 (DW_TAG_member)
    <8c515>   DW_AT_name        : (indirect string, offset: 0x195e0): __high
    <8c519>   DW_AT_decl_file   : 5
    <8c51a>   DW_AT_decl_line   : 100
    <8c51b>   DW_AT_decl_column : 20
    <8c51c>   DW_AT_type        : <0x8c3da>
    <8c520>   DW_AT_data_member_location: 4
 <2><8c521>: Abbrev Number: 0
 <1><8c522>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c523>   DW_AT_byte_size   : 8
    <8c524>   DW_AT_decl_file   : 5
    <8c525>   DW_AT_decl_line   : 94
    <8c526>   DW_AT_decl_column : 17
    <8c527>   DW_AT_sibling     : <0x8c544>
 <2><8c52b>: Abbrev Number: 17 (DW_TAG_member)
    <8c52c>   DW_AT_name        : (indirect string, offset: 0x19981): __wseq
    <8c530>   DW_AT_decl_file   : 5
    <8c531>   DW_AT_decl_line   : 96
    <8c532>   DW_AT_decl_column : 42
    <8c533>   DW_AT_type        : <0x8c544>
 <2><8c537>: Abbrev Number: 17 (DW_TAG_member)
    <8c538>   DW_AT_name        : (indirect string, offset: 0x1931e): __wseq32
    <8c53c>   DW_AT_decl_file   : 5
    <8c53d>   DW_AT_decl_line   : 101
    <8c53e>   DW_AT_decl_column : 7
    <8c53f>   DW_AT_type        : <0x8c4fe>
 <2><8c543>: Abbrev Number: 0
 <1><8c544>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c545>   DW_AT_byte_size   : 8
    <8c546>   DW_AT_encoding    : 7	(unsigned)
    <8c547>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><8c54b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8c54c>   DW_AT_byte_size   : 8
    <8c54d>   DW_AT_decl_file   : 5
    <8c54e>   DW_AT_decl_line   : 106
    <8c54f>   DW_AT_decl_column : 5
    <8c550>   DW_AT_sibling     : <0x8c56f>
 <2><8c554>: Abbrev Number: 4 (DW_TAG_member)
    <8c555>   DW_AT_name        : (indirect string, offset: 0x1960c): __low
    <8c559>   DW_AT_decl_file   : 5
    <8c55a>   DW_AT_decl_line   : 108
    <8c55b>   DW_AT_decl_column : 20
    <8c55c>   DW_AT_type        : <0x8c3da>
    <8c560>   DW_AT_data_member_location: 0
 <2><8c561>: Abbrev Number: 4 (DW_TAG_member)
    <8c562>   DW_AT_name        : (indirect string, offset: 0x195e0): __high
    <8c566>   DW_AT_decl_file   : 5
    <8c567>   DW_AT_decl_line   : 109
    <8c568>   DW_AT_decl_column : 20
    <8c569>   DW_AT_type        : <0x8c3da>
    <8c56d>   DW_AT_data_member_location: 4
 <2><8c56e>: Abbrev Number: 0
 <1><8c56f>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c570>   DW_AT_byte_size   : 8
    <8c571>   DW_AT_decl_file   : 5
    <8c572>   DW_AT_decl_line   : 103
    <8c573>   DW_AT_decl_column : 17
    <8c574>   DW_AT_sibling     : <0x8c591>
 <2><8c578>: Abbrev Number: 17 (DW_TAG_member)
    <8c579>   DW_AT_name        : (indirect string, offset: 0x18b5b): __g1_start
    <8c57d>   DW_AT_decl_file   : 5
    <8c57e>   DW_AT_decl_line   : 105
    <8c57f>   DW_AT_decl_column : 42
    <8c580>   DW_AT_type        : <0x8c544>
 <2><8c584>: Abbrev Number: 17 (DW_TAG_member)
    <8c585>   DW_AT_name        : (indirect string, offset: 0x19131): __g1_start32
    <8c589>   DW_AT_decl_file   : 5
    <8c58a>   DW_AT_decl_line   : 110
    <8c58b>   DW_AT_decl_column : 7
    <8c58c>   DW_AT_type        : <0x8c54b>
 <2><8c590>: Abbrev Number: 0
 <1><8c591>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c592>   DW_AT_name        : (indirect string, offset: 0x19a69): __pthread_cond_s
    <8c596>   DW_AT_byte_size   : 48
    <8c597>   DW_AT_decl_file   : 5
    <8c598>   DW_AT_decl_line   : 92
    <8c599>   DW_AT_decl_column : 8
    <8c59a>   DW_AT_sibling     : <0x8c5ec>
 <2><8c59e>: Abbrev Number: 45 (DW_TAG_member)
    <8c59f>   DW_AT_type        : <0x8c522>
    <8c5a3>   DW_AT_data_member_location: 0
 <2><8c5a4>: Abbrev Number: 45 (DW_TAG_member)
    <8c5a5>   DW_AT_type        : <0x8c56f>
    <8c5a9>   DW_AT_data_member_location: 8
 <2><8c5aa>: Abbrev Number: 4 (DW_TAG_member)
    <8c5ab>   DW_AT_name        : (indirect string, offset: 0x18ced): __g_refs
    <8c5af>   DW_AT_decl_file   : 5
    <8c5b0>   DW_AT_decl_line   : 112
    <8c5b1>   DW_AT_decl_column : 16
    <8c5b2>   DW_AT_type        : <0x8c5ec>
    <8c5b6>   DW_AT_data_member_location: 16
 <2><8c5b7>: Abbrev Number: 4 (DW_TAG_member)
    <8c5b8>   DW_AT_name        : (indirect string, offset: 0x19178): __g_size
    <8c5bc>   DW_AT_decl_file   : 5
    <8c5bd>   DW_AT_decl_line   : 113
    <8c5be>   DW_AT_decl_column : 16
    <8c5bf>   DW_AT_type        : <0x8c5ec>
    <8c5c3>   DW_AT_data_member_location: 24
 <2><8c5c4>: Abbrev Number: 4 (DW_TAG_member)
    <8c5c5>   DW_AT_name        : (indirect string, offset: 0x18bc5): __g1_orig_size
    <8c5c9>   DW_AT_decl_file   : 5
    <8c5ca>   DW_AT_decl_line   : 114
    <8c5cb>   DW_AT_decl_column : 16
    <8c5cc>   DW_AT_type        : <0x8c3da>
    <8c5d0>   DW_AT_data_member_location: 32
 <2><8c5d1>: Abbrev Number: 4 (DW_TAG_member)
    <8c5d2>   DW_AT_name        : (indirect string, offset: 0x18d8c): __wrefs
    <8c5d6>   DW_AT_decl_file   : 5
    <8c5d7>   DW_AT_decl_line   : 115
    <8c5d8>   DW_AT_decl_column : 16
    <8c5d9>   DW_AT_type        : <0x8c3da>
    <8c5dd>   DW_AT_data_member_location: 36
 <2><8c5de>: Abbrev Number: 4 (DW_TAG_member)
    <8c5df>   DW_AT_name        : (indirect string, offset: 0x19718): __g_signals
    <8c5e3>   DW_AT_decl_file   : 5
    <8c5e4>   DW_AT_decl_line   : 116
    <8c5e5>   DW_AT_decl_column : 16
    <8c5e6>   DW_AT_type        : <0x8c5ec>
    <8c5ea>   DW_AT_data_member_location: 40
 <2><8c5eb>: Abbrev Number: 0
 <1><8c5ec>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c5ed>   DW_AT_type        : <0x8c3da>
    <8c5f1>   DW_AT_sibling     : <0x8c5fc>
 <2><8c5f5>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c5f6>   DW_AT_type        : <0x8c3c0>
    <8c5fa>   DW_AT_upper_bound : 1
 <2><8c5fb>: Abbrev Number: 0
 <1><8c5fc>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c5fd>   DW_AT_name        : (indirect string, offset: 0x18786): pthread_t
    <8c601>   DW_AT_decl_file   : 7
    <8c602>   DW_AT_decl_line   : 27
    <8c603>   DW_AT_decl_column : 27
    <8c604>   DW_AT_type        : <0x8c3c0>
 <1><8c608>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c609>   DW_AT_byte_size   : 4
    <8c60a>   DW_AT_decl_file   : 7
    <8c60b>   DW_AT_decl_line   : 32
    <8c60c>   DW_AT_decl_column : 9
    <8c60d>   DW_AT_sibling     : <0x8c62a>
 <2><8c611>: Abbrev Number: 17 (DW_TAG_member)
    <8c612>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <8c616>   DW_AT_decl_file   : 7
    <8c617>   DW_AT_decl_line   : 34
    <8c618>   DW_AT_decl_column : 8
    <8c619>   DW_AT_type        : <0x8c62a>
 <2><8c61d>: Abbrev Number: 17 (DW_TAG_member)
    <8c61e>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <8c622>   DW_AT_decl_file   : 7
    <8c623>   DW_AT_decl_line   : 35
    <8c624>   DW_AT_decl_column : 7
    <8c625>   DW_AT_type        : <0x8c3ef>
 <2><8c629>: Abbrev Number: 0
 <1><8c62a>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c62b>   DW_AT_type        : <0x8c42b>
    <8c62f>   DW_AT_sibling     : <0x8c63a>
 <2><8c633>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c634>   DW_AT_type        : <0x8c3c0>
    <8c638>   DW_AT_upper_bound : 3
 <2><8c639>: Abbrev Number: 0
 <1><8c63a>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c63b>   DW_AT_name        : (indirect string, offset: 0x190d8): pthread_mutexattr_t
    <8c63f>   DW_AT_decl_file   : 7
    <8c640>   DW_AT_decl_line   : 36
    <8c641>   DW_AT_decl_column : 3
    <8c642>   DW_AT_type        : <0x8c608>
 <1><8c646>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c647>   DW_AT_type        : <0x8c63a>
 <1><8c64b>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c64c>   DW_AT_byte_size   : 4
    <8c64d>   DW_AT_decl_file   : 7
    <8c64e>   DW_AT_decl_line   : 41
    <8c64f>   DW_AT_decl_column : 9
    <8c650>   DW_AT_sibling     : <0x8c66d>
 <2><8c654>: Abbrev Number: 17 (DW_TAG_member)
    <8c655>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <8c659>   DW_AT_decl_file   : 7
    <8c65a>   DW_AT_decl_line   : 43
    <8c65b>   DW_AT_decl_column : 8
    <8c65c>   DW_AT_type        : <0x8c62a>
 <2><8c660>: Abbrev Number: 17 (DW_TAG_member)
    <8c661>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <8c665>   DW_AT_decl_file   : 7
    <8c666>   DW_AT_decl_line   : 44
    <8c667>   DW_AT_decl_column : 7
    <8c668>   DW_AT_type        : <0x8c3ef>
 <2><8c66c>: Abbrev Number: 0
 <1><8c66d>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c66e>   DW_AT_name        : (indirect string, offset: 0x185dc): pthread_condattr_t
    <8c672>   DW_AT_decl_file   : 7
    <8c673>   DW_AT_decl_line   : 45
    <8c674>   DW_AT_decl_column : 3
    <8c675>   DW_AT_type        : <0x8c64b>
 <1><8c679>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c67a>   DW_AT_type        : <0x8c66d>
 <1><8c67e>: Abbrev Number: 72 (DW_TAG_union_type)
    <8c67f>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <8c683>   DW_AT_byte_size   : 56
    <8c684>   DW_AT_decl_file   : 7
    <8c685>   DW_AT_decl_line   : 56
    <8c686>   DW_AT_decl_column : 7
    <8c687>   DW_AT_sibling     : <0x8c6a4>
 <2><8c68b>: Abbrev Number: 17 (DW_TAG_member)
    <8c68c>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <8c690>   DW_AT_decl_file   : 7
    <8c691>   DW_AT_decl_line   : 58
    <8c692>   DW_AT_decl_column : 8
    <8c693>   DW_AT_type        : <0x8c6a4>
 <2><8c697>: Abbrev Number: 17 (DW_TAG_member)
    <8c698>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <8c69c>   DW_AT_decl_file   : 7
    <8c69d>   DW_AT_decl_line   : 59
    <8c69e>   DW_AT_decl_column : 12
    <8c69f>   DW_AT_type        : <0x8c400>
 <2><8c6a3>: Abbrev Number: 0
 <1><8c6a4>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c6a5>   DW_AT_type        : <0x8c42b>
    <8c6a9>   DW_AT_sibling     : <0x8c6b4>
 <2><8c6ad>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c6ae>   DW_AT_type        : <0x8c3c0>
    <8c6b2>   DW_AT_upper_bound : 55
 <2><8c6b3>: Abbrev Number: 0
 <1><8c6b4>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c6b5>   DW_AT_name        : (indirect string, offset: 0x1990d): pthread_attr_t
    <8c6b9>   DW_AT_decl_file   : 7
    <8c6ba>   DW_AT_decl_line   : 62
    <8c6bb>   DW_AT_decl_column : 30
    <8c6bc>   DW_AT_type        : <0x8c67e>
 <1><8c6c0>: Abbrev Number: 30 (DW_TAG_const_type)
    <8c6c1>   DW_AT_type        : <0x8c6b4>
 <1><8c6c5>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c6c6>   DW_AT_byte_size   : 40
    <8c6c7>   DW_AT_decl_file   : 7
    <8c6c8>   DW_AT_decl_line   : 67
    <8c6c9>   DW_AT_decl_column : 9
    <8c6ca>   DW_AT_sibling     : <0x8c6f3>
 <2><8c6ce>: Abbrev Number: 17 (DW_TAG_member)
    <8c6cf>   DW_AT_name        : (indirect string, offset: 0x18a56): __data
    <8c6d3>   DW_AT_decl_file   : 7
    <8c6d4>   DW_AT_decl_line   : 69
    <8c6d5>   DW_AT_decl_column : 28
    <8c6d6>   DW_AT_type        : <0x8c488>
 <2><8c6da>: Abbrev Number: 17 (DW_TAG_member)
    <8c6db>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <8c6df>   DW_AT_decl_file   : 7
    <8c6e0>   DW_AT_decl_line   : 70
    <8c6e1>   DW_AT_decl_column : 8
    <8c6e2>   DW_AT_type        : <0x8c6f3>
 <2><8c6e6>: Abbrev Number: 17 (DW_TAG_member)
    <8c6e7>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <8c6eb>   DW_AT_decl_file   : 7
    <8c6ec>   DW_AT_decl_line   : 71
    <8c6ed>   DW_AT_decl_column : 12
    <8c6ee>   DW_AT_type        : <0x8c400>
 <2><8c6f2>: Abbrev Number: 0
 <1><8c6f3>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c6f4>   DW_AT_type        : <0x8c42b>
    <8c6f8>   DW_AT_sibling     : <0x8c703>
 <2><8c6fc>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c6fd>   DW_AT_type        : <0x8c3c0>
    <8c701>   DW_AT_upper_bound : 39
 <2><8c702>: Abbrev Number: 0
 <1><8c703>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c704>   DW_AT_name        : (indirect string, offset: 0x18a90): pthread_mutex_t
    <8c708>   DW_AT_decl_file   : 7
    <8c709>   DW_AT_decl_line   : 72
    <8c70a>   DW_AT_decl_column : 3
    <8c70b>   DW_AT_type        : <0x8c6c5>
 <1><8c70f>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c710>   DW_AT_byte_size   : 48
    <8c711>   DW_AT_decl_file   : 7
    <8c712>   DW_AT_decl_line   : 75
    <8c713>   DW_AT_decl_column : 9
    <8c714>   DW_AT_sibling     : <0x8c73d>
 <2><8c718>: Abbrev Number: 17 (DW_TAG_member)
    <8c719>   DW_AT_name        : (indirect string, offset: 0x18a56): __data
    <8c71d>   DW_AT_decl_file   : 7
    <8c71e>   DW_AT_decl_line   : 77
    <8c71f>   DW_AT_decl_column : 27
    <8c720>   DW_AT_type        : <0x8c591>
 <2><8c724>: Abbrev Number: 17 (DW_TAG_member)
    <8c725>   DW_AT_name        : (indirect string, offset: 0x18c9c): __size
    <8c729>   DW_AT_decl_file   : 7
    <8c72a>   DW_AT_decl_line   : 78
    <8c72b>   DW_AT_decl_column : 8
    <8c72c>   DW_AT_type        : <0x8c73d>
 <2><8c730>: Abbrev Number: 17 (DW_TAG_member)
    <8c731>   DW_AT_name        : (indirect string, offset: 0x1853c): __align
    <8c735>   DW_AT_decl_file   : 7
    <8c736>   DW_AT_decl_line   : 79
    <8c737>   DW_AT_decl_column : 31
    <8c738>   DW_AT_type        : <0x8c74d>
 <2><8c73c>: Abbrev Number: 0
 <1><8c73d>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c73e>   DW_AT_type        : <0x8c42b>
    <8c742>   DW_AT_sibling     : <0x8c74d>
 <2><8c746>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c747>   DW_AT_type        : <0x8c3c0>
    <8c74b>   DW_AT_upper_bound : 47
 <2><8c74c>: Abbrev Number: 0
 <1><8c74d>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c74e>   DW_AT_byte_size   : 8
    <8c74f>   DW_AT_encoding    : 5	(signed)
    <8c750>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><8c754>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c755>   DW_AT_name        : (indirect string, offset: 0x19001): pthread_cond_t
    <8c759>   DW_AT_decl_file   : 7
    <8c75a>   DW_AT_decl_line   : 80
    <8c75b>   DW_AT_decl_column : 3
    <8c75c>   DW_AT_type        : <0x8c70f>
 <1><8c760>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c761>   DW_AT_type        : <0x8c42b>
    <8c765>   DW_AT_sibling     : <0x8c770>
 <2><8c769>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c76a>   DW_AT_type        : <0x8c3c0>
    <8c76e>   DW_AT_upper_bound : 31
 <2><8c76f>: Abbrev Number: 0
 <1><8c770>: Abbrev Number: 10 (DW_TAG_typedef)
    <8c771>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <8c775>   DW_AT_decl_file   : 4
    <8c776>   DW_AT_decl_line   : 321
    <8c778>   DW_AT_decl_column : 24
    <8c779>   DW_AT_type        : <0x8c3ef>
 <1><8c77d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c77e>   DW_AT_byte_size   : 8
    <8c77e>   DW_AT_type        : <0x8c432>
 <1><8c782>: Abbrev Number: 21 (DW_TAG_array_type)
    <8c783>   DW_AT_type        : <0x8c42b>
    <8c787>   DW_AT_sibling     : <0x8c792>
 <2><8c78b>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <8c78c>   DW_AT_type        : <0x8c3c0>
    <8c790>   DW_AT_upper_bound : 19
 <2><8c791>: Abbrev Number: 0
 <1><8c792>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c793>   DW_AT_byte_size   : 8
    <8c793>   DW_AT_type        : <0x8c426>
 <1><8c797>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c798>   DW_AT_byte_size   : 8
    <8c798>   DW_AT_type        : <0x8c79c>
 <1><8c79c>: Abbrev Number: 73 (DW_TAG_subroutine_type)
    <8c79d>   DW_AT_prototyped  : 1
 <1><8c79d>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c79e>   DW_AT_byte_size   : 8
    <8c79f>   DW_AT_encoding    : 4	(float)
    <8c7a0>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><8c7a4>: Abbrev Number: 24 (DW_TAG_base_type)
    <8c7a5>   DW_AT_byte_size   : 4
    <8c7a6>   DW_AT_encoding    : 4	(float)
    <8c7a7>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><8c7ab>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c7ac>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <8c7b0>   DW_AT_decl_file   : 8
    <8c7b1>   DW_AT_decl_line   : 7
    <8c7b2>   DW_AT_decl_column : 25
    <8c7b3>   DW_AT_type        : <0x8c7b7>
 <1><8c7b7>: Abbrev Number: 36 (DW_TAG_structure_type)
    <8c7b8>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <8c7bc>   DW_AT_declaration : 1
 <1><8c7bc>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8c7bd>   DW_AT_byte_size   : 8
    <8c7be>   DW_AT_decl_file   : 9
    <8c7bf>   DW_AT_decl_line   : 4
    <8c7c0>   DW_AT_decl_column : 3
    <8c7c1>   DW_AT_sibling     : <0x8c7e0>
 <2><8c7c5>: Abbrev Number: 4 (DW_TAG_member)
    <8c7c6>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <8c7ca>   DW_AT_decl_file   : 9
    <8c7cb>   DW_AT_decl_line   : 5
    <8c7cc>   DW_AT_decl_column : 8
    <8c7cd>   DW_AT_type        : <0x8c3ef>
    <8c7d1>   DW_AT_data_member_location: 0
 <2><8c7d2>: Abbrev Number: 4 (DW_TAG_member)
    <8c7d3>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <8c7d7>   DW_AT_decl_file   : 9
    <8c7d8>   DW_AT_decl_line   : 6
    <8c7d9>   DW_AT_decl_column : 8
    <8c7da>   DW_AT_type        : <0x8c3ef>
    <8c7de>   DW_AT_data_member_location: 4
 <2><8c7df>: Abbrev Number: 0
 <1><8c7e0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8c7e1>   DW_AT_byte_size   : 16
    <8c7e2>   DW_AT_decl_file   : 9
    <8c7e3>   DW_AT_decl_line   : 8
    <8c7e4>   DW_AT_decl_column : 3
    <8c7e5>   DW_AT_sibling     : <0x8c818>
 <2><8c7e9>: Abbrev Number: 16 (DW_TAG_member)
    <8c7ea>   DW_AT_name        : x
    <8c7ec>   DW_AT_decl_file   : 9
    <8c7ed>   DW_AT_decl_line   : 9
    <8c7ee>   DW_AT_decl_column : 8
    <8c7ef>   DW_AT_type        : <0x8c3ef>
    <8c7f3>   DW_AT_data_member_location: 0
 <2><8c7f4>: Abbrev Number: 16 (DW_TAG_member)
    <8c7f5>   DW_AT_name        : y
    <8c7f7>   DW_AT_decl_file   : 9
    <8c7f8>   DW_AT_decl_line   : 9
    <8c7f9>   DW_AT_decl_column : 11
    <8c7fa>   DW_AT_type        : <0x8c3ef>
    <8c7fe>   DW_AT_data_member_location: 4
 <2><8c7ff>: Abbrev Number: 16 (DW_TAG_member)
    <8c800>   DW_AT_name        : dx
    <8c803>   DW_AT_decl_file   : 9
    <8c804>   DW_AT_decl_line   : 10
    <8c805>   DW_AT_decl_column : 8
    <8c806>   DW_AT_type        : <0x8c3ef>
    <8c80a>   DW_AT_data_member_location: 8
 <2><8c80b>: Abbrev Number: 16 (DW_TAG_member)
    <8c80c>   DW_AT_name        : dy
    <8c80f>   DW_AT_decl_file   : 9
    <8c810>   DW_AT_decl_line   : 10
    <8c811>   DW_AT_decl_column : 12
    <8c812>   DW_AT_type        : <0x8c3ef>
    <8c816>   DW_AT_data_member_location: 12
 <2><8c817>: Abbrev Number: 0
 <1><8c818>: Abbrev Number: 33 (DW_TAG_union_type)
    <8c819>   DW_AT_byte_size   : 16
    <8c81a>   DW_AT_decl_file   : 9
    <8c81b>   DW_AT_decl_line   : 3
    <8c81c>   DW_AT_decl_column : 2
    <8c81d>   DW_AT_sibling     : <0x8c848>
 <2><8c821>: Abbrev Number: 53 (DW_TAG_member)
    <8c822>   DW_AT_type        : <0x8c7bc>
 <2><8c826>: Abbrev Number: 53 (DW_TAG_member)
    <8c827>   DW_AT_type        : <0x8c7e0>
 <2><8c82b>: Abbrev Number: 17 (DW_TAG_member)
    <8c82c>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <8c830>   DW_AT_decl_file   : 9
    <8c831>   DW_AT_decl_line   : 12
    <8c832>   DW_AT_decl_column : 7
    <8c833>   DW_AT_type        : <0x8c3ef>
 <2><8c837>: Abbrev Number: 54 (DW_TAG_member)
    <8c838>   DW_AT_name        : z
    <8c83a>   DW_AT_decl_file   : 9
    <8c83a>   DW_AT_decl_line   : 13
    <8c83b>   DW_AT_decl_column : 7
    <8c83b>   DW_AT_type        : <0x8c3ef>
 <2><8c83f>: Abbrev Number: 54 (DW_TAG_member)
    <8c840>   DW_AT_name        : w
    <8c842>   DW_AT_decl_file   : 9
    <8c842>   DW_AT_decl_line   : 14
    <8c843>   DW_AT_decl_column : 7
    <8c843>   DW_AT_type        : <0x8c3ef>
 <2><8c847>: Abbrev Number: 0
 <1><8c848>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c849>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <8c84d>   DW_AT_byte_size   : 20
    <8c84e>   DW_AT_decl_file   : 9
    <8c84f>   DW_AT_decl_line   : 1
    <8c850>   DW_AT_decl_column : 8
    <8c851>   DW_AT_sibling     : <0x8c869>
 <2><8c855>: Abbrev Number: 4 (DW_TAG_member)
    <8c856>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <8c85a>   DW_AT_decl_file   : 9
    <8c85b>   DW_AT_decl_line   : 2
    <8c85c>   DW_AT_decl_column : 6
    <8c85d>   DW_AT_type        : <0x8c3ef>
    <8c861>   DW_AT_data_member_location: 0
 <2><8c862>: Abbrev Number: 45 (DW_TAG_member)
    <8c863>   DW_AT_type        : <0x8c818>
    <8c867>   DW_AT_data_member_location: 4
 <2><8c868>: Abbrev Number: 0
 <1><8c869>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c86a>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <8c86e>   DW_AT_decl_file   : 9
    <8c86f>   DW_AT_decl_line   : 18
    <8c870>   DW_AT_decl_column : 23
    <8c871>   DW_AT_type        : <0x8c848>
 <1><8c875>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c876>   DW_AT_byte_size   : 8
    <8c876>   DW_AT_type        : <0x8c87a>
 <1><8c87a>: Abbrev Number: 74 (DW_TAG_subroutine_type)
    <8c87b>   DW_AT_prototyped  : 1
    <8c87b>   DW_AT_type        : <0x8c3ef>
 <1><8c87f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c880>   DW_AT_byte_size   : 8
    <8c880>   DW_AT_type        : <0x8c884>
 <1><8c884>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8c885>   DW_AT_prototyped  : 1
    <8c885>   DW_AT_type        : <0x8c3ef>
    <8c889>   DW_AT_sibling     : <0x8c898>
 <2><8c88d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c88e>   DW_AT_type        : <0x8c3ef>
 <2><8c892>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c893>   DW_AT_type        : <0x8c3ef>
 <2><8c897>: Abbrev Number: 0
 <1><8c898>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c899>   DW_AT_byte_size   : 8
    <8c899>   DW_AT_type        : <0x8c3ef>
 <1><8c89d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c89e>   DW_AT_byte_size   : 8
    <8c89e>   DW_AT_type        : <0x8c8a2>
 <1><8c8a2>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8c8a3>   DW_AT_prototyped  : 1
    <8c8a3>   DW_AT_type        : <0x8c3ef>
    <8c8a7>   DW_AT_sibling     : <0x8c8c5>
 <2><8c8ab>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8ac>   DW_AT_type        : <0x8c898>
 <2><8c8b0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8b1>   DW_AT_type        : <0x8c898>
 <2><8c8b5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8b6>   DW_AT_type        : <0x8c898>
 <2><8c8ba>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8bb>   DW_AT_type        : <0x8c898>
 <2><8c8bf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8c0>   DW_AT_type        : <0x8c898>
 <2><8c8c4>: Abbrev Number: 0
 <1><8c8c5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c8c6>   DW_AT_byte_size   : 8
    <8c8c6>   DW_AT_type        : <0x8c869>
 <1><8c8ca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c8cb>   DW_AT_byte_size   : 8
    <8c8cb>   DW_AT_type        : <0x8c3c7>
 <1><8c8cf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c8d0>   DW_AT_byte_size   : 8
    <8c8d0>   DW_AT_type        : <0x8c8ca>
 <1><8c8d4>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8c8d5>   DW_AT_prototyped  : 1
    <8c8d5>   DW_AT_type        : <0x8c413>
    <8c8d9>   DW_AT_sibling     : <0x8c8ed>
 <2><8c8dd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8de>   DW_AT_type        : <0x8c413>
 <2><8c8e2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8e3>   DW_AT_type        : <0x8c3ef>
 <2><8c8e7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c8e8>   DW_AT_type        : <0x8c443>
 <2><8c8ec>: Abbrev Number: 0
 <1><8c8ed>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8c8ee>   DW_AT_byte_size   : 8
    <8c8ee>   DW_AT_type        : <0x8c8d4>
 <1><8c8f2>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c8f3>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <8c8f7>   DW_AT_byte_size   : 12
    <8c8f8>   DW_AT_decl_file   : 10
    <8c8f9>   DW_AT_decl_line   : 139
    <8c8fa>   DW_AT_decl_column : 16
    <8c8fb>   DW_AT_sibling     : <0x8c924>
 <2><8c8ff>: Abbrev Number: 16 (DW_TAG_member)
    <8c900>   DW_AT_name        : ch
    <8c903>   DW_AT_decl_file   : 10
    <8c904>   DW_AT_decl_line   : 140
    <8c905>   DW_AT_decl_column : 14
    <8c906>   DW_AT_type        : <0x8c770>
    <8c90a>   DW_AT_data_member_location: 0
 <2><8c90b>: Abbrev Number: 16 (DW_TAG_member)
    <8c90c>   DW_AT_name        : fg
    <8c90f>   DW_AT_decl_file   : 10
    <8c910>   DW_AT_decl_line   : 141
    <8c911>   DW_AT_decl_column : 14
    <8c912>   DW_AT_type        : <0x8c3da>
    <8c916>   DW_AT_data_member_location: 4
 <2><8c917>: Abbrev Number: 16 (DW_TAG_member)
    <8c918>   DW_AT_name        : bg
    <8c91b>   DW_AT_decl_file   : 10
    <8c91c>   DW_AT_decl_line   : 141
    <8c91d>   DW_AT_decl_column : 18
    <8c91e>   DW_AT_type        : <0x8c3da>
    <8c922>   DW_AT_data_member_location: 8
 <2><8c923>: Abbrev Number: 0
 <1><8c924>: Abbrev Number: 9 (DW_TAG_typedef)
    <8c925>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <8c929>   DW_AT_decl_file   : 10
    <8c92a>   DW_AT_decl_line   : 142
    <8c92b>   DW_AT_decl_column : 3
    <8c92c>   DW_AT_type        : <0x8c8f2>
 <1><8c930>: Abbrev Number: 27 (DW_TAG_structure_type)
    <8c931>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <8c935>   DW_AT_byte_size   : 208
    <8c936>   DW_AT_decl_file   : 10
    <8c937>   DW_AT_decl_line   : 144
    <8c938>   DW_AT_decl_column : 16
    <8c939>   DW_AT_sibling     : <0x8caf3>
 <2><8c93d>: Abbrev Number: 16 (DW_TAG_member)
    <8c93e>   DW_AT_name        : id
    <8c941>   DW_AT_decl_file   : 10
    <8c942>   DW_AT_decl_line   : 146
    <8c943>   DW_AT_decl_column : 6
    <8c944>   DW_AT_type        : <0x8c3ef>
    <8c948>   DW_AT_data_member_location: 0
 <2><8c949>: Abbrev Number: 4 (DW_TAG_member)
    <8c94a>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <8c94e>   DW_AT_decl_file   : 10
    <8c94f>   DW_AT_decl_line   : 147
    <8c950>   DW_AT_decl_column : 9
    <8c951>   DW_AT_type        : <0x8c3ef>
    <8c955>   DW_AT_data_member_location: 4
 <2><8c956>: Abbrev Number: 4 (DW_TAG_member)
    <8c957>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <8c95b>   DW_AT_decl_file   : 10
    <8c95c>   DW_AT_decl_line   : 148
    <8c95d>   DW_AT_decl_column : 21
    <8c95e>   DW_AT_type        : <0x8c8cf>
    <8c962>   DW_AT_data_member_location: 8
 <2><8c963>: Abbrev Number: 4 (DW_TAG_member)
    <8c964>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <8c968>   DW_AT_decl_file   : 10
    <8c969>   DW_AT_decl_line   : 149
    <8c96a>   DW_AT_decl_column : 9
    <8c96b>   DW_AT_type        : <0x8c3ef>
    <8c96f>   DW_AT_data_member_location: 16
 <2><8c970>: Abbrev Number: 4 (DW_TAG_member)
    <8c971>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <8c975>   DW_AT_decl_file   : 10
    <8c976>   DW_AT_decl_line   : 150
    <8c977>   DW_AT_decl_column : 9
    <8c978>   DW_AT_type        : <0x8c3ef>
    <8c97c>   DW_AT_data_member_location: 20
 <2><8c97d>: Abbrev Number: 4 (DW_TAG_member)
    <8c97e>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <8c982>   DW_AT_decl_file   : 10
    <8c983>   DW_AT_decl_line   : 151
    <8c984>   DW_AT_decl_column : 20
    <8c985>   DW_AT_type        : <0x8c8ca>
    <8c989>   DW_AT_data_member_location: 24
 <2><8c98a>: Abbrev Number: 16 (DW_TAG_member)
    <8c98b>   DW_AT_name        : w
    <8c98d>   DW_AT_decl_file   : 10
    <8c98e>   DW_AT_decl_line   : 152
    <8c98f>   DW_AT_decl_column : 9
    <8c990>   DW_AT_type        : <0x8c3ef>
    <8c994>   DW_AT_data_member_location: 32
 <2><8c995>: Abbrev Number: 16 (DW_TAG_member)
    <8c996>   DW_AT_name        : h
    <8c998>   DW_AT_decl_file   : 10
    <8c999>   DW_AT_decl_line   : 152
    <8c99a>   DW_AT_decl_column : 12
    <8c99b>   DW_AT_type        : <0x8c3ef>
    <8c99f>   DW_AT_data_member_location: 36
 <2><8c9a0>: Abbrev Number: 4 (DW_TAG_member)
    <8c9a1>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <8c9a5>   DW_AT_decl_file   : 10
    <8c9a6>   DW_AT_decl_line   : 153
    <8c9a7>   DW_AT_decl_column : 9
    <8c9a8>   DW_AT_type        : <0x8c3ef>
    <8c9ac>   DW_AT_data_member_location: 40
 <2><8c9ad>: Abbrev Number: 16 (DW_TAG_member)
    <8c9ae>   DW_AT_name        : bpp
    <8c9b2>   DW_AT_decl_file   : 10
    <8c9b3>   DW_AT_decl_line   : 154
    <8c9b4>   DW_AT_decl_column : 9
    <8c9b5>   DW_AT_type        : <0x8c3ef>
    <8c9b9>   DW_AT_data_member_location: 44
 <2><8c9ba>: Abbrev Number: 4 (DW_TAG_member)
    <8c9bb>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8c9bf>   DW_AT_decl_file   : 10
    <8c9c0>   DW_AT_decl_line   : 155
    <8c9c1>   DW_AT_decl_column : 9
    <8c9c2>   DW_AT_type        : <0x8c3ef>
    <8c9c6>   DW_AT_data_member_location: 48
 <2><8c9c7>: Abbrev Number: 4 (DW_TAG_member)
    <8c9c8>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <8c9cc>   DW_AT_decl_file   : 10
    <8c9cd>   DW_AT_decl_line   : 156
    <8c9ce>   DW_AT_decl_column : 19
    <8c9cf>   DW_AT_type        : <0x8caf3>
    <8c9d3>   DW_AT_data_member_location: 56
