    <cfae2>   DW_AT_location    : 9 byte block: 3 f8 a 49 0 0 0 0 0 	(DW_OP_addr: 490af8)
 <1><cfaec>: Abbrev Number: 3 (DW_TAG_variable)
    <cfaed>   DW_AT_name        : (indirect string, offset: 0x1bd79): view_botrow
    <cfaf1>   DW_AT_decl_file   : 1
    <cfaf1>   DW_AT_decl_line   : 5
    <cfaf1>   DW_AT_decl_column : 30
    <cfaf2>   DW_AT_type        : <0xcfaa1>
    <cfaf6>   DW_AT_location    : 9 byte block: 3 f4 a 49 0 0 0 0 0 	(DW_OP_addr: 490af4)
 <1><cfb00>: Abbrev Number: 13 (DW_TAG_subprogram)
    <cfb01>   DW_AT_external    : 1
    <cfb01>   DW_AT_name        : (indirect string, offset: 0x1a8df): fb_GetSize
    <cfb05>   DW_AT_decl_file   : 2
    <cfb06>   DW_AT_decl_line   : 43
    <cfb07>   DW_AT_decl_column : 21
    <cfb08>   DW_AT_prototyped  : 1
    <cfb08>   DW_AT_declaration : 1
    <cfb08>   DW_AT_sibling     : <0xcfb17>
 <2><cfb0c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cfb0d>   DW_AT_type        : <0xcfad2>
 <2><cfb11>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cfb12>   DW_AT_type        : <0xcfad2>
 <2><cfb16>: Abbrev Number: 0
 <1><cfb17>: Abbrev Number: 5 (DW_TAG_subprogram)
    <cfb18>   DW_AT_external    : 1
    <cfb18>   DW_AT_name        : (indirect string, offset: 0x1aaca): fb_ConsoleGetView
    <cfb1c>   DW_AT_decl_file   : 1
    <cfb1c>   DW_AT_decl_line   : 39
    <cfb1d>   DW_AT_decl_column : 6
    <cfb1d>   DW_AT_prototyped  : 1
    <cfb1d>   DW_AT_low_pc      : 0x4749a0
    <cfb25>   DW_AT_high_pc     : 0x8b

    <cfbec>   DW_AT_inline      : 1	(not inlined)
 <1><cfbec>: Abbrev Number: 16 (DW_TAG_subprogram)
    <cfbed>   DW_AT_abstract_origin: <0xcfbe2>
    <cfbf1>   DW_AT_low_pc      : 0x474920
    <cfbf9>   DW_AT_high_pc     : 0x1d
    <cfc01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cfc03>   DW_AT_call_all_calls: 1
 <1><cfc03>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cfc04>   DW_AT_abstract_origin: <0xcfbd8>
    <cfc08>   DW_AT_low_pc      : 0x474940
    <cfc10>   DW_AT_high_pc     : 0x4e
    <cfc18>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cfc1a>   DW_AT_call_all_calls: 1
 <2><cfc1a>: Abbrev Number: 7 (DW_TAG_call_site)
    <cfc1b>   DW_AT_call_return_pc: 0x474962
    <cfc23>   DW_AT_call_origin : <0xcfb00>
 <3><cfc27>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <cfc28>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cfc2a>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><cfc2c>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <cfc2d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cfc2f>   DW_AT_call_value  : 9 byte block: 3 f4 a 49 0 0 0 0 0 	(DW_OP_addr: 490af4)
 <3><cfc39>: Abbrev Number: 0
 <2><cfc3a>: Abbrev Number: 0
 <1><cfc3b>: Abbrev Number: 0
  Compilation Unit @ offset 0xcfc3c:
   Length:        0x627 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x11efe
   Pointer Size:  8
 <0><cfc48>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <cfc49>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <cfc4d>   DW_AT_language    : 29	(C11)
    <cfc4e>   DW_AT_name        : (indirect line string, offset: 0x11f3): src/rtlib/unix/io_width.c
    <cfc52>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <cfc56>   DW_AT_low_pc      : 0x474a30
    <cfc5e>   DW_AT_high_pc     : 0x95
    <cfc66>   DW_AT_stmt_list   : 0x694ff
 <1><cfc6a>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc6b>   DW_AT_byte_size   : 1
    <cfc6c>   DW_AT_encoding    : 8	(unsigned char)
    <cfc6d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><cfc71>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc72>   DW_AT_byte_size   : 2
    <cfc73>   DW_AT_encoding    : 7	(unsigned)
    <cfc74>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><cfc78>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc79>   DW_AT_byte_size   : 4
    <cfc7a>   DW_AT_encoding    : 7	(unsigned)
    <cfc7b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><cfc7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc80>   DW_AT_byte_size   : 8
    <cfc81>   DW_AT_encoding    : 7	(unsigned)
    <cfc82>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><cfc86>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc87>   DW_AT_byte_size   : 1
    <cfc88>   DW_AT_encoding    : 6	(signed char)
    <cfc89>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><cfc8d>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc8e>   DW_AT_byte_size   : 2
    <cfc8f>   DW_AT_encoding    : 5	(signed)
    <cfc90>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><cfc94>: Abbrev Number: 19 (DW_TAG_base_type)
    <cfc95>   DW_AT_byte_size   : 4
    <cfc96>   DW_AT_encoding    : 5	(signed)
    <cfc97>   DW_AT_name        : int
 <1><cfc9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfc9c>   DW_AT_byte_size   : 8
    <cfc9d>   DW_AT_encoding    : 5	(signed)
    <cfc9e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><cfca2>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfca3>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <cfca7>   DW_AT_decl_file   : 2
    <cfca8>   DW_AT_decl_line   : 152
    <cfca9>   DW_AT_decl_column : 25
    <cfcaa>   DW_AT_type        : <0xcfc9b>
 <1><cfcae>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfcaf>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <cfcb3>   DW_AT_decl_file   : 2
    <cfcb4>   DW_AT_decl_line   : 153
    <cfcb5>   DW_AT_decl_column : 27
    <cfcb6>   DW_AT_type        : <0xcfc9b>
 <1><cfcba>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <cfcbb>   DW_AT_byte_size   : 8
 <1><cfcbc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfcbd>   DW_AT_byte_size   : 8
    <cfcbd>   DW_AT_type        : <0xcfcc1>
 <1><cfcc1>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfcc2>   DW_AT_byte_size   : 1
    <cfcc3>   DW_AT_encoding    : 6	(signed char)
    <cfcc4>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><cfcc8>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfcc9>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <cfccd>   DW_AT_decl_file   : 3
    <cfcce>   DW_AT_decl_line   : 209
    <cfccf>   DW_AT_decl_column : 23
    <cfcd0>   DW_AT_type        : <0xcfc7f>
 <1><cfcd4>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfcd5>   DW_AT_byte_size   : 8
    <cfcd6>   DW_AT_encoding    : 5	(signed)
    <cfcd7>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><cfcdb>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfcdc>   DW_AT_byte_size   : 8
    <cfcdd>   DW_AT_encoding    : 7	(unsigned)
    <cfcde>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><cfce2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <cfce3>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <cfce7>   DW_AT_byte_size   : 216
    <cfce8>   DW_AT_decl_file   : 4
    <cfce9>   DW_AT_decl_line   : 49
    <cfcea>   DW_AT_decl_column : 8
    <cfcea>   DW_AT_sibling     : <0xcfe68>
 <2><cfcee>: Abbrev Number: 1 (DW_TAG_member)
    <cfcef>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <cfcf3>   DW_AT_decl_file   : 4
    <cfcf4>   DW_AT_decl_line   : 51
    <cfcf5>   DW_AT_decl_column : 7
    <cfcf6>   DW_AT_type        : <0xcfc94>
    <cfcfa>   DW_AT_data_member_location: 0
 <2><cfcfb>: Abbrev Number: 1 (DW_TAG_member)
    <cfcfc>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <cfd00>   DW_AT_decl_file   : 4
    <cfd01>   DW_AT_decl_line   : 54
    <cfd02>   DW_AT_decl_column : 9
    <cfd03>   DW_AT_type        : <0xcfcbc>
    <cfd07>   DW_AT_data_member_location: 8
 <2><cfd08>: Abbrev Number: 1 (DW_TAG_member)
    <cfd09>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <cfd0d>   DW_AT_decl_file   : 4
    <cfd0e>   DW_AT_decl_line   : 55
    <cfd0f>   DW_AT_decl_column : 9
    <cfd10>   DW_AT_type        : <0xcfcbc>
    <cfd14>   DW_AT_data_member_location: 16
 <2><cfd15>: Abbrev Number: 1 (DW_TAG_member)
    <cfd16>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <cfd1a>   DW_AT_decl_file   : 4
    <cfd1b>   DW_AT_decl_line   : 56
    <cfd1c>   DW_AT_decl_column : 9
    <cfd1d>   DW_AT_type        : <0xcfcbc>
    <cfd21>   DW_AT_data_member_location: 24
 <2><cfd22>: Abbrev Number: 1 (DW_TAG_member)
    <cfd23>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <cfd27>   DW_AT_decl_file   : 4
    <cfd28>   DW_AT_decl_line   : 57
    <cfd29>   DW_AT_decl_column : 9
    <cfd2a>   DW_AT_type        : <0xcfcbc>
    <cfd2e>   DW_AT_data_member_location: 32
 <2><cfd2f>: Abbrev Number: 1 (DW_TAG_member)
    <cfd30>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <cfd34>   DW_AT_decl_file   : 4
    <cfd35>   DW_AT_decl_line   : 58
    <cfd36>   DW_AT_decl_column : 9
    <cfd37>   DW_AT_type        : <0xcfcbc>
    <cfd3b>   DW_AT_data_member_location: 40
 <2><cfd3c>: Abbrev Number: 1 (DW_TAG_member)
    <cfd3d>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <cfd41>   DW_AT_decl_file   : 4
    <cfd42>   DW_AT_decl_line   : 59
    <cfd43>   DW_AT_decl_column : 9
    <cfd44>   DW_AT_type        : <0xcfcbc>
    <cfd48>   DW_AT_data_member_location: 48
 <2><cfd49>: Abbrev Number: 1 (DW_TAG_member)
    <cfd4a>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <cfd4e>   DW_AT_decl_file   : 4
    <cfd4f>   DW_AT_decl_line   : 60
    <cfd50>   DW_AT_decl_column : 9
    <cfd51>   DW_AT_type        : <0xcfcbc>
    <cfd55>   DW_AT_data_member_location: 56
 <2><cfd56>: Abbrev Number: 1 (DW_TAG_member)
    <cfd57>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <cfd5b>   DW_AT_decl_file   : 4
    <cfd5c>   DW_AT_decl_line   : 61
    <cfd5d>   DW_AT_decl_column : 9
    <cfd5e>   DW_AT_type        : <0xcfcbc>
    <cfd62>   DW_AT_data_member_location: 64
 <2><cfd63>: Abbrev Number: 1 (DW_TAG_member)
    <cfd64>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <cfd68>   DW_AT_decl_file   : 4
    <cfd69>   DW_AT_decl_line   : 64
    <cfd6a>   DW_AT_decl_column : 9
    <cfd6b>   DW_AT_type        : <0xcfcbc>
    <cfd6f>   DW_AT_data_member_location: 72
 <2><cfd70>: Abbrev Number: 1 (DW_TAG_member)
    <cfd71>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <cfd75>   DW_AT_decl_file   : 4
    <cfd76>   DW_AT_decl_line   : 65
    <cfd77>   DW_AT_decl_column : 9
    <cfd78>   DW_AT_type        : <0xcfcbc>
    <cfd7c>   DW_AT_data_member_location: 80
 <2><cfd7d>: Abbrev Number: 1 (DW_TAG_member)
    <cfd7e>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <cfd82>   DW_AT_decl_file   : 4
    <cfd83>   DW_AT_decl_line   : 66
    <cfd84>   DW_AT_decl_column : 9
    <cfd85>   DW_AT_type        : <0xcfcbc>
    <cfd89>   DW_AT_data_member_location: 88
 <2><cfd8a>: Abbrev Number: 1 (DW_TAG_member)
    <cfd8b>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <cfd8f>   DW_AT_decl_file   : 4
    <cfd90>   DW_AT_decl_line   : 68
    <cfd91>   DW_AT_decl_column : 22
    <cfd92>   DW_AT_type        : <0xcfe81>
    <cfd96>   DW_AT_data_member_location: 96
 <2><cfd97>: Abbrev Number: 1 (DW_TAG_member)
    <cfd98>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <cfd9c>   DW_AT_decl_file   : 4
    <cfd9d>   DW_AT_decl_line   : 70
    <cfd9e>   DW_AT_decl_column : 20
    <cfd9f>   DW_AT_type        : <0xcfe86>
    <cfda3>   DW_AT_data_member_location: 104
 <2><cfda4>: Abbrev Number: 1 (DW_TAG_member)
    <cfda5>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <cfda9>   DW_AT_decl_file   : 4
    <cfdaa>   DW_AT_decl_line   : 72
    <cfdab>   DW_AT_decl_column : 7
    <cfdac>   DW_AT_type        : <0xcfc94>
    <cfdb0>   DW_AT_data_member_location: 112
 <2><cfdb1>: Abbrev Number: 1 (DW_TAG_member)
    <cfdb2>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <cfdb6>   DW_AT_decl_file   : 4
    <cfdb7>   DW_AT_decl_line   : 73
    <cfdb8>   DW_AT_decl_column : 7
    <cfdb9>   DW_AT_type        : <0xcfc94>
    <cfdbd>   DW_AT_data_member_location: 116
 <2><cfdbe>: Abbrev Number: 1 (DW_TAG_member)
    <cfdbf>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <cfdc3>   DW_AT_decl_file   : 4
    <cfdc4>   DW_AT_decl_line   : 74
    <cfdc5>   DW_AT_decl_column : 11
    <cfdc6>   DW_AT_type        : <0xcfca2>
    <cfdca>   DW_AT_data_member_location: 120
 <2><cfdcb>: Abbrev Number: 1 (DW_TAG_member)
    <cfdcc>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <cfdd0>   DW_AT_decl_file   : 4
    <cfdd1>   DW_AT_decl_line   : 77
    <cfdd2>   DW_AT_decl_column : 18
    <cfdd3>   DW_AT_type        : <0xcfc71>
    <cfdd7>   DW_AT_data_member_location: 128
 <2><cfdd8>: Abbrev Number: 1 (DW_TAG_member)
    <cfdd9>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <cfddd>   DW_AT_decl_file   : 4
    <cfdde>   DW_AT_decl_line   : 78
    <cfddf>   DW_AT_decl_column : 15
    <cfde0>   DW_AT_type        : <0xcfc86>
    <cfde4>   DW_AT_data_member_location: 130
 <2><cfde5>: Abbrev Number: 1 (DW_TAG_member)
    <cfde6>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <cfdea>   DW_AT_decl_file   : 4
    <cfdeb>   DW_AT_decl_line   : 79
    <cfdec>   DW_AT_decl_column : 8
    <cfded>   DW_AT_type        : <0xcfe8b>
    <cfdf1>   DW_AT_data_member_location: 131
 <2><cfdf2>: Abbrev Number: 1 (DW_TAG_member)
    <cfdf3>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <cfdf7>   DW_AT_decl_file   : 4
    <cfdf8>   DW_AT_decl_line   : 81
    <cfdf9>   DW_AT_decl_column : 15
    <cfdfa>   DW_AT_type        : <0xcfe9b>
    <cfdfe>   DW_AT_data_member_location: 136
 <2><cfdff>: Abbrev Number: 1 (DW_TAG_member)
    <cfe00>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <cfe04>   DW_AT_decl_file   : 4
    <cfe05>   DW_AT_decl_line   : 89
    <cfe06>   DW_AT_decl_column : 13
    <cfe07>   DW_AT_type        : <0xcfcae>
    <cfe0b>   DW_AT_data_member_location: 144
 <2><cfe0c>: Abbrev Number: 1 (DW_TAG_member)
    <cfe0d>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <cfe11>   DW_AT_decl_file   : 4
    <cfe12>   DW_AT_decl_line   : 91
    <cfe13>   DW_AT_decl_column : 23
    <cfe14>   DW_AT_type        : <0xcfea5>
    <cfe18>   DW_AT_data_member_location: 152
 <2><cfe19>: Abbrev Number: 1 (DW_TAG_member)
    <cfe1a>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <cfe1e>   DW_AT_decl_file   : 4
    <cfe1f>   DW_AT_decl_line   : 92
    <cfe20>   DW_AT_decl_column : 25
    <cfe21>   DW_AT_type        : <0xcfeaf>
    <cfe25>   DW_AT_data_member_location: 160
 <2><cfe26>: Abbrev Number: 1 (DW_TAG_member)
    <cfe27>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <cfe2b>   DW_AT_decl_file   : 4
    <cfe2c>   DW_AT_decl_line   : 93
    <cfe2d>   DW_AT_decl_column : 20
    <cfe2e>   DW_AT_type        : <0xcfe86>
    <cfe32>   DW_AT_data_member_location: 168
 <2><cfe33>: Abbrev Number: 1 (DW_TAG_member)
    <cfe34>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <cfe38>   DW_AT_decl_file   : 4
    <cfe39>   DW_AT_decl_line   : 94
    <cfe3a>   DW_AT_decl_column : 9
    <cfe3b>   DW_AT_type        : <0xcfcba>
    <cfe3f>   DW_AT_data_member_location: 176
 <2><cfe40>: Abbrev Number: 1 (DW_TAG_member)
    <cfe41>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <cfe45>   DW_AT_decl_file   : 4
    <cfe46>   DW_AT_decl_line   : 95
    <cfe47>   DW_AT_decl_column : 10
    <cfe48>   DW_AT_type        : <0xcfcc8>
    <cfe4c>   DW_AT_data_member_location: 184
 <2><cfe4d>: Abbrev Number: 1 (DW_TAG_member)
    <cfe4e>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <cfe52>   DW_AT_decl_file   : 4
    <cfe53>   DW_AT_decl_line   : 96
    <cfe54>   DW_AT_decl_column : 7
    <cfe55>   DW_AT_type        : <0xcfc94>
    <cfe59>   DW_AT_data_member_location: 192
 <2><cfe5a>: Abbrev Number: 1 (DW_TAG_member)
    <cfe5b>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <cfe5f>   DW_AT_decl_file   : 4
    <cfe60>   DW_AT_decl_line   : 98
    <cfe61>   DW_AT_decl_column : 8
    <cfe62>   DW_AT_type        : <0xcfeb4>
    <cfe66>   DW_AT_data_member_location: 196
 <2><cfe67>: Abbrev Number: 0
 <1><cfe68>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfe69>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <cfe6d>   DW_AT_decl_file   : 5
    <cfe6e>   DW_AT_decl_line   : 7
    <cfe6f>   DW_AT_decl_column : 25
    <cfe70>   DW_AT_type        : <0xcfce2>
 <1><cfe74>: Abbrev Number: 21 (DW_TAG_typedef)
    <cfe75>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <cfe79>   DW_AT_decl_file   : 4
    <cfe7a>   DW_AT_decl_line   : 43
    <cfe7b>   DW_AT_decl_column : 14
 <1><cfe7c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <cfe7d>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <cfe81>   DW_AT_declaration : 1
 <1><cfe81>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfe82>   DW_AT_byte_size   : 8
    <cfe82>   DW_AT_type        : <0xcfe7c>
 <1><cfe86>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfe87>   DW_AT_byte_size   : 8
    <cfe87>   DW_AT_type        : <0xcfce2>
 <1><cfe8b>: Abbrev Number: 8 (DW_TAG_array_type)
    <cfe8c>   DW_AT_type        : <0xcfcc1>
    <cfe90>   DW_AT_sibling     : <0xcfe9b>
 <2><cfe94>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <cfe95>   DW_AT_type        : <0xcfc7f>
    <cfe99>   DW_AT_upper_bound : 0
 <2><cfe9a>: Abbrev Number: 0
 <1><cfe9b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfe9c>   DW_AT_byte_size   : 8
    <cfe9c>   DW_AT_type        : <0xcfe74>
 <1><cfea0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <cfea1>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <cfea5>   DW_AT_declaration : 1
 <1><cfea5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfea6>   DW_AT_byte_size   : 8
    <cfea6>   DW_AT_type        : <0xcfea0>
 <1><cfeaa>: Abbrev Number: 11 (DW_TAG_structure_type)
    <cfeab>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <cfeaf>   DW_AT_declaration : 1
 <1><cfeaf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfeb0>   DW_AT_byte_size   : 8
    <cfeb0>   DW_AT_type        : <0xcfeaa>
 <1><cfeb4>: Abbrev Number: 8 (DW_TAG_array_type)
    <cfeb5>   DW_AT_type        : <0xcfcc1>
    <cfeb9>   DW_AT_sibling     : <0xcfec4>
 <2><cfebd>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <cfebe>   DW_AT_type        : <0xcfc7f>
    <cfec2>   DW_AT_upper_bound : 19
 <2><cfec3>: Abbrev Number: 0
 <1><cfec4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cfec5>   DW_AT_byte_size   : 8
    <cfec5>   DW_AT_type        : <0xcfe68>
 <1><cfec9>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfeca>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <cfece>   DW_AT_decl_file   : 6
    <cfecf>   DW_AT_decl_line   : 23
    <cfed0>   DW_AT_decl_column : 23
    <cfed1>   DW_AT_type        : <0xcfc6a>
 <1><cfed5>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfed6>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <cfeda>   DW_AT_decl_file   : 6
    <cfedb>   DW_AT_decl_line   : 24
    <cfedc>   DW_AT_decl_column : 22
    <cfedd>   DW_AT_type        : <0xcfc78>
 <1><cfee1>: Abbrev Number: 5 (DW_TAG_typedef)
    <cfee2>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <cfee6>   DW_AT_decl_file   : 6
    <cfee7>   DW_AT_decl_line   : 25
    <cfee8>   DW_AT_decl_column : 22
    <cfee9>   DW_AT_type        : <0xcfc78>
 <1><cfeed>: Abbrev Number: 13 (DW_TAG_structure_type)
    <cfeee>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <cfef2>   DW_AT_byte_size   : 60
    <cfef3>   DW_AT_decl_file   : 7
    <cfef4>   DW_AT_decl_line   : 24
    <cfef5>   DW_AT_decl_column : 8
    <cfef5>   DW_AT_sibling     : <0xcff62>
 <2><cfef9>: Abbrev Number: 1 (DW_TAG_member)
    <cfefa>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <cfefe>   DW_AT_decl_file   : 7
    <cfeff>   DW_AT_decl_line   : 26
    <cff00>   DW_AT_decl_column : 14
    <cff01>   DW_AT_type        : <0xcfee1>
    <cff05>   DW_AT_data_member_location: 0
 <2><cff06>: Abbrev Number: 1 (DW_TAG_member)
    <cff07>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <cff0b>   DW_AT_decl_file   : 7
    <cff0c>   DW_AT_decl_line   : 27
    <cff0d>   DW_AT_decl_column : 14
    <cff0e>   DW_AT_type        : <0xcfee1>
    <cff12>   DW_AT_data_member_location: 4
 <2><cff13>: Abbrev Number: 1 (DW_TAG_member)
    <cff14>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <cff18>   DW_AT_decl_file   : 7
    <cff19>   DW_AT_decl_line   : 28
    <cff1a>   DW_AT_decl_column : 14
    <cff1b>   DW_AT_type        : <0xcfee1>
    <cff1f>   DW_AT_data_member_location: 8
 <2><cff20>: Abbrev Number: 1 (DW_TAG_member)
    <cff21>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <cff25>   DW_AT_decl_file   : 7
    <cff26>   DW_AT_decl_line   : 29
    <cff27>   DW_AT_decl_column : 14
    <cff28>   DW_AT_type        : <0xcfee1>
    <cff2c>   DW_AT_data_member_location: 12
 <2><cff2d>: Abbrev Number: 1 (DW_TAG_member)
    <cff2e>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <cff32>   DW_AT_decl_file   : 7
    <cff33>   DW_AT_decl_line   : 30
    <cff34>   DW_AT_decl_column : 10
    <cff35>   DW_AT_type        : <0xcfec9>
    <cff39>   DW_AT_data_member_location: 16
 <2><cff3a>: Abbrev Number: 1 (DW_TAG_member)
    <cff3b>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <cff3f>   DW_AT_decl_file   : 7
    <cff40>   DW_AT_decl_line   : 31
    <cff41>   DW_AT_decl_column : 10
    <cff42>   DW_AT_type        : <0xcff62>
    <cff46>   DW_AT_data_member_location: 17
 <2><cff47>: Abbrev Number: 1 (DW_TAG_member)
    <cff48>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <cff4c>   DW_AT_decl_file   : 7
    <cff4d>   DW_AT_decl_line   : 32
    <cff4e>   DW_AT_decl_column : 13
    <cff4f>   DW_AT_type        : <0xcfed5>
    <cff53>   DW_AT_data_member_location: 52
 <2><cff54>: Abbrev Number: 1 (DW_TAG_member)
    <cff55>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <cff59>   DW_AT_decl_file   : 7
    <cff5a>   DW_AT_decl_line   : 33
    <cff5b>   DW_AT_decl_column : 13
    <cff5c>   DW_AT_type        : <0xcfed5>
    <cff60>   DW_AT_data_member_location: 56
 <2><cff61>: Abbrev Number: 0
 <1><cff62>: Abbrev Number: 8 (DW_TAG_array_type)
    <cff63>   DW_AT_type        : <0xcfec9>
    <cff67>   DW_AT_sibling     : <0xcff72>
 <2><cff6b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <cff6c>   DW_AT_type        : <0xcfc7f>
    <cff70>   DW_AT_upper_bound : 31
 <2><cff71>: Abbrev Number: 0
 <1><cff72>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cff73>   DW_AT_byte_size   : 8
    <cff73>   DW_AT_type        : <0xcff77>
 <1><cff77>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <cff78>   DW_AT_prototyped  : 1
 <1><cff78>: Abbrev Number: 2 (DW_TAG_base_type)
    <cff79>   DW_AT_byte_size   : 8
    <cff7a>   DW_AT_encoding    : 4	(float)
    <cff7b>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><cff7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <cff80>   DW_AT_byte_size   : 4
    <cff81>   DW_AT_encoding    : 4	(float)
    <cff82>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><cff86>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cff87>   DW_AT_byte_size   : 8
    <cff87>   DW_AT_type        : <0xcff8b>
 <1><cff8b>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <cff8c>   DW_AT_prototyped  : 1
    <cff8c>   DW_AT_type        : <0xcfc94>
 <1><cff90>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cff91>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <cff95>   DW_AT_byte_size   : 408
    <cff97>   DW_AT_decl_file   : 8
    <cff98>   DW_AT_decl_line   : 38
    <cff99>   DW_AT_decl_column : 16
    <cff9a>   DW_AT_sibling     : <0xd00f7>
 <2><cff9e>: Abbrev Number: 1 (DW_TAG_member)
    <cff9f>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <cffa3>   DW_AT_decl_file   : 8
    <cffa4>   DW_AT_decl_line   : 40
    <cffa5>   DW_AT_decl_column : 6
    <cffa6>   DW_AT_type        : <0xcfc94>
    <cffaa>   DW_AT_data_member_location: 0
 <2><cffab>: Abbrev Number: 1 (DW_TAG_member)
    <cffac>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <cffb0>   DW_AT_decl_file   : 8
    <cffb1>   DW_AT_decl_line   : 41
    <cffb2>   DW_AT_decl_column : 6
    <cffb3>   DW_AT_type        : <0xcfc94>
    <cffb7>   DW_AT_data_member_location: 4
 <2><cffb8>: Abbrev Number: 1 (DW_TAG_member)
    <cffb9>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <cffbd>   DW_AT_decl_file   : 8
    <cffbe>   DW_AT_decl_line   : 42
    <cffbf>   DW_AT_decl_column : 6
    <cffc0>   DW_AT_type        : <0xcfc94>
    <cffc4>   DW_AT_data_member_location: 8
 <2><cffc5>: Abbrev Number: 1 (DW_TAG_member)
    <cffc6>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <cffca>   DW_AT_decl_file   : 8
    <cffcb>   DW_AT_decl_line   : 43
    <cffcc>   DW_AT_decl_column : 8
    <cffcd>   DW_AT_type        : <0xcfec4>
    <cffd1>   DW_AT_data_member_location: 16
 <2><cffd2>: Abbrev Number: 1 (DW_TAG_member)
    <cffd3>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <cffd7>   DW_AT_decl_file   : 8
    <cffd8>   DW_AT_decl_line   : 44
    <cffd9>   DW_AT_decl_column : 17
    <cffda>   DW_AT_type        : <0xcfeed>
    <cffde>   DW_AT_data_member_location: 24
 <2><cffdf>: Abbrev Number: 1 (DW_TAG_member)
    <cffe0>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <cffe4>   DW_AT_decl_file   : 8
    <cffe5>   DW_AT_decl_line   : 44
    <cffe6>   DW_AT_decl_column : 31
    <cffe7>   DW_AT_type        : <0xcfeed>
    <cffeb>   DW_AT_data_member_location: 84
 <2><cffec>: Abbrev Number: 1 (DW_TAG_member)
    <cffed>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <cfff1>   DW_AT_decl_file   : 8
    <cfff2>   DW_AT_decl_line   : 45
    <cfff3>   DW_AT_decl_column : 6
    <cfff4>   DW_AT_type        : <0xcfc94>
    <cfff8>   DW_AT_data_member_location: 144
 <2><cfff9>: Abbrev Number: 1 (DW_TAG_member)
    <cfffa>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <cfffe>   DW_AT_decl_file   : 8
    <cffff>   DW_AT_decl_line   : 46
    <d0000>   DW_AT_decl_column : 6
    <d0001>   DW_AT_type        : <0xcfc94>
    <d0005>   DW_AT_data_member_location: 148
 <2><d0006>: Abbrev Number: 1 (DW_TAG_member)
    <d0007>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <d000b>   DW_AT_decl_file   : 8
    <d000c>   DW_AT_decl_line   : 46
    <d000d>   DW_AT_decl_column : 16
    <d000e>   DW_AT_type        : <0xcfc94>
    <d0012>   DW_AT_data_member_location: 152
 <2><d0013>: Abbrev Number: 1 (DW_TAG_member)
    <d0014>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <d0018>   DW_AT_decl_file   : 8
    <d0019>   DW_AT_decl_line   : 47
    <d001a>   DW_AT_decl_column : 6
    <d001b>   DW_AT_type        : <0xcfc94>
    <d001f>   DW_AT_data_member_location: 156
 <2><d0020>: Abbrev Number: 1 (DW_TAG_member)
    <d0021>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <d0025>   DW_AT_decl_file   : 8
    <d0026>   DW_AT_decl_line   : 47
    <d0027>   DW_AT_decl_column : 13
    <d0028>   DW_AT_type        : <0xcfc94>
    <d002c>   DW_AT_data_member_location: 160
 <2><d002d>: Abbrev Number: 12 (DW_TAG_member)
    <d002e>   DW_AT_name        : w
    <d0030>   DW_AT_decl_file   : 8
    <d0030>   DW_AT_decl_line   : 48
    <d0031>   DW_AT_decl_column : 6
    <d0032>   DW_AT_type        : <0xcfc94>
    <d0036>   DW_AT_data_member_location: 164
 <2><d0037>: Abbrev Number: 12 (DW_TAG_member)
    <d0038>   DW_AT_name        : h
    <d003a>   DW_AT_decl_file   : 8
    <d003a>   DW_AT_decl_line   : 48
    <d003b>   DW_AT_decl_column : 9
    <d003c>   DW_AT_type        : <0xcfc94>
    <d0040>   DW_AT_data_member_location: 168
 <2><d0041>: Abbrev Number: 1 (DW_TAG_member)
    <d0042>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <d0046>   DW_AT_decl_file   : 8
    <d0047>   DW_AT_decl_line   : 49
    <d0048>   DW_AT_decl_column : 17
    <d0049>   DW_AT_type        : <0xd00f7>
    <d004d>   DW_AT_data_member_location: 176
 <2><d004e>: Abbrev Number: 1 (DW_TAG_member)
    <d004f>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <d0053>   DW_AT_decl_file   : 8
    <d0054>   DW_AT_decl_line   : 49
    <d0055>   DW_AT_decl_column : 31
    <d0056>   DW_AT_type        : <0xd00f7>
    <d005a>   DW_AT_data_member_location: 184
 <2><d005b>: Abbrev Number: 1 (DW_TAG_member)
    <d005c>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <d0060>   DW_AT_decl_file   : 8
    <d0061>   DW_AT_decl_line   : 51
    <d0062>   DW_AT_decl_column : 6
    <d0063>   DW_AT_type        : <0xcfc94>
    <d0067>   DW_AT_data_member_location: 192
 <2><d0068>: Abbrev Number: 1 (DW_TAG_member)
    <d0069>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <d006d>   DW_AT_decl_file   : 8
    <d006e>   DW_AT_decl_line   : 53
    <d006f>   DW_AT_decl_column : 6
    <d0070>   DW_AT_type        : <0xcfc94>
    <d0074>   DW_AT_data_member_location: 196
 <2><d0075>: Abbrev Number: 12 (DW_TAG_member)
    <d0076>   DW_AT_name        : seq
    <d007a>   DW_AT_decl_file   : 8
    <d007a>   DW_AT_decl_line   : 54
    <d007b>   DW_AT_decl_column : 8
    <d007c>   DW_AT_type        : <0xd00fc>
    <d0080>   DW_AT_data_member_location: 200
 <2><d0081>: Abbrev Number: 4 (DW_TAG_member)
    <d0082>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <d0086>   DW_AT_decl_file   : 8
    <d0086>   DW_AT_decl_line   : 55
    <d0087>   DW_AT_decl_column : 8
    <d0088>   DW_AT_type        : <0xcff86>
    <d008c>   DW_AT_data_member_location: 336
 <2><d008e>: Abbrev Number: 4 (DW_TAG_member)
    <d008f>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <d0093>   DW_AT_decl_file   : 8
    <d0093>   DW_AT_decl_line   : 56
    <d0094>   DW_AT_decl_column : 8
    <d0095>   DW_AT_type        : <0xcff86>
    <d0099>   DW_AT_data_member_location: 344
 <2><d009b>: Abbrev Number: 4 (DW_TAG_member)
    <d009c>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <d00a0>   DW_AT_decl_file   : 8
    <d00a0>   DW_AT_decl_line   : 57
    <d00a1>   DW_AT_decl_column : 9
    <d00a2>   DW_AT_type        : <0xcff72>
    <d00a6>   DW_AT_data_member_location: 352
 <2><d00a8>: Abbrev Number: 4 (DW_TAG_member)
    <d00a9>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <d00ad>   DW_AT_decl_file   : 8
    <d00ad>   DW_AT_decl_line   : 58
    <d00ae>   DW_AT_decl_column : 9
    <d00af>   DW_AT_type        : <0xcff72>
    <d00b3>   DW_AT_data_member_location: 360
 <2><d00b5>: Abbrev Number: 4 (DW_TAG_member)
    <d00b6>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <d00ba>   DW_AT_decl_file   : 8
    <d00ba>   DW_AT_decl_line   : 59
    <d00bb>   DW_AT_decl_column : 8
    <d00bc>   DW_AT_type        : <0xcff86>
    <d00c0>   DW_AT_data_member_location: 368
 <2><d00c2>: Abbrev Number: 4 (DW_TAG_member)
    <d00c3>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <d00c7>   DW_AT_decl_file   : 8
    <d00c7>   DW_AT_decl_line   : 60
    <d00c8>   DW_AT_decl_column : 9
    <d00c9>   DW_AT_type        : <0xcff72>
    <d00cd>   DW_AT_data_member_location: 376
 <2><d00cf>: Abbrev Number: 4 (DW_TAG_member)
    <d00d0>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <d00d4>   DW_AT_decl_file   : 8
    <d00d4>   DW_AT_decl_line   : 61
    <d00d5>   DW_AT_decl_column : 9
    <d00d6>   DW_AT_type        : <0xcff72>
    <d00da>   DW_AT_data_member_location: 384
 <2><d00dc>: Abbrev Number: 4 (DW_TAG_member)
    <d00dd>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <d00e1>   DW_AT_decl_file   : 8
    <d00e1>   DW_AT_decl_line   : 62
    <d00e2>   DW_AT_decl_column : 9
    <d00e3>   DW_AT_type        : <0xd0121>
    <d00e7>   DW_AT_data_member_location: 392
 <2><d00e9>: Abbrev Number: 4 (DW_TAG_member)
    <d00ea>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <d00ee>   DW_AT_decl_file   : 8
    <d00ee>   DW_AT_decl_line   : 63
    <d00ef>   DW_AT_decl_column : 9
    <d00f0>   DW_AT_type        : <0xcff72>
    <d00f4>   DW_AT_data_member_location: 400
 <2><d00f6>: Abbrev Number: 0
 <1><d00f7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <d00f8>   DW_AT_byte_size   : 8
    <d00f8>   DW_AT_type        : <0xcfc6a>
 <1><d00fc>: Abbrev Number: 8 (DW_TAG_array_type)
    <d00fd>   DW_AT_type        : <0xcfcbc>
    <d0101>   DW_AT_sibling     : <0xd010c>
 <2><d0105>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <d0106>   DW_AT_type        : <0xcfc7f>
    <d010a>   DW_AT_upper_bound : 16
 <2><d010b>: Abbrev Number: 0
 <1><d010c>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <d010d>   DW_AT_prototyped  : 1
    <d010d>   DW_AT_sibling     : <0xd0121>
 <2><d0111>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d0112>   DW_AT_type        : <0xcfc94>
 <2><d0116>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d0117>   DW_AT_type        : <0xcfc94>
 <2><d011b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d011c>   DW_AT_type        : <0xcfc94>
 <2><d0120>: Abbrev Number: 0
 <1><d0121>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <d0122>   DW_AT_byte_size   : 8
    <d0122>   DW_AT_type        : <0xd010c>
 <1><d0126>: Abbrev Number: 5 (DW_TAG_typedef)
    <d0127>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <d012b>   DW_AT_decl_file   : 8
    <d012c>   DW_AT_decl_line   : 64
    <d012d>   DW_AT_decl_column : 3
    <d012e>   DW_AT_type        : <0xcff90>
 <1><d0132>: Abbrev Number: 26 (DW_TAG_variable)
    <d0133>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <d0137>   DW_AT_decl_file   : 8
    <d0138>   DW_AT_decl_line   : 66
    <d0139>   DW_AT_decl_column : 18
    <d013a>   DW_AT_type        : <0xd0126>
    <d013e>   DW_AT_external    : 1
    <d013e>   DW_AT_declaration : 1
 <1><d013e>: Abbrev Number: 14 (DW_TAG_subprogram)
    <d013f>   DW_AT_external    : 1
    <d013f>   DW_AT_name        : (indirect string, offset: 0x1b5de): fb_ConsoleClear
    <d0143>   DW_AT_decl_file   : 9
    <d0144>   DW_AT_decl_line   : 50
    <d0145>   DW_AT_decl_column : 21
    <d0146>   DW_AT_prototyped  : 1
    <d0146>   DW_AT_declaration : 1
    <d0146>   DW_AT_sibling     : <0xd0150>
 <2><d014a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d014b>   DW_AT_type        : <0xcfc94>
 <2><d014f>: Abbrev Number: 0
 <1><d0150>: Abbrev Number: 27 (DW_TAG_subprogram)
    <d0151>   DW_AT_external    : 1
    <d0151>   DW_AT_name        : (indirect string, offset: 0x1b80c): fb_hTermOut
    <d0155>   DW_AT_decl_file   : 8
    <d0156>   DW_AT_decl_line   : 73
    <d0157>   DW_AT_decl_column : 5
    <d0158>   DW_AT_prototyped  : 1
    <d0158>   DW_AT_type        : <0xcfc94>
    <d015c>   DW_AT_declaration : 1
    <d015c>   DW_AT_sibling     : <0xd0170>
 <2><d0160>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d0161>   DW_AT_type        : <0xcfc94>
 <2><d0165>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d0166>   DW_AT_type        : <0xcfc94>
 <2><d016a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d016b>   DW_AT_type        : <0xcfc94>
 <2><d016f>: Abbrev Number: 0
 <1><d0170>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d0171>   DW_AT_external    : 1
    <d0171>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <d0175>   DW_AT_decl_file   : 10
    <d0175>   DW_AT_decl_line   : 25
    <d0176>   DW_AT_decl_column : 13
    <d0176>   DW_AT_prototyped  : 1
    <d0176>   DW_AT_declaration : 1
 <1><d0176>: Abbrev Number: 14 (DW_TAG_subprogram)
    <d0177>   DW_AT_external    : 1
    <d0177>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <d017b>   DW_AT_decl_file   : 8
    <d017c>   DW_AT_decl_line   : 72
    <d017d>   DW_AT_decl_column : 6
    <d017e>   DW_AT_prototyped  : 1
    <d017e>   DW_AT_declaration : 1
    <d017e>   DW_AT_sibling     : <0xd0188>
 <2><d0182>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d0183>   DW_AT_type        : <0xcfc94>
 <2><d0187>: Abbrev Number: 0
 <1><d0188>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d0189>   DW_AT_external    : 1
    <d0189>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <d018d>   DW_AT_decl_file   : 10
    <d018d>   DW_AT_decl_line   : 24
    <d018e>   DW_AT_decl_column : 13
    <d018e>   DW_AT_prototyped  : 1
    <d018e>   DW_AT_declaration : 1
 <1><d018e>: Abbrev Number: 28 (DW_TAG_subprogram)
    <d018f>   DW_AT_external    : 1
    <d018f>   DW_AT_name        : (indirect string, offset: 0x1b722): fb_ConsoleWidth
    <d0193>   DW_AT_decl_file   : 1
    <d0194>   DW_AT_decl_line   : 6
    <d0195>   DW_AT_decl_column : 5
    <d0196>   DW_AT_prototyped  : 1
    <d0196>   DW_AT_type        : <0xcfc94>
    <d019a>   DW_AT_low_pc      : 0x474a30
    <d01a2>   DW_AT_high_pc     : 0x95
    <d01aa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d01ac>   DW_AT_call_all_calls: 1
 <2><d01ac>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <d01ad>   DW_AT_name        : (indirect string, offset: 0x1a968): cols
    <d01b1>   DW_AT_decl_file   : 1
    <d01b1>   DW_AT_decl_line   : 6
    <d01b1>   DW_AT_decl_column : 26
    <d01b2>   DW_AT_type        : <0xcfc94>
    <d01b6>   DW_AT_location    : 0x3d136 (location list)
    <d01ba>   DW_AT_GNU_locviews: 0x3d12e
 <2><d01be>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <d01bf>   DW_AT_name        : (indirect string, offset: 0x1a8c4): rows
    <d01c3>   DW_AT_decl_file   : 1
    <d01c3>   DW_AT_decl_line   : 6
    <d01c3>   DW_AT_decl_column : 36
    <d01c4>   DW_AT_type        : <0xcfc94>
    <d01c8>   DW_AT_location    : 0x3d157 (location list)
    <d01cc>   DW_AT_GNU_locviews: 0x3d14f
 <2><d01d0>: Abbrev Number: 29 (DW_TAG_variable)
    <d01d1>   DW_AT_name        : cur
    <d01d5>   DW_AT_decl_file   : 1
    <d01d6>   DW_AT_decl_line   : 15
    <d01d7>   DW_AT_decl_column : 6
    <d01d8>   DW_AT_type        : <0xcfc94>
    <d01dc>   DW_AT_location    : 0x3d176 (location list)
    <d01e0>   DW_AT_GNU_locviews: 0x3d170
 <2><d01e4>: Abbrev Number: 10 (DW_TAG_call_site)
    <d01e5>   DW_AT_call_return_pc: 0x474a4f
    <d01ed>   DW_AT_call_origin : <0xd0188>
 <2><d01f1>: Abbrev Number: 17 (DW_TAG_call_site)
    <d01f2>   DW_AT_call_return_pc: 0x474a59
    <d01fa>   DW_AT_call_origin : <0xd0176>
    <d01fe>   DW_AT_sibling     : <0xd0208>
 <3><d0202>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d0203>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d0205>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><d0207>: Abbrev Number: 0
 <2><d0208>: Abbrev Number: 10 (DW_TAG_call_site)
    <d0209>   DW_AT_call_return_pc: 0x474a5e
    <d0211>   DW_AT_call_origin : <0xd0170>
 <2><d0215>: Abbrev Number: 10 (DW_TAG_call_site)
    <d0216>   DW_AT_call_return_pc: 0x474a8d
    <d021e>   DW_AT_call_origin : <0xd0188>
 <2><d0222>: Abbrev Number: 17 (DW_TAG_call_site)
    <d0223>   DW_AT_call_return_pc: 0x474ab0
    <d022b>   DW_AT_call_origin : <0xd0150>
    <d022f>   DW_AT_sibling     : <0xd0245>
 <3><d0233>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d0234>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d0236>   DW_AT_call_value  : 1 byte block: 35 	(DW_OP_lit5)
 <3><d0238>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d0239>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d023b>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><d023e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d023f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d0241>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><d0244>: Abbrev Number: 0
 <2><d0245>: Abbrev Number: 10 (DW_TAG_call_site)
    <d0246>   DW_AT_call_return_pc: 0x474ab5
    <d024e>   DW_AT_call_origin : <0xd0170>
 <2><d0252>: Abbrev Number: 30 (DW_TAG_call_site)
    <d0253>   DW_AT_call_return_pc: 0x474abc
    <d025b>   DW_AT_call_origin : <0xd013e>
 <3><d025f>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d0260>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d0262>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><d0264>: Abbrev Number: 0
 <2><d0265>: Abbrev Number: 0
 <1><d0266>: Abbrev Number: 0
  Compilation Unit @ offset 0xd0267:
   Length:        0x39a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x120a7
   Pointer Size:  8
 <0><d0273>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <d0274>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d0278>   DW_AT_language    : 29	(C11)
    <d0279>   DW_AT_name        : (indirect line string, offset: 0x120d): src/rtlib/unix/io_xfocus.c
    <d027d>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d0281>   DW_AT_low_pc      : 0x474ad0
    <d0289>   DW_AT_high_pc     : 0x177
    <d0291>   DW_AT_stmt_list   : 0x695db
 <1><d0295>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0296>   DW_AT_byte_size   : 1
    <d0297>   DW_AT_encoding    : 8	(unsigned char)
    <d0298>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d029c>: Abbrev Number: 1 (DW_TAG_base_type)
    <d029d>   DW_AT_byte_size   : 2
    <d029e>   DW_AT_encoding    : 7	(unsigned)
    <d029f>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d02a3>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02a4>   DW_AT_byte_size   : 4
    <d02a5>   DW_AT_encoding    : 7	(unsigned)
    <d02a6>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d02aa>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02ab>   DW_AT_byte_size   : 8
    <d02ac>   DW_AT_encoding    : 7	(unsigned)
    <d02ad>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d02b1>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02b2>   DW_AT_byte_size   : 1
    <d02b3>   DW_AT_encoding    : 6	(signed char)
    <d02b4>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d02b8>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02b9>   DW_AT_byte_size   : 2
    <d02ba>   DW_AT_encoding    : 5	(signed)
    <d02bb>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d02bf>: Abbrev Number: 13 (DW_TAG_base_type)
    <d02c0>   DW_AT_byte_size   : 4
    <d02c1>   DW_AT_encoding    : 5	(signed)
    <d02c2>   DW_AT_name        : int
 <1><d02c6>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02c7>   DW_AT_byte_size   : 8
    <d02c8>   DW_AT_encoding    : 5	(signed)
    <d02c9>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d02cd>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d02ce>   DW_AT_byte_size   : 8
 <1><d02cf>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d02d0>   DW_AT_byte_size   : 8
    <d02d0>   DW_AT_type        : <0xd02d4>
 <1><d02d4>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02d5>   DW_AT_byte_size   : 1
    <d02d6>   DW_AT_encoding    : 6	(signed char)
    <d02d7>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d02db>: Abbrev Number: 15 (DW_TAG_const_type)
    <d02dc>   DW_AT_type        : <0xd02d4>
 <1><d02e0>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02e1>   DW_AT_byte_size   : 8
    <d02e2>   DW_AT_encoding    : 5	(signed)
    <d02e3>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d02e7>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02e8>   DW_AT_byte_size   : 8
    <d02e9>   DW_AT_encoding    : 7	(unsigned)
    <d02ea>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d02ee>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d02ef>   DW_AT_byte_size   : 8
    <d02ef>   DW_AT_type        : <0xd02db>
 <1><d02f3>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02f4>   DW_AT_byte_size   : 8
    <d02f5>   DW_AT_encoding    : 4	(float)
    <d02f6>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d02fa>: Abbrev Number: 1 (DW_TAG_base_type)
    <d02fb>   DW_AT_byte_size   : 4
    <d02fc>   DW_AT_encoding    : 4	(float)
    <d02fd>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d0301>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0302>   DW_AT_byte_size   : 8
    <d0302>   DW_AT_type        : <0xd02bf>
 <1><d0306>: Abbrev Number: 6 (DW_TAG_typedef)
    <d0307>   DW_AT_name        : (indirect string, offset: 0x17f2b): FB_DYLIB
    <d030b>   DW_AT_decl_file   : 2
    <d030c>   DW_AT_decl_line   : 7
    <d030d>   DW_AT_decl_column : 16
    <d030e>   DW_AT_type        : <0xd02cd>
 <1><d0312>: Abbrev Number: 16 (DW_TAG_typedef)
    <d0313>   DW_AT_name        : XID
    <d0317>   DW_AT_decl_file   : 3
    <d0318>   DW_AT_decl_line   : 66
    <d0319>   DW_AT_decl_column : 23
    <d031a>   DW_AT_type        : <0xd02aa>
 <1><d031e>: Abbrev Number: 6 (DW_TAG_typedef)
    <d031f>   DW_AT_name        : (indirect string, offset: 0x18e45): Window
    <d0323>   DW_AT_decl_file   : 3
    <d0324>   DW_AT_decl_line   : 96
    <d0325>   DW_AT_decl_column : 13
    <d0326>   DW_AT_type        : <0xd0312>
 <1><d032a>: Abbrev Number: 1 (DW_TAG_base_type)
    <d032b>   DW_AT_byte_size   : 16
    <d032c>   DW_AT_encoding    : 4	(float)
    <d032d>   DW_AT_name        : (indirect string, offset: 0x184ef): long double
 <1><d0331>: Abbrev Number: 17 (DW_TAG_structure_type)
    <d0332>   DW_AT_name        : (indirect string, offset: 0x18d82): _XDisplay
    <d0336>   DW_AT_declaration : 1
 <1><d0336>: Abbrev Number: 18 (DW_TAG_typedef)
    <d0337>   DW_AT_name        : (indirect string, offset: 0x18d84): Display
    <d033b>   DW_AT_decl_file   : 4
    <d033c>   DW_AT_decl_line   : 487
    <d033e>   DW_AT_decl_column : 26
    <d033f>   DW_AT_type        : <0xd0331>
 <1><d0343>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0344>   DW_AT_byte_size   : 8
    <d0344>   DW_AT_type        : <0xd0336>
 <1><d0348>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0349>   DW_AT_byte_size   : 8
    <d0349>   DW_AT_type        : <0xd034d>
 <1><d034d>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <d034e>   DW_AT_prototyped  : 1
    <d034e>   DW_AT_type        : <0xd02bf>
    <d0352>   DW_AT_sibling     : <0xd035c>
 <2><d0356>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d0357>   DW_AT_type        : <0xd0343>
 <2><d035b>: Abbrev Number: 0
 <1><d035c>: Abbrev Number: 6 (DW_TAG_typedef)
    <d035d>   DW_AT_name        : (indirect string, offset: 0x1ba69): XOPENDISPLAY
    <d0361>   DW_AT_decl_file   : 1
    <d0362>   DW_AT_decl_line   : 9
    <d0363>   DW_AT_decl_column : 20
    <d0364>   DW_AT_type        : <0xd0368>
 <1><d0368>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0369>   DW_AT_byte_size   : 8
    <d0369>   DW_AT_type        : <0xd036d>
 <1><d036d>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <d036e>   DW_AT_prototyped  : 1
    <d036e>   DW_AT_type        : <0xd0343>
    <d0372>   DW_AT_sibling     : <0xd037c>
 <2><d0376>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d0377>   DW_AT_type        : <0xd02cf>
 <2><d037b>: Abbrev Number: 0
 <1><d037c>: Abbrev Number: 6 (DW_TAG_typedef)
    <d037d>   DW_AT_name        : (indirect string, offset: 0x1bad8): XCLOSEDISPLAY
    <d0381>   DW_AT_decl_file   : 1
    <d0382>   DW_AT_decl_line   : 10
    <d0383>   DW_AT_decl_column : 15
    <d0384>   DW_AT_type        : <0xd0348>
 <1><d0388>: Abbrev Number: 6 (DW_TAG_typedef)
    <d0389>   DW_AT_name        : (indirect string, offset: 0x1bda9): XGETINPUTFOCUS
    <d038d>   DW_AT_decl_file   : 1
    <d038e>   DW_AT_decl_line   : 11
    <d038f>   DW_AT_decl_column : 15
    <d0390>   DW_AT_type        : <0xd0394>
 <1><d0394>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0395>   DW_AT_byte_size   : 8
    <d0395>   DW_AT_type        : <0xd0399>
 <1><d0399>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <d039a>   DW_AT_prototyped  : 1
    <d039a>   DW_AT_type        : <0xd02bf>
    <d039e>   DW_AT_sibling     : <0xd03b2>
 <2><d03a2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d03a3>   DW_AT_type        : <0xd0343>
 <2><d03a7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d03a8>   DW_AT_type        : <0xd03b2>
 <2><d03ac>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d03ad>   DW_AT_type        : <0xd0301>
 <2><d03b1>: Abbrev Number: 0
 <1><d03b2>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d03b3>   DW_AT_byte_size   : 8
    <d03b3>   DW_AT_type        : <0xd031e>
 <1><d03b7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d03b8>   DW_AT_byte_size   : 24
    <d03b9>   DW_AT_decl_file   : 1
    <d03ba>   DW_AT_decl_line   : 13
    <d03bb>   DW_AT_decl_column : 9
    <d03bc>   DW_AT_sibling     : <0xd03e5>
 <2><d03c0>: Abbrev Number: 8 (DW_TAG_member)
    <d03c1>   DW_AT_name        : (indirect string, offset: 0x18f87): OpenDisplay
    <d03c5>   DW_AT_decl_file   : 1
    <d03c5>   DW_AT_decl_line   : 14
    <d03c6>   DW_AT_decl_column : 15
    <d03c7>   DW_AT_type        : <0xd035c>
    <d03cb>   DW_AT_data_member_location: 0
 <2><d03cc>: Abbrev Number: 8 (DW_TAG_member)
    <d03cd>   DW_AT_name        : (indirect string, offset: 0x189f7): CloseDisplay
    <d03d1>   DW_AT_decl_file   : 1
    <d03d1>   DW_AT_decl_line   : 15
    <d03d2>   DW_AT_decl_column : 16
    <d03d3>   DW_AT_type        : <0xd037c>
    <d03d7>   DW_AT_data_member_location: 8
 <2><d03d8>: Abbrev Number: 8 (DW_TAG_member)
    <d03d9>   DW_AT_name        : (indirect string, offset: 0x1bdb8): GetInputFocus
    <d03dd>   DW_AT_decl_file   : 1
    <d03dd>   DW_AT_decl_line   : 16
    <d03de>   DW_AT_decl_column : 17
    <d03df>   DW_AT_type        : <0xd0388>
    <d03e3>   DW_AT_data_member_location: 16
 <2><d03e4>: Abbrev Number: 0
 <1><d03e5>: Abbrev Number: 6 (DW_TAG_typedef)
    <d03e6>   DW_AT_name        : (indirect string, offset: 0x1ba2b): X_FUNCS
    <d03ea>   DW_AT_decl_file   : 1
    <d03eb>   DW_AT_decl_line   : 17
    <d03ec>   DW_AT_decl_column : 3
    <d03ed>   DW_AT_type        : <0xd03b7>
 <1><d03f1>: Abbrev Number: 5 (DW_TAG_variable)
    <d03f2>   DW_AT_name        : (indirect string, offset: 0x1bd85): ref_count
    <d03f6>   DW_AT_decl_file   : 1
    <d03f6>   DW_AT_decl_line   : 19
    <d03f7>   DW_AT_decl_column : 12
    <d03f8>   DW_AT_type        : <0xd02bf>
    <d03fc>   DW_AT_location    : 9 byte block: 3 90 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a90)
 <1><d0406>: Abbrev Number: 5 (DW_TAG_variable)
    <d0407>   DW_AT_name        : (indirect string, offset: 0x1b9e3): xlib
    <d040b>   DW_AT_decl_file   : 1
    <d040b>   DW_AT_decl_line   : 20
    <d040c>   DW_AT_decl_column : 17
    <d040d>   DW_AT_type        : <0xd0306>
    <d0411>   DW_AT_location    : 9 byte block: 3 88 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a88)
 <1><d041b>: Abbrev Number: 20 (DW_TAG_variable)
    <d041c>   DW_AT_name        : X
    <d041e>   DW_AT_decl_file   : 1
    <d041f>   DW_AT_decl_line   : 21
    <d0420>   DW_AT_decl_column : 16
    <d0421>   DW_AT_type        : <0xd03e5>
    <d0425>   DW_AT_location    : 9 byte block: 3 70 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a70)
 <1><d042f>: Abbrev Number: 5 (DW_TAG_variable)
    <d0430>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <d0434>   DW_AT_decl_file   : 1
    <d0434>   DW_AT_decl_line   : 22
    <d0435>   DW_AT_decl_column : 17
    <d0436>   DW_AT_type        : <0xd0343>
    <d043a>   DW_AT_location    : 9 byte block: 3 68 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a68)
 <1><d0444>: Abbrev Number: 5 (DW_TAG_variable)
    <d0445>   DW_AT_name        : (indirect string, offset: 0x1bd9c): xterm_window
    <d0449>   DW_AT_decl_file   : 1
    <d0449>   DW_AT_decl_line   : 23
    <d044a>   DW_AT_decl_column : 15
    <d044b>   DW_AT_type        : <0xd031e>
    <d044f>   DW_AT_location    : 9 byte block: 3 60 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a60)
 <1><d0459>: Abbrev Number: 21 (DW_TAG_subprogram)
    <d045a>   DW_AT_external    : 1
    <d045a>   DW_AT_name        : (indirect string, offset: 0x1a286): fb_hDynUnload
    <d045e>   DW_AT_decl_file   : 2
    <d045f>   DW_AT_decl_line   : 12
    <d0460>   DW_AT_decl_column : 10
    <d0461>   DW_AT_prototyped  : 1
    <d0461>   DW_AT_declaration : 1
    <d0461>   DW_AT_sibling     : <0xd046b>
 <2><d0465>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d0466>   DW_AT_type        : <0xd046b>
 <2><d046a>: Abbrev Number: 0
 <1><d046b>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d046c>   DW_AT_byte_size   : 8
    <d046c>   DW_AT_type        : <0xd0306>
 <1><d0470>: Abbrev Number: 22 (DW_TAG_subprogram)
    <d0471>   DW_AT_external    : 1
    <d0471>   DW_AT_name        : (indirect string, offset: 0x1a359): fb_hDynLoad
    <d0475>   DW_AT_decl_file   : 2
    <d0476>   DW_AT_decl_line   : 10
    <d0477>   DW_AT_decl_column : 10
    <d0478>   DW_AT_prototyped  : 1
    <d0478>   DW_AT_type        : <0xd0306>
    <d047c>   DW_AT_declaration : 1
    <d047c>   DW_AT_sibling     : <0xd0490>
 <2><d0480>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d0481>   DW_AT_type        : <0xd02ee>
 <2><d0485>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d0486>   DW_AT_type        : <0xd0490>
 <2><d048a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d048b>   DW_AT_type        : <0xd0495>
 <2><d048f>: Abbrev Number: 0
 <1><d0490>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0491>   DW_AT_byte_size   : 8
    <d0491>   DW_AT_type        : <0xd02ee>
 <1><d0495>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <d0496>   DW_AT_byte_size   : 8
    <d0496>   DW_AT_type        : <0xd02cd>
 <1><d049a>: Abbrev Number: 10 (DW_TAG_subprogram)
    <d049b>   DW_AT_external    : 1
    <d049b>   DW_AT_name        : (indirect string, offset: 0x1bab0): fb_hXTermHasFocus
    <d049f>   DW_AT_decl_file   : 1
    <d049f>   DW_AT_decl_line   : 60
    <d04a0>   DW_AT_decl_column : 5
    <d04a0>   DW_AT_prototyped  : 1
    <d04a0>   DW_AT_type        : <0xd02bf>
    <d04a4>   DW_AT_low_pc      : 0x474bf0
    <d04ac>   DW_AT_high_pc     : 0x57
    <d04b4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d04b6>   DW_AT_call_all_calls: 1
    <d04b6>   DW_AT_sibling     : <0xd04fe>
 <2><d04ba>: Abbrev Number: 5 (DW_TAG_variable)
    <d04bb>   DW_AT_name        : (indirect string, offset: 0x1bd8f): focus_window
    <d04bf>   DW_AT_decl_file   : 1
    <d04bf>   DW_AT_decl_line   : 63
    <d04c0>   DW_AT_decl_column : 9
    <d04c1>   DW_AT_type        : <0xd031e>
    <d04c5>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><d04c8>: Abbrev Number: 5 (DW_TAG_variable)
    <d04c9>   DW_AT_name        : (indirect string, offset: 0x1a275): dummy
    <d04cd>   DW_AT_decl_file   : 1
    <d04cd>   DW_AT_decl_line   : 64
    <d04ce>   DW_AT_decl_column : 6
    <d04cf>   DW_AT_type        : <0xd02bf>
    <d04d3>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d04d6>: Abbrev Number: 9 (DW_TAG_call_site)
    <d04d7>   DW_AT_call_return_pc: 0x474c1b
    <d04df>   DW_AT_sibling     : <0xd04f0>
 <3><d04e3>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d04e4>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d04e6>   DW_AT_call_value  : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><d04e9>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d04ea>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d04ec>   DW_AT_call_value  : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><d04ef>: Abbrev Number: 0
 <2><d04f0>: Abbrev Number: 11 (DW_TAG_call_site)
    <d04f1>   DW_AT_call_return_pc: 0x474c47
    <d04f9>   DW_AT_call_origin : <0xd05fb>
 <2><d04fd>: Abbrev Number: 0
 <1><d04fe>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d04ff>   DW_AT_external    : 1
    <d04ff>   DW_AT_name        : (indirect string, offset: 0x1ba33): fb_hXTermExitFocus
    <d0503>   DW_AT_decl_file   : 1
    <d0504>   DW_AT_decl_line   : 49
    <d0505>   DW_AT_decl_column : 6
    <d0506>   DW_AT_prototyped  : 1
    <d0506>   DW_AT_low_pc      : 0x474bb0
    <d050e>   DW_AT_high_pc     : 0x39
    <d0516>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d0518>   DW_AT_call_all_tail_calls: 1
    <d0518>   DW_AT_sibling     : <0xd0538>
 <2><d051c>: Abbrev Number: 24 (DW_TAG_call_site)
    <d051d>   DW_AT_call_return_pc: 0x474be4
    <d0525>   DW_AT_call_tail_call: 1
    <d0525>   DW_AT_call_origin : <0xd0459>
 <3><d0529>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d052a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d052c>   DW_AT_call_value  : 9 byte block: 3 88 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a88)
 <3><d0536>: Abbrev Number: 0
 <2><d0537>: Abbrev Number: 0
 <1><d0538>: Abbrev Number: 10 (DW_TAG_subprogram)
    <d0539>   DW_AT_external    : 1
    <d0539>   DW_AT_name        : (indirect string, offset: 0x1baf7): fb_hXTermInitFocus
    <d053d>   DW_AT_decl_file   : 1
    <d053d>   DW_AT_decl_line   : 26
    <d053e>   DW_AT_decl_column : 5
    <d053e>   DW_AT_prototyped  : 1
    <d053e>   DW_AT_type        : <0xd02bf>
    <d0542>   DW_AT_low_pc      : 0x474ad0
    <d054a>   DW_AT_high_pc     : 0xdc
    <d0552>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d0554>   DW_AT_call_all_calls: 1
    <d0554>   DW_AT_sibling     : <0xd05eb>
 <2><d0558>: Abbrev Number: 5 (DW_TAG_variable)
    <d0559>   DW_AT_name        : (indirect string, offset: 0x17f25): funcs
    <d055d>   DW_AT_decl_file   : 1
    <d055d>   DW_AT_decl_line   : 29
    <d055e>   DW_AT_decl_column : 14
    <d055f>   DW_AT_type        : <0xd05eb>
    <d0563>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><d0566>: Abbrev Number: 5 (DW_TAG_variable)
    <d0567>   DW_AT_name        : (indirect string, offset: 0x1a275): dummy
    <d056b>   DW_AT_decl_file   : 1
    <d056b>   DW_AT_decl_line   : 30
    <d056c>   DW_AT_decl_column : 6
    <d056d>   DW_AT_type        : <0xd02bf>
    <d0571>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><d0575>: Abbrev Number: 25 (DW_TAG_call_site)
    <d0576>   DW_AT_call_return_pc: 0x474b68
    <d057e>   DW_AT_call_origin : <0xd0470>
    <d0582>   DW_AT_sibling     : <0xd05a7>
 <3><d0586>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d0587>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d0589>   DW_AT_call_value  : 9 byte block: 3 38 40 48 0 0 0 0 0 	(DW_OP_addr: 484038)
 <3><d0593>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d0594>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d0596>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><d0599>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d059a>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d059c>   DW_AT_call_value  : 9 byte block: 3 70 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a70)
 <3><d05a6>: Abbrev Number: 0
 <2><d05a7>: Abbrev Number: 9 (DW_TAG_call_site)
    <d05a8>   DW_AT_call_return_pc: 0x474b7c
    <d05b0>   DW_AT_sibling     : <0xd05bb>
 <3><d05b4>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d05b5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d05b7>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><d05ba>: Abbrev Number: 0
 <2><d05bb>: Abbrev Number: 9 (DW_TAG_call_site)
    <d05bc>   DW_AT_call_return_pc: 0x474b9d
    <d05c4>   DW_AT_sibling     : <0xd05dd>
 <3><d05c8>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d05c9>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d05cb>   DW_AT_call_value  : 9 byte block: 3 60 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6a60)
 <3><d05d5>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <d05d6>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d05d8>   DW_AT_call_value  : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <3><d05dc>: Abbrev Number: 0
 <2><d05dd>: Abbrev Number: 11 (DW_TAG_call_site)
    <d05de>   DW_AT_call_return_pc: 0x474bac
    <d05e6>   DW_AT_call_origin : <0xd05fb>
 <2><d05ea>: Abbrev Number: 0
 <1><d05eb>: Abbrev Number: 26 (DW_TAG_array_type)
    <d05ec>   DW_AT_type        : <0xd02ee>
    <d05f0>   DW_AT_sibling     : <0xd05fb>
 <2><d05f4>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <d05f5>   DW_AT_type        : <0xd02aa>
    <d05f9>   DW_AT_upper_bound : 3
 <2><d05fa>: Abbrev Number: 0
 <1><d05fb>: Abbrev Number: 28 (DW_TAG_subprogram)
    <d05fc>   DW_AT_external    : 1
    <d05fc>   DW_AT_declaration : 1
    <d05fc>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <d0600>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><d0604>: Abbrev Number: 0
  Compilation Unit @ offset 0xd0605:
   Length:        0xc7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1222c
   Pointer Size:  8
 <0><d0611>: Abbrev Number: 2 (DW_TAG_compile_unit)
    <d0612>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d0616>   DW_AT_language    : 29	(C11)
    <d0617>   DW_AT_name        : (indirect line string, offset: 0x1228): src/rtlib/scancodes.c
    <d061b>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d061f>   DW_AT_low_pc      : 0x474c50
    <d0627>   DW_AT_high_pc     : 0x15
    <d062f>   DW_AT_stmt_list   : 0x696f2
 <1><d0633>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0634>   DW_AT_byte_size   : 1
    <d0635>   DW_AT_encoding    : 8	(unsigned char)
    <d0636>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d063a>: Abbrev Number: 1 (DW_TAG_base_type)
    <d063b>   DW_AT_byte_size   : 2
    <d063c>   DW_AT_encoding    : 7	(unsigned)
    <d063d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d0641>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0642>   DW_AT_byte_size   : 4
    <d0643>   DW_AT_encoding    : 7	(unsigned)
    <d0644>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d0648>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0649>   DW_AT_byte_size   : 8
    <d064a>   DW_AT_encoding    : 7	(unsigned)
    <d064b>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d064f>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0650>   DW_AT_byte_size   : 1
    <d0651>   DW_AT_encoding    : 6	(signed char)
    <d0652>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d0656>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0657>   DW_AT_byte_size   : 2
    <d0658>   DW_AT_encoding    : 5	(signed)
    <d0659>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d065d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d065e>   DW_AT_byte_size   : 4
    <d065f>   DW_AT_encoding    : 5	(signed)
    <d0660>   DW_AT_name        : int
 <1><d0664>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0665>   DW_AT_byte_size   : 8
    <d0666>   DW_AT_encoding    : 5	(signed)
    <d0667>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d066b>: Abbrev Number: 1 (DW_TAG_base_type)
    <d066c>   DW_AT_byte_size   : 1
    <d066d>   DW_AT_encoding    : 6	(signed char)
    <d066e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d0672>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0673>   DW_AT_byte_size   : 8
    <d0674>   DW_AT_encoding    : 5	(signed)
    <d0675>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d0679>: Abbrev Number: 1 (DW_TAG_base_type)
    <d067a>   DW_AT_byte_size   : 8
    <d067b>   DW_AT_encoding    : 7	(unsigned)
    <d067c>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d0680>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0681>   DW_AT_byte_size   : 8
    <d0682>   DW_AT_encoding    : 4	(float)
    <d0683>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d0687>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0688>   DW_AT_byte_size   : 4
    <d0689>   DW_AT_encoding    : 4	(float)
    <d068a>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d068e>: Abbrev Number: 4 (DW_TAG_subprogram)
    <d068f>   DW_AT_external    : 1
    <d068f>   DW_AT_name        : (indirect string, offset: 0x19a35): fb_hScancodeToExtendedKey
    <d0693>   DW_AT_decl_file   : 1
    <d0694>   DW_AT_decl_line   : 3
    <d0695>   DW_AT_decl_column : 5
    <d0696>   DW_AT_prototyped  : 1
    <d0696>   DW_AT_type        : <0xd065d>
    <d069a>   DW_AT_low_pc      : 0x474c50
    <d06a2>   DW_AT_high_pc     : 0x15
    <d06aa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d06ac>   DW_AT_call_all_calls: 1
 <2><d06ac>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d06ad>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <d06b1>   DW_AT_decl_file   : 1
    <d06b2>   DW_AT_decl_line   : 3
    <d06b3>   DW_AT_decl_column : 36
    <d06b4>   DW_AT_type        : <0xd065d>
    <d06b8>   DW_AT_location    : 0x3d199 (location list)
    <d06bc>   DW_AT_GNU_locviews: 0x3d195
 <2><d06c0>: Abbrev Number: 6 (DW_TAG_variable)
    <d06c1>   DW_AT_name        : key
    <d06c5>   DW_AT_decl_file   : 1
    <d06c6>   DW_AT_decl_line   : 4
    <d06c7>   DW_AT_decl_column : 6
    <d06c8>   DW_AT_type        : <0xd065d>
    <d06cc>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (rax))
 <2><d06ce>: Abbrev Number: 0
 <1><d06cf>: Abbrev Number: 0
  Compilation Unit @ offset 0xd06d0:
   Length:        0x326 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x12296
   Pointer Size:  8
 <0><d06dc>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d06dd>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d06e1>   DW_AT_language    : 29	(C11)
    <d06e2>   DW_AT_name        : (indirect line string, offset: 0x123e): src/rtlib/unix/scancodes_x11.c
    <d06e6>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d06ea>   DW_AT_low_pc      : 0x474c70
    <d06f2>   DW_AT_high_pc     : 0x110
    <d06fa>   DW_AT_stmt_list   : 0x6974b
 <1><d06fe>: Abbrev Number: 1 (DW_TAG_base_type)
    <d06ff>   DW_AT_byte_size   : 1
    <d0700>   DW_AT_encoding    : 8	(unsigned char)
    <d0701>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d0705>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0706>   DW_AT_byte_size   : 2
    <d0707>   DW_AT_encoding    : 7	(unsigned)
    <d0708>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d070c>: Abbrev Number: 1 (DW_TAG_base_type)
    <d070d>   DW_AT_byte_size   : 4
    <d070e>   DW_AT_encoding    : 7	(unsigned)
    <d070f>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d0713>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0714>   DW_AT_byte_size   : 8
    <d0715>   DW_AT_encoding    : 7	(unsigned)
    <d0716>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d071a>: Abbrev Number: 1 (DW_TAG_base_type)
    <d071b>   DW_AT_byte_size   : 1
    <d071c>   DW_AT_encoding    : 6	(signed char)
    <d071d>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d0721>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0722>   DW_AT_byte_size   : 2
    <d0723>   DW_AT_encoding    : 5	(signed)
    <d0724>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d0728>: Abbrev Number: 16 (DW_TAG_base_type)
    <d0729>   DW_AT_byte_size   : 4
    <d072a>   DW_AT_encoding    : 5	(signed)
    <d072b>   DW_AT_name        : int
 <1><d072f>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0730>   DW_AT_byte_size   : 8
    <d0731>   DW_AT_encoding    : 5	(signed)
    <d0732>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d0736>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <d0737>   DW_AT_byte_size   : 8
 <1><d0738>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0739>   DW_AT_byte_size   : 1
    <d073a>   DW_AT_encoding    : 6	(signed char)
    <d073b>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d073f>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0740>   DW_AT_byte_size   : 8
    <d0741>   DW_AT_encoding    : 5	(signed)
    <d0742>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d0746>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0747>   DW_AT_byte_size   : 8
    <d0748>   DW_AT_encoding    : 7	(unsigned)
    <d0749>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d074d>: Abbrev Number: 1 (DW_TAG_base_type)
    <d074e>   DW_AT_byte_size   : 8
    <d074f>   DW_AT_encoding    : 4	(float)
    <d0750>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d0754>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0755>   DW_AT_byte_size   : 4
    <d0756>   DW_AT_encoding    : 4	(float)
    <d0757>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d075b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d075c>   DW_AT_byte_size   : 8
    <d075c>   DW_AT_type        : <0xd0728>
 <1><d0760>: Abbrev Number: 18 (DW_TAG_typedef)
    <d0761>   DW_AT_name        : XID
    <d0765>   DW_AT_decl_file   : 2
    <d0766>   DW_AT_decl_line   : 66
    <d0767>   DW_AT_decl_column : 23
    <d0768>   DW_AT_type        : <0xd0713>
 <1><d076c>: Abbrev Number: 5 (DW_TAG_typedef)
    <d076d>   DW_AT_name        : (indirect string, offset: 0x18991): KeySym
    <d0771>   DW_AT_decl_file   : 2
    <d0772>   DW_AT_decl_line   : 106
    <d0773>   DW_AT_decl_column : 13
    <d0774>   DW_AT_type        : <0xd0760>
 <1><d0778>: Abbrev Number: 5 (DW_TAG_typedef)
    <d0779>   DW_AT_name        : (indirect string, offset: 0x19b0e): KeyCode
    <d077d>   DW_AT_decl_file   : 2
    <d077e>   DW_AT_decl_line   : 108
    <d077f>   DW_AT_decl_column : 23
    <d0780>   DW_AT_type        : <0xd06fe>
 <1><d0784>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0785>   DW_AT_byte_size   : 16
    <d0786>   DW_AT_encoding    : 4	(float)
    <d0787>   DW_AT_name        : (indirect string, offset: 0x184ef): long double
 <1><d078b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d078c>   DW_AT_name        : (indirect string, offset: 0x18d82): _XDisplay
    <d0790>   DW_AT_declaration : 1
 <1><d0790>: Abbrev Number: 20 (DW_TAG_typedef)
    <d0791>   DW_AT_name        : (indirect string, offset: 0x18d84): Display
    <d0795>   DW_AT_decl_file   : 3
    <d0796>   DW_AT_decl_line   : 487
    <d0798>   DW_AT_decl_column : 26
    <d0799>   DW_AT_type        : <0xd078b>
 <1><d079d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d079e>   DW_AT_byte_size   : 8
    <d079e>   DW_AT_type        : <0xd0790>
 <1><d07a2>: Abbrev Number: 5 (DW_TAG_typedef)
    <d07a3>   DW_AT_name        : (indirect string, offset: 0x18adc): XDISPLAYKEYCODES
    <d07a7>   DW_AT_decl_file   : 4
    <d07a8>   DW_AT_decl_line   : 9
    <d07a9>   DW_AT_decl_column : 15
    <d07aa>   DW_AT_type        : <0xd07ae>
 <1><d07ae>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d07af>   DW_AT_byte_size   : 8
    <d07af>   DW_AT_type        : <0xd07b3>
 <1><d07b3>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <d07b4>   DW_AT_prototyped  : 1
    <d07b4>   DW_AT_type        : <0xd0728>
    <d07b8>   DW_AT_sibling     : <0xd07cc>
 <2><d07bc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07bd>   DW_AT_type        : <0xd079d>
 <2><d07c1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07c2>   DW_AT_type        : <0xd075b>
 <2><d07c6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07c7>   DW_AT_type        : <0xd075b>
 <2><d07cb>: Abbrev Number: 0
 <1><d07cc>: Abbrev Number: 5 (DW_TAG_typedef)
    <d07cd>   DW_AT_name        : (indirect string, offset: 0x187d6): XGETKEYBOARDMAPPING
    <d07d1>   DW_AT_decl_file   : 4
    <d07d2>   DW_AT_decl_line   : 10
    <d07d3>   DW_AT_decl_column : 19
    <d07d4>   DW_AT_type        : <0xd07d8>
 <1><d07d8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d07d9>   DW_AT_byte_size   : 8
    <d07d9>   DW_AT_type        : <0xd07dd>
 <1><d07dd>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <d07de>   DW_AT_prototyped  : 1
    <d07de>   DW_AT_type        : <0xd07fb>
    <d07e2>   DW_AT_sibling     : <0xd07fb>
 <2><d07e6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07e7>   DW_AT_type        : <0xd079d>
 <2><d07eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07ec>   DW_AT_type        : <0xd0778>
 <2><d07f0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07f1>   DW_AT_type        : <0xd0728>
 <2><d07f5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d07f6>   DW_AT_type        : <0xd075b>
 <2><d07fa>: Abbrev Number: 0
 <1><d07fb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d07fc>   DW_AT_byte_size   : 8
    <d07fc>   DW_AT_type        : <0xd076c>
 <1><d0800>: Abbrev Number: 5 (DW_TAG_typedef)
    <d0801>   DW_AT_name        : (indirect string, offset: 0x18af7): XFREE
    <d0805>   DW_AT_decl_file   : 4
    <d0806>   DW_AT_decl_line   : 11
    <d0807>   DW_AT_decl_column : 15
    <d0808>   DW_AT_type        : <0xd080c>
 <1><d080c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d080d>   DW_AT_byte_size   : 8
    <d080d>   DW_AT_type        : <0xd0811>
 <1><d0811>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <d0812>   DW_AT_prototyped  : 1
    <d0812>   DW_AT_type        : <0xd0728>
    <d0816>   DW_AT_sibling     : <0xd0820>
 <2><d081a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d081b>   DW_AT_type        : <0xd0736>
 <2><d081f>: Abbrev Number: 0
 <1><d0820>: Abbrev Number: 9 (DW_TAG_array_type)
    <d0821>   DW_AT_type        : <0xd06fe>
    <d0825>   DW_AT_sibling     : <0xd0830>
 <2><d0829>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d082a>   DW_AT_type        : <0xd0713>
    <d082e>   DW_AT_upper_bound : 255
 <2><d082f>: Abbrev Number: 0
 <1><d0830>: Abbrev Number: 21 (DW_TAG_variable)
    <d0831>   DW_AT_name        : (indirect string, offset: 0x19813): fb_x11keycode_to_scancode
    <d0835>   DW_AT_decl_file   : 4
    <d0836>   DW_AT_decl_line   : 13
    <d0837>   DW_AT_decl_column : 22
    <d0838>   DW_AT_type        : <0xd0820>
    <d083c>   DW_AT_external    : 1
    <d083c>   DW_AT_declaration : 1
 <1><d083c>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d083d>   DW_AT_name        : (indirect string, offset: 0x1bded): KeysymToScancode
    <d0841>   DW_AT_byte_size   : 16
    <d0842>   DW_AT_decl_file   : 1
    <d0843>   DW_AT_decl_line   : 6
    <d0844>   DW_AT_decl_column : 16
    <d0845>   DW_AT_sibling     : <0xd0862>
 <2><d0849>: Abbrev Number: 11 (DW_TAG_member)
    <d084a>   DW_AT_name        : (indirect string, offset: 0x1bdde): keysym
    <d084e>   DW_AT_decl_file   : 1
    <d084e>   DW_AT_decl_line   : 7
    <d084f>   DW_AT_decl_column : 9
    <d0850>   DW_AT_type        : <0xd076c>
    <d0854>   DW_AT_data_member_location: 0
 <2><d0855>: Abbrev Number: 11 (DW_TAG_member)
    <d0856>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <d085a>   DW_AT_decl_file   : 1
    <d085a>   DW_AT_decl_line   : 8
    <d085b>   DW_AT_decl_column : 6
    <d085c>   DW_AT_type        : <0xd0728>
    <d0860>   DW_AT_data_member_location: 8
 <2><d0861>: Abbrev Number: 0
 <1><d0862>: Abbrev Number: 5 (DW_TAG_typedef)
    <d0863>   DW_AT_name        : (indirect string, offset: 0x1bded): KeysymToScancode
    <d0867>   DW_AT_decl_file   : 1
    <d0868>   DW_AT_decl_line   : 9
    <d0869>   DW_AT_decl_column : 3
    <d086a>   DW_AT_type        : <0xd083c>
 <1><d086e>: Abbrev Number: 12 (DW_TAG_const_type)
    <d086f>   DW_AT_type        : <0xd0862>
 <1><d0873>: Abbrev Number: 9 (DW_TAG_array_type)
    <d0874>   DW_AT_type        : <0xd086e>
    <d0878>   DW_AT_sibling     : <0xd0883>
 <2><d087c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d087d>   DW_AT_type        : <0xd0713>
    <d0881>   DW_AT_upper_bound : 104
 <2><d0882>: Abbrev Number: 0
 <1><d0883>: Abbrev Number: 12 (DW_TAG_const_type)
    <d0884>   DW_AT_type        : <0xd0873>
 <1><d0888>: Abbrev Number: 6 (DW_TAG_variable)
    <d0889>   DW_AT_name        : (indirect string, offset: 0x1bdfe): keysym_to_scancode
    <d088d>   DW_AT_decl_file   : 1
    <d088d>   DW_AT_decl_line   : 11
    <d088e>   DW_AT_decl_column : 31
    <d088f>   DW_AT_type        : <0xd0883>
    <d0893>   DW_AT_location    : 9 byte block: 3 60 42 48 0 0 0 0 0 	(DW_OP_addr: 484260)
 <1><d089d>: Abbrev Number: 23 (DW_TAG_variable)
    <d089e>   DW_AT_specification: <0xd0830>
    <d08a2>   DW_AT_decl_file   : 1
    <d08a3>   DW_AT_decl_line   : 120
    <d08a4>   DW_AT_decl_column : 15
    <d08a5>   DW_AT_location    : 9 byte block: 3 a0 6a 4c 0 0 0 0 0 	(DW_OP_addr: 4c6aa0)
 <1><d08af>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d08b0>   DW_AT_external    : 1
    <d08b0>   DW_AT_name        : (indirect string, offset: 0x191be): fb_hInitX11KeycodeToScancodeTb
    <d08b4>   DW_AT_decl_file   : 1
    <d08b5>   DW_AT_decl_line   : 122
    <d08b6>   DW_AT_decl_column : 6
    <d08b7>   DW_AT_prototyped  : 1
    <d08b7>   DW_AT_low_pc      : 0x474c70
    <d08bf>   DW_AT_high_pc     : 0x110
    <d08c7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d08c9>   DW_AT_call_all_tail_calls: 1
    <d08c9>   DW_AT_sibling     : <0xd09f0>
 <2><d08cd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d08ce>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <d08d2>   DW_AT_decl_file   : 1
    <d08d2>   DW_AT_decl_line   : 124
    <d08d3>   DW_AT_decl_column : 12
    <d08d4>   DW_AT_type        : <0xd079d>
    <d08d8>   DW_AT_location    : 0x3d1bb (location list)
    <d08dc>   DW_AT_GNU_locviews: 0x3d1b3
 <2><d08e0>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d08e1>   DW_AT_name        : (indirect string, offset: 0x18721): DisplayKeycodes
    <d08e5>   DW_AT_decl_file   : 1
    <d08e5>   DW_AT_decl_line   : 125
    <d08e6>   DW_AT_decl_column : 20
    <d08e7>   DW_AT_type        : <0xd07a2>
    <d08eb>   DW_AT_location    : 0x3d1dc (location list)
    <d08ef>   DW_AT_GNU_locviews: 0x3d1d8
 <2><d08f3>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d08f4>   DW_AT_name        : (indirect string, offset: 0x188a6): GetKeyboardMapping
    <d08f8>   DW_AT_decl_file   : 1
    <d08f8>   DW_AT_decl_line   : 126
    <d08f9>   DW_AT_decl_column : 23
    <d08fa>   DW_AT_type        : <0xd07cc>
    <d08fe>   DW_AT_location    : 0x3d1f3 (location list)
    <d0902>   DW_AT_GNU_locviews: 0x3d1eb
 <2><d0906>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d0907>   DW_AT_name        : (indirect string, offset: 0x186c1): Free
    <d090b>   DW_AT_decl_file   : 1
    <d090b>   DW_AT_decl_line   : 127
    <d090c>   DW_AT_decl_column : 9
    <d090d>   DW_AT_type        : <0xd0800>
    <d0911>   DW_AT_location    : 0x3d218 (location list)
    <d0915>   DW_AT_GNU_locviews: 0x3d210
 <2><d0919>: Abbrev Number: 6 (DW_TAG_variable)
    <d091a>   DW_AT_name        : (indirect string, offset: 0x1bdd2): keycode_min
    <d091e>   DW_AT_decl_file   : 1
    <d091e>   DW_AT_decl_line   : 130
    <d091f>   DW_AT_decl_column : 6
    <d0920>   DW_AT_type        : <0xd0728>
    <d0924>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><d0928>: Abbrev Number: 6 (DW_TAG_variable)
    <d0929>   DW_AT_name        : (indirect string, offset: 0x1bdc6): keycode_max
    <d092d>   DW_AT_decl_file   : 1
    <d092d>   DW_AT_decl_line   : 130
    <d092e>   DW_AT_decl_column : 19
    <d092f>   DW_AT_type        : <0xd0728>
    <d0933>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><d0937>: Abbrev Number: 13 (DW_TAG_variable)
    <d0938>   DW_AT_name        : i
    <d093a>   DW_AT_decl_file   : 1
    <d093a>   DW_AT_decl_line   : 130
    <d093b>   DW_AT_decl_column : 32
    <d093c>   DW_AT_type        : <0xd0728>
    <d0940>   DW_AT_location    : 0x3d241 (location list)
    <d0944>   DW_AT_GNU_locviews: 0x3d235
 <2><d0948>: Abbrev Number: 13 (DW_TAG_variable)
    <d0949>   DW_AT_name        : j
    <d094b>   DW_AT_decl_file   : 1
    <d094b>   DW_AT_decl_line   : 130
    <d094c>   DW_AT_decl_column : 35
    <d094d>   DW_AT_type        : <0xd0728>
    <d0951>   DW_AT_location    : 0x3d279 (location list)
    <d0955>   DW_AT_GNU_locviews: 0x3d26f
 <2><d0959>: Abbrev Number: 6 (DW_TAG_variable)
    <d095a>   DW_AT_name        : (indirect string, offset: 0x1be11): keysyms_per_keycode_return
    <d095e>   DW_AT_decl_file   : 1
    <d095e>   DW_AT_decl_line   : 131
    <d095f>   DW_AT_decl_column : 6
    <d0960>   DW_AT_type        : <0xd0728>
    <d0964>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><d0968>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <d0969>   DW_AT_ranges      : 0x183be
    <d096d>   DW_AT_sibling     : <0xd09bc>
 <3><d0971>: Abbrev Number: 14 (DW_TAG_variable)
    <d0972>   DW_AT_name        : (indirect string, offset: 0x1bde5): keysyms
    <d0976>   DW_AT_decl_file   : 1
    <d0976>   DW_AT_decl_line   : 138
    <d0977>   DW_AT_decl_column : 11
    <d0978>   DW_AT_type        : <0xd07fb>
    <d097c>   DW_AT_location    : 0x3d2f1 (location list)
    <d0980>   DW_AT_GNU_locviews: 0x3d2e9
 <3><d0984>: Abbrev Number: 14 (DW_TAG_variable)
    <d0985>   DW_AT_name        : (indirect string, offset: 0x1bdde): keysym
    <d0989>   DW_AT_decl_file   : 1
    <d0989>   DW_AT_decl_line   : 140
    <d098a>   DW_AT_decl_column : 10
    <d098b>   DW_AT_type        : <0xd076c>
    <d098f>   DW_AT_location    : 0x3d313 (location list)
    <d0993>   DW_AT_GNU_locviews: 0x3d30d
 <3><d0997>: Abbrev Number: 26 (DW_TAG_call_site)
    <d0998>   DW_AT_call_return_pc: 0x474d0e
 <4><d09a0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09a1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d09a3>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><d09a6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09a7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d09a9>   DW_AT_call_value  : 5 byte block: 73 0 8 ff 1a 	(DW_OP_breg3 (rbx): 0; DW_OP_const1u: 255; DW_OP_and)
 <4><d09af>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09b0>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d09b2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><d09b4>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09b5>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <d09b7>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><d09ba>: Abbrev Number: 0
 <3><d09bb>: Abbrev Number: 0
 <2><d09bc>: Abbrev Number: 27 (DW_TAG_call_site)
    <d09bd>   DW_AT_call_return_pc: 0x474ca7
    <d09c5>   DW_AT_call_target : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
    <d09c9>   DW_AT_sibling     : <0xd09e2>
 <3><d09cd>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09ce>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d09d0>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><d09d3>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09d4>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d09d6>   DW_AT_call_value  : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><d09da>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <d09db>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d09dd>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><d09e1>: Abbrev Number: 0
 <2><d09e2>: Abbrev Number: 28 (DW_TAG_call_site)
    <d09e3>   DW_AT_call_return_pc: 0x474d80
    <d09eb>   DW_AT_call_origin : <0xd09f0>
 <2><d09ef>: Abbrev Number: 0
 <1><d09f0>: Abbrev Number: 29 (DW_TAG_subprogram)
    <d09f1>   DW_AT_external    : 1
    <d09f1>   DW_AT_declaration : 1
    <d09f1>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <d09f5>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><d09f9>: Abbrev Number: 0
  Compilation Unit @ offset 0xd09fa:
   Length:        0x16f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1241e
   Pointer Size:  8
 <0><d0a06>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <d0a07>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d0a0b>   DW_AT_language    : 29	(C11)
    <d0a0c>   DW_AT_name        : (indirect line string, offset: 0x125d): src/rtlib/str_asc.c
    <d0a10>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d0a14>   DW_AT_low_pc      : 0x474d80
    <d0a1c>   DW_AT_high_pc     : 0x58
    <d0a24>   DW_AT_stmt_list   : 0x6988a
 <1><d0a28>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a29>   DW_AT_byte_size   : 1
    <d0a2a>   DW_AT_encoding    : 8	(unsigned char)
    <d0a2b>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d0a2f>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a30>   DW_AT_byte_size   : 2
    <d0a31>   DW_AT_encoding    : 7	(unsigned)
    <d0a32>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d0a36>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a37>   DW_AT_byte_size   : 4
    <d0a38>   DW_AT_encoding    : 7	(unsigned)
    <d0a39>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d0a3d>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a3e>   DW_AT_byte_size   : 8
    <d0a3f>   DW_AT_encoding    : 7	(unsigned)
    <d0a40>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d0a44>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a45>   DW_AT_byte_size   : 1
    <d0a46>   DW_AT_encoding    : 6	(signed char)
    <d0a47>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d0a4b>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a4c>   DW_AT_byte_size   : 2
    <d0a4d>   DW_AT_encoding    : 5	(signed)
    <d0a4e>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d0a52>: Abbrev Number: 8 (DW_TAG_base_type)
    <d0a53>   DW_AT_byte_size   : 4
    <d0a54>   DW_AT_encoding    : 5	(signed)
    <d0a55>   DW_AT_name        : int
 <1><d0a59>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a5a>   DW_AT_byte_size   : 8
    <d0a5b>   DW_AT_encoding    : 5	(signed)
    <d0a5c>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d0a60>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0a61>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <d0a65>   DW_AT_decl_file   : 2
    <d0a66>   DW_AT_decl_line   : 194
    <d0a67>   DW_AT_decl_column : 27
    <d0a68>   DW_AT_type        : <0xd0a59>
 <1><d0a6c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <d0a6d>   DW_AT_byte_size   : 8
    <d0a6d>   DW_AT_type        : <0xd0a71>
 <1><d0a71>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a72>   DW_AT_byte_size   : 1
    <d0a73>   DW_AT_encoding    : 6	(signed char)
    <d0a74>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d0a78>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a79>   DW_AT_byte_size   : 8
    <d0a7a>   DW_AT_encoding    : 5	(signed)
    <d0a7b>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d0a7f>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0a80>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <d0a84>   DW_AT_decl_file   : 3
    <d0a85>   DW_AT_decl_line   : 108
    <d0a86>   DW_AT_decl_column : 19
    <d0a87>   DW_AT_type        : <0xd0a60>
 <1><d0a8b>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0a8c>   DW_AT_byte_size   : 8
    <d0a8d>   DW_AT_encoding    : 7	(unsigned)
    <d0a8e>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d0a92>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0a93>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <d0a97>   DW_AT_byte_size   : 24
    <d0a98>   DW_AT_decl_file   : 4
    <d0a99>   DW_AT_decl_line   : 82
    <d0a9a>   DW_AT_decl_column : 16
    <d0a9b>   DW_AT_sibling     : <0xd0ac3>
 <2><d0a9f>: Abbrev Number: 4 (DW_TAG_member)
    <d0aa0>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <d0aa4>   DW_AT_decl_file   : 4
    <d0aa4>   DW_AT_decl_line   : 83
    <d0aa5>   DW_AT_decl_column : 21
    <d0aa5>   DW_AT_type        : <0xd0a6c>
    <d0aa9>   DW_AT_data_member_location: 0
 <2><d0aaa>: Abbrev Number: 10 (DW_TAG_member)
    <d0aab>   DW_AT_name        : len
    <d0aaf>   DW_AT_decl_file   : 4
    <d0ab0>   DW_AT_decl_line   : 84
    <d0ab1>   DW_AT_decl_column : 21
    <d0ab2>   DW_AT_type        : <0xd0a7f>
    <d0ab6>   DW_AT_data_member_location: 8
 <2><d0ab7>: Abbrev Number: 4 (DW_TAG_member)
    <d0ab8>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d0abc>   DW_AT_decl_file   : 4
    <d0abc>   DW_AT_decl_line   : 85
    <d0abd>   DW_AT_decl_column : 21
    <d0abd>   DW_AT_type        : <0xd0a7f>
    <d0ac1>   DW_AT_data_member_location: 16
 <2><d0ac2>: Abbrev Number: 0
 <1><d0ac3>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0ac4>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <d0ac8>   DW_AT_decl_file   : 4
    <d0ac9>   DW_AT_decl_line   : 86
    <d0aca>   DW_AT_decl_column : 3
    <d0acb>   DW_AT_type        : <0xd0a92>
 <1><d0acf>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0ad0>   DW_AT_byte_size   : 8
    <d0ad1>   DW_AT_encoding    : 4	(float)
    <d0ad2>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d0ad6>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0ad7>   DW_AT_byte_size   : 4
    <d0ad8>   DW_AT_encoding    : 4	(float)
    <d0ad9>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d0add>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <d0ade>   DW_AT_byte_size   : 8
    <d0ade>   DW_AT_type        : <0xd0ac3>
 <1><d0ae2>: Abbrev Number: 11 (DW_TAG_subprogram)
    <d0ae3>   DW_AT_external    : 1
    <d0ae3>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <d0ae7>   DW_AT_decl_file   : 4
    <d0ae8>   DW_AT_decl_line   : 111
    <d0ae9>   DW_AT_decl_column : 21
    <d0aea>   DW_AT_prototyped  : 1
    <d0aea>   DW_AT_type        : <0xd0a52>
    <d0aee>   DW_AT_declaration : 1
    <d0aee>   DW_AT_sibling     : <0xd0af8>
 <2><d0af2>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <d0af3>   DW_AT_type        : <0xd0add>
 <2><d0af7>: Abbrev Number: 0
 <1><d0af8>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d0af9>   DW_AT_external    : 1
    <d0af9>   DW_AT_name        : (indirect string, offset: 0x142b6): fb_ASC
    <d0afd>   DW_AT_decl_file   : 1
    <d0afe>   DW_AT_decl_line   : 5
    <d0aff>   DW_AT_decl_column : 21
    <d0b00>   DW_AT_prototyped  : 1
    <d0b00>   DW_AT_type        : <0xd0a36>
    <d0b04>   DW_AT_low_pc      : 0x474d80
    <d0b0c>   DW_AT_high_pc     : 0x58
    <d0b14>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d0b16>   DW_AT_call_all_calls: 1
 <2><d0b16>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d0b17>   DW_AT_name        : str
    <d0b1b>   DW_AT_decl_file   : 1
    <d0b1b>   DW_AT_decl_line   : 5
    <d0b1b>   DW_AT_decl_column : 39
    <d0b1c>   DW_AT_type        : <0xd0add>
    <d0b20>   DW_AT_location    : 0x3d33a (location list)
    <d0b24>   DW_AT_GNU_locviews: 0x3d334
 <2><d0b28>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d0b29>   DW_AT_name        : pos
    <d0b2d>   DW_AT_decl_file   : 1
    <d0b2d>   DW_AT_decl_line   : 5
    <d0b2d>   DW_AT_decl_column : 52
    <d0b2e>   DW_AT_type        : <0xd0a7f>
    <d0b32>   DW_AT_location    : 0x3d353 (location list)
    <d0b36>   DW_AT_GNU_locviews: 0x3d34d
 <2><d0b3a>: Abbrev Number: 6 (DW_TAG_variable)
    <d0b3b>   DW_AT_name        : a
    <d0b3d>   DW_AT_decl_file   : 1
    <d0b3d>   DW_AT_decl_line   : 7
    <d0b3e>   DW_AT_decl_column : 18
    <d0b3f>   DW_AT_type        : <0xd0a36>
    <d0b43>   DW_AT_location    : 0x3d36c (location list)
    <d0b47>   DW_AT_GNU_locviews: 0x3d366
 <2><d0b4b>: Abbrev Number: 6 (DW_TAG_variable)
    <d0b4c>   DW_AT_name        : len
    <d0b50>   DW_AT_decl_file   : 1
    <d0b50>   DW_AT_decl_line   : 8
    <d0b51>   DW_AT_decl_column : 10
    <d0b52>   DW_AT_type        : <0xd0a7f>
    <d0b56>   DW_AT_location    : 0x3d37e (location list)
    <d0b5a>   DW_AT_GNU_locviews: 0x3d37c
 <2><d0b5e>: Abbrev Number: 14 (DW_TAG_call_site)
    <d0b5f>   DW_AT_call_return_pc: 0x474dba
    <d0b67>   DW_AT_call_origin : <0xd0ae2>
 <2><d0b6b>: Abbrev Number: 0
 <1><d0b6c>: Abbrev Number: 0
  Compilation Unit @ offset 0xd0b6d:
   Length:        0x7aa (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x12503
   Pointer Size:  8
 <0><d0b79>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <d0b7a>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d0b7e>   DW_AT_language    : 29	(C11)
    <d0b7f>   DW_AT_name        : (indirect line string, offset: 0x1271): src/rtlib/str_assign.c
    <d0b83>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d0b87>   DW_AT_low_pc      : 0x474de0
    <d0b8f>   DW_AT_high_pc     : 0x5eb
    <d0b97>   DW_AT_stmt_list   : 0x69950
 <1><d0b9b>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0b9c>   DW_AT_byte_size   : 1
    <d0b9d>   DW_AT_encoding    : 8	(unsigned char)
    <d0b9e>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d0ba2>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0ba3>   DW_AT_byte_size   : 2
    <d0ba4>   DW_AT_encoding    : 7	(unsigned)
    <d0ba5>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d0ba9>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0baa>   DW_AT_byte_size   : 4
    <d0bab>   DW_AT_encoding    : 7	(unsigned)
    <d0bac>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d0bb0>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0bb1>   DW_AT_byte_size   : 8
    <d0bb2>   DW_AT_encoding    : 7	(unsigned)
    <d0bb3>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d0bb7>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0bb8>   DW_AT_byte_size   : 1
    <d0bb9>   DW_AT_encoding    : 6	(signed char)
    <d0bba>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d0bbe>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0bbf>   DW_AT_byte_size   : 2
    <d0bc0>   DW_AT_encoding    : 5	(signed)
    <d0bc1>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d0bc5>: Abbrev Number: 22 (DW_TAG_base_type)
    <d0bc6>   DW_AT_byte_size   : 4
    <d0bc7>   DW_AT_encoding    : 5	(signed)
    <d0bc8>   DW_AT_name        : int
 <1><d0bcc>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0bcd>   DW_AT_byte_size   : 8
    <d0bce>   DW_AT_encoding    : 5	(signed)
    <d0bcf>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d0bd3>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <d0bd4>   DW_AT_byte_size   : 8
 <1><d0bd5>: Abbrev Number: 9 (DW_TAG_typedef)
    <d0bd6>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <d0bda>   DW_AT_decl_file   : 2
    <d0bdb>   DW_AT_decl_line   : 194
    <d0bdc>   DW_AT_decl_column : 27
    <d0bdd>   DW_AT_type        : <0xd0bcc>
 <1><d0be1>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <d0be2>   DW_AT_byte_size   : 8
    <d0be2>   DW_AT_type        : <0xd0be6>
 <1><d0be6>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0be7>   DW_AT_byte_size   : 1
    <d0be8>   DW_AT_encoding    : 6	(signed char)
    <d0be9>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d0bed>: Abbrev Number: 24 (DW_TAG_const_type)
    <d0bee>   DW_AT_type        : <0xd0be6>
 <1><d0bf2>: Abbrev Number: 9 (DW_TAG_typedef)
    <d0bf3>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <d0bf7>   DW_AT_decl_file   : 3
    <d0bf8>   DW_AT_decl_line   : 209
    <d0bf9>   DW_AT_decl_column : 23
    <d0bfa>   DW_AT_type        : <0xd0bb0>
 <1><d0bfe>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0bff>   DW_AT_byte_size   : 8
    <d0c00>   DW_AT_encoding    : 5	(signed)
    <d0c01>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d0c05>: Abbrev Number: 9 (DW_TAG_typedef)
    <d0c06>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <d0c0a>   DW_AT_decl_file   : 4
    <d0c0b>   DW_AT_decl_line   : 108
    <d0c0c>   DW_AT_decl_column : 19
    <d0c0d>   DW_AT_type        : <0xd0bd5>
 <1><d0c11>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0c12>   DW_AT_byte_size   : 8
    <d0c13>   DW_AT_encoding    : 7	(unsigned)
    <d0c14>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d0c18>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <d0c19>   DW_AT_byte_size   : 8
    <d0c19>   DW_AT_type        : <0xd0bed>
 <1><d0c1d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <d0c1e>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <d0c22>   DW_AT_byte_size   : 24
    <d0c23>   DW_AT_decl_file   : 5
    <d0c24>   DW_AT_decl_line   : 82
    <d0c25>   DW_AT_decl_column : 16
    <d0c26>   DW_AT_sibling     : <0xd0c4e>
 <2><d0c2a>: Abbrev Number: 15 (DW_TAG_member)
    <d0c2b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <d0c2f>   DW_AT_decl_file   : 5
    <d0c2f>   DW_AT_decl_line   : 83
    <d0c30>   DW_AT_decl_column : 21
    <d0c30>   DW_AT_type        : <0xd0be1>
    <d0c34>   DW_AT_data_member_location: 0
 <2><d0c35>: Abbrev Number: 26 (DW_TAG_member)
    <d0c36>   DW_AT_name        : len
    <d0c3a>   DW_AT_decl_file   : 5
    <d0c3b>   DW_AT_decl_line   : 84
    <d0c3c>   DW_AT_decl_column : 21
    <d0c3d>   DW_AT_type        : <0xd0c05>
    <d0c41>   DW_AT_data_member_location: 8
 <2><d0c42>: Abbrev Number: 15 (DW_TAG_member)
    <d0c43>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d0c47>   DW_AT_decl_file   : 5
    <d0c47>   DW_AT_decl_line   : 85
    <d0c48>   DW_AT_decl_column : 21
    <d0c48>   DW_AT_type        : <0xd0c05>
    <d0c4c>   DW_AT_data_member_location: 16
 <2><d0c4d>: Abbrev Number: 0
 <1><d0c4e>: Abbrev Number: 9 (DW_TAG_typedef)
    <d0c4f>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <d0c53>   DW_AT_decl_file   : 5
    <d0c54>   DW_AT_decl_line   : 86
    <d0c55>   DW_AT_decl_column : 3
    <d0c56>   DW_AT_type        : <0xd0c1d>
 <1><d0c5a>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0c5b>   DW_AT_byte_size   : 8
    <d0c5c>   DW_AT_encoding    : 4	(float)
    <d0c5d>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d0c61>: Abbrev Number: 5 (DW_TAG_base_type)
    <d0c62>   DW_AT_byte_size   : 4
    <d0c63>   DW_AT_encoding    : 4	(float)
    <d0c64>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d0c68>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <d0c69>   DW_AT_byte_size   : 8
    <d0c69>   DW_AT_type        : <0xd0c4e>
 <1><d0c6d>: Abbrev Number: 8 (DW_TAG_subprogram)
    <d0c6e>   DW_AT_external    : 1
    <d0c6e>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <d0c72>   DW_AT_decl_file   : 6
    <d0c73>   DW_AT_decl_line   : 61
    <d0c74>   DW_AT_decl_column : 14
    <d0c75>   DW_AT_prototyped  : 1
