    <c53cf>   DW_AT_sibling     : <0xc53e1>
 <2><c53d3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c53d4>   DW_AT_abstract_origin: <0xc4f28>
    <c53d8>   DW_AT_location    : 0x3b568 (location list)
    <c53dc>   DW_AT_GNU_locviews: 0x3b562
 <2><c53e0>: Abbrev Number: 0
 <1><c53e1>: Abbrev Number: 72 (DW_TAG_subprogram)
    <c53e2>   DW_AT_abstract_origin: <0xc4ef5>
    <c53e6>   DW_AT_low_pc      : 0x4728b0
    <c53ee>   DW_AT_high_pc     : 0xb8
    <c53f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c53f8>   DW_AT_call_all_calls: 1
 <2><c53f8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c53f9>   DW_AT_abstract_origin: <0xc4f06>
    <c53fd>   DW_AT_location    : 0x3b589 (location list)
    <c5401>   DW_AT_GNU_locviews: 0x3b581
 <2><c5405>: Abbrev Number: 8 (DW_TAG_variable)
    <c5406>   DW_AT_abstract_origin: <0xc4f11>
    <c540a>   DW_AT_location    : 0x3b5b1 (location list)
    <c540e>   DW_AT_GNU_locviews: 0x3b5a9
 <2><c5412>: Abbrev Number: 41 (DW_TAG_inlined_subroutine)
    <c5413>   DW_AT_abstract_origin: <0xc4f1b>
    <c5417>   DW_AT_entry_pc    : 0x472905
    <c541f>   DW_AT_GNU_entry_view: 1
    <c5420>   DW_AT_low_pc      : 0x472905
    <c5428>   DW_AT_high_pc     : 0x59
    <c5430>   DW_AT_call_file   : 1
    <c5430>   DW_AT_call_line   : 218
    <c5431>   DW_AT_call_column : 3
    <c5431>   DW_AT_sibling     : <0xc5443>
 <3><c5435>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c5436>   DW_AT_abstract_origin: <0xc4f28>
    <c543a>   DW_AT_location    : 0x3b5d4 (location list)
    <c543e>   DW_AT_GNU_locviews: 0x3b5ce
 <3><c5442>: Abbrev Number: 0
 <2><c5443>: Abbrev Number: 9 (DW_TAG_call_site)
    <c5444>   DW_AT_call_return_pc: 0x4728c0
    <c544c>   DW_AT_call_origin : <0xc4f32>
 <2><c5450>: Abbrev Number: 9 (DW_TAG_call_site)
    <c5451>   DW_AT_call_return_pc: 0x472905
    <c5459>   DW_AT_call_origin : <0xc4c54>
 <2><c545d>: Abbrev Number: 9 (DW_TAG_call_site)
    <c545e>   DW_AT_call_return_pc: 0x472963
    <c5466>   DW_AT_call_origin : <0xc4c4e>
 <2><c546a>: Abbrev Number: 0
 <1><c546b>: Abbrev Number: 0
  Compilation Unit @ offset 0xc546c:
   Length:        0x309 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xfbd3
   Pointer Size:  8
 <0><c5478>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <c5479>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c547d>   DW_AT_language    : 29	(C11)
    <c547e>   DW_AT_name        : (indirect line string, offset: 0xfec): src/rtlib/unix/io_isredir.c
    <c5482>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c5486>   DW_AT_low_pc      : 0x472c50
    <c548e>   DW_AT_high_pc     : 0x2b
    <c5496>   DW_AT_stmt_list   : 0x67855
 <1><c549a>: Abbrev Number: 2 (DW_TAG_base_type)
    <c549b>   DW_AT_byte_size   : 1
    <c549c>   DW_AT_encoding    : 8	(unsigned char)
    <c549d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c54a1>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54a2>   DW_AT_byte_size   : 2
    <c54a3>   DW_AT_encoding    : 7	(unsigned)
    <c54a4>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c54a8>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54a9>   DW_AT_byte_size   : 4
    <c54aa>   DW_AT_encoding    : 7	(unsigned)
    <c54ab>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c54af>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54b0>   DW_AT_byte_size   : 8
    <c54b1>   DW_AT_encoding    : 7	(unsigned)
    <c54b2>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c54b6>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54b7>   DW_AT_byte_size   : 1
    <c54b8>   DW_AT_encoding    : 6	(signed char)
    <c54b9>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c54bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54be>   DW_AT_byte_size   : 2
    <c54bf>   DW_AT_encoding    : 5	(signed)
    <c54c0>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c54c4>: Abbrev Number: 13 (DW_TAG_base_type)
    <c54c5>   DW_AT_byte_size   : 4
    <c54c6>   DW_AT_encoding    : 5	(signed)
    <c54c7>   DW_AT_name        : int
 <1><c54cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54cc>   DW_AT_byte_size   : 8
    <c54cd>   DW_AT_encoding    : 5	(signed)
    <c54ce>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c54d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <c54d3>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <c54d7>   DW_AT_decl_file   : 2
    <c54d8>   DW_AT_decl_line   : 152
    <c54d9>   DW_AT_decl_column : 25
    <c54da>   DW_AT_type        : <0xc54cb>
 <1><c54de>: Abbrev Number: 4 (DW_TAG_typedef)
    <c54df>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c54e3>   DW_AT_decl_file   : 2
    <c54e4>   DW_AT_decl_line   : 153
    <c54e5>   DW_AT_decl_column : 27
    <c54e6>   DW_AT_type        : <0xc54cb>
 <1><c54ea>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <c54eb>   DW_AT_byte_size   : 8
 <1><c54ec>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c54ed>   DW_AT_byte_size   : 8
    <c54ed>   DW_AT_type        : <0xc54f1>
 <1><c54f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <c54f2>   DW_AT_byte_size   : 1
    <c54f3>   DW_AT_encoding    : 6	(signed char)
    <c54f4>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c54f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <c54f9>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c54fd>   DW_AT_decl_file   : 3
    <c54fe>   DW_AT_decl_line   : 209
    <c54ff>   DW_AT_decl_column : 23
    <c5500>   DW_AT_type        : <0xc54af>
 <1><c5504>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5505>   DW_AT_byte_size   : 8
    <c5506>   DW_AT_encoding    : 5	(signed)
    <c5507>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c550b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c550c>   DW_AT_byte_size   : 8
    <c550d>   DW_AT_encoding    : 7	(unsigned)
    <c550e>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c5512>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c5513>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <c5517>   DW_AT_byte_size   : 216
    <c5518>   DW_AT_decl_file   : 4
    <c5519>   DW_AT_decl_line   : 49
    <c551a>   DW_AT_decl_column : 8
    <c551b>   DW_AT_sibling     : <0xc567c>
 <2><c551f>: Abbrev Number: 1 (DW_TAG_member)
    <c5520>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <c5524>   DW_AT_decl_file   : 4
    <c5524>   DW_AT_decl_line   : 51
    <c5525>   DW_AT_decl_column : 7
    <c5526>   DW_AT_type        : <0xc54c4>
    <c552a>   DW_AT_data_member_location: 0
 <2><c552b>: Abbrev Number: 1 (DW_TAG_member)
    <c552c>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <c5530>   DW_AT_decl_file   : 4
    <c5530>   DW_AT_decl_line   : 54
    <c5531>   DW_AT_decl_column : 9
    <c5532>   DW_AT_type        : <0xc54ec>
    <c5536>   DW_AT_data_member_location: 8
 <2><c5537>: Abbrev Number: 1 (DW_TAG_member)
    <c5538>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <c553c>   DW_AT_decl_file   : 4
    <c553c>   DW_AT_decl_line   : 55
    <c553d>   DW_AT_decl_column : 9
    <c553e>   DW_AT_type        : <0xc54ec>
    <c5542>   DW_AT_data_member_location: 16
 <2><c5543>: Abbrev Number: 1 (DW_TAG_member)
    <c5544>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <c5548>   DW_AT_decl_file   : 4
    <c5548>   DW_AT_decl_line   : 56
    <c5549>   DW_AT_decl_column : 9
    <c554a>   DW_AT_type        : <0xc54ec>
    <c554e>   DW_AT_data_member_location: 24
 <2><c554f>: Abbrev Number: 1 (DW_TAG_member)
    <c5550>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <c5554>   DW_AT_decl_file   : 4
    <c5554>   DW_AT_decl_line   : 57
    <c5555>   DW_AT_decl_column : 9
    <c5556>   DW_AT_type        : <0xc54ec>
    <c555a>   DW_AT_data_member_location: 32
 <2><c555b>: Abbrev Number: 1 (DW_TAG_member)
    <c555c>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <c5560>   DW_AT_decl_file   : 4
    <c5560>   DW_AT_decl_line   : 58
    <c5561>   DW_AT_decl_column : 9
    <c5562>   DW_AT_type        : <0xc54ec>
    <c5566>   DW_AT_data_member_location: 40
 <2><c5567>: Abbrev Number: 1 (DW_TAG_member)
    <c5568>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <c556c>   DW_AT_decl_file   : 4
    <c556c>   DW_AT_decl_line   : 59
    <c556d>   DW_AT_decl_column : 9
    <c556e>   DW_AT_type        : <0xc54ec>
    <c5572>   DW_AT_data_member_location: 48
 <2><c5573>: Abbrev Number: 1 (DW_TAG_member)
    <c5574>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <c5578>   DW_AT_decl_file   : 4
    <c5578>   DW_AT_decl_line   : 60
    <c5579>   DW_AT_decl_column : 9
    <c557a>   DW_AT_type        : <0xc54ec>
    <c557e>   DW_AT_data_member_location: 56
 <2><c557f>: Abbrev Number: 1 (DW_TAG_member)
    <c5580>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <c5584>   DW_AT_decl_file   : 4
    <c5584>   DW_AT_decl_line   : 61
    <c5585>   DW_AT_decl_column : 9
    <c5586>   DW_AT_type        : <0xc54ec>
    <c558a>   DW_AT_data_member_location: 64
 <2><c558b>: Abbrev Number: 1 (DW_TAG_member)
    <c558c>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <c5590>   DW_AT_decl_file   : 4
    <c5590>   DW_AT_decl_line   : 64
    <c5591>   DW_AT_decl_column : 9
    <c5592>   DW_AT_type        : <0xc54ec>
    <c5596>   DW_AT_data_member_location: 72
 <2><c5597>: Abbrev Number: 1 (DW_TAG_member)
    <c5598>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <c559c>   DW_AT_decl_file   : 4
    <c559c>   DW_AT_decl_line   : 65
    <c559d>   DW_AT_decl_column : 9
    <c559e>   DW_AT_type        : <0xc54ec>
    <c55a2>   DW_AT_data_member_location: 80
 <2><c55a3>: Abbrev Number: 1 (DW_TAG_member)
    <c55a4>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <c55a8>   DW_AT_decl_file   : 4
    <c55a8>   DW_AT_decl_line   : 66
    <c55a9>   DW_AT_decl_column : 9
    <c55aa>   DW_AT_type        : <0xc54ec>
    <c55ae>   DW_AT_data_member_location: 88
 <2><c55af>: Abbrev Number: 1 (DW_TAG_member)
    <c55b0>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <c55b4>   DW_AT_decl_file   : 4
    <c55b4>   DW_AT_decl_line   : 68
    <c55b5>   DW_AT_decl_column : 22
    <c55b6>   DW_AT_type        : <0xc5695>
    <c55ba>   DW_AT_data_member_location: 96
 <2><c55bb>: Abbrev Number: 1 (DW_TAG_member)
    <c55bc>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <c55c0>   DW_AT_decl_file   : 4
    <c55c0>   DW_AT_decl_line   : 70
    <c55c1>   DW_AT_decl_column : 20
    <c55c2>   DW_AT_type        : <0xc569a>
    <c55c6>   DW_AT_data_member_location: 104
 <2><c55c7>: Abbrev Number: 1 (DW_TAG_member)
    <c55c8>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <c55cc>   DW_AT_decl_file   : 4
    <c55cc>   DW_AT_decl_line   : 72
    <c55cd>   DW_AT_decl_column : 7
    <c55ce>   DW_AT_type        : <0xc54c4>
    <c55d2>   DW_AT_data_member_location: 112
 <2><c55d3>: Abbrev Number: 1 (DW_TAG_member)
    <c55d4>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <c55d8>   DW_AT_decl_file   : 4
    <c55d8>   DW_AT_decl_line   : 73
    <c55d9>   DW_AT_decl_column : 7
    <c55da>   DW_AT_type        : <0xc54c4>
    <c55de>   DW_AT_data_member_location: 116
 <2><c55df>: Abbrev Number: 1 (DW_TAG_member)
    <c55e0>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <c55e4>   DW_AT_decl_file   : 4
    <c55e4>   DW_AT_decl_line   : 74
    <c55e5>   DW_AT_decl_column : 11
    <c55e6>   DW_AT_type        : <0xc54d2>
    <c55ea>   DW_AT_data_member_location: 120
 <2><c55eb>: Abbrev Number: 1 (DW_TAG_member)
    <c55ec>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <c55f0>   DW_AT_decl_file   : 4
    <c55f0>   DW_AT_decl_line   : 77
    <c55f1>   DW_AT_decl_column : 18
    <c55f2>   DW_AT_type        : <0xc54a1>
    <c55f6>   DW_AT_data_member_location: 128
 <2><c55f7>: Abbrev Number: 1 (DW_TAG_member)
    <c55f8>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <c55fc>   DW_AT_decl_file   : 4
    <c55fc>   DW_AT_decl_line   : 78
    <c55fd>   DW_AT_decl_column : 15
    <c55fe>   DW_AT_type        : <0xc54b6>
    <c5602>   DW_AT_data_member_location: 130
 <2><c5603>: Abbrev Number: 1 (DW_TAG_member)
    <c5604>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <c5608>   DW_AT_decl_file   : 4
    <c5608>   DW_AT_decl_line   : 79
    <c5609>   DW_AT_decl_column : 8
    <c560a>   DW_AT_type        : <0xc569f>
    <c560e>   DW_AT_data_member_location: 131
 <2><c560f>: Abbrev Number: 1 (DW_TAG_member)
    <c5610>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <c5614>   DW_AT_decl_file   : 4
    <c5614>   DW_AT_decl_line   : 81
    <c5615>   DW_AT_decl_column : 15
    <c5616>   DW_AT_type        : <0xc56af>
    <c561a>   DW_AT_data_member_location: 136
 <2><c561b>: Abbrev Number: 1 (DW_TAG_member)
    <c561c>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <c5620>   DW_AT_decl_file   : 4
    <c5620>   DW_AT_decl_line   : 89
    <c5621>   DW_AT_decl_column : 13
    <c5622>   DW_AT_type        : <0xc54de>
    <c5626>   DW_AT_data_member_location: 144
 <2><c5627>: Abbrev Number: 1 (DW_TAG_member)
    <c5628>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <c562c>   DW_AT_decl_file   : 4
    <c562c>   DW_AT_decl_line   : 91
    <c562d>   DW_AT_decl_column : 23
    <c562e>   DW_AT_type        : <0xc56b9>
    <c5632>   DW_AT_data_member_location: 152
 <2><c5633>: Abbrev Number: 1 (DW_TAG_member)
    <c5634>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <c5638>   DW_AT_decl_file   : 4
    <c5638>   DW_AT_decl_line   : 92
    <c5639>   DW_AT_decl_column : 25
    <c563a>   DW_AT_type        : <0xc56c3>
    <c563e>   DW_AT_data_member_location: 160
 <2><c563f>: Abbrev Number: 1 (DW_TAG_member)
    <c5640>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <c5644>   DW_AT_decl_file   : 4
    <c5644>   DW_AT_decl_line   : 93
    <c5645>   DW_AT_decl_column : 20
    <c5646>   DW_AT_type        : <0xc569a>
    <c564a>   DW_AT_data_member_location: 168
 <2><c564b>: Abbrev Number: 1 (DW_TAG_member)
    <c564c>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <c5650>   DW_AT_decl_file   : 4
    <c5650>   DW_AT_decl_line   : 94
    <c5651>   DW_AT_decl_column : 9
    <c5652>   DW_AT_type        : <0xc54ea>
    <c5656>   DW_AT_data_member_location: 176
 <2><c5657>: Abbrev Number: 1 (DW_TAG_member)
    <c5658>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <c565c>   DW_AT_decl_file   : 4
    <c565c>   DW_AT_decl_line   : 95
    <c565d>   DW_AT_decl_column : 10
    <c565e>   DW_AT_type        : <0xc54f8>
    <c5662>   DW_AT_data_member_location: 184
 <2><c5663>: Abbrev Number: 1 (DW_TAG_member)
    <c5664>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <c5668>   DW_AT_decl_file   : 4
    <c5668>   DW_AT_decl_line   : 96
    <c5669>   DW_AT_decl_column : 7
    <c566a>   DW_AT_type        : <0xc54c4>
    <c566e>   DW_AT_data_member_location: 192
 <2><c566f>: Abbrev Number: 1 (DW_TAG_member)
    <c5670>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <c5674>   DW_AT_decl_file   : 4
    <c5674>   DW_AT_decl_line   : 98
    <c5675>   DW_AT_decl_column : 8
    <c5676>   DW_AT_type        : <0xc56c8>
    <c567a>   DW_AT_data_member_location: 196
 <2><c567b>: Abbrev Number: 0
 <1><c567c>: Abbrev Number: 4 (DW_TAG_typedef)
    <c567d>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <c5681>   DW_AT_decl_file   : 5
    <c5682>   DW_AT_decl_line   : 7
    <c5683>   DW_AT_decl_column : 25
    <c5684>   DW_AT_type        : <0xc5512>
 <1><c5688>: Abbrev Number: 16 (DW_TAG_typedef)
    <c5689>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <c568d>   DW_AT_decl_file   : 4
    <c568e>   DW_AT_decl_line   : 43
    <c568f>   DW_AT_decl_column : 14
 <1><c5690>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c5691>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <c5695>   DW_AT_declaration : 1
 <1><c5695>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5696>   DW_AT_byte_size   : 8
    <c5696>   DW_AT_type        : <0xc5690>
 <1><c569a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c569b>   DW_AT_byte_size   : 8
    <c569b>   DW_AT_type        : <0xc5512>
 <1><c569f>: Abbrev Number: 6 (DW_TAG_array_type)
    <c56a0>   DW_AT_type        : <0xc54f1>
    <c56a4>   DW_AT_sibling     : <0xc56af>
 <2><c56a8>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c56a9>   DW_AT_type        : <0xc54af>
    <c56ad>   DW_AT_upper_bound : 0
 <2><c56ae>: Abbrev Number: 0
 <1><c56af>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c56b0>   DW_AT_byte_size   : 8
    <c56b0>   DW_AT_type        : <0xc5688>
 <1><c56b4>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c56b5>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <c56b9>   DW_AT_declaration : 1
 <1><c56b9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c56ba>   DW_AT_byte_size   : 8
    <c56ba>   DW_AT_type        : <0xc56b4>
 <1><c56be>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c56bf>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <c56c3>   DW_AT_declaration : 1
 <1><c56c3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c56c4>   DW_AT_byte_size   : 8
    <c56c4>   DW_AT_type        : <0xc56be>
 <1><c56c8>: Abbrev Number: 6 (DW_TAG_array_type)
    <c56c9>   DW_AT_type        : <0xc54f1>
    <c56cd>   DW_AT_sibling     : <0xc56d8>
 <2><c56d1>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c56d2>   DW_AT_type        : <0xc54af>
    <c56d6>   DW_AT_upper_bound : 19
 <2><c56d7>: Abbrev Number: 0
 <1><c56d8>: Abbrev Number: 8 (DW_TAG_variable)
    <c56d9>   DW_AT_name        : (indirect string, offset: 0x1b976): stdin
    <c56dd>   DW_AT_decl_file   : 6
    <c56dd>   DW_AT_decl_line   : 137
    <c56de>   DW_AT_decl_column : 14
    <c56de>   DW_AT_type        : <0xc56e2>
    <c56e2>   DW_AT_external    : 1
    <c56e2>   DW_AT_declaration : 1
 <1><c56e2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c56e3>   DW_AT_byte_size   : 8
    <c56e3>   DW_AT_type        : <0xc567c>
 <1><c56e7>: Abbrev Number: 8 (DW_TAG_variable)
    <c56e8>   DW_AT_name        : (indirect string, offset: 0x1b9ba): stdout
    <c56ec>   DW_AT_decl_file   : 6
    <c56ec>   DW_AT_decl_line   : 138
    <c56ed>   DW_AT_decl_column : 14
    <c56ed>   DW_AT_type        : <0xc56e2>
    <c56f1>   DW_AT_external    : 1
    <c56f1>   DW_AT_declaration : 1
 <1><c56f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <c56f2>   DW_AT_byte_size   : 8
    <c56f3>   DW_AT_encoding    : 4	(float)
    <c56f4>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c56f8>: Abbrev Number: 2 (DW_TAG_base_type)
    <c56f9>   DW_AT_byte_size   : 4
    <c56fa>   DW_AT_encoding    : 4	(float)
    <c56fb>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c56ff>: Abbrev Number: 9 (DW_TAG_subprogram)
    <c5700>   DW_AT_external    : 1
    <c5700>   DW_AT_name        : (indirect string, offset: 0x1b9b3): isatty
    <c5704>   DW_AT_decl_file   : 7
    <c5705>   DW_AT_decl_line   : 791
    <c5707>   DW_AT_decl_column : 12
    <c5707>   DW_AT_prototyped  : 1
    <c5707>   DW_AT_type        : <0xc54c4>
    <c570b>   DW_AT_declaration : 1
    <c570b>   DW_AT_sibling     : <0xc5715>
 <2><c570f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <c5710>   DW_AT_type        : <0xc54c4>
 <2><c5714>: Abbrev Number: 0
 <1><c5715>: Abbrev Number: 9 (DW_TAG_subprogram)
    <c5716>   DW_AT_external    : 1
    <c5716>   DW_AT_name        : (indirect string, offset: 0x16d1d): fileno
    <c571a>   DW_AT_decl_file   : 6
    <c571b>   DW_AT_decl_line   : 785
    <c571d>   DW_AT_decl_column : 12
    <c571d>   DW_AT_prototyped  : 1
    <c571d>   DW_AT_type        : <0xc54c4>
    <c5721>   DW_AT_declaration : 1
    <c5721>   DW_AT_sibling     : <0xc572b>
 <2><c5725>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <c5726>   DW_AT_type        : <0xc56e2>
 <2><c572a>: Abbrev Number: 0
 <1><c572b>: Abbrev Number: 17 (DW_TAG_subprogram)
    <c572c>   DW_AT_external    : 1
    <c572c>   DW_AT_name        : (indirect string, offset: 0x1b66c): fb_ConsoleIsRedirected
    <c5730>   DW_AT_decl_file   : 1
    <c5731>   DW_AT_decl_line   : 3
    <c5732>   DW_AT_decl_column : 5
    <c5733>   DW_AT_prototyped  : 1
    <c5733>   DW_AT_type        : <0xc54c4>
    <c5737>   DW_AT_low_pc      : 0x472c50
    <c573f>   DW_AT_high_pc     : 0x2b
    <c5747>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c5749>   DW_AT_call_all_calls: 1
 <2><c5749>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <c574a>   DW_AT_name        : (indirect string, offset: 0x1a72b): is_input
    <c574e>   DW_AT_decl_file   : 1
    <c574f>   DW_AT_decl_line   : 3
    <c5750>   DW_AT_decl_column : 33
    <c5751>   DW_AT_type        : <0xc54c4>
    <c5755>   DW_AT_location    : 0x3b600 (location list)
    <c5759>   DW_AT_GNU_locviews: 0x3b5fc
 <2><c575d>: Abbrev Number: 11 (DW_TAG_call_site)
    <c575e>   DW_AT_call_return_pc: 0x472c6a
    <c5766>   DW_AT_call_origin : <0xc5715>
 <2><c576a>: Abbrev Number: 11 (DW_TAG_call_site)
    <c576b>   DW_AT_call_return_pc: 0x472c71
    <c5773>   DW_AT_call_origin : <0xc56ff>
 <2><c5777>: Abbrev Number: 0
 <1><c5778>: Abbrev Number: 0
  Compilation Unit @ offset 0xc5779:
   Length:        0x6ab (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xfcd4
   Pointer Size:  8
 <0><c5785>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <c5786>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c578a>   DW_AT_language    : 29	(C11)
    <c578b>   DW_AT_name        : (indirect line string, offset: 0x1008): src/rtlib/unix/io_locate.c
    <c578f>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c5793>   DW_AT_low_pc      : 0x472c80
    <c579b>   DW_AT_high_pc     : 0x142
    <c57a3>   DW_AT_stmt_list   : 0x678e2
 <1><c57a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57a8>   DW_AT_byte_size   : 1
    <c57a9>   DW_AT_encoding    : 8	(unsigned char)
    <c57aa>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c57ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57af>   DW_AT_byte_size   : 2
    <c57b0>   DW_AT_encoding    : 7	(unsigned)
    <c57b1>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c57b5>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57b6>   DW_AT_byte_size   : 4
    <c57b7>   DW_AT_encoding    : 7	(unsigned)
    <c57b8>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c57bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57bd>   DW_AT_byte_size   : 8
    <c57be>   DW_AT_encoding    : 7	(unsigned)
    <c57bf>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c57c3>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57c4>   DW_AT_byte_size   : 1
    <c57c5>   DW_AT_encoding    : 6	(signed char)
    <c57c6>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c57ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57cb>   DW_AT_byte_size   : 2
    <c57cc>   DW_AT_encoding    : 5	(signed)
    <c57cd>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c57d1>: Abbrev Number: 20 (DW_TAG_base_type)
    <c57d2>   DW_AT_byte_size   : 4
    <c57d3>   DW_AT_encoding    : 5	(signed)
    <c57d4>   DW_AT_name        : int
 <1><c57d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57d9>   DW_AT_byte_size   : 8
    <c57da>   DW_AT_encoding    : 5	(signed)
    <c57db>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c57df>: Abbrev Number: 7 (DW_TAG_typedef)
    <c57e0>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <c57e4>   DW_AT_decl_file   : 2
    <c57e5>   DW_AT_decl_line   : 152
    <c57e6>   DW_AT_decl_column : 25
    <c57e7>   DW_AT_type        : <0xc57d8>
 <1><c57eb>: Abbrev Number: 7 (DW_TAG_typedef)
    <c57ec>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c57f0>   DW_AT_decl_file   : 2
    <c57f1>   DW_AT_decl_line   : 153
    <c57f2>   DW_AT_decl_column : 27
    <c57f3>   DW_AT_type        : <0xc57d8>
 <1><c57f7>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c57f8>   DW_AT_byte_size   : 8
 <1><c57f9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c57fa>   DW_AT_byte_size   : 8
    <c57fa>   DW_AT_type        : <0xc57fe>
 <1><c57fe>: Abbrev Number: 2 (DW_TAG_base_type)
    <c57ff>   DW_AT_byte_size   : 1
    <c5800>   DW_AT_encoding    : 6	(signed char)
    <c5801>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c5805>: Abbrev Number: 7 (DW_TAG_typedef)
    <c5806>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c580a>   DW_AT_decl_file   : 3
    <c580b>   DW_AT_decl_line   : 209
    <c580c>   DW_AT_decl_column : 23
    <c580d>   DW_AT_type        : <0xc57bc>
 <1><c5811>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5812>   DW_AT_byte_size   : 8
    <c5813>   DW_AT_encoding    : 5	(signed)
    <c5814>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c5818>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5819>   DW_AT_byte_size   : 8
    <c581a>   DW_AT_encoding    : 7	(unsigned)
    <c581b>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c581f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c5820>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <c5824>   DW_AT_byte_size   : 216
    <c5825>   DW_AT_decl_file   : 4
    <c5826>   DW_AT_decl_line   : 49
    <c5827>   DW_AT_decl_column : 8
    <c5827>   DW_AT_sibling     : <0xc59a5>
 <2><c582b>: Abbrev Number: 1 (DW_TAG_member)
    <c582c>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <c5830>   DW_AT_decl_file   : 4
    <c5831>   DW_AT_decl_line   : 51
    <c5832>   DW_AT_decl_column : 7
    <c5833>   DW_AT_type        : <0xc57d1>
    <c5837>   DW_AT_data_member_location: 0
 <2><c5838>: Abbrev Number: 1 (DW_TAG_member)
    <c5839>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <c583d>   DW_AT_decl_file   : 4
    <c583e>   DW_AT_decl_line   : 54
    <c583f>   DW_AT_decl_column : 9
    <c5840>   DW_AT_type        : <0xc57f9>
    <c5844>   DW_AT_data_member_location: 8
 <2><c5845>: Abbrev Number: 1 (DW_TAG_member)
    <c5846>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <c584a>   DW_AT_decl_file   : 4
    <c584b>   DW_AT_decl_line   : 55
    <c584c>   DW_AT_decl_column : 9
    <c584d>   DW_AT_type        : <0xc57f9>
    <c5851>   DW_AT_data_member_location: 16
 <2><c5852>: Abbrev Number: 1 (DW_TAG_member)
    <c5853>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <c5857>   DW_AT_decl_file   : 4
    <c5858>   DW_AT_decl_line   : 56
    <c5859>   DW_AT_decl_column : 9
    <c585a>   DW_AT_type        : <0xc57f9>
    <c585e>   DW_AT_data_member_location: 24
 <2><c585f>: Abbrev Number: 1 (DW_TAG_member)
    <c5860>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <c5864>   DW_AT_decl_file   : 4
    <c5865>   DW_AT_decl_line   : 57
    <c5866>   DW_AT_decl_column : 9
    <c5867>   DW_AT_type        : <0xc57f9>
    <c586b>   DW_AT_data_member_location: 32
 <2><c586c>: Abbrev Number: 1 (DW_TAG_member)
    <c586d>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <c5871>   DW_AT_decl_file   : 4
    <c5872>   DW_AT_decl_line   : 58
    <c5873>   DW_AT_decl_column : 9
    <c5874>   DW_AT_type        : <0xc57f9>
    <c5878>   DW_AT_data_member_location: 40
 <2><c5879>: Abbrev Number: 1 (DW_TAG_member)
    <c587a>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <c587e>   DW_AT_decl_file   : 4
    <c587f>   DW_AT_decl_line   : 59
    <c5880>   DW_AT_decl_column : 9
    <c5881>   DW_AT_type        : <0xc57f9>
    <c5885>   DW_AT_data_member_location: 48
 <2><c5886>: Abbrev Number: 1 (DW_TAG_member)
    <c5887>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <c588b>   DW_AT_decl_file   : 4
    <c588c>   DW_AT_decl_line   : 60
    <c588d>   DW_AT_decl_column : 9
    <c588e>   DW_AT_type        : <0xc57f9>
    <c5892>   DW_AT_data_member_location: 56
 <2><c5893>: Abbrev Number: 1 (DW_TAG_member)
    <c5894>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <c5898>   DW_AT_decl_file   : 4
    <c5899>   DW_AT_decl_line   : 61
    <c589a>   DW_AT_decl_column : 9
    <c589b>   DW_AT_type        : <0xc57f9>
    <c589f>   DW_AT_data_member_location: 64
 <2><c58a0>: Abbrev Number: 1 (DW_TAG_member)
    <c58a1>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <c58a5>   DW_AT_decl_file   : 4
    <c58a6>   DW_AT_decl_line   : 64
    <c58a7>   DW_AT_decl_column : 9
    <c58a8>   DW_AT_type        : <0xc57f9>
    <c58ac>   DW_AT_data_member_location: 72
 <2><c58ad>: Abbrev Number: 1 (DW_TAG_member)
    <c58ae>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <c58b2>   DW_AT_decl_file   : 4
    <c58b3>   DW_AT_decl_line   : 65
    <c58b4>   DW_AT_decl_column : 9
    <c58b5>   DW_AT_type        : <0xc57f9>
    <c58b9>   DW_AT_data_member_location: 80
 <2><c58ba>: Abbrev Number: 1 (DW_TAG_member)
    <c58bb>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <c58bf>   DW_AT_decl_file   : 4
    <c58c0>   DW_AT_decl_line   : 66
    <c58c1>   DW_AT_decl_column : 9
    <c58c2>   DW_AT_type        : <0xc57f9>
    <c58c6>   DW_AT_data_member_location: 88
 <2><c58c7>: Abbrev Number: 1 (DW_TAG_member)
    <c58c8>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <c58cc>   DW_AT_decl_file   : 4
    <c58cd>   DW_AT_decl_line   : 68
    <c58ce>   DW_AT_decl_column : 22
    <c58cf>   DW_AT_type        : <0xc59be>
    <c58d3>   DW_AT_data_member_location: 96
 <2><c58d4>: Abbrev Number: 1 (DW_TAG_member)
    <c58d5>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <c58d9>   DW_AT_decl_file   : 4
    <c58da>   DW_AT_decl_line   : 70
    <c58db>   DW_AT_decl_column : 20
    <c58dc>   DW_AT_type        : <0xc59c3>
    <c58e0>   DW_AT_data_member_location: 104
 <2><c58e1>: Abbrev Number: 1 (DW_TAG_member)
    <c58e2>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <c58e6>   DW_AT_decl_file   : 4
    <c58e7>   DW_AT_decl_line   : 72
    <c58e8>   DW_AT_decl_column : 7
    <c58e9>   DW_AT_type        : <0xc57d1>
    <c58ed>   DW_AT_data_member_location: 112
 <2><c58ee>: Abbrev Number: 1 (DW_TAG_member)
    <c58ef>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <c58f3>   DW_AT_decl_file   : 4
    <c58f4>   DW_AT_decl_line   : 73
    <c58f5>   DW_AT_decl_column : 7
    <c58f6>   DW_AT_type        : <0xc57d1>
    <c58fa>   DW_AT_data_member_location: 116
 <2><c58fb>: Abbrev Number: 1 (DW_TAG_member)
    <c58fc>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <c5900>   DW_AT_decl_file   : 4
    <c5901>   DW_AT_decl_line   : 74
    <c5902>   DW_AT_decl_column : 11
    <c5903>   DW_AT_type        : <0xc57df>
    <c5907>   DW_AT_data_member_location: 120
 <2><c5908>: Abbrev Number: 1 (DW_TAG_member)
    <c5909>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <c590d>   DW_AT_decl_file   : 4
    <c590e>   DW_AT_decl_line   : 77
    <c590f>   DW_AT_decl_column : 18
    <c5910>   DW_AT_type        : <0xc57ae>
    <c5914>   DW_AT_data_member_location: 128
 <2><c5915>: Abbrev Number: 1 (DW_TAG_member)
    <c5916>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <c591a>   DW_AT_decl_file   : 4
    <c591b>   DW_AT_decl_line   : 78
    <c591c>   DW_AT_decl_column : 15
    <c591d>   DW_AT_type        : <0xc57c3>
    <c5921>   DW_AT_data_member_location: 130
 <2><c5922>: Abbrev Number: 1 (DW_TAG_member)
    <c5923>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <c5927>   DW_AT_decl_file   : 4
    <c5928>   DW_AT_decl_line   : 79
    <c5929>   DW_AT_decl_column : 8
    <c592a>   DW_AT_type        : <0xc59c8>
    <c592e>   DW_AT_data_member_location: 131
 <2><c592f>: Abbrev Number: 1 (DW_TAG_member)
    <c5930>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <c5934>   DW_AT_decl_file   : 4
    <c5935>   DW_AT_decl_line   : 81
    <c5936>   DW_AT_decl_column : 15
    <c5937>   DW_AT_type        : <0xc59d8>
    <c593b>   DW_AT_data_member_location: 136
 <2><c593c>: Abbrev Number: 1 (DW_TAG_member)
    <c593d>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <c5941>   DW_AT_decl_file   : 4
    <c5942>   DW_AT_decl_line   : 89
    <c5943>   DW_AT_decl_column : 13
    <c5944>   DW_AT_type        : <0xc57eb>
    <c5948>   DW_AT_data_member_location: 144
 <2><c5949>: Abbrev Number: 1 (DW_TAG_member)
    <c594a>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <c594e>   DW_AT_decl_file   : 4
    <c594f>   DW_AT_decl_line   : 91
    <c5950>   DW_AT_decl_column : 23
    <c5951>   DW_AT_type        : <0xc59e2>
    <c5955>   DW_AT_data_member_location: 152
 <2><c5956>: Abbrev Number: 1 (DW_TAG_member)
    <c5957>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <c595b>   DW_AT_decl_file   : 4
    <c595c>   DW_AT_decl_line   : 92
    <c595d>   DW_AT_decl_column : 25
    <c595e>   DW_AT_type        : <0xc59ec>
    <c5962>   DW_AT_data_member_location: 160
 <2><c5963>: Abbrev Number: 1 (DW_TAG_member)
    <c5964>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <c5968>   DW_AT_decl_file   : 4
    <c5969>   DW_AT_decl_line   : 93
    <c596a>   DW_AT_decl_column : 20
    <c596b>   DW_AT_type        : <0xc59c3>
    <c596f>   DW_AT_data_member_location: 168
 <2><c5970>: Abbrev Number: 1 (DW_TAG_member)
    <c5971>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <c5975>   DW_AT_decl_file   : 4
    <c5976>   DW_AT_decl_line   : 94
    <c5977>   DW_AT_decl_column : 9
    <c5978>   DW_AT_type        : <0xc57f7>
    <c597c>   DW_AT_data_member_location: 176
 <2><c597d>: Abbrev Number: 1 (DW_TAG_member)
    <c597e>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <c5982>   DW_AT_decl_file   : 4
    <c5983>   DW_AT_decl_line   : 95
    <c5984>   DW_AT_decl_column : 10
    <c5985>   DW_AT_type        : <0xc5805>
    <c5989>   DW_AT_data_member_location: 184
 <2><c598a>: Abbrev Number: 1 (DW_TAG_member)
    <c598b>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <c598f>   DW_AT_decl_file   : 4
    <c5990>   DW_AT_decl_line   : 96
    <c5991>   DW_AT_decl_column : 7
    <c5992>   DW_AT_type        : <0xc57d1>
    <c5996>   DW_AT_data_member_location: 192
 <2><c5997>: Abbrev Number: 1 (DW_TAG_member)
    <c5998>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <c599c>   DW_AT_decl_file   : 4
    <c599d>   DW_AT_decl_line   : 98
    <c599e>   DW_AT_decl_column : 8
    <c599f>   DW_AT_type        : <0xc59f1>
    <c59a3>   DW_AT_data_member_location: 196
 <2><c59a4>: Abbrev Number: 0
 <1><c59a5>: Abbrev Number: 7 (DW_TAG_typedef)
    <c59a6>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <c59aa>   DW_AT_decl_file   : 5
    <c59ab>   DW_AT_decl_line   : 7
    <c59ac>   DW_AT_decl_column : 25
    <c59ad>   DW_AT_type        : <0xc581f>
 <1><c59b1>: Abbrev Number: 22 (DW_TAG_typedef)
    <c59b2>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <c59b6>   DW_AT_decl_file   : 4
    <c59b7>   DW_AT_decl_line   : 43
    <c59b8>   DW_AT_decl_column : 14
 <1><c59b9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c59ba>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <c59be>   DW_AT_declaration : 1
 <1><c59be>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c59bf>   DW_AT_byte_size   : 8
    <c59bf>   DW_AT_type        : <0xc59b9>
 <1><c59c3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c59c4>   DW_AT_byte_size   : 8
    <c59c4>   DW_AT_type        : <0xc581f>
 <1><c59c8>: Abbrev Number: 9 (DW_TAG_array_type)
    <c59c9>   DW_AT_type        : <0xc57fe>
    <c59cd>   DW_AT_sibling     : <0xc59d8>
 <2><c59d1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c59d2>   DW_AT_type        : <0xc57bc>
    <c59d6>   DW_AT_upper_bound : 0
 <2><c59d7>: Abbrev Number: 0
 <1><c59d8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c59d9>   DW_AT_byte_size   : 8
    <c59d9>   DW_AT_type        : <0xc59b1>
 <1><c59dd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c59de>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <c59e2>   DW_AT_declaration : 1
 <1><c59e2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c59e3>   DW_AT_byte_size   : 8
    <c59e3>   DW_AT_type        : <0xc59dd>
 <1><c59e7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c59e8>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <c59ec>   DW_AT_declaration : 1
 <1><c59ec>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c59ed>   DW_AT_byte_size   : 8
    <c59ed>   DW_AT_type        : <0xc59e7>
 <1><c59f1>: Abbrev Number: 9 (DW_TAG_array_type)
    <c59f2>   DW_AT_type        : <0xc57fe>
    <c59f6>   DW_AT_sibling     : <0xc5a01>
 <2><c59fa>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c59fb>   DW_AT_type        : <0xc57bc>
    <c59ff>   DW_AT_upper_bound : 19
 <2><c5a00>: Abbrev Number: 0
 <1><c5a01>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5a02>   DW_AT_byte_size   : 8
    <c5a02>   DW_AT_type        : <0xc59a5>
 <1><c5a06>: Abbrev Number: 7 (DW_TAG_typedef)
    <c5a07>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <c5a0b>   DW_AT_decl_file   : 6
    <c5a0c>   DW_AT_decl_line   : 23
    <c5a0d>   DW_AT_decl_column : 23
    <c5a0e>   DW_AT_type        : <0xc57a7>
 <1><c5a12>: Abbrev Number: 7 (DW_TAG_typedef)
    <c5a13>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <c5a17>   DW_AT_decl_file   : 6
    <c5a18>   DW_AT_decl_line   : 24
    <c5a19>   DW_AT_decl_column : 22
    <c5a1a>   DW_AT_type        : <0xc57b5>
 <1><c5a1e>: Abbrev Number: 7 (DW_TAG_typedef)
    <c5a1f>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <c5a23>   DW_AT_decl_file   : 6
    <c5a24>   DW_AT_decl_line   : 25
    <c5a25>   DW_AT_decl_column : 22
    <c5a26>   DW_AT_type        : <0xc57b5>
 <1><c5a2a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c5a2b>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <c5a2f>   DW_AT_byte_size   : 60
    <c5a30>   DW_AT_decl_file   : 7
    <c5a31>   DW_AT_decl_line   : 24
    <c5a32>   DW_AT_decl_column : 8
    <c5a32>   DW_AT_sibling     : <0xc5a9f>
 <2><c5a36>: Abbrev Number: 1 (DW_TAG_member)
    <c5a37>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <c5a3b>   DW_AT_decl_file   : 7
    <c5a3c>   DW_AT_decl_line   : 26
    <c5a3d>   DW_AT_decl_column : 14
    <c5a3e>   DW_AT_type        : <0xc5a1e>
    <c5a42>   DW_AT_data_member_location: 0
 <2><c5a43>: Abbrev Number: 1 (DW_TAG_member)
    <c5a44>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <c5a48>   DW_AT_decl_file   : 7
    <c5a49>   DW_AT_decl_line   : 27
    <c5a4a>   DW_AT_decl_column : 14
    <c5a4b>   DW_AT_type        : <0xc5a1e>
    <c5a4f>   DW_AT_data_member_location: 4
 <2><c5a50>: Abbrev Number: 1 (DW_TAG_member)
    <c5a51>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <c5a55>   DW_AT_decl_file   : 7
    <c5a56>   DW_AT_decl_line   : 28
    <c5a57>   DW_AT_decl_column : 14
    <c5a58>   DW_AT_type        : <0xc5a1e>
    <c5a5c>   DW_AT_data_member_location: 8
 <2><c5a5d>: Abbrev Number: 1 (DW_TAG_member)
    <c5a5e>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <c5a62>   DW_AT_decl_file   : 7
    <c5a63>   DW_AT_decl_line   : 29
    <c5a64>   DW_AT_decl_column : 14
    <c5a65>   DW_AT_type        : <0xc5a1e>
    <c5a69>   DW_AT_data_member_location: 12
 <2><c5a6a>: Abbrev Number: 1 (DW_TAG_member)
    <c5a6b>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <c5a6f>   DW_AT_decl_file   : 7
    <c5a70>   DW_AT_decl_line   : 30
    <c5a71>   DW_AT_decl_column : 10
    <c5a72>   DW_AT_type        : <0xc5a06>
    <c5a76>   DW_AT_data_member_location: 16
 <2><c5a77>: Abbrev Number: 1 (DW_TAG_member)
    <c5a78>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <c5a7c>   DW_AT_decl_file   : 7
    <c5a7d>   DW_AT_decl_line   : 31
    <c5a7e>   DW_AT_decl_column : 10
    <c5a7f>   DW_AT_type        : <0xc5a9f>
    <c5a83>   DW_AT_data_member_location: 17
 <2><c5a84>: Abbrev Number: 1 (DW_TAG_member)
    <c5a85>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <c5a89>   DW_AT_decl_file   : 7
    <c5a8a>   DW_AT_decl_line   : 32
    <c5a8b>   DW_AT_decl_column : 13
    <c5a8c>   DW_AT_type        : <0xc5a12>
    <c5a90>   DW_AT_data_member_location: 52
 <2><c5a91>: Abbrev Number: 1 (DW_TAG_member)
    <c5a92>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <c5a96>   DW_AT_decl_file   : 7
    <c5a97>   DW_AT_decl_line   : 33
    <c5a98>   DW_AT_decl_column : 13
    <c5a99>   DW_AT_type        : <0xc5a12>
    <c5a9d>   DW_AT_data_member_location: 56
 <2><c5a9e>: Abbrev Number: 0
 <1><c5a9f>: Abbrev Number: 9 (DW_TAG_array_type)
    <c5aa0>   DW_AT_type        : <0xc5a06>
    <c5aa4>   DW_AT_sibling     : <0xc5aaf>
 <2><c5aa8>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c5aa9>   DW_AT_type        : <0xc57bc>
    <c5aad>   DW_AT_upper_bound : 31
 <2><c5aae>: Abbrev Number: 0
 <1><c5aaf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5ab0>   DW_AT_byte_size   : 8
    <c5ab0>   DW_AT_type        : <0xc5ab4>
 <1><c5ab4>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <c5ab5>   DW_AT_prototyped  : 1
 <1><c5ab5>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5ab6>   DW_AT_byte_size   : 8
    <c5ab7>   DW_AT_encoding    : 4	(float)
    <c5ab8>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c5abc>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5abd>   DW_AT_byte_size   : 4
    <c5abe>   DW_AT_encoding    : 4	(float)
    <c5abf>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c5ac3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5ac4>   DW_AT_byte_size   : 8
    <c5ac4>   DW_AT_type        : <0xc5ac8>
 <1><c5ac8>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <c5ac9>   DW_AT_prototyped  : 1
    <c5ac9>   DW_AT_type        : <0xc57d1>
 <1><c5acd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5ace>   DW_AT_byte_size   : 8
    <c5ace>   DW_AT_type        : <0xc57d1>
 <1><c5ad2>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c5ad3>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c5ad7>   DW_AT_byte_size   : 408
    <c5ad9>   DW_AT_decl_file   : 8
    <c5ada>   DW_AT_decl_line   : 38
    <c5adb>   DW_AT_decl_column : 16
    <c5adc>   DW_AT_sibling     : <0xc5c39>
 <2><c5ae0>: Abbrev Number: 1 (DW_TAG_member)
    <c5ae1>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <c5ae5>   DW_AT_decl_file   : 8
    <c5ae6>   DW_AT_decl_line   : 40
    <c5ae7>   DW_AT_decl_column : 6
    <c5ae8>   DW_AT_type        : <0xc57d1>
    <c5aec>   DW_AT_data_member_location: 0
 <2><c5aed>: Abbrev Number: 1 (DW_TAG_member)
    <c5aee>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <c5af2>   DW_AT_decl_file   : 8
    <c5af3>   DW_AT_decl_line   : 41
    <c5af4>   DW_AT_decl_column : 6
    <c5af5>   DW_AT_type        : <0xc57d1>
    <c5af9>   DW_AT_data_member_location: 4
 <2><c5afa>: Abbrev Number: 1 (DW_TAG_member)
    <c5afb>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <c5aff>   DW_AT_decl_file   : 8
    <c5b00>   DW_AT_decl_line   : 42
    <c5b01>   DW_AT_decl_column : 6
    <c5b02>   DW_AT_type        : <0xc57d1>
    <c5b06>   DW_AT_data_member_location: 8
 <2><c5b07>: Abbrev Number: 1 (DW_TAG_member)
    <c5b08>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <c5b0c>   DW_AT_decl_file   : 8
    <c5b0d>   DW_AT_decl_line   : 43
    <c5b0e>   DW_AT_decl_column : 8
    <c5b0f>   DW_AT_type        : <0xc5a01>
    <c5b13>   DW_AT_data_member_location: 16
 <2><c5b14>: Abbrev Number: 1 (DW_TAG_member)
    <c5b15>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <c5b19>   DW_AT_decl_file   : 8
    <c5b1a>   DW_AT_decl_line   : 44
    <c5b1b>   DW_AT_decl_column : 17
    <c5b1c>   DW_AT_type        : <0xc5a2a>
    <c5b20>   DW_AT_data_member_location: 24
 <2><c5b21>: Abbrev Number: 1 (DW_TAG_member)
    <c5b22>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <c5b26>   DW_AT_decl_file   : 8
    <c5b27>   DW_AT_decl_line   : 44
    <c5b28>   DW_AT_decl_column : 31
    <c5b29>   DW_AT_type        : <0xc5a2a>
    <c5b2d>   DW_AT_data_member_location: 84
 <2><c5b2e>: Abbrev Number: 1 (DW_TAG_member)
    <c5b2f>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <c5b33>   DW_AT_decl_file   : 8
    <c5b34>   DW_AT_decl_line   : 45
    <c5b35>   DW_AT_decl_column : 6
    <c5b36>   DW_AT_type        : <0xc57d1>
    <c5b3a>   DW_AT_data_member_location: 144
 <2><c5b3b>: Abbrev Number: 1 (DW_TAG_member)
    <c5b3c>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <c5b40>   DW_AT_decl_file   : 8
    <c5b41>   DW_AT_decl_line   : 46
    <c5b42>   DW_AT_decl_column : 6
    <c5b43>   DW_AT_type        : <0xc57d1>
    <c5b47>   DW_AT_data_member_location: 148
 <2><c5b48>: Abbrev Number: 1 (DW_TAG_member)
    <c5b49>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <c5b4d>   DW_AT_decl_file   : 8
    <c5b4e>   DW_AT_decl_line   : 46
    <c5b4f>   DW_AT_decl_column : 16
    <c5b50>   DW_AT_type        : <0xc57d1>
    <c5b54>   DW_AT_data_member_location: 152
 <2><c5b55>: Abbrev Number: 1 (DW_TAG_member)
    <c5b56>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <c5b5a>   DW_AT_decl_file   : 8
    <c5b5b>   DW_AT_decl_line   : 47
    <c5b5c>   DW_AT_decl_column : 6
    <c5b5d>   DW_AT_type        : <0xc57d1>
    <c5b61>   DW_AT_data_member_location: 156
 <2><c5b62>: Abbrev Number: 1 (DW_TAG_member)
    <c5b63>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <c5b67>   DW_AT_decl_file   : 8
    <c5b68>   DW_AT_decl_line   : 47
    <c5b69>   DW_AT_decl_column : 13
    <c5b6a>   DW_AT_type        : <0xc57d1>
    <c5b6e>   DW_AT_data_member_location: 160
 <2><c5b6f>: Abbrev Number: 13 (DW_TAG_member)
    <c5b70>   DW_AT_name        : w
    <c5b72>   DW_AT_decl_file   : 8
    <c5b72>   DW_AT_decl_line   : 48
    <c5b73>   DW_AT_decl_column : 6
    <c5b74>   DW_AT_type        : <0xc57d1>
    <c5b78>   DW_AT_data_member_location: 164
 <2><c5b79>: Abbrev Number: 13 (DW_TAG_member)
    <c5b7a>   DW_AT_name        : h
    <c5b7c>   DW_AT_decl_file   : 8
    <c5b7c>   DW_AT_decl_line   : 48
    <c5b7d>   DW_AT_decl_column : 9
    <c5b7e>   DW_AT_type        : <0xc57d1>
    <c5b82>   DW_AT_data_member_location: 168
 <2><c5b83>: Abbrev Number: 1 (DW_TAG_member)
    <c5b84>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <c5b88>   DW_AT_decl_file   : 8
    <c5b89>   DW_AT_decl_line   : 49
    <c5b8a>   DW_AT_decl_column : 17
    <c5b8b>   DW_AT_type        : <0xc5c39>
    <c5b8f>   DW_AT_data_member_location: 176
 <2><c5b90>: Abbrev Number: 1 (DW_TAG_member)
    <c5b91>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <c5b95>   DW_AT_decl_file   : 8
    <c5b96>   DW_AT_decl_line   : 49
    <c5b97>   DW_AT_decl_column : 31
    <c5b98>   DW_AT_type        : <0xc5c39>
    <c5b9c>   DW_AT_data_member_location: 184
 <2><c5b9d>: Abbrev Number: 1 (DW_TAG_member)
    <c5b9e>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <c5ba2>   DW_AT_decl_file   : 8
    <c5ba3>   DW_AT_decl_line   : 51
    <c5ba4>   DW_AT_decl_column : 6
    <c5ba5>   DW_AT_type        : <0xc57d1>
    <c5ba9>   DW_AT_data_member_location: 192
 <2><c5baa>: Abbrev Number: 1 (DW_TAG_member)
    <c5bab>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <c5baf>   DW_AT_decl_file   : 8
    <c5bb0>   DW_AT_decl_line   : 53
    <c5bb1>   DW_AT_decl_column : 6
    <c5bb2>   DW_AT_type        : <0xc57d1>
    <c5bb6>   DW_AT_data_member_location: 196
 <2><c5bb7>: Abbrev Number: 13 (DW_TAG_member)
    <c5bb8>   DW_AT_name        : seq
    <c5bbc>   DW_AT_decl_file   : 8
    <c5bbc>   DW_AT_decl_line   : 54
    <c5bbd>   DW_AT_decl_column : 8
    <c5bbe>   DW_AT_type        : <0xc5c3e>
    <c5bc2>   DW_AT_data_member_location: 200
 <2><c5bc3>: Abbrev Number: 5 (DW_TAG_member)
    <c5bc4>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <c5bc8>   DW_AT_decl_file   : 8
    <c5bc8>   DW_AT_decl_line   : 55
    <c5bc9>   DW_AT_decl_column : 8
    <c5bca>   DW_AT_type        : <0xc5ac3>
    <c5bce>   DW_AT_data_member_location: 336
 <2><c5bd0>: Abbrev Number: 5 (DW_TAG_member)
    <c5bd1>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <c5bd5>   DW_AT_decl_file   : 8
    <c5bd5>   DW_AT_decl_line   : 56
    <c5bd6>   DW_AT_decl_column : 8
    <c5bd7>   DW_AT_type        : <0xc5ac3>
    <c5bdb>   DW_AT_data_member_location: 344
 <2><c5bdd>: Abbrev Number: 5 (DW_TAG_member)
    <c5bde>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <c5be2>   DW_AT_decl_file   : 8
    <c5be2>   DW_AT_decl_line   : 57
    <c5be3>   DW_AT_decl_column : 9
    <c5be4>   DW_AT_type        : <0xc5aaf>
    <c5be8>   DW_AT_data_member_location: 352
 <2><c5bea>: Abbrev Number: 5 (DW_TAG_member)
    <c5beb>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <c5bef>   DW_AT_decl_file   : 8
    <c5bef>   DW_AT_decl_line   : 58
    <c5bf0>   DW_AT_decl_column : 9
    <c5bf1>   DW_AT_type        : <0xc5aaf>
    <c5bf5>   DW_AT_data_member_location: 360
 <2><c5bf7>: Abbrev Number: 5 (DW_TAG_member)
    <c5bf8>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <c5bfc>   DW_AT_decl_file   : 8
    <c5bfc>   DW_AT_decl_line   : 59
    <c5bfd>   DW_AT_decl_column : 8
    <c5bfe>   DW_AT_type        : <0xc5ac3>
    <c5c02>   DW_AT_data_member_location: 368
 <2><c5c04>: Abbrev Number: 5 (DW_TAG_member)
    <c5c05>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <c5c09>   DW_AT_decl_file   : 8
    <c5c09>   DW_AT_decl_line   : 60
    <c5c0a>   DW_AT_decl_column : 9
    <c5c0b>   DW_AT_type        : <0xc5aaf>
    <c5c0f>   DW_AT_data_member_location: 376
 <2><c5c11>: Abbrev Number: 5 (DW_TAG_member)
    <c5c12>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <c5c16>   DW_AT_decl_file   : 8
    <c5c16>   DW_AT_decl_line   : 61
    <c5c17>   DW_AT_decl_column : 9
    <c5c18>   DW_AT_type        : <0xc5aaf>
    <c5c1c>   DW_AT_data_member_location: 384
 <2><c5c1e>: Abbrev Number: 5 (DW_TAG_member)
    <c5c1f>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <c5c23>   DW_AT_decl_file   : 8
    <c5c23>   DW_AT_decl_line   : 62
    <c5c24>   DW_AT_decl_column : 9
    <c5c25>   DW_AT_type        : <0xc5c63>
    <c5c29>   DW_AT_data_member_location: 392
 <2><c5c2b>: Abbrev Number: 5 (DW_TAG_member)
    <c5c2c>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <c5c30>   DW_AT_decl_file   : 8
    <c5c30>   DW_AT_decl_line   : 63
    <c5c31>   DW_AT_decl_column : 9
    <c5c32>   DW_AT_type        : <0xc5aaf>
    <c5c36>   DW_AT_data_member_location: 400
 <2><c5c38>: Abbrev Number: 0
 <1><c5c39>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5c3a>   DW_AT_byte_size   : 8
    <c5c3a>   DW_AT_type        : <0xc57a7>
 <1><c5c3e>: Abbrev Number: 9 (DW_TAG_array_type)
    <c5c3f>   DW_AT_type        : <0xc57f9>
    <c5c43>   DW_AT_sibling     : <0xc5c4e>
 <2><c5c47>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c5c48>   DW_AT_type        : <0xc57bc>
    <c5c4c>   DW_AT_upper_bound : 16
 <2><c5c4d>: Abbrev Number: 0
 <1><c5c4e>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <c5c4f>   DW_AT_prototyped  : 1
    <c5c4f>   DW_AT_sibling     : <0xc5c63>
 <2><c5c53>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5c54>   DW_AT_type        : <0xc57d1>
 <2><c5c58>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5c59>   DW_AT_type        : <0xc57d1>
 <2><c5c5d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5c5e>   DW_AT_type        : <0xc57d1>
 <2><c5c62>: Abbrev Number: 0
 <1><c5c63>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5c64>   DW_AT_byte_size   : 8
    <c5c64>   DW_AT_type        : <0xc5c4e>
 <1><c5c68>: Abbrev Number: 7 (DW_TAG_typedef)
    <c5c69>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c5c6d>   DW_AT_decl_file   : 8
    <c5c6e>   DW_AT_decl_line   : 64
    <c5c6f>   DW_AT_decl_column : 3
    <c5c70>   DW_AT_type        : <0xc5ad2>
 <1><c5c74>: Abbrev Number: 27 (DW_TAG_variable)
    <c5c75>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <c5c79>   DW_AT_decl_file   : 8
    <c5c7a>   DW_AT_decl_line   : 66
    <c5c7b>   DW_AT_decl_column : 18
    <c5c7c>   DW_AT_type        : <0xc5c68>
    <c5c80>   DW_AT_external    : 1
    <c5c80>   DW_AT_declaration : 1
 <1><c5c80>: Abbrev Number: 15 (DW_TAG_subprogram)
    <c5c81>   DW_AT_external    : 1
    <c5c81>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <c5c85>   DW_AT_decl_file   : 9
    <c5c85>   DW_AT_decl_line   : 25
    <c5c86>   DW_AT_decl_column : 13
    <c5c86>   DW_AT_prototyped  : 1
    <c5c86>   DW_AT_declaration : 1
 <1><c5c86>: Abbrev Number: 28 (DW_TAG_subprogram)
    <c5c87>   DW_AT_external    : 1
    <c5c87>   DW_AT_name        : (indirect string, offset: 0x1b80c): fb_hTermOut
    <c5c8b>   DW_AT_decl_file   : 8
    <c5c8c>   DW_AT_decl_line   : 73
    <c5c8d>   DW_AT_decl_column : 5
    <c5c8e>   DW_AT_prototyped  : 1
    <c5c8e>   DW_AT_type        : <0xc57d1>
    <c5c92>   DW_AT_declaration : 1
    <c5c92>   DW_AT_sibling     : <0xc5ca6>
 <2><c5c96>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5c97>   DW_AT_type        : <0xc57d1>
 <2><c5c9b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5c9c>   DW_AT_type        : <0xc57d1>
 <2><c5ca0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5ca1>   DW_AT_type        : <0xc57d1>
 <2><c5ca5>: Abbrev Number: 0
 <1><c5ca6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c5ca7>   DW_AT_external    : 1
    <c5ca7>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <c5cab>   DW_AT_decl_file   : 8
    <c5cac>   DW_AT_decl_line   : 72
    <c5cad>   DW_AT_decl_column : 6
    <c5cae>   DW_AT_prototyped  : 1
    <c5cae>   DW_AT_declaration : 1
    <c5cae>   DW_AT_sibling     : <0xc5cb8>
 <2><c5cb2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5cb3>   DW_AT_type        : <0xc57d1>
 <2><c5cb7>: Abbrev Number: 0
 <1><c5cb8>: Abbrev Number: 15 (DW_TAG_subprogram)
    <c5cb9>   DW_AT_external    : 1
    <c5cb9>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <c5cbd>   DW_AT_decl_file   : 9
    <c5cbd>   DW_AT_decl_line   : 24
    <c5cbe>   DW_AT_decl_column : 13
    <c5cbe>   DW_AT_prototyped  : 1
    <c5cbe>   DW_AT_declaration : 1
 <1><c5cbe>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c5cbf>   DW_AT_external    : 1
    <c5cbf>   DW_AT_name        : (indirect string, offset: 0x1b62a): fb_ConsoleGetXY
    <c5cc3>   DW_AT_decl_file   : 10
    <c5cc4>   DW_AT_decl_line   : 56
    <c5cc5>   DW_AT_decl_column : 21
    <c5cc6>   DW_AT_prototyped  : 1
    <c5cc6>   DW_AT_declaration : 1
    <c5cc6>   DW_AT_sibling     : <0xc5cd5>
 <2><c5cca>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5ccb>   DW_AT_type        : <0xc5acd>
 <2><c5ccf>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5cd0>   DW_AT_type        : <0xc5acd>
 <2><c5cd4>: Abbrev Number: 0
 <1><c5cd5>: Abbrev Number: 29 (DW_TAG_subprogram)
    <c5cd6>   DW_AT_external    : 1
    <c5cd6>   DW_AT_name        : (indirect string, offset: 0x1b697): fb_ConsoleLocate
    <c5cda>   DW_AT_decl_file   : 1
    <c5cdb>   DW_AT_decl_line   : 6
    <c5cdc>   DW_AT_decl_column : 5
    <c5cdd>   DW_AT_prototyped  : 1
    <c5cdd>   DW_AT_type        : <0xc57d1>
    <c5ce1>   DW_AT_low_pc      : 0x472c80
    <c5ce9>   DW_AT_high_pc     : 0x142
    <c5cf1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c5cf3>   DW_AT_call_all_calls: 1
    <c5cf3>   DW_AT_sibling     : <0xc5e1e>
 <2><c5cf7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c5cf8>   DW_AT_name        : row
    <c5cfc>   DW_AT_decl_file   : 1
    <c5cfc>   DW_AT_decl_line   : 6
    <c5cfc>   DW_AT_decl_column : 27
    <c5cfd>   DW_AT_type        : <0xc57d1>
    <c5d01>   DW_AT_location    : 0x3b624 (location list)
    <c5d05>   DW_AT_GNU_locviews: 0x3b61a
 <2><c5d09>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c5d0a>   DW_AT_name        : col
    <c5d0e>   DW_AT_decl_file   : 1
    <c5d0e>   DW_AT_decl_line   : 6
    <c5d0e>   DW_AT_decl_column : 36
    <c5d0f>   DW_AT_type        : <0xc57d1>
    <c5d13>   DW_AT_location    : 0x3b657 (location list)
    <c5d17>   DW_AT_GNU_locviews: 0x3b64b
 <2><c5d1b>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <c5d1c>   DW_AT_name        : (indirect string, offset: 0x1948c): cursor
    <c5d20>   DW_AT_decl_file   : 1
    <c5d21>   DW_AT_decl_line   : 6
    <c5d22>   DW_AT_decl_column : 45
    <c5d23>   DW_AT_type        : <0xc57d1>
    <c5d27>   DW_AT_location    : 0x3b691 (location list)
    <c5d2b>   DW_AT_GNU_locviews: 0x3b685
 <2><c5d2f>: Abbrev Number: 18 (DW_TAG_variable)
    <c5d30>   DW_AT_name        : x
    <c5d32>   DW_AT_decl_file   : 1
    <c5d32>   DW_AT_decl_line   : 8
    <c5d32>   DW_AT_decl_column : 6
    <c5d33>   DW_AT_type        : <0xc57d1>
    <c5d37>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c5d3a>: Abbrev Number: 18 (DW_TAG_variable)
    <c5d3b>   DW_AT_name        : y
    <c5d3d>   DW_AT_decl_file   : 1
    <c5d3d>   DW_AT_decl_line   : 8
    <c5d3d>   DW_AT_decl_column : 9
    <c5d3e>   DW_AT_type        : <0xc57d1>
    <c5d42>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><c5d45>: Abbrev Number: 31 (DW_TAG_variable)
    <c5d46>   DW_AT_name        : (indirect string, offset: 0x1b061): visible
    <c5d4a>   DW_AT_decl_file   : 1
    <c5d4b>   DW_AT_decl_line   : 9
    <c5d4c>   DW_AT_decl_column : 13
    <c5d4d>   DW_AT_type        : <0xc57d1>
    <c5d51>   DW_AT_location    : 9 byte block: 3 f0 a 49 0 0 0 0 0 	(DW_OP_addr: 490af0)
 <2><c5d5b>: Abbrev Number: 11 (DW_TAG_call_site)
    <c5d5c>   DW_AT_call_return_pc: 0x472cc0
    <c5d64>   DW_AT_call_origin : <0xc5cb8>
 <2><c5d68>: Abbrev Number: 8 (DW_TAG_call_site)
    <c5d69>   DW_AT_call_return_pc: 0x472cd6
    <c5d71>   DW_AT_call_origin : <0xc5ca6>
    <c5d75>   DW_AT_sibling     : <0xc5d7f>
 <3><c5d79>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5d7a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c5d7c>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><c5d7e>: Abbrev Number: 0
 <2><c5d7f>: Abbrev Number: 8 (DW_TAG_call_site)
    <c5d80>   DW_AT_call_return_pc: 0x472d14
    <c5d88>   DW_AT_call_origin : <0xc5c86>
    <c5d8c>   DW_AT_sibling     : <0xc5d96>
 <3><c5d90>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5d91>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c5d93>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c5d95>: Abbrev Number: 0
 <2><c5d96>: Abbrev Number: 11 (DW_TAG_call_site)
    <c5d97>   DW_AT_call_return_pc: 0x472d26
    <c5d9f>   DW_AT_call_origin : <0xc5c80>
 <2><c5da3>: Abbrev Number: 8 (DW_TAG_call_site)
    <c5da4>   DW_AT_call_return_pc: 0x472d65
    <c5dac>   DW_AT_call_origin : <0xc5cbe>
    <c5db0>   DW_AT_sibling     : <0xc5dc1>
 <3><c5db4>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5db5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c5db7>   DW_AT_call_value  : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><c5dba>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5dbb>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c5dbd>   DW_AT_call_value  : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><c5dc0>: Abbrev Number: 0
 <2><c5dc1>: Abbrev Number: 11 (DW_TAG_call_site)
    <c5dc2>   DW_AT_call_return_pc: 0x472d6a
    <c5dca>   DW_AT_call_origin : <0xc5cb8>
 <2><c5dce>: Abbrev Number: 8 (DW_TAG_call_site)
    <c5dcf>   DW_AT_call_return_pc: 0x472d8e
    <c5dd7>   DW_AT_call_origin : <0xc5c86>
    <c5ddb>   DW_AT_sibling     : <0xc5def>
 <3><c5ddf>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5de0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c5de2>   DW_AT_call_value  : 1 byte block: 3d 	(DW_OP_lit13)
 <3><c5de4>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5de5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c5de7>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c5de9>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5dea>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <c5dec>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c5dee>: Abbrev Number: 0
 <2><c5def>: Abbrev Number: 8 (DW_TAG_call_site)
    <c5df0>   DW_AT_call_return_pc: 0x472dae
    <c5df8>   DW_AT_call_origin : <0xc5c86>
    <c5dfc>   DW_AT_sibling     : <0xc5e10>
 <3><c5e00>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5e01>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c5e03>   DW_AT_call_value  : 1 byte block: 3c 	(DW_OP_lit12)
 <3><c5e05>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5e06>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c5e08>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c5e0a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <c5e0b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <c5e0d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c5e0f>: Abbrev Number: 0
 <2><c5e10>: Abbrev Number: 11 (DW_TAG_call_site)
    <c5e11>   DW_AT_call_return_pc: 0x472dc2
    <c5e19>   DW_AT_call_origin : <0xc5e1e>
 <2><c5e1d>: Abbrev Number: 0
 <1><c5e1e>: Abbrev Number: 32 (DW_TAG_subprogram)
    <c5e1f>   DW_AT_external    : 1
    <c5e1f>   DW_AT_declaration : 1
    <c5e1f>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <c5e23>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><c5e27>: Abbrev Number: 0
  Compilation Unit @ offset 0xc5e28:
   Length:        0x56d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xfea7
   Pointer Size:  8
 <0><c5e34>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c5e35>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c5e39>   DW_AT_language    : 29	(C11)
    <c5e3a>   DW_AT_name        : (indirect line string, offset: 0x1023): src/rtlib/unix/io_maxrow.c
    <c5e3e>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c5e42>   DW_AT_low_pc      : 0x472dd0
    <c5e4a>   DW_AT_high_pc     : 0x36
    <c5e52>   DW_AT_stmt_list   : 0x67a02
 <1><c5e56>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e57>   DW_AT_byte_size   : 1
    <c5e58>   DW_AT_encoding    : 8	(unsigned char)
    <c5e59>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c5e5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e5e>   DW_AT_byte_size   : 2
    <c5e5f>   DW_AT_encoding    : 7	(unsigned)
    <c5e60>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c5e64>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e65>   DW_AT_byte_size   : 4
    <c5e66>   DW_AT_encoding    : 7	(unsigned)
    <c5e67>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c5e6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e6c>   DW_AT_byte_size   : 8
    <c5e6d>   DW_AT_encoding    : 7	(unsigned)
    <c5e6e>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c5e72>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e73>   DW_AT_byte_size   : 1
    <c5e74>   DW_AT_encoding    : 6	(signed char)
    <c5e75>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c5e79>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e7a>   DW_AT_byte_size   : 2
    <c5e7b>   DW_AT_encoding    : 5	(signed)
    <c5e7c>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c5e80>: Abbrev Number: 15 (DW_TAG_base_type)
    <c5e81>   DW_AT_byte_size   : 4
    <c5e82>   DW_AT_encoding    : 5	(signed)
    <c5e83>   DW_AT_name        : int
 <1><c5e87>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5e88>   DW_AT_byte_size   : 8
    <c5e89>   DW_AT_encoding    : 5	(signed)
    <c5e8a>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c5e8e>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5e8f>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <c5e93>   DW_AT_decl_file   : 2
    <c5e94>   DW_AT_decl_line   : 152
    <c5e95>   DW_AT_decl_column : 25
    <c5e96>   DW_AT_type        : <0xc5e87>
 <1><c5e9a>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5e9b>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c5e9f>   DW_AT_decl_file   : 2
    <c5ea0>   DW_AT_decl_line   : 153
    <c5ea1>   DW_AT_decl_column : 27
    <c5ea2>   DW_AT_type        : <0xc5e87>
 <1><c5ea6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <c5ea7>   DW_AT_byte_size   : 8
 <1><c5ea8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c5ea9>   DW_AT_byte_size   : 8
    <c5ea9>   DW_AT_type        : <0xc5ead>
 <1><c5ead>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5eae>   DW_AT_byte_size   : 1
    <c5eaf>   DW_AT_encoding    : 6	(signed char)
    <c5eb0>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c5eb4>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5eb5>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c5eb9>   DW_AT_decl_file   : 3
    <c5eba>   DW_AT_decl_line   : 209
    <c5ebb>   DW_AT_decl_column : 23
    <c5ebc>   DW_AT_type        : <0xc5e6b>
 <1><c5ec0>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5ec1>   DW_AT_byte_size   : 8
    <c5ec2>   DW_AT_encoding    : 5	(signed)
    <c5ec3>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c5ec7>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5ec8>   DW_AT_byte_size   : 8
    <c5ec9>   DW_AT_encoding    : 7	(unsigned)
    <c5eca>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c5ece>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c5ecf>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <c5ed3>   DW_AT_byte_size   : 216
    <c5ed4>   DW_AT_decl_file   : 4
    <c5ed5>   DW_AT_decl_line   : 49
    <c5ed6>   DW_AT_decl_column : 8
    <c5ed6>   DW_AT_sibling     : <0xc6054>
 <2><c5eda>: Abbrev Number: 1 (DW_TAG_member)
    <c5edb>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <c5edf>   DW_AT_decl_file   : 4
    <c5ee0>   DW_AT_decl_line   : 51
    <c5ee1>   DW_AT_decl_column : 7
    <c5ee2>   DW_AT_type        : <0xc5e80>
    <c5ee6>   DW_AT_data_member_location: 0
 <2><c5ee7>: Abbrev Number: 1 (DW_TAG_member)
    <c5ee8>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <c5eec>   DW_AT_decl_file   : 4
    <c5eed>   DW_AT_decl_line   : 54
    <c5eee>   DW_AT_decl_column : 9
    <c5eef>   DW_AT_type        : <0xc5ea8>
    <c5ef3>   DW_AT_data_member_location: 8
 <2><c5ef4>: Abbrev Number: 1 (DW_TAG_member)
    <c5ef5>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <c5ef9>   DW_AT_decl_file   : 4
    <c5efa>   DW_AT_decl_line   : 55
    <c5efb>   DW_AT_decl_column : 9
    <c5efc>   DW_AT_type        : <0xc5ea8>
    <c5f00>   DW_AT_data_member_location: 16
 <2><c5f01>: Abbrev Number: 1 (DW_TAG_member)
    <c5f02>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <c5f06>   DW_AT_decl_file   : 4
    <c5f07>   DW_AT_decl_line   : 56
    <c5f08>   DW_AT_decl_column : 9
    <c5f09>   DW_AT_type        : <0xc5ea8>
    <c5f0d>   DW_AT_data_member_location: 24
 <2><c5f0e>: Abbrev Number: 1 (DW_TAG_member)
    <c5f0f>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <c5f13>   DW_AT_decl_file   : 4
    <c5f14>   DW_AT_decl_line   : 57
    <c5f15>   DW_AT_decl_column : 9
    <c5f16>   DW_AT_type        : <0xc5ea8>
    <c5f1a>   DW_AT_data_member_location: 32
 <2><c5f1b>: Abbrev Number: 1 (DW_TAG_member)
    <c5f1c>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <c5f20>   DW_AT_decl_file   : 4
    <c5f21>   DW_AT_decl_line   : 58
    <c5f22>   DW_AT_decl_column : 9
    <c5f23>   DW_AT_type        : <0xc5ea8>
    <c5f27>   DW_AT_data_member_location: 40
 <2><c5f28>: Abbrev Number: 1 (DW_TAG_member)
    <c5f29>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <c5f2d>   DW_AT_decl_file   : 4
    <c5f2e>   DW_AT_decl_line   : 59
    <c5f2f>   DW_AT_decl_column : 9
    <c5f30>   DW_AT_type        : <0xc5ea8>
    <c5f34>   DW_AT_data_member_location: 48
 <2><c5f35>: Abbrev Number: 1 (DW_TAG_member)
    <c5f36>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <c5f3a>   DW_AT_decl_file   : 4
    <c5f3b>   DW_AT_decl_line   : 60
    <c5f3c>   DW_AT_decl_column : 9
    <c5f3d>   DW_AT_type        : <0xc5ea8>
    <c5f41>   DW_AT_data_member_location: 56
 <2><c5f42>: Abbrev Number: 1 (DW_TAG_member)
    <c5f43>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <c5f47>   DW_AT_decl_file   : 4
    <c5f48>   DW_AT_decl_line   : 61
    <c5f49>   DW_AT_decl_column : 9
    <c5f4a>   DW_AT_type        : <0xc5ea8>
    <c5f4e>   DW_AT_data_member_location: 64
 <2><c5f4f>: Abbrev Number: 1 (DW_TAG_member)
    <c5f50>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <c5f54>   DW_AT_decl_file   : 4
    <c5f55>   DW_AT_decl_line   : 64
    <c5f56>   DW_AT_decl_column : 9
    <c5f57>   DW_AT_type        : <0xc5ea8>
    <c5f5b>   DW_AT_data_member_location: 72
 <2><c5f5c>: Abbrev Number: 1 (DW_TAG_member)
    <c5f5d>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <c5f61>   DW_AT_decl_file   : 4
    <c5f62>   DW_AT_decl_line   : 65
    <c5f63>   DW_AT_decl_column : 9
    <c5f64>   DW_AT_type        : <0xc5ea8>
    <c5f68>   DW_AT_data_member_location: 80
 <2><c5f69>: Abbrev Number: 1 (DW_TAG_member)
    <c5f6a>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <c5f6e>   DW_AT_decl_file   : 4
    <c5f6f>   DW_AT_decl_line   : 66
    <c5f70>   DW_AT_decl_column : 9
    <c5f71>   DW_AT_type        : <0xc5ea8>
    <c5f75>   DW_AT_data_member_location: 88
 <2><c5f76>: Abbrev Number: 1 (DW_TAG_member)
    <c5f77>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <c5f7b>   DW_AT_decl_file   : 4
    <c5f7c>   DW_AT_decl_line   : 68
    <c5f7d>   DW_AT_decl_column : 22
    <c5f7e>   DW_AT_type        : <0xc606d>
    <c5f82>   DW_AT_data_member_location: 96
 <2><c5f83>: Abbrev Number: 1 (DW_TAG_member)
    <c5f84>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <c5f88>   DW_AT_decl_file   : 4
    <c5f89>   DW_AT_decl_line   : 70
    <c5f8a>   DW_AT_decl_column : 20
    <c5f8b>   DW_AT_type        : <0xc6072>
    <c5f8f>   DW_AT_data_member_location: 104
 <2><c5f90>: Abbrev Number: 1 (DW_TAG_member)
    <c5f91>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <c5f95>   DW_AT_decl_file   : 4
    <c5f96>   DW_AT_decl_line   : 72
    <c5f97>   DW_AT_decl_column : 7
    <c5f98>   DW_AT_type        : <0xc5e80>
    <c5f9c>   DW_AT_data_member_location: 112
 <2><c5f9d>: Abbrev Number: 1 (DW_TAG_member)
    <c5f9e>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <c5fa2>   DW_AT_decl_file   : 4
    <c5fa3>   DW_AT_decl_line   : 73
    <c5fa4>   DW_AT_decl_column : 7
    <c5fa5>   DW_AT_type        : <0xc5e80>
    <c5fa9>   DW_AT_data_member_location: 116
 <2><c5faa>: Abbrev Number: 1 (DW_TAG_member)
    <c5fab>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <c5faf>   DW_AT_decl_file   : 4
    <c5fb0>   DW_AT_decl_line   : 74
    <c5fb1>   DW_AT_decl_column : 11
    <c5fb2>   DW_AT_type        : <0xc5e8e>
    <c5fb6>   DW_AT_data_member_location: 120
 <2><c5fb7>: Abbrev Number: 1 (DW_TAG_member)
    <c5fb8>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <c5fbc>   DW_AT_decl_file   : 4
    <c5fbd>   DW_AT_decl_line   : 77
    <c5fbe>   DW_AT_decl_column : 18
    <c5fbf>   DW_AT_type        : <0xc5e5d>
    <c5fc3>   DW_AT_data_member_location: 128
 <2><c5fc4>: Abbrev Number: 1 (DW_TAG_member)
    <c5fc5>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <c5fc9>   DW_AT_decl_file   : 4
    <c5fca>   DW_AT_decl_line   : 78
    <c5fcb>   DW_AT_decl_column : 15
    <c5fcc>   DW_AT_type        : <0xc5e72>
    <c5fd0>   DW_AT_data_member_location: 130
 <2><c5fd1>: Abbrev Number: 1 (DW_TAG_member)
    <c5fd2>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <c5fd6>   DW_AT_decl_file   : 4
    <c5fd7>   DW_AT_decl_line   : 79
    <c5fd8>   DW_AT_decl_column : 8
    <c5fd9>   DW_AT_type        : <0xc6077>
    <c5fdd>   DW_AT_data_member_location: 131
 <2><c5fde>: Abbrev Number: 1 (DW_TAG_member)
    <c5fdf>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <c5fe3>   DW_AT_decl_file   : 4
    <c5fe4>   DW_AT_decl_line   : 81
    <c5fe5>   DW_AT_decl_column : 15
    <c5fe6>   DW_AT_type        : <0xc6087>
    <c5fea>   DW_AT_data_member_location: 136
 <2><c5feb>: Abbrev Number: 1 (DW_TAG_member)
    <c5fec>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <c5ff0>   DW_AT_decl_file   : 4
    <c5ff1>   DW_AT_decl_line   : 89
    <c5ff2>   DW_AT_decl_column : 13
    <c5ff3>   DW_AT_type        : <0xc5e9a>
    <c5ff7>   DW_AT_data_member_location: 144
 <2><c5ff8>: Abbrev Number: 1 (DW_TAG_member)
    <c5ff9>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <c5ffd>   DW_AT_decl_file   : 4
    <c5ffe>   DW_AT_decl_line   : 91
    <c5fff>   DW_AT_decl_column : 23
    <c6000>   DW_AT_type        : <0xc6091>
    <c6004>   DW_AT_data_member_location: 152
 <2><c6005>: Abbrev Number: 1 (DW_TAG_member)
    <c6006>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <c600a>   DW_AT_decl_file   : 4
    <c600b>   DW_AT_decl_line   : 92
    <c600c>   DW_AT_decl_column : 25
    <c600d>   DW_AT_type        : <0xc609b>
    <c6011>   DW_AT_data_member_location: 160
 <2><c6012>: Abbrev Number: 1 (DW_TAG_member)
    <c6013>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <c6017>   DW_AT_decl_file   : 4
    <c6018>   DW_AT_decl_line   : 93
    <c6019>   DW_AT_decl_column : 20
    <c601a>   DW_AT_type        : <0xc6072>
    <c601e>   DW_AT_data_member_location: 168
 <2><c601f>: Abbrev Number: 1 (DW_TAG_member)
    <c6020>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <c6024>   DW_AT_decl_file   : 4
    <c6025>   DW_AT_decl_line   : 94
    <c6026>   DW_AT_decl_column : 9
    <c6027>   DW_AT_type        : <0xc5ea6>
    <c602b>   DW_AT_data_member_location: 176
 <2><c602c>: Abbrev Number: 1 (DW_TAG_member)
    <c602d>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <c6031>   DW_AT_decl_file   : 4
    <c6032>   DW_AT_decl_line   : 95
    <c6033>   DW_AT_decl_column : 10
    <c6034>   DW_AT_type        : <0xc5eb4>
    <c6038>   DW_AT_data_member_location: 184
 <2><c6039>: Abbrev Number: 1 (DW_TAG_member)
    <c603a>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <c603e>   DW_AT_decl_file   : 4
    <c603f>   DW_AT_decl_line   : 96
    <c6040>   DW_AT_decl_column : 7
    <c6041>   DW_AT_type        : <0xc5e80>
    <c6045>   DW_AT_data_member_location: 192
 <2><c6046>: Abbrev Number: 1 (DW_TAG_member)
    <c6047>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <c604b>   DW_AT_decl_file   : 4
    <c604c>   DW_AT_decl_line   : 98
    <c604d>   DW_AT_decl_column : 8
    <c604e>   DW_AT_type        : <0xc60a0>
    <c6052>   DW_AT_data_member_location: 196
 <2><c6053>: Abbrev Number: 0
 <1><c6054>: Abbrev Number: 5 (DW_TAG_typedef)
    <c6055>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <c6059>   DW_AT_decl_file   : 5
    <c605a>   DW_AT_decl_line   : 7
    <c605b>   DW_AT_decl_column : 25
    <c605c>   DW_AT_type        : <0xc5ece>
 <1><c6060>: Abbrev Number: 17 (DW_TAG_typedef)
    <c6061>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <c6065>   DW_AT_decl_file   : 4
    <c6066>   DW_AT_decl_line   : 43
    <c6067>   DW_AT_decl_column : 14
 <1><c6068>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c6069>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <c606d>   DW_AT_declaration : 1
 <1><c606d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c606e>   DW_AT_byte_size   : 8
    <c606e>   DW_AT_type        : <0xc6068>
 <1><c6072>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c6073>   DW_AT_byte_size   : 8
    <c6073>   DW_AT_type        : <0xc5ece>
 <1><c6077>: Abbrev Number: 6 (DW_TAG_array_type)
    <c6078>   DW_AT_type        : <0xc5ead>
    <c607c>   DW_AT_sibling     : <0xc6087>
 <2><c6080>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c6081>   DW_AT_type        : <0xc5e6b>
    <c6085>   DW_AT_upper_bound : 0
 <2><c6086>: Abbrev Number: 0
 <1><c6087>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c6088>   DW_AT_byte_size   : 8
    <c6088>   DW_AT_type        : <0xc6060>
 <1><c608c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c608d>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <c6091>   DW_AT_declaration : 1
 <1><c6091>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c6092>   DW_AT_byte_size   : 8
    <c6092>   DW_AT_type        : <0xc608c>
 <1><c6096>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c6097>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <c609b>   DW_AT_declaration : 1
 <1><c609b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c609c>   DW_AT_byte_size   : 8
    <c609c>   DW_AT_type        : <0xc6096>
 <1><c60a0>: Abbrev Number: 6 (DW_TAG_array_type)
    <c60a1>   DW_AT_type        : <0xc5ead>
    <c60a5>   DW_AT_sibling     : <0xc60b0>
 <2><c60a9>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c60aa>   DW_AT_type        : <0xc5e6b>
    <c60ae>   DW_AT_upper_bound : 19
 <2><c60af>: Abbrev Number: 0
 <1><c60b0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c60b1>   DW_AT_byte_size   : 8
    <c60b1>   DW_AT_type        : <0xc6054>
 <1><c60b5>: Abbrev Number: 5 (DW_TAG_typedef)
    <c60b6>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <c60ba>   DW_AT_decl_file   : 6
    <c60bb>   DW_AT_decl_line   : 23
    <c60bc>   DW_AT_decl_column : 23
    <c60bd>   DW_AT_type        : <0xc5e56>
 <1><c60c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <c60c2>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <c60c6>   DW_AT_decl_file   : 6
    <c60c7>   DW_AT_decl_line   : 24
    <c60c8>   DW_AT_decl_column : 22
    <c60c9>   DW_AT_type        : <0xc5e64>
 <1><c60cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <c60ce>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <c60d2>   DW_AT_decl_file   : 6
    <c60d3>   DW_AT_decl_line   : 25
    <c60d4>   DW_AT_decl_column : 22
    <c60d5>   DW_AT_type        : <0xc5e64>
 <1><c60d9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c60da>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <c60de>   DW_AT_byte_size   : 60
    <c60df>   DW_AT_decl_file   : 7
    <c60e0>   DW_AT_decl_line   : 24
    <c60e1>   DW_AT_decl_column : 8
    <c60e1>   DW_AT_sibling     : <0xc614e>
 <2><c60e5>: Abbrev Number: 1 (DW_TAG_member)
    <c60e6>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <c60ea>   DW_AT_decl_file   : 7
    <c60eb>   DW_AT_decl_line   : 26
    <c60ec>   DW_AT_decl_column : 14
    <c60ed>   DW_AT_type        : <0xc60cd>
    <c60f1>   DW_AT_data_member_location: 0
 <2><c60f2>: Abbrev Number: 1 (DW_TAG_member)
    <c60f3>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <c60f7>   DW_AT_decl_file   : 7
    <c60f8>   DW_AT_decl_line   : 27
    <c60f9>   DW_AT_decl_column : 14
    <c60fa>   DW_AT_type        : <0xc60cd>
    <c60fe>   DW_AT_data_member_location: 4
 <2><c60ff>: Abbrev Number: 1 (DW_TAG_member)
    <c6100>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <c6104>   DW_AT_decl_file   : 7
    <c6105>   DW_AT_decl_line   : 28
    <c6106>   DW_AT_decl_column : 14
    <c6107>   DW_AT_type        : <0xc60cd>
    <c610b>   DW_AT_data_member_location: 8
 <2><c610c>: Abbrev Number: 1 (DW_TAG_member)
    <c610d>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <c6111>   DW_AT_decl_file   : 7
    <c6112>   DW_AT_decl_line   : 29
    <c6113>   DW_AT_decl_column : 14
    <c6114>   DW_AT_type        : <0xc60cd>
    <c6118>   DW_AT_data_member_location: 12
 <2><c6119>: Abbrev Number: 1 (DW_TAG_member)
    <c611a>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <c611e>   DW_AT_decl_file   : 7
    <c611f>   DW_AT_decl_line   : 30
    <c6120>   DW_AT_decl_column : 10
    <c6121>   DW_AT_type        : <0xc60b5>
    <c6125>   DW_AT_data_member_location: 16
 <2><c6126>: Abbrev Number: 1 (DW_TAG_member)
    <c6127>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <c612b>   DW_AT_decl_file   : 7
    <c612c>   DW_AT_decl_line   : 31
    <c612d>   DW_AT_decl_column : 10
    <c612e>   DW_AT_type        : <0xc614e>
    <c6132>   DW_AT_data_member_location: 17
 <2><c6133>: Abbrev Number: 1 (DW_TAG_member)
    <c6134>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <c6138>   DW_AT_decl_file   : 7
    <c6139>   DW_AT_decl_line   : 32
    <c613a>   DW_AT_decl_column : 13
    <c613b>   DW_AT_type        : <0xc60c1>
    <c613f>   DW_AT_data_member_location: 52
 <2><c6140>: Abbrev Number: 1 (DW_TAG_member)
    <c6141>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <c6145>   DW_AT_decl_file   : 7
    <c6146>   DW_AT_decl_line   : 33
    <c6147>   DW_AT_decl_column : 13
    <c6148>   DW_AT_type        : <0xc60c1>
    <c614c>   DW_AT_data_member_location: 56
 <2><c614d>: Abbrev Number: 0
 <1><c614e>: Abbrev Number: 6 (DW_TAG_array_type)
    <c614f>   DW_AT_type        : <0xc60b5>
    <c6153>   DW_AT_sibling     : <0xc615e>
 <2><c6157>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c6158>   DW_AT_type        : <0xc5e6b>
    <c615c>   DW_AT_upper_bound : 31
 <2><c615d>: Abbrev Number: 0
 <1><c615e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c615f>   DW_AT_byte_size   : 8
    <c615f>   DW_AT_type        : <0xc6163>
 <1><c6163>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <c6164>   DW_AT_prototyped  : 1
 <1><c6164>: Abbrev Number: 2 (DW_TAG_base_type)
    <c6165>   DW_AT_byte_size   : 8
    <c6166>   DW_AT_encoding    : 4	(float)
    <c6167>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c616b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c616c>   DW_AT_byte_size   : 4
    <c616d>   DW_AT_encoding    : 4	(float)
    <c616e>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c6172>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c6173>   DW_AT_byte_size   : 8
    <c6173>   DW_AT_type        : <0xc6177>
 <1><c6177>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c6178>   DW_AT_prototyped  : 1
    <c6178>   DW_AT_type        : <0xc5e80>
 <1><c617c>: Abbrev Number: 20 (DW_TAG_structure_type)
    <c617d>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c6181>   DW_AT_byte_size   : 408
    <c6183>   DW_AT_decl_file   : 8
    <c6184>   DW_AT_decl_line   : 38
    <c6185>   DW_AT_decl_column : 16
    <c6186>   DW_AT_sibling     : <0xc62e3>
 <2><c618a>: Abbrev Number: 1 (DW_TAG_member)
    <c618b>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <c618f>   DW_AT_decl_file   : 8
    <c6190>   DW_AT_decl_line   : 40
    <c6191>   DW_AT_decl_column : 6
    <c6192>   DW_AT_type        : <0xc5e80>
    <c6196>   DW_AT_data_member_location: 0
 <2><c6197>: Abbrev Number: 1 (DW_TAG_member)
    <c6198>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <c619c>   DW_AT_decl_file   : 8
    <c619d>   DW_AT_decl_line   : 41
    <c619e>   DW_AT_decl_column : 6
    <c619f>   DW_AT_type        : <0xc5e80>
    <c61a3>   DW_AT_data_member_location: 4
 <2><c61a4>: Abbrev Number: 1 (DW_TAG_member)
    <c61a5>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <c61a9>   DW_AT_decl_file   : 8
    <c61aa>   DW_AT_decl_line   : 42
    <c61ab>   DW_AT_decl_column : 6
    <c61ac>   DW_AT_type        : <0xc5e80>
    <c61b0>   DW_AT_data_member_location: 8
 <2><c61b1>: Abbrev Number: 1 (DW_TAG_member)
    <c61b2>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <c61b6>   DW_AT_decl_file   : 8
    <c61b7>   DW_AT_decl_line   : 43
    <c61b8>   DW_AT_decl_column : 8
    <c61b9>   DW_AT_type        : <0xc60b0>
    <c61bd>   DW_AT_data_member_location: 16
 <2><c61be>: Abbrev Number: 1 (DW_TAG_member)
    <c61bf>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <c61c3>   DW_AT_decl_file   : 8
    <c61c4>   DW_AT_decl_line   : 44
    <c61c5>   DW_AT_decl_column : 17
    <c61c6>   DW_AT_type        : <0xc60d9>
    <c61ca>   DW_AT_data_member_location: 24
 <2><c61cb>: Abbrev Number: 1 (DW_TAG_member)
    <c61cc>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <c61d0>   DW_AT_decl_file   : 8
    <c61d1>   DW_AT_decl_line   : 44
    <c61d2>   DW_AT_decl_column : 31
    <c61d3>   DW_AT_type        : <0xc60d9>
    <c61d7>   DW_AT_data_member_location: 84
 <2><c61d8>: Abbrev Number: 1 (DW_TAG_member)
    <c61d9>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <c61dd>   DW_AT_decl_file   : 8
    <c61de>   DW_AT_decl_line   : 45
    <c61df>   DW_AT_decl_column : 6
    <c61e0>   DW_AT_type        : <0xc5e80>
    <c61e4>   DW_AT_data_member_location: 144
 <2><c61e5>: Abbrev Number: 1 (DW_TAG_member)
    <c61e6>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <c61ea>   DW_AT_decl_file   : 8
    <c61eb>   DW_AT_decl_line   : 46
    <c61ec>   DW_AT_decl_column : 6
    <c61ed>   DW_AT_type        : <0xc5e80>
    <c61f1>   DW_AT_data_member_location: 148
 <2><c61f2>: Abbrev Number: 1 (DW_TAG_member)
    <c61f3>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <c61f7>   DW_AT_decl_file   : 8
    <c61f8>   DW_AT_decl_line   : 46
    <c61f9>   DW_AT_decl_column : 16
    <c61fa>   DW_AT_type        : <0xc5e80>
    <c61fe>   DW_AT_data_member_location: 152
 <2><c61ff>: Abbrev Number: 1 (DW_TAG_member)
    <c6200>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <c6204>   DW_AT_decl_file   : 8
    <c6205>   DW_AT_decl_line   : 47
    <c6206>   DW_AT_decl_column : 6
    <c6207>   DW_AT_type        : <0xc5e80>
    <c620b>   DW_AT_data_member_location: 156
 <2><c620c>: Abbrev Number: 1 (DW_TAG_member)
    <c620d>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <c6211>   DW_AT_decl_file   : 8
    <c6212>   DW_AT_decl_line   : 47
    <c6213>   DW_AT_decl_column : 13
    <c6214>   DW_AT_type        : <0xc5e80>
    <c6218>   DW_AT_data_member_location: 160
 <2><c6219>: Abbrev Number: 10 (DW_TAG_member)
    <c621a>   DW_AT_name        : w
    <c621c>   DW_AT_decl_file   : 8
    <c621c>   DW_AT_decl_line   : 48
    <c621d>   DW_AT_decl_column : 6
    <c621e>   DW_AT_type        : <0xc5e80>
    <c6222>   DW_AT_data_member_location: 164
 <2><c6223>: Abbrev Number: 10 (DW_TAG_member)
    <c6224>   DW_AT_name        : h
    <c6226>   DW_AT_decl_file   : 8
    <c6226>   DW_AT_decl_line   : 48
    <c6227>   DW_AT_decl_column : 9
    <c6228>   DW_AT_type        : <0xc5e80>
    <c622c>   DW_AT_data_member_location: 168
 <2><c622d>: Abbrev Number: 1 (DW_TAG_member)
    <c622e>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <c6232>   DW_AT_decl_file   : 8
    <c6233>   DW_AT_decl_line   : 49
    <c6234>   DW_AT_decl_column : 17
    <c6235>   DW_AT_type        : <0xc62e3>
    <c6239>   DW_AT_data_member_location: 176
 <2><c623a>: Abbrev Number: 1 (DW_TAG_member)
    <c623b>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <c623f>   DW_AT_decl_file   : 8
    <c6240>   DW_AT_decl_line   : 49
    <c6241>   DW_AT_decl_column : 31
    <c6242>   DW_AT_type        : <0xc62e3>
    <c6246>   DW_AT_data_member_location: 184
 <2><c6247>: Abbrev Number: 1 (DW_TAG_member)
    <c6248>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <c624c>   DW_AT_decl_file   : 8
    <c624d>   DW_AT_decl_line   : 51
    <c624e>   DW_AT_decl_column : 6
    <c624f>   DW_AT_type        : <0xc5e80>
    <c6253>   DW_AT_data_member_location: 192
 <2><c6254>: Abbrev Number: 1 (DW_TAG_member)
    <c6255>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <c6259>   DW_AT_decl_file   : 8
    <c625a>   DW_AT_decl_line   : 53
    <c625b>   DW_AT_decl_column : 6
    <c625c>   DW_AT_type        : <0xc5e80>
    <c6260>   DW_AT_data_member_location: 196
 <2><c6261>: Abbrev Number: 10 (DW_TAG_member)
    <c6262>   DW_AT_name        : seq
    <c6266>   DW_AT_decl_file   : 8
    <c6266>   DW_AT_decl_line   : 54
    <c6267>   DW_AT_decl_column : 8
    <c6268>   DW_AT_type        : <0xc62e8>
    <c626c>   DW_AT_data_member_location: 200
 <2><c626d>: Abbrev Number: 4 (DW_TAG_member)
    <c626e>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <c6272>   DW_AT_decl_file   : 8
    <c6272>   DW_AT_decl_line   : 55
    <c6273>   DW_AT_decl_column : 8
    <c6274>   DW_AT_type        : <0xc6172>
    <c6278>   DW_AT_data_member_location: 336
 <2><c627a>: Abbrev Number: 4 (DW_TAG_member)
    <c627b>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <c627f>   DW_AT_decl_file   : 8
    <c627f>   DW_AT_decl_line   : 56
    <c6280>   DW_AT_decl_column : 8
    <c6281>   DW_AT_type        : <0xc6172>
    <c6285>   DW_AT_data_member_location: 344
 <2><c6287>: Abbrev Number: 4 (DW_TAG_member)
    <c6288>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <c628c>   DW_AT_decl_file   : 8
    <c628c>   DW_AT_decl_line   : 57
    <c628d>   DW_AT_decl_column : 9
    <c628e>   DW_AT_type        : <0xc615e>
    <c6292>   DW_AT_data_member_location: 352
 <2><c6294>: Abbrev Number: 4 (DW_TAG_member)
    <c6295>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <c6299>   DW_AT_decl_file   : 8
    <c6299>   DW_AT_decl_line   : 58
    <c629a>   DW_AT_decl_column : 9
    <c629b>   DW_AT_type        : <0xc615e>
    <c629f>   DW_AT_data_member_location: 360
 <2><c62a1>: Abbrev Number: 4 (DW_TAG_member)
    <c62a2>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <c62a6>   DW_AT_decl_file   : 8
    <c62a6>   DW_AT_decl_line   : 59
    <c62a7>   DW_AT_decl_column : 8
    <c62a8>   DW_AT_type        : <0xc6172>
    <c62ac>   DW_AT_data_member_location: 368
 <2><c62ae>: Abbrev Number: 4 (DW_TAG_member)
    <c62af>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <c62b3>   DW_AT_decl_file   : 8
    <c62b3>   DW_AT_decl_line   : 60
    <c62b4>   DW_AT_decl_column : 9
    <c62b5>   DW_AT_type        : <0xc615e>
    <c62b9>   DW_AT_data_member_location: 376
 <2><c62bb>: Abbrev Number: 4 (DW_TAG_member)
    <c62bc>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <c62c0>   DW_AT_decl_file   : 8
    <c62c0>   DW_AT_decl_line   : 61
    <c62c1>   DW_AT_decl_column : 9
    <c62c2>   DW_AT_type        : <0xc615e>
    <c62c6>   DW_AT_data_member_location: 384
 <2><c62c8>: Abbrev Number: 4 (DW_TAG_member)
    <c62c9>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <c62cd>   DW_AT_decl_file   : 8
    <c62cd>   DW_AT_decl_line   : 62
    <c62ce>   DW_AT_decl_column : 9
    <c62cf>   DW_AT_type        : <0xc630d>
    <c62d3>   DW_AT_data_member_location: 392
 <2><c62d5>: Abbrev Number: 4 (DW_TAG_member)
    <c62d6>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <c62da>   DW_AT_decl_file   : 8
    <c62da>   DW_AT_decl_line   : 63
    <c62db>   DW_AT_decl_column : 9
    <c62dc>   DW_AT_type        : <0xc615e>
    <c62e0>   DW_AT_data_member_location: 400
 <2><c62e2>: Abbrev Number: 0
 <1><c62e3>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c62e4>   DW_AT_byte_size   : 8
    <c62e4>   DW_AT_type        : <0xc5e56>
 <1><c62e8>: Abbrev Number: 6 (DW_TAG_array_type)
    <c62e9>   DW_AT_type        : <0xc5ea8>
    <c62ed>   DW_AT_sibling     : <0xc62f8>
 <2><c62f1>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c62f2>   DW_AT_type        : <0xc5e6b>
    <c62f6>   DW_AT_upper_bound : 16
 <2><c62f7>: Abbrev Number: 0
 <1><c62f8>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <c62f9>   DW_AT_prototyped  : 1
    <c62f9>   DW_AT_sibling     : <0xc630d>
 <2><c62fd>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c62fe>   DW_AT_type        : <0xc5e80>
 <2><c6302>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c6303>   DW_AT_type        : <0xc5e80>
 <2><c6307>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c6308>   DW_AT_type        : <0xc5e80>
 <2><c630c>: Abbrev Number: 0
 <1><c630d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c630e>   DW_AT_byte_size   : 8
    <c630e>   DW_AT_type        : <0xc62f8>
 <1><c6312>: Abbrev Number: 5 (DW_TAG_typedef)
    <c6313>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c6317>   DW_AT_decl_file   : 8
    <c6318>   DW_AT_decl_line   : 64
    <c6319>   DW_AT_decl_column : 3
    <c631a>   DW_AT_type        : <0xc617c>
 <1><c631e>: Abbrev Number: 22 (DW_TAG_variable)
    <c631f>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <c6323>   DW_AT_decl_file   : 8
    <c6324>   DW_AT_decl_line   : 66
    <c6325>   DW_AT_decl_column : 18
    <c6326>   DW_AT_type        : <0xc6312>
    <c632a>   DW_AT_external    : 1
    <c632a>   DW_AT_declaration : 1
 <1><c632a>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c632b>   DW_AT_external    : 1
    <c632b>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <c632f>   DW_AT_decl_file   : 9
    <c632f>   DW_AT_decl_line   : 25
    <c6330>   DW_AT_decl_column : 13
    <c6330>   DW_AT_prototyped  : 1
    <c6330>   DW_AT_declaration : 1
 <1><c6330>: Abbrev Number: 23 (DW_TAG_subprogram)
    <c6331>   DW_AT_external    : 1
    <c6331>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <c6335>   DW_AT_decl_file   : 8
    <c6336>   DW_AT_decl_line   : 72
    <c6337>   DW_AT_decl_column : 6
    <c6338>   DW_AT_prototyped  : 1
    <c6338>   DW_AT_declaration : 1
    <c6338>   DW_AT_sibling     : <0xc6342>
 <2><c633c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c633d>   DW_AT_type        : <0xc5e80>
 <2><c6341>: Abbrev Number: 0
 <1><c6342>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c6343>   DW_AT_external    : 1
    <c6343>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <c6347>   DW_AT_decl_file   : 9
    <c6347>   DW_AT_decl_line   : 24
    <c6348>   DW_AT_decl_column : 13
    <c6348>   DW_AT_prototyped  : 1
    <c6348>   DW_AT_declaration : 1
 <1><c6348>: Abbrev Number: 24 (DW_TAG_subprogram)
    <c6349>   DW_AT_external    : 1
    <c6349>   DW_AT_name        : (indirect string, offset: 0x1b7dc): fb_ConsoleGetMaxRow
    <c634d>   DW_AT_decl_file   : 1
    <c634e>   DW_AT_decl_line   : 4
    <c634f>   DW_AT_decl_column : 5
    <c6350>   DW_AT_prototyped  : 1
    <c6350>   DW_AT_type        : <0xc5e80>
    <c6354>   DW_AT_low_pc      : 0x472dd0
    <c635c>   DW_AT_high_pc     : 0x36
    <c6364>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6366>   DW_AT_call_all_calls: 1
 <2><c6366>: Abbrev Number: 13 (DW_TAG_call_site)
    <c6367>   DW_AT_call_return_pc: 0x472de3
    <c636f>   DW_AT_call_origin : <0xc6342>
 <2><c6373>: Abbrev Number: 25 (DW_TAG_call_site)
    <c6374>   DW_AT_call_return_pc: 0x472ded
    <c637c>   DW_AT_call_origin : <0xc6330>
    <c6380>   DW_AT_sibling     : <0xc638a>
 <3><c6384>: Abbrev Number: 26 (DW_TAG_call_site_parameter)
    <c6385>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c6387>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><c6389>: Abbrev Number: 0
 <2><c638a>: Abbrev Number: 13 (DW_TAG_call_site)
    <c638b>   DW_AT_call_return_pc: 0x472df2
    <c6393>   DW_AT_call_origin : <0xc632a>
 <2><c6397>: Abbrev Number: 0
 <1><c6398>: Abbrev Number: 0
  Compilation Unit @ offset 0xc6399:
   Length:        0x1d79 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x10006
   Pointer Size:  8
 <0><c63a5>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <c63a6>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c63aa>   DW_AT_language    : 29	(C11)
    <c63ab>   DW_AT_name        : (indirect line string, offset: 0x103e): src/rtlib/linux/io_multikey.c
    <c63af>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c63b3>   DW_AT_low_pc      : 0x472e10
    <c63bb>   DW_AT_high_pc     : 0xb26
    <c63c3>   DW_AT_stmt_list   : 0x67aa4
 <1><c63c7>: Abbrev Number: 10 (DW_TAG_base_type)
    <c63c8>   DW_AT_byte_size   : 1
    <c63c9>   DW_AT_encoding    : 8	(unsigned char)
    <c63ca>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c63ce>: Abbrev Number: 17 (DW_TAG_const_type)
    <c63cf>   DW_AT_type        : <0xc63c7>
 <1><c63d3>: Abbrev Number: 10 (DW_TAG_base_type)
    <c63d4>   DW_AT_byte_size   : 2
    <c63d5>   DW_AT_encoding    : 7	(unsigned)
    <c63d6>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c63da>: Abbrev Number: 10 (DW_TAG_base_type)
    <c63db>   DW_AT_byte_size   : 4
    <c63dc>   DW_AT_encoding    : 7	(unsigned)
    <c63dd>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c63e1>: Abbrev Number: 10 (DW_TAG_base_type)
    <c63e2>   DW_AT_byte_size   : 8
    <c63e3>   DW_AT_encoding    : 7	(unsigned)
    <c63e4>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c63e8>: Abbrev Number: 10 (DW_TAG_base_type)
    <c63e9>   DW_AT_byte_size   : 1
    <c63ea>   DW_AT_encoding    : 6	(signed char)
    <c63eb>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c63ef>: Abbrev Number: 10 (DW_TAG_base_type)
