    <dcca0>   DW_AT_type        : <0xdcca4>
 <1><dcca4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcca5>   DW_AT_byte_size   : 8
    <dcca5>   DW_AT_type        : <0xdcca9>
 <1><dcca9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dccaa>   DW_AT_prototyped  : 1
    <dccaa>   DW_AT_type        : <0xdc9a1>
    <dccae>   DW_AT_sibling     : <0xdccc2>
 <2><dccb2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dccb3>   DW_AT_type        : <0xdcaf6>
 <2><dccb7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dccb8>   DW_AT_type        : <0xdca29>
 <2><dccbc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dccbd>   DW_AT_type        : <0xdc9d5>
 <2><dccc1>: Abbrev Number: 0
 <1><dccc2>: Abbrev Number: 3 (DW_TAG_typedef)
    <dccc3>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <dccc7>   DW_AT_decl_file   : 7
    <dccc8>   DW_AT_decl_line   : 69
    <dccc9>   DW_AT_decl_column : 15
    <dccca>   DW_AT_type        : <0xdccce>
 <1><dccce>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcccf>   DW_AT_byte_size   : 8
    <dcccf>   DW_AT_type        : <0xdccd3>
 <1><dccd3>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dccd4>   DW_AT_prototyped  : 1
    <dccd4>   DW_AT_type        : <0xdc9a1>
    <dccd8>   DW_AT_sibling     : <0xdccec>
 <2><dccdc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dccdd>   DW_AT_type        : <0xdcaf6>
 <2><dcce1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcce2>   DW_AT_type        : <0xdccec>
 <2><dcce6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcce7>   DW_AT_type        : <0xdc9d5>
 <2><dcceb>: Abbrev Number: 0
 <1><dccec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcced>   DW_AT_byte_size   : 8
    <dcced>   DW_AT_type        : <0xdc9ee>
 <1><dccf1>: Abbrev Number: 3 (DW_TAG_typedef)
    <dccf2>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <dccf6>   DW_AT_decl_file   : 7
    <dccf7>   DW_AT_decl_line   : 71
    <dccf8>   DW_AT_decl_column : 15
    <dccf9>   DW_AT_type        : <0xdccfd>
 <1><dccfd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dccfe>   DW_AT_byte_size   : 8
    <dccfe>   DW_AT_type        : <0xdcd02>
 <1><dcd02>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dcd03>   DW_AT_prototyped  : 1
    <dcd03>   DW_AT_type        : <0xdc9a1>
    <dcd07>   DW_AT_sibling     : <0xdcd1b>
 <2><dcd0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd0c>   DW_AT_type        : <0xdcaf6>
 <2><dcd10>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd11>   DW_AT_type        : <0xdca34>
 <2><dcd15>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd16>   DW_AT_type        : <0xdca34>
 <2><dcd1a>: Abbrev Number: 0
 <1><dcd1b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcd1c>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <dcd20>   DW_AT_decl_file   : 7
    <dcd21>   DW_AT_decl_line   : 73
    <dcd22>   DW_AT_decl_column : 15
    <dcd23>   DW_AT_type        : <0xdccfd>
 <1><dcd27>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcd28>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <dcd2c>   DW_AT_decl_file   : 7
    <dcd2d>   DW_AT_decl_line   : 75
    <dcd2e>   DW_AT_decl_column : 15
    <dcd2f>   DW_AT_type        : <0xdcd33>
 <1><dcd33>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcd34>   DW_AT_byte_size   : 8
    <dcd34>   DW_AT_type        : <0xdcd38>
 <1><dcd38>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dcd39>   DW_AT_prototyped  : 1
    <dcd39>   DW_AT_type        : <0xdc9a1>
    <dcd3d>   DW_AT_sibling     : <0xdcd4c>
 <2><dcd41>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd42>   DW_AT_type        : <0xdcaf6>
 <2><dcd46>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd47>   DW_AT_type        : <0xdcd4c>
 <2><dcd4b>: Abbrev Number: 0
 <1><dcd4c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcd4d>   DW_AT_byte_size   : 8
    <dcd4d>   DW_AT_type        : <0xdca7b>
 <1><dcd51>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcd52>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <dcd56>   DW_AT_decl_file   : 7
    <dcd57>   DW_AT_decl_line   : 76
    <dcd58>   DW_AT_decl_column : 15
    <dcd59>   DW_AT_type        : <0xdcd5d>
 <1><dcd5d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcd5e>   DW_AT_byte_size   : 8
    <dcd5e>   DW_AT_type        : <0xdcd62>
 <1><dcd62>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dcd63>   DW_AT_prototyped  : 1
    <dcd63>   DW_AT_type        : <0xdc9a1>
    <dcd67>   DW_AT_sibling     : <0xdcd7b>
 <2><dcd6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd6c>   DW_AT_type        : <0xdcaf6>
 <2><dcd70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd71>   DW_AT_type        : <0xdca95>
 <2><dcd75>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcd76>   DW_AT_type        : <0xdca06>
 <2><dcd7a>: Abbrev Number: 0
 <1><dcd7b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcd7c>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <dcd80>   DW_AT_decl_file   : 7
    <dcd81>   DW_AT_decl_line   : 77
    <dcd82>   DW_AT_decl_column : 15
    <dcd83>   DW_AT_type        : <0xdcbcb>
 <1><dcd87>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dcd88>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <dcd8c>   DW_AT_byte_size   : 112
    <dcd8d>   DW_AT_decl_file   : 7
    <dcd8e>   DW_AT_decl_line   : 80
    <dcd8f>   DW_AT_decl_column : 16
    <dcd90>   DW_AT_sibling     : <0xdce4b>
 <2><dcd94>: Abbrev Number: 2 (DW_TAG_member)
    <dcd95>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <dcd99>   DW_AT_decl_file   : 7
    <dcd9a>   DW_AT_decl_line   : 81
    <dcd9b>   DW_AT_decl_column : 25
    <dcd9c>   DW_AT_type        : <0xdcbbf>
    <dcda0>   DW_AT_data_member_location: 0
 <2><dcda1>: Abbrev Number: 2 (DW_TAG_member)
    <dcda2>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <dcda6>   DW_AT_decl_file   : 7
    <dcda7>   DW_AT_decl_line   : 82
    <dcda8>   DW_AT_decl_column : 25
    <dcda9>   DW_AT_type        : <0xdcbdf>
    <dcdad>   DW_AT_data_member_location: 8
 <2><dcdae>: Abbrev Number: 2 (DW_TAG_member)
    <dcdaf>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <dcdb3>   DW_AT_decl_file   : 7
    <dcdb4>   DW_AT_decl_line   : 83
    <dcdb5>   DW_AT_decl_column : 25
    <dcdb6>   DW_AT_type        : <0xdcbeb>
    <dcdba>   DW_AT_data_member_location: 16
 <2><dcdbb>: Abbrev Number: 2 (DW_TAG_member)
    <dcdbc>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <dcdc0>   DW_AT_decl_file   : 7
    <dcdc1>   DW_AT_decl_line   : 84
    <dcdc2>   DW_AT_decl_column : 25
    <dcdc3>   DW_AT_type        : <0xdcc15>
    <dcdc7>   DW_AT_data_member_location: 24
 <2><dcdc8>: Abbrev Number: 2 (DW_TAG_member)
    <dcdc9>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <dcdcd>   DW_AT_decl_file   : 7
    <dcdce>   DW_AT_decl_line   : 85
    <dcdcf>   DW_AT_decl_column : 25
    <dcdd0>   DW_AT_type        : <0xdcc3f>
    <dcdd4>   DW_AT_data_member_location: 32
 <2><dcdd5>: Abbrev Number: 2 (DW_TAG_member)
    <dcdd6>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <dcdda>   DW_AT_decl_file   : 7
    <dcddb>   DW_AT_decl_line   : 86
    <dcddc>   DW_AT_decl_column : 25
    <dcddd>   DW_AT_type        : <0xdcc6e>
    <dcde1>   DW_AT_data_member_location: 40
 <2><dcde2>: Abbrev Number: 2 (DW_TAG_member)
    <dcde3>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <dcde7>   DW_AT_decl_file   : 7
    <dcde8>   DW_AT_decl_line   : 87
    <dcde9>   DW_AT_decl_column : 25
    <dcdea>   DW_AT_type        : <0xdcc98>
    <dcdee>   DW_AT_data_member_location: 48
 <2><dcdef>: Abbrev Number: 2 (DW_TAG_member)
    <dcdf0>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <dcdf4>   DW_AT_decl_file   : 7
    <dcdf5>   DW_AT_decl_line   : 88
    <dcdf6>   DW_AT_decl_column : 25
    <dcdf7>   DW_AT_type        : <0xdccc2>
    <dcdfb>   DW_AT_data_member_location: 56
 <2><dcdfc>: Abbrev Number: 2 (DW_TAG_member)
    <dcdfd>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <dce01>   DW_AT_decl_file   : 7
    <dce02>   DW_AT_decl_line   : 89
    <dce03>   DW_AT_decl_column : 25
    <dce04>   DW_AT_type        : <0xdccf1>
    <dce08>   DW_AT_data_member_location: 64
 <2><dce09>: Abbrev Number: 2 (DW_TAG_member)
    <dce0a>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <dce0e>   DW_AT_decl_file   : 7
    <dce0f>   DW_AT_decl_line   : 90
    <dce10>   DW_AT_decl_column : 25
    <dce11>   DW_AT_type        : <0xdcd1b>
    <dce15>   DW_AT_data_member_location: 72
 <2><dce16>: Abbrev Number: 2 (DW_TAG_member)
    <dce17>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <dce1b>   DW_AT_decl_file   : 7
    <dce1c>   DW_AT_decl_line   : 91
    <dce1d>   DW_AT_decl_column : 25
    <dce1e>   DW_AT_type        : <0xdcd27>
    <dce22>   DW_AT_data_member_location: 80
 <2><dce23>: Abbrev Number: 2 (DW_TAG_member)
    <dce24>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <dce28>   DW_AT_decl_file   : 7
    <dce29>   DW_AT_decl_line   : 92
    <dce2a>   DW_AT_decl_column : 25
    <dce2b>   DW_AT_type        : <0xdcd51>
    <dce2f>   DW_AT_data_member_location: 88
 <2><dce30>: Abbrev Number: 2 (DW_TAG_member)
    <dce31>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <dce35>   DW_AT_decl_file   : 7
    <dce36>   DW_AT_decl_line   : 93
    <dce37>   DW_AT_decl_column : 25
    <dce38>   DW_AT_type        : <0xdcad1>
    <dce3c>   DW_AT_data_member_location: 96
 <2><dce3d>: Abbrev Number: 2 (DW_TAG_member)
    <dce3e>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <dce42>   DW_AT_decl_file   : 7
    <dce43>   DW_AT_decl_line   : 94
    <dce44>   DW_AT_decl_column : 25
    <dce45>   DW_AT_type        : <0xdcd7b>
    <dce49>   DW_AT_data_member_location: 104
 <2><dce4a>: Abbrev Number: 0
 <1><dce4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dce4c>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <dce50>   DW_AT_decl_file   : 7
    <dce51>   DW_AT_decl_line   : 95
    <dce52>   DW_AT_decl_column : 3
    <dce53>   DW_AT_type        : <0xdcd87>
 <1><dce57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dce58>   DW_AT_byte_size   : 8
    <dce58>   DW_AT_type        : <0xdce4b>
 <1><dce5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <dce5d>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <dce61>   DW_AT_decl_file   : 7
    <dce62>   DW_AT_decl_line   : 117
    <dce63>   DW_AT_decl_column : 3
    <dce64>   DW_AT_type        : <0xdcafb>
 <1><dce68>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dce69>   DW_AT_byte_size   : 8
    <dce6a>   DW_AT_decl_file   : 8
    <dce6a>   DW_AT_decl_line   : 4
    <dce6b>   DW_AT_decl_column : 3
    <dce6b>   DW_AT_sibling     : <0xdce8a>
 <2><dce6f>: Abbrev Number: 2 (DW_TAG_member)
    <dce70>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <dce74>   DW_AT_decl_file   : 8
    <dce75>   DW_AT_decl_line   : 5
    <dce76>   DW_AT_decl_column : 8
    <dce77>   DW_AT_type        : <0xdc9a1>
    <dce7b>   DW_AT_data_member_location: 0
 <2><dce7c>: Abbrev Number: 2 (DW_TAG_member)
    <dce7d>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <dce81>   DW_AT_decl_file   : 8
    <dce82>   DW_AT_decl_line   : 6
    <dce83>   DW_AT_decl_column : 8
    <dce84>   DW_AT_type        : <0xdc9a1>
    <dce88>   DW_AT_data_member_location: 4
 <2><dce89>: Abbrev Number: 0
 <1><dce8a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dce8b>   DW_AT_byte_size   : 16
    <dce8c>   DW_AT_decl_file   : 8
    <dce8c>   DW_AT_decl_line   : 8
    <dce8d>   DW_AT_decl_column : 3
    <dce8d>   DW_AT_sibling     : <0xdcec0>
 <2><dce91>: Abbrev Number: 7 (DW_TAG_member)
    <dce92>   DW_AT_name        : x
    <dce94>   DW_AT_decl_file   : 8
    <dce95>   DW_AT_decl_line   : 9
    <dce96>   DW_AT_decl_column : 8
    <dce97>   DW_AT_type        : <0xdc9a1>
    <dce9b>   DW_AT_data_member_location: 0
 <2><dce9c>: Abbrev Number: 7 (DW_TAG_member)
    <dce9d>   DW_AT_name        : y
    <dce9f>   DW_AT_decl_file   : 8
    <dcea0>   DW_AT_decl_line   : 9
    <dcea1>   DW_AT_decl_column : 11
    <dcea2>   DW_AT_type        : <0xdc9a1>
    <dcea6>   DW_AT_data_member_location: 4
 <2><dcea7>: Abbrev Number: 7 (DW_TAG_member)
    <dcea8>   DW_AT_name        : dx
    <dceab>   DW_AT_decl_file   : 8
    <dceac>   DW_AT_decl_line   : 10
    <dcead>   DW_AT_decl_column : 8
    <dceae>   DW_AT_type        : <0xdc9a1>
    <dceb2>   DW_AT_data_member_location: 8
 <2><dceb3>: Abbrev Number: 7 (DW_TAG_member)
    <dceb4>   DW_AT_name        : dy
    <dceb7>   DW_AT_decl_file   : 8
    <dceb8>   DW_AT_decl_line   : 10
    <dceb9>   DW_AT_decl_column : 12
    <dceba>   DW_AT_type        : <0xdc9a1>
    <dcebe>   DW_AT_data_member_location: 12
 <2><dcebf>: Abbrev Number: 0
 <1><dcec0>: Abbrev Number: 27 (DW_TAG_union_type)
    <dcec1>   DW_AT_byte_size   : 16
    <dcec2>   DW_AT_decl_file   : 8
    <dcec3>   DW_AT_decl_line   : 3
    <dcec4>   DW_AT_decl_column : 2
    <dcec5>   DW_AT_sibling     : <0xdcef0>
 <2><dcec9>: Abbrev Number: 16 (DW_TAG_member)
    <dceca>   DW_AT_type        : <0xdce68>
 <2><dcece>: Abbrev Number: 16 (DW_TAG_member)
    <dcecf>   DW_AT_type        : <0xdce8a>
 <2><dced3>: Abbrev Number: 28 (DW_TAG_member)
    <dced4>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <dced8>   DW_AT_decl_file   : 8
    <dced9>   DW_AT_decl_line   : 12
    <dceda>   DW_AT_decl_column : 7
    <dcedb>   DW_AT_type        : <0xdc9a1>
 <2><dcedf>: Abbrev Number: 17 (DW_TAG_member)
    <dcee0>   DW_AT_name        : z
    <dcee2>   DW_AT_decl_file   : 8
    <dcee2>   DW_AT_decl_line   : 13
    <dcee3>   DW_AT_decl_column : 7
    <dcee3>   DW_AT_type        : <0xdc9a1>
 <2><dcee7>: Abbrev Number: 17 (DW_TAG_member)
    <dcee8>   DW_AT_name        : w
    <dceea>   DW_AT_decl_file   : 8
    <dceea>   DW_AT_decl_line   : 14
    <dceeb>   DW_AT_decl_column : 7
    <dceeb>   DW_AT_type        : <0xdc9a1>
 <2><dceef>: Abbrev Number: 0
 <1><dcef0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dcef1>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <dcef5>   DW_AT_byte_size   : 20
    <dcef6>   DW_AT_decl_file   : 8
    <dcef7>   DW_AT_decl_line   : 1
    <dcef8>   DW_AT_decl_column : 8
    <dcef9>   DW_AT_sibling     : <0xdcf11>
 <2><dcefd>: Abbrev Number: 2 (DW_TAG_member)
    <dcefe>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <dcf02>   DW_AT_decl_file   : 8
    <dcf03>   DW_AT_decl_line   : 2
    <dcf04>   DW_AT_decl_column : 6
    <dcf05>   DW_AT_type        : <0xdc9a1>
    <dcf09>   DW_AT_data_member_location: 0
 <2><dcf0a>: Abbrev Number: 29 (DW_TAG_member)
    <dcf0b>   DW_AT_type        : <0xdcec0>
    <dcf0f>   DW_AT_data_member_location: 4
 <2><dcf10>: Abbrev Number: 0
 <1><dcf11>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf12>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <dcf16>   DW_AT_decl_file   : 8
    <dcf17>   DW_AT_decl_line   : 18
    <dcf18>   DW_AT_decl_column : 23
    <dcf19>   DW_AT_type        : <0xdcef0>
 <1><dcf1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf1e>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <dcf22>   DW_AT_decl_file   : 9
    <dcf23>   DW_AT_decl_line   : 1
    <dcf24>   DW_AT_decl_column : 23
    <dcf25>   DW_AT_type        : <0xdcf29>
 <1><dcf29>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcf2a>   DW_AT_byte_size   : 8
    <dcf2a>   DW_AT_type        : <0xdcf2e>
 <1><dcf2e>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <dcf2f>   DW_AT_prototyped  : 1
    <dcf2f>   DW_AT_type        : <0xdcd4c>
 <1><dcf33>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf34>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <dcf38>   DW_AT_decl_file   : 9
    <dcf39>   DW_AT_decl_line   : 2
    <dcf3a>   DW_AT_decl_column : 23
    <dcf3b>   DW_AT_type        : <0xdcf3f>
 <1><dcf3f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcf40>   DW_AT_byte_size   : 8
    <dcf40>   DW_AT_type        : <0xdcf44>
 <1><dcf44>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <dcf45>   DW_AT_prototyped  : 1
    <dcf45>   DW_AT_type        : <0xdc9a1>
 <1><dcf49>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf4a>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <dcf4e>   DW_AT_decl_file   : 9
    <dcf4f>   DW_AT_decl_line   : 3
    <dcf50>   DW_AT_decl_column : 23
    <dcf51>   DW_AT_type        : <0xdcf3f>
 <1><dcf55>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf56>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <dcf5a>   DW_AT_decl_file   : 9
    <dcf5b>   DW_AT_decl_line   : 10
    <dcf5c>   DW_AT_decl_column : 23
    <dcf5d>   DW_AT_type        : <0xdcf61>
 <1><dcf61>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcf62>   DW_AT_byte_size   : 8
    <dcf62>   DW_AT_type        : <0xdcf66>
 <1><dcf66>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dcf67>   DW_AT_prototyped  : 1
    <dcf67>   DW_AT_sibling     : <0xdcf71>
 <2><dcf6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcf6c>   DW_AT_type        : <0xdc9a1>
 <2><dcf70>: Abbrev Number: 0
 <1><dcf71>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf72>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <dcf76>   DW_AT_decl_file   : 9
    <dcf77>   DW_AT_decl_line   : 14
    <dcf78>   DW_AT_decl_column : 23
    <dcf79>   DW_AT_type        : <0xdcf7d>
 <1><dcf7d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcf7e>   DW_AT_byte_size   : 8
    <dcf7e>   DW_AT_type        : <0xdcf82>
 <1><dcf82>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dcf83>   DW_AT_prototyped  : 1
    <dcf83>   DW_AT_type        : <0xdc9a1>
    <dcf87>   DW_AT_sibling     : <0xdcf9b>
 <2><dcf8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcf8c>   DW_AT_type        : <0xdc9a1>
 <2><dcf90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcf91>   DW_AT_type        : <0xdc9a1>
 <2><dcf95>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcf96>   DW_AT_type        : <0xdc9a1>
 <2><dcf9a>: Abbrev Number: 0
 <1><dcf9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf9c>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <dcfa0>   DW_AT_decl_file   : 9
    <dcfa1>   DW_AT_decl_line   : 18
    <dcfa2>   DW_AT_decl_column : 23
    <dcfa3>   DW_AT_type        : <0xdcf7d>
 <1><dcfa7>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcfa8>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <dcfac>   DW_AT_decl_file   : 9
    <dcfad>   DW_AT_decl_line   : 24
    <dcfae>   DW_AT_decl_column : 23
    <dcfaf>   DW_AT_type        : <0xdca40>
 <1><dcfb3>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcfb4>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <dcfb8>   DW_AT_decl_file   : 9
    <dcfb9>   DW_AT_decl_line   : 28
    <dcfba>   DW_AT_decl_column : 23
    <dcfbb>   DW_AT_type        : <0xdcfbf>
 <1><dcfbf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcfc0>   DW_AT_byte_size   : 8
    <dcfc0>   DW_AT_type        : <0xdcfc4>
 <1><dcfc4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dcfc5>   DW_AT_prototyped  : 1
    <dcfc5>   DW_AT_type        : <0xdc9a1>
    <dcfc9>   DW_AT_sibling     : <0xdcfd8>
 <2><dcfcd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcfce>   DW_AT_type        : <0xdc9a1>
 <2><dcfd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dcfd3>   DW_AT_type        : <0xdc9a1>
 <2><dcfd7>: Abbrev Number: 0
 <1><dcfd8>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcfd9>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <dcfdd>   DW_AT_decl_file   : 9
    <dcfde>   DW_AT_decl_line   : 34
    <dcfdf>   DW_AT_decl_column : 23
    <dcfe0>   DW_AT_type        : <0xdcf3f>
 <1><dcfe4>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcfe5>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <dcfe9>   DW_AT_decl_file   : 9
    <dcfea>   DW_AT_decl_line   : 35
    <dcfeb>   DW_AT_decl_column : 23
    <dcfec>   DW_AT_type        : <0xdcf3f>
 <1><dcff0>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcff1>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <dcff5>   DW_AT_decl_file   : 9
    <dcff6>   DW_AT_decl_line   : 36
    <dcff7>   DW_AT_decl_column : 23
    <dcff8>   DW_AT_type        : <0xdcffc>
 <1><dcffc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dcffd>   DW_AT_byte_size   : 8
    <dcffd>   DW_AT_type        : <0xdd001>
 <1><dd001>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dd002>   DW_AT_prototyped  : 1
    <dd002>   DW_AT_sibling     : <0xdd011>
 <2><dd006>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd007>   DW_AT_type        : <0xdd011>
 <2><dd00b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd00c>   DW_AT_type        : <0xdd011>
 <2><dd010>: Abbrev Number: 0
 <1><dd011>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd012>   DW_AT_byte_size   : 8
    <dd012>   DW_AT_type        : <0xdc9a1>
 <1><dd016>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd017>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <dd01b>   DW_AT_decl_file   : 9
    <dd01c>   DW_AT_decl_line   : 37
    <dd01d>   DW_AT_decl_column : 23
    <dd01e>   DW_AT_type        : <0xdcffc>
 <1><dd022>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd023>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <dd027>   DW_AT_decl_file   : 9
    <dd028>   DW_AT_decl_line   : 45
    <dd029>   DW_AT_decl_column : 24
    <dd02a>   DW_AT_type        : <0xdd02e>
 <1><dd02e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd02f>   DW_AT_byte_size   : 8
    <dd02f>   DW_AT_type        : <0xdd033>
 <1><dd033>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd034>   DW_AT_prototyped  : 1
    <dd034>   DW_AT_type        : <0xdc985>
    <dd038>   DW_AT_sibling     : <0xdd04c>
 <2><dd03c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd03d>   DW_AT_type        : <0xdc9a1>
 <2><dd041>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd042>   DW_AT_type        : <0xdc9a1>
 <2><dd046>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd047>   DW_AT_type        : <0xdc9a1>
 <2><dd04b>: Abbrev Number: 0
 <1><dd04c>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd04d>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <dd051>   DW_AT_decl_file   : 9
    <dd052>   DW_AT_decl_line   : 48
    <dd053>   DW_AT_decl_column : 23
    <dd054>   DW_AT_type        : <0xdd058>
 <1><dd058>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd059>   DW_AT_byte_size   : 8
    <dd059>   DW_AT_type        : <0xdd05d>
 <1><dd05d>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dd05e>   DW_AT_prototyped  : 1
    <dd05e>   DW_AT_sibling     : <0xdd072>
 <2><dd062>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd063>   DW_AT_type        : <0xdca29>
 <2><dd067>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd068>   DW_AT_type        : <0xdc9d5>
 <2><dd06c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd06d>   DW_AT_type        : <0xdc9a1>
 <2><dd071>: Abbrev Number: 0
 <1><dd072>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd073>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <dd077>   DW_AT_decl_file   : 9
    <dd078>   DW_AT_decl_line   : 49
    <dd079>   DW_AT_decl_column : 23
    <dd07a>   DW_AT_type        : <0xdd07e>
 <1><dd07e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd07f>   DW_AT_byte_size   : 8
    <dd07f>   DW_AT_type        : <0xdd083>
 <1><dd083>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dd084>   DW_AT_prototyped  : 1
    <dd084>   DW_AT_sibling     : <0xdd098>
 <2><dd088>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd089>   DW_AT_type        : <0xdccec>
 <2><dd08d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd08e>   DW_AT_type        : <0xdc9d5>
 <2><dd092>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd093>   DW_AT_type        : <0xdc9a1>
 <2><dd097>: Abbrev Number: 0
 <1><dd098>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd099>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <dd09d>   DW_AT_decl_file   : 9
    <dd09e>   DW_AT_decl_line   : 51
    <dd09f>   DW_AT_decl_column : 24
    <dd0a0>   DW_AT_type        : <0xdd0a4>
 <1><dd0a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd0a5>   DW_AT_byte_size   : 8
    <dd0a5>   DW_AT_type        : <0xdd0a9>
 <1><dd0a9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd0aa>   DW_AT_prototyped  : 1
    <dd0aa>   DW_AT_type        : <0xdc9c9>
    <dd0ae>   DW_AT_sibling     : <0xdd0bd>
 <2><dd0b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0b3>   DW_AT_type        : <0xdc9c9>
 <2><dd0b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0b8>   DW_AT_type        : <0xdca06>
 <2><dd0bc>: Abbrev Number: 0
 <1><dd0bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd0be>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <dd0c2>   DW_AT_decl_file   : 9
    <dd0c3>   DW_AT_decl_line   : 54
    <dd0c4>   DW_AT_decl_column : 23
    <dd0c5>   DW_AT_type        : <0xdd0c9>
 <1><dd0c9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd0ca>   DW_AT_byte_size   : 8
    <dd0ca>   DW_AT_type        : <0xdd0ce>
 <1><dd0ce>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd0cf>   DW_AT_prototyped  : 1
    <dd0cf>   DW_AT_type        : <0xdc9a1>
    <dd0d3>   DW_AT_sibling     : <0xdd0f6>
 <2><dd0d7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0d8>   DW_AT_type        : <0xdcd4c>
 <2><dd0dc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0dd>   DW_AT_type        : <0xdc9bb>
 <2><dd0e1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0e2>   DW_AT_type        : <0xdca06>
 <2><dd0e6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0e7>   DW_AT_type        : <0xdc9a1>
 <2><dd0eb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0ec>   DW_AT_type        : <0xdc9a1>
 <2><dd0f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd0f1>   DW_AT_type        : <0xdc9a1>
 <2><dd0f5>: Abbrev Number: 0
 <1><dd0f6>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd0f7>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <dd0fb>   DW_AT_decl_file   : 9
    <dd0fc>   DW_AT_decl_line   : 56
    <dd0fd>   DW_AT_decl_column : 23
    <dd0fe>   DW_AT_type        : <0xdd102>
 <1><dd102>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd103>   DW_AT_byte_size   : 8
    <dd103>   DW_AT_type        : <0xdd107>
 <1><dd107>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd108>   DW_AT_prototyped  : 1
    <dd108>   DW_AT_type        : <0xdc9a1>
    <dd10c>   DW_AT_sibling     : <0xdd12a>
 <2><dd110>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd111>   DW_AT_type        : <0xdccec>
 <2><dd115>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd116>   DW_AT_type        : <0xdca95>
 <2><dd11a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd11b>   DW_AT_type        : <0xdca06>
 <2><dd11f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd120>   DW_AT_type        : <0xdc9a1>
 <2><dd124>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd125>   DW_AT_type        : <0xdc9a1>
 <2><dd129>: Abbrev Number: 0
 <1><dd12a>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd12b>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <dd12f>   DW_AT_decl_file   : 9
    <dd130>   DW_AT_decl_line   : 67
    <dd131>   DW_AT_decl_column : 23
    <dd132>   DW_AT_type        : <0xdd136>
 <1><dd136>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd137>   DW_AT_byte_size   : 8
    <dd137>   DW_AT_type        : <0xdd13b>
 <1><dd13b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd13c>   DW_AT_prototyped  : 1
    <dd13c>   DW_AT_type        : <0xdc9a1>
    <dd140>   DW_AT_sibling     : <0xdd14a>
 <2><dd144>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd145>   DW_AT_type        : <0xdc9a1>
 <2><dd149>: Abbrev Number: 0
 <1><dd14a>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd14b>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <dd14f>   DW_AT_decl_file   : 9
    <dd150>   DW_AT_decl_line   : 68
    <dd151>   DW_AT_decl_column : 23
    <dd152>   DW_AT_type        : <0xdd156>
 <1><dd156>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd157>   DW_AT_byte_size   : 8
    <dd157>   DW_AT_type        : <0xdd15b>
 <1><dd15b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd15c>   DW_AT_prototyped  : 1
    <dd15c>   DW_AT_type        : <0xdc9a1>
    <dd160>   DW_AT_sibling     : <0xdd17e>
 <2><dd164>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd165>   DW_AT_type        : <0xdd011>
 <2><dd169>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd16a>   DW_AT_type        : <0xdd011>
 <2><dd16e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd16f>   DW_AT_type        : <0xdd011>
 <2><dd173>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd174>   DW_AT_type        : <0xdd011>
 <2><dd178>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd179>   DW_AT_type        : <0xdd011>
 <2><dd17d>: Abbrev Number: 0
 <1><dd17e>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd17f>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <dd183>   DW_AT_decl_file   : 9
    <dd184>   DW_AT_decl_line   : 69
    <dd185>   DW_AT_decl_column : 23
    <dd186>   DW_AT_type        : <0xdd18a>
 <1><dd18a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd18b>   DW_AT_byte_size   : 8
    <dd18b>   DW_AT_type        : <0xdd18f>
 <1><dd18f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd190>   DW_AT_prototyped  : 1
    <dd190>   DW_AT_type        : <0xdc9a1>
    <dd194>   DW_AT_sibling     : <0xdd1ad>
 <2><dd198>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd199>   DW_AT_type        : <0xdc9a1>
 <2><dd19d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd19e>   DW_AT_type        : <0xdc9a1>
 <2><dd1a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd1a3>   DW_AT_type        : <0xdc9a1>
 <2><dd1a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd1a8>   DW_AT_type        : <0xdc9a1>
 <2><dd1ac>: Abbrev Number: 0
 <1><dd1ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd1ae>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <dd1b2>   DW_AT_decl_file   : 9
    <dd1b3>   DW_AT_decl_line   : 73
    <dd1b4>   DW_AT_decl_column : 23
    <dd1b5>   DW_AT_type        : <0xdd1b9>
 <1><dd1b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd1ba>   DW_AT_byte_size   : 8
    <dd1ba>   DW_AT_type        : <0xdd1be>
 <1><dd1be>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd1bf>   DW_AT_prototyped  : 1
    <dd1bf>   DW_AT_type        : <0xdc9a1>
    <dd1c3>   DW_AT_sibling     : <0xdd1cd>
 <2><dd1c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd1c8>   DW_AT_type        : <0xdc97e>
 <2><dd1cc>: Abbrev Number: 0
 <1><dd1cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd1ce>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <dd1d2>   DW_AT_decl_file   : 9
    <dd1d3>   DW_AT_decl_line   : 74
    <dd1d4>   DW_AT_decl_column : 23
    <dd1d5>   DW_AT_type        : <0xdd1d9>
 <1><dd1d9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd1da>   DW_AT_byte_size   : 8
    <dd1da>   DW_AT_type        : <0xdd1de>
 <1><dd1de>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <dd1df>   DW_AT_prototyped  : 1
    <dd1df>   DW_AT_type        : <0xdc9a1>
    <dd1e3>   DW_AT_sibling     : <0xdd1f2>
 <2><dd1e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd1e8>   DW_AT_type        : <0xdc97e>
 <2><dd1ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd1ed>   DW_AT_type        : <0xdc977>
 <2><dd1f1>: Abbrev Number: 0
 <1><dd1f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd1f3>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <dd1f7>   DW_AT_decl_file   : 9
    <dd1f8>   DW_AT_decl_line   : 80
    <dd1f9>   DW_AT_decl_column : 23
    <dd1fa>   DW_AT_type        : <0xdcf61>
 <1><dd1fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd1ff>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <dd203>   DW_AT_decl_file   : 9
    <dd204>   DW_AT_decl_line   : 83
    <dd205>   DW_AT_decl_column : 23
    <dd206>   DW_AT_type        : <0xdd136>
 <1><dd20a>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd20b>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <dd20f>   DW_AT_decl_file   : 9
    <dd210>   DW_AT_decl_line   : 86
    <dd211>   DW_AT_decl_column : 23
    <dd212>   DW_AT_type        : <0xdcfbf>
 <1><dd216>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd217>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <dd21b>   DW_AT_decl_file   : 9
    <dd21c>   DW_AT_decl_line   : 89
    <dd21d>   DW_AT_decl_column : 23
    <dd21e>   DW_AT_type        : <0xdcfbf>
 <1><dd222>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd223>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <dd227>   DW_AT_decl_file   : 9
    <dd228>   DW_AT_decl_line   : 91
    <dd229>   DW_AT_decl_column : 23
    <dd22a>   DW_AT_type        : <0xdd22e>
 <1><dd22e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd22f>   DW_AT_byte_size   : 8
    <dd22f>   DW_AT_type        : <0xdd233>
 <1><dd233>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <dd234>   DW_AT_prototyped  : 1
    <dd234>   DW_AT_sibling     : <0xdd23e>
 <2><dd238>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <dd239>   DW_AT_type        : <0xdd23e>
 <2><dd23d>: Abbrev Number: 0
 <1><dd23e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dd23f>   DW_AT_byte_size   : 8
    <dd23f>   DW_AT_type        : <0xdcf11>
 <1><dd243>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dd244>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <dd248>   DW_AT_byte_size   : 224
    <dd249>   DW_AT_decl_file   : 9
    <dd24a>   DW_AT_decl_line   : 93
    <dd24b>   DW_AT_decl_column : 16
    <dd24c>   DW_AT_sibling     : <0xdd3bd>
 <2><dd250>: Abbrev Number: 2 (DW_TAG_member)
    <dd251>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <dd255>   DW_AT_decl_file   : 9
    <dd256>   DW_AT_decl_line   : 94
    <dd257>   DW_AT_decl_column : 23
    <dd258>   DW_AT_type        : <0xdcf1d>
    <dd25c>   DW_AT_data_member_location: 0
 <2><dd25d>: Abbrev Number: 2 (DW_TAG_member)
    <dd25e>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <dd262>   DW_AT_decl_file   : 9
    <dd263>   DW_AT_decl_line   : 95
    <dd264>   DW_AT_decl_column : 23
    <dd265>   DW_AT_type        : <0xdcf33>
    <dd269>   DW_AT_data_member_location: 8
 <2><dd26a>: Abbrev Number: 2 (DW_TAG_member)
    <dd26b>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <dd26f>   DW_AT_decl_file   : 9
    <dd270>   DW_AT_decl_line   : 96
    <dd271>   DW_AT_decl_column : 23
    <dd272>   DW_AT_type        : <0xdcf49>
    <dd276>   DW_AT_data_member_location: 16
 <2><dd277>: Abbrev Number: 2 (DW_TAG_member)
    <dd278>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <dd27c>   DW_AT_decl_file   : 9
    <dd27d>   DW_AT_decl_line   : 97
    <dd27e>   DW_AT_decl_column : 23
    <dd27f>   DW_AT_type        : <0xdcf55>
    <dd283>   DW_AT_data_member_location: 24
 <2><dd284>: Abbrev Number: 2 (DW_TAG_member)
    <dd285>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <dd289>   DW_AT_decl_file   : 9
    <dd28a>   DW_AT_decl_line   : 98
    <dd28b>   DW_AT_decl_column : 23
    <dd28c>   DW_AT_type        : <0xdcf71>
    <dd290>   DW_AT_data_member_location: 32
 <2><dd291>: Abbrev Number: 2 (DW_TAG_member)
    <dd292>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <dd296>   DW_AT_decl_file   : 9
    <dd297>   DW_AT_decl_line   : 99
    <dd298>   DW_AT_decl_column : 23
    <dd299>   DW_AT_type        : <0xdcf9b>
    <dd29d>   DW_AT_data_member_location: 40
 <2><dd29e>: Abbrev Number: 2 (DW_TAG_member)
    <dd29f>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <dd2a3>   DW_AT_decl_file   : 9
    <dd2a4>   DW_AT_decl_line   : 100
    <dd2a5>   DW_AT_decl_column : 23
    <dd2a6>   DW_AT_type        : <0xdcfb3>
    <dd2aa>   DW_AT_data_member_location: 48
 <2><dd2ab>: Abbrev Number: 2 (DW_TAG_member)
    <dd2ac>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <dd2b0>   DW_AT_decl_file   : 9
    <dd2b1>   DW_AT_decl_line   : 101
    <dd2b2>   DW_AT_decl_column : 23
    <dd2b3>   DW_AT_type        : <0xdcfd8>
    <dd2b7>   DW_AT_data_member_location: 56
 <2><dd2b8>: Abbrev Number: 2 (DW_TAG_member)
    <dd2b9>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <dd2bd>   DW_AT_decl_file   : 9
    <dd2be>   DW_AT_decl_line   : 102
    <dd2bf>   DW_AT_decl_column : 23
    <dd2c0>   DW_AT_type        : <0xdcfe4>
    <dd2c4>   DW_AT_data_member_location: 64
 <2><dd2c5>: Abbrev Number: 2 (DW_TAG_member)
    <dd2c6>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <dd2ca>   DW_AT_decl_file   : 9
    <dd2cb>   DW_AT_decl_line   : 103
    <dd2cc>   DW_AT_decl_column : 23
    <dd2cd>   DW_AT_type        : <0xdcff0>
    <dd2d1>   DW_AT_data_member_location: 72
 <2><dd2d2>: Abbrev Number: 2 (DW_TAG_member)
    <dd2d3>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <dd2d7>   DW_AT_decl_file   : 9
    <dd2d8>   DW_AT_decl_line   : 104
    <dd2d9>   DW_AT_decl_column : 23
    <dd2da>   DW_AT_type        : <0xdd016>
    <dd2de>   DW_AT_data_member_location: 80
 <2><dd2df>: Abbrev Number: 2 (DW_TAG_member)
    <dd2e0>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <dd2e4>   DW_AT_decl_file   : 9
    <dd2e5>   DW_AT_decl_line   : 105
    <dd2e6>   DW_AT_decl_column : 24
    <dd2e7>   DW_AT_type        : <0xdd04c>
    <dd2eb>   DW_AT_data_member_location: 88
 <2><dd2ec>: Abbrev Number: 2 (DW_TAG_member)
    <dd2ed>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <dd2f1>   DW_AT_decl_file   : 9
    <dd2f2>   DW_AT_decl_line   : 106
    <dd2f3>   DW_AT_decl_column : 25
    <dd2f4>   DW_AT_type        : <0xdd072>
    <dd2f8>   DW_AT_data_member_location: 96
 <2><dd2f9>: Abbrev Number: 2 (DW_TAG_member)
    <dd2fa>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <dd2fe>   DW_AT_decl_file   : 9
    <dd2ff>   DW_AT_decl_line   : 107
    <dd300>   DW_AT_decl_column : 23
    <dd301>   DW_AT_type        : <0xdd098>
    <dd305>   DW_AT_data_member_location: 104
 <2><dd306>: Abbrev Number: 2 (DW_TAG_member)
    <dd307>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <dd30b>   DW_AT_decl_file   : 9
    <dd30c>   DW_AT_decl_line   : 108
    <dd30d>   DW_AT_decl_column : 23
    <dd30e>   DW_AT_type        : <0xdd12a>
    <dd312>   DW_AT_data_member_location: 112
 <2><dd313>: Abbrev Number: 2 (DW_TAG_member)
    <dd314>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <dd318>   DW_AT_decl_file   : 9
    <dd319>   DW_AT_decl_line   : 109
    <dd31a>   DW_AT_decl_column : 23
    <dd31b>   DW_AT_type        : <0xdd14a>
    <dd31f>   DW_AT_data_member_location: 120
 <2><dd320>: Abbrev Number: 2 (DW_TAG_member)
    <dd321>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <dd325>   DW_AT_decl_file   : 9
    <dd326>   DW_AT_decl_line   : 110
    <dd327>   DW_AT_decl_column : 23
    <dd328>   DW_AT_type        : <0xdd17e>
    <dd32c>   DW_AT_data_member_location: 128
 <2><dd32d>: Abbrev Number: 2 (DW_TAG_member)
    <dd32e>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <dd332>   DW_AT_decl_file   : 9
    <dd333>   DW_AT_decl_line   : 111
    <dd334>   DW_AT_decl_column : 23
    <dd335>   DW_AT_type        : <0xdd1ad>
    <dd339>   DW_AT_data_member_location: 136
 <2><dd33a>: Abbrev Number: 2 (DW_TAG_member)
    <dd33b>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <dd33f>   DW_AT_decl_file   : 9
    <dd340>   DW_AT_decl_line   : 112
    <dd341>   DW_AT_decl_column : 23
    <dd342>   DW_AT_type        : <0xdd1cd>
    <dd346>   DW_AT_data_member_location: 144
 <2><dd347>: Abbrev Number: 2 (DW_TAG_member)
    <dd348>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <dd34c>   DW_AT_decl_file   : 9
    <dd34d>   DW_AT_decl_line   : 113
    <dd34e>   DW_AT_decl_column : 25
    <dd34f>   DW_AT_type        : <0xdcfa7>
    <dd353>   DW_AT_data_member_location: 152
 <2><dd354>: Abbrev Number: 2 (DW_TAG_member)
    <dd355>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <dd359>   DW_AT_decl_file   : 9
    <dd35a>   DW_AT_decl_line   : 114
    <dd35b>   DW_AT_decl_column : 24
    <dd35c>   DW_AT_type        : <0xdd0bd>
    <dd360>   DW_AT_data_member_location: 160
 <2><dd361>: Abbrev Number: 2 (DW_TAG_member)
    <dd362>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <dd366>   DW_AT_decl_file   : 9
    <dd367>   DW_AT_decl_line   : 115
    <dd368>   DW_AT_decl_column : 25
    <dd369>   DW_AT_type        : <0xdd0f6>
    <dd36d>   DW_AT_data_member_location: 168
 <2><dd36e>: Abbrev Number: 2 (DW_TAG_member)
    <dd36f>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <dd373>   DW_AT_decl_file   : 9
    <dd374>   DW_AT_decl_line   : 116
    <dd375>   DW_AT_decl_column : 23
    <dd376>   DW_AT_type        : <0xdd022>
    <dd37a>   DW_AT_data_member_location: 176
 <2><dd37b>: Abbrev Number: 2 (DW_TAG_member)
    <dd37c>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <dd380>   DW_AT_decl_file   : 9
    <dd381>   DW_AT_decl_line   : 117
    <dd382>   DW_AT_decl_column : 23
    <dd383>   DW_AT_type        : <0xdd1f2>
    <dd387>   DW_AT_data_member_location: 184
 <2><dd388>: Abbrev Number: 2 (DW_TAG_member)
    <dd389>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <dd38d>   DW_AT_decl_file   : 9
    <dd38e>   DW_AT_decl_line   : 118
    <dd38f>   DW_AT_decl_column : 22
    <dd390>   DW_AT_type        : <0xdd1fe>
    <dd394>   DW_AT_data_member_location: 192
 <2><dd395>: Abbrev Number: 2 (DW_TAG_member)
    <dd396>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <dd39a>   DW_AT_decl_file   : 9
    <dd39b>   DW_AT_decl_line   : 119
    <dd39c>   DW_AT_decl_column : 23
    <dd39d>   DW_AT_type        : <0xdd20a>
    <dd3a1>   DW_AT_data_member_location: 200
 <2><dd3a2>: Abbrev Number: 2 (DW_TAG_member)
    <dd3a3>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <dd3a7>   DW_AT_decl_file   : 9
    <dd3a8>   DW_AT_decl_line   : 120
    <dd3a9>   DW_AT_decl_column : 22
    <dd3aa>   DW_AT_type        : <0xdd216>
    <dd3ae>   DW_AT_data_member_location: 208
 <2><dd3af>: Abbrev Number: 2 (DW_TAG_member)
    <dd3b0>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <dd3b4>   DW_AT_decl_file   : 9
    <dd3b5>   DW_AT_decl_line   : 121
    <dd3b6>   DW_AT_decl_column : 23
    <dd3b7>   DW_AT_type        : <0xdd222>
    <dd3bb>   DW_AT_data_member_location: 216
 <2><dd3bc>: Abbrev Number: 0
 <1><dd3bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd3be>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <dd3c2>   DW_AT_decl_file   : 9
    <dd3c3>   DW_AT_decl_line   : 122
    <dd3c4>   DW_AT_decl_column : 3
    <dd3c5>   DW_AT_type        : <0xdd243>
 <1><dd3c9>: Abbrev Number: 30 (DW_TAG_structure_type)
    <dd3ca>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <dd3ce>   DW_AT_byte_size   : 20848
    <dd3d0>   DW_AT_decl_file   : 10
    <dd3d1>   DW_AT_decl_line   : 349
    <dd3d3>   DW_AT_decl_column : 16
    <dd3d4>   DW_AT_sibling     : <0xdd449>
 <2><dd3d8>: Abbrev Number: 10 (DW_TAG_member)
    <dd3d9>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <dd3dd>   DW_AT_decl_file   : 10
    <dd3dd>   DW_AT_decl_line   : 350
    <dd3df>   DW_AT_decl_column : 18
    <dd3df>   DW_AT_type        : <0xdc9a1>
    <dd3e3>   DW_AT_data_member_location: 0
 <2><dd3e4>: Abbrev Number: 10 (DW_TAG_member)
    <dd3e5>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <dd3e9>   DW_AT_decl_file   : 10
    <dd3e9>   DW_AT_decl_line   : 351
    <dd3eb>   DW_AT_decl_column : 18
    <dd3eb>   DW_AT_type        : <0xdca2f>
    <dd3ef>   DW_AT_data_member_location: 8
 <2><dd3f0>: Abbrev Number: 10 (DW_TAG_member)
    <dd3f1>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <dd3f5>   DW_AT_decl_file   : 10
    <dd3f5>   DW_AT_decl_line   : 352
    <dd3f7>   DW_AT_decl_column : 18
    <dd3f7>   DW_AT_type        : <0xdca7b>
    <dd3fb>   DW_AT_data_member_location: 16
 <2><dd3fc>: Abbrev Number: 10 (DW_TAG_member)
    <dd3fd>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <dd401>   DW_AT_decl_file   : 10
    <dd401>   DW_AT_decl_line   : 353
    <dd403>   DW_AT_decl_column : 18
    <dd403>   DW_AT_type        : <0xdc9c9>
    <dd407>   DW_AT_data_member_location: 40
 <2><dd408>: Abbrev Number: 10 (DW_TAG_member)
    <dd409>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <dd40d>   DW_AT_decl_file   : 10
    <dd40d>   DW_AT_decl_line   : 354
    <dd40f>   DW_AT_decl_column : 18
    <dd40f>   DW_AT_type        : <0xdd3bd>
    <dd413>   DW_AT_data_member_location: 48
 <2><dd414>: Abbrev Number: 12 (DW_TAG_member)
    <dd415>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <dd419>   DW_AT_decl_file   : 10
    <dd419>   DW_AT_decl_line   : 355
    <dd41b>   DW_AT_decl_column : 18
    <dd41b>   DW_AT_type        : <0xdd449>
    <dd41f>   DW_AT_data_member_location: 272
 <2><dd421>: Abbrev Number: 12 (DW_TAG_member)
    <dd422>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <dd426>   DW_AT_decl_file   : 10
    <dd426>   DW_AT_decl_line   : 356
    <dd428>   DW_AT_decl_column : 18
    <dd428>   DW_AT_type        : <0xdc9a1>
    <dd42c>   DW_AT_data_member_location: 20832
 <2><dd42e>: Abbrev Number: 12 (DW_TAG_member)
    <dd42f>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <dd433>   DW_AT_decl_file   : 10
    <dd433>   DW_AT_decl_line   : 357
    <dd435>   DW_AT_decl_column : 18
    <dd435>   DW_AT_type        : <0xdc9a1>
    <dd439>   DW_AT_data_member_location: 20836
 <2><dd43b>: Abbrev Number: 12 (DW_TAG_member)
    <dd43c>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <dd440>   DW_AT_decl_file   : 10
    <dd440>   DW_AT_decl_line   : 358
    <dd442>   DW_AT_decl_column : 18
    <dd442>   DW_AT_type        : <0xdca40>
    <dd446>   DW_AT_data_member_location: 20840
 <2><dd448>: Abbrev Number: 0
 <1><dd449>: Abbrev Number: 14 (DW_TAG_array_type)
    <dd44a>   DW_AT_type        : <0xdce5c>
    <dd44e>   DW_AT_sibling     : <0xdd45a>
 <2><dd452>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <dd453>   DW_AT_type        : <0xdc98c>
    <dd457>   DW_AT_upper_bound : 256
 <2><dd459>: Abbrev Number: 0
 <1><dd45a>: Abbrev Number: 13 (DW_TAG_typedef)
    <dd45b>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <dd45f>   DW_AT_decl_file   : 10
    <dd460>   DW_AT_decl_line   : 359
    <dd462>   DW_AT_decl_column : 3
    <dd463>   DW_AT_type        : <0xdd3c9>
 <1><dd467>: Abbrev Number: 32 (DW_TAG_variable)
    <dd468>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <dd46c>   DW_AT_decl_file   : 10
    <dd46d>   DW_AT_decl_line   : 361
    <dd46f>   DW_AT_decl_column : 21
    <dd470>   DW_AT_type        : <0xdd45a>
    <dd474>   DW_AT_external    : 1
    <dd474>   DW_AT_declaration : 1
 <1><dd474>: Abbrev Number: 33 (DW_TAG_subprogram)
    <dd475>   DW_AT_external    : 1
    <dd475>   DW_AT_name        : (indirect string, offset: 0x1c05c): fb_hStrAllocTmpDesc
    <dd479>   DW_AT_decl_file   : 6
    <dd47a>   DW_AT_decl_line   : 105
    <dd47b>   DW_AT_decl_column : 21
    <dd47c>   DW_AT_prototyped  : 1
    <dd47c>   DW_AT_type        : <0xdcd4c>
    <dd480>   DW_AT_declaration : 1
 <1><dd480>: Abbrev Number: 34 (DW_TAG_subprogram)
    <dd481>   DW_AT_external    : 1
    <dd481>   DW_AT_name        : (indirect string, offset: 0xa1ca): fb_StrAllocTempResult
    <dd485>   DW_AT_decl_file   : 1
    <dd486>   DW_AT_decl_line   : 6
    <dd487>   DW_AT_decl_column : 18
    <dd488>   DW_AT_prototyped  : 1
    <dd488>   DW_AT_type        : <0xdcd4c>
    <dd48c>   DW_AT_low_pc      : 0x477630
    <dd494>   DW_AT_high_pc     : 0x49
    <dd49c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd49e>   DW_AT_call_all_calls: 1
 <2><dd49e>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <dd49f>   DW_AT_name        : src
    <dd4a3>   DW_AT_decl_file   : 1
    <dd4a4>   DW_AT_decl_line   : 6
    <dd4a5>   DW_AT_decl_column : 52
    <dd4a6>   DW_AT_type        : <0xdcd4c>
    <dd4aa>   DW_AT_location    : 0x405cd (location list)
    <dd4ae>   DW_AT_GNU_locviews: 0x405c3
 <2><dd4b2>: Abbrev Number: 36 (DW_TAG_variable)
    <dd4b3>   DW_AT_name        : dsc
    <dd4b7>   DW_AT_decl_file   : 1
    <dd4b8>   DW_AT_decl_line   : 8
    <dd4b9>   DW_AT_decl_column : 13
    <dd4ba>   DW_AT_type        : <0xdcd4c>
    <dd4be>   DW_AT_location    : 0x405ef (location list)
    <dd4c2>   DW_AT_GNU_locviews: 0x405ed
 <2><dd4c6>: Abbrev Number: 37 (DW_TAG_call_site)
    <dd4c7>   DW_AT_call_return_pc: 0x477639
    <dd4cf>   DW_AT_call_origin : <0xdd474>
 <2><dd4d3>: Abbrev Number: 0
 <1><dd4d4>: Abbrev Number: 0
  Compilation Unit @ offset 0xdd4d5:
   Length:        0xa5d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x154c4
   Pointer Size:  8
 <0><dd4e1>: Abbrev Number: 25 (DW_TAG_compile_unit)
    <dd4e2>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <dd4e6>   DW_AT_language    : 29	(C11)
    <dd4e7>   DW_AT_name        : (indirect line string, offset: 0x14d6): src/rtlib/strw_convassign.c
    <dd4eb>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <dd4ef>   DW_AT_low_pc      : 0x477680
    <dd4f7>   DW_AT_high_pc     : 0x577
    <dd4ff>   DW_AT_stmt_list   : 0x6c8ba
 <1><dd503>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd504>   DW_AT_byte_size   : 1
    <dd505>   DW_AT_encoding    : 8	(unsigned char)
    <dd506>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><dd50a>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd50b>   DW_AT_byte_size   : 2
    <dd50c>   DW_AT_encoding    : 7	(unsigned)
    <dd50d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><dd511>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd512>   DW_AT_byte_size   : 4
    <dd513>   DW_AT_encoding    : 7	(unsigned)
    <dd514>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><dd518>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd519>   DW_AT_byte_size   : 8
    <dd51a>   DW_AT_encoding    : 7	(unsigned)
    <dd51b>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><dd51f>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd520>   DW_AT_byte_size   : 1
    <dd521>   DW_AT_encoding    : 6	(signed char)
    <dd522>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><dd526>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd527>   DW_AT_byte_size   : 2
    <dd528>   DW_AT_encoding    : 5	(signed)
    <dd529>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><dd52d>: Abbrev Number: 26 (DW_TAG_base_type)
    <dd52e>   DW_AT_byte_size   : 4
    <dd52f>   DW_AT_encoding    : 5	(signed)
    <dd530>   DW_AT_name        : int
 <1><dd534>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd535>   DW_AT_byte_size   : 8
    <dd536>   DW_AT_encoding    : 5	(signed)
    <dd537>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><dd53b>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <dd53c>   DW_AT_byte_size   : 8
 <1><dd53d>: Abbrev Number: 13 (DW_TAG_typedef)
    <dd53e>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <dd542>   DW_AT_decl_file   : 4
    <dd543>   DW_AT_decl_line   : 194
    <dd544>   DW_AT_decl_column : 27
    <dd545>   DW_AT_type        : <0xdd534>
 <1><dd549>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <dd54a>   DW_AT_byte_size   : 8
    <dd54a>   DW_AT_type        : <0xdd54e>
 <1><dd54e>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd54f>   DW_AT_byte_size   : 1
    <dd550>   DW_AT_encoding    : 6	(signed char)
    <dd551>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><dd555>: Abbrev Number: 19 (DW_TAG_const_type)
    <dd556>   DW_AT_type        : <0xdd54e>
 <1><dd55a>: Abbrev Number: 13 (DW_TAG_typedef)
    <dd55b>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <dd55f>   DW_AT_decl_file   : 5
    <dd560>   DW_AT_decl_line   : 209
    <dd561>   DW_AT_decl_column : 23
    <dd562>   DW_AT_type        : <0xdd518>
 <1><dd566>: Abbrev Number: 28 (DW_TAG_typedef)
    <dd567>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <dd56b>   DW_AT_decl_file   : 5
    <dd56c>   DW_AT_decl_line   : 321
    <dd56e>   DW_AT_decl_column : 24
    <dd56f>   DW_AT_type        : <0xdd52d>
 <1><dd573>: Abbrev Number: 19 (DW_TAG_const_type)
    <dd574>   DW_AT_type        : <0xdd566>
 <1><dd578>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd579>   DW_AT_byte_size   : 8
    <dd57a>   DW_AT_encoding    : 5	(signed)
    <dd57b>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><dd57f>: Abbrev Number: 13 (DW_TAG_typedef)
    <dd580>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <dd584>   DW_AT_decl_file   : 6
    <dd585>   DW_AT_decl_line   : 108
    <dd586>   DW_AT_decl_column : 19
    <dd587>   DW_AT_type        : <0xdd53d>
 <1><dd58b>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd58c>   DW_AT_byte_size   : 8
    <dd58d>   DW_AT_encoding    : 7	(unsigned)
    <dd58e>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><dd592>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <dd593>   DW_AT_byte_size   : 8
    <dd593>   DW_AT_type        : <0xdd555>
 <1><dd597>: Abbrev Number: 29 (DW_TAG_structure_type)
    <dd598>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <dd59c>   DW_AT_byte_size   : 24
    <dd59d>   DW_AT_decl_file   : 3
    <dd59e>   DW_AT_decl_line   : 82
    <dd59f>   DW_AT_decl_column : 16
    <dd5a0>   DW_AT_sibling     : <0xdd5c8>
 <2><dd5a4>: Abbrev Number: 20 (DW_TAG_member)
    <dd5a5>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <dd5a9>   DW_AT_decl_file   : 3
    <dd5a9>   DW_AT_decl_line   : 83
    <dd5aa>   DW_AT_decl_column : 21
    <dd5aa>   DW_AT_type        : <0xdd549>
    <dd5ae>   DW_AT_data_member_location: 0
 <2><dd5af>: Abbrev Number: 30 (DW_TAG_member)
    <dd5b0>   DW_AT_name        : len
    <dd5b4>   DW_AT_decl_file   : 3
    <dd5b5>   DW_AT_decl_line   : 84
    <dd5b6>   DW_AT_decl_column : 21
    <dd5b7>   DW_AT_type        : <0xdd57f>
    <dd5bb>   DW_AT_data_member_location: 8
 <2><dd5bc>: Abbrev Number: 20 (DW_TAG_member)
    <dd5bd>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <dd5c1>   DW_AT_decl_file   : 3
    <dd5c1>   DW_AT_decl_line   : 85
    <dd5c2>   DW_AT_decl_column : 21
    <dd5c2>   DW_AT_type        : <0xdd57f>
    <dd5c6>   DW_AT_data_member_location: 16
 <2><dd5c7>: Abbrev Number: 0
 <1><dd5c8>: Abbrev Number: 13 (DW_TAG_typedef)
    <dd5c9>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <dd5cd>   DW_AT_decl_file   : 3
    <dd5ce>   DW_AT_decl_line   : 86
    <dd5cf>   DW_AT_decl_column : 3
    <dd5d0>   DW_AT_type        : <0xdd597>
 <1><dd5d4>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd5d5>   DW_AT_byte_size   : 8
    <dd5d6>   DW_AT_encoding    : 4	(float)
    <dd5d7>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><dd5db>: Abbrev Number: 6 (DW_TAG_base_type)
    <dd5dc>   DW_AT_byte_size   : 4
    <dd5dd>   DW_AT_encoding    : 4	(float)
    <dd5de>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><dd5e2>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <dd5e3>   DW_AT_byte_size   : 8
    <dd5e3>   DW_AT_type        : <0xdd566>
 <1><dd5e7>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <dd5e8>   DW_AT_byte_size   : 8
    <dd5e8>   DW_AT_type        : <0xdd573>
 <1><dd5ec>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <dd5ed>   DW_AT_byte_size   : 8
    <dd5ed>   DW_AT_type        : <0xdd5c8>
 <1><dd5f1>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd5f2>   DW_AT_external    : 1
    <dd5f2>   DW_AT_name        : (indirect string, offset: 0x1ab06): wcslen
    <dd5f6>   DW_AT_decl_file   : 7
    <dd5f7>   DW_AT_decl_line   : 222
    <dd5f8>   DW_AT_decl_column : 15
    <dd5f9>   DW_AT_prototyped  : 1
    <dd5f9>   DW_AT_type        : <0xdd55a>
    <dd5fd>   DW_AT_declaration : 1
    <dd5fd>   DW_AT_sibling     : <0xdd607>
 <2><dd601>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd602>   DW_AT_type        : <0xdd5e7>
 <2><dd606>: Abbrev Number: 0
 <1><dd607>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd608>   DW_AT_external    : 1
    <dd608>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <dd60c>   DW_AT_decl_file   : 8
    <dd60d>   DW_AT_decl_line   : 61
    <dd60e>   DW_AT_decl_column : 14
    <dd60f>   DW_AT_prototyped  : 1
    <dd60f>   DW_AT_type        : <0xdd53b>
    <dd613>   DW_AT_declaration : 1
    <dd613>   DW_AT_sibling     : <0xdd627>
 <2><dd617>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd618>   DW_AT_type        : <0xdd53b>
 <2><dd61c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd61d>   DW_AT_type        : <0xdd52d>
 <2><dd621>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd622>   DW_AT_type        : <0xdd55a>
 <2><dd626>: Abbrev Number: 0
 <1><dd627>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd628>   DW_AT_external    : 1
    <dd628>   DW_AT_name        : (indirect string, offset: 0x1ab0d): fb_wstr_ConvToA
    <dd62c>   DW_AT_decl_file   : 2
    <dd62d>   DW_AT_decl_line   : 151
    <dd62e>   DW_AT_decl_column : 9
    <dd62f>   DW_AT_prototyped  : 1
    <dd62f>   DW_AT_type        : <0xdd57f>
    <dd633>   DW_AT_declaration : 1
    <dd633>   DW_AT_sibling     : <0xdd647>
 <2><dd637>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd638>   DW_AT_type        : <0xdd549>
 <2><dd63c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd63d>   DW_AT_type        : <0xdd57f>
 <2><dd641>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd642>   DW_AT_type        : <0xdd5e7>
 <2><dd646>: Abbrev Number: 0
 <1><dd647>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd648>   DW_AT_external    : 1
    <dd648>   DW_AT_name        : (indirect string, offset: 0x1be3d): fb_hStrAlloc
    <dd64c>   DW_AT_decl_file   : 3
    <dd64d>   DW_AT_decl_line   : 107
    <dd64e>   DW_AT_decl_column : 21
    <dd64f>   DW_AT_prototyped  : 1
    <dd64f>   DW_AT_type        : <0xdd5ec>
    <dd653>   DW_AT_declaration : 1
    <dd653>   DW_AT_sibling     : <0xdd662>
 <2><dd657>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd658>   DW_AT_type        : <0xdd5ec>
 <2><dd65c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd65d>   DW_AT_type        : <0xdd57f>
 <2><dd661>: Abbrev Number: 0
 <1><dd662>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd663>   DW_AT_external    : 1
    <dd663>   DW_AT_name        : (indirect string, offset: 0x1842e): fb_hStrRealloc
    <dd667>   DW_AT_decl_file   : 3
    <dd668>   DW_AT_decl_line   : 108
    <dd669>   DW_AT_decl_column : 21
    <dd66a>   DW_AT_prototyped  : 1
    <dd66a>   DW_AT_type        : <0xdd5ec>
    <dd66e>   DW_AT_declaration : 1
    <dd66e>   DW_AT_sibling     : <0xdd682>
 <2><dd672>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd673>   DW_AT_type        : <0xdd5ec>
 <2><dd677>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd678>   DW_AT_type        : <0xdd57f>
 <2><dd67c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd67d>   DW_AT_type        : <0xdd52d>
 <2><dd681>: Abbrev Number: 0
 <1><dd682>: Abbrev Number: 31 (DW_TAG_subprogram)
    <dd683>   DW_AT_external    : 1
    <dd683>   DW_AT_name        : (indirect string, offset: 0x129ce): fb_StrDelete
    <dd687>   DW_AT_decl_file   : 3
    <dd688>   DW_AT_decl_line   : 123
    <dd689>   DW_AT_decl_column : 21
    <dd68a>   DW_AT_prototyped  : 1
    <dd68a>   DW_AT_declaration : 1
    <dd68a>   DW_AT_sibling     : <0xdd694>
 <2><dd68e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd68f>   DW_AT_type        : <0xdd5ec>
 <2><dd693>: Abbrev Number: 0
 <1><dd694>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd695>   DW_AT_external    : 1
    <dd695>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <dd699>   DW_AT_decl_file   : 3
    <dd69a>   DW_AT_decl_line   : 111
    <dd69b>   DW_AT_decl_column : 21
    <dd69c>   DW_AT_prototyped  : 1
    <dd69c>   DW_AT_type        : <0xdd52d>
    <dd6a0>   DW_AT_declaration : 1
    <dd6a0>   DW_AT_sibling     : <0xdd6aa>
 <2><dd6a4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd6a5>   DW_AT_type        : <0xdd5ec>
 <2><dd6a9>: Abbrev Number: 0
 <1><dd6aa>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dd6ab>   DW_AT_external    : 1
    <dd6ab>   DW_AT_name        : (indirect string, offset: 0x1c270): fb_wstr_ConvFromA
    <dd6af>   DW_AT_decl_file   : 2
    <dd6b0>   DW_AT_decl_line   : 150
    <dd6b1>   DW_AT_decl_column : 9
    <dd6b2>   DW_AT_prototyped  : 1
    <dd6b2>   DW_AT_type        : <0xdd57f>
    <dd6b6>   DW_AT_declaration : 1
    <dd6b6>   DW_AT_sibling     : <0xdd6ca>
 <2><dd6ba>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd6bb>   DW_AT_type        : <0xdd5e2>
 <2><dd6bf>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd6c0>   DW_AT_type        : <0xdd57f>
 <2><dd6c4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd6c5>   DW_AT_type        : <0xdd592>
 <2><dd6c9>: Abbrev Number: 0
 <1><dd6ca>: Abbrev Number: 32 (DW_TAG_subprogram)
    <dd6cb>   DW_AT_external    : 1
    <dd6cb>   DW_AT_name        : (indirect string, offset: 0x17063): strlen
    <dd6cf>   DW_AT_decl_file   : 8
    <dd6d0>   DW_AT_decl_line   : 391
    <dd6d2>   DW_AT_decl_column : 15
    <dd6d3>   DW_AT_prototyped  : 1
    <dd6d3>   DW_AT_type        : <0xdd55a>
    <dd6d7>   DW_AT_declaration : 1
    <dd6d7>   DW_AT_sibling     : <0xdd6e1>
 <2><dd6db>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dd6dc>   DW_AT_type        : <0xdd592>
 <2><dd6e0>: Abbrev Number: 0
 <1><dd6e1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <dd6e2>   DW_AT_external    : 1
    <dd6e2>   DW_AT_name        : (indirect string, offset: 0x1c24d): fb_WstrAssignToA_Init
    <dd6e6>   DW_AT_decl_file   : 1
    <dd6e6>   DW_AT_decl_line   : 142
    <dd6e7>   DW_AT_decl_column : 14
    <dd6e8>   DW_AT_prototyped  : 1
    <dd6e8>   DW_AT_type        : <0xdd53b>
    <dd6ec>   DW_AT_low_pc      : 0x477a80
    <dd6f4>   DW_AT_high_pc     : 0x177
    <dd6fc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd6fe>   DW_AT_call_all_calls: 1
    <dd6fe>   DW_AT_sibling     : <0xdd92a>
 <2><dd702>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dd703>   DW_AT_name        : dst
    <dd707>   DW_AT_decl_file   : 1
    <dd707>   DW_AT_decl_line   : 144
    <dd708>   DW_AT_decl_column : 9
    <dd709>   DW_AT_type        : <0xdd53b>
    <dd70d>   DW_AT_location    : 0x4061b (location list)
    <dd711>   DW_AT_GNU_locviews: 0x40601
 <2><dd715>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd716>   DW_AT_name        : (indirect string, offset: 0x1c239): dst_chars
    <dd71a>   DW_AT_decl_file   : 1
    <dd71a>   DW_AT_decl_line   : 145
    <dd71b>   DW_AT_decl_column : 11
    <dd71c>   DW_AT_type        : <0xdd57f>
    <dd720>   DW_AT_location    : 0x40691 (location list)
    <dd724>   DW_AT_GNU_locviews: 0x40677
 <2><dd728>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dd729>   DW_AT_name        : src
    <dd72d>   DW_AT_decl_file   : 1
    <dd72d>   DW_AT_decl_line   : 146
    <dd72e>   DW_AT_decl_column : 13
    <dd72f>   DW_AT_type        : <0xdd5e2>
    <dd733>   DW_AT_location    : 0x40718 (location list)
    <dd737>   DW_AT_GNU_locviews: 0x406fe
 <2><dd73b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd73c>   DW_AT_name        : (indirect string, offset: 0x1be84): fill_rem
    <dd740>   DW_AT_decl_file   : 1
    <dd740>   DW_AT_decl_line   : 147
    <dd741>   DW_AT_decl_column : 7
    <dd742>   DW_AT_type        : <0xdd52d>
    <dd746>   DW_AT_location    : 0x4079d (location list)
    <dd74a>   DW_AT_GNU_locviews: 0x40783
 <2><dd74e>: Abbrev Number: 21 (DW_TAG_inlined_subroutine)
    <dd74f>   DW_AT_abstract_origin: <0xddb90>
    <dd753>   DW_AT_entry_pc    : 0x477a89
    <dd75b>   DW_AT_GNU_entry_view: 1
    <dd75c>   DW_AT_ranges      : 0x1861d
    <dd760>   DW_AT_call_file   : 1
    <dd760>   DW_AT_call_line   : 150
    <dd761>   DW_AT_call_column : 9
 <3><dd761>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd762>   DW_AT_abstract_origin: <0xddbd1>
    <dd766>   DW_AT_location    : 0x40814 (location list)
    <dd76a>   DW_AT_GNU_locviews: 0x40808
 <3><dd76e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd76f>   DW_AT_abstract_origin: <0xddbc5>
    <dd773>   DW_AT_location    : 0x4085b (location list)
    <dd777>   DW_AT_GNU_locviews: 0x4084b
 <3><dd77b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd77c>   DW_AT_abstract_origin: <0xddbb9>
    <dd780>   DW_AT_location    : 0x408a4 (location list)
    <dd784>   DW_AT_GNU_locviews: 0x40894
 <3><dd788>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd789>   DW_AT_abstract_origin: <0xddbad>
    <dd78d>   DW_AT_location    : 0x408ef (location list)
    <dd791>   DW_AT_GNU_locviews: 0x408dd
 <3><dd795>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd796>   DW_AT_abstract_origin: <0xddba1>
    <dd79a>   DW_AT_location    : 0x40943 (location list)
    <dd79e>   DW_AT_GNU_locviews: 0x40933
 <3><dd7a2>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <dd7a3>   DW_AT_ranges      : 0x1861d
 <4><dd7a7>: Abbrev Number: 7 (DW_TAG_variable)
    <dd7a8>   DW_AT_abstract_origin: <0xddbdd>
    <dd7ac>   DW_AT_location    : 0x40984 (location list)
    <dd7b0>   DW_AT_GNU_locviews: 0x4097c
 <4><dd7b4>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <dd7b5>   DW_AT_abstract_origin: <0xddd97>
    <dd7b9>   DW_AT_entry_pc    : 0x477aa0
    <dd7c1>   DW_AT_GNU_entry_view: 1
    <dd7c2>   DW_AT_low_pc      : 0x477aa0
    <dd7ca>   DW_AT_high_pc     : 0x8
    <dd7d2>   DW_AT_call_file   : 1
    <dd7d2>   DW_AT_call_line   : 63
    <dd7d3>   DW_AT_call_column : 15
    <dd7d4>   DW_AT_sibling     : <0xdd7fa>
 <5><dd7d8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd7d9>   DW_AT_abstract_origin: <0xddda8>
    <dd7dd>   DW_AT_location    : 0x409a6 (location list)
    <dd7e1>   DW_AT_GNU_locviews: 0x409a2
 <5><dd7e5>: Abbrev Number: 5 (DW_TAG_call_site)
    <dd7e6>   DW_AT_call_return_pc: 0x477aa8
    <dd7ee>   DW_AT_call_origin : <0xdd5f1>
 <6><dd7f2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd7f3>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dd7f5>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><dd7f8>: Abbrev Number: 0
 <5><dd7f9>: Abbrev Number: 0
 <4><dd7fa>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <dd7fb>   DW_AT_abstract_origin: <0xddc54>
    <dd7ff>   DW_AT_ranges      : 0x18646
    <dd803>   DW_AT_sibling     : <0xdd84c>
 <5><dd807>: Abbrev Number: 7 (DW_TAG_variable)
    <dd808>   DW_AT_abstract_origin: <0xddc55>
    <dd80c>   DW_AT_location    : 0x409b9 (location list)
    <dd810>   DW_AT_GNU_locviews: 0x409b5
 <5><dd814>: Abbrev Number: 4 (DW_TAG_call_site)
    <dd815>   DW_AT_call_return_pc: 0x477ace
    <dd81d>   DW_AT_call_origin : <0xdd627>
    <dd821>   DW_AT_sibling     : <0xdd838>
 <6><dd825>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd826>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dd828>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><dd82b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd82c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dd82e>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><dd831>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd832>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <dd834>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><dd837>: Abbrev Number: 0
 <5><dd838>: Abbrev Number: 5 (DW_TAG_call_site)
    <dd839>   DW_AT_call_return_pc: 0x477bf2
    <dd841>   DW_AT_call_origin : <0xddf2a>
 <6><dd845>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd846>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dd848>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <6><dd84a>: Abbrev Number: 0
 <5><dd84b>: Abbrev Number: 0
 <4><dd84c>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <dd84d>   DW_AT_abstract_origin: <0xddbe8>
    <dd851>   DW_AT_low_pc      : 0x477b29
    <dd859>   DW_AT_high_pc     : 0x3c
    <dd861>   DW_AT_sibling     : <0xdd8ea>
 <5><dd865>: Abbrev Number: 7 (DW_TAG_variable)
    <dd866>   DW_AT_abstract_origin: <0xddbed>
    <dd86a>   DW_AT_location    : 0x409cc (location list)
    <dd86e>   DW_AT_GNU_locviews: 0x409c8
 <5><dd872>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <dd873>   DW_AT_abstract_origin: <0xddd71>
    <dd877>   DW_AT_entry_pc    : 0x477b4e
    <dd87f>   DW_AT_GNU_entry_view: 1
    <dd880>   DW_AT_low_pc      : 0x477b4e
    <dd888>   DW_AT_high_pc     : 0x17
    <dd890>   DW_AT_call_file   : 1
    <dd890>   DW_AT_call_line   : 99
    <dd891>   DW_AT_call_column : 4
    <dd892>   DW_AT_sibling     : <0xdd8b1>
 <6><dd896>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd897>   DW_AT_abstract_origin: <0xddd8a>
    <dd89b>   DW_AT_location    : 0x409df (location list)
    <dd89f>   DW_AT_GNU_locviews: 0x409db
 <6><dd8a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd8a4>   DW_AT_abstract_origin: <0xddd7e>
    <dd8a8>   DW_AT_location    : 0x409f0 (location list)
    <dd8ac>   DW_AT_GNU_locviews: 0x409ee
 <6><dd8b0>: Abbrev Number: 0
 <5><dd8b1>: Abbrev Number: 4 (DW_TAG_call_site)
    <dd8b2>   DW_AT_call_return_pc: 0x477b3c
    <dd8ba>   DW_AT_call_origin : <0xdd647>
    <dd8be>   DW_AT_sibling     : <0xdd8cf>
 <6><dd8c2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd8c3>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dd8c5>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><dd8c8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd8c9>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dd8cb>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><dd8ce>: Abbrev Number: 0
 <5><dd8cf>: Abbrev Number: 5 (DW_TAG_call_site)
    <dd8d0>   DW_AT_call_return_pc: 0x477b4b
    <dd8d8>   DW_AT_call_origin : <0xdd627>
 <6><dd8dc>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd8dd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dd8df>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><dd8e2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd8e3>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <dd8e5>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><dd8e8>: Abbrev Number: 0
 <5><dd8e9>: Abbrev Number: 0
 <4><dd8ea>: Abbrev Number: 4 (DW_TAG_call_site)
    <dd8eb>   DW_AT_call_return_pc: 0x477b18
    <dd8f3>   DW_AT_call_origin : <0xddf2a>
    <dd8f7>   DW_AT_sibling     : <0xdd90d>
 <5><dd8fb>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd8fc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dd8fe>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><dd901>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd902>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dd904>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><dd906>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd907>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <dd909>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><dd90c>: Abbrev Number: 0
 <4><dd90d>: Abbrev Number: 5 (DW_TAG_call_site)
    <dd90e>   DW_AT_call_return_pc: 0x477b8b
    <dd916>   DW_AT_call_origin : <0xdd627>
 <5><dd91a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd91b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dd91d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><dd920>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dd921>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <dd923>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><dd926>: Abbrev Number: 0
 <4><dd927>: Abbrev Number: 0
 <3><dd928>: Abbrev Number: 0
 <2><dd929>: Abbrev Number: 0
 <1><dd92a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <dd92b>   DW_AT_external    : 1
    <dd92b>   DW_AT_name        : (indirect string, offset: 0x1b12a): fb_WstrAssignToA
    <dd92f>   DW_AT_decl_file   : 1
    <dd92f>   DW_AT_decl_line   : 131
    <dd930>   DW_AT_decl_column : 14
    <dd931>   DW_AT_prototyped  : 1
    <dd931>   DW_AT_type        : <0xdd53b>
    <dd935>   DW_AT_low_pc      : 0x4778f0
    <dd93d>   DW_AT_high_pc     : 0x187
    <dd945>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd947>   DW_AT_call_all_calls: 1
    <dd947>   DW_AT_sibling     : <0xddb90>
 <2><dd94b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dd94c>   DW_AT_name        : dst
    <dd950>   DW_AT_decl_file   : 1
    <dd950>   DW_AT_decl_line   : 133
    <dd951>   DW_AT_decl_column : 9
    <dd952>   DW_AT_type        : <0xdd53b>
    <dd956>   DW_AT_location    : 0x40a12 (location list)
    <dd95a>   DW_AT_GNU_locviews: 0x409f8
 <2><dd95e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd95f>   DW_AT_name        : (indirect string, offset: 0x1c239): dst_chars
    <dd963>   DW_AT_decl_file   : 1
    <dd963>   DW_AT_decl_line   : 134
    <dd964>   DW_AT_decl_column : 11
    <dd965>   DW_AT_type        : <0xdd57f>
    <dd969>   DW_AT_location    : 0x40a88 (location list)
    <dd96d>   DW_AT_GNU_locviews: 0x40a6e
 <2><dd971>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dd972>   DW_AT_name        : src
    <dd976>   DW_AT_decl_file   : 1
    <dd976>   DW_AT_decl_line   : 135
    <dd977>   DW_AT_decl_column : 13
    <dd978>   DW_AT_type        : <0xdd5e2>
    <dd97c>   DW_AT_location    : 0x40b0f (location list)
    <dd980>   DW_AT_GNU_locviews: 0x40af5
 <2><dd984>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd985>   DW_AT_name        : (indirect string, offset: 0x1be84): fill_rem
    <dd989>   DW_AT_decl_file   : 1
    <dd989>   DW_AT_decl_line   : 136
    <dd98a>   DW_AT_decl_column : 7
    <dd98b>   DW_AT_type        : <0xdd52d>
    <dd98f>   DW_AT_location    : 0x40b94 (location list)
    <dd993>   DW_AT_GNU_locviews: 0x40b7a
 <2><dd997>: Abbrev Number: 21 (DW_TAG_inlined_subroutine)
    <dd998>   DW_AT_abstract_origin: <0xddb90>
    <dd99c>   DW_AT_entry_pc    : 0x4778f9
    <dd9a4>   DW_AT_GNU_entry_view: 1
    <dd9a5>   DW_AT_ranges      : 0x185ee
    <dd9a9>   DW_AT_call_file   : 1
    <dd9a9>   DW_AT_call_line   : 139
    <dd9aa>   DW_AT_call_column : 9
 <3><dd9aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd9ab>   DW_AT_abstract_origin: <0xddbd1>
    <dd9af>   DW_AT_location    : 0x40c0b (location list)
    <dd9b3>   DW_AT_GNU_locviews: 0x40bff
 <3><dd9b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd9b8>   DW_AT_abstract_origin: <0xddbc5>
    <dd9bc>   DW_AT_location    : 0x40c4c (location list)
    <dd9c0>   DW_AT_GNU_locviews: 0x40c3c
 <3><dd9c4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd9c5>   DW_AT_abstract_origin: <0xddbb9>
    <dd9c9>   DW_AT_location    : 0x40c95 (location list)
    <dd9cd>   DW_AT_GNU_locviews: 0x40c85
 <3><dd9d1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd9d2>   DW_AT_abstract_origin: <0xddbad>
    <dd9d6>   DW_AT_location    : 0x40ce0 (location list)
    <dd9da>   DW_AT_GNU_locviews: 0x40cce
 <3><dd9de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd9df>   DW_AT_abstract_origin: <0xddba1>
    <dd9e3>   DW_AT_location    : 0x40d34 (location list)
    <dd9e7>   DW_AT_GNU_locviews: 0x40d24
 <3><dd9eb>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <dd9ec>   DW_AT_ranges      : 0x185ee
 <4><dd9f0>: Abbrev Number: 7 (DW_TAG_variable)
    <dd9f1>   DW_AT_abstract_origin: <0xddbdd>
    <dd9f5>   DW_AT_location    : 0x40d75 (location list)
    <dd9f9>   DW_AT_GNU_locviews: 0x40d6d
 <4><dd9fd>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <dd9fe>   DW_AT_abstract_origin: <0xddd97>
    <dda02>   DW_AT_entry_pc    : 0x477910
    <dda0a>   DW_AT_GNU_entry_view: 1
    <dda0b>   DW_AT_low_pc      : 0x477910
    <dda13>   DW_AT_high_pc     : 0x8
    <dda1b>   DW_AT_call_file   : 1
    <dda1b>   DW_AT_call_line   : 63
    <dda1c>   DW_AT_call_column : 15
    <dda1d>   DW_AT_sibling     : <0xdda43>
 <5><dda21>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dda22>   DW_AT_abstract_origin: <0xddda8>
    <dda26>   DW_AT_location    : 0x40d97 (location list)
    <dda2a>   DW_AT_GNU_locviews: 0x40d93
 <5><dda2e>: Abbrev Number: 5 (DW_TAG_call_site)
    <dda2f>   DW_AT_call_return_pc: 0x477918
    <dda37>   DW_AT_call_origin : <0xdd5f1>
 <6><dda3b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dda3c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dda3e>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><dda41>: Abbrev Number: 0
 <5><dda42>: Abbrev Number: 0
 <4><dda43>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <dda44>   DW_AT_abstract_origin: <0xddc54>
    <dda48>   DW_AT_ranges      : 0x18612
    <dda4c>   DW_AT_sibling     : <0xdda95>
 <5><dda50>: Abbrev Number: 7 (DW_TAG_variable)
    <dda51>   DW_AT_abstract_origin: <0xddc55>
    <dda55>   DW_AT_location    : 0x40daa (location list)
    <dda59>   DW_AT_GNU_locviews: 0x40da6
 <5><dda5d>: Abbrev Number: 4 (DW_TAG_call_site)
    <dda5e>   DW_AT_call_return_pc: 0x47793e
    <dda66>   DW_AT_call_origin : <0xdd627>
    <dda6a>   DW_AT_sibling     : <0xdda81>
 <6><dda6e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dda6f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dda71>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><dda74>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dda75>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dda77>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><dda7a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dda7b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <dda7d>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><dda80>: Abbrev Number: 0
 <5><dda81>: Abbrev Number: 5 (DW_TAG_call_site)
    <dda82>   DW_AT_call_return_pc: 0x477a72
    <dda8a>   DW_AT_call_origin : <0xddf2a>
 <6><dda8e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dda8f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dda91>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <6><dda93>: Abbrev Number: 0
 <5><dda94>: Abbrev Number: 0
 <4><dda95>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <dda96>   DW_AT_abstract_origin: <0xddbe8>
    <dda9a>   DW_AT_low_pc      : 0x477999
    <ddaa2>   DW_AT_high_pc     : 0x52
    <ddaaa>   DW_AT_sibling     : <0xddb38>
 <5><ddaae>: Abbrev Number: 7 (DW_TAG_variable)
    <ddaaf>   DW_AT_abstract_origin: <0xddbed>
    <ddab3>   DW_AT_location    : 0x40dbd (location list)
    <ddab7>   DW_AT_GNU_locviews: 0x40db9
 <5><ddabb>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <ddabc>   DW_AT_abstract_origin: <0xddd71>
    <ddac0>   DW_AT_entry_pc    : 0x4779d4
    <ddac8>   DW_AT_GNU_entry_view: 1
    <ddac9>   DW_AT_low_pc      : 0x4779d4
    <ddad1>   DW_AT_high_pc     : 0x17
    <ddad9>   DW_AT_call_file   : 1
    <ddad9>   DW_AT_call_line   : 99
    <ddada>   DW_AT_call_column : 4
    <ddadb>   DW_AT_sibling     : <0xddafa>
 <6><ddadf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ddae0>   DW_AT_abstract_origin: <0xddd8a>
    <ddae4>   DW_AT_location    : 0x40dd0 (location list)
    <ddae8>   DW_AT_GNU_locviews: 0x40dcc
 <6><ddaec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ddaed>   DW_AT_abstract_origin: <0xddd7e>
    <ddaf1>   DW_AT_location    : 0x40de1 (location list)
    <ddaf5>   DW_AT_GNU_locviews: 0x40ddf
 <6><ddaf9>: Abbrev Number: 0
 <5><ddafa>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddafb>   DW_AT_call_return_pc: 0x4779c2
    <ddb03>   DW_AT_call_origin : <0xdd662>
    <ddb07>   DW_AT_sibling     : <0xddb1d>
 <6><ddb0b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb0c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddb0e>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><ddb11>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb12>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddb14>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><ddb17>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb18>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddb1a>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <6><ddb1c>: Abbrev Number: 0
 <5><ddb1d>: Abbrev Number: 5 (DW_TAG_call_site)
    <ddb1e>   DW_AT_call_return_pc: 0x4779d1
    <ddb26>   DW_AT_call_origin : <0xdd627>
 <6><ddb2a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb2b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddb2d>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <6><ddb30>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb31>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddb33>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <6><ddb36>: Abbrev Number: 0
 <5><ddb37>: Abbrev Number: 0
 <4><ddb38>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddb39>   DW_AT_call_return_pc: 0x477988
    <ddb41>   DW_AT_call_origin : <0xddf2a>
    <ddb45>   DW_AT_sibling     : <0xddb5b>
 <5><ddb49>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb4a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddb4c>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><ddb4f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb50>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddb52>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><ddb54>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb55>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddb57>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><ddb5a>: Abbrev Number: 0
 <4><ddb5b>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddb5c>   DW_AT_call_return_pc: 0x477a13
    <ddb64>   DW_AT_call_origin : <0xdd627>
    <ddb68>   DW_AT_sibling     : <0xddb79>
 <5><ddb6c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb6d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddb6f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><ddb72>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb73>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddb75>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><ddb78>: Abbrev Number: 0
 <4><ddb79>: Abbrev Number: 5 (DW_TAG_call_site)
    <ddb7a>   DW_AT_call_return_pc: 0x477a48
    <ddb82>   DW_AT_call_origin : <0xdd682>
 <5><ddb86>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddb87>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddb89>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><ddb8c>: Abbrev Number: 0
 <4><ddb8d>: Abbrev Number: 0
 <3><ddb8e>: Abbrev Number: 0
 <2><ddb8f>: Abbrev Number: 0
 <1><ddb90>: Abbrev Number: 33 (DW_TAG_subprogram)
    <ddb91>   DW_AT_external    : 1
    <ddb91>   DW_AT_name        : (indirect string, offset: 0x1c226): fb_WstrAssignToAEx
    <ddb95>   DW_AT_decl_file   : 1
    <ddb96>   DW_AT_decl_line   : 48
    <ddb97>   DW_AT_decl_column : 14
    <ddb98>   DW_AT_prototyped  : 1
    <ddb98>   DW_AT_type        : <0xdd53b>
    <ddb9c>   DW_AT_inline      : 1	(inlined)
    <ddb9d>   DW_AT_sibling     : <0xddc99>
 <2><ddba1>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ddba2>   DW_AT_name        : dst
    <ddba6>   DW_AT_decl_file   : 1
    <ddba7>   DW_AT_decl_line   : 50
    <ddba8>   DW_AT_decl_column : 9
    <ddba9>   DW_AT_type        : <0xdd53b>
 <2><ddbad>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <ddbae>   DW_AT_name        : (indirect string, offset: 0x1c239): dst_chars
    <ddbb2>   DW_AT_decl_file   : 1
    <ddbb3>   DW_AT_decl_line   : 51
    <ddbb4>   DW_AT_decl_column : 11
    <ddbb5>   DW_AT_type        : <0xdd57f>
 <2><ddbb9>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ddbba>   DW_AT_name        : src
    <ddbbe>   DW_AT_decl_file   : 1
    <ddbbf>   DW_AT_decl_line   : 52
    <ddbc0>   DW_AT_decl_column : 13
    <ddbc1>   DW_AT_type        : <0xdd5e2>
 <2><ddbc5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <ddbc6>   DW_AT_name        : (indirect string, offset: 0x1be84): fill_rem
    <ddbca>   DW_AT_decl_file   : 1
    <ddbcb>   DW_AT_decl_line   : 53
    <ddbcc>   DW_AT_decl_column : 7
    <ddbcd>   DW_AT_type        : <0xdd52d>
 <2><ddbd1>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <ddbd2>   DW_AT_name        : (indirect string, offset: 0x1be52): is_init
    <ddbd6>   DW_AT_decl_file   : 1
    <ddbd7>   DW_AT_decl_line   : 54
    <ddbd8>   DW_AT_decl_column : 7
    <ddbd9>   DW_AT_type        : <0xdd52d>
 <2><ddbdd>: Abbrev Number: 18 (DW_TAG_variable)
    <ddbde>   DW_AT_name        : (indirect string, offset: 0x1c243): src_chars
    <ddbe2>   DW_AT_decl_file   : 1
    <ddbe2>   DW_AT_decl_line   : 57
    <ddbe3>   DW_AT_decl_column : 10
    <ddbe4>   DW_AT_type        : <0xdd57f>
 <2><ddbe8>: Abbrev Number: 34 (DW_TAG_lexical_block)
    <ddbe9>   DW_AT_sibling     : <0xddc54>
 <3><ddbed>: Abbrev Number: 18 (DW_TAG_variable)
    <ddbee>   DW_AT_name        : (indirect string, offset: 0x1c263): writtenchars
    <ddbf2>   DW_AT_decl_file   : 1
    <ddbf2>   DW_AT_decl_line   : 98
    <ddbf3>   DW_AT_decl_column : 12
    <ddbf4>   DW_AT_type        : <0xdd57f>
 <3><ddbf8>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddbf9>   DW_AT_call_return_pc: 0x477810
    <ddc01>   DW_AT_call_origin : <0xdd627>
    <ddc05>   DW_AT_sibling     : <0xddc16>
 <4><ddc09>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc0a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddc0c>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><ddc0f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc10>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddc12>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><ddc15>: Abbrev Number: 0
 <3><ddc16>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddc17>   DW_AT_call_return_pc: 0x4778a5
    <ddc1f>   DW_AT_call_origin : <0xdd662>
    <ddc23>   DW_AT_sibling     : <0xddc39>
 <4><ddc27>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc28>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddc2a>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ddc2d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc2e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddc30>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><ddc33>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc34>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddc36>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><ddc38>: Abbrev Number: 0
 <3><ddc39>: Abbrev Number: 5 (DW_TAG_call_site)
    <ddc3a>   DW_AT_call_return_pc: 0x4778db
    <ddc42>   DW_AT_call_origin : <0xdd647>
 <4><ddc46>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc47>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddc49>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ddc4c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc4d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddc4f>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><ddc52>: Abbrev Number: 0
 <3><ddc53>: Abbrev Number: 0
 <2><ddc54>: Abbrev Number: 35 (DW_TAG_lexical_block)
 <3><ddc55>: Abbrev Number: 18 (DW_TAG_variable)
    <ddc56>   DW_AT_name        : (indirect string, offset: 0x1c263): writtenchars
    <ddc5a>   DW_AT_decl_file   : 1
    <ddc5a>   DW_AT_decl_line   : 118
    <ddc5b>   DW_AT_decl_column : 12
    <ddc5c>   DW_AT_type        : <0xdd57f>
 <3><ddc60>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddc61>   DW_AT_call_return_pc: 0x47777e
    <ddc69>   DW_AT_call_origin : <0xdd627>
    <ddc6d>   DW_AT_sibling     : <0xddc84>
 <4><ddc71>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc72>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddc74>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><ddc77>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc78>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddc7a>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><ddc7d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc7e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ddc80>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><ddc83>: Abbrev Number: 0
 <3><ddc84>: Abbrev Number: 5 (DW_TAG_call_site)
    <ddc85>   DW_AT_call_return_pc: 0x4778c2
    <ddc8d>   DW_AT_call_origin : <0xddf2a>
 <4><ddc91>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddc92>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ddc94>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><ddc96>: Abbrev Number: 0
 <3><ddc97>: Abbrev Number: 0
 <2><ddc98>: Abbrev Number: 0
 <1><ddc99>: Abbrev Number: 17 (DW_TAG_subprogram)
    <ddc9a>   DW_AT_external    : 1
    <ddc9a>   DW_AT_name        : (indirect string, offset: 0x1a7f8): fb_WstrAssignFromA
    <ddc9e>   DW_AT_decl_file   : 1
    <ddc9e>   DW_AT_decl_line   : 5
    <ddc9f>   DW_AT_decl_column : 18
    <ddca0>   DW_AT_prototyped  : 1
    <ddca0>   DW_AT_type        : <0xdd5e2>
    <ddca4>   DW_AT_low_pc      : 0x477680
    <ddcac>   DW_AT_high_pc     : 0xa3
    <ddcb4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ddcb6>   DW_AT_call_all_calls: 1
    <ddcb6>   DW_AT_sibling     : <0xddd71>
 <2><ddcba>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ddcbb>   DW_AT_name        : dst
    <ddcbf>   DW_AT_decl_file   : 1
    <ddcbf>   DW_AT_decl_line   : 7
    <ddcc0>   DW_AT_decl_column : 13
    <ddcc1>   DW_AT_type        : <0xdd5e2>
    <ddcc5>   DW_AT_location    : 0x40df7 (location list)
    <ddcc9>   DW_AT_GNU_locviews: 0x40de9
 <2><ddccd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ddcce>   DW_AT_name        : (indirect string, offset: 0x1c239): dst_chars
    <ddcd2>   DW_AT_decl_file   : 1
    <ddcd2>   DW_AT_decl_line   : 8
    <ddcd3>   DW_AT_decl_column : 11
    <ddcd4>   DW_AT_type        : <0xdd57f>
    <ddcd8>   DW_AT_location    : 0x40e2e (location list)
    <ddcdc>   DW_AT_GNU_locviews: 0x40e20
 <2><ddce0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ddce1>   DW_AT_name        : src
    <ddce5>   DW_AT_decl_file   : 1
    <ddce5>   DW_AT_decl_line   : 9
    <ddce6>   DW_AT_decl_column : 9
    <ddce7>   DW_AT_type        : <0xdd53b>
    <ddceb>   DW_AT_location    : 0x40e66 (location list)
    <ddcef>   DW_AT_GNU_locviews: 0x40e56
 <2><ddcf3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ddcf4>   DW_AT_name        : (indirect string, offset: 0x1be34): src_size
    <ddcf8>   DW_AT_decl_file   : 1
    <ddcf8>   DW_AT_decl_line   : 10
    <ddcf9>   DW_AT_decl_column : 11
    <ddcfa>   DW_AT_type        : <0xdd57f>
    <ddcfe>   DW_AT_location    : 0x40eaa (location list)
    <ddd02>   DW_AT_GNU_locviews: 0x40e9c
 <2><ddd06>: Abbrev Number: 24 (DW_TAG_variable)
    <ddd07>   DW_AT_name        : (indirect string, offset: 0x1be4a): src_ptr
    <ddd0b>   DW_AT_decl_file   : 1
    <ddd0b>   DW_AT_decl_line   : 13
    <ddd0c>   DW_AT_decl_column : 8
    <ddd0d>   DW_AT_type        : <0xdd549>
    <ddd11>   DW_AT_location    : 0x40ee1 (location list)
    <ddd15>   DW_AT_GNU_locviews: 0x40ed9
 <2><ddd19>: Abbrev Number: 24 (DW_TAG_variable)
    <ddd1a>   DW_AT_name        : (indirect string, offset: 0x1c243): src_chars
    <ddd1e>   DW_AT_decl_file   : 1
    <ddd1e>   DW_AT_decl_line   : 14
    <ddd1f>   DW_AT_decl_column : 10
    <ddd20>   DW_AT_type        : <0xdd57f>
    <ddd24>   DW_AT_location    : 0x40efc (location list)
    <ddd28>   DW_AT_GNU_locviews: 0x40ef8
 <2><ddd2c>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddd2d>   DW_AT_call_return_pc: 0x4776ae
    <ddd35>   DW_AT_call_origin : <0xdd6ca>
    <ddd39>   DW_AT_sibling     : <0xddd44>
 <3><ddd3d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddd3e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddd40>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><ddd43>: Abbrev Number: 0
 <2><ddd44>: Abbrev Number: 4 (DW_TAG_call_site)
    <ddd45>   DW_AT_call_return_pc: 0x4776c7
    <ddd4d>   DW_AT_call_origin : <0xdd6aa>
    <ddd51>   DW_AT_sibling     : <0xddd5c>
 <3><ddd55>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddd56>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddd58>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><ddd5b>: Abbrev Number: 0
 <2><ddd5c>: Abbrev Number: 5 (DW_TAG_call_site)
    <ddd5d>   DW_AT_call_return_pc: 0x4776f8
    <ddd65>   DW_AT_call_origin : <0xdd694>
 <3><ddd69>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ddd6a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ddd6c>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><ddd6f>: Abbrev Number: 0
 <2><ddd70>: Abbrev Number: 0
 <1><ddd71>: Abbrev Number: 36 (DW_TAG_subprogram)
    <ddd72>   DW_AT_name        : (indirect string, offset: 0x1bff0): fb_hStrSetLength
    <ddd76>   DW_AT_decl_file   : 3
    <ddd77>   DW_AT_decl_line   : 101
    <ddd78>   DW_AT_decl_column : 24
    <ddd79>   DW_AT_prototyped  : 1
    <ddd79>   DW_AT_inline      : 3	(declared as inline and inlined)
    <ddd7a>   DW_AT_sibling     : <0xddd97>
 <2><ddd7e>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ddd7f>   DW_AT_name        : str
    <ddd83>   DW_AT_decl_file   : 3
    <ddd84>   DW_AT_decl_line   : 101
    <ddd85>   DW_AT_decl_column : 52
    <ddd86>   DW_AT_type        : <0xdd5ec>
 <2><ddd8a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <ddd8b>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <ddd8f>   DW_AT_decl_file   : 3
    <ddd90>   DW_AT_decl_line   : 101
    <ddd91>   DW_AT_decl_column : 64
    <ddd92>   DW_AT_type        : <0xdd55a>
 <2><ddd96>: Abbrev Number: 0
 <1><ddd97>: Abbrev Number: 37 (DW_TAG_subprogram)
    <ddd98>   DW_AT_name        : (indirect string, offset: 0x1ab1d): fb_wstr_Len
    <ddd9c>   DW_AT_decl_file   : 2
    <ddd9d>   DW_AT_decl_line   : 144
    <ddd9e>   DW_AT_decl_column : 27
    <ddd9f>   DW_AT_prototyped  : 1
    <ddd9f>   DW_AT_type        : <0xdd57f>
    <ddda3>   DW_AT_inline      : 3	(declared as inline and inlined)
    <ddda4>   DW_AT_sibling     : <0xdddb3>
 <2><ddda8>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ddda9>   DW_AT_name        : s
    <dddab>   DW_AT_decl_file   : 2
    <dddac>   DW_AT_decl_line   : 144
    <dddad>   DW_AT_decl_column : 56
    <dddae>   DW_AT_type        : <0xdd5e7>
 <2><dddb2>: Abbrev Number: 0
 <1><dddb3>: Abbrev Number: 38 (DW_TAG_subprogram)
    <dddb4>   DW_AT_abstract_origin: <0xddb90>
    <dddb8>   DW_AT_low_pc      : 0x477730
    <dddc0>   DW_AT_high_pc     : 0x1bd
    <dddc8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dddca>   DW_AT_call_all_calls: 1
    <dddca>   DW_AT_sibling     : <0xddf2a>
 <2><dddce>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dddcf>   DW_AT_abstract_origin: <0xddba1>
    <dddd3>   DW_AT_location    : 0x40f1f (location list)
    <dddd7>   DW_AT_GNU_locviews: 0x40f09
 <2><ddddb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ddddc>   DW_AT_abstract_origin: <0xddbad>
    <ddde0>   DW_AT_location    : 0x40f7f (location list)
    <ddde4>   DW_AT_GNU_locviews: 0x40f6d
 <2><ddde8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ddde9>   DW_AT_abstract_origin: <0xddbb9>
    <ddded>   DW_AT_location    : 0x40fdc (location list)
    <dddf1>   DW_AT_GNU_locviews: 0x40fc6
 <2><dddf5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dddf6>   DW_AT_abstract_origin: <0xddbc5>
    <dddfa>   DW_AT_location    : 0x4104c (location list)
    <dddfe>   DW_AT_GNU_locviews: 0x41036
 <2><dde02>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dde03>   DW_AT_abstract_origin: <0xddbd1>
    <dde07>   DW_AT_location    : 0x410ba (location list)
    <dde0b>   DW_AT_GNU_locviews: 0x410a6
 <2><dde0f>: Abbrev Number: 7 (DW_TAG_variable)
    <dde10>   DW_AT_abstract_origin: <0xddbdd>
    <dde14>   DW_AT_location    : 0x41117 (location list)
    <dde18>   DW_AT_GNU_locviews: 0x4110d
 <2><dde1c>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <dde1d>   DW_AT_abstract_origin: <0xddd97>
    <dde21>   DW_AT_entry_pc    : 0x477750
    <dde29>   DW_AT_GNU_entry_view: 1
    <dde2a>   DW_AT_low_pc      : 0x477750
    <dde32>   DW_AT_high_pc     : 0x8
    <dde3a>   DW_AT_call_file   : 1
    <dde3a>   DW_AT_call_line   : 63
    <dde3b>   DW_AT_call_column : 15
    <dde3c>   DW_AT_sibling     : <0xdde62>
 <3><dde40>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dde41>   DW_AT_abstract_origin: <0xddda8>
    <dde45>   DW_AT_location    : 0x41140 (location list)
    <dde49>   DW_AT_GNU_locviews: 0x4113c
 <3><dde4d>: Abbrev Number: 5 (DW_TAG_call_site)
    <dde4e>   DW_AT_call_return_pc: 0x477758
    <dde56>   DW_AT_call_origin : <0xdd5f1>
 <4><dde5a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <dde5b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dde5d>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><dde60>: Abbrev Number: 0
 <3><dde61>: Abbrev Number: 0
 <2><dde62>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <dde63>   DW_AT_abstract_origin: <0xddc54>
    <dde67>   DW_AT_ranges      : 0x185ce
    <dde6b>   DW_AT_sibling     : <0xdde7d>
 <3><dde6f>: Abbrev Number: 7 (DW_TAG_variable)
    <dde70>   DW_AT_abstract_origin: <0xddc55>
    <dde74>   DW_AT_location    : 0x41153 (location list)
    <dde78>   DW_AT_GNU_locviews: 0x4114f
 <3><dde7c>: Abbrev Number: 0
 <2><dde7d>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <dde7e>   DW_AT_abstract_origin: <0xddbe8>
    <dde82>   DW_AT_ranges      : 0x185d9
    <dde86>   DW_AT_sibling     : <0xdded4>
 <3><dde8a>: Abbrev Number: 7 (DW_TAG_variable)
    <dde8b>   DW_AT_abstract_origin: <0xddbed>
    <dde8f>   DW_AT_location    : 0x41166 (location list)
    <dde93>   DW_AT_GNU_locviews: 0x41162
 <3><dde97>: Abbrev Number: 39 (DW_TAG_inlined_subroutine)
    <dde98>   DW_AT_abstract_origin: <0xddd71>
    <dde9c>   DW_AT_entry_pc    : 0x477815
    <ddea4>   DW_AT_GNU_entry_view: 1
    <ddea5>   DW_AT_low_pc      : 0x477815
    <ddead>   DW_AT_high_pc     : 0x17
    <ddeb5>   DW_AT_call_file   : 1
    <ddeb6>   DW_AT_call_line   : 99
    <ddeb7>   DW_AT_call_column : 4
 <4><ddeb8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ddeb9>   DW_AT_abstract_origin: <0xddd8a>
    <ddebd>   DW_AT_location    : 0x41179 (location list)
