 <2><ca6ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca6ad>   DW_AT_type        : <0xc9fac>
 <2><ca6b1>: Abbrev Number: 0
 <1><ca6b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca6b3>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <ca6b7>   DW_AT_decl_file   : 9
    <ca6b8>   DW_AT_decl_line   : 51
    <ca6b9>   DW_AT_decl_column : 24
    <ca6ba>   DW_AT_type        : <0xca6be>
 <1><ca6be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca6bf>   DW_AT_byte_size   : 8
    <ca6bf>   DW_AT_type        : <0xca6c3>
 <1><ca6c3>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca6c4>   DW_AT_prototyped  : 1
    <ca6c4>   DW_AT_type        : <0xc9fd4>
    <ca6c8>   DW_AT_sibling     : <0xca6d7>
 <2><ca6cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca6cd>   DW_AT_type        : <0xc9fd4>
 <2><ca6d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca6d2>   DW_AT_type        : <0xca016>
 <2><ca6d6>: Abbrev Number: 0
 <1><ca6d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca6d8>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <ca6dc>   DW_AT_decl_file   : 9
    <ca6dd>   DW_AT_decl_line   : 54
    <ca6de>   DW_AT_decl_column : 23
    <ca6df>   DW_AT_type        : <0xca6e3>
 <1><ca6e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca6e4>   DW_AT_byte_size   : 8
    <ca6e4>   DW_AT_type        : <0xca6e8>
 <1><ca6e8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca6e9>   DW_AT_prototyped  : 1

    <ca76c>   DW_AT_type        : <0xca770>
 <1><ca770>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca771>   DW_AT_byte_size   : 8
    <ca771>   DW_AT_type        : <0xca775>
 <1><ca775>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca776>   DW_AT_prototyped  : 1
    <ca776>   DW_AT_type        : <0xc9fac>
    <ca77a>   DW_AT_sibling     : <0xca798>
 <2><ca77e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca77f>   DW_AT_type        : <0xca62b>
 <2><ca783>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca784>   DW_AT_type        : <0xca62b>
 <2><ca788>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca789>   DW_AT_type        : <0xca62b>
 <2><ca78d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca78e>   DW_AT_type        : <0xca62b>
 <2><ca792>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca793>   DW_AT_type        : <0xca62b>
 <2><ca797>: Abbrev Number: 0
 <1><ca798>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca799>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <ca79d>   DW_AT_decl_file   : 9
    <ca79e>   DW_AT_decl_line   : 69
    <ca79f>   DW_AT_decl_column : 23
    <ca7a0>   DW_AT_type        : <0xca7a4>
 <1><ca7a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca7a5>   DW_AT_byte_size   : 8
    <ca7a5>   DW_AT_type        : <0xca7a9>
 <1><ca7a9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca7aa>   DW_AT_prototyped  : 1
    <ca7aa>   DW_AT_type        : <0xc9fac>
    <ca7ae>   DW_AT_sibling     : <0xca7c7>
 <2><ca7b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca7b3>   DW_AT_type        : <0xc9fac>
 <2><ca7b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca7b8>   DW_AT_type        : <0xc9fac>
 <2><ca7bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca7bd>   DW_AT_type        : <0xc9fac>
 <2><ca7c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca7c2>   DW_AT_type        : <0xc9fac>
 <2><ca7c6>: Abbrev Number: 0
 <1><ca7c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca7c8>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <ca7cc>   DW_AT_decl_file   : 9
    <ca7cd>   DW_AT_decl_line   : 73
    <ca7ce>   DW_AT_decl_column : 23
    <ca7cf>   DW_AT_type        : <0xca7d3>
 <1><ca7d3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca7d4>   DW_AT_byte_size   : 8
    <ca7d4>   DW_AT_type        : <0xca7d8>
 <1><ca7d8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca7d9>   DW_AT_prototyped  : 1
    <ca7d9>   DW_AT_type        : <0xc9fac>
    <ca7dd>   DW_AT_sibling     : <0xca7e7>
 <2><ca7e1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca7e2>   DW_AT_type        : <0xc9f89>
 <2><ca7e6>: Abbrev Number: 0
 <1><ca7e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca7e8>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <ca7ec>   DW_AT_decl_file   : 9
    <ca7ed>   DW_AT_decl_line   : 74
    <ca7ee>   DW_AT_decl_column : 23
    <ca7ef>   DW_AT_type        : <0xca7f3>
 <1><ca7f3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca7f4>   DW_AT_byte_size   : 8
    <ca7f4>   DW_AT_type        : <0xca7f8>
 <1><ca7f8>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ca7f9>   DW_AT_prototyped  : 1
    <ca7f9>   DW_AT_type        : <0xc9fac>
    <ca7fd>   DW_AT_sibling     : <0xca80c>
 <2><ca801>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca802>   DW_AT_type        : <0xc9f89>
 <2><ca806>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca807>   DW_AT_type        : <0xc9f82>
 <2><ca80b>: Abbrev Number: 0
 <1><ca80c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca80d>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <ca811>   DW_AT_decl_file   : 9
    <ca812>   DW_AT_decl_line   : 80
    <ca813>   DW_AT_decl_column : 23
    <ca814>   DW_AT_type        : <0xca57b>
 <1><ca818>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca819>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <ca81d>   DW_AT_decl_file   : 9
    <ca81e>   DW_AT_decl_line   : 83
    <ca81f>   DW_AT_decl_column : 23
    <ca820>   DW_AT_type        : <0xca750>
 <1><ca824>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca825>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <ca829>   DW_AT_decl_file   : 9
    <ca82a>   DW_AT_decl_line   : 86
    <ca82b>   DW_AT_decl_column : 23
    <ca82c>   DW_AT_type        : <0xca5d9>
 <1><ca830>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca831>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <ca835>   DW_AT_decl_file   : 9
    <ca836>   DW_AT_decl_line   : 89
    <ca837>   DW_AT_decl_column : 23
    <ca838>   DW_AT_type        : <0xca5d9>
 <1><ca83c>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca83d>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <ca841>   DW_AT_decl_file   : 9
    <ca842>   DW_AT_decl_line   : 91
    <ca843>   DW_AT_decl_column : 23
    <ca844>   DW_AT_type        : <0xca848>
 <1><ca848>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca849>   DW_AT_byte_size   : 8
    <ca849>   DW_AT_type        : <0xca84d>
 <1><ca84d>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <ca84e>   DW_AT_prototyped  : 1
    <ca84e>   DW_AT_sibling     : <0xca858>
 <2><ca852>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ca853>   DW_AT_type        : <0xca858>
 <2><ca857>: Abbrev Number: 0
 <1><ca858>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ca859>   DW_AT_byte_size   : 8
    <ca859>   DW_AT_type        : <0xca52b>
 <1><ca85d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ca85e>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <ca862>   DW_AT_byte_size   : 224
    <ca863>   DW_AT_decl_file   : 9
    <ca864>   DW_AT_decl_line   : 93
    <ca865>   DW_AT_decl_column : 16
    <ca866>   DW_AT_sibling     : <0xca9d7>
 <2><ca86a>: Abbrev Number: 2 (DW_TAG_member)
    <ca86b>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <ca86f>   DW_AT_decl_file   : 9
    <ca870>   DW_AT_decl_line   : 94
    <ca871>   DW_AT_decl_column : 23
    <ca872>   DW_AT_type        : <0xca537>
    <ca876>   DW_AT_data_member_location: 0
 <2><ca877>: Abbrev Number: 2 (DW_TAG_member)
    <ca878>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <ca87c>   DW_AT_decl_file   : 9
    <ca87d>   DW_AT_decl_line   : 95
    <ca87e>   DW_AT_decl_column : 23
    <ca87f>   DW_AT_type        : <0xca54d>
    <ca883>   DW_AT_data_member_location: 8
 <2><ca884>: Abbrev Number: 2 (DW_TAG_member)
    <ca885>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <ca889>   DW_AT_decl_file   : 9
    <ca88a>   DW_AT_decl_line   : 96
    <ca88b>   DW_AT_decl_column : 23
    <ca88c>   DW_AT_type        : <0xca563>
    <ca890>   DW_AT_data_member_location: 16
 <2><ca891>: Abbrev Number: 2 (DW_TAG_member)
    <ca892>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <ca896>   DW_AT_decl_file   : 9
    <ca897>   DW_AT_decl_line   : 97
    <ca898>   DW_AT_decl_column : 23
    <ca899>   DW_AT_type        : <0xca56f>
    <ca89d>   DW_AT_data_member_location: 24
 <2><ca89e>: Abbrev Number: 2 (DW_TAG_member)
    <ca89f>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <ca8a3>   DW_AT_decl_file   : 9
    <ca8a4>   DW_AT_decl_line   : 98
    <ca8a5>   DW_AT_decl_column : 23
    <ca8a6>   DW_AT_type        : <0xca58b>
    <ca8aa>   DW_AT_data_member_location: 32
 <2><ca8ab>: Abbrev Number: 2 (DW_TAG_member)
    <ca8ac>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <ca8b0>   DW_AT_decl_file   : 9
    <ca8b1>   DW_AT_decl_line   : 99
    <ca8b2>   DW_AT_decl_column : 23
    <ca8b3>   DW_AT_type        : <0xca5b5>
    <ca8b7>   DW_AT_data_member_location: 40
 <2><ca8b8>: Abbrev Number: 2 (DW_TAG_member)
    <ca8b9>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <ca8bd>   DW_AT_decl_file   : 9
    <ca8be>   DW_AT_decl_line   : 100
    <ca8bf>   DW_AT_decl_column : 23
    <ca8c0>   DW_AT_type        : <0xca5cd>
    <ca8c4>   DW_AT_data_member_location: 48
 <2><ca8c5>: Abbrev Number: 2 (DW_TAG_member)
    <ca8c6>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <ca8ca>   DW_AT_decl_file   : 9
    <ca8cb>   DW_AT_decl_line   : 101
    <ca8cc>   DW_AT_decl_column : 23
    <ca8cd>   DW_AT_type        : <0xca5f2>
    <ca8d1>   DW_AT_data_member_location: 56
 <2><ca8d2>: Abbrev Number: 2 (DW_TAG_member)
    <ca8d3>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <ca8d7>   DW_AT_decl_file   : 9
    <ca8d8>   DW_AT_decl_line   : 102
    <ca8d9>   DW_AT_decl_column : 23
    <ca8da>   DW_AT_type        : <0xca5fe>
    <ca8de>   DW_AT_data_member_location: 64
 <2><ca8df>: Abbrev Number: 2 (DW_TAG_member)
    <ca8e0>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <ca8e4>   DW_AT_decl_file   : 9
    <ca8e5>   DW_AT_decl_line   : 103
    <ca8e6>   DW_AT_decl_column : 23
    <ca8e7>   DW_AT_type        : <0xca60a>
    <ca8eb>   DW_AT_data_member_location: 72
 <2><ca8ec>: Abbrev Number: 2 (DW_TAG_member)
    <ca8ed>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <ca8f1>   DW_AT_decl_file   : 9
    <ca8f2>   DW_AT_decl_line   : 104
    <ca8f3>   DW_AT_decl_column : 23
    <ca8f4>   DW_AT_type        : <0xca630>
    <ca8f8>   DW_AT_data_member_location: 80
 <2><ca8f9>: Abbrev Number: 2 (DW_TAG_member)
    <ca8fa>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <ca8fe>   DW_AT_decl_file   : 9
    <ca8ff>   DW_AT_decl_line   : 105
    <ca900>   DW_AT_decl_column : 24
    <ca901>   DW_AT_type        : <0xca666>
    <ca905>   DW_AT_data_member_location: 88
 <2><ca906>: Abbrev Number: 2 (DW_TAG_member)
    <ca907>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <ca90b>   DW_AT_decl_file   : 9
    <ca90c>   DW_AT_decl_line   : 106
    <ca90d>   DW_AT_decl_column : 25
    <ca90e>   DW_AT_type        : <0xca68c>
    <ca912>   DW_AT_data_member_location: 96
 <2><ca913>: Abbrev Number: 2 (DW_TAG_member)
    <ca914>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <ca918>   DW_AT_decl_file   : 9
    <ca919>   DW_AT_decl_line   : 107
    <ca91a>   DW_AT_decl_column : 23
    <ca91b>   DW_AT_type        : <0xca6b2>
    <ca91f>   DW_AT_data_member_location: 104
 <2><ca920>: Abbrev Number: 2 (DW_TAG_member)
    <ca921>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <ca925>   DW_AT_decl_file   : 9
    <ca926>   DW_AT_decl_line   : 108
    <ca927>   DW_AT_decl_column : 23
    <ca928>   DW_AT_type        : <0xca744>
    <ca92c>   DW_AT_data_member_location: 112
 <2><ca92d>: Abbrev Number: 2 (DW_TAG_member)
    <ca92e>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <ca932>   DW_AT_decl_file   : 9
    <ca933>   DW_AT_decl_line   : 109
    <ca934>   DW_AT_decl_column : 23
    <ca935>   DW_AT_type        : <0xca764>
    <ca939>   DW_AT_data_member_location: 120
 <2><ca93a>: Abbrev Number: 2 (DW_TAG_member)
    <ca93b>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <ca93f>   DW_AT_decl_file   : 9
    <ca940>   DW_AT_decl_line   : 110
    <ca941>   DW_AT_decl_column : 23
    <ca942>   DW_AT_type        : <0xca798>
    <ca946>   DW_AT_data_member_location: 128
 <2><ca947>: Abbrev Number: 2 (DW_TAG_member)
    <ca948>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <ca94c>   DW_AT_decl_file   : 9
    <ca94d>   DW_AT_decl_line   : 111
    <ca94e>   DW_AT_decl_column : 23
    <ca94f>   DW_AT_type        : <0xca7c7>
    <ca953>   DW_AT_data_member_location: 136
 <2><ca954>: Abbrev Number: 2 (DW_TAG_member)
    <ca955>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <ca959>   DW_AT_decl_file   : 9
    <ca95a>   DW_AT_decl_line   : 112
    <ca95b>   DW_AT_decl_column : 23
    <ca95c>   DW_AT_type        : <0xca7e7>
    <ca960>   DW_AT_data_member_location: 144
 <2><ca961>: Abbrev Number: 2 (DW_TAG_member)
    <ca962>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <ca966>   DW_AT_decl_file   : 9
    <ca967>   DW_AT_decl_line   : 113
    <ca968>   DW_AT_decl_column : 25
    <ca969>   DW_AT_type        : <0xca5c1>
    <ca96d>   DW_AT_data_member_location: 152
 <2><ca96e>: Abbrev Number: 2 (DW_TAG_member)
    <ca96f>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <ca973>   DW_AT_decl_file   : 9
    <ca974>   DW_AT_decl_line   : 114
    <ca975>   DW_AT_decl_column : 24
    <ca976>   DW_AT_type        : <0xca6d7>
    <ca97a>   DW_AT_data_member_location: 160
 <2><ca97b>: Abbrev Number: 2 (DW_TAG_member)
    <ca97c>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <ca980>   DW_AT_decl_file   : 9
    <ca981>   DW_AT_decl_line   : 115
    <ca982>   DW_AT_decl_column : 25
    <ca983>   DW_AT_type        : <0xca710>
    <ca987>   DW_AT_data_member_location: 168
 <2><ca988>: Abbrev Number: 2 (DW_TAG_member)
    <ca989>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <ca98d>   DW_AT_decl_file   : 9
    <ca98e>   DW_AT_decl_line   : 116
    <ca98f>   DW_AT_decl_column : 23
    <ca990>   DW_AT_type        : <0xca63c>
    <ca994>   DW_AT_data_member_location: 176
 <2><ca995>: Abbrev Number: 2 (DW_TAG_member)
    <ca996>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <ca99a>   DW_AT_decl_file   : 9
    <ca99b>   DW_AT_decl_line   : 117
    <ca99c>   DW_AT_decl_column : 23
    <ca99d>   DW_AT_type        : <0xca80c>
    <ca9a1>   DW_AT_data_member_location: 184
 <2><ca9a2>: Abbrev Number: 2 (DW_TAG_member)
    <ca9a3>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <ca9a7>   DW_AT_decl_file   : 9
    <ca9a8>   DW_AT_decl_line   : 118
    <ca9a9>   DW_AT_decl_column : 22
    <ca9aa>   DW_AT_type        : <0xca818>
    <ca9ae>   DW_AT_data_member_location: 192
 <2><ca9af>: Abbrev Number: 2 (DW_TAG_member)
    <ca9b0>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <ca9b4>   DW_AT_decl_file   : 9
    <ca9b5>   DW_AT_decl_line   : 119
    <ca9b6>   DW_AT_decl_column : 23
    <ca9b7>   DW_AT_type        : <0xca824>
    <ca9bb>   DW_AT_data_member_location: 200
 <2><ca9bc>: Abbrev Number: 2 (DW_TAG_member)
    <ca9bd>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <ca9c1>   DW_AT_decl_file   : 9
    <ca9c2>   DW_AT_decl_line   : 120
    <ca9c3>   DW_AT_decl_column : 22
    <ca9c4>   DW_AT_type        : <0xca830>
    <ca9c8>   DW_AT_data_member_location: 208
 <2><ca9c9>: Abbrev Number: 2 (DW_TAG_member)
    <ca9ca>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <ca9ce>   DW_AT_decl_file   : 9
    <ca9cf>   DW_AT_decl_line   : 121
    <ca9d0>   DW_AT_decl_column : 23
    <ca9d1>   DW_AT_type        : <0xca83c>
    <ca9d5>   DW_AT_data_member_location: 216
 <2><ca9d6>: Abbrev Number: 0
 <1><ca9d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca9d8>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <ca9dc>   DW_AT_decl_file   : 9
    <ca9dd>   DW_AT_decl_line   : 122
    <ca9de>   DW_AT_decl_column : 3
    <ca9df>   DW_AT_type        : <0xca85d>
 <1><ca9e3>: Abbrev Number: 41 (DW_TAG_structure_type)
    <ca9e4>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <ca9e8>   DW_AT_byte_size   : 20848
    <ca9ea>   DW_AT_decl_file   : 10
    <ca9eb>   DW_AT_decl_line   : 349
    <ca9ed>   DW_AT_decl_column : 16
    <ca9ee>   DW_AT_sibling     : <0xcaa63>
 <2><ca9f2>: Abbrev Number: 12 (DW_TAG_member)
    <ca9f3>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <ca9f7>   DW_AT_decl_file   : 10
    <ca9f7>   DW_AT_decl_line   : 350
    <ca9f9>   DW_AT_decl_column : 18
    <ca9f9>   DW_AT_type        : <0xc9fac>
    <ca9fd>   DW_AT_data_member_location: 0
 <2><ca9fe>: Abbrev Number: 12 (DW_TAG_member)
    <ca9ff>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <caa03>   DW_AT_decl_file   : 10
    <caa03>   DW_AT_decl_line   : 351
    <caa05>   DW_AT_decl_column : 18
    <caa05>   DW_AT_type        : <0xca044>
    <caa09>   DW_AT_data_member_location: 8
 <2><caa0a>: Abbrev Number: 12 (DW_TAG_member)
    <caa0b>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <caa0f>   DW_AT_decl_file   : 10
    <caa0f>   DW_AT_decl_line   : 352
    <caa11>   DW_AT_decl_column : 18
    <caa11>   DW_AT_type        : <0xca090>
    <caa15>   DW_AT_data_member_location: 16
 <2><caa16>: Abbrev Number: 12 (DW_TAG_member)
    <caa17>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <caa1b>   DW_AT_decl_file   : 10
    <caa1b>   DW_AT_decl_line   : 353
    <caa1d>   DW_AT_decl_column : 18
    <caa1d>   DW_AT_type        : <0xc9fd4>
    <caa21>   DW_AT_data_member_location: 40
 <2><caa22>: Abbrev Number: 12 (DW_TAG_member)
    <caa23>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <caa27>   DW_AT_decl_file   : 10
    <caa27>   DW_AT_decl_line   : 354
    <caa29>   DW_AT_decl_column : 18
    <caa29>   DW_AT_type        : <0xca9d7>
    <caa2d>   DW_AT_data_member_location: 48
 <2><caa2e>: Abbrev Number: 14 (DW_TAG_member)
    <caa2f>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <caa33>   DW_AT_decl_file   : 10
    <caa33>   DW_AT_decl_line   : 355
    <caa35>   DW_AT_decl_column : 18
    <caa35>   DW_AT_type        : <0xcaa63>
    <caa39>   DW_AT_data_member_location: 272
 <2><caa3b>: Abbrev Number: 14 (DW_TAG_member)
    <caa3c>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <caa40>   DW_AT_decl_file   : 10
    <caa40>   DW_AT_decl_line   : 356
    <caa42>   DW_AT_decl_column : 18
    <caa42>   DW_AT_type        : <0xc9fac>
    <caa46>   DW_AT_data_member_location: 20832
 <2><caa48>: Abbrev Number: 14 (DW_TAG_member)
    <caa49>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <caa4d>   DW_AT_decl_file   : 10
    <caa4d>   DW_AT_decl_line   : 357
    <caa4f>   DW_AT_decl_column : 18
    <caa4f>   DW_AT_type        : <0xc9fac>
    <caa53>   DW_AT_data_member_location: 20836
 <2><caa55>: Abbrev Number: 14 (DW_TAG_member)
    <caa56>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <caa5a>   DW_AT_decl_file   : 10
    <caa5a>   DW_AT_decl_line   : 358
    <caa5c>   DW_AT_decl_column : 18
    <caa5c>   DW_AT_type        : <0xca055>
    <caa60>   DW_AT_data_member_location: 20840
 <2><caa62>: Abbrev Number: 0
 <1><caa63>: Abbrev Number: 16 (DW_TAG_array_type)
    <caa64>   DW_AT_type        : <0xca471>
    <caa68>   DW_AT_sibling     : <0xcaa74>
 <2><caa6c>: Abbrev Number: 42 (DW_TAG_subrange_type)
    <caa6d>   DW_AT_type        : <0xc9f97>
    <caa71>   DW_AT_upper_bound : 256
 <2><caa73>: Abbrev Number: 0
 <1><caa74>: Abbrev Number: 18 (DW_TAG_typedef)
    <caa75>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <caa79>   DW_AT_decl_file   : 10
    <caa7a>   DW_AT_decl_line   : 359
    <caa7c>   DW_AT_decl_column : 3
    <caa7d>   DW_AT_type        : <0xca9e3>
 <1><caa81>: Abbrev Number: 43 (DW_TAG_variable)
    <caa82>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <caa86>   DW_AT_decl_file   : 10
    <caa87>   DW_AT_decl_line   : 361
    <caa89>   DW_AT_decl_column : 21
    <caa8a>   DW_AT_type        : <0xcaa74>
    <caa8e>   DW_AT_external    : 1
    <caa8e>   DW_AT_declaration : 1
 <1><caa8e>: Abbrev Number: 44 (DW_TAG_subprogram)
    <caa8f>   DW_AT_external    : 1
    <caa8f>   DW_AT_name        : (indirect string, offset: 0x1bc28): fb_PrintPadEx
    <caa93>   DW_AT_decl_file   : 12
    <caa94>   DW_AT_decl_line   : 92
    <caa95>   DW_AT_decl_column : 21
    <caa96>   DW_AT_prototyped  : 1
    <caa96>   DW_AT_declaration : 1
    <caa96>   DW_AT_sibling     : <0xcaaa5>
 <2><caa9a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caa9b>   DW_AT_type        : <0xca47d>
 <2><caa9f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caaa0>   DW_AT_type        : <0xc9fac>
 <2><caaa4>: Abbrev Number: 0
 <1><caaa5>: Abbrev Number: 24 (DW_TAG_subprogram)
    <caaa6>   DW_AT_external    : 1
    <caaa6>   DW_AT_name        : (indirect string, offset: 0x1bbe5): fb_hFilePrintBufferEx
    <caaaa>   DW_AT_decl_file   : 7
    <caaab>   DW_AT_decl_line   : 304
    <caaad>   DW_AT_decl_column : 21
    <caaae>   DW_AT_prototyped  : 1
    <caaae>   DW_AT_type        : <0xc9fac>
    <caab2>   DW_AT_declaration : 1
    <caab2>   DW_AT_sibling     : <0xcaac6>
 <2><caab6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caab7>   DW_AT_type        : <0xca47d>
 <2><caabb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caabc>   DW_AT_type        : <0xca039>
 <2><caac0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caac1>   DW_AT_type        : <0xc9fe5>
 <2><caac5>: Abbrev Number: 0
 <1><caac6>: Abbrev Number: 24 (DW_TAG_subprogram)
    <caac7>   DW_AT_external    : 1
    <caac7>   DW_AT_name        : (indirect string, offset: 0x1bc20): sprintf
    <caacb>   DW_AT_decl_file   : 11
    <caacc>   DW_AT_decl_line   : 334
    <caace>   DW_AT_decl_column : 12
    <caacf>   DW_AT_prototyped  : 1
    <caacf>   DW_AT_type        : <0xc9fac>
    <caad3>   DW_AT_declaration : 1
    <caad3>   DW_AT_sibling     : <0xcaae3>
 <2><caad7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caad8>   DW_AT_type        : <0xc9fd4>
 <2><caadc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <caadd>   DW_AT_type        : <0xca03f>
 <2><caae1>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <2><caae2>: Abbrev Number: 0
 <1><caae3>: Abbrev Number: 25 (DW_TAG_subprogram)
    <caae4>   DW_AT_external    : 1
    <caae4>   DW_AT_name        : (indirect string, offset: 0x1bc0f): fb_PrintULongint
    <caae8>   DW_AT_decl_file   : 1
    <caae8>   DW_AT_decl_line   : 12
    <caae9>   DW_AT_decl_column : 13
    <caae9>   DW_AT_prototyped  : 1
    <caae9>   DW_AT_low_pc      : 0x473d40
    <caaf1>   DW_AT_high_pc     : 0x1ef
    <caaf9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <caafb>   DW_AT_call_all_calls: 1
    <caafb>   DW_AT_sibling     : <0xcace3>
 <2><caaff>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cab00>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <cab04>   DW_AT_decl_file   : 1
    <cab04>   DW_AT_decl_line   : 12
    <cab05>   DW_AT_decl_column : 36
    <cab06>   DW_AT_type        : <0xc9fac>
    <cab0a>   DW_AT_location    : 0x3bfe5 (location list)
    <cab0e>   DW_AT_GNU_locviews: 0x3bfd1
 <2><cab12>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <cab13>   DW_AT_name        : val
    <cab17>   DW_AT_decl_file   : 1
    <cab17>   DW_AT_decl_line   : 12
    <cab18>   DW_AT_decl_column : 61
    <cab19>   DW_AT_type        : <0xca022>
    <cab1d>   DW_AT_location    : 0x3c054 (location list)
    <cab21>   DW_AT_GNU_locviews: 0x3c03a
 <2><cab25>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cab26>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <cab2a>   DW_AT_decl_file   : 1
    <cab2a>   DW_AT_decl_line   : 12
    <cab2b>   DW_AT_decl_column : 70
    <cab2c>   DW_AT_type        : <0xc9fac>
    <cab30>   DW_AT_location    : 0x3c0ca (location list)
    <cab34>   DW_AT_GNU_locviews: 0x3c0c2
 <2><cab38>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <cab39>   DW_AT_ranges      : 0x181eb
    <cab3d>   DW_AT_sibling     : <0xcacd5>
 <3><cab41>: Abbrev Number: 28 (DW_TAG_variable)
    <cab42>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <cab46>   DW_AT_decl_file   : 1
    <cab46>   DW_AT_decl_line   : 14
    <cab47>   DW_AT_decl_column : 5
    <cab48>   DW_AT_type        : <0xcace3>
    <cab4c>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <3><cab50>: Abbrev Number: 29 (DW_TAG_variable)
    <cab51>   DW_AT_name        : len
    <cab55>   DW_AT_decl_file   : 1
    <cab55>   DW_AT_decl_line   : 14
    <cab56>   DW_AT_decl_column : 5
    <cab57>   DW_AT_type        : <0xc9fe5>
    <cab5b>   DW_AT_location    : 0x3c0f8 (location list)
    <cab5f>   DW_AT_GNU_locviews: 0x3c0ea
 <3><cab63>: Abbrev Number: 7 (DW_TAG_call_site)
    <cab64>   DW_AT_call_return_pc: 0x473d93
    <cab6c>   DW_AT_call_origin : <0xcaac6>
    <cab70>   DW_AT_sibling     : <0xcab90>
 <4><cab74>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cab75>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cab77>   DW_AT_call_value  : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <4><cab7b>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cab7c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cab7e>   DW_AT_call_value  : 9 byte block: 3 9c 41 48 0 0 0 0 0 	(DW_OP_addr: 48419c)
 <4><cab88>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cab89>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cab8b>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <4><cab8f>: Abbrev Number: 0
 <3><cab90>: Abbrev Number: 7 (DW_TAG_call_site)
    <cab91>   DW_AT_call_return_pc: 0x473de0
    <cab99>   DW_AT_call_origin : <0xcaaa5>
    <cab9d>   DW_AT_sibling     : <0xcabae>
 <4><caba1>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caba2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <caba4>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><caba7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caba8>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cabaa>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cabad>: Abbrev Number: 0
 <3><cabae>: Abbrev Number: 7 (DW_TAG_call_site)
    <cabaf>   DW_AT_call_return_pc: 0x473df2
    <cabb7>   DW_AT_call_origin : <0xcaa8e>
    <cabbb>   DW_AT_sibling     : <0xcabc6>
 <4><cabbf>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cabc0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cabc2>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><cabc5>: Abbrev Number: 0
 <3><cabc6>: Abbrev Number: 7 (DW_TAG_call_site)
    <cabc7>   DW_AT_call_return_pc: 0x473e3a
    <cabcf>   DW_AT_call_origin : <0xcaac6>
    <cabd3>   DW_AT_sibling     : <0xcabeb>
 <4><cabd7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cabd8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cabda>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cabdd>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cabde>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cabe0>   DW_AT_call_value  : 9 byte block: 3 a9 41 48 0 0 0 0 0 	(DW_OP_addr: 4841a9)
 <4><cabea>: Abbrev Number: 0
 <3><cabeb>: Abbrev Number: 7 (DW_TAG_call_site)
    <cabec>   DW_AT_call_return_pc: 0x473e62
    <cabf4>   DW_AT_call_origin : <0xcaaa5>
    <cabf8>   DW_AT_sibling     : <0xcac09>
 <4><cabfc>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cabfd>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cabff>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><cac02>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac03>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cac05>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cac08>: Abbrev Number: 0
 <3><cac09>: Abbrev Number: 7 (DW_TAG_call_site)
    <cac0a>   DW_AT_call_return_pc: 0x473e81
    <cac12>   DW_AT_call_origin : <0xcaac6>
    <cac16>   DW_AT_sibling     : <0xcac2e>
 <4><cac1a>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac1b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cac1d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cac20>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac21>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cac23>   DW_AT_call_value  : 9 byte block: 3 95 41 48 0 0 0 0 0 	(DW_OP_addr: 484195)
 <4><cac2d>: Abbrev Number: 0
 <3><cac2e>: Abbrev Number: 7 (DW_TAG_call_site)
    <cac2f>   DW_AT_call_return_pc: 0x473ea1
    <cac37>   DW_AT_call_origin : <0xcaac6>
    <cac3b>   DW_AT_sibling     : <0xcac53>
 <4><cac3f>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac40>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cac42>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cac45>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac46>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cac48>   DW_AT_call_value  : 9 byte block: 3 af 41 48 0 0 0 0 0 	(DW_OP_addr: 4841af)
 <4><cac52>: Abbrev Number: 0
 <3><cac53>: Abbrev Number: 7 (DW_TAG_call_site)
    <cac54>   DW_AT_call_return_pc: 0x473ec1
    <cac5c>   DW_AT_call_origin : <0xcaac6>
    <cac60>   DW_AT_sibling     : <0xcac78>
 <4><cac64>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac65>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cac67>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cac6a>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac6b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cac6d>   DW_AT_call_value  : 9 byte block: 3 8d 41 48 0 0 0 0 0 	(DW_OP_addr: 48418d)
 <4><cac77>: Abbrev Number: 0
 <3><cac78>: Abbrev Number: 7 (DW_TAG_call_site)
    <cac79>   DW_AT_call_return_pc: 0x473ee1
    <cac81>   DW_AT_call_origin : <0xcaac6>
    <cac85>   DW_AT_sibling     : <0xcac9d>
 <4><cac89>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac8a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cac8c>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cac8f>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cac90>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cac92>   DW_AT_call_value  : 9 byte block: 3 a2 41 48 0 0 0 0 0 	(DW_OP_addr: 4841a2)
 <4><cac9c>: Abbrev Number: 0
 <3><cac9d>: Abbrev Number: 7 (DW_TAG_call_site)
    <cac9e>   DW_AT_call_return_pc: 0x473f02
    <caca6>   DW_AT_call_origin : <0xcaaa5>
    <cacaa>   DW_AT_sibling     : <0xcacbb>
 <4><cacae>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cacaf>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cacb1>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><cacb4>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cacb5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cacb7>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cacba>: Abbrev Number: 0
 <3><cacbb>: Abbrev Number: 30 (DW_TAG_call_site)
    <cacbc>   DW_AT_call_return_pc: 0x473f1a
    <cacc4>   DW_AT_call_origin : <0xcaaa5>
 <4><cacc8>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cacc9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <caccb>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><caccd>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cacce>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cacd0>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cacd3>: Abbrev Number: 0
 <3><cacd4>: Abbrev Number: 0
 <2><cacd5>: Abbrev Number: 31 (DW_TAG_call_site)
    <cacd6>   DW_AT_call_return_pc: 0x473f2f
    <cacde>   DW_AT_call_origin : <0xcaef3>
 <2><cace2>: Abbrev Number: 0
 <1><cace3>: Abbrev Number: 16 (DW_TAG_array_type)
    <cace4>   DW_AT_type        : <0xc9fd9>
    <cace8>   DW_AT_sibling     : <0xcacf3>
 <2><cacec>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <caced>   DW_AT_type        : <0xc9f97>
    <cacf1>   DW_AT_upper_bound : 79
 <2><cacf2>: Abbrev Number: 0
 <1><cacf3>: Abbrev Number: 25 (DW_TAG_subprogram)
    <cacf4>   DW_AT_external    : 1
    <cacf4>   DW_AT_name        : (indirect string, offset: 0x13ff2): fb_PrintLongint
    <cacf8>   DW_AT_decl_file   : 1
    <cacf8>   DW_AT_decl_line   : 6
    <cacf9>   DW_AT_decl_column : 13
    <cacf9>   DW_AT_prototyped  : 1
    <cacf9>   DW_AT_low_pc      : 0x473b50
    <cad01>   DW_AT_high_pc     : 0x1ef
    <cad09>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cad0b>   DW_AT_call_all_calls: 1
    <cad0b>   DW_AT_sibling     : <0xcaef3>
 <2><cad0f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cad10>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <cad14>   DW_AT_decl_file   : 1
    <cad14>   DW_AT_decl_line   : 6
    <cad15>   DW_AT_decl_column : 35
    <cad16>   DW_AT_type        : <0xc9fac>
    <cad1a>   DW_AT_location    : 0x3c13e (location list)
    <cad1e>   DW_AT_GNU_locviews: 0x3c12a
 <2><cad22>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <cad23>   DW_AT_name        : val
    <cad27>   DW_AT_decl_file   : 1
    <cad27>   DW_AT_decl_line   : 6
    <cad28>   DW_AT_decl_column : 51
    <cad29>   DW_AT_type        : <0xca003>
    <cad2d>   DW_AT_location    : 0x3c1a8 (location list)
    <cad31>   DW_AT_GNU_locviews: 0x3c18e
 <2><cad35>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cad36>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <cad3a>   DW_AT_decl_file   : 1
    <cad3a>   DW_AT_decl_line   : 6
    <cad3b>   DW_AT_decl_column : 60
    <cad3c>   DW_AT_type        : <0xc9fac>
    <cad40>   DW_AT_location    : 0x3c219 (location list)
    <cad44>   DW_AT_GNU_locviews: 0x3c211
 <2><cad48>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <cad49>   DW_AT_ranges      : 0x181e1
    <cad4d>   DW_AT_sibling     : <0xcaee5>
 <3><cad51>: Abbrev Number: 28 (DW_TAG_variable)
    <cad52>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <cad56>   DW_AT_decl_file   : 1
    <cad56>   DW_AT_decl_line   : 8
    <cad57>   DW_AT_decl_column : 2
    <cad58>   DW_AT_type        : <0xcace3>
    <cad5c>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <3><cad60>: Abbrev Number: 29 (DW_TAG_variable)
    <cad61>   DW_AT_name        : len
    <cad65>   DW_AT_decl_file   : 1
    <cad65>   DW_AT_decl_line   : 8
    <cad66>   DW_AT_decl_column : 2
    <cad67>   DW_AT_type        : <0xc9fe5>
    <cad6b>   DW_AT_location    : 0x3c244 (location list)
    <cad6f>   DW_AT_GNU_locviews: 0x3c236
 <3><cad73>: Abbrev Number: 7 (DW_TAG_call_site)
    <cad74>   DW_AT_call_return_pc: 0x473ba3
    <cad7c>   DW_AT_call_origin : <0xcaac6>
    <cad80>   DW_AT_sibling     : <0xcada0>
 <4><cad84>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cad85>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cad87>   DW_AT_call_value  : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <4><cad8b>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cad8c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cad8e>   DW_AT_call_value  : 9 byte block: 3 71 41 48 0 0 0 0 0 	(DW_OP_addr: 484171)
 <4><cad98>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cad99>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cad9b>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <4><cad9f>: Abbrev Number: 0
 <3><cada0>: Abbrev Number: 7 (DW_TAG_call_site)
    <cada1>   DW_AT_call_return_pc: 0x473bf0
    <cada9>   DW_AT_call_origin : <0xcaaa5>
    <cadad>   DW_AT_sibling     : <0xcadbe>
 <4><cadb1>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cadb2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cadb4>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><cadb7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cadb8>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cadba>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cadbd>: Abbrev Number: 0
 <3><cadbe>: Abbrev Number: 7 (DW_TAG_call_site)
    <cadbf>   DW_AT_call_return_pc: 0x473c02
    <cadc7>   DW_AT_call_origin : <0xcaa8e>
    <cadcb>   DW_AT_sibling     : <0xcadd6>
 <4><cadcf>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cadd0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cadd2>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><cadd5>: Abbrev Number: 0
 <3><cadd6>: Abbrev Number: 7 (DW_TAG_call_site)
    <cadd7>   DW_AT_call_return_pc: 0x473c4a
    <caddf>   DW_AT_call_origin : <0xcaac6>
    <cade3>   DW_AT_sibling     : <0xcadfb>
 <4><cade7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cade8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cadea>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><caded>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cadee>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cadf0>   DW_AT_call_value  : 9 byte block: 3 80 41 48 0 0 0 0 0 	(DW_OP_addr: 484180)
 <4><cadfa>: Abbrev Number: 0
 <3><cadfb>: Abbrev Number: 7 (DW_TAG_call_site)
    <cadfc>   DW_AT_call_return_pc: 0x473c72
    <cae04>   DW_AT_call_origin : <0xcaaa5>
    <cae08>   DW_AT_sibling     : <0xcae19>
 <4><cae0c>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae0d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cae0f>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><cae12>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae13>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cae15>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cae18>: Abbrev Number: 0
 <3><cae19>: Abbrev Number: 7 (DW_TAG_call_site)
    <cae1a>   DW_AT_call_return_pc: 0x473c91
    <cae22>   DW_AT_call_origin : <0xcaac6>
    <cae26>   DW_AT_sibling     : <0xcae3e>
 <4><cae2a>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae2b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cae2d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cae30>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae31>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cae33>   DW_AT_call_value  : 9 byte block: 3 69 41 48 0 0 0 0 0 	(DW_OP_addr: 484169)
 <4><cae3d>: Abbrev Number: 0
 <3><cae3e>: Abbrev Number: 7 (DW_TAG_call_site)
    <cae3f>   DW_AT_call_return_pc: 0x473cb1
    <cae47>   DW_AT_call_origin : <0xcaac6>
    <cae4b>   DW_AT_sibling     : <0xcae63>
 <4><cae4f>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae50>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cae52>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cae55>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae56>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cae58>   DW_AT_call_value  : 9 byte block: 3 87 41 48 0 0 0 0 0 	(DW_OP_addr: 484187)
 <4><cae62>: Abbrev Number: 0
 <3><cae63>: Abbrev Number: 7 (DW_TAG_call_site)
    <cae64>   DW_AT_call_return_pc: 0x473cd1
    <cae6c>   DW_AT_call_origin : <0xcaac6>
    <cae70>   DW_AT_sibling     : <0xcae88>
 <4><cae74>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae75>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cae77>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cae7a>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae7b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cae7d>   DW_AT_call_value  : 9 byte block: 3 60 41 48 0 0 0 0 0 	(DW_OP_addr: 484160)
 <4><cae87>: Abbrev Number: 0
 <3><cae88>: Abbrev Number: 7 (DW_TAG_call_site)
    <cae89>   DW_AT_call_return_pc: 0x473cf1
    <cae91>   DW_AT_call_origin : <0xcaac6>
    <cae95>   DW_AT_sibling     : <0xcaead>
 <4><cae99>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <cae9a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cae9c>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><cae9f>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caea0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <caea2>   DW_AT_call_value  : 9 byte block: 3 78 41 48 0 0 0 0 0 	(DW_OP_addr: 484178)
 <4><caeac>: Abbrev Number: 0
 <3><caead>: Abbrev Number: 7 (DW_TAG_call_site)
    <caeae>   DW_AT_call_return_pc: 0x473d12
    <caeb6>   DW_AT_call_origin : <0xcaaa5>
    <caeba>   DW_AT_sibling     : <0xcaecb>
 <4><caebe>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caebf>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <caec1>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><caec4>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caec5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <caec7>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><caeca>: Abbrev Number: 0
 <3><caecb>: Abbrev Number: 30 (DW_TAG_call_site)
    <caecc>   DW_AT_call_return_pc: 0x473d2a
    <caed4>   DW_AT_call_origin : <0xcaaa5>
 <4><caed8>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caed9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <caedb>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><caedd>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <caede>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <caee0>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><caee3>: Abbrev Number: 0
 <3><caee4>: Abbrev Number: 0
 <2><caee5>: Abbrev Number: 31 (DW_TAG_call_site)
    <caee6>   DW_AT_call_return_pc: 0x473d3f
    <caeee>   DW_AT_call_origin : <0xcaef3>
 <2><caef2>: Abbrev Number: 0
 <1><caef3>: Abbrev Number: 46 (DW_TAG_subprogram)
    <caef4>   DW_AT_external    : 1
    <caef4>   DW_AT_declaration : 1
    <caef4>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <caef8>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><caefc>: Abbrev Number: 0
  Compilation Unit @ offset 0xcaefd:
   Length:        0xe86 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x10d84
   Pointer Size:  8
 <0><caf09>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <caf0a>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <caf0e>   DW_AT_language    : 29	(C11)
    <caf0f>   DW_AT_name        : (indirect line string, offset: 0x112b): src/rtlib/io_print_wstr.c
    <caf13>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <caf17>   DW_AT_low_pc      : 0x473f30
    <caf1f>   DW_AT_high_pc     : 0xea
    <caf27>   DW_AT_stmt_list   : 0x687ce
 <1><caf2b>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf2c>   DW_AT_byte_size   : 1
    <caf2d>   DW_AT_encoding    : 8	(unsigned char)
    <caf2e>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><caf32>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf33>   DW_AT_byte_size   : 2
    <caf34>   DW_AT_encoding    : 7	(unsigned)
    <caf35>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><caf39>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf3a>   DW_AT_byte_size   : 4
    <caf3b>   DW_AT_encoding    : 7	(unsigned)
    <caf3c>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><caf40>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf41>   DW_AT_byte_size   : 8
    <caf42>   DW_AT_encoding    : 7	(unsigned)
    <caf43>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><caf47>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf48>   DW_AT_byte_size   : 1
    <caf49>   DW_AT_encoding    : 6	(signed char)
    <caf4a>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><caf4e>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf4f>   DW_AT_byte_size   : 2
    <caf50>   DW_AT_encoding    : 5	(signed)
    <caf51>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><caf55>: Abbrev Number: 30 (DW_TAG_base_type)
    <caf56>   DW_AT_byte_size   : 4
    <caf57>   DW_AT_encoding    : 5	(signed)
    <caf58>   DW_AT_name        : int
 <1><caf5c>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf5d>   DW_AT_byte_size   : 8
    <caf5e>   DW_AT_encoding    : 5	(signed)
    <caf5f>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><caf63>: Abbrev Number: 3 (DW_TAG_typedef)
    <caf64>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <caf68>   DW_AT_decl_file   : 3
    <caf69>   DW_AT_decl_line   : 153
    <caf6a>   DW_AT_decl_column : 27
    <caf6b>   DW_AT_type        : <0xcaf5c>
 <1><caf6f>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <caf70>   DW_AT_byte_size   : 8
 <1><caf71>: Abbrev Number: 3 (DW_TAG_typedef)
    <caf72>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <caf76>   DW_AT_decl_file   : 3
    <caf77>   DW_AT_decl_line   : 194
    <caf78>   DW_AT_decl_column : 27
    <caf79>   DW_AT_type        : <0xcaf5c>
 <1><caf7d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <caf7e>   DW_AT_byte_size   : 8
    <caf7e>   DW_AT_type        : <0xcaf82>
 <1><caf82>: Abbrev Number: 7 (DW_TAG_base_type)
    <caf83>   DW_AT_byte_size   : 1
    <caf84>   DW_AT_encoding    : 6	(signed char)
    <caf85>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><caf89>: Abbrev Number: 3 (DW_TAG_typedef)
    <caf8a>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <caf8e>   DW_AT_decl_file   : 4
    <caf8f>   DW_AT_decl_line   : 209
    <caf90>   DW_AT_decl_column : 23
    <caf91>   DW_AT_type        : <0xcaf40>
 <1><caf95>: Abbrev Number: 18 (DW_TAG_typedef)
    <caf96>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <caf9a>   DW_AT_decl_file   : 4
    <caf9b>   DW_AT_decl_line   : 321
    <caf9d>   DW_AT_decl_column : 24
    <caf9e>   DW_AT_type        : <0xcaf55>
 <1><cafa2>: Abbrev Number: 32 (DW_TAG_const_type)
    <cafa3>   DW_AT_type        : <0xcaf95>
 <1><cafa7>: Abbrev Number: 7 (DW_TAG_base_type)
    <cafa8>   DW_AT_byte_size   : 8
    <cafa9>   DW_AT_encoding    : 5	(signed)
    <cafaa>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><cafae>: Abbrev Number: 3 (DW_TAG_typedef)
    <cafaf>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <cafb3>   DW_AT_decl_file   : 5
    <cafb4>   DW_AT_decl_line   : 87
    <cafb5>   DW_AT_decl_column : 19
    <cafb6>   DW_AT_type        : <0xcaf63>
 <1><cafba>: Abbrev Number: 3 (DW_TAG_typedef)
    <cafbb>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <cafbf>   DW_AT_decl_file   : 5
    <cafc0>   DW_AT_decl_line   : 108
    <cafc1>   DW_AT_decl_column : 19
    <cafc2>   DW_AT_type        : <0xcaf71>
 <1><cafc6>: Abbrev Number: 7 (DW_TAG_base_type)
    <cafc7>   DW_AT_byte_size   : 8
    <cafc8>   DW_AT_encoding    : 7	(unsigned)
    <cafc9>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><cafcd>: Abbrev Number: 19 (DW_TAG_array_type)
    <cafce>   DW_AT_type        : <0xcaf82>
    <cafd2>   DW_AT_sibling     : <0xcafdd>
 <2><cafd6>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <cafd7>   DW_AT_type        : <0xcaf40>
    <cafdb>   DW_AT_upper_bound : 3
 <2><cafdc>: Abbrev Number: 0
 <1><cafdd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cafde>   DW_AT_byte_size   : 8
    <cafde>   DW_AT_type        : <0xcafe2>
 <1><cafe2>: Abbrev Number: 34 (DW_TAG_const_type)
 <1><cafe3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cafe4>   DW_AT_byte_size   : 8
    <cafe4>   DW_AT_type        : <0xcaf7d>
 <1><cafe8>: Abbrev Number: 3 (DW_TAG_typedef)
    <cafe9>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <cafed>   DW_AT_decl_file   : 6
    <cafee>   DW_AT_decl_line   : 22
    <cafef>   DW_AT_decl_column : 15
    <caff0>   DW_AT_type        : <0xcafae>
 <1><caff4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <caff5>   DW_AT_byte_size   : 8
    <caff5>   DW_AT_type        : <0xcaff9>
 <1><caff9>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <caffa>   DW_AT_prototyped  : 1
 <1><caffa>: Abbrev Number: 10 (DW_TAG_structure_type)
    <caffb>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <cafff>   DW_AT_byte_size   : 24
    <cb000>   DW_AT_decl_file   : 7
    <cb001>   DW_AT_decl_line   : 82
    <cb002>   DW_AT_decl_column : 16
    <cb003>   DW_AT_sibling     : <0xcb02f>
 <2><cb007>: Abbrev Number: 2 (DW_TAG_member)
    <cb008>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <cb00c>   DW_AT_decl_file   : 7
    <cb00d>   DW_AT_decl_line   : 83
    <cb00e>   DW_AT_decl_column : 21
    <cb00f>   DW_AT_type        : <0xcaf7d>
    <cb013>   DW_AT_data_member_location: 0
 <2><cb014>: Abbrev Number: 9 (DW_TAG_member)
    <cb015>   DW_AT_name        : len
    <cb019>   DW_AT_decl_file   : 7
    <cb01a>   DW_AT_decl_line   : 84
    <cb01b>   DW_AT_decl_column : 21
    <cb01c>   DW_AT_type        : <0xcafba>
    <cb020>   DW_AT_data_member_location: 8
 <2><cb021>: Abbrev Number: 2 (DW_TAG_member)
    <cb022>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <cb026>   DW_AT_decl_file   : 7
    <cb027>   DW_AT_decl_line   : 85
    <cb028>   DW_AT_decl_column : 21
    <cb029>   DW_AT_type        : <0xcafba>
    <cb02d>   DW_AT_data_member_location: 16
 <2><cb02e>: Abbrev Number: 0
 <1><cb02f>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb030>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <cb034>   DW_AT_decl_file   : 7
    <cb035>   DW_AT_decl_line   : 86
    <cb036>   DW_AT_decl_column : 3
    <cb037>   DW_AT_type        : <0xcaffa>
 <1><cb03b>: Abbrev Number: 7 (DW_TAG_base_type)
    <cb03c>   DW_AT_byte_size   : 8
    <cb03d>   DW_AT_encoding    : 4	(float)
    <cb03e>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><cb042>: Abbrev Number: 7 (DW_TAG_base_type)
    <cb043>   DW_AT_byte_size   : 4
    <cb044>   DW_AT_encoding    : 4	(float)
    <cb045>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><cb049>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb04a>   DW_AT_byte_size   : 8
    <cb04a>   DW_AT_type        : <0xcaf95>
 <1><cb04e>: Abbrev Number: 36 (DW_TAG_enumeration_type)
    <cb04f>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <cb053>   DW_AT_encoding    : 7	(unsigned)
    <cb054>   DW_AT_byte_size   : 4
    <cb055>   DW_AT_type        : <0xcaf39>
    <cb059>   DW_AT_decl_file   : 8
    <cb05a>   DW_AT_decl_line   : 25
    <cb05b>   DW_AT_decl_column : 14
    <cb05c>   DW_AT_sibling     : <0xcb079>
 <2><cb060>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cb061>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <cb065>   DW_AT_const_value : 0
 <2><cb066>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cb067>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <cb06b>   DW_AT_const_value : 1
 <2><cb06c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cb06d>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <cb071>   DW_AT_const_value : 2
 <2><cb072>: Abbrev Number: 13 (DW_TAG_enumerator)
    <cb073>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <cb077>   DW_AT_const_value : 3
 <2><cb078>: Abbrev Number: 0
 <1><cb079>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb07a>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <cb07e>   DW_AT_decl_file   : 8
    <cb07f>   DW_AT_decl_line   : 30
    <cb080>   DW_AT_decl_column : 3
    <cb081>   DW_AT_type        : <0xcb04e>
 <1><cb085>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb086>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <cb08a>   DW_AT_decl_file   : 8
    <cb08b>   DW_AT_decl_line   : 54
    <cb08c>   DW_AT_decl_column : 15
    <cb08d>   DW_AT_type        : <0xcb091>
 <1><cb091>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb092>   DW_AT_byte_size   : 8
    <cb092>   DW_AT_type        : <0xcb096>
 <1><cb096>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb097>   DW_AT_prototyped  : 1
    <cb097>   DW_AT_type        : <0xcaf55>
    <cb09b>   DW_AT_sibling     : <0xcb0aa>
 <2><cb09f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb0a0>   DW_AT_type        : <0xcb0aa>
 <2><cb0a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb0a5>   DW_AT_type        : <0xcaf55>
 <2><cb0a9>: Abbrev Number: 0
 <1><cb0aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb0ab>   DW_AT_byte_size   : 8
    <cb0ab>   DW_AT_type        : <0xcb0af>
 <1><cb0af>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cb0b0>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <cb0b4>   DW_AT_byte_size   : 80
    <cb0b5>   DW_AT_decl_file   : 8
    <cb0b6>   DW_AT_decl_line   : 97
    <cb0b7>   DW_AT_decl_column : 16
    <cb0b8>   DW_AT_sibling     : <0xcb173>
 <2><cb0bc>: Abbrev Number: 2 (DW_TAG_member)
    <cb0bd>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <cb0c1>   DW_AT_decl_file   : 8
    <cb0c2>   DW_AT_decl_line   : 98
    <cb0c3>   DW_AT_decl_column : 21
    <cb0c4>   DW_AT_type        : <0xcaf55>
    <cb0c8>   DW_AT_data_member_location: 0
 <2><cb0c9>: Abbrev Number: 9 (DW_TAG_member)
    <cb0ca>   DW_AT_name        : len
    <cb0ce>   DW_AT_decl_file   : 8
    <cb0cf>   DW_AT_decl_line   : 99
    <cb0d0>   DW_AT_decl_column : 21
    <cb0d1>   DW_AT_type        : <0xcaf55>
    <cb0d5>   DW_AT_data_member_location: 4
 <2><cb0d6>: Abbrev Number: 2 (DW_TAG_member)
    <cb0d7>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <cb0db>   DW_AT_decl_file   : 8
    <cb0dc>   DW_AT_decl_line   : 100
    <cb0dd>   DW_AT_decl_column : 21
    <cb0de>   DW_AT_type        : <0xcb079>
    <cb0e2>   DW_AT_data_member_location: 8
 <2><cb0e3>: Abbrev Number: 2 (DW_TAG_member)
    <cb0e4>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <cb0e8>   DW_AT_decl_file   : 8
    <cb0e9>   DW_AT_decl_line   : 101
    <cb0ea>   DW_AT_decl_column : 21
    <cb0eb>   DW_AT_type        : <0xcafe8>
    <cb0ef>   DW_AT_data_member_location: 16
 <2><cb0f0>: Abbrev Number: 2 (DW_TAG_member)
    <cb0f1>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <cb0f5>   DW_AT_decl_file   : 8
    <cb0f6>   DW_AT_decl_line   : 102
    <cb0f7>   DW_AT_decl_column : 21
    <cb0f8>   DW_AT_type        : <0xcaf55>
    <cb0fc>   DW_AT_data_member_location: 24
 <2><cb0fd>: Abbrev Number: 2 (DW_TAG_member)
    <cb0fe>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <cb102>   DW_AT_decl_file   : 8
    <cb103>   DW_AT_decl_line   : 103
    <cb104>   DW_AT_decl_column : 21
    <cb105>   DW_AT_type        : <0xcaf55>
    <cb109>   DW_AT_data_member_location: 28
 <2><cb10a>: Abbrev Number: 2 (DW_TAG_member)
    <cb10b>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <cb10f>   DW_AT_decl_file   : 8
    <cb110>   DW_AT_decl_line   : 104
    <cb111>   DW_AT_decl_column : 21
    <cb112>   DW_AT_type        : <0xcaf55>
    <cb116>   DW_AT_data_member_location: 32
 <2><cb117>: Abbrev Number: 2 (DW_TAG_member)
    <cb118>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <cb11c>   DW_AT_decl_file   : 8
    <cb11d>   DW_AT_decl_line   : 105
    <cb11e>   DW_AT_decl_column : 21
    <cb11f>   DW_AT_type        : <0xcaf39>
    <cb123>   DW_AT_data_member_location: 36
 <2><cb124>: Abbrev Number: 2 (DW_TAG_member)
    <cb125>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <cb129>   DW_AT_decl_file   : 8
    <cb12a>   DW_AT_decl_line   : 106
    <cb12b>   DW_AT_decl_column : 21
    <cb12c>   DW_AT_type        : <0xcaf39>
    <cb130>   DW_AT_data_member_location: 40
 <2><cb131>: Abbrev Number: 2 (DW_TAG_member)
    <cb132>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <cb136>   DW_AT_decl_file   : 8
    <cb137>   DW_AT_decl_line   : 109
    <cb138>   DW_AT_decl_column : 21
    <cb139>   DW_AT_type        : <0xcafcd>
    <cb13d>   DW_AT_data_member_location: 44
 <2><cb13e>: Abbrev Number: 2 (DW_TAG_member)
    <cb13f>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <cb143>   DW_AT_decl_file   : 8
    <cb144>   DW_AT_decl_line   : 110
    <cb145>   DW_AT_decl_column : 21
    <cb146>   DW_AT_type        : <0xcaf89>
    <cb14a>   DW_AT_data_member_location: 48
 <2><cb14b>: Abbrev Number: 2 (DW_TAG_member)
    <cb14c>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <cb150>   DW_AT_decl_file   : 8
    <cb151>   DW_AT_decl_line   : 112
    <cb152>   DW_AT_decl_column : 22
    <cb153>   DW_AT_type        : <0xcb40b>
    <cb157>   DW_AT_data_member_location: 56
 <2><cb158>: Abbrev Number: 2 (DW_TAG_member)
    <cb159>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <cb15d>   DW_AT_decl_file   : 8
    <cb15e>   DW_AT_decl_line   : 114
    <cb15f>   DW_AT_decl_column : 14
    <cb160>   DW_AT_type        : <0xcaf6f>
    <cb164>   DW_AT_data_member_location: 64
 <2><cb165>: Abbrev Number: 2 (DW_TAG_member)
    <cb166>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <cb16a>   DW_AT_decl_file   : 8
    <cb16b>   DW_AT_decl_line   : 116
    <cb16c>   DW_AT_decl_column : 22
    <cb16d>   DW_AT_type        : <0xcb0aa>
    <cb171>   DW_AT_data_member_location: 72
 <2><cb172>: Abbrev Number: 0
 <1><cb173>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb174>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <cb178>   DW_AT_decl_file   : 8
    <cb179>   DW_AT_decl_line   : 59
    <cb17a>   DW_AT_decl_column : 15
    <cb17b>   DW_AT_type        : <0xcb17f>
 <1><cb17f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb180>   DW_AT_byte_size   : 8
    <cb180>   DW_AT_type        : <0xcb184>
 <1><cb184>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb185>   DW_AT_prototyped  : 1
    <cb185>   DW_AT_type        : <0xcaf55>
    <cb189>   DW_AT_sibling     : <0xcb193>
 <2><cb18d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb18e>   DW_AT_type        : <0xcb0aa>
 <2><cb192>: Abbrev Number: 0
 <1><cb193>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb194>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <cb198>   DW_AT_decl_file   : 8
    <cb199>   DW_AT_decl_line   : 60
    <cb19a>   DW_AT_decl_column : 15
    <cb19b>   DW_AT_type        : <0xcb17f>
 <1><cb19f>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb1a0>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <cb1a4>   DW_AT_decl_file   : 8
    <cb1a5>   DW_AT_decl_line   : 61
    <cb1a6>   DW_AT_decl_column : 15
    <cb1a7>   DW_AT_type        : <0xcb1ab>
 <1><cb1ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb1ac>   DW_AT_byte_size   : 8
    <cb1ac>   DW_AT_type        : <0xcb1b0>
 <1><cb1b0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb1b1>   DW_AT_prototyped  : 1
    <cb1b1>   DW_AT_type        : <0xcaf55>
    <cb1b5>   DW_AT_sibling     : <0xcb1c9>
 <2><cb1b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb1ba>   DW_AT_type        : <0xcb0aa>
 <2><cb1be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb1bf>   DW_AT_type        : <0xcafe8>
 <2><cb1c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb1c4>   DW_AT_type        : <0xcaf55>
 <2><cb1c8>: Abbrev Number: 0
 <1><cb1c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb1ca>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <cb1ce>   DW_AT_decl_file   : 8
    <cb1cf>   DW_AT_decl_line   : 62
    <cb1d0>   DW_AT_decl_column : 15
    <cb1d1>   DW_AT_type        : <0xcb1d5>
 <1><cb1d5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb1d6>   DW_AT_byte_size   : 8
    <cb1d6>   DW_AT_type        : <0xcb1da>
 <1><cb1da>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb1db>   DW_AT_prototyped  : 1
    <cb1db>   DW_AT_type        : <0xcaf55>
    <cb1df>   DW_AT_sibling     : <0xcb1ee>
 <2><cb1e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb1e4>   DW_AT_type        : <0xcb0aa>
 <2><cb1e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb1e9>   DW_AT_type        : <0xcb1ee>
 <2><cb1ed>: Abbrev Number: 0
 <1><cb1ee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb1ef>   DW_AT_byte_size   : 8
    <cb1ef>   DW_AT_type        : <0xcafe8>
 <1><cb1f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb1f4>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <cb1f8>   DW_AT_decl_file   : 8
    <cb1f9>   DW_AT_decl_line   : 63
    <cb1fa>   DW_AT_decl_column : 15
    <cb1fb>   DW_AT_type        : <0xcb1ff>
 <1><cb1ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb200>   DW_AT_byte_size   : 8
    <cb200>   DW_AT_type        : <0xcb204>
 <1><cb204>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb205>   DW_AT_prototyped  : 1
    <cb205>   DW_AT_type        : <0xcaf55>
    <cb209>   DW_AT_sibling     : <0xcb21d>
 <2><cb20d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb20e>   DW_AT_type        : <0xcb0aa>
 <2><cb212>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb213>   DW_AT_type        : <0xcaf6f>
 <2><cb217>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb218>   DW_AT_type        : <0xcb21d>
 <2><cb21c>: Abbrev Number: 0
 <1><cb21d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb21e>   DW_AT_byte_size   : 8
    <cb21e>   DW_AT_type        : <0xcaf89>
 <1><cb222>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb223>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <cb227>   DW_AT_decl_file   : 8
    <cb228>   DW_AT_decl_line   : 65
    <cb229>   DW_AT_decl_column : 15
    <cb22a>   DW_AT_type        : <0xcb22e>
 <1><cb22e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb22f>   DW_AT_byte_size   : 8
    <cb22f>   DW_AT_type        : <0xcb233>
 <1><cb233>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb234>   DW_AT_prototyped  : 1
    <cb234>   DW_AT_type        : <0xcaf55>
    <cb238>   DW_AT_sibling     : <0xcb24c>
 <2><cb23c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb23d>   DW_AT_type        : <0xcb0aa>
 <2><cb241>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb242>   DW_AT_type        : <0xcb049>
 <2><cb246>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb247>   DW_AT_type        : <0xcb21d>
 <2><cb24b>: Abbrev Number: 0
 <1><cb24c>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb24d>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <cb251>   DW_AT_decl_file   : 8
    <cb252>   DW_AT_decl_line   : 67
    <cb253>   DW_AT_decl_column : 15
    <cb254>   DW_AT_type        : <0xcb258>
 <1><cb258>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb259>   DW_AT_byte_size   : 8
    <cb259>   DW_AT_type        : <0xcb25d>
 <1><cb25d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb25e>   DW_AT_prototyped  : 1
    <cb25e>   DW_AT_type        : <0xcaf55>
    <cb262>   DW_AT_sibling     : <0xcb276>
 <2><cb266>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb267>   DW_AT_type        : <0xcb0aa>
 <2><cb26b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb26c>   DW_AT_type        : <0xcafdd>
 <2><cb270>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb271>   DW_AT_type        : <0xcaf89>
 <2><cb275>: Abbrev Number: 0
 <1><cb276>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb277>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <cb27b>   DW_AT_decl_file   : 8
    <cb27c>   DW_AT_decl_line   : 69
    <cb27d>   DW_AT_decl_column : 15
    <cb27e>   DW_AT_type        : <0xcb282>
 <1><cb282>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb283>   DW_AT_byte_size   : 8
    <cb283>   DW_AT_type        : <0xcb287>
 <1><cb287>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb288>   DW_AT_prototyped  : 1
    <cb288>   DW_AT_type        : <0xcaf55>
    <cb28c>   DW_AT_sibling     : <0xcb2a0>
 <2><cb290>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb291>   DW_AT_type        : <0xcb0aa>
 <2><cb295>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb296>   DW_AT_type        : <0xcb2a0>
 <2><cb29a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb29b>   DW_AT_type        : <0xcaf89>
 <2><cb29f>: Abbrev Number: 0
 <1><cb2a0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb2a1>   DW_AT_byte_size   : 8
    <cb2a1>   DW_AT_type        : <0xcafa2>
 <1><cb2a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb2a6>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <cb2aa>   DW_AT_decl_file   : 8
    <cb2ab>   DW_AT_decl_line   : 71
    <cb2ac>   DW_AT_decl_column : 15
    <cb2ad>   DW_AT_type        : <0xcb2b1>
 <1><cb2b1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb2b2>   DW_AT_byte_size   : 8
    <cb2b2>   DW_AT_type        : <0xcb2b6>
 <1><cb2b6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb2b7>   DW_AT_prototyped  : 1
    <cb2b7>   DW_AT_type        : <0xcaf55>
    <cb2bb>   DW_AT_sibling     : <0xcb2cf>
 <2><cb2bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb2c0>   DW_AT_type        : <0xcb0aa>
 <2><cb2c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb2c5>   DW_AT_type        : <0xcafe8>
 <2><cb2c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb2ca>   DW_AT_type        : <0xcafe8>
 <2><cb2ce>: Abbrev Number: 0
 <1><cb2cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb2d0>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <cb2d4>   DW_AT_decl_file   : 8
    <cb2d5>   DW_AT_decl_line   : 73
    <cb2d6>   DW_AT_decl_column : 15
    <cb2d7>   DW_AT_type        : <0xcb2b1>
 <1><cb2db>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb2dc>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <cb2e0>   DW_AT_decl_file   : 8
    <cb2e1>   DW_AT_decl_line   : 75
    <cb2e2>   DW_AT_decl_column : 15
    <cb2e3>   DW_AT_type        : <0xcb2e7>
 <1><cb2e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb2e8>   DW_AT_byte_size   : 8
    <cb2e8>   DW_AT_type        : <0xcb2ec>
 <1><cb2ec>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb2ed>   DW_AT_prototyped  : 1
    <cb2ed>   DW_AT_type        : <0xcaf55>
    <cb2f1>   DW_AT_sibling     : <0xcb300>
 <2><cb2f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb2f6>   DW_AT_type        : <0xcb0aa>
 <2><cb2fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb2fb>   DW_AT_type        : <0xcb300>
 <2><cb2ff>: Abbrev Number: 0
 <1><cb300>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb301>   DW_AT_byte_size   : 8
    <cb301>   DW_AT_type        : <0xcb02f>
 <1><cb305>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb306>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <cb30a>   DW_AT_decl_file   : 8
    <cb30b>   DW_AT_decl_line   : 76
    <cb30c>   DW_AT_decl_column : 15
    <cb30d>   DW_AT_type        : <0xcb311>
 <1><cb311>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb312>   DW_AT_byte_size   : 8
    <cb312>   DW_AT_type        : <0xcb316>
 <1><cb316>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb317>   DW_AT_prototyped  : 1
    <cb317>   DW_AT_type        : <0xcaf55>
    <cb31b>   DW_AT_sibling     : <0xcb32f>
 <2><cb31f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb320>   DW_AT_type        : <0xcb0aa>
 <2><cb324>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb325>   DW_AT_type        : <0xcb049>
 <2><cb329>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb32a>   DW_AT_type        : <0xcafba>
 <2><cb32e>: Abbrev Number: 0
 <1><cb32f>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb330>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <cb334>   DW_AT_decl_file   : 8
    <cb335>   DW_AT_decl_line   : 77
    <cb336>   DW_AT_decl_column : 15
    <cb337>   DW_AT_type        : <0xcb17f>
 <1><cb33b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cb33c>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <cb340>   DW_AT_byte_size   : 112
    <cb341>   DW_AT_decl_file   : 8
    <cb342>   DW_AT_decl_line   : 80
    <cb343>   DW_AT_decl_column : 16
    <cb344>   DW_AT_sibling     : <0xcb3ff>
 <2><cb348>: Abbrev Number: 2 (DW_TAG_member)
    <cb349>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <cb34d>   DW_AT_decl_file   : 8
    <cb34e>   DW_AT_decl_line   : 81
    <cb34f>   DW_AT_decl_column : 25
    <cb350>   DW_AT_type        : <0xcb173>
    <cb354>   DW_AT_data_member_location: 0
 <2><cb355>: Abbrev Number: 2 (DW_TAG_member)
    <cb356>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <cb35a>   DW_AT_decl_file   : 8
    <cb35b>   DW_AT_decl_line   : 82
    <cb35c>   DW_AT_decl_column : 25
    <cb35d>   DW_AT_type        : <0xcb193>
    <cb361>   DW_AT_data_member_location: 8
 <2><cb362>: Abbrev Number: 2 (DW_TAG_member)
    <cb363>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <cb367>   DW_AT_decl_file   : 8
    <cb368>   DW_AT_decl_line   : 83
    <cb369>   DW_AT_decl_column : 25
    <cb36a>   DW_AT_type        : <0xcb19f>
    <cb36e>   DW_AT_data_member_location: 16
 <2><cb36f>: Abbrev Number: 2 (DW_TAG_member)
    <cb370>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <cb374>   DW_AT_decl_file   : 8
    <cb375>   DW_AT_decl_line   : 84
    <cb376>   DW_AT_decl_column : 25
    <cb377>   DW_AT_type        : <0xcb1c9>
    <cb37b>   DW_AT_data_member_location: 24
 <2><cb37c>: Abbrev Number: 2 (DW_TAG_member)
    <cb37d>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <cb381>   DW_AT_decl_file   : 8
    <cb382>   DW_AT_decl_line   : 85
    <cb383>   DW_AT_decl_column : 25
    <cb384>   DW_AT_type        : <0xcb1f3>
    <cb388>   DW_AT_data_member_location: 32
 <2><cb389>: Abbrev Number: 2 (DW_TAG_member)
    <cb38a>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <cb38e>   DW_AT_decl_file   : 8
    <cb38f>   DW_AT_decl_line   : 86
    <cb390>   DW_AT_decl_column : 25
    <cb391>   DW_AT_type        : <0xcb222>
    <cb395>   DW_AT_data_member_location: 40
 <2><cb396>: Abbrev Number: 2 (DW_TAG_member)
    <cb397>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <cb39b>   DW_AT_decl_file   : 8
    <cb39c>   DW_AT_decl_line   : 87
    <cb39d>   DW_AT_decl_column : 25
    <cb39e>   DW_AT_type        : <0xcb24c>
    <cb3a2>   DW_AT_data_member_location: 48
 <2><cb3a3>: Abbrev Number: 2 (DW_TAG_member)
    <cb3a4>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <cb3a8>   DW_AT_decl_file   : 8
    <cb3a9>   DW_AT_decl_line   : 88
    <cb3aa>   DW_AT_decl_column : 25
    <cb3ab>   DW_AT_type        : <0xcb276>
    <cb3af>   DW_AT_data_member_location: 56
 <2><cb3b0>: Abbrev Number: 2 (DW_TAG_member)
    <cb3b1>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <cb3b5>   DW_AT_decl_file   : 8
    <cb3b6>   DW_AT_decl_line   : 89
    <cb3b7>   DW_AT_decl_column : 25
    <cb3b8>   DW_AT_type        : <0xcb2a5>
    <cb3bc>   DW_AT_data_member_location: 64
 <2><cb3bd>: Abbrev Number: 2 (DW_TAG_member)
    <cb3be>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <cb3c2>   DW_AT_decl_file   : 8
    <cb3c3>   DW_AT_decl_line   : 90
    <cb3c4>   DW_AT_decl_column : 25
    <cb3c5>   DW_AT_type        : <0xcb2cf>
    <cb3c9>   DW_AT_data_member_location: 72
 <2><cb3ca>: Abbrev Number: 2 (DW_TAG_member)
    <cb3cb>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <cb3cf>   DW_AT_decl_file   : 8
    <cb3d0>   DW_AT_decl_line   : 91
    <cb3d1>   DW_AT_decl_column : 25
    <cb3d2>   DW_AT_type        : <0xcb2db>
    <cb3d6>   DW_AT_data_member_location: 80
 <2><cb3d7>: Abbrev Number: 2 (DW_TAG_member)
    <cb3d8>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <cb3dc>   DW_AT_decl_file   : 8
    <cb3dd>   DW_AT_decl_line   : 92
    <cb3de>   DW_AT_decl_column : 25
    <cb3df>   DW_AT_type        : <0xcb305>
    <cb3e3>   DW_AT_data_member_location: 88
 <2><cb3e4>: Abbrev Number: 2 (DW_TAG_member)
    <cb3e5>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <cb3e9>   DW_AT_decl_file   : 8
    <cb3ea>   DW_AT_decl_line   : 93
    <cb3eb>   DW_AT_decl_column : 25
    <cb3ec>   DW_AT_type        : <0xcb085>
    <cb3f0>   DW_AT_data_member_location: 96
 <2><cb3f1>: Abbrev Number: 2 (DW_TAG_member)
    <cb3f2>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <cb3f6>   DW_AT_decl_file   : 8
    <cb3f7>   DW_AT_decl_line   : 94
    <cb3f8>   DW_AT_decl_column : 25
    <cb3f9>   DW_AT_type        : <0xcb32f>
    <cb3fd>   DW_AT_data_member_location: 104
 <2><cb3fe>: Abbrev Number: 0
 <1><cb3ff>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb400>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <cb404>   DW_AT_decl_file   : 8
    <cb405>   DW_AT_decl_line   : 95
    <cb406>   DW_AT_decl_column : 3
    <cb407>   DW_AT_type        : <0xcb33b>
 <1><cb40b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb40c>   DW_AT_byte_size   : 8
    <cb40c>   DW_AT_type        : <0xcb3ff>
 <1><cb410>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb411>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <cb415>   DW_AT_decl_file   : 8
    <cb416>   DW_AT_decl_line   : 117
    <cb417>   DW_AT_decl_column : 3
    <cb418>   DW_AT_type        : <0xcb0af>
 <1><cb41c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb41d>   DW_AT_byte_size   : 8
    <cb41d>   DW_AT_type        : <0xcb410>
 <1><cb421>: Abbrev Number: 20 (DW_TAG_structure_type)
    <cb422>   DW_AT_byte_size   : 8
    <cb423>   DW_AT_decl_file   : 9
    <cb423>   DW_AT_decl_line   : 4
    <cb424>   DW_AT_decl_column : 3
    <cb424>   DW_AT_sibling     : <0xcb443>
 <2><cb428>: Abbrev Number: 2 (DW_TAG_member)
    <cb429>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <cb42d>   DW_AT_decl_file   : 9
    <cb42e>   DW_AT_decl_line   : 5
    <cb42f>   DW_AT_decl_column : 8
    <cb430>   DW_AT_type        : <0xcaf55>
    <cb434>   DW_AT_data_member_location: 0
 <2><cb435>: Abbrev Number: 2 (DW_TAG_member)
    <cb436>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <cb43a>   DW_AT_decl_file   : 9
    <cb43b>   DW_AT_decl_line   : 6
    <cb43c>   DW_AT_decl_column : 8
    <cb43d>   DW_AT_type        : <0xcaf55>
    <cb441>   DW_AT_data_member_location: 4
 <2><cb442>: Abbrev Number: 0
 <1><cb443>: Abbrev Number: 20 (DW_TAG_structure_type)
    <cb444>   DW_AT_byte_size   : 16
    <cb445>   DW_AT_decl_file   : 9
    <cb445>   DW_AT_decl_line   : 8
    <cb446>   DW_AT_decl_column : 3
    <cb446>   DW_AT_sibling     : <0xcb479>
 <2><cb44a>: Abbrev Number: 9 (DW_TAG_member)
    <cb44b>   DW_AT_name        : x
    <cb44d>   DW_AT_decl_file   : 9
    <cb44e>   DW_AT_decl_line   : 9
    <cb44f>   DW_AT_decl_column : 8
    <cb450>   DW_AT_type        : <0xcaf55>
    <cb454>   DW_AT_data_member_location: 0
 <2><cb455>: Abbrev Number: 9 (DW_TAG_member)
    <cb456>   DW_AT_name        : y
    <cb458>   DW_AT_decl_file   : 9
    <cb459>   DW_AT_decl_line   : 9
    <cb45a>   DW_AT_decl_column : 11
    <cb45b>   DW_AT_type        : <0xcaf55>
    <cb45f>   DW_AT_data_member_location: 4
 <2><cb460>: Abbrev Number: 9 (DW_TAG_member)
    <cb461>   DW_AT_name        : dx
    <cb464>   DW_AT_decl_file   : 9
    <cb465>   DW_AT_decl_line   : 10
    <cb466>   DW_AT_decl_column : 8
    <cb467>   DW_AT_type        : <0xcaf55>
    <cb46b>   DW_AT_data_member_location: 8
 <2><cb46c>: Abbrev Number: 9 (DW_TAG_member)
    <cb46d>   DW_AT_name        : dy
    <cb470>   DW_AT_decl_file   : 9
    <cb471>   DW_AT_decl_line   : 10
    <cb472>   DW_AT_decl_column : 12
    <cb473>   DW_AT_type        : <0xcaf55>
    <cb477>   DW_AT_data_member_location: 12
 <2><cb478>: Abbrev Number: 0
 <1><cb479>: Abbrev Number: 37 (DW_TAG_union_type)
    <cb47a>   DW_AT_byte_size   : 16
    <cb47b>   DW_AT_decl_file   : 9
    <cb47c>   DW_AT_decl_line   : 3
    <cb47d>   DW_AT_decl_column : 2
    <cb47e>   DW_AT_sibling     : <0xcb4a9>
 <2><cb482>: Abbrev Number: 21 (DW_TAG_member)
    <cb483>   DW_AT_type        : <0xcb421>
 <2><cb487>: Abbrev Number: 21 (DW_TAG_member)
    <cb488>   DW_AT_type        : <0xcb443>
 <2><cb48c>: Abbrev Number: 38 (DW_TAG_member)
    <cb48d>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <cb491>   DW_AT_decl_file   : 9
    <cb492>   DW_AT_decl_line   : 12
    <cb493>   DW_AT_decl_column : 7
    <cb494>   DW_AT_type        : <0xcaf55>
 <2><cb498>: Abbrev Number: 22 (DW_TAG_member)
    <cb499>   DW_AT_name        : z
    <cb49b>   DW_AT_decl_file   : 9
    <cb49b>   DW_AT_decl_line   : 13
    <cb49c>   DW_AT_decl_column : 7
    <cb49c>   DW_AT_type        : <0xcaf55>
 <2><cb4a0>: Abbrev Number: 22 (DW_TAG_member)
    <cb4a1>   DW_AT_name        : w
    <cb4a3>   DW_AT_decl_file   : 9
    <cb4a3>   DW_AT_decl_line   : 14
    <cb4a4>   DW_AT_decl_column : 7
    <cb4a4>   DW_AT_type        : <0xcaf55>
 <2><cb4a8>: Abbrev Number: 0
 <1><cb4a9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cb4aa>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <cb4ae>   DW_AT_byte_size   : 20
    <cb4af>   DW_AT_decl_file   : 9
    <cb4b0>   DW_AT_decl_line   : 1
    <cb4b1>   DW_AT_decl_column : 8
    <cb4b2>   DW_AT_sibling     : <0xcb4ca>
 <2><cb4b6>: Abbrev Number: 2 (DW_TAG_member)
    <cb4b7>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <cb4bb>   DW_AT_decl_file   : 9
    <cb4bc>   DW_AT_decl_line   : 2
    <cb4bd>   DW_AT_decl_column : 6
    <cb4be>   DW_AT_type        : <0xcaf55>
    <cb4c2>   DW_AT_data_member_location: 0
 <2><cb4c3>: Abbrev Number: 39 (DW_TAG_member)
    <cb4c4>   DW_AT_type        : <0xcb479>
    <cb4c8>   DW_AT_data_member_location: 4
 <2><cb4c9>: Abbrev Number: 0
 <1><cb4ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb4cb>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <cb4cf>   DW_AT_decl_file   : 9
    <cb4d0>   DW_AT_decl_line   : 18
    <cb4d1>   DW_AT_decl_column : 23
    <cb4d2>   DW_AT_type        : <0xcb4a9>
 <1><cb4d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb4d7>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <cb4db>   DW_AT_decl_file   : 10
    <cb4dc>   DW_AT_decl_line   : 1
    <cb4dd>   DW_AT_decl_column : 23
    <cb4de>   DW_AT_type        : <0xcb4e2>
 <1><cb4e2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb4e3>   DW_AT_byte_size   : 8
    <cb4e3>   DW_AT_type        : <0xcb4e7>
 <1><cb4e7>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <cb4e8>   DW_AT_prototyped  : 1
    <cb4e8>   DW_AT_type        : <0xcb300>
 <1><cb4ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb4ed>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <cb4f1>   DW_AT_decl_file   : 10
    <cb4f2>   DW_AT_decl_line   : 2
    <cb4f3>   DW_AT_decl_column : 23
    <cb4f4>   DW_AT_type        : <0xcb4f8>
 <1><cb4f8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb4f9>   DW_AT_byte_size   : 8
    <cb4f9>   DW_AT_type        : <0xcb4fd>
 <1><cb4fd>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <cb4fe>   DW_AT_prototyped  : 1
    <cb4fe>   DW_AT_type        : <0xcaf55>
 <1><cb502>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb503>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <cb507>   DW_AT_decl_file   : 10
    <cb508>   DW_AT_decl_line   : 3
    <cb509>   DW_AT_decl_column : 23
    <cb50a>   DW_AT_type        : <0xcb4f8>
 <1><cb50e>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb50f>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <cb513>   DW_AT_decl_file   : 10
    <cb514>   DW_AT_decl_line   : 10
    <cb515>   DW_AT_decl_column : 23
    <cb516>   DW_AT_type        : <0xcb51a>
 <1><cb51a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb51b>   DW_AT_byte_size   : 8
    <cb51b>   DW_AT_type        : <0xcb51f>
 <1><cb51f>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cb520>   DW_AT_prototyped  : 1
    <cb520>   DW_AT_sibling     : <0xcb52a>
 <2><cb524>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb525>   DW_AT_type        : <0xcaf55>
 <2><cb529>: Abbrev Number: 0
 <1><cb52a>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb52b>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <cb52f>   DW_AT_decl_file   : 10
    <cb530>   DW_AT_decl_line   : 14
    <cb531>   DW_AT_decl_column : 23
    <cb532>   DW_AT_type        : <0xcb536>
 <1><cb536>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb537>   DW_AT_byte_size   : 8
    <cb537>   DW_AT_type        : <0xcb53b>
 <1><cb53b>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb53c>   DW_AT_prototyped  : 1
    <cb53c>   DW_AT_type        : <0xcaf55>
    <cb540>   DW_AT_sibling     : <0xcb554>
 <2><cb544>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb545>   DW_AT_type        : <0xcaf55>
 <2><cb549>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb54a>   DW_AT_type        : <0xcaf55>
 <2><cb54e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb54f>   DW_AT_type        : <0xcaf55>
 <2><cb553>: Abbrev Number: 0
 <1><cb554>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb555>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <cb559>   DW_AT_decl_file   : 10
    <cb55a>   DW_AT_decl_line   : 18
    <cb55b>   DW_AT_decl_column : 23
    <cb55c>   DW_AT_type        : <0xcb536>
 <1><cb560>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb561>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <cb565>   DW_AT_decl_file   : 10
    <cb566>   DW_AT_decl_line   : 24
    <cb567>   DW_AT_decl_column : 23
    <cb568>   DW_AT_type        : <0xcaff4>
 <1><cb56c>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb56d>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <cb571>   DW_AT_decl_file   : 10
    <cb572>   DW_AT_decl_line   : 28
    <cb573>   DW_AT_decl_column : 23
    <cb574>   DW_AT_type        : <0xcb578>
 <1><cb578>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb579>   DW_AT_byte_size   : 8
    <cb579>   DW_AT_type        : <0xcb57d>
 <1><cb57d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb57e>   DW_AT_prototyped  : 1
    <cb57e>   DW_AT_type        : <0xcaf55>
    <cb582>   DW_AT_sibling     : <0xcb591>
 <2><cb586>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb587>   DW_AT_type        : <0xcaf55>
 <2><cb58b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb58c>   DW_AT_type        : <0xcaf55>
 <2><cb590>: Abbrev Number: 0
 <1><cb591>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb592>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <cb596>   DW_AT_decl_file   : 10
    <cb597>   DW_AT_decl_line   : 34
    <cb598>   DW_AT_decl_column : 23
    <cb599>   DW_AT_type        : <0xcb4f8>
 <1><cb59d>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb59e>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <cb5a2>   DW_AT_decl_file   : 10
    <cb5a3>   DW_AT_decl_line   : 35
    <cb5a4>   DW_AT_decl_column : 23
    <cb5a5>   DW_AT_type        : <0xcb4f8>
 <1><cb5a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb5aa>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <cb5ae>   DW_AT_decl_file   : 10
    <cb5af>   DW_AT_decl_line   : 36
    <cb5b0>   DW_AT_decl_column : 23
    <cb5b1>   DW_AT_type        : <0xcb5b5>
 <1><cb5b5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb5b6>   DW_AT_byte_size   : 8
    <cb5b6>   DW_AT_type        : <0xcb5ba>
 <1><cb5ba>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cb5bb>   DW_AT_prototyped  : 1
    <cb5bb>   DW_AT_sibling     : <0xcb5ca>
 <2><cb5bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb5c0>   DW_AT_type        : <0xcb5ca>
 <2><cb5c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb5c5>   DW_AT_type        : <0xcb5ca>
 <2><cb5c9>: Abbrev Number: 0
 <1><cb5ca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb5cb>   DW_AT_byte_size   : 8
    <cb5cb>   DW_AT_type        : <0xcaf55>
 <1><cb5cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb5d0>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <cb5d4>   DW_AT_decl_file   : 10
    <cb5d5>   DW_AT_decl_line   : 37
    <cb5d6>   DW_AT_decl_column : 23
    <cb5d7>   DW_AT_type        : <0xcb5b5>
 <1><cb5db>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb5dc>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <cb5e0>   DW_AT_decl_file   : 10
    <cb5e1>   DW_AT_decl_line   : 45
    <cb5e2>   DW_AT_decl_column : 24
    <cb5e3>   DW_AT_type        : <0xcb5e7>
 <1><cb5e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb5e8>   DW_AT_byte_size   : 8
    <cb5e8>   DW_AT_type        : <0xcb5ec>
 <1><cb5ec>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb5ed>   DW_AT_prototyped  : 1
    <cb5ed>   DW_AT_type        : <0xcaf39>
    <cb5f1>   DW_AT_sibling     : <0xcb605>
 <2><cb5f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb5f6>   DW_AT_type        : <0xcaf55>
 <2><cb5fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb5fb>   DW_AT_type        : <0xcaf55>
 <2><cb5ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb600>   DW_AT_type        : <0xcaf55>
 <2><cb604>: Abbrev Number: 0
 <1><cb605>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb606>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <cb60a>   DW_AT_decl_file   : 10
    <cb60b>   DW_AT_decl_line   : 48
    <cb60c>   DW_AT_decl_column : 23
    <cb60d>   DW_AT_type        : <0xcb611>
 <1><cb611>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb612>   DW_AT_byte_size   : 8
    <cb612>   DW_AT_type        : <0xcb616>
 <1><cb616>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cb617>   DW_AT_prototyped  : 1
    <cb617>   DW_AT_sibling     : <0xcb62b>
 <2><cb61b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb61c>   DW_AT_type        : <0xcafdd>
 <2><cb620>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb621>   DW_AT_type        : <0xcaf89>
 <2><cb625>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb626>   DW_AT_type        : <0xcaf55>
 <2><cb62a>: Abbrev Number: 0
 <1><cb62b>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb62c>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <cb630>   DW_AT_decl_file   : 10
    <cb631>   DW_AT_decl_line   : 49
    <cb632>   DW_AT_decl_column : 23
    <cb633>   DW_AT_type        : <0xcb637>
 <1><cb637>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb638>   DW_AT_byte_size   : 8
    <cb638>   DW_AT_type        : <0xcb63c>
 <1><cb63c>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cb63d>   DW_AT_prototyped  : 1
    <cb63d>   DW_AT_sibling     : <0xcb651>
 <2><cb641>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb642>   DW_AT_type        : <0xcb2a0>
 <2><cb646>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb647>   DW_AT_type        : <0xcaf89>
 <2><cb64b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb64c>   DW_AT_type        : <0xcaf55>
 <2><cb650>: Abbrev Number: 0
 <1><cb651>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb652>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <cb656>   DW_AT_decl_file   : 10
    <cb657>   DW_AT_decl_line   : 51
    <cb658>   DW_AT_decl_column : 24
    <cb659>   DW_AT_type        : <0xcb65d>
 <1><cb65d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb65e>   DW_AT_byte_size   : 8
    <cb65e>   DW_AT_type        : <0xcb662>
 <1><cb662>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb663>   DW_AT_prototyped  : 1
    <cb663>   DW_AT_type        : <0xcaf7d>
    <cb667>   DW_AT_sibling     : <0xcb676>
 <2><cb66b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb66c>   DW_AT_type        : <0xcaf7d>
 <2><cb670>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb671>   DW_AT_type        : <0xcafba>
 <2><cb675>: Abbrev Number: 0
 <1><cb676>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb677>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <cb67b>   DW_AT_decl_file   : 10
    <cb67c>   DW_AT_decl_line   : 54
    <cb67d>   DW_AT_decl_column : 23
    <cb67e>   DW_AT_type        : <0xcb682>
 <1><cb682>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb683>   DW_AT_byte_size   : 8
    <cb683>   DW_AT_type        : <0xcb687>
 <1><cb687>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb688>   DW_AT_prototyped  : 1
    <cb688>   DW_AT_type        : <0xcaf55>
    <cb68c>   DW_AT_sibling     : <0xcb6af>
 <2><cb690>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb691>   DW_AT_type        : <0xcb300>
 <2><cb695>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb696>   DW_AT_type        : <0xcaf6f>
 <2><cb69a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb69b>   DW_AT_type        : <0xcafba>
 <2><cb69f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6a0>   DW_AT_type        : <0xcaf55>
 <2><cb6a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6a5>   DW_AT_type        : <0xcaf55>
 <2><cb6a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6aa>   DW_AT_type        : <0xcaf55>
 <2><cb6ae>: Abbrev Number: 0
 <1><cb6af>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb6b0>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <cb6b4>   DW_AT_decl_file   : 10
    <cb6b5>   DW_AT_decl_line   : 56
    <cb6b6>   DW_AT_decl_column : 23
    <cb6b7>   DW_AT_type        : <0xcb6bb>
 <1><cb6bb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb6bc>   DW_AT_byte_size   : 8
    <cb6bc>   DW_AT_type        : <0xcb6c0>
 <1><cb6c0>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb6c1>   DW_AT_prototyped  : 1
    <cb6c1>   DW_AT_type        : <0xcaf55>
    <cb6c5>   DW_AT_sibling     : <0xcb6e3>
 <2><cb6c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6ca>   DW_AT_type        : <0xcb2a0>
 <2><cb6ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6cf>   DW_AT_type        : <0xcb049>
 <2><cb6d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6d4>   DW_AT_type        : <0xcafba>
 <2><cb6d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6d9>   DW_AT_type        : <0xcaf55>
 <2><cb6dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6de>   DW_AT_type        : <0xcaf55>
 <2><cb6e2>: Abbrev Number: 0
 <1><cb6e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb6e4>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <cb6e8>   DW_AT_decl_file   : 10
    <cb6e9>   DW_AT_decl_line   : 67
    <cb6ea>   DW_AT_decl_column : 23
    <cb6eb>   DW_AT_type        : <0xcb6ef>
 <1><cb6ef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb6f0>   DW_AT_byte_size   : 8
    <cb6f0>   DW_AT_type        : <0xcb6f4>
 <1><cb6f4>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb6f5>   DW_AT_prototyped  : 1
    <cb6f5>   DW_AT_type        : <0xcaf55>
    <cb6f9>   DW_AT_sibling     : <0xcb703>
 <2><cb6fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb6fe>   DW_AT_type        : <0xcaf55>
 <2><cb702>: Abbrev Number: 0
 <1><cb703>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb704>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <cb708>   DW_AT_decl_file   : 10
    <cb709>   DW_AT_decl_line   : 68
    <cb70a>   DW_AT_decl_column : 23
    <cb70b>   DW_AT_type        : <0xcb70f>
 <1><cb70f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb710>   DW_AT_byte_size   : 8
    <cb710>   DW_AT_type        : <0xcb714>
 <1><cb714>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb715>   DW_AT_prototyped  : 1
    <cb715>   DW_AT_type        : <0xcaf55>
    <cb719>   DW_AT_sibling     : <0xcb737>
 <2><cb71d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb71e>   DW_AT_type        : <0xcb5ca>
 <2><cb722>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb723>   DW_AT_type        : <0xcb5ca>
 <2><cb727>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb728>   DW_AT_type        : <0xcb5ca>
 <2><cb72c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb72d>   DW_AT_type        : <0xcb5ca>
 <2><cb731>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb732>   DW_AT_type        : <0xcb5ca>
 <2><cb736>: Abbrev Number: 0
 <1><cb737>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb738>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <cb73c>   DW_AT_decl_file   : 10
    <cb73d>   DW_AT_decl_line   : 69
    <cb73e>   DW_AT_decl_column : 23
    <cb73f>   DW_AT_type        : <0xcb743>
 <1><cb743>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb744>   DW_AT_byte_size   : 8
    <cb744>   DW_AT_type        : <0xcb748>
 <1><cb748>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb749>   DW_AT_prototyped  : 1
    <cb749>   DW_AT_type        : <0xcaf55>
    <cb74d>   DW_AT_sibling     : <0xcb766>
 <2><cb751>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb752>   DW_AT_type        : <0xcaf55>
 <2><cb756>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb757>   DW_AT_type        : <0xcaf55>
 <2><cb75b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb75c>   DW_AT_type        : <0xcaf55>
 <2><cb760>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb761>   DW_AT_type        : <0xcaf55>
 <2><cb765>: Abbrev Number: 0
 <1><cb766>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb767>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <cb76b>   DW_AT_decl_file   : 10
    <cb76c>   DW_AT_decl_line   : 73
    <cb76d>   DW_AT_decl_column : 23
    <cb76e>   DW_AT_type        : <0xcb772>
 <1><cb772>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb773>   DW_AT_byte_size   : 8
    <cb773>   DW_AT_type        : <0xcb777>
 <1><cb777>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb778>   DW_AT_prototyped  : 1
    <cb778>   DW_AT_type        : <0xcaf55>
    <cb77c>   DW_AT_sibling     : <0xcb786>
 <2><cb780>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb781>   DW_AT_type        : <0xcaf32>
 <2><cb785>: Abbrev Number: 0
 <1><cb786>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb787>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <cb78b>   DW_AT_decl_file   : 10
    <cb78c>   DW_AT_decl_line   : 74
    <cb78d>   DW_AT_decl_column : 23
    <cb78e>   DW_AT_type        : <0xcb792>
 <1><cb792>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb793>   DW_AT_byte_size   : 8
    <cb793>   DW_AT_type        : <0xcb797>
 <1><cb797>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <cb798>   DW_AT_prototyped  : 1
    <cb798>   DW_AT_type        : <0xcaf55>
    <cb79c>   DW_AT_sibling     : <0xcb7ab>
 <2><cb7a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb7a1>   DW_AT_type        : <0xcaf32>
 <2><cb7a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb7a6>   DW_AT_type        : <0xcaf2b>
 <2><cb7aa>: Abbrev Number: 0
 <1><cb7ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb7ac>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <cb7b0>   DW_AT_decl_file   : 10
    <cb7b1>   DW_AT_decl_line   : 80
    <cb7b2>   DW_AT_decl_column : 23
    <cb7b3>   DW_AT_type        : <0xcb51a>
 <1><cb7b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb7b8>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <cb7bc>   DW_AT_decl_file   : 10
    <cb7bd>   DW_AT_decl_line   : 83
    <cb7be>   DW_AT_decl_column : 23
    <cb7bf>   DW_AT_type        : <0xcb6ef>
 <1><cb7c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb7c4>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <cb7c8>   DW_AT_decl_file   : 10
    <cb7c9>   DW_AT_decl_line   : 86
    <cb7ca>   DW_AT_decl_column : 23
    <cb7cb>   DW_AT_type        : <0xcb578>
 <1><cb7cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb7d0>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <cb7d4>   DW_AT_decl_file   : 10
    <cb7d5>   DW_AT_decl_line   : 89
    <cb7d6>   DW_AT_decl_column : 23
    <cb7d7>   DW_AT_type        : <0xcb578>
 <1><cb7db>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb7dc>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <cb7e0>   DW_AT_decl_file   : 10
    <cb7e1>   DW_AT_decl_line   : 91
    <cb7e2>   DW_AT_decl_column : 23
    <cb7e3>   DW_AT_type        : <0xcb7e7>
 <1><cb7e7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb7e8>   DW_AT_byte_size   : 8
    <cb7e8>   DW_AT_type        : <0xcb7ec>
 <1><cb7ec>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cb7ed>   DW_AT_prototyped  : 1
    <cb7ed>   DW_AT_sibling     : <0xcb7f7>
 <2><cb7f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <cb7f2>   DW_AT_type        : <0xcb7f7>
 <2><cb7f6>: Abbrev Number: 0
 <1><cb7f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <cb7f8>   DW_AT_byte_size   : 8
    <cb7f8>   DW_AT_type        : <0xcb4ca>
 <1><cb7fc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cb7fd>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <cb801>   DW_AT_byte_size   : 224
    <cb802>   DW_AT_decl_file   : 10
    <cb803>   DW_AT_decl_line   : 93
    <cb804>   DW_AT_decl_column : 16
    <cb805>   DW_AT_sibling     : <0xcb976>
 <2><cb809>: Abbrev Number: 2 (DW_TAG_member)
    <cb80a>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <cb80e>   DW_AT_decl_file   : 10
    <cb80f>   DW_AT_decl_line   : 94
    <cb810>   DW_AT_decl_column : 23
    <cb811>   DW_AT_type        : <0xcb4d6>
    <cb815>   DW_AT_data_member_location: 0
 <2><cb816>: Abbrev Number: 2 (DW_TAG_member)
    <cb817>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <cb81b>   DW_AT_decl_file   : 10
    <cb81c>   DW_AT_decl_line   : 95
    <cb81d>   DW_AT_decl_column : 23
    <cb81e>   DW_AT_type        : <0xcb4ec>
    <cb822>   DW_AT_data_member_location: 8
 <2><cb823>: Abbrev Number: 2 (DW_TAG_member)
    <cb824>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <cb828>   DW_AT_decl_file   : 10
    <cb829>   DW_AT_decl_line   : 96
    <cb82a>   DW_AT_decl_column : 23
    <cb82b>   DW_AT_type        : <0xcb502>
    <cb82f>   DW_AT_data_member_location: 16
 <2><cb830>: Abbrev Number: 2 (DW_TAG_member)
    <cb831>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <cb835>   DW_AT_decl_file   : 10
    <cb836>   DW_AT_decl_line   : 97
    <cb837>   DW_AT_decl_column : 23
    <cb838>   DW_AT_type        : <0xcb50e>
    <cb83c>   DW_AT_data_member_location: 24
 <2><cb83d>: Abbrev Number: 2 (DW_TAG_member)
    <cb83e>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <cb842>   DW_AT_decl_file   : 10
    <cb843>   DW_AT_decl_line   : 98
    <cb844>   DW_AT_decl_column : 23
    <cb845>   DW_AT_type        : <0xcb52a>
    <cb849>   DW_AT_data_member_location: 32
 <2><cb84a>: Abbrev Number: 2 (DW_TAG_member)
    <cb84b>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <cb84f>   DW_AT_decl_file   : 10
    <cb850>   DW_AT_decl_line   : 99
    <cb851>   DW_AT_decl_column : 23
    <cb852>   DW_AT_type        : <0xcb554>
    <cb856>   DW_AT_data_member_location: 40
 <2><cb857>: Abbrev Number: 2 (DW_TAG_member)
    <cb858>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
