    <d5020>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <d5024>   DW_AT_decl_file   : 7
    <d5025>   DW_AT_decl_line   : 30
    <d5026>   DW_AT_decl_column : 3
    <d5027>   DW_AT_type        : <0xd4ff4>
 <1><d502b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d502c>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <d5030>   DW_AT_decl_file   : 7
    <d5031>   DW_AT_decl_line   : 54
    <d5032>   DW_AT_decl_column : 15
    <d5033>   DW_AT_type        : <0xd5037>
 <1><d5037>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5038>   DW_AT_byte_size   : 8
    <d5038>   DW_AT_type        : <0xd503c>
 <1><d503c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d503d>   DW_AT_prototyped  : 1
    <d503d>   DW_AT_type        : <0xd4ef1>
    <d5041>   DW_AT_sibling     : <0xd5050>
 <2><d5045>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5046>   DW_AT_type        : <0xd5050>
 <2><d504a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d504b>   DW_AT_type        : <0xd4ef1>
 <2><d504f>: Abbrev Number: 0
 <1><d5050>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5051>   DW_AT_byte_size   : 8
    <d5051>   DW_AT_type        : <0xd5055>
 <1><d5055>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d5056>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <d505a>   DW_AT_byte_size   : 80
    <d505b>   DW_AT_decl_file   : 7
    <d505c>   DW_AT_decl_line   : 97
    <d505d>   DW_AT_decl_column : 16
    <d505e>   DW_AT_sibling     : <0xd5119>
 <2><d5062>: Abbrev Number: 2 (DW_TAG_member)
    <d5063>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <d5067>   DW_AT_decl_file   : 7
    <d5068>   DW_AT_decl_line   : 98
    <d5069>   DW_AT_decl_column : 21
    <d506a>   DW_AT_type        : <0xd4ef1>
    <d506e>   DW_AT_data_member_location: 0
 <2><d506f>: Abbrev Number: 8 (DW_TAG_member)
    <d5070>   DW_AT_name        : len
    <d5074>   DW_AT_decl_file   : 7
    <d5075>   DW_AT_decl_line   : 99
    <d5076>   DW_AT_decl_column : 21
    <d5077>   DW_AT_type        : <0xd4ef1>
    <d507b>   DW_AT_data_member_location: 4
 <2><d507c>: Abbrev Number: 2 (DW_TAG_member)
    <d507d>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <d5081>   DW_AT_decl_file   : 7
    <d5082>   DW_AT_decl_line   : 100
    <d5083>   DW_AT_decl_column : 21
    <d5084>   DW_AT_type        : <0xd501f>
    <d5088>   DW_AT_data_member_location: 8
 <2><d5089>: Abbrev Number: 2 (DW_TAG_member)
    <d508a>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d508e>   DW_AT_decl_file   : 7
    <d508f>   DW_AT_decl_line   : 101
    <d5090>   DW_AT_decl_column : 21
    <d5091>   DW_AT_type        : <0xd4f8e>
    <d5095>   DW_AT_data_member_location: 16
 <2><d5096>: Abbrev Number: 2 (DW_TAG_member)
    <d5097>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <d509b>   DW_AT_decl_file   : 7
    <d509c>   DW_AT_decl_line   : 102
    <d509d>   DW_AT_decl_column : 21
    <d509e>   DW_AT_type        : <0xd4ef1>
    <d50a2>   DW_AT_data_member_location: 24
 <2><d50a3>: Abbrev Number: 2 (DW_TAG_member)
    <d50a4>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <d50a8>   DW_AT_decl_file   : 7
    <d50a9>   DW_AT_decl_line   : 103
    <d50aa>   DW_AT_decl_column : 21
    <d50ab>   DW_AT_type        : <0xd4ef1>
    <d50af>   DW_AT_data_member_location: 28
 <2><d50b0>: Abbrev Number: 2 (DW_TAG_member)
    <d50b1>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <d50b5>   DW_AT_decl_file   : 7
    <d50b6>   DW_AT_decl_line   : 104
    <d50b7>   DW_AT_decl_column : 21
    <d50b8>   DW_AT_type        : <0xd4ef1>
    <d50bc>   DW_AT_data_member_location: 32
 <2><d50bd>: Abbrev Number: 2 (DW_TAG_member)
    <d50be>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <d50c2>   DW_AT_decl_file   : 7
    <d50c3>   DW_AT_decl_line   : 105
    <d50c4>   DW_AT_decl_column : 21
    <d50c5>   DW_AT_type        : <0xd4ed5>
    <d50c9>   DW_AT_data_member_location: 36
 <2><d50ca>: Abbrev Number: 2 (DW_TAG_member)
    <d50cb>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <d50cf>   DW_AT_decl_file   : 7
    <d50d0>   DW_AT_decl_line   : 106
    <d50d1>   DW_AT_decl_column : 21
    <d50d2>   DW_AT_type        : <0xd4ed5>
    <d50d6>   DW_AT_data_member_location: 40
 <2><d50d7>: Abbrev Number: 2 (DW_TAG_member)
    <d50d8>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <d50dc>   DW_AT_decl_file   : 7
    <d50dd>   DW_AT_decl_line   : 109
    <d50de>   DW_AT_decl_column : 21
    <d50df>   DW_AT_type        : <0xd4f6e>
    <d50e3>   DW_AT_data_member_location: 44
 <2><d50e4>: Abbrev Number: 2 (DW_TAG_member)
    <d50e5>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <d50e9>   DW_AT_decl_file   : 7
    <d50ea>   DW_AT_decl_line   : 110
    <d50eb>   DW_AT_decl_column : 21
    <d50ec>   DW_AT_type        : <0xd4f2a>
    <d50f0>   DW_AT_data_member_location: 48
 <2><d50f1>: Abbrev Number: 2 (DW_TAG_member)
    <d50f2>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <d50f6>   DW_AT_decl_file   : 7
    <d50f7>   DW_AT_decl_line   : 112
    <d50f8>   DW_AT_decl_column : 22
    <d50f9>   DW_AT_type        : <0xd53b1>
    <d50fd>   DW_AT_data_member_location: 56
 <2><d50fe>: Abbrev Number: 2 (DW_TAG_member)
    <d50ff>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <d5103>   DW_AT_decl_file   : 7
    <d5104>   DW_AT_decl_line   : 114
    <d5105>   DW_AT_decl_column : 14
    <d5106>   DW_AT_type        : <0xd4f0b>
    <d510a>   DW_AT_data_member_location: 64
 <2><d510b>: Abbrev Number: 2 (DW_TAG_member)
    <d510c>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <d5110>   DW_AT_decl_file   : 7
    <d5111>   DW_AT_decl_line   : 116
    <d5112>   DW_AT_decl_column : 22
    <d5113>   DW_AT_type        : <0xd5050>
    <d5117>   DW_AT_data_member_location: 72
 <2><d5118>: Abbrev Number: 0
 <1><d5119>: Abbrev Number: 3 (DW_TAG_typedef)
    <d511a>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <d511e>   DW_AT_decl_file   : 7
    <d511f>   DW_AT_decl_line   : 59
    <d5120>   DW_AT_decl_column : 15
    <d5121>   DW_AT_type        : <0xd5125>
 <1><d5125>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5126>   DW_AT_byte_size   : 8
    <d5126>   DW_AT_type        : <0xd512a>
 <1><d512a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d512b>   DW_AT_prototyped  : 1
    <d512b>   DW_AT_type        : <0xd4ef1>
    <d512f>   DW_AT_sibling     : <0xd5139>
 <2><d5133>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5134>   DW_AT_type        : <0xd5050>
 <2><d5138>: Abbrev Number: 0
 <1><d5139>: Abbrev Number: 3 (DW_TAG_typedef)
    <d513a>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <d513e>   DW_AT_decl_file   : 7
    <d513f>   DW_AT_decl_line   : 60
    <d5140>   DW_AT_decl_column : 15
    <d5141>   DW_AT_type        : <0xd5125>
 <1><d5145>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5146>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <d514a>   DW_AT_decl_file   : 7
    <d514b>   DW_AT_decl_line   : 61
    <d514c>   DW_AT_decl_column : 15
    <d514d>   DW_AT_type        : <0xd5151>
 <1><d5151>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5152>   DW_AT_byte_size   : 8
    <d5152>   DW_AT_type        : <0xd5156>
 <1><d5156>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5157>   DW_AT_prototyped  : 1
    <d5157>   DW_AT_type        : <0xd4ef1>
    <d515b>   DW_AT_sibling     : <0xd516f>
 <2><d515f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5160>   DW_AT_type        : <0xd5050>
 <2><d5164>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5165>   DW_AT_type        : <0xd4f8e>
 <2><d5169>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d516a>   DW_AT_type        : <0xd4ef1>
 <2><d516e>: Abbrev Number: 0
 <1><d516f>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5170>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <d5174>   DW_AT_decl_file   : 7
    <d5175>   DW_AT_decl_line   : 62
    <d5176>   DW_AT_decl_column : 15
    <d5177>   DW_AT_type        : <0xd517b>
 <1><d517b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d517c>   DW_AT_byte_size   : 8
    <d517c>   DW_AT_type        : <0xd5180>
 <1><d5180>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5181>   DW_AT_prototyped  : 1
    <d5181>   DW_AT_type        : <0xd4ef1>
    <d5185>   DW_AT_sibling     : <0xd5194>
 <2><d5189>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d518a>   DW_AT_type        : <0xd5050>
 <2><d518e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d518f>   DW_AT_type        : <0xd5194>
 <2><d5193>: Abbrev Number: 0
 <1><d5194>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5195>   DW_AT_byte_size   : 8
    <d5195>   DW_AT_type        : <0xd4f8e>
 <1><d5199>: Abbrev Number: 3 (DW_TAG_typedef)
    <d519a>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <d519e>   DW_AT_decl_file   : 7
    <d519f>   DW_AT_decl_line   : 63
    <d51a0>   DW_AT_decl_column : 15
    <d51a1>   DW_AT_type        : <0xd51a5>
 <1><d51a5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d51a6>   DW_AT_byte_size   : 8
    <d51a6>   DW_AT_type        : <0xd51aa>
 <1><d51aa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d51ab>   DW_AT_prototyped  : 1
    <d51ab>   DW_AT_type        : <0xd4ef1>
    <d51af>   DW_AT_sibling     : <0xd51c3>
 <2><d51b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51b4>   DW_AT_type        : <0xd5050>
 <2><d51b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51b9>   DW_AT_type        : <0xd4f0b>
 <2><d51bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51be>   DW_AT_type        : <0xd51c3>
 <2><d51c2>: Abbrev Number: 0
 <1><d51c3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d51c4>   DW_AT_byte_size   : 8
    <d51c4>   DW_AT_type        : <0xd4f2a>
 <1><d51c8>: Abbrev Number: 3 (DW_TAG_typedef)
    <d51c9>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <d51cd>   DW_AT_decl_file   : 7
    <d51ce>   DW_AT_decl_line   : 65
    <d51cf>   DW_AT_decl_column : 15
    <d51d0>   DW_AT_type        : <0xd51d4>
 <1><d51d4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d51d5>   DW_AT_byte_size   : 8
    <d51d5>   DW_AT_type        : <0xd51d9>
 <1><d51d9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d51da>   DW_AT_prototyped  : 1
    <d51da>   DW_AT_type        : <0xd4ef1>
    <d51de>   DW_AT_sibling     : <0xd51f2>
 <2><d51e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51e3>   DW_AT_type        : <0xd5050>
 <2><d51e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51e8>   DW_AT_type        : <0xd4fef>
 <2><d51ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d51ed>   DW_AT_type        : <0xd51c3>
 <2><d51f1>: Abbrev Number: 0
 <1><d51f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d51f3>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <d51f7>   DW_AT_decl_file   : 7
    <d51f8>   DW_AT_decl_line   : 67
    <d51f9>   DW_AT_decl_column : 15
    <d51fa>   DW_AT_type        : <0xd51fe>
 <1><d51fe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d51ff>   DW_AT_byte_size   : 8
    <d51ff>   DW_AT_type        : <0xd5203>
 <1><d5203>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5204>   DW_AT_prototyped  : 1
    <d5204>   DW_AT_type        : <0xd4ef1>
    <d5208>   DW_AT_sibling     : <0xd521c>
 <2><d520c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d520d>   DW_AT_type        : <0xd5050>
 <2><d5211>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5212>   DW_AT_type        : <0xd4f7e>
 <2><d5216>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5217>   DW_AT_type        : <0xd4f2a>
 <2><d521b>: Abbrev Number: 0
 <1><d521c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d521d>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <d5221>   DW_AT_decl_file   : 7
    <d5222>   DW_AT_decl_line   : 69
    <d5223>   DW_AT_decl_column : 15
    <d5224>   DW_AT_type        : <0xd5228>
 <1><d5228>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5229>   DW_AT_byte_size   : 8
    <d5229>   DW_AT_type        : <0xd522d>
 <1><d522d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d522e>   DW_AT_prototyped  : 1
    <d522e>   DW_AT_type        : <0xd4ef1>
    <d5232>   DW_AT_sibling     : <0xd5246>
 <2><d5236>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5237>   DW_AT_type        : <0xd5050>
 <2><d523b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d523c>   DW_AT_type        : <0xd5246>
 <2><d5240>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5241>   DW_AT_type        : <0xd4f2a>
 <2><d5245>: Abbrev Number: 0
 <1><d5246>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5247>   DW_AT_byte_size   : 8
    <d5247>   DW_AT_type        : <0xd4f43>
 <1><d524b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d524c>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <d5250>   DW_AT_decl_file   : 7
    <d5251>   DW_AT_decl_line   : 71
    <d5252>   DW_AT_decl_column : 15
    <d5253>   DW_AT_type        : <0xd5257>
 <1><d5257>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5258>   DW_AT_byte_size   : 8
    <d5258>   DW_AT_type        : <0xd525c>
 <1><d525c>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d525d>   DW_AT_prototyped  : 1
    <d525d>   DW_AT_type        : <0xd4ef1>
    <d5261>   DW_AT_sibling     : <0xd5275>
 <2><d5265>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5266>   DW_AT_type        : <0xd5050>
 <2><d526a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d526b>   DW_AT_type        : <0xd4f8e>
 <2><d526f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5270>   DW_AT_type        : <0xd4f8e>
 <2><d5274>: Abbrev Number: 0
 <1><d5275>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5276>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <d527a>   DW_AT_decl_file   : 7
    <d527b>   DW_AT_decl_line   : 73
    <d527c>   DW_AT_decl_column : 15
    <d527d>   DW_AT_type        : <0xd5257>
 <1><d5281>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5282>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <d5286>   DW_AT_decl_file   : 7
    <d5287>   DW_AT_decl_line   : 75
    <d5288>   DW_AT_decl_column : 15
    <d5289>   DW_AT_type        : <0xd528d>
 <1><d528d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d528e>   DW_AT_byte_size   : 8
    <d528e>   DW_AT_type        : <0xd5292>
 <1><d5292>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5293>   DW_AT_prototyped  : 1
    <d5293>   DW_AT_type        : <0xd4ef1>
    <d5297>   DW_AT_sibling     : <0xd52a6>
 <2><d529b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d529c>   DW_AT_type        : <0xd5050>
 <2><d52a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d52a1>   DW_AT_type        : <0xd52a6>
 <2><d52a5>: Abbrev Number: 0
 <1><d52a6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d52a7>   DW_AT_byte_size   : 8
    <d52a7>   DW_AT_type        : <0xd4fd5>
 <1><d52ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <d52ac>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <d52b0>   DW_AT_decl_file   : 7
    <d52b1>   DW_AT_decl_line   : 76
    <d52b2>   DW_AT_decl_column : 15
    <d52b3>   DW_AT_type        : <0xd52b7>
 <1><d52b7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d52b8>   DW_AT_byte_size   : 8
    <d52b8>   DW_AT_type        : <0xd52bc>
 <1><d52bc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d52bd>   DW_AT_prototyped  : 1
    <d52bd>   DW_AT_type        : <0xd4ef1>
    <d52c1>   DW_AT_sibling     : <0xd52d5>
 <2><d52c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d52c6>   DW_AT_type        : <0xd5050>
 <2><d52ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d52cb>   DW_AT_type        : <0xd4fef>
 <2><d52cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d52d0>   DW_AT_type        : <0xd4f5b>
 <2><d52d4>: Abbrev Number: 0
 <1><d52d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d52d6>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <d52da>   DW_AT_decl_file   : 7
    <d52db>   DW_AT_decl_line   : 77
    <d52dc>   DW_AT_decl_column : 15
    <d52dd>   DW_AT_type        : <0xd5125>
 <1><d52e1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d52e2>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <d52e6>   DW_AT_byte_size   : 112
    <d52e7>   DW_AT_decl_file   : 7
    <d52e8>   DW_AT_decl_line   : 80
    <d52e9>   DW_AT_decl_column : 16
    <d52ea>   DW_AT_sibling     : <0xd53a5>
 <2><d52ee>: Abbrev Number: 2 (DW_TAG_member)
    <d52ef>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <d52f3>   DW_AT_decl_file   : 7
    <d52f4>   DW_AT_decl_line   : 81
    <d52f5>   DW_AT_decl_column : 25
    <d52f6>   DW_AT_type        : <0xd5119>
    <d52fa>   DW_AT_data_member_location: 0
 <2><d52fb>: Abbrev Number: 2 (DW_TAG_member)
    <d52fc>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <d5300>   DW_AT_decl_file   : 7
    <d5301>   DW_AT_decl_line   : 82
    <d5302>   DW_AT_decl_column : 25
    <d5303>   DW_AT_type        : <0xd5139>
    <d5307>   DW_AT_data_member_location: 8
 <2><d5308>: Abbrev Number: 2 (DW_TAG_member)
    <d5309>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <d530d>   DW_AT_decl_file   : 7
    <d530e>   DW_AT_decl_line   : 83
    <d530f>   DW_AT_decl_column : 25
    <d5310>   DW_AT_type        : <0xd5145>
    <d5314>   DW_AT_data_member_location: 16
 <2><d5315>: Abbrev Number: 2 (DW_TAG_member)
    <d5316>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <d531a>   DW_AT_decl_file   : 7
    <d531b>   DW_AT_decl_line   : 84
    <d531c>   DW_AT_decl_column : 25
    <d531d>   DW_AT_type        : <0xd516f>
    <d5321>   DW_AT_data_member_location: 24
 <2><d5322>: Abbrev Number: 2 (DW_TAG_member)
    <d5323>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <d5327>   DW_AT_decl_file   : 7
    <d5328>   DW_AT_decl_line   : 85
    <d5329>   DW_AT_decl_column : 25
    <d532a>   DW_AT_type        : <0xd5199>
    <d532e>   DW_AT_data_member_location: 32
 <2><d532f>: Abbrev Number: 2 (DW_TAG_member)
    <d5330>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <d5334>   DW_AT_decl_file   : 7
    <d5335>   DW_AT_decl_line   : 86
    <d5336>   DW_AT_decl_column : 25
    <d5337>   DW_AT_type        : <0xd51c8>
    <d533b>   DW_AT_data_member_location: 40
 <2><d533c>: Abbrev Number: 2 (DW_TAG_member)
    <d533d>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <d5341>   DW_AT_decl_file   : 7
    <d5342>   DW_AT_decl_line   : 87
    <d5343>   DW_AT_decl_column : 25
    <d5344>   DW_AT_type        : <0xd51f2>
    <d5348>   DW_AT_data_member_location: 48
 <2><d5349>: Abbrev Number: 2 (DW_TAG_member)
    <d534a>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <d534e>   DW_AT_decl_file   : 7
    <d534f>   DW_AT_decl_line   : 88
    <d5350>   DW_AT_decl_column : 25
    <d5351>   DW_AT_type        : <0xd521c>
    <d5355>   DW_AT_data_member_location: 56
 <2><d5356>: Abbrev Number: 2 (DW_TAG_member)
    <d5357>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <d535b>   DW_AT_decl_file   : 7
    <d535c>   DW_AT_decl_line   : 89
    <d535d>   DW_AT_decl_column : 25
    <d535e>   DW_AT_type        : <0xd524b>
    <d5362>   DW_AT_data_member_location: 64
 <2><d5363>: Abbrev Number: 2 (DW_TAG_member)
    <d5364>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <d5368>   DW_AT_decl_file   : 7
    <d5369>   DW_AT_decl_line   : 90
    <d536a>   DW_AT_decl_column : 25
    <d536b>   DW_AT_type        : <0xd5275>
    <d536f>   DW_AT_data_member_location: 72
 <2><d5370>: Abbrev Number: 2 (DW_TAG_member)
    <d5371>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <d5375>   DW_AT_decl_file   : 7
    <d5376>   DW_AT_decl_line   : 91
    <d5377>   DW_AT_decl_column : 25
    <d5378>   DW_AT_type        : <0xd5281>
    <d537c>   DW_AT_data_member_location: 80
 <2><d537d>: Abbrev Number: 2 (DW_TAG_member)
    <d537e>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <d5382>   DW_AT_decl_file   : 7
    <d5383>   DW_AT_decl_line   : 92
    <d5384>   DW_AT_decl_column : 25
    <d5385>   DW_AT_type        : <0xd52ab>
    <d5389>   DW_AT_data_member_location: 88
 <2><d538a>: Abbrev Number: 2 (DW_TAG_member)
    <d538b>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <d538f>   DW_AT_decl_file   : 7
    <d5390>   DW_AT_decl_line   : 93
    <d5391>   DW_AT_decl_column : 25
    <d5392>   DW_AT_type        : <0xd502b>
    <d5396>   DW_AT_data_member_location: 96
 <2><d5397>: Abbrev Number: 2 (DW_TAG_member)
    <d5398>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <d539c>   DW_AT_decl_file   : 7
    <d539d>   DW_AT_decl_line   : 94
    <d539e>   DW_AT_decl_column : 25
    <d539f>   DW_AT_type        : <0xd52d5>
    <d53a3>   DW_AT_data_member_location: 104
 <2><d53a4>: Abbrev Number: 0
 <1><d53a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d53a6>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <d53aa>   DW_AT_decl_file   : 7
    <d53ab>   DW_AT_decl_line   : 95
    <d53ac>   DW_AT_decl_column : 3
    <d53ad>   DW_AT_type        : <0xd52e1>
 <1><d53b1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d53b2>   DW_AT_byte_size   : 8
    <d53b2>   DW_AT_type        : <0xd53a5>
 <1><d53b6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d53b7>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <d53bb>   DW_AT_decl_file   : 7
    <d53bc>   DW_AT_decl_line   : 117
    <d53bd>   DW_AT_decl_column : 3
    <d53be>   DW_AT_type        : <0xd5055>
 <1><d53c2>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d53c3>   DW_AT_byte_size   : 8
    <d53c4>   DW_AT_decl_file   : 8
    <d53c4>   DW_AT_decl_line   : 4
    <d53c5>   DW_AT_decl_column : 3
    <d53c5>   DW_AT_sibling     : <0xd53e4>
 <2><d53c9>: Abbrev Number: 2 (DW_TAG_member)
    <d53ca>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <d53ce>   DW_AT_decl_file   : 8
    <d53cf>   DW_AT_decl_line   : 5
    <d53d0>   DW_AT_decl_column : 8
    <d53d1>   DW_AT_type        : <0xd4ef1>
    <d53d5>   DW_AT_data_member_location: 0
 <2><d53d6>: Abbrev Number: 2 (DW_TAG_member)
    <d53d7>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <d53db>   DW_AT_decl_file   : 8
    <d53dc>   DW_AT_decl_line   : 6
    <d53dd>   DW_AT_decl_column : 8
    <d53de>   DW_AT_type        : <0xd4ef1>
    <d53e2>   DW_AT_data_member_location: 4
 <2><d53e3>: Abbrev Number: 0
 <1><d53e4>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d53e5>   DW_AT_byte_size   : 16
    <d53e6>   DW_AT_decl_file   : 8
    <d53e6>   DW_AT_decl_line   : 8
    <d53e7>   DW_AT_decl_column : 3
    <d53e7>   DW_AT_sibling     : <0xd541a>
 <2><d53eb>: Abbrev Number: 8 (DW_TAG_member)
    <d53ec>   DW_AT_name        : x
    <d53ee>   DW_AT_decl_file   : 8
    <d53ef>   DW_AT_decl_line   : 9
    <d53f0>   DW_AT_decl_column : 8
    <d53f1>   DW_AT_type        : <0xd4ef1>
    <d53f5>   DW_AT_data_member_location: 0
 <2><d53f6>: Abbrev Number: 8 (DW_TAG_member)
    <d53f7>   DW_AT_name        : y
    <d53f9>   DW_AT_decl_file   : 8
    <d53fa>   DW_AT_decl_line   : 9
    <d53fb>   DW_AT_decl_column : 11
    <d53fc>   DW_AT_type        : <0xd4ef1>
    <d5400>   DW_AT_data_member_location: 4
 <2><d5401>: Abbrev Number: 8 (DW_TAG_member)
    <d5402>   DW_AT_name        : dx
    <d5405>   DW_AT_decl_file   : 8
    <d5406>   DW_AT_decl_line   : 10
    <d5407>   DW_AT_decl_column : 8
    <d5408>   DW_AT_type        : <0xd4ef1>
    <d540c>   DW_AT_data_member_location: 8
 <2><d540d>: Abbrev Number: 8 (DW_TAG_member)
    <d540e>   DW_AT_name        : dy
    <d5411>   DW_AT_decl_file   : 8
    <d5412>   DW_AT_decl_line   : 10
    <d5413>   DW_AT_decl_column : 12
    <d5414>   DW_AT_type        : <0xd4ef1>
    <d5418>   DW_AT_data_member_location: 12
 <2><d5419>: Abbrev Number: 0
 <1><d541a>: Abbrev Number: 36 (DW_TAG_union_type)
    <d541b>   DW_AT_byte_size   : 16
    <d541c>   DW_AT_decl_file   : 8
    <d541d>   DW_AT_decl_line   : 3
    <d541e>   DW_AT_decl_column : 2
    <d541f>   DW_AT_sibling     : <0xd544a>
 <2><d5423>: Abbrev Number: 20 (DW_TAG_member)
    <d5424>   DW_AT_type        : <0xd53c2>
 <2><d5428>: Abbrev Number: 20 (DW_TAG_member)
    <d5429>   DW_AT_type        : <0xd53e4>
 <2><d542d>: Abbrev Number: 37 (DW_TAG_member)
    <d542e>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <d5432>   DW_AT_decl_file   : 8
    <d5433>   DW_AT_decl_line   : 12
    <d5434>   DW_AT_decl_column : 7
    <d5435>   DW_AT_type        : <0xd4ef1>
 <2><d5439>: Abbrev Number: 21 (DW_TAG_member)
    <d543a>   DW_AT_name        : z
    <d543c>   DW_AT_decl_file   : 8
    <d543c>   DW_AT_decl_line   : 13
    <d543d>   DW_AT_decl_column : 7
    <d543d>   DW_AT_type        : <0xd4ef1>
 <2><d5441>: Abbrev Number: 21 (DW_TAG_member)
    <d5442>   DW_AT_name        : w
    <d5444>   DW_AT_decl_file   : 8
    <d5444>   DW_AT_decl_line   : 14
    <d5445>   DW_AT_decl_column : 7
    <d5445>   DW_AT_type        : <0xd4ef1>
 <2><d5449>: Abbrev Number: 0
 <1><d544a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d544b>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <d544f>   DW_AT_byte_size   : 20
    <d5450>   DW_AT_decl_file   : 8
    <d5451>   DW_AT_decl_line   : 1
    <d5452>   DW_AT_decl_column : 8
    <d5453>   DW_AT_sibling     : <0xd546b>
 <2><d5457>: Abbrev Number: 2 (DW_TAG_member)
    <d5458>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <d545c>   DW_AT_decl_file   : 8
    <d545d>   DW_AT_decl_line   : 2
    <d545e>   DW_AT_decl_column : 6
    <d545f>   DW_AT_type        : <0xd4ef1>
    <d5463>   DW_AT_data_member_location: 0
 <2><d5464>: Abbrev Number: 38 (DW_TAG_member)
    <d5465>   DW_AT_type        : <0xd541a>
    <d5469>   DW_AT_data_member_location: 4
 <2><d546a>: Abbrev Number: 0
 <1><d546b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d546c>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <d5470>   DW_AT_decl_file   : 8
    <d5471>   DW_AT_decl_line   : 18
    <d5472>   DW_AT_decl_column : 23
    <d5473>   DW_AT_type        : <0xd544a>
 <1><d5477>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5478>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <d547c>   DW_AT_decl_file   : 9
    <d547d>   DW_AT_decl_line   : 1
    <d547e>   DW_AT_decl_column : 23
    <d547f>   DW_AT_type        : <0xd5483>
 <1><d5483>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5484>   DW_AT_byte_size   : 8
    <d5484>   DW_AT_type        : <0xd5488>
 <1><d5488>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <d5489>   DW_AT_prototyped  : 1
    <d5489>   DW_AT_type        : <0xd52a6>
 <1><d548d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d548e>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <d5492>   DW_AT_decl_file   : 9
    <d5493>   DW_AT_decl_line   : 2
    <d5494>   DW_AT_decl_column : 23
    <d5495>   DW_AT_type        : <0xd5499>
 <1><d5499>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d549a>   DW_AT_byte_size   : 8
    <d549a>   DW_AT_type        : <0xd549e>
 <1><d549e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <d549f>   DW_AT_prototyped  : 1
    <d549f>   DW_AT_type        : <0xd4ef1>
 <1><d54a3>: Abbrev Number: 3 (DW_TAG_typedef)
    <d54a4>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <d54a8>   DW_AT_decl_file   : 9
    <d54a9>   DW_AT_decl_line   : 3
    <d54aa>   DW_AT_decl_column : 23
    <d54ab>   DW_AT_type        : <0xd5499>
 <1><d54af>: Abbrev Number: 3 (DW_TAG_typedef)
    <d54b0>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <d54b4>   DW_AT_decl_file   : 9
    <d54b5>   DW_AT_decl_line   : 10
    <d54b6>   DW_AT_decl_column : 23
    <d54b7>   DW_AT_type        : <0xd54bb>
 <1><d54bb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d54bc>   DW_AT_byte_size   : 8
    <d54bc>   DW_AT_type        : <0xd54c0>
 <1><d54c0>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d54c1>   DW_AT_prototyped  : 1
    <d54c1>   DW_AT_sibling     : <0xd54cb>
 <2><d54c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d54c6>   DW_AT_type        : <0xd4ef1>
 <2><d54ca>: Abbrev Number: 0
 <1><d54cb>: Abbrev Number: 3 (DW_TAG_typedef)
    <d54cc>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <d54d0>   DW_AT_decl_file   : 9
    <d54d1>   DW_AT_decl_line   : 14
    <d54d2>   DW_AT_decl_column : 23
    <d54d3>   DW_AT_type        : <0xd54d7>
 <1><d54d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d54d8>   DW_AT_byte_size   : 8
    <d54d8>   DW_AT_type        : <0xd54dc>
 <1><d54dc>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d54dd>   DW_AT_prototyped  : 1
    <d54dd>   DW_AT_type        : <0xd4ef1>
    <d54e1>   DW_AT_sibling     : <0xd54f5>
 <2><d54e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d54e6>   DW_AT_type        : <0xd4ef1>
 <2><d54ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d54eb>   DW_AT_type        : <0xd4ef1>
 <2><d54ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d54f0>   DW_AT_type        : <0xd4ef1>
 <2><d54f4>: Abbrev Number: 0
 <1><d54f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d54f6>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <d54fa>   DW_AT_decl_file   : 9
    <d54fb>   DW_AT_decl_line   : 18
    <d54fc>   DW_AT_decl_column : 23
    <d54fd>   DW_AT_type        : <0xd54d7>
 <1><d5501>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5502>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <d5506>   DW_AT_decl_file   : 9
    <d5507>   DW_AT_decl_line   : 24
    <d5508>   DW_AT_decl_column : 23
    <d5509>   DW_AT_type        : <0xd4f9a>
 <1><d550d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d550e>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <d5512>   DW_AT_decl_file   : 9
    <d5513>   DW_AT_decl_line   : 28
    <d5514>   DW_AT_decl_column : 23
    <d5515>   DW_AT_type        : <0xd5519>
 <1><d5519>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d551a>   DW_AT_byte_size   : 8
    <d551a>   DW_AT_type        : <0xd551e>
 <1><d551e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d551f>   DW_AT_prototyped  : 1
    <d551f>   DW_AT_type        : <0xd4ef1>
    <d5523>   DW_AT_sibling     : <0xd5532>
 <2><d5527>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5528>   DW_AT_type        : <0xd4ef1>
 <2><d552c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d552d>   DW_AT_type        : <0xd4ef1>
 <2><d5531>: Abbrev Number: 0
 <1><d5532>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5533>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <d5537>   DW_AT_decl_file   : 9
    <d5538>   DW_AT_decl_line   : 34
    <d5539>   DW_AT_decl_column : 23
    <d553a>   DW_AT_type        : <0xd5499>
 <1><d553e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d553f>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <d5543>   DW_AT_decl_file   : 9
    <d5544>   DW_AT_decl_line   : 35
    <d5545>   DW_AT_decl_column : 23
    <d5546>   DW_AT_type        : <0xd5499>
 <1><d554a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d554b>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <d554f>   DW_AT_decl_file   : 9
    <d5550>   DW_AT_decl_line   : 36
    <d5551>   DW_AT_decl_column : 23
    <d5552>   DW_AT_type        : <0xd5556>
 <1><d5556>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5557>   DW_AT_byte_size   : 8
    <d5557>   DW_AT_type        : <0xd555b>
 <1><d555b>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d555c>   DW_AT_prototyped  : 1
    <d555c>   DW_AT_sibling     : <0xd556b>
 <2><d5560>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5561>   DW_AT_type        : <0xd556b>
 <2><d5565>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5566>   DW_AT_type        : <0xd556b>
 <2><d556a>: Abbrev Number: 0
 <1><d556b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d556c>   DW_AT_byte_size   : 8
    <d556c>   DW_AT_type        : <0xd4ef1>
 <1><d5570>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5571>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <d5575>   DW_AT_decl_file   : 9
    <d5576>   DW_AT_decl_line   : 37
    <d5577>   DW_AT_decl_column : 23
    <d5578>   DW_AT_type        : <0xd5556>
 <1><d557c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d557d>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <d5581>   DW_AT_decl_file   : 9
    <d5582>   DW_AT_decl_line   : 45
    <d5583>   DW_AT_decl_column : 24
    <d5584>   DW_AT_type        : <0xd5588>
 <1><d5588>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5589>   DW_AT_byte_size   : 8
    <d5589>   DW_AT_type        : <0xd558d>
 <1><d558d>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d558e>   DW_AT_prototyped  : 1
    <d558e>   DW_AT_type        : <0xd4ed5>
    <d5592>   DW_AT_sibling     : <0xd55a6>
 <2><d5596>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5597>   DW_AT_type        : <0xd4ef1>
 <2><d559b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d559c>   DW_AT_type        : <0xd4ef1>
 <2><d55a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55a1>   DW_AT_type        : <0xd4ef1>
 <2><d55a5>: Abbrev Number: 0
 <1><d55a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d55a7>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <d55ab>   DW_AT_decl_file   : 9
    <d55ac>   DW_AT_decl_line   : 48
    <d55ad>   DW_AT_decl_column : 23
    <d55ae>   DW_AT_type        : <0xd55b2>
 <1><d55b2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d55b3>   DW_AT_byte_size   : 8
    <d55b3>   DW_AT_type        : <0xd55b7>
 <1><d55b7>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d55b8>   DW_AT_prototyped  : 1
    <d55b8>   DW_AT_sibling     : <0xd55cc>
 <2><d55bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55bd>   DW_AT_type        : <0xd4f7e>
 <2><d55c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55c2>   DW_AT_type        : <0xd4f2a>
 <2><d55c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55c7>   DW_AT_type        : <0xd4ef1>
 <2><d55cb>: Abbrev Number: 0
 <1><d55cc>: Abbrev Number: 3 (DW_TAG_typedef)
    <d55cd>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <d55d1>   DW_AT_decl_file   : 9
    <d55d2>   DW_AT_decl_line   : 49
    <d55d3>   DW_AT_decl_column : 23
    <d55d4>   DW_AT_type        : <0xd55d8>
 <1><d55d8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d55d9>   DW_AT_byte_size   : 8
    <d55d9>   DW_AT_type        : <0xd55dd>
 <1><d55dd>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d55de>   DW_AT_prototyped  : 1
    <d55de>   DW_AT_sibling     : <0xd55f2>
 <2><d55e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55e3>   DW_AT_type        : <0xd5246>
 <2><d55e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55e8>   DW_AT_type        : <0xd4f2a>
 <2><d55ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d55ed>   DW_AT_type        : <0xd4ef1>
 <2><d55f1>: Abbrev Number: 0
 <1><d55f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d55f3>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <d55f7>   DW_AT_decl_file   : 9
    <d55f8>   DW_AT_decl_line   : 51
    <d55f9>   DW_AT_decl_column : 24
    <d55fa>   DW_AT_type        : <0xd55fe>
 <1><d55fe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d55ff>   DW_AT_byte_size   : 8
    <d55ff>   DW_AT_type        : <0xd5603>
 <1><d5603>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5604>   DW_AT_prototyped  : 1
    <d5604>   DW_AT_type        : <0xd4f19>
    <d5608>   DW_AT_sibling     : <0xd5617>
 <2><d560c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d560d>   DW_AT_type        : <0xd4f19>
 <2><d5611>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5612>   DW_AT_type        : <0xd4f5b>
 <2><d5616>: Abbrev Number: 0
 <1><d5617>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5618>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <d561c>   DW_AT_decl_file   : 9
    <d561d>   DW_AT_decl_line   : 54
    <d561e>   DW_AT_decl_column : 23
    <d561f>   DW_AT_type        : <0xd5623>
 <1><d5623>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5624>   DW_AT_byte_size   : 8
    <d5624>   DW_AT_type        : <0xd5628>
 <1><d5628>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5629>   DW_AT_prototyped  : 1
    <d5629>   DW_AT_type        : <0xd4ef1>
    <d562d>   DW_AT_sibling     : <0xd5650>
 <2><d5631>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5632>   DW_AT_type        : <0xd52a6>
 <2><d5636>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5637>   DW_AT_type        : <0xd4f0b>
 <2><d563b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d563c>   DW_AT_type        : <0xd4f5b>
 <2><d5640>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5641>   DW_AT_type        : <0xd4ef1>
 <2><d5645>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5646>   DW_AT_type        : <0xd4ef1>
 <2><d564a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d564b>   DW_AT_type        : <0xd4ef1>
 <2><d564f>: Abbrev Number: 0
 <1><d5650>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5651>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <d5655>   DW_AT_decl_file   : 9
    <d5656>   DW_AT_decl_line   : 56
    <d5657>   DW_AT_decl_column : 23
    <d5658>   DW_AT_type        : <0xd565c>
 <1><d565c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d565d>   DW_AT_byte_size   : 8
    <d565d>   DW_AT_type        : <0xd5661>
 <1><d5661>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5662>   DW_AT_prototyped  : 1
    <d5662>   DW_AT_type        : <0xd4ef1>
    <d5666>   DW_AT_sibling     : <0xd5684>
 <2><d566a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d566b>   DW_AT_type        : <0xd5246>
 <2><d566f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5670>   DW_AT_type        : <0xd4fef>
 <2><d5674>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5675>   DW_AT_type        : <0xd4f5b>
 <2><d5679>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d567a>   DW_AT_type        : <0xd4ef1>
 <2><d567e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d567f>   DW_AT_type        : <0xd4ef1>
 <2><d5683>: Abbrev Number: 0
 <1><d5684>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5685>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <d5689>   DW_AT_decl_file   : 9
    <d568a>   DW_AT_decl_line   : 67
    <d568b>   DW_AT_decl_column : 23
    <d568c>   DW_AT_type        : <0xd5690>
 <1><d5690>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5691>   DW_AT_byte_size   : 8
    <d5691>   DW_AT_type        : <0xd5695>
 <1><d5695>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5696>   DW_AT_prototyped  : 1
    <d5696>   DW_AT_type        : <0xd4ef1>
    <d569a>   DW_AT_sibling     : <0xd56a4>
 <2><d569e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d569f>   DW_AT_type        : <0xd4ef1>
 <2><d56a3>: Abbrev Number: 0
 <1><d56a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <d56a5>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <d56a9>   DW_AT_decl_file   : 9
    <d56aa>   DW_AT_decl_line   : 68
    <d56ab>   DW_AT_decl_column : 23
    <d56ac>   DW_AT_type        : <0xd56b0>
 <1><d56b0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d56b1>   DW_AT_byte_size   : 8
    <d56b1>   DW_AT_type        : <0xd56b5>
 <1><d56b5>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d56b6>   DW_AT_prototyped  : 1
    <d56b6>   DW_AT_type        : <0xd4ef1>
    <d56ba>   DW_AT_sibling     : <0xd56d8>
 <2><d56be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56bf>   DW_AT_type        : <0xd556b>
 <2><d56c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56c4>   DW_AT_type        : <0xd556b>
 <2><d56c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56c9>   DW_AT_type        : <0xd556b>
 <2><d56cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56ce>   DW_AT_type        : <0xd556b>
 <2><d56d2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56d3>   DW_AT_type        : <0xd556b>
 <2><d56d7>: Abbrev Number: 0
 <1><d56d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <d56d9>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <d56dd>   DW_AT_decl_file   : 9
    <d56de>   DW_AT_decl_line   : 69
    <d56df>   DW_AT_decl_column : 23
    <d56e0>   DW_AT_type        : <0xd56e4>
 <1><d56e4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d56e5>   DW_AT_byte_size   : 8
    <d56e5>   DW_AT_type        : <0xd56e9>
 <1><d56e9>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d56ea>   DW_AT_prototyped  : 1
    <d56ea>   DW_AT_type        : <0xd4ef1>
    <d56ee>   DW_AT_sibling     : <0xd5707>
 <2><d56f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56f3>   DW_AT_type        : <0xd4ef1>
 <2><d56f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56f8>   DW_AT_type        : <0xd4ef1>
 <2><d56fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d56fd>   DW_AT_type        : <0xd4ef1>
 <2><d5701>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5702>   DW_AT_type        : <0xd4ef1>
 <2><d5706>: Abbrev Number: 0
 <1><d5707>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5708>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <d570c>   DW_AT_decl_file   : 9
    <d570d>   DW_AT_decl_line   : 73
    <d570e>   DW_AT_decl_column : 23
    <d570f>   DW_AT_type        : <0xd5713>
 <1><d5713>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5714>   DW_AT_byte_size   : 8
    <d5714>   DW_AT_type        : <0xd5718>
 <1><d5718>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5719>   DW_AT_prototyped  : 1
    <d5719>   DW_AT_type        : <0xd4ef1>
    <d571d>   DW_AT_sibling     : <0xd5727>
 <2><d5721>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5722>   DW_AT_type        : <0xd4ece>
 <2><d5726>: Abbrev Number: 0
 <1><d5727>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5728>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <d572c>   DW_AT_decl_file   : 9
    <d572d>   DW_AT_decl_line   : 74
    <d572e>   DW_AT_decl_column : 23
    <d572f>   DW_AT_type        : <0xd5733>
 <1><d5733>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5734>   DW_AT_byte_size   : 8
    <d5734>   DW_AT_type        : <0xd5738>
 <1><d5738>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <d5739>   DW_AT_prototyped  : 1
    <d5739>   DW_AT_type        : <0xd4ef1>
    <d573d>   DW_AT_sibling     : <0xd574c>
 <2><d5741>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5742>   DW_AT_type        : <0xd4ece>
 <2><d5746>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5747>   DW_AT_type        : <0xd4ec7>
 <2><d574b>: Abbrev Number: 0
 <1><d574c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d574d>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <d5751>   DW_AT_decl_file   : 9
    <d5752>   DW_AT_decl_line   : 80
    <d5753>   DW_AT_decl_column : 23
    <d5754>   DW_AT_type        : <0xd54bb>
 <1><d5758>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5759>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <d575d>   DW_AT_decl_file   : 9
    <d575e>   DW_AT_decl_line   : 83
    <d575f>   DW_AT_decl_column : 23
    <d5760>   DW_AT_type        : <0xd5690>
 <1><d5764>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5765>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <d5769>   DW_AT_decl_file   : 9
    <d576a>   DW_AT_decl_line   : 86
    <d576b>   DW_AT_decl_column : 23
    <d576c>   DW_AT_type        : <0xd5519>
 <1><d5770>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5771>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <d5775>   DW_AT_decl_file   : 9
    <d5776>   DW_AT_decl_line   : 89
    <d5777>   DW_AT_decl_column : 23
    <d5778>   DW_AT_type        : <0xd5519>
 <1><d577c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d577d>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <d5781>   DW_AT_decl_file   : 9
    <d5782>   DW_AT_decl_line   : 91
    <d5783>   DW_AT_decl_column : 23
    <d5784>   DW_AT_type        : <0xd5788>
 <1><d5788>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5789>   DW_AT_byte_size   : 8
    <d5789>   DW_AT_type        : <0xd578d>
 <1><d578d>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d578e>   DW_AT_prototyped  : 1
    <d578e>   DW_AT_sibling     : <0xd5798>
 <2><d5792>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5793>   DW_AT_type        : <0xd5798>
 <2><d5797>: Abbrev Number: 0
 <1><d5798>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d5799>   DW_AT_byte_size   : 8
    <d5799>   DW_AT_type        : <0xd546b>
 <1><d579d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d579e>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <d57a2>   DW_AT_byte_size   : 224
    <d57a3>   DW_AT_decl_file   : 9
    <d57a4>   DW_AT_decl_line   : 93
    <d57a5>   DW_AT_decl_column : 16
    <d57a6>   DW_AT_sibling     : <0xd5917>
 <2><d57aa>: Abbrev Number: 2 (DW_TAG_member)
    <d57ab>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <d57af>   DW_AT_decl_file   : 9
    <d57b0>   DW_AT_decl_line   : 94
    <d57b1>   DW_AT_decl_column : 23
    <d57b2>   DW_AT_type        : <0xd5477>
    <d57b6>   DW_AT_data_member_location: 0
 <2><d57b7>: Abbrev Number: 2 (DW_TAG_member)
    <d57b8>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <d57bc>   DW_AT_decl_file   : 9
    <d57bd>   DW_AT_decl_line   : 95
    <d57be>   DW_AT_decl_column : 23
    <d57bf>   DW_AT_type        : <0xd548d>
    <d57c3>   DW_AT_data_member_location: 8
 <2><d57c4>: Abbrev Number: 2 (DW_TAG_member)
    <d57c5>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <d57c9>   DW_AT_decl_file   : 9
    <d57ca>   DW_AT_decl_line   : 96
    <d57cb>   DW_AT_decl_column : 23
    <d57cc>   DW_AT_type        : <0xd54a3>
    <d57d0>   DW_AT_data_member_location: 16
 <2><d57d1>: Abbrev Number: 2 (DW_TAG_member)
    <d57d2>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <d57d6>   DW_AT_decl_file   : 9
    <d57d7>   DW_AT_decl_line   : 97
    <d57d8>   DW_AT_decl_column : 23
    <d57d9>   DW_AT_type        : <0xd54af>
    <d57dd>   DW_AT_data_member_location: 24
 <2><d57de>: Abbrev Number: 2 (DW_TAG_member)
    <d57df>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <d57e3>   DW_AT_decl_file   : 9
    <d57e4>   DW_AT_decl_line   : 98
    <d57e5>   DW_AT_decl_column : 23
    <d57e6>   DW_AT_type        : <0xd54cb>
    <d57ea>   DW_AT_data_member_location: 32
 <2><d57eb>: Abbrev Number: 2 (DW_TAG_member)
    <d57ec>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <d57f0>   DW_AT_decl_file   : 9
    <d57f1>   DW_AT_decl_line   : 99
    <d57f2>   DW_AT_decl_column : 23
    <d57f3>   DW_AT_type        : <0xd54f5>
    <d57f7>   DW_AT_data_member_location: 40
 <2><d57f8>: Abbrev Number: 2 (DW_TAG_member)
    <d57f9>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <d57fd>   DW_AT_decl_file   : 9
    <d57fe>   DW_AT_decl_line   : 100
    <d57ff>   DW_AT_decl_column : 23
    <d5800>   DW_AT_type        : <0xd550d>
    <d5804>   DW_AT_data_member_location: 48
 <2><d5805>: Abbrev Number: 2 (DW_TAG_member)
    <d5806>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <d580a>   DW_AT_decl_file   : 9
    <d580b>   DW_AT_decl_line   : 101
    <d580c>   DW_AT_decl_column : 23
    <d580d>   DW_AT_type        : <0xd5532>
    <d5811>   DW_AT_data_member_location: 56
 <2><d5812>: Abbrev Number: 2 (DW_TAG_member)
    <d5813>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <d5817>   DW_AT_decl_file   : 9
    <d5818>   DW_AT_decl_line   : 102
    <d5819>   DW_AT_decl_column : 23
    <d581a>   DW_AT_type        : <0xd553e>
    <d581e>   DW_AT_data_member_location: 64
 <2><d581f>: Abbrev Number: 2 (DW_TAG_member)
    <d5820>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <d5824>   DW_AT_decl_file   : 9
    <d5825>   DW_AT_decl_line   : 103
    <d5826>   DW_AT_decl_column : 23
    <d5827>   DW_AT_type        : <0xd554a>
    <d582b>   DW_AT_data_member_location: 72
 <2><d582c>: Abbrev Number: 2 (DW_TAG_member)
    <d582d>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <d5831>   DW_AT_decl_file   : 9
    <d5832>   DW_AT_decl_line   : 104
    <d5833>   DW_AT_decl_column : 23
    <d5834>   DW_AT_type        : <0xd5570>
    <d5838>   DW_AT_data_member_location: 80
 <2><d5839>: Abbrev Number: 2 (DW_TAG_member)
    <d583a>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <d583e>   DW_AT_decl_file   : 9
    <d583f>   DW_AT_decl_line   : 105
    <d5840>   DW_AT_decl_column : 24
    <d5841>   DW_AT_type        : <0xd55a6>
    <d5845>   DW_AT_data_member_location: 88
 <2><d5846>: Abbrev Number: 2 (DW_TAG_member)
    <d5847>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <d584b>   DW_AT_decl_file   : 9
    <d584c>   DW_AT_decl_line   : 106
    <d584d>   DW_AT_decl_column : 25
    <d584e>   DW_AT_type        : <0xd55cc>
    <d5852>   DW_AT_data_member_location: 96
 <2><d5853>: Abbrev Number: 2 (DW_TAG_member)
    <d5854>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <d5858>   DW_AT_decl_file   : 9
    <d5859>   DW_AT_decl_line   : 107
    <d585a>   DW_AT_decl_column : 23
    <d585b>   DW_AT_type        : <0xd55f2>
    <d585f>   DW_AT_data_member_location: 104
 <2><d5860>: Abbrev Number: 2 (DW_TAG_member)
    <d5861>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <d5865>   DW_AT_decl_file   : 9
    <d5866>   DW_AT_decl_line   : 108
    <d5867>   DW_AT_decl_column : 23
    <d5868>   DW_AT_type        : <0xd5684>
    <d586c>   DW_AT_data_member_location: 112
 <2><d586d>: Abbrev Number: 2 (DW_TAG_member)
    <d586e>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <d5872>   DW_AT_decl_file   : 9
    <d5873>   DW_AT_decl_line   : 109
    <d5874>   DW_AT_decl_column : 23
    <d5875>   DW_AT_type        : <0xd56a4>
    <d5879>   DW_AT_data_member_location: 120
 <2><d587a>: Abbrev Number: 2 (DW_TAG_member)
    <d587b>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <d587f>   DW_AT_decl_file   : 9
    <d5880>   DW_AT_decl_line   : 110
    <d5881>   DW_AT_decl_column : 23
    <d5882>   DW_AT_type        : <0xd56d8>
    <d5886>   DW_AT_data_member_location: 128
 <2><d5887>: Abbrev Number: 2 (DW_TAG_member)
    <d5888>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <d588c>   DW_AT_decl_file   : 9
    <d588d>   DW_AT_decl_line   : 111
    <d588e>   DW_AT_decl_column : 23
    <d588f>   DW_AT_type        : <0xd5707>
    <d5893>   DW_AT_data_member_location: 136
 <2><d5894>: Abbrev Number: 2 (DW_TAG_member)
    <d5895>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <d5899>   DW_AT_decl_file   : 9
    <d589a>   DW_AT_decl_line   : 112
    <d589b>   DW_AT_decl_column : 23
    <d589c>   DW_AT_type        : <0xd5727>
    <d58a0>   DW_AT_data_member_location: 144
 <2><d58a1>: Abbrev Number: 2 (DW_TAG_member)
    <d58a2>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <d58a6>   DW_AT_decl_file   : 9
    <d58a7>   DW_AT_decl_line   : 113
    <d58a8>   DW_AT_decl_column : 25
    <d58a9>   DW_AT_type        : <0xd5501>
    <d58ad>   DW_AT_data_member_location: 152
 <2><d58ae>: Abbrev Number: 2 (DW_TAG_member)
    <d58af>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <d58b3>   DW_AT_decl_file   : 9
    <d58b4>   DW_AT_decl_line   : 114
    <d58b5>   DW_AT_decl_column : 24
    <d58b6>   DW_AT_type        : <0xd5617>
    <d58ba>   DW_AT_data_member_location: 160
 <2><d58bb>: Abbrev Number: 2 (DW_TAG_member)
    <d58bc>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <d58c0>   DW_AT_decl_file   : 9
    <d58c1>   DW_AT_decl_line   : 115
    <d58c2>   DW_AT_decl_column : 25
    <d58c3>   DW_AT_type        : <0xd5650>
    <d58c7>   DW_AT_data_member_location: 168
 <2><d58c8>: Abbrev Number: 2 (DW_TAG_member)
    <d58c9>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <d58cd>   DW_AT_decl_file   : 9
    <d58ce>   DW_AT_decl_line   : 116
    <d58cf>   DW_AT_decl_column : 23
    <d58d0>   DW_AT_type        : <0xd557c>
    <d58d4>   DW_AT_data_member_location: 176
 <2><d58d5>: Abbrev Number: 2 (DW_TAG_member)
    <d58d6>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <d58da>   DW_AT_decl_file   : 9
    <d58db>   DW_AT_decl_line   : 117
    <d58dc>   DW_AT_decl_column : 23
    <d58dd>   DW_AT_type        : <0xd574c>
    <d58e1>   DW_AT_data_member_location: 184
 <2><d58e2>: Abbrev Number: 2 (DW_TAG_member)
    <d58e3>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <d58e7>   DW_AT_decl_file   : 9
    <d58e8>   DW_AT_decl_line   : 118
    <d58e9>   DW_AT_decl_column : 22
    <d58ea>   DW_AT_type        : <0xd5758>
    <d58ee>   DW_AT_data_member_location: 192
 <2><d58ef>: Abbrev Number: 2 (DW_TAG_member)
    <d58f0>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <d58f4>   DW_AT_decl_file   : 9
    <d58f5>   DW_AT_decl_line   : 119
    <d58f6>   DW_AT_decl_column : 23
    <d58f7>   DW_AT_type        : <0xd5764>
    <d58fb>   DW_AT_data_member_location: 200
 <2><d58fc>: Abbrev Number: 2 (DW_TAG_member)
    <d58fd>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <d5901>   DW_AT_decl_file   : 9
    <d5902>   DW_AT_decl_line   : 120
    <d5903>   DW_AT_decl_column : 22
    <d5904>   DW_AT_type        : <0xd5770>
    <d5908>   DW_AT_data_member_location: 208
 <2><d5909>: Abbrev Number: 2 (DW_TAG_member)
    <d590a>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <d590e>   DW_AT_decl_file   : 9
    <d590f>   DW_AT_decl_line   : 121
    <d5910>   DW_AT_decl_column : 23
    <d5911>   DW_AT_type        : <0xd577c>
    <d5915>   DW_AT_data_member_location: 216
 <2><d5916>: Abbrev Number: 0
 <1><d5917>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5918>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <d591c>   DW_AT_decl_file   : 9
    <d591d>   DW_AT_decl_line   : 122
    <d591e>   DW_AT_decl_column : 3
    <d591f>   DW_AT_type        : <0xd579d>
 <1><d5923>: Abbrev Number: 39 (DW_TAG_structure_type)
    <d5924>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <d5928>   DW_AT_byte_size   : 20848
    <d592a>   DW_AT_decl_file   : 10
    <d592b>   DW_AT_decl_line   : 349
    <d592d>   DW_AT_decl_column : 16
    <d592e>   DW_AT_sibling     : <0xd59a3>
 <2><d5932>: Abbrev Number: 11 (DW_TAG_member)
    <d5933>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <d5937>   DW_AT_decl_file   : 10
    <d5937>   DW_AT_decl_line   : 350
    <d5939>   DW_AT_decl_column : 18
    <d5939>   DW_AT_type        : <0xd4ef1>
    <d593d>   DW_AT_data_member_location: 0
 <2><d593e>: Abbrev Number: 11 (DW_TAG_member)
    <d593f>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <d5943>   DW_AT_decl_file   : 10
    <d5943>   DW_AT_decl_line   : 351
    <d5945>   DW_AT_decl_column : 18
    <d5945>   DW_AT_type        : <0xd4f89>
    <d5949>   DW_AT_data_member_location: 8
 <2><d594a>: Abbrev Number: 11 (DW_TAG_member)
    <d594b>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <d594f>   DW_AT_decl_file   : 10
    <d594f>   DW_AT_decl_line   : 352
    <d5951>   DW_AT_decl_column : 18
    <d5951>   DW_AT_type        : <0xd4fd5>
    <d5955>   DW_AT_data_member_location: 16
 <2><d5956>: Abbrev Number: 11 (DW_TAG_member)
    <d5957>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <d595b>   DW_AT_decl_file   : 10
    <d595b>   DW_AT_decl_line   : 353
    <d595d>   DW_AT_decl_column : 18
    <d595d>   DW_AT_type        : <0xd4f19>
    <d5961>   DW_AT_data_member_location: 40
 <2><d5962>: Abbrev Number: 11 (DW_TAG_member)
    <d5963>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <d5967>   DW_AT_decl_file   : 10
    <d5967>   DW_AT_decl_line   : 354
    <d5969>   DW_AT_decl_column : 18
    <d5969>   DW_AT_type        : <0xd5917>
    <d596d>   DW_AT_data_member_location: 48
 <2><d596e>: Abbrev Number: 13 (DW_TAG_member)
    <d596f>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <d5973>   DW_AT_decl_file   : 10
    <d5973>   DW_AT_decl_line   : 355
    <d5975>   DW_AT_decl_column : 18
    <d5975>   DW_AT_type        : <0xd59a3>
    <d5979>   DW_AT_data_member_location: 272
 <2><d597b>: Abbrev Number: 13 (DW_TAG_member)
    <d597c>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <d5980>   DW_AT_decl_file   : 10
    <d5980>   DW_AT_decl_line   : 356
    <d5982>   DW_AT_decl_column : 18
    <d5982>   DW_AT_type        : <0xd4ef1>
    <d5986>   DW_AT_data_member_location: 20832
 <2><d5988>: Abbrev Number: 13 (DW_TAG_member)
    <d5989>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <d598d>   DW_AT_decl_file   : 10
    <d598d>   DW_AT_decl_line   : 357
    <d598f>   DW_AT_decl_column : 18
    <d598f>   DW_AT_type        : <0xd4ef1>
    <d5993>   DW_AT_data_member_location: 20836
 <2><d5995>: Abbrev Number: 13 (DW_TAG_member)
    <d5996>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <d599a>   DW_AT_decl_file   : 10
    <d599a>   DW_AT_decl_line   : 358
    <d599c>   DW_AT_decl_column : 18
    <d599c>   DW_AT_type        : <0xd4f9a>
    <d59a0>   DW_AT_data_member_location: 20840
 <2><d59a2>: Abbrev Number: 0
 <1><d59a3>: Abbrev Number: 18 (DW_TAG_array_type)
    <d59a4>   DW_AT_type        : <0xd53b6>
    <d59a8>   DW_AT_sibling     : <0xd59b4>
 <2><d59ac>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <d59ad>   DW_AT_type        : <0xd4edc>
    <d59b1>   DW_AT_upper_bound : 256
 <2><d59b3>: Abbrev Number: 0
 <1><d59b4>: Abbrev Number: 17 (DW_TAG_typedef)
    <d59b5>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <d59b9>   DW_AT_decl_file   : 10
    <d59ba>   DW_AT_decl_line   : 359
    <d59bc>   DW_AT_decl_column : 3
    <d59bd>   DW_AT_type        : <0xd5923>
 <1><d59c1>: Abbrev Number: 41 (DW_TAG_variable)
    <d59c2>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <d59c6>   DW_AT_decl_file   : 10
    <d59c7>   DW_AT_decl_line   : 361
    <d59c9>   DW_AT_decl_column : 21
    <d59ca>   DW_AT_type        : <0xd59b4>
    <d59ce>   DW_AT_external    : 1
    <d59ce>   DW_AT_declaration : 1
 <1><d59ce>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d59cf>   DW_AT_external    : 1
    <d59cf>   DW_AT_name        : (indirect string, offset: 0x17063): strlen
    <d59d3>   DW_AT_decl_file   : 11
    <d59d4>   DW_AT_decl_line   : 391
    <d59d6>   DW_AT_decl_column : 15
    <d59d7>   DW_AT_prototyped  : 1
    <d59d7>   DW_AT_type        : <0xd4f2a>
    <d59db>   DW_AT_declaration : 1
    <d59db>   DW_AT_sibling     : <0xd59e5>
 <2><d59df>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d59e0>   DW_AT_type        : <0xd4f84>
 <2><d59e4>: Abbrev Number: 0
 <1><d59e5>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d59e6>   DW_AT_external    : 1
    <d59e6>   DW_AT_name        : (indirect string, offset: 0x1bc20): sprintf
    <d59ea>   DW_AT_decl_file   : 12
    <d59eb>   DW_AT_decl_line   : 334
    <d59ed>   DW_AT_decl_column : 12
    <d59ee>   DW_AT_prototyped  : 1
    <d59ee>   DW_AT_type        : <0xd4ef1>
    <d59f2>   DW_AT_declaration : 1
    <d59f2>   DW_AT_sibling     : <0xd5a02>
 <2><d59f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d59f7>   DW_AT_type        : <0xd4f19>
 <2><d59fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d59fc>   DW_AT_type        : <0xd4f84>
 <2><d5a00>: Abbrev Number: 42 (DW_TAG_unspecified_parameters)
 <2><d5a01>: Abbrev Number: 0
 <1><d5a02>: Abbrev Number: 43 (DW_TAG_subprogram)
    <d5a03>   DW_AT_external    : 1
    <d5a03>   DW_AT_name        : (indirect string, offset: 0x1beac): fb_hStrAllocTemp
    <d5a07>   DW_AT_decl_file   : 2
    <d5a08>   DW_AT_decl_line   : 109
    <d5a09>   DW_AT_decl_column : 21
    <d5a0a>   DW_AT_prototyped  : 1
    <d5a0a>   DW_AT_type        : <0xd52a6>
    <d5a0e>   DW_AT_declaration : 1
    <d5a0e>   DW_AT_sibling     : <0xd5a1d>
 <2><d5a12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5a13>   DW_AT_type        : <0xd52a6>
 <2><d5a17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <d5a18>   DW_AT_type        : <0xd4f5b>
 <2><d5a1c>: Abbrev Number: 0
 <1><d5a1d>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d5a1e>   DW_AT_external    : 1
    <d5a1e>   DW_AT_name        : (indirect string, offset: 0xdd72): fb_ULongintToStr
    <d5a22>   DW_AT_decl_file   : 1
    <d5a22>   DW_AT_decl_line   : 35
    <d5a23>   DW_AT_decl_column : 18
    <d5a23>   DW_AT_prototyped  : 1
    <d5a23>   DW_AT_type        : <0xd52a6>
    <d5a27>   DW_AT_low_pc      : 0x476430
    <d5a2f>   DW_AT_high_pc     : 0x69
    <d5a37>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5a39>   DW_AT_call_all_calls: 1
    <d5a39>   DW_AT_sibling     : <0xd5aef>
 <2><d5a3d>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <d5a3e>   DW_AT_name        : num
    <d5a42>   DW_AT_decl_file   : 1
    <d5a42>   DW_AT_decl_line   : 35
    <d5a43>   DW_AT_decl_column : 56
    <d5a44>   DW_AT_type        : <0xd4f67>
    <d5a48>   DW_AT_location    : 0x3ed75 (location list)
    <d5a4c>   DW_AT_GNU_locviews: 0x3ed6f
 <2><d5a50>: Abbrev Number: 26 (DW_TAG_variable)
    <d5a51>   DW_AT_name        : dst
    <d5a55>   DW_AT_decl_file   : 1
    <d5a55>   DW_AT_decl_line   : 37
    <d5a56>   DW_AT_decl_column : 13
    <d5a56>   DW_AT_type        : <0xd52a6>
    <d5a5a>   DW_AT_location    : 0x3ed8f (location list)
    <d5a5e>   DW_AT_GNU_locviews: 0x3ed8b
 <2><d5a62>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <d5a63>   DW_AT_abstract_origin: <0xd5bc1>
    <d5a67>   DW_AT_entry_pc    : 0x476476
    <d5a6f>   DW_AT_GNU_entry_view: 0
    <d5a70>   DW_AT_low_pc      : 0x476476
    <d5a78>   DW_AT_high_pc     : 0x17
    <d5a80>   DW_AT_call_file   : 1
    <d5a80>   DW_AT_call_line   : 50
    <d5a81>   DW_AT_call_column : 3
    <d5a81>   DW_AT_sibling     : <0xd5aa0>
 <3><d5a85>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5a86>   DW_AT_abstract_origin: <0xd5bd6>
    <d5a8a>   DW_AT_location    : 0x3eda2 (location list)
    <d5a8e>   DW_AT_GNU_locviews: 0x3ed9e
 <3><d5a92>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5a93>   DW_AT_abstract_origin: <0xd5bca>
    <d5a97>   DW_AT_location    : 0x3edb3 (location list)
    <d5a9b>   DW_AT_GNU_locviews: 0x3edb1
 <3><d5a9f>: Abbrev Number: 0
 <2><d5aa0>: Abbrev Number: 15 (DW_TAG_call_site)
    <d5aa1>   DW_AT_call_return_pc: 0x47644e
    <d5aa9>   DW_AT_call_origin : <0xd5a02>
    <d5aad>   DW_AT_sibling     : <0xd5abc>
 <3><d5ab1>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5ab2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d5ab4>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><d5ab6>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5ab7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d5ab9>   DW_AT_call_value  : 1 byte block: 48 	(DW_OP_lit24)
 <3><d5abb>: Abbrev Number: 0
 <2><d5abc>: Abbrev Number: 15 (DW_TAG_call_site)
    <d5abd>   DW_AT_call_return_pc: 0x47646a
    <d5ac5>   DW_AT_call_origin : <0xd59e5>
    <d5ac9>   DW_AT_sibling     : <0xd5ae1>
 <3><d5acd>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5ace>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d5ad0>   DW_AT_call_value  : 9 byte block: 3 af 41 48 0 0 0 0 0 	(DW_OP_addr: 4841af)
 <3><d5ada>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5adb>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d5add>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><d5ae0>: Abbrev Number: 0
 <2><d5ae1>: Abbrev Number: 28 (DW_TAG_call_site)
    <d5ae2>   DW_AT_call_return_pc: 0x476473
    <d5aea>   DW_AT_call_origin : <0xd59ce>
 <2><d5aee>: Abbrev Number: 0
 <1><d5aef>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d5af0>   DW_AT_external    : 1
    <d5af0>   DW_AT_name        : (indirect string, offset: 0x1249d): fb_LongintToStr
    <d5af4>   DW_AT_decl_file   : 1
    <d5af4>   DW_AT_decl_line   : 11
    <d5af5>   DW_AT_decl_column : 18
    <d5af5>   DW_AT_prototyped  : 1
    <d5af5>   DW_AT_type        : <0xd52a6>
    <d5af9>   DW_AT_low_pc      : 0x4763c0
    <d5b01>   DW_AT_high_pc     : 0x69
    <d5b09>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5b0b>   DW_AT_call_all_calls: 1
    <d5b0b>   DW_AT_sibling     : <0xd5bc1>
 <2><d5b0f>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <d5b10>   DW_AT_name        : num
    <d5b14>   DW_AT_decl_file   : 1
    <d5b14>   DW_AT_decl_line   : 11
    <d5b15>   DW_AT_decl_column : 46
    <d5b16>   DW_AT_type        : <0xd4f48>
    <d5b1a>   DW_AT_location    : 0x3edc1 (location list)
    <d5b1e>   DW_AT_GNU_locviews: 0x3edbb
 <2><d5b22>: Abbrev Number: 26 (DW_TAG_variable)
    <d5b23>   DW_AT_name        : dst
    <d5b27>   DW_AT_decl_file   : 1
    <d5b27>   DW_AT_decl_line   : 13
    <d5b28>   DW_AT_decl_column : 13
    <d5b28>   DW_AT_type        : <0xd52a6>
    <d5b2c>   DW_AT_location    : 0x3edd8 (location list)
    <d5b30>   DW_AT_GNU_locviews: 0x3edd4
 <2><d5b34>: Abbrev Number: 27 (DW_TAG_inlined_subroutine)
    <d5b35>   DW_AT_abstract_origin: <0xd5bc1>
    <d5b39>   DW_AT_entry_pc    : 0x476406
    <d5b41>   DW_AT_GNU_entry_view: 0
    <d5b42>   DW_AT_low_pc      : 0x476406
    <d5b4a>   DW_AT_high_pc     : 0x17
    <d5b52>   DW_AT_call_file   : 1
    <d5b52>   DW_AT_call_line   : 26
    <d5b53>   DW_AT_call_column : 3
    <d5b53>   DW_AT_sibling     : <0xd5b72>
 <3><d5b57>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5b58>   DW_AT_abstract_origin: <0xd5bd6>
    <d5b5c>   DW_AT_location    : 0x3ede7 (location list)
    <d5b60>   DW_AT_GNU_locviews: 0x3ede3
 <3><d5b64>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5b65>   DW_AT_abstract_origin: <0xd5bca>
    <d5b69>   DW_AT_location    : 0x3edf4 (location list)
    <d5b6d>   DW_AT_GNU_locviews: 0x3edf2
 <3><d5b71>: Abbrev Number: 0
 <2><d5b72>: Abbrev Number: 15 (DW_TAG_call_site)
    <d5b73>   DW_AT_call_return_pc: 0x4763de
    <d5b7b>   DW_AT_call_origin : <0xd5a02>
    <d5b7f>   DW_AT_sibling     : <0xd5b8e>
 <3><d5b83>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5b84>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d5b86>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><d5b88>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5b89>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d5b8b>   DW_AT_call_value  : 1 byte block: 48 	(DW_OP_lit24)
 <3><d5b8d>: Abbrev Number: 0
 <2><d5b8e>: Abbrev Number: 15 (DW_TAG_call_site)
    <d5b8f>   DW_AT_call_return_pc: 0x4763fa
    <d5b97>   DW_AT_call_origin : <0xd59e5>
    <d5b9b>   DW_AT_sibling     : <0xd5bb3>
 <3><d5b9f>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5ba0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d5ba2>   DW_AT_call_value  : 9 byte block: 3 31 49 48 0 0 0 0 0 	(DW_OP_addr: 484931)
 <3><d5bac>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <d5bad>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d5baf>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><d5bb2>: Abbrev Number: 0
 <2><d5bb3>: Abbrev Number: 28 (DW_TAG_call_site)
    <d5bb4>   DW_AT_call_return_pc: 0x476403
    <d5bbc>   DW_AT_call_origin : <0xd59ce>
 <2><d5bc0>: Abbrev Number: 0
 <1><d5bc1>: Abbrev Number: 44 (DW_TAG_subprogram)
    <d5bc2>   DW_AT_name        : (indirect string, offset: 0x1bff0): fb_hStrSetLength
    <d5bc6>   DW_AT_decl_file   : 2
    <d5bc7>   DW_AT_decl_line   : 101
    <d5bc8>   DW_AT_decl_column : 24
    <d5bc9>   DW_AT_prototyped  : 1
    <d5bc9>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><d5bca>: Abbrev Number: 45 (DW_TAG_formal_parameter)
    <d5bcb>   DW_AT_name        : str
    <d5bcf>   DW_AT_decl_file   : 2
    <d5bd0>   DW_AT_decl_line   : 101
    <d5bd1>   DW_AT_decl_column : 52
    <d5bd2>   DW_AT_type        : <0xd52a6>
 <2><d5bd6>: Abbrev Number: 46 (DW_TAG_formal_parameter)
    <d5bd7>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d5bdb>   DW_AT_decl_file   : 2
    <d5bdc>   DW_AT_decl_line   : 101
    <d5bdd>   DW_AT_decl_column : 64
    <d5bde>   DW_AT_type        : <0xd4f2a>
 <2><d5be2>: Abbrev Number: 0
 <1><d5be3>: Abbrev Number: 0
  Compilation Unit @ offset 0xd5be4:
   Length:        0xd5e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x13a37
   Pointer Size:  8
 <0><d5bf0>: Abbrev Number: 35 (DW_TAG_compile_unit)
    <d5bf1>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <d5bf5>   DW_AT_language    : 29	(C11)
    <d5bf6>   DW_AT_name        : (indirect line string, offset: 0x13af): src/rtlib/str_core.c
    <d5bfa>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <d5bfe>   DW_AT_low_pc      : 0x4764a0
    <d5c06>   DW_AT_high_pc     : 0x644
    <d5c0e>   DW_AT_stmt_list   : 0x6b1a6
 <1><d5c12>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c13>   DW_AT_byte_size   : 1
    <d5c14>   DW_AT_encoding    : 8	(unsigned char)
    <d5c15>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><d5c19>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c1a>   DW_AT_byte_size   : 2
    <d5c1b>   DW_AT_encoding    : 7	(unsigned)
    <d5c1c>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><d5c20>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c21>   DW_AT_byte_size   : 4
    <d5c22>   DW_AT_encoding    : 7	(unsigned)
    <d5c23>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><d5c27>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c28>   DW_AT_byte_size   : 8
    <d5c29>   DW_AT_encoding    : 7	(unsigned)
    <d5c2a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><d5c2e>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c2f>   DW_AT_byte_size   : 1
    <d5c30>   DW_AT_encoding    : 6	(signed char)
    <d5c31>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><d5c35>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c36>   DW_AT_byte_size   : 2
    <d5c37>   DW_AT_encoding    : 5	(signed)
    <d5c38>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><d5c3c>: Abbrev Number: 36 (DW_TAG_base_type)
    <d5c3d>   DW_AT_byte_size   : 4
    <d5c3e>   DW_AT_encoding    : 5	(signed)
    <d5c3f>   DW_AT_name        : int
 <1><d5c43>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c44>   DW_AT_byte_size   : 8
    <d5c45>   DW_AT_encoding    : 5	(signed)
    <d5c46>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><d5c4a>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <d5c4b>   DW_AT_byte_size   : 8
 <1><d5c4c>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5c4d>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <d5c51>   DW_AT_decl_file   : 4
    <d5c52>   DW_AT_decl_line   : 194
    <d5c53>   DW_AT_decl_column : 27
    <d5c54>   DW_AT_type        : <0xd5c43>
 <1><d5c58>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5c59>   DW_AT_byte_size   : 8
    <d5c59>   DW_AT_type        : <0xd5c5d>
 <1><d5c5d>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c5e>   DW_AT_byte_size   : 1
    <d5c5f>   DW_AT_encoding    : 6	(signed char)
    <d5c60>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><d5c64>: Abbrev Number: 38 (DW_TAG_const_type)
    <d5c65>   DW_AT_type        : <0xd5c5d>
 <1><d5c69>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5c6a>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <d5c6e>   DW_AT_decl_file   : 5
    <d5c6f>   DW_AT_decl_line   : 209
    <d5c70>   DW_AT_decl_column : 23
    <d5c71>   DW_AT_type        : <0xd5c27>
 <1><d5c75>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c76>   DW_AT_byte_size   : 8
    <d5c77>   DW_AT_encoding    : 5	(signed)
    <d5c78>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><d5c7c>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5c7d>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <d5c81>   DW_AT_decl_file   : 6
    <d5c82>   DW_AT_decl_line   : 108
    <d5c83>   DW_AT_decl_column : 19
    <d5c84>   DW_AT_type        : <0xd5c4c>
 <1><d5c88>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5c89>   DW_AT_byte_size   : 8
    <d5c8a>   DW_AT_encoding    : 7	(unsigned)
    <d5c8b>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><d5c8f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5c90>   DW_AT_byte_size   : 8
    <d5c90>   DW_AT_type        : <0xd5c94>
 <1><d5c94>: Abbrev Number: 39 (DW_TAG_const_type)
 <1><d5c95>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5c96>   DW_AT_byte_size   : 8
    <d5c96>   DW_AT_type        : <0xd5c64>
 <1><d5c9a>: Abbrev Number: 27 (DW_TAG_structure_type)
    <d5c9b>   DW_AT_name        : (indirect string, offset: 0x1c044): _FB_LISTELEM
    <d5c9f>   DW_AT_byte_size   : 16
    <d5ca0>   DW_AT_decl_file   : 3
    <d5ca0>   DW_AT_decl_line   : 298
    <d5ca2>   DW_AT_decl_column : 16
    <d5ca2>   DW_AT_sibling     : <0xd5cc1>
 <2><d5ca6>: Abbrev Number: 13 (DW_TAG_member)
    <d5ca7>   DW_AT_name        : (indirect string, offset: 0x18ed6): prev
    <d5cab>   DW_AT_decl_file   : 3
    <d5cab>   DW_AT_decl_line   : 299
    <d5cad>   DW_AT_decl_column : 29
    <d5cae>   DW_AT_type        : <0xd5cc1>
    <d5cb2>   DW_AT_data_member_location: 0
 <2><d5cb3>: Abbrev Number: 13 (DW_TAG_member)
    <d5cb4>   DW_AT_name        : (indirect string, offset: 0x190a5): next
    <d5cb8>   DW_AT_decl_file   : 3
    <d5cb8>   DW_AT_decl_line   : 300
    <d5cba>   DW_AT_decl_column : 29
    <d5cbb>   DW_AT_type        : <0xd5cc1>
    <d5cbf>   DW_AT_data_member_location: 8
 <2><d5cc0>: Abbrev Number: 0
 <1><d5cc1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5cc2>   DW_AT_byte_size   : 8
    <d5cc2>   DW_AT_type        : <0xd5c9a>
 <1><d5cc6>: Abbrev Number: 28 (DW_TAG_typedef)
    <d5cc7>   DW_AT_name        : (indirect string, offset: 0x1c045): FB_LISTELEM
    <d5ccb>   DW_AT_decl_file   : 3
    <d5ccb>   DW_AT_decl_line   : 301
    <d5ccd>   DW_AT_decl_column : 3
    <d5ccd>   DW_AT_type        : <0xd5c9a>
 <1><d5cd1>: Abbrev Number: 27 (DW_TAG_structure_type)
    <d5cd2>   DW_AT_name        : (indirect string, offset: 0x1c0ec): _FB_LIST
    <d5cd6>   DW_AT_byte_size   : 32
    <d5cd7>   DW_AT_decl_file   : 3
    <d5cd7>   DW_AT_decl_line   : 303
    <d5cd9>   DW_AT_decl_column : 16
    <d5cd9>   DW_AT_sibling     : <0xd5d13>
 <2><d5cdd>: Abbrev Number: 40 (DW_TAG_member)
    <d5cde>   DW_AT_name        : cnt
    <d5ce2>   DW_AT_decl_file   : 3
    <d5ce3>   DW_AT_decl_line   : 304
    <d5ce5>   DW_AT_decl_column : 24
    <d5ce6>   DW_AT_type        : <0xd5c3c>
    <d5cea>   DW_AT_data_member_location: 0
 <2><d5ceb>: Abbrev Number: 13 (DW_TAG_member)
    <d5cec>   DW_AT_name        : (indirect string, offset: 0x1676d): head
    <d5cf0>   DW_AT_decl_file   : 3
    <d5cf0>   DW_AT_decl_line   : 305
    <d5cf2>   DW_AT_decl_column : 25
    <d5cf3>   DW_AT_type        : <0xd5d13>
    <d5cf7>   DW_AT_data_member_location: 8
 <2><d5cf8>: Abbrev Number: 13 (DW_TAG_member)
    <d5cf9>   DW_AT_name        : (indirect string, offset: 0x16609): tail
    <d5cfd>   DW_AT_decl_file   : 3
    <d5cfd>   DW_AT_decl_line   : 306
    <d5cff>   DW_AT_decl_column : 25
    <d5d00>   DW_AT_type        : <0xd5d13>
    <d5d04>   DW_AT_data_member_location: 16
 <2><d5d05>: Abbrev Number: 13 (DW_TAG_member)
    <d5d06>   DW_AT_name        : (indirect string, offset: 0x1c0c4): fhead
    <d5d0a>   DW_AT_decl_file   : 3
    <d5d0a>   DW_AT_decl_line   : 307
    <d5d0c>   DW_AT_decl_column : 25
    <d5d0d>   DW_AT_type        : <0xd5d13>
    <d5d11>   DW_AT_data_member_location: 24
 <2><d5d12>: Abbrev Number: 0
 <1><d5d13>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5d14>   DW_AT_byte_size   : 8
    <d5d14>   DW_AT_type        : <0xd5cc6>
 <1><d5d18>: Abbrev Number: 28 (DW_TAG_typedef)
    <d5d19>   DW_AT_name        : (indirect string, offset: 0x1c0ed): FB_LIST
    <d5d1d>   DW_AT_decl_file   : 3
    <d5d1d>   DW_AT_decl_line   : 308
    <d5d1f>   DW_AT_decl_column : 3
    <d5d1f>   DW_AT_type        : <0xd5cd1>
 <1><d5d23>: Abbrev Number: 29 (DW_TAG_structure_type)
    <d5d24>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <d5d28>   DW_AT_byte_size   : 24
    <d5d29>   DW_AT_decl_file   : 2
    <d5d29>   DW_AT_decl_line   : 82
    <d5d2a>   DW_AT_decl_column : 16
    <d5d2a>   DW_AT_sibling     : <0xd5d52>
 <2><d5d2e>: Abbrev Number: 19 (DW_TAG_member)
    <d5d2f>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <d5d33>   DW_AT_decl_file   : 2
    <d5d33>   DW_AT_decl_line   : 83
    <d5d34>   DW_AT_decl_column : 21
    <d5d34>   DW_AT_type        : <0xd5c58>
    <d5d38>   DW_AT_data_member_location: 0
 <2><d5d39>: Abbrev Number: 41 (DW_TAG_member)
    <d5d3a>   DW_AT_name        : len
    <d5d3e>   DW_AT_decl_file   : 2
    <d5d3f>   DW_AT_decl_line   : 84
    <d5d40>   DW_AT_decl_column : 21
    <d5d41>   DW_AT_type        : <0xd5c7c>
    <d5d45>   DW_AT_data_member_location: 8
 <2><d5d46>: Abbrev Number: 19 (DW_TAG_member)
    <d5d47>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d5d4b>   DW_AT_decl_file   : 2
    <d5d4b>   DW_AT_decl_line   : 85
    <d5d4c>   DW_AT_decl_column : 21
    <d5d4c>   DW_AT_type        : <0xd5c7c>
    <d5d50>   DW_AT_data_member_location: 16
 <2><d5d51>: Abbrev Number: 0
 <1><d5d52>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5d53>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <d5d57>   DW_AT_decl_file   : 2
    <d5d58>   DW_AT_decl_line   : 86
    <d5d59>   DW_AT_decl_column : 3
    <d5d5a>   DW_AT_type        : <0xd5d23>
 <1><d5d5e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <d5d5f>   DW_AT_name        : (indirect string, offset: 0x1c0a2): _FB_STR_TMPDESC
    <d5d63>   DW_AT_byte_size   : 40
    <d5d64>   DW_AT_decl_file   : 2
    <d5d64>   DW_AT_decl_line   : 89
    <d5d65>   DW_AT_decl_column : 16
    <d5d65>   DW_AT_sibling     : <0xd5d80>
 <2><d5d69>: Abbrev Number: 19 (DW_TAG_member)
    <d5d6a>   DW_AT_name        : (indirect string, offset: 0x1c0ca): elem
    <d5d6e>   DW_AT_decl_file   : 2
    <d5d6e>   DW_AT_decl_line   : 90
    <d5d6f>   DW_AT_decl_column : 21
    <d5d6f>   DW_AT_type        : <0xd5cc6>
    <d5d73>   DW_AT_data_member_location: 0
 <2><d5d74>: Abbrev Number: 19 (DW_TAG_member)
    <d5d75>   DW_AT_name        : (indirect string, offset: 0x17885): desc
    <d5d79>   DW_AT_decl_file   : 2
    <d5d79>   DW_AT_decl_line   : 91
    <d5d7a>   DW_AT_decl_column : 21
    <d5d7a>   DW_AT_type        : <0xd5d52>
    <d5d7e>   DW_AT_data_member_location: 16
 <2><d5d7f>: Abbrev Number: 0
 <1><d5d80>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5d81>   DW_AT_name        : (indirect string, offset: 0x1c0a3): FB_STR_TMPDESC
    <d5d85>   DW_AT_decl_file   : 2
    <d5d86>   DW_AT_decl_line   : 92
    <d5d87>   DW_AT_decl_column : 3
    <d5d88>   DW_AT_type        : <0xd5d5e>
 <1><d5d8c>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5d8d>   DW_AT_byte_size   : 8
    <d5d8e>   DW_AT_encoding    : 4	(float)
    <d5d8f>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><d5d93>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5d94>   DW_AT_byte_size   : 4
    <d5d95>   DW_AT_encoding    : 4	(float)
    <d5d96>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><d5d9a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5d9b>   DW_AT_byte_size   : 8
    <d5d9b>   DW_AT_type        : <0xd5d52>
 <1><d5d9f>: Abbrev Number: 6 (DW_TAG_base_type)
    <d5da0>   DW_AT_byte_size   : 16
    <d5da1>   DW_AT_encoding    : 4	(float)
    <d5da2>   DW_AT_name        : (indirect string, offset: 0x184ef): long double
 <1><d5da6>: Abbrev Number: 30 (DW_TAG_variable)
    <d5da7>   DW_AT_name        : (indirect string, offset: 0x1c0e2): tmpdsList
    <d5dab>   DW_AT_decl_file   : 1
    <d5dab>   DW_AT_decl_line   : 18
    <d5dac>   DW_AT_decl_column : 16
    <d5dad>   DW_AT_type        : <0xd5d18>
    <d5db1>   DW_AT_location    : 9 byte block: 3 a0 93 4c 0 0 0 0 0 	(DW_OP_addr: 4c93a0)
 <1><d5dbb>: Abbrev Number: 42 (DW_TAG_array_type)
    <d5dbc>   DW_AT_type        : <0xd5d80>
    <d5dc0>   DW_AT_sibling     : <0xd5dcb>
 <2><d5dc4>: Abbrev Number: 43 (DW_TAG_subrange_type)
    <d5dc5>   DW_AT_type        : <0xd5c27>
    <d5dc9>   DW_AT_upper_bound : 255
 <2><d5dca>: Abbrev Number: 0
 <1><d5dcb>: Abbrev Number: 30 (DW_TAG_variable)
    <d5dcc>   DW_AT_name        : (indirect string, offset: 0x1c051): fb_tmpdsTB
    <d5dd0>   DW_AT_decl_file   : 1
    <d5dd0>   DW_AT_decl_line   : 20
    <d5dd1>   DW_AT_decl_column : 23
    <d5dd2>   DW_AT_type        : <0xd5dbb>
    <d5dd6>   DW_AT_location    : 9 byte block: 3 a0 6b 4c 0 0 0 0 0 	(DW_OP_addr: 4c6ba0)
 <1><d5de0>: Abbrev Number: 44 (DW_TAG_subprogram)
    <d5de1>   DW_AT_external    : 1
    <d5de1>   DW_AT_name        : (indirect string, offset: 0x1a955): memcpy
    <d5de5>   DW_AT_decl_file   : 7
    <d5de6>   DW_AT_decl_line   : 43
    <d5de7>   DW_AT_decl_column : 14
    <d5de8>   DW_AT_prototyped  : 1
    <d5de8>   DW_AT_type        : <0xd5c4a>
    <d5dec>   DW_AT_declaration : 1
    <d5dec>   DW_AT_sibling     : <0xd5e00>
 <2><d5df0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5df1>   DW_AT_type        : <0xd5c4a>
 <2><d5df5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5df6>   DW_AT_type        : <0xd5c8f>
 <2><d5dfa>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5dfb>   DW_AT_type        : <0xd5c69>
 <2><d5dff>: Abbrev Number: 0
 <1><d5e00>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d5e01>   DW_AT_external    : 1
    <d5e01>   DW_AT_name        : (indirect string, offset: 0x179c0): realloc
    <d5e05>   DW_AT_decl_file   : 8
    <d5e06>   DW_AT_decl_line   : 550
    <d5e08>   DW_AT_decl_column : 14
    <d5e09>   DW_AT_prototyped  : 1
    <d5e09>   DW_AT_type        : <0xd5c4a>
    <d5e0d>   DW_AT_declaration : 1
    <d5e0d>   DW_AT_sibling     : <0xd5e1c>
 <2><d5e11>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e12>   DW_AT_type        : <0xd5c4a>
 <2><d5e16>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e17>   DW_AT_type        : <0xd5c69>
 <2><d5e1b>: Abbrev Number: 0
 <1><d5e1c>: Abbrev Number: 45 (DW_TAG_subprogram)
    <d5e1d>   DW_AT_external    : 1
    <d5e1d>   DW_AT_name        : (indirect string, offset: 0x129ce): fb_StrDelete
    <d5e21>   DW_AT_decl_file   : 2
    <d5e22>   DW_AT_decl_line   : 123
    <d5e23>   DW_AT_decl_column : 21
    <d5e24>   DW_AT_prototyped  : 1
    <d5e24>   DW_AT_declaration : 1
    <d5e24>   DW_AT_sibling     : <0xd5e2e>
 <2><d5e28>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e29>   DW_AT_type        : <0xd5d9a>
 <2><d5e2d>: Abbrev Number: 0
 <1><d5e2e>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d5e2f>   DW_AT_external    : 1
    <d5e2f>   DW_AT_name        : (indirect string, offset: 0xe63c): malloc
    <d5e33>   DW_AT_decl_file   : 8
    <d5e34>   DW_AT_decl_line   : 539
    <d5e36>   DW_AT_decl_column : 14
    <d5e37>   DW_AT_prototyped  : 1
    <d5e37>   DW_AT_type        : <0xd5c4a>
    <d5e3b>   DW_AT_declaration : 1
    <d5e3b>   DW_AT_sibling     : <0xd5e45>
 <2><d5e3f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e40>   DW_AT_type        : <0xd5c69>
 <2><d5e44>: Abbrev Number: 0
 <1><d5e45>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d5e46>   DW_AT_external    : 1
    <d5e46>   DW_AT_name        : (indirect string, offset: 0x1c08a): fb_hListFreeElem
    <d5e4a>   DW_AT_decl_file   : 3
    <d5e4a>   DW_AT_decl_line   : 312
    <d5e4c>   DW_AT_decl_column : 21
    <d5e4c>   DW_AT_prototyped  : 1
    <d5e4c>   DW_AT_declaration : 1
    <d5e4c>   DW_AT_sibling     : <0xd5e5b>
 <2><d5e50>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e51>   DW_AT_type        : <0xd5e5b>
 <2><d5e55>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e56>   DW_AT_type        : <0xd5d13>
 <2><d5e5a>: Abbrev Number: 0
 <1><d5e5b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5e5c>   DW_AT_byte_size   : 8
    <d5e5c>   DW_AT_type        : <0xd5d18>
 <1><d5e60>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d5e61>   DW_AT_external    : 1
    <d5e61>   DW_AT_name        : (indirect string, offset: 0x1c0b2): fb_hListAllocElem
    <d5e65>   DW_AT_decl_file   : 3
    <d5e66>   DW_AT_decl_line   : 311
    <d5e68>   DW_AT_decl_column : 21
    <d5e69>   DW_AT_prototyped  : 1
    <d5e69>   DW_AT_type        : <0xd5d13>
    <d5e6d>   DW_AT_declaration : 1
    <d5e6d>   DW_AT_sibling     : <0xd5e77>
 <2><d5e71>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e72>   DW_AT_type        : <0xd5e5b>
 <2><d5e76>: Abbrev Number: 0
 <1><d5e77>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d5e78>   DW_AT_external    : 1
    <d5e78>   DW_AT_name        : (indirect string, offset: 0x1c07d): fb_hListInit
    <d5e7c>   DW_AT_decl_file   : 3
    <d5e7c>   DW_AT_decl_line   : 310
    <d5e7e>   DW_AT_decl_column : 21
    <d5e7e>   DW_AT_prototyped  : 1
    <d5e7e>   DW_AT_declaration : 1
    <d5e7e>   DW_AT_sibling     : <0xd5e97>
 <2><d5e82>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e83>   DW_AT_type        : <0xd5e5b>
 <2><d5e87>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e88>   DW_AT_type        : <0xd5c4a>
 <2><d5e8c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e8d>   DW_AT_type        : <0xd5c69>
 <2><d5e91>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5e92>   DW_AT_type        : <0xd5c69>
 <2><d5e96>: Abbrev Number: 0
 <1><d5e97>: Abbrev Number: 46 (DW_TAG_subprogram)
    <d5e98>   DW_AT_external    : 1
    <d5e98>   DW_AT_name        : (indirect string, offset: 0x1be8d): fb_hStrCopy
    <d5e9c>   DW_AT_decl_file   : 1
    <d5e9d>   DW_AT_decl_line   : 213
    <d5e9e>   DW_AT_decl_column : 13
    <d5e9f>   DW_AT_prototyped  : 1
    <d5e9f>   DW_AT_low_pc      : 0x476ab0
    <d5ea7>   DW_AT_high_pc     : 0x34
    <d5eaf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5eb1>   DW_AT_call_all_calls: 1
    <d5eb1>   DW_AT_sibling     : <0xd5f59>
 <2><d5eb5>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5eb6>   DW_AT_name        : dst
    <d5eba>   DW_AT_decl_file   : 1
    <d5eba>   DW_AT_decl_line   : 213
    <d5ebb>   DW_AT_decl_column : 32
    <d5ebc>   DW_AT_type        : <0xd5c58>
    <d5ec0>   DW_AT_location    : 0x3ee0c (location list)
    <d5ec4>   DW_AT_GNU_locviews: 0x3ee06
 <2><d5ec8>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5ec9>   DW_AT_name        : src
    <d5ecd>   DW_AT_decl_file   : 1
    <d5ecd>   DW_AT_decl_line   : 213
    <d5ece>   DW_AT_decl_column : 49
    <d5ecf>   DW_AT_type        : <0xd5c95>
    <d5ed3>   DW_AT_location    : 0x3ee2b (location list)
    <d5ed7>   DW_AT_GNU_locviews: 0x3ee25
 <2><d5edb>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <d5edc>   DW_AT_name        : (indirect string, offset: 0x1dd07): bytes
    <d5ee0>   DW_AT_decl_file   : 1
    <d5ee0>   DW_AT_decl_line   : 213
    <d5ee1>   DW_AT_decl_column : 62
    <d5ee2>   DW_AT_type        : <0xd5c7c>
    <d5ee6>   DW_AT_location    : 0x3ee4c (location list)
    <d5eea>   DW_AT_GNU_locviews: 0x3ee44
 <2><d5eee>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <d5eef>   DW_AT_abstract_origin: <0xd648d>
    <d5ef3>   DW_AT_entry_pc    : 0x476ac8
    <d5efb>   DW_AT_GNU_entry_view: 1
    <d5efc>   DW_AT_low_pc      : 0x476ac8
    <d5f04>   DW_AT_high_pc     : 0xb
    <d5f0c>   DW_AT_call_file   : 1
    <d5f0c>   DW_AT_call_line   : 217
    <d5f0d>   DW_AT_call_column : 24
 <3><d5f0e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5f0f>   DW_AT_abstract_origin: <0xd64b6>
    <d5f13>   DW_AT_location    : 0x3ee70 (location list)
    <d5f17>   DW_AT_GNU_locviews: 0x3ee6c
 <3><d5f1b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5f1c>   DW_AT_abstract_origin: <0xd64ac>
    <d5f20>   DW_AT_location    : 0x3ee83 (location list)
    <d5f24>   DW_AT_GNU_locviews: 0x3ee7f
 <3><d5f28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5f29>   DW_AT_abstract_origin: <0xd649f>
    <d5f2d>   DW_AT_location    : 0x3ee99 (location list)
    <d5f31>   DW_AT_GNU_locviews: 0x3ee95
 <3><d5f35>: Abbrev Number: 4 (DW_TAG_call_site)
    <d5f36>   DW_AT_call_return_pc: 0x476acd
    <d5f3e>   DW_AT_call_origin : <0xd693a>
 <4><d5f42>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d5f43>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d5f45>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <4><d5f49>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d5f4a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d5f4c>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <4><d5f50>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d5f51>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <d5f53>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <4><d5f56>: Abbrev Number: 0
 <3><d5f57>: Abbrev Number: 0
 <2><d5f58>: Abbrev Number: 0
 <1><d5f59>: Abbrev Number: 26 (DW_TAG_subprogram)
    <d5f5a>   DW_AT_external    : 1
    <d5f5a>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <d5f5e>   DW_AT_decl_file   : 1
    <d5f5e>   DW_AT_decl_line   : 200
    <d5f5f>   DW_AT_decl_column : 12
    <d5f60>   DW_AT_prototyped  : 1
    <d5f60>   DW_AT_type        : <0xd5c3c>
    <d5f64>   DW_AT_low_pc      : 0x476a40
    <d5f6c>   DW_AT_high_pc     : 0x6b
    <d5f74>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5f76>   DW_AT_call_all_calls: 1
    <d5f76>   DW_AT_sibling     : <0xd6052>
 <2><d5f7a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d5f7b>   DW_AT_name        : str
    <d5f7f>   DW_AT_decl_file   : 1
    <d5f7f>   DW_AT_decl_line   : 200
    <d5f80>   DW_AT_decl_column : 38
    <d5f81>   DW_AT_type        : <0xd5d9a>
    <d5f85>   DW_AT_location    : 0x3eeb7 (location list)
    <d5f89>   DW_AT_GNU_locviews: 0x3eeab
 <2><d5f8d>: Abbrev Number: 32 (DW_TAG_variable)
    <d5f8e>   DW_AT_name        : res
    <d5f92>   DW_AT_decl_file   : 1
    <d5f92>   DW_AT_decl_line   : 202
    <d5f93>   DW_AT_decl_column : 6
    <d5f94>   DW_AT_type        : <0xd5c3c>
    <d5f98>   DW_AT_location    : 0x3eee9 (location list)
    <d5f9c>   DW_AT_GNU_locviews: 0x3eee7
 <2><d5fa0>: Abbrev Number: 9 (DW_TAG_inlined_subroutine)
    <d5fa1>   DW_AT_abstract_origin: <0xd6052>
    <d5fa5>   DW_AT_entry_pc    : 0x476a40
    <d5fad>   DW_AT_GNU_entry_view: 4
    <d5fae>   DW_AT_ranges      : 0x18533
    <d5fb2>   DW_AT_call_file   : 1
    <d5fb2>   DW_AT_call_line   : 206
    <d5fb3>   DW_AT_call_column : 8
 <3><d5fb4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5fb5>   DW_AT_abstract_origin: <0xd6061>
    <d5fb9>   DW_AT_location    : 0x3eefc (location list)
    <d5fbd>   DW_AT_GNU_locviews: 0x3eef2
 <3><d5fc1>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <d5fc2>   DW_AT_abstract_origin: <0xd6405>
    <d5fc6>   DW_AT_entry_pc    : 0x476a50
    <d5fce>   DW_AT_GNU_entry_view: 1
    <d5fcf>   DW_AT_low_pc      : 0x476a50
    <d5fd7>   DW_AT_high_pc     : 0x38
    <d5fdf>   DW_AT_call_file   : 1
    <d5fdf>   DW_AT_call_line   : 197
    <d5fe0>   DW_AT_call_column : 12
    <d5fe1>   DW_AT_sibling     : <0xd6043>
 <4><d5fe5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5fe6>   DW_AT_abstract_origin: <0xd6414>
    <d5fea>   DW_AT_location    : 0x3ef28 (location list)
    <d5fee>   DW_AT_GNU_locviews: 0x3ef22
 <4><d5ff2>: Abbrev Number: 5 (DW_TAG_variable)
    <d5ff3>   DW_AT_abstract_origin: <0xd6420>
    <d5ff7>   DW_AT_location    : 0x3ef46 (location list)
    <d5ffb>   DW_AT_GNU_locviews: 0x3ef40
 <4><d5fff>: Abbrev Number: 9 (DW_TAG_inlined_subroutine)
    <d6000>   DW_AT_abstract_origin: <0xd6431>
    <d6004>   DW_AT_entry_pc    : 0x476a6b
    <d600c>   DW_AT_GNU_entry_view: 1
    <d600d>   DW_AT_ranges      : 0x18548
    <d6011>   DW_AT_call_file   : 1
    <d6011>   DW_AT_call_line   : 62
    <d6012>   DW_AT_call_column : 2
 <5><d6013>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d6014>   DW_AT_abstract_origin: <0xd643e>
    <d6018>   DW_AT_location    : 0x3ef62 (location list)
    <d601c>   DW_AT_GNU_locviews: 0x3ef5e
 <5><d6020>: Abbrev Number: 4 (DW_TAG_call_site)
    <d6021>   DW_AT_call_return_pc: 0x476a77
    <d6029>   DW_AT_call_origin : <0xd5e45>
 <6><d602d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d602e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d6030>   DW_AT_call_value  : 9 byte block: 3 a0 93 4c 0 0 0 0 0 	(DW_OP_addr: 4c93a0)
 <6><d603a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d603b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d603d>   DW_AT_call_value  : 2 byte block: 73 70 	(DW_OP_breg3 (rbx): -16)
 <6><d6040>: Abbrev Number: 0
 <5><d6041>: Abbrev Number: 0
 <4><d6042>: Abbrev Number: 0
 <3><d6043>: Abbrev Number: 16 (DW_TAG_call_site)
    <d6044>   DW_AT_call_return_pc: 0x476a95
    <d604c>   DW_AT_call_origin : <0xd5e1c>
 <3><d6050>: Abbrev Number: 0
 <2><d6051>: Abbrev Number: 0
 <1><d6052>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d6053>   DW_AT_external    : 1
    <d6053>   DW_AT_name        : (indirect string, offset: 0x1be5f): fb_hStrDelTemp_NoLock
    <d6057>   DW_AT_decl_file   : 1
    <d6057>   DW_AT_decl_line   : 187
    <d6058>   DW_AT_decl_column : 12
    <d6059>   DW_AT_prototyped  : 1
    <d6059>   DW_AT_type        : <0xd5c3c>
    <d605d>   DW_AT_inline      : 1	(not inlined)
    <d605d>   DW_AT_sibling     : <0xd606e>
 <2><d6061>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <d6062>   DW_AT_name        : str
    <d6066>   DW_AT_decl_file   : 1
    <d6067>   DW_AT_decl_line   : 187
    <d6068>   DW_AT_decl_column : 45
    <d6069>   DW_AT_type        : <0xd5d9a>
 <2><d606d>: Abbrev Number: 0
 <1><d606e>: Abbrev Number: 26 (DW_TAG_subprogram)
    <d606f>   DW_AT_external    : 1
    <d606f>   DW_AT_name        : (indirect string, offset: 0x1beac): fb_hStrAllocTemp
    <d6073>   DW_AT_decl_file   : 1
    <d6073>   DW_AT_decl_line   : 174
    <d6074>   DW_AT_decl_column : 18
    <d6075>   DW_AT_prototyped  : 1
    <d6075>   DW_AT_type        : <0xd5d9a>
    <d6079>   DW_AT_low_pc      : 0x476850
    <d6081>   DW_AT_high_pc     : 0x17f
    <d6089>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d608b>   DW_AT_call_all_calls: 1
    <d608b>   DW_AT_sibling     : <0xd62c6>
 <2><d608f>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d6090>   DW_AT_name        : str
    <d6094>   DW_AT_decl_file   : 1
    <d6094>   DW_AT_decl_line   : 174
    <d6095>   DW_AT_decl_column : 46
    <d6096>   DW_AT_type        : <0xd5d9a>
    <d609a>   DW_AT_location    : 0x3ef81 (location list)
    <d609e>   DW_AT_GNU_locviews: 0x3ef73
 <2><d60a2>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <d60a3>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <d60a7>   DW_AT_decl_file   : 1
    <d60a7>   DW_AT_decl_line   : 174
    <d60a8>   DW_AT_decl_column : 59
    <d60a9>   DW_AT_type        : <0xd5c7c>
    <d60ad>   DW_AT_location    : 0x3efc5 (location list)
    <d60b1>   DW_AT_GNU_locviews: 0x3efb9
 <2><d60b5>: Abbrev Number: 32 (DW_TAG_variable)
    <d60b6>   DW_AT_name        : res
    <d60ba>   DW_AT_decl_file   : 1
    <d60ba>   DW_AT_decl_line   : 176
    <d60bb>   DW_AT_decl_column : 15
    <d60bc>   DW_AT_type        : <0xd5d9a>
    <d60c0>   DW_AT_location    : 0x3eff8 (location list)
    <d60c4>   DW_AT_GNU_locviews: 0x3eff6
 <2><d60c8>: Abbrev Number: 9 (DW_TAG_inlined_subroutine)
    <d60c9>   DW_AT_abstract_origin: <0xd62c6>
    <d60cd>   DW_AT_entry_pc    : 0x476850
    <d60d5>   DW_AT_GNU_entry_view: 4
    <d60d6>   DW_AT_ranges      : 0x184de
    <d60da>   DW_AT_call_file   : 1
    <d60da>   DW_AT_call_line   : 180
    <d60db>   DW_AT_call_column : 11
 <3><d60dc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d60dd>   DW_AT_abstract_origin: <0xd62e1>
    <d60e1>   DW_AT_location    : 0x3f00b (location list)
    <d60e5>   DW_AT_GNU_locviews: 0x3f001
 <3><d60e9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d60ea>   DW_AT_abstract_origin: <0xd62d5>
    <d60ee>   DW_AT_location    : 0x3f042 (location list)
    <d60f2>   DW_AT_GNU_locviews: 0x3f032
 <3><d60f6>: Abbrev Number: 10 (DW_TAG_lexical_block)
    <d60f7>   DW_AT_ranges      : 0x184de
 <4><d60fb>: Abbrev Number: 5 (DW_TAG_variable)
    <d60fc>   DW_AT_abstract_origin: <0xd62ed>
    <d6100>   DW_AT_location    : 0x3f089 (location list)
    <d6104>   DW_AT_GNU_locviews: 0x3f07b
 <4><d6108>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <d6109>   DW_AT_abstract_origin: <0xd62f9>
    <d610d>   DW_AT_entry_pc    : 0x476865
    <d6115>   DW_AT_GNU_entry_view: 1
    <d6116>   DW_AT_ranges      : 0x184fd
    <d611a>   DW_AT_call_file   : 1
    <d611a>   DW_AT_call_line   : 162
    <d611b>   DW_AT_call_column : 9
    <d611c>   DW_AT_sibling     : <0xd61de>
 <5><d6120>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d6121>   DW_AT_abstract_origin: <0xd6320>
    <d6125>   DW_AT_location    : 0x3f0f6 (location list)
    <d6129>   DW_AT_GNU_locviews: 0x3f0ee
 <5><d612d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d612e>   DW_AT_abstract_origin: <0xd6314>
    <d6132>   DW_AT_location    : 0x3f121 (location list)
    <d6136>   DW_AT_GNU_locviews: 0x3f117
 <5><d613a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d613b>   DW_AT_abstract_origin: <0xd6308>
    <d613f>   DW_AT_location    : 0x3f14f (location list)
    <d6143>   DW_AT_GNU_locviews: 0x3f145
 <5><d6147>: Abbrev Number: 10 (DW_TAG_lexical_block)
    <d6148>   DW_AT_ranges      : 0x184fd
 <6><d614c>: Abbrev Number: 5 (DW_TAG_variable)
    <d614d>   DW_AT_abstract_origin: <0xd632c>
    <d6151>   DW_AT_location    : 0x3f17f (location list)
    <d6155>   DW_AT_GNU_locviews: 0x3f173
 <6><d6159>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <d615a>   DW_AT_abstract_origin: <0xd6467>
    <d615e>   DW_AT_entry_pc    : 0x4768a8
    <d6166>   DW_AT_GNU_entry_view: 1
    <d6167>   DW_AT_low_pc      : 0x4768a8
    <d616f>   DW_AT_high_pc     : 0x0
    <d6177>   DW_AT_call_file   : 1
    <d6177>   DW_AT_call_line   : 146
    <d6178>   DW_AT_call_column : 2
    <d6179>   DW_AT_sibling     : <0xd6198>
 <7><d617d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d617e>   DW_AT_abstract_origin: <0xd6480>
    <d6182>   DW_AT_location    : 0x3f1ac (location list)
    <d6186>   DW_AT_GNU_locviews: 0x3f1aa
 <7><d618a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d618b>   DW_AT_abstract_origin: <0xd6474>
    <d618f>   DW_AT_location    : 0x3f1b6 (location list)
    <d6193>   DW_AT_GNU_locviews: 0x3f1b4
 <7><d6197>: Abbrev Number: 0
 <6><d6198>: Abbrev Number: 8 (DW_TAG_call_site)
    <d6199>   DW_AT_call_return_pc: 0x476891
    <d61a1>   DW_AT_call_origin : <0xd5e1c>
    <d61a5>   DW_AT_sibling     : <0xd61b0>
 <7><d61a9>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d61aa>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d61ac>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <7><d61af>: Abbrev Number: 0
 <6><d61b0>: Abbrev Number: 8 (DW_TAG_call_site)
