    <c2a39>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <c2a3d>   DW_AT_decl_file   : 8
    <c2a3e>   DW_AT_decl_line   : 49
    <c2a3f>   DW_AT_decl_column : 17
    <c2a40>   DW_AT_type        : <0xc2aee>
    <c2a44>   DW_AT_data_member_location: 176
 <2><c2a45>: Abbrev Number: 1 (DW_TAG_member)
    <c2a46>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <c2a4a>   DW_AT_decl_file   : 8
    <c2a4b>   DW_AT_decl_line   : 49
    <c2a4c>   DW_AT_decl_column : 31
    <c2a4d>   DW_AT_type        : <0xc2aee>
    <c2a51>   DW_AT_data_member_location: 184
 <2><c2a52>: Abbrev Number: 1 (DW_TAG_member)
    <c2a53>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <c2a57>   DW_AT_decl_file   : 8
    <c2a58>   DW_AT_decl_line   : 51
    <c2a59>   DW_AT_decl_column : 6
    <c2a5a>   DW_AT_type        : <0xc2686>
    <c2a5e>   DW_AT_data_member_location: 192
 <2><c2a5f>: Abbrev Number: 1 (DW_TAG_member)
    <c2a60>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <c2a64>   DW_AT_decl_file   : 8
    <c2a65>   DW_AT_decl_line   : 53
    <c2a66>   DW_AT_decl_column : 6
    <c2a67>   DW_AT_type        : <0xc2686>
    <c2a6b>   DW_AT_data_member_location: 196
 <2><c2a6c>: Abbrev Number: 13 (DW_TAG_member)
    <c2a6d>   DW_AT_name        : seq
    <c2a71>   DW_AT_decl_file   : 8
    <c2a71>   DW_AT_decl_line   : 54
    <c2a72>   DW_AT_decl_column : 8
    <c2a73>   DW_AT_type        : <0xc2af3>
    <c2a77>   DW_AT_data_member_location: 200
 <2><c2a78>: Abbrev Number: 6 (DW_TAG_member)
    <c2a79>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <c2a7d>   DW_AT_decl_file   : 8
    <c2a7d>   DW_AT_decl_line   : 55
    <c2a7e>   DW_AT_decl_column : 8
    <c2a7f>   DW_AT_type        : <0xc2978>
    <c2a83>   DW_AT_data_member_location: 336
 <2><c2a85>: Abbrev Number: 6 (DW_TAG_member)
    <c2a86>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <c2a8a>   DW_AT_decl_file   : 8
    <c2a8a>   DW_AT_decl_line   : 56
    <c2a8b>   DW_AT_decl_column : 8
    <c2a8c>   DW_AT_type        : <0xc2978>
    <c2a90>   DW_AT_data_member_location: 344
 <2><c2a92>: Abbrev Number: 6 (DW_TAG_member)
    <c2a93>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <c2a97>   DW_AT_decl_file   : 8
    <c2a97>   DW_AT_decl_line   : 57
    <c2a98>   DW_AT_decl_column : 9
    <c2a99>   DW_AT_type        : <0xc2964>
    <c2a9d>   DW_AT_data_member_location: 352
 <2><c2a9f>: Abbrev Number: 6 (DW_TAG_member)
    <c2aa0>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <c2aa4>   DW_AT_decl_file   : 8
    <c2aa4>   DW_AT_decl_line   : 58
    <c2aa5>   DW_AT_decl_column : 9
    <c2aa6>   DW_AT_type        : <0xc2964>
    <c2aaa>   DW_AT_data_member_location: 360
 <2><c2aac>: Abbrev Number: 6 (DW_TAG_member)
    <c2aad>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <c2ab1>   DW_AT_decl_file   : 8
    <c2ab1>   DW_AT_decl_line   : 59
    <c2ab2>   DW_AT_decl_column : 8
    <c2ab3>   DW_AT_type        : <0xc2978>
    <c2ab7>   DW_AT_data_member_location: 368
 <2><c2ab9>: Abbrev Number: 6 (DW_TAG_member)
    <c2aba>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <c2abe>   DW_AT_decl_file   : 8
    <c2abe>   DW_AT_decl_line   : 60
    <c2abf>   DW_AT_decl_column : 9
    <c2ac0>   DW_AT_type        : <0xc2964>
    <c2ac4>   DW_AT_data_member_location: 376
 <2><c2ac6>: Abbrev Number: 6 (DW_TAG_member)
    <c2ac7>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <c2acb>   DW_AT_decl_file   : 8
    <c2acb>   DW_AT_decl_line   : 61
    <c2acc>   DW_AT_decl_column : 9
    <c2acd>   DW_AT_type        : <0xc2964>
    <c2ad1>   DW_AT_data_member_location: 384
 <2><c2ad3>: Abbrev Number: 6 (DW_TAG_member)
    <c2ad4>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <c2ad8>   DW_AT_decl_file   : 8
    <c2ad8>   DW_AT_decl_line   : 62
    <c2ad9>   DW_AT_decl_column : 9
    <c2ada>   DW_AT_type        : <0xc2b18>
    <c2ade>   DW_AT_data_member_location: 392
 <2><c2ae0>: Abbrev Number: 6 (DW_TAG_member)
    <c2ae1>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <c2ae5>   DW_AT_decl_file   : 8
    <c2ae5>   DW_AT_decl_line   : 63
    <c2ae6>   DW_AT_decl_column : 9
    <c2ae7>   DW_AT_type        : <0xc2964>
    <c2aeb>   DW_AT_data_member_location: 400
 <2><c2aed>: Abbrev Number: 0
 <1><c2aee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c2aef>   DW_AT_byte_size   : 8
    <c2aef>   DW_AT_type        : <0xc265c>
 <1><c2af3>: Abbrev Number: 10 (DW_TAG_array_type)
    <c2af4>   DW_AT_type        : <0xc26ae>
    <c2af8>   DW_AT_sibling     : <0xc2b03>
 <2><c2afc>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c2afd>   DW_AT_type        : <0xc2671>
    <c2b01>   DW_AT_upper_bound : 16
 <2><c2b02>: Abbrev Number: 0
 <1><c2b03>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <c2b04>   DW_AT_prototyped  : 1
    <c2b04>   DW_AT_sibling     : <0xc2b18>
 <2><c2b08>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b09>   DW_AT_type        : <0xc2686>
 <2><c2b0d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b0e>   DW_AT_type        : <0xc2686>
 <2><c2b12>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b13>   DW_AT_type        : <0xc2686>
 <2><c2b17>: Abbrev Number: 0
 <1><c2b18>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c2b19>   DW_AT_byte_size   : 8
    <c2b19>   DW_AT_type        : <0xc2b03>
 <1><c2b1d>: Abbrev Number: 7 (DW_TAG_typedef)
    <c2b1e>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c2b22>   DW_AT_decl_file   : 8
    <c2b23>   DW_AT_decl_line   : 64
    <c2b24>   DW_AT_decl_column : 3
    <c2b25>   DW_AT_type        : <0xc2987>
 <1><c2b29>: Abbrev Number: 26 (DW_TAG_variable)
    <c2b2a>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <c2b2e>   DW_AT_decl_file   : 8
    <c2b2f>   DW_AT_decl_line   : 66
    <c2b30>   DW_AT_decl_column : 18
    <c2b31>   DW_AT_type        : <0xc2b1d>
    <c2b35>   DW_AT_external    : 1
    <c2b35>   DW_AT_declaration : 1
 <1><c2b35>: Abbrev Number: 15 (DW_TAG_subprogram)
    <c2b36>   DW_AT_external    : 1
    <c2b36>   DW_AT_name        : (indirect string, offset: 0x1b80c): fb_hTermOut
    <c2b3a>   DW_AT_decl_file   : 8
    <c2b3b>   DW_AT_decl_line   : 73
    <c2b3c>   DW_AT_decl_column : 5
    <c2b3d>   DW_AT_prototyped  : 1
    <c2b3d>   DW_AT_type        : <0xc2686>
    <c2b41>   DW_AT_declaration : 1
    <c2b41>   DW_AT_sibling     : <0xc2b55>
 <2><c2b45>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b46>   DW_AT_type        : <0xc2686>
 <2><c2b4a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b4b>   DW_AT_type        : <0xc2686>
 <2><c2b4f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b50>   DW_AT_type        : <0xc2686>
 <2><c2b54>: Abbrev Number: 0
 <1><c2b55>: Abbrev Number: 15 (DW_TAG_subprogram)
    <c2b56>   DW_AT_external    : 1
    <c2b56>   DW_AT_name        : (indirect string, offset: 0x5beb): memset
    <c2b5a>   DW_AT_decl_file   : 9
    <c2b5b>   DW_AT_decl_line   : 61
    <c2b5c>   DW_AT_decl_column : 14
    <c2b5d>   DW_AT_prototyped  : 1
    <c2b5d>   DW_AT_type        : <0xc26ac>
    <c2b61>   DW_AT_declaration : 1
    <c2b61>   DW_AT_sibling     : <0xc2b75>
 <2><c2b65>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b66>   DW_AT_type        : <0xc26ac>
 <2><c2b6a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b6b>   DW_AT_type        : <0xc2686>
 <2><c2b6f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b70>   DW_AT_type        : <0xc26ba>
 <2><c2b74>: Abbrev Number: 0
 <1><c2b75>: Abbrev Number: 27 (DW_TAG_subprogram)
    <c2b76>   DW_AT_external    : 1
    <c2b76>   DW_AT_name        : (indirect string, offset: 0x1b7dc): fb_ConsoleGetMaxRow
    <c2b7a>   DW_AT_decl_file   : 10
    <c2b7b>   DW_AT_decl_line   : 65
    <c2b7c>   DW_AT_decl_column : 21
    <c2b7d>   DW_AT_prototyped  : 1
    <c2b7d>   DW_AT_type        : <0xc2686>
    <c2b81>   DW_AT_declaration : 1
 <1><c2b81>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c2b82>   DW_AT_external    : 1
    <c2b82>   DW_AT_name        : (indirect string, offset: 0x1aaca): fb_ConsoleGetView
    <c2b86>   DW_AT_decl_file   : 10
    <c2b87>   DW_AT_decl_line   : 64
    <c2b88>   DW_AT_decl_column : 21
    <c2b89>   DW_AT_prototyped  : 1
    <c2b89>   DW_AT_declaration : 1
    <c2b89>   DW_AT_sibling     : <0xc2b98>
 <2><c2b8d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b8e>   DW_AT_type        : <0xc2982>
 <2><c2b92>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2b93>   DW_AT_type        : <0xc2982>
 <2><c2b97>: Abbrev Number: 0
 <1><c2b98>: Abbrev Number: 17 (DW_TAG_subprogram)
    <c2b99>   DW_AT_external    : 1
    <c2b99>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <c2b9d>   DW_AT_decl_file   : 11
    <c2b9d>   DW_AT_decl_line   : 25
    <c2b9e>   DW_AT_decl_column : 13
    <c2b9e>   DW_AT_prototyped  : 1
    <c2b9e>   DW_AT_declaration : 1
 <1><c2b9e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c2b9f>   DW_AT_external    : 1
    <c2b9f>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <c2ba3>   DW_AT_decl_file   : 8
    <c2ba4>   DW_AT_decl_line   : 72
    <c2ba5>   DW_AT_decl_column : 6
    <c2ba6>   DW_AT_prototyped  : 1
    <c2ba6>   DW_AT_declaration : 1
    <c2ba6>   DW_AT_sibling     : <0xc2bb0>
 <2><c2baa>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c2bab>   DW_AT_type        : <0xc2686>
 <2><c2baf>: Abbrev Number: 0
 <1><c2bb0>: Abbrev Number: 17 (DW_TAG_subprogram)
    <c2bb1>   DW_AT_external    : 1
    <c2bb1>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <c2bb5>   DW_AT_decl_file   : 11
    <c2bb5>   DW_AT_decl_line   : 24
    <c2bb6>   DW_AT_decl_column : 13
    <c2bb6>   DW_AT_prototyped  : 1
    <c2bb6>   DW_AT_declaration : 1
 <1><c2bb6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <c2bb7>   DW_AT_external    : 1
    <c2bb7>   DW_AT_name        : (indirect string, offset: 0x1b5de): fb_ConsoleClear
    <c2bbb>   DW_AT_decl_file   : 1
    <c2bbc>   DW_AT_decl_line   : 6
    <c2bbd>   DW_AT_decl_column : 6
    <c2bbe>   DW_AT_prototyped  : 1
    <c2bbe>   DW_AT_low_pc      : 0x4720f0
    <c2bc6>   DW_AT_high_pc     : 0x15a
    <c2bce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c2bd0>   DW_AT_call_all_calls: 1
    <c2bd0>   DW_AT_sibling     : <0xc2d0c>
 <2><c2bd4>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <c2bd5>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <c2bd9>   DW_AT_decl_file   : 1
    <c2bda>   DW_AT_decl_line   : 6
    <c2bdb>   DW_AT_decl_column : 27
    <c2bdc>   DW_AT_type        : <0xc2686>
    <c2be0>   DW_AT_location    : 0x3ad01 (location list)
    <c2be4>   DW_AT_GNU_locviews: 0x3acf7
 <2><c2be8>: Abbrev Number: 30 (DW_TAG_variable)
    <c2be9>   DW_AT_name        : (indirect string, offset: 0x18b60): start
    <c2bed>   DW_AT_decl_file   : 1
    <c2bee>   DW_AT_decl_line   : 8
    <c2bef>   DW_AT_decl_column : 6
    <c2bf0>   DW_AT_type        : <0xc2686>
    <c2bf4>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c2bf7>: Abbrev Number: 31 (DW_TAG_variable)
    <c2bf8>   DW_AT_name        : end
    <c2bfc>   DW_AT_decl_file   : 1
    <c2bfd>   DW_AT_decl_line   : 8
    <c2bfe>   DW_AT_decl_column : 13
    <c2bff>   DW_AT_type        : <0xc2686>
    <c2c03>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><c2c06>: Abbrev Number: 32 (DW_TAG_variable)
    <c2c07>   DW_AT_name        : i
    <c2c09>   DW_AT_decl_file   : 1
    <c2c0a>   DW_AT_decl_line   : 8
    <c2c0b>   DW_AT_decl_column : 18
    <c2c0c>   DW_AT_type        : <0xc2686>
    <c2c10>   DW_AT_location    : 0x3ad2e (location list)
    <c2c14>   DW_AT_GNU_locviews: 0x3ad26
 <2><c2c18>: Abbrev Number: 9 (DW_TAG_call_site)
    <c2c19>   DW_AT_call_return_pc: 0x472125
    <c2c21>   DW_AT_call_origin : <0xc2bb0>
 <2><c2c25>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2c26>   DW_AT_call_return_pc: 0x47212f
    <c2c2e>   DW_AT_call_origin : <0xc2b9e>
    <c2c32>   DW_AT_sibling     : <0xc2c3c>
 <3><c2c36>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2c37>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c2c39>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><c2c3b>: Abbrev Number: 0
 <2><c2c3c>: Abbrev Number: 9 (DW_TAG_call_site)
    <c2c3d>   DW_AT_call_return_pc: 0x472134
    <c2c45>   DW_AT_call_origin : <0xc2b98>
 <2><c2c49>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2c4a>   DW_AT_call_return_pc: 0x472141
    <c2c52>   DW_AT_call_origin : <0xc2b81>
    <c2c56>   DW_AT_sibling     : <0xc2c67>
 <3><c2c5a>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2c5b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c2c5d>   DW_AT_call_value  : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><c2c60>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2c61>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c2c63>   DW_AT_call_value  : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><c2c66>: Abbrev Number: 0
 <2><c2c67>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2c68>   DW_AT_call_return_pc: 0x4721a9
    <c2c70>   DW_AT_call_origin : <0xc2b55>
    <c2c74>   DW_AT_sibling     : <0xc2c7f>
 <3><c2c78>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2c79>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c2c7b>   DW_AT_call_value  : 2 byte block: 8 20 	(DW_OP_const1u: 32)
 <3><c2c7e>: Abbrev Number: 0
 <2><c2c7f>: Abbrev Number: 9 (DW_TAG_call_site)
    <c2c80>   DW_AT_call_return_pc: 0x4721d5
    <c2c88>   DW_AT_call_origin : <0xc2b55>
 <2><c2c8c>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2c8d>   DW_AT_call_return_pc: 0x4721e1
    <c2c95>   DW_AT_call_origin : <0xc2b35>
    <c2c99>   DW_AT_sibling     : <0xc2cae>
 <3><c2c9d>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2c9e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c2ca0>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2ca2>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2ca3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c2ca5>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2ca7>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2ca8>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <c2caa>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><c2cad>: Abbrev Number: 0
 <2><c2cae>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2caf>   DW_AT_call_return_pc: 0x4721ef
    <c2cb7>   DW_AT_call_origin : <0xc2b35>
    <c2cbb>   DW_AT_sibling     : <0xc2ccf>
 <3><c2cbf>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2cc0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c2cc2>   DW_AT_call_value  : 1 byte block: 34 	(DW_OP_lit4)
 <3><c2cc4>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2cc5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c2cc7>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2cc9>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2cca>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <c2ccc>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2cce>: Abbrev Number: 0
 <2><c2ccf>: Abbrev Number: 8 (DW_TAG_call_site)
    <c2cd0>   DW_AT_call_return_pc: 0x472204
    <c2cd8>   DW_AT_call_origin : <0xc2b35>
    <c2cdc>   DW_AT_sibling     : <0xc2cf1>
 <3><c2ce0>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2ce1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c2ce3>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2ce5>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2ce6>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c2ce8>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c2cea>: Abbrev Number: 2 (DW_TAG_call_site_parameter)
    <c2ceb>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <c2ced>   DW_AT_call_value  : 2 byte block: 73 7f 	(DW_OP_breg3 (rbx): -1)
 <3><c2cf0>: Abbrev Number: 0
 <2><c2cf1>: Abbrev Number: 9 (DW_TAG_call_site)
    <c2cf2>   DW_AT_call_return_pc: 0x47223c
    <c2cfa>   DW_AT_call_origin : <0xc2b75>
 <2><c2cfe>: Abbrev Number: 9 (DW_TAG_call_site)
    <c2cff>   DW_AT_call_return_pc: 0x47224a
    <c2d07>   DW_AT_call_origin : <0xc2d0c>
 <2><c2d0b>: Abbrev Number: 0
 <1><c2d0c>: Abbrev Number: 33 (DW_TAG_subprogram)
    <c2d0d>   DW_AT_external    : 1
    <c2d0d>   DW_AT_declaration : 1
    <c2d0d>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <c2d11>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><c2d15>: Abbrev Number: 0
  Compilation Unit @ offset 0xc2d16:
   Length:        0x592 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xf2e8
   Pointer Size:  8
 <0><c2d22>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <c2d23>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c2d27>   DW_AT_language    : 29	(C11)
    <c2d28>   DW_AT_name        : (indirect line string, offset: 0xf63): src/rtlib/unix/io_getsize.c
    <c2d2c>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c2d30>   DW_AT_low_pc      : 0x472250
    <c2d38>   DW_AT_high_pc     : 0x6e
    <c2d40>   DW_AT_stmt_list   : 0x66c67
 <1><c2d44>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d45>   DW_AT_byte_size   : 1
    <c2d46>   DW_AT_encoding    : 8	(unsigned char)
    <c2d47>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c2d4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d4c>   DW_AT_byte_size   : 2
    <c2d4d>   DW_AT_encoding    : 7	(unsigned)
    <c2d4e>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c2d52>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d53>   DW_AT_byte_size   : 4
    <c2d54>   DW_AT_encoding    : 7	(unsigned)
    <c2d55>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c2d59>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d5a>   DW_AT_byte_size   : 8
    <c2d5b>   DW_AT_encoding    : 7	(unsigned)
    <c2d5c>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c2d60>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d61>   DW_AT_byte_size   : 1
    <c2d62>   DW_AT_encoding    : 6	(signed char)
    <c2d63>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c2d67>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d68>   DW_AT_byte_size   : 2
    <c2d69>   DW_AT_encoding    : 5	(signed)
    <c2d6a>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c2d6e>: Abbrev Number: 16 (DW_TAG_base_type)
    <c2d6f>   DW_AT_byte_size   : 4
    <c2d70>   DW_AT_encoding    : 5	(signed)
    <c2d71>   DW_AT_name        : int
 <1><c2d75>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d76>   DW_AT_byte_size   : 8
    <c2d77>   DW_AT_encoding    : 5	(signed)
    <c2d78>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c2d7c>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2d7d>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <c2d81>   DW_AT_decl_file   : 2
    <c2d82>   DW_AT_decl_line   : 152
    <c2d83>   DW_AT_decl_column : 25
    <c2d84>   DW_AT_type        : <0xc2d75>
 <1><c2d88>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2d89>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c2d8d>   DW_AT_decl_file   : 2
    <c2d8e>   DW_AT_decl_line   : 153
    <c2d8f>   DW_AT_decl_column : 27
    <c2d90>   DW_AT_type        : <0xc2d75>
 <1><c2d94>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c2d95>   DW_AT_byte_size   : 8
 <1><c2d96>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2d97>   DW_AT_byte_size   : 8
    <c2d97>   DW_AT_type        : <0xc2d9b>
 <1><c2d9b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2d9c>   DW_AT_byte_size   : 1
    <c2d9d>   DW_AT_encoding    : 6	(signed char)
    <c2d9e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c2da2>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2da3>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c2da7>   DW_AT_decl_file   : 3
    <c2da8>   DW_AT_decl_line   : 209
    <c2da9>   DW_AT_decl_column : 23
    <c2daa>   DW_AT_type        : <0xc2d59>
 <1><c2dae>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2daf>   DW_AT_byte_size   : 8
    <c2db0>   DW_AT_encoding    : 5	(signed)
    <c2db1>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c2db5>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2db6>   DW_AT_byte_size   : 8
    <c2db7>   DW_AT_encoding    : 7	(unsigned)
    <c2db8>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c2dbc>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c2dbd>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <c2dc1>   DW_AT_byte_size   : 216
    <c2dc2>   DW_AT_decl_file   : 4
    <c2dc3>   DW_AT_decl_line   : 49
    <c2dc4>   DW_AT_decl_column : 8
    <c2dc4>   DW_AT_sibling     : <0xc2f42>
 <2><c2dc8>: Abbrev Number: 1 (DW_TAG_member)
    <c2dc9>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <c2dcd>   DW_AT_decl_file   : 4
    <c2dce>   DW_AT_decl_line   : 51
    <c2dcf>   DW_AT_decl_column : 7
    <c2dd0>   DW_AT_type        : <0xc2d6e>
    <c2dd4>   DW_AT_data_member_location: 0
 <2><c2dd5>: Abbrev Number: 1 (DW_TAG_member)
    <c2dd6>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <c2dda>   DW_AT_decl_file   : 4
    <c2ddb>   DW_AT_decl_line   : 54
    <c2ddc>   DW_AT_decl_column : 9
    <c2ddd>   DW_AT_type        : <0xc2d96>
    <c2de1>   DW_AT_data_member_location: 8
 <2><c2de2>: Abbrev Number: 1 (DW_TAG_member)
    <c2de3>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <c2de7>   DW_AT_decl_file   : 4
    <c2de8>   DW_AT_decl_line   : 55
    <c2de9>   DW_AT_decl_column : 9
    <c2dea>   DW_AT_type        : <0xc2d96>
    <c2dee>   DW_AT_data_member_location: 16
 <2><c2def>: Abbrev Number: 1 (DW_TAG_member)
    <c2df0>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <c2df4>   DW_AT_decl_file   : 4
    <c2df5>   DW_AT_decl_line   : 56
    <c2df6>   DW_AT_decl_column : 9
    <c2df7>   DW_AT_type        : <0xc2d96>
    <c2dfb>   DW_AT_data_member_location: 24
 <2><c2dfc>: Abbrev Number: 1 (DW_TAG_member)
    <c2dfd>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <c2e01>   DW_AT_decl_file   : 4
    <c2e02>   DW_AT_decl_line   : 57
    <c2e03>   DW_AT_decl_column : 9
    <c2e04>   DW_AT_type        : <0xc2d96>
    <c2e08>   DW_AT_data_member_location: 32
 <2><c2e09>: Abbrev Number: 1 (DW_TAG_member)
    <c2e0a>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <c2e0e>   DW_AT_decl_file   : 4
    <c2e0f>   DW_AT_decl_line   : 58
    <c2e10>   DW_AT_decl_column : 9
    <c2e11>   DW_AT_type        : <0xc2d96>
    <c2e15>   DW_AT_data_member_location: 40
 <2><c2e16>: Abbrev Number: 1 (DW_TAG_member)
    <c2e17>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <c2e1b>   DW_AT_decl_file   : 4
    <c2e1c>   DW_AT_decl_line   : 59
    <c2e1d>   DW_AT_decl_column : 9
    <c2e1e>   DW_AT_type        : <0xc2d96>
    <c2e22>   DW_AT_data_member_location: 48
 <2><c2e23>: Abbrev Number: 1 (DW_TAG_member)
    <c2e24>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <c2e28>   DW_AT_decl_file   : 4
    <c2e29>   DW_AT_decl_line   : 60
    <c2e2a>   DW_AT_decl_column : 9
    <c2e2b>   DW_AT_type        : <0xc2d96>
    <c2e2f>   DW_AT_data_member_location: 56
 <2><c2e30>: Abbrev Number: 1 (DW_TAG_member)
    <c2e31>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <c2e35>   DW_AT_decl_file   : 4
    <c2e36>   DW_AT_decl_line   : 61
    <c2e37>   DW_AT_decl_column : 9
    <c2e38>   DW_AT_type        : <0xc2d96>
    <c2e3c>   DW_AT_data_member_location: 64
 <2><c2e3d>: Abbrev Number: 1 (DW_TAG_member)
    <c2e3e>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <c2e42>   DW_AT_decl_file   : 4
    <c2e43>   DW_AT_decl_line   : 64
    <c2e44>   DW_AT_decl_column : 9
    <c2e45>   DW_AT_type        : <0xc2d96>
    <c2e49>   DW_AT_data_member_location: 72
 <2><c2e4a>: Abbrev Number: 1 (DW_TAG_member)
    <c2e4b>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <c2e4f>   DW_AT_decl_file   : 4
    <c2e50>   DW_AT_decl_line   : 65
    <c2e51>   DW_AT_decl_column : 9
    <c2e52>   DW_AT_type        : <0xc2d96>
    <c2e56>   DW_AT_data_member_location: 80
 <2><c2e57>: Abbrev Number: 1 (DW_TAG_member)
    <c2e58>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <c2e5c>   DW_AT_decl_file   : 4
    <c2e5d>   DW_AT_decl_line   : 66
    <c2e5e>   DW_AT_decl_column : 9
    <c2e5f>   DW_AT_type        : <0xc2d96>
    <c2e63>   DW_AT_data_member_location: 88
 <2><c2e64>: Abbrev Number: 1 (DW_TAG_member)
    <c2e65>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <c2e69>   DW_AT_decl_file   : 4
    <c2e6a>   DW_AT_decl_line   : 68
    <c2e6b>   DW_AT_decl_column : 22
    <c2e6c>   DW_AT_type        : <0xc2f5b>
    <c2e70>   DW_AT_data_member_location: 96
 <2><c2e71>: Abbrev Number: 1 (DW_TAG_member)
    <c2e72>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <c2e76>   DW_AT_decl_file   : 4
    <c2e77>   DW_AT_decl_line   : 70
    <c2e78>   DW_AT_decl_column : 20
    <c2e79>   DW_AT_type        : <0xc2f60>
    <c2e7d>   DW_AT_data_member_location: 104
 <2><c2e7e>: Abbrev Number: 1 (DW_TAG_member)
    <c2e7f>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <c2e83>   DW_AT_decl_file   : 4
    <c2e84>   DW_AT_decl_line   : 72
    <c2e85>   DW_AT_decl_column : 7
    <c2e86>   DW_AT_type        : <0xc2d6e>
    <c2e8a>   DW_AT_data_member_location: 112
 <2><c2e8b>: Abbrev Number: 1 (DW_TAG_member)
    <c2e8c>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <c2e90>   DW_AT_decl_file   : 4
    <c2e91>   DW_AT_decl_line   : 73
    <c2e92>   DW_AT_decl_column : 7
    <c2e93>   DW_AT_type        : <0xc2d6e>
    <c2e97>   DW_AT_data_member_location: 116
 <2><c2e98>: Abbrev Number: 1 (DW_TAG_member)
    <c2e99>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <c2e9d>   DW_AT_decl_file   : 4
    <c2e9e>   DW_AT_decl_line   : 74
    <c2e9f>   DW_AT_decl_column : 11
    <c2ea0>   DW_AT_type        : <0xc2d7c>
    <c2ea4>   DW_AT_data_member_location: 120
 <2><c2ea5>: Abbrev Number: 1 (DW_TAG_member)
    <c2ea6>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <c2eaa>   DW_AT_decl_file   : 4
    <c2eab>   DW_AT_decl_line   : 77
    <c2eac>   DW_AT_decl_column : 18
    <c2ead>   DW_AT_type        : <0xc2d4b>
    <c2eb1>   DW_AT_data_member_location: 128
 <2><c2eb2>: Abbrev Number: 1 (DW_TAG_member)
    <c2eb3>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <c2eb7>   DW_AT_decl_file   : 4
    <c2eb8>   DW_AT_decl_line   : 78
    <c2eb9>   DW_AT_decl_column : 15
    <c2eba>   DW_AT_type        : <0xc2d60>
    <c2ebe>   DW_AT_data_member_location: 130
 <2><c2ebf>: Abbrev Number: 1 (DW_TAG_member)
    <c2ec0>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <c2ec4>   DW_AT_decl_file   : 4
    <c2ec5>   DW_AT_decl_line   : 79
    <c2ec6>   DW_AT_decl_column : 8
    <c2ec7>   DW_AT_type        : <0xc2f65>
    <c2ecb>   DW_AT_data_member_location: 131
 <2><c2ecc>: Abbrev Number: 1 (DW_TAG_member)
    <c2ecd>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <c2ed1>   DW_AT_decl_file   : 4
    <c2ed2>   DW_AT_decl_line   : 81
    <c2ed3>   DW_AT_decl_column : 15
    <c2ed4>   DW_AT_type        : <0xc2f75>
    <c2ed8>   DW_AT_data_member_location: 136
 <2><c2ed9>: Abbrev Number: 1 (DW_TAG_member)
    <c2eda>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <c2ede>   DW_AT_decl_file   : 4
    <c2edf>   DW_AT_decl_line   : 89
    <c2ee0>   DW_AT_decl_column : 13
    <c2ee1>   DW_AT_type        : <0xc2d88>
    <c2ee5>   DW_AT_data_member_location: 144
 <2><c2ee6>: Abbrev Number: 1 (DW_TAG_member)
    <c2ee7>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <c2eeb>   DW_AT_decl_file   : 4
    <c2eec>   DW_AT_decl_line   : 91
    <c2eed>   DW_AT_decl_column : 23
    <c2eee>   DW_AT_type        : <0xc2f7f>
    <c2ef2>   DW_AT_data_member_location: 152
 <2><c2ef3>: Abbrev Number: 1 (DW_TAG_member)
    <c2ef4>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <c2ef8>   DW_AT_decl_file   : 4
    <c2ef9>   DW_AT_decl_line   : 92
    <c2efa>   DW_AT_decl_column : 25
    <c2efb>   DW_AT_type        : <0xc2f89>
    <c2eff>   DW_AT_data_member_location: 160
 <2><c2f00>: Abbrev Number: 1 (DW_TAG_member)
    <c2f01>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <c2f05>   DW_AT_decl_file   : 4
    <c2f06>   DW_AT_decl_line   : 93
    <c2f07>   DW_AT_decl_column : 20
    <c2f08>   DW_AT_type        : <0xc2f60>
    <c2f0c>   DW_AT_data_member_location: 168
 <2><c2f0d>: Abbrev Number: 1 (DW_TAG_member)
    <c2f0e>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <c2f12>   DW_AT_decl_file   : 4
    <c2f13>   DW_AT_decl_line   : 94
    <c2f14>   DW_AT_decl_column : 9
    <c2f15>   DW_AT_type        : <0xc2d94>
    <c2f19>   DW_AT_data_member_location: 176
 <2><c2f1a>: Abbrev Number: 1 (DW_TAG_member)
    <c2f1b>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <c2f1f>   DW_AT_decl_file   : 4
    <c2f20>   DW_AT_decl_line   : 95
    <c2f21>   DW_AT_decl_column : 10
    <c2f22>   DW_AT_type        : <0xc2da2>
    <c2f26>   DW_AT_data_member_location: 184
 <2><c2f27>: Abbrev Number: 1 (DW_TAG_member)
    <c2f28>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <c2f2c>   DW_AT_decl_file   : 4
    <c2f2d>   DW_AT_decl_line   : 96
    <c2f2e>   DW_AT_decl_column : 7
    <c2f2f>   DW_AT_type        : <0xc2d6e>
    <c2f33>   DW_AT_data_member_location: 192
 <2><c2f34>: Abbrev Number: 1 (DW_TAG_member)
    <c2f35>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <c2f39>   DW_AT_decl_file   : 4
    <c2f3a>   DW_AT_decl_line   : 98
    <c2f3b>   DW_AT_decl_column : 8
    <c2f3c>   DW_AT_type        : <0xc2f8e>
    <c2f40>   DW_AT_data_member_location: 196
 <2><c2f41>: Abbrev Number: 0
 <1><c2f42>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2f43>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <c2f47>   DW_AT_decl_file   : 5
    <c2f48>   DW_AT_decl_line   : 7
    <c2f49>   DW_AT_decl_column : 25
    <c2f4a>   DW_AT_type        : <0xc2dbc>
 <1><c2f4e>: Abbrev Number: 18 (DW_TAG_typedef)
    <c2f4f>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <c2f53>   DW_AT_decl_file   : 4
    <c2f54>   DW_AT_decl_line   : 43
    <c2f55>   DW_AT_decl_column : 14
 <1><c2f56>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c2f57>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <c2f5b>   DW_AT_declaration : 1
 <1><c2f5b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f5c>   DW_AT_byte_size   : 8
    <c2f5c>   DW_AT_type        : <0xc2f56>
 <1><c2f60>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f61>   DW_AT_byte_size   : 8
    <c2f61>   DW_AT_type        : <0xc2dbc>
 <1><c2f65>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2f66>   DW_AT_type        : <0xc2d9b>
    <c2f6a>   DW_AT_sibling     : <0xc2f75>
 <2><c2f6e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c2f6f>   DW_AT_type        : <0xc2d59>
    <c2f73>   DW_AT_upper_bound : 0
 <2><c2f74>: Abbrev Number: 0
 <1><c2f75>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f76>   DW_AT_byte_size   : 8
    <c2f76>   DW_AT_type        : <0xc2f4e>
 <1><c2f7a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c2f7b>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <c2f7f>   DW_AT_declaration : 1
 <1><c2f7f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f80>   DW_AT_byte_size   : 8
    <c2f80>   DW_AT_type        : <0xc2f7a>
 <1><c2f84>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c2f85>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <c2f89>   DW_AT_declaration : 1
 <1><c2f89>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f8a>   DW_AT_byte_size   : 8
    <c2f8a>   DW_AT_type        : <0xc2f84>
 <1><c2f8e>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2f8f>   DW_AT_type        : <0xc2d9b>
    <c2f93>   DW_AT_sibling     : <0xc2f9e>
 <2><c2f97>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c2f98>   DW_AT_type        : <0xc2d59>
    <c2f9c>   DW_AT_upper_bound : 19
 <2><c2f9d>: Abbrev Number: 0
 <1><c2f9e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c2f9f>   DW_AT_byte_size   : 8
    <c2f9f>   DW_AT_type        : <0xc2f42>
 <1><c2fa3>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2fa4>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <c2fa8>   DW_AT_decl_file   : 6
    <c2fa9>   DW_AT_decl_line   : 23
    <c2faa>   DW_AT_decl_column : 23
    <c2fab>   DW_AT_type        : <0xc2d44>
 <1><c2faf>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2fb0>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <c2fb4>   DW_AT_decl_file   : 6
    <c2fb5>   DW_AT_decl_line   : 24
    <c2fb6>   DW_AT_decl_column : 22
    <c2fb7>   DW_AT_type        : <0xc2d52>
 <1><c2fbb>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2fbc>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <c2fc0>   DW_AT_decl_file   : 6
    <c2fc1>   DW_AT_decl_line   : 25
    <c2fc2>   DW_AT_decl_column : 22
    <c2fc3>   DW_AT_type        : <0xc2d52>
 <1><c2fc7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c2fc8>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <c2fcc>   DW_AT_byte_size   : 60
    <c2fcd>   DW_AT_decl_file   : 7
    <c2fce>   DW_AT_decl_line   : 24
    <c2fcf>   DW_AT_decl_column : 8
    <c2fcf>   DW_AT_sibling     : <0xc303c>
 <2><c2fd3>: Abbrev Number: 1 (DW_TAG_member)
    <c2fd4>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <c2fd8>   DW_AT_decl_file   : 7
    <c2fd9>   DW_AT_decl_line   : 26
    <c2fda>   DW_AT_decl_column : 14
    <c2fdb>   DW_AT_type        : <0xc2fbb>
    <c2fdf>   DW_AT_data_member_location: 0
 <2><c2fe0>: Abbrev Number: 1 (DW_TAG_member)
    <c2fe1>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <c2fe5>   DW_AT_decl_file   : 7
    <c2fe6>   DW_AT_decl_line   : 27
    <c2fe7>   DW_AT_decl_column : 14
    <c2fe8>   DW_AT_type        : <0xc2fbb>
    <c2fec>   DW_AT_data_member_location: 4
 <2><c2fed>: Abbrev Number: 1 (DW_TAG_member)
    <c2fee>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <c2ff2>   DW_AT_decl_file   : 7
    <c2ff3>   DW_AT_decl_line   : 28
    <c2ff4>   DW_AT_decl_column : 14
    <c2ff5>   DW_AT_type        : <0xc2fbb>
    <c2ff9>   DW_AT_data_member_location: 8
 <2><c2ffa>: Abbrev Number: 1 (DW_TAG_member)
    <c2ffb>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <c2fff>   DW_AT_decl_file   : 7
    <c3000>   DW_AT_decl_line   : 29
    <c3001>   DW_AT_decl_column : 14
    <c3002>   DW_AT_type        : <0xc2fbb>
    <c3006>   DW_AT_data_member_location: 12
 <2><c3007>: Abbrev Number: 1 (DW_TAG_member)
    <c3008>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <c300c>   DW_AT_decl_file   : 7
    <c300d>   DW_AT_decl_line   : 30
    <c300e>   DW_AT_decl_column : 10
    <c300f>   DW_AT_type        : <0xc2fa3>
    <c3013>   DW_AT_data_member_location: 16
 <2><c3014>: Abbrev Number: 1 (DW_TAG_member)
    <c3015>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <c3019>   DW_AT_decl_file   : 7
    <c301a>   DW_AT_decl_line   : 31
    <c301b>   DW_AT_decl_column : 10
    <c301c>   DW_AT_type        : <0xc303c>
    <c3020>   DW_AT_data_member_location: 17
 <2><c3021>: Abbrev Number: 1 (DW_TAG_member)
    <c3022>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <c3026>   DW_AT_decl_file   : 7
    <c3027>   DW_AT_decl_line   : 32
    <c3028>   DW_AT_decl_column : 13
    <c3029>   DW_AT_type        : <0xc2faf>
    <c302d>   DW_AT_data_member_location: 52
 <2><c302e>: Abbrev Number: 1 (DW_TAG_member)
    <c302f>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <c3033>   DW_AT_decl_file   : 7
    <c3034>   DW_AT_decl_line   : 33
    <c3035>   DW_AT_decl_column : 13
    <c3036>   DW_AT_type        : <0xc2faf>
    <c303a>   DW_AT_data_member_location: 56
 <2><c303b>: Abbrev Number: 0
 <1><c303c>: Abbrev Number: 6 (DW_TAG_array_type)
    <c303d>   DW_AT_type        : <0xc2fa3>
    <c3041>   DW_AT_sibling     : <0xc304c>
 <2><c3045>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c3046>   DW_AT_type        : <0xc2d59>
    <c304a>   DW_AT_upper_bound : 31
 <2><c304b>: Abbrev Number: 0
 <1><c304c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c304d>   DW_AT_byte_size   : 8
    <c304d>   DW_AT_type        : <0xc3051>
 <1><c3051>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <c3052>   DW_AT_prototyped  : 1
 <1><c3052>: Abbrev Number: 2 (DW_TAG_base_type)
    <c3053>   DW_AT_byte_size   : 8
    <c3054>   DW_AT_encoding    : 4	(float)
    <c3055>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c3059>: Abbrev Number: 2 (DW_TAG_base_type)
    <c305a>   DW_AT_byte_size   : 4
    <c305b>   DW_AT_encoding    : 4	(float)
    <c305c>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c3060>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3061>   DW_AT_byte_size   : 8
    <c3061>   DW_AT_type        : <0xc3065>
 <1><c3065>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <c3066>   DW_AT_prototyped  : 1
    <c3066>   DW_AT_type        : <0xc2d6e>
 <1><c306a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c306b>   DW_AT_byte_size   : 8
    <c306b>   DW_AT_type        : <0xc2d6e>
 <1><c306f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c3070>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c3074>   DW_AT_byte_size   : 408
    <c3076>   DW_AT_decl_file   : 8
    <c3077>   DW_AT_decl_line   : 38
    <c3078>   DW_AT_decl_column : 16
    <c3079>   DW_AT_sibling     : <0xc31d6>
 <2><c307d>: Abbrev Number: 1 (DW_TAG_member)
    <c307e>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <c3082>   DW_AT_decl_file   : 8
    <c3083>   DW_AT_decl_line   : 40
    <c3084>   DW_AT_decl_column : 6
    <c3085>   DW_AT_type        : <0xc2d6e>
    <c3089>   DW_AT_data_member_location: 0
 <2><c308a>: Abbrev Number: 1 (DW_TAG_member)
    <c308b>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <c308f>   DW_AT_decl_file   : 8
    <c3090>   DW_AT_decl_line   : 41
    <c3091>   DW_AT_decl_column : 6
    <c3092>   DW_AT_type        : <0xc2d6e>
    <c3096>   DW_AT_data_member_location: 4
 <2><c3097>: Abbrev Number: 1 (DW_TAG_member)
    <c3098>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <c309c>   DW_AT_decl_file   : 8
    <c309d>   DW_AT_decl_line   : 42
    <c309e>   DW_AT_decl_column : 6
    <c309f>   DW_AT_type        : <0xc2d6e>
    <c30a3>   DW_AT_data_member_location: 8
 <2><c30a4>: Abbrev Number: 1 (DW_TAG_member)
    <c30a5>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <c30a9>   DW_AT_decl_file   : 8
    <c30aa>   DW_AT_decl_line   : 43
    <c30ab>   DW_AT_decl_column : 8
    <c30ac>   DW_AT_type        : <0xc2f9e>
    <c30b0>   DW_AT_data_member_location: 16
 <2><c30b1>: Abbrev Number: 1 (DW_TAG_member)
    <c30b2>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <c30b6>   DW_AT_decl_file   : 8
    <c30b7>   DW_AT_decl_line   : 44
    <c30b8>   DW_AT_decl_column : 17
    <c30b9>   DW_AT_type        : <0xc2fc7>
    <c30bd>   DW_AT_data_member_location: 24
 <2><c30be>: Abbrev Number: 1 (DW_TAG_member)
    <c30bf>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <c30c3>   DW_AT_decl_file   : 8
    <c30c4>   DW_AT_decl_line   : 44
    <c30c5>   DW_AT_decl_column : 31
    <c30c6>   DW_AT_type        : <0xc2fc7>
    <c30ca>   DW_AT_data_member_location: 84
 <2><c30cb>: Abbrev Number: 1 (DW_TAG_member)
    <c30cc>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <c30d0>   DW_AT_decl_file   : 8
    <c30d1>   DW_AT_decl_line   : 45
    <c30d2>   DW_AT_decl_column : 6
    <c30d3>   DW_AT_type        : <0xc2d6e>
    <c30d7>   DW_AT_data_member_location: 144
 <2><c30d8>: Abbrev Number: 1 (DW_TAG_member)
    <c30d9>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <c30dd>   DW_AT_decl_file   : 8
    <c30de>   DW_AT_decl_line   : 46
    <c30df>   DW_AT_decl_column : 6
    <c30e0>   DW_AT_type        : <0xc2d6e>
    <c30e4>   DW_AT_data_member_location: 148
 <2><c30e5>: Abbrev Number: 1 (DW_TAG_member)
    <c30e6>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <c30ea>   DW_AT_decl_file   : 8
    <c30eb>   DW_AT_decl_line   : 46
    <c30ec>   DW_AT_decl_column : 16
    <c30ed>   DW_AT_type        : <0xc2d6e>
    <c30f1>   DW_AT_data_member_location: 152
 <2><c30f2>: Abbrev Number: 1 (DW_TAG_member)
    <c30f3>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <c30f7>   DW_AT_decl_file   : 8
    <c30f8>   DW_AT_decl_line   : 47
    <c30f9>   DW_AT_decl_column : 6
    <c30fa>   DW_AT_type        : <0xc2d6e>
    <c30fe>   DW_AT_data_member_location: 156
 <2><c30ff>: Abbrev Number: 1 (DW_TAG_member)
    <c3100>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <c3104>   DW_AT_decl_file   : 8
    <c3105>   DW_AT_decl_line   : 47
    <c3106>   DW_AT_decl_column : 13
    <c3107>   DW_AT_type        : <0xc2d6e>
    <c310b>   DW_AT_data_member_location: 160
 <2><c310c>: Abbrev Number: 10 (DW_TAG_member)
    <c310d>   DW_AT_name        : w
    <c310f>   DW_AT_decl_file   : 8
    <c310f>   DW_AT_decl_line   : 48
    <c3110>   DW_AT_decl_column : 6
    <c3111>   DW_AT_type        : <0xc2d6e>
    <c3115>   DW_AT_data_member_location: 164
 <2><c3116>: Abbrev Number: 10 (DW_TAG_member)
    <c3117>   DW_AT_name        : h
    <c3119>   DW_AT_decl_file   : 8
    <c3119>   DW_AT_decl_line   : 48
    <c311a>   DW_AT_decl_column : 9
    <c311b>   DW_AT_type        : <0xc2d6e>
    <c311f>   DW_AT_data_member_location: 168
 <2><c3120>: Abbrev Number: 1 (DW_TAG_member)
    <c3121>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <c3125>   DW_AT_decl_file   : 8
    <c3126>   DW_AT_decl_line   : 49
    <c3127>   DW_AT_decl_column : 17
    <c3128>   DW_AT_type        : <0xc31d6>
    <c312c>   DW_AT_data_member_location: 176
 <2><c312d>: Abbrev Number: 1 (DW_TAG_member)
    <c312e>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <c3132>   DW_AT_decl_file   : 8
    <c3133>   DW_AT_decl_line   : 49
    <c3134>   DW_AT_decl_column : 31
    <c3135>   DW_AT_type        : <0xc31d6>
    <c3139>   DW_AT_data_member_location: 184
 <2><c313a>: Abbrev Number: 1 (DW_TAG_member)
    <c313b>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <c313f>   DW_AT_decl_file   : 8
    <c3140>   DW_AT_decl_line   : 51
    <c3141>   DW_AT_decl_column : 6
    <c3142>   DW_AT_type        : <0xc2d6e>
    <c3146>   DW_AT_data_member_location: 192
 <2><c3147>: Abbrev Number: 1 (DW_TAG_member)
    <c3148>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <c314c>   DW_AT_decl_file   : 8
    <c314d>   DW_AT_decl_line   : 53
    <c314e>   DW_AT_decl_column : 6
    <c314f>   DW_AT_type        : <0xc2d6e>
    <c3153>   DW_AT_data_member_location: 196
 <2><c3154>: Abbrev Number: 10 (DW_TAG_member)
    <c3155>   DW_AT_name        : seq
    <c3159>   DW_AT_decl_file   : 8
    <c3159>   DW_AT_decl_line   : 54
    <c315a>   DW_AT_decl_column : 8
    <c315b>   DW_AT_type        : <0xc31db>
    <c315f>   DW_AT_data_member_location: 200
 <2><c3160>: Abbrev Number: 4 (DW_TAG_member)
    <c3161>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <c3165>   DW_AT_decl_file   : 8
    <c3165>   DW_AT_decl_line   : 55
    <c3166>   DW_AT_decl_column : 8
    <c3167>   DW_AT_type        : <0xc3060>
    <c316b>   DW_AT_data_member_location: 336
 <2><c316d>: Abbrev Number: 4 (DW_TAG_member)
    <c316e>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <c3172>   DW_AT_decl_file   : 8
    <c3172>   DW_AT_decl_line   : 56
    <c3173>   DW_AT_decl_column : 8
    <c3174>   DW_AT_type        : <0xc3060>
    <c3178>   DW_AT_data_member_location: 344
 <2><c317a>: Abbrev Number: 4 (DW_TAG_member)
    <c317b>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <c317f>   DW_AT_decl_file   : 8
    <c317f>   DW_AT_decl_line   : 57
    <c3180>   DW_AT_decl_column : 9
    <c3181>   DW_AT_type        : <0xc304c>
    <c3185>   DW_AT_data_member_location: 352
 <2><c3187>: Abbrev Number: 4 (DW_TAG_member)
    <c3188>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <c318c>   DW_AT_decl_file   : 8
    <c318c>   DW_AT_decl_line   : 58
    <c318d>   DW_AT_decl_column : 9
    <c318e>   DW_AT_type        : <0xc304c>
    <c3192>   DW_AT_data_member_location: 360
 <2><c3194>: Abbrev Number: 4 (DW_TAG_member)
    <c3195>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <c3199>   DW_AT_decl_file   : 8
    <c3199>   DW_AT_decl_line   : 59
    <c319a>   DW_AT_decl_column : 8
    <c319b>   DW_AT_type        : <0xc3060>
    <c319f>   DW_AT_data_member_location: 368
 <2><c31a1>: Abbrev Number: 4 (DW_TAG_member)
    <c31a2>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <c31a6>   DW_AT_decl_file   : 8
    <c31a6>   DW_AT_decl_line   : 60
    <c31a7>   DW_AT_decl_column : 9
    <c31a8>   DW_AT_type        : <0xc304c>
    <c31ac>   DW_AT_data_member_location: 376
 <2><c31ae>: Abbrev Number: 4 (DW_TAG_member)
    <c31af>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <c31b3>   DW_AT_decl_file   : 8
    <c31b3>   DW_AT_decl_line   : 61
    <c31b4>   DW_AT_decl_column : 9
    <c31b5>   DW_AT_type        : <0xc304c>
    <c31b9>   DW_AT_data_member_location: 384
 <2><c31bb>: Abbrev Number: 4 (DW_TAG_member)
    <c31bc>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <c31c0>   DW_AT_decl_file   : 8
    <c31c0>   DW_AT_decl_line   : 62
    <c31c1>   DW_AT_decl_column : 9
    <c31c2>   DW_AT_type        : <0xc3200>
    <c31c6>   DW_AT_data_member_location: 392
 <2><c31c8>: Abbrev Number: 4 (DW_TAG_member)
    <c31c9>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <c31cd>   DW_AT_decl_file   : 8
    <c31cd>   DW_AT_decl_line   : 63
    <c31ce>   DW_AT_decl_column : 9
    <c31cf>   DW_AT_type        : <0xc304c>
    <c31d3>   DW_AT_data_member_location: 400
 <2><c31d5>: Abbrev Number: 0
 <1><c31d6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c31d7>   DW_AT_byte_size   : 8
    <c31d7>   DW_AT_type        : <0xc2d44>
 <1><c31db>: Abbrev Number: 6 (DW_TAG_array_type)
    <c31dc>   DW_AT_type        : <0xc2d96>
    <c31e0>   DW_AT_sibling     : <0xc31eb>
 <2><c31e4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c31e5>   DW_AT_type        : <0xc2d59>
    <c31e9>   DW_AT_upper_bound : 16
 <2><c31ea>: Abbrev Number: 0
 <1><c31eb>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <c31ec>   DW_AT_prototyped  : 1
    <c31ec>   DW_AT_sibling     : <0xc3200>
 <2><c31f0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c31f1>   DW_AT_type        : <0xc2d6e>
 <2><c31f5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c31f6>   DW_AT_type        : <0xc2d6e>
 <2><c31fa>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c31fb>   DW_AT_type        : <0xc2d6e>
 <2><c31ff>: Abbrev Number: 0
 <1><c3200>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3201>   DW_AT_byte_size   : 8
    <c3201>   DW_AT_type        : <0xc31eb>
 <1><c3205>: Abbrev Number: 5 (DW_TAG_typedef)
    <c3206>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c320a>   DW_AT_decl_file   : 8
    <c320b>   DW_AT_decl_line   : 64
    <c320c>   DW_AT_decl_column : 3
    <c320d>   DW_AT_type        : <0xc306f>
 <1><c3211>: Abbrev Number: 23 (DW_TAG_variable)
    <c3212>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <c3216>   DW_AT_decl_file   : 8
    <c3217>   DW_AT_decl_line   : 66
    <c3218>   DW_AT_decl_column : 18
    <c3219>   DW_AT_type        : <0xc3205>
    <c321d>   DW_AT_external    : 1
    <c321d>   DW_AT_declaration : 1
 <1><c321d>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c321e>   DW_AT_external    : 1
    <c321e>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <c3222>   DW_AT_decl_file   : 9
    <c3222>   DW_AT_decl_line   : 25
    <c3223>   DW_AT_decl_column : 13
    <c3223>   DW_AT_prototyped  : 1
    <c3223>   DW_AT_declaration : 1
 <1><c3223>: Abbrev Number: 24 (DW_TAG_subprogram)
    <c3224>   DW_AT_external    : 1
    <c3224>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <c3228>   DW_AT_decl_file   : 8
    <c3229>   DW_AT_decl_line   : 72
    <c322a>   DW_AT_decl_column : 6
    <c322b>   DW_AT_prototyped  : 1
    <c322b>   DW_AT_declaration : 1
    <c322b>   DW_AT_sibling     : <0xc3235>
 <2><c322f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c3230>   DW_AT_type        : <0xc2d6e>
 <2><c3234>: Abbrev Number: 0
 <1><c3235>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c3236>   DW_AT_external    : 1
    <c3236>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <c323a>   DW_AT_decl_file   : 9
    <c323a>   DW_AT_decl_line   : 24
    <c323b>   DW_AT_decl_column : 13
    <c323b>   DW_AT_prototyped  : 1
    <c323b>   DW_AT_declaration : 1
 <1><c323b>: Abbrev Number: 25 (DW_TAG_subprogram)
    <c323c>   DW_AT_external    : 1
    <c323c>   DW_AT_name        : (indirect string, offset: 0x1b609): fb_ConsoleGetSize
    <c3240>   DW_AT_decl_file   : 1
    <c3241>   DW_AT_decl_line   : 4
    <c3242>   DW_AT_decl_column : 13
    <c3243>   DW_AT_prototyped  : 1
    <c3243>   DW_AT_low_pc      : 0x472250
    <c324b>   DW_AT_high_pc     : 0x6e
    <c3253>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c3255>   DW_AT_call_all_calls: 1
 <2><c3255>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c3256>   DW_AT_name        : (indirect string, offset: 0x1a968): cols
    <c325a>   DW_AT_decl_file   : 1
    <c325a>   DW_AT_decl_line   : 4
    <c325a>   DW_AT_decl_column : 37
    <c325b>   DW_AT_type        : <0xc306a>
    <c325f>   DW_AT_location    : 0x3ad66 (location list)
    <c3263>   DW_AT_GNU_locviews: 0x3ad5a
 <2><c3267>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <c3268>   DW_AT_name        : (indirect string, offset: 0x1a8c4): rows
    <c326c>   DW_AT_decl_file   : 1
    <c326c>   DW_AT_decl_line   : 4
    <c326c>   DW_AT_decl_column : 48
    <c326d>   DW_AT_type        : <0xc306a>
    <c3271>   DW_AT_location    : 0x3ad95 (location list)
    <c3275>   DW_AT_GNU_locviews: 0x3ad8b
 <2><c3279>: Abbrev Number: 14 (DW_TAG_call_site)
    <c327a>   DW_AT_call_return_pc: 0x47228d
    <c3282>   DW_AT_call_origin : <0xc3235>
 <2><c3286>: Abbrev Number: 26 (DW_TAG_call_site)
    <c3287>   DW_AT_call_return_pc: 0x472297
    <c328f>   DW_AT_call_origin : <0xc3223>
    <c3293>   DW_AT_sibling     : <0xc329d>
 <3><c3297>: Abbrev Number: 27 (DW_TAG_call_site_parameter)
    <c3298>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c329a>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><c329c>: Abbrev Number: 0
 <2><c329d>: Abbrev Number: 14 (DW_TAG_call_site)
    <c329e>   DW_AT_call_return_pc: 0x47229c
    <c32a6>   DW_AT_call_origin : <0xc321d>
 <2><c32aa>: Abbrev Number: 0
 <1><c32ab>: Abbrev Number: 0
  Compilation Unit @ offset 0xc32ac:
   Length:        0x106 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xf45b
   Pointer Size:  8
 <0><c32b8>: Abbrev Number: 4 (DW_TAG_compile_unit)
    <c32b9>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c32bd>   DW_AT_language    : 29	(C11)
    <c32be>   DW_AT_name        : (indirect line string, offset: 0xf7f): src/rtlib/unix/io_getx.c
    <c32c2>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c32c6>   DW_AT_low_pc      : 0x4722c0
    <c32ce>   DW_AT_high_pc     : 0x3e
    <c32d6>   DW_AT_stmt_list   : 0x66d81
 <1><c32da>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32db>   DW_AT_byte_size   : 1
    <c32dc>   DW_AT_encoding    : 8	(unsigned char)
    <c32dd>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c32e1>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32e2>   DW_AT_byte_size   : 2
    <c32e3>   DW_AT_encoding    : 7	(unsigned)
    <c32e4>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c32e8>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32e9>   DW_AT_byte_size   : 4
    <c32ea>   DW_AT_encoding    : 7	(unsigned)
    <c32eb>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c32ef>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32f0>   DW_AT_byte_size   : 8
    <c32f1>   DW_AT_encoding    : 7	(unsigned)
    <c32f2>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c32f6>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32f7>   DW_AT_byte_size   : 1
    <c32f8>   DW_AT_encoding    : 6	(signed char)
    <c32f9>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c32fd>: Abbrev Number: 1 (DW_TAG_base_type)
    <c32fe>   DW_AT_byte_size   : 2
    <c32ff>   DW_AT_encoding    : 5	(signed)
    <c3300>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c3304>: Abbrev Number: 5 (DW_TAG_base_type)
    <c3305>   DW_AT_byte_size   : 4
    <c3306>   DW_AT_encoding    : 5	(signed)
    <c3307>   DW_AT_name        : int
 <1><c330b>: Abbrev Number: 1 (DW_TAG_base_type)
    <c330c>   DW_AT_byte_size   : 8
    <c330d>   DW_AT_encoding    : 5	(signed)
    <c330e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c3312>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3313>   DW_AT_byte_size   : 1
    <c3314>   DW_AT_encoding    : 6	(signed char)
    <c3315>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c3319>: Abbrev Number: 1 (DW_TAG_base_type)
    <c331a>   DW_AT_byte_size   : 8
    <c331b>   DW_AT_encoding    : 5	(signed)
    <c331c>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c3320>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3321>   DW_AT_byte_size   : 8
    <c3322>   DW_AT_encoding    : 7	(unsigned)
    <c3323>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c3327>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3328>   DW_AT_byte_size   : 8
    <c3329>   DW_AT_encoding    : 4	(float)
    <c332a>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c332e>: Abbrev Number: 1 (DW_TAG_base_type)
    <c332f>   DW_AT_byte_size   : 4
    <c3330>   DW_AT_encoding    : 4	(float)
    <c3331>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c3335>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c3336>   DW_AT_byte_size   : 8
    <c3337>   DW_AT_type        : <0xc3304>
 <1><c333b>: Abbrev Number: 7 (DW_TAG_subprogram)
    <c333c>   DW_AT_external    : 1
    <c333c>   DW_AT_name        : (indirect string, offset: 0x1b62a): fb_ConsoleGetXY
    <c3340>   DW_AT_decl_file   : 2
    <c3341>   DW_AT_decl_line   : 56
    <c3342>   DW_AT_decl_column : 21
    <c3343>   DW_AT_prototyped  : 1
    <c3343>   DW_AT_declaration : 1
    <c3343>   DW_AT_sibling     : <0xc3352>
 <2><c3347>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c3348>   DW_AT_type        : <0xc3335>
 <2><c334c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c334d>   DW_AT_type        : <0xc3335>
 <2><c3351>: Abbrev Number: 0
 <1><c3352>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c3353>   DW_AT_external    : 1
    <c3353>   DW_AT_name        : (indirect string, offset: 0x1b61b): fb_ConsoleGetX
    <c3357>   DW_AT_decl_file   : 1
    <c3358>   DW_AT_decl_line   : 4
    <c3359>   DW_AT_decl_column : 5
    <c335a>   DW_AT_prototyped  : 1
    <c335a>   DW_AT_type        : <0xc3304>
    <c335e>   DW_AT_low_pc      : 0x4722c0
    <c3366>   DW_AT_high_pc     : 0x3e
    <c336e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c3370>   DW_AT_call_all_calls: 1
    <c3370>   DW_AT_sibling     : <0xc33ac>
 <2><c3374>: Abbrev Number: 9 (DW_TAG_variable)
    <c3375>   DW_AT_name        : x
    <c3377>   DW_AT_decl_file   : 1
    <c3378>   DW_AT_decl_line   : 6
    <c3379>   DW_AT_decl_column : 6
    <c337a>   DW_AT_type        : <0xc3304>
    <c337e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><c3381>: Abbrev Number: 10 (DW_TAG_call_site)
    <c3382>   DW_AT_call_return_pc: 0x4722e0
    <c338a>   DW_AT_call_origin : <0xc333b>
    <c338e>   DW_AT_sibling     : <0xc339e>
 <3><c3392>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <c3393>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c3395>   DW_AT_call_value  : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><c3398>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <c3399>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <c339b>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c339d>: Abbrev Number: 0
 <2><c339e>: Abbrev Number: 11 (DW_TAG_call_site)
    <c339f>   DW_AT_call_return_pc: 0x4722fe
    <c33a7>   DW_AT_call_origin : <0xc33ac>
 <2><c33ab>: Abbrev Number: 0
 <1><c33ac>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c33ad>   DW_AT_external    : 1
    <c33ad>   DW_AT_declaration : 1
    <c33ad>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <c33b1>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><c33b5>: Abbrev Number: 0
  Compilation Unit @ offset 0xc33b6:
   Length:        0x5cb (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xf502
   Pointer Size:  8
 <0><c33c2>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <c33c3>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c33c7>   DW_AT_language    : 29	(C11)
    <c33c8>   DW_AT_name        : (indirect line string, offset: 0xf98): src/rtlib/unix/io_getxy.c
    <c33cc>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c33d0>   DW_AT_low_pc      : 0x472300
    <c33d8>   DW_AT_high_pc     : 0x6e
    <c33e0>   DW_AT_stmt_list   : 0x66deb
 <1><c33e4>: Abbrev Number: 2 (DW_TAG_base_type)
    <c33e5>   DW_AT_byte_size   : 1
    <c33e6>   DW_AT_encoding    : 8	(unsigned char)
    <c33e7>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c33eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <c33ec>   DW_AT_byte_size   : 2
    <c33ed>   DW_AT_encoding    : 7	(unsigned)
    <c33ee>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c33f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <c33f3>   DW_AT_byte_size   : 4
    <c33f4>   DW_AT_encoding    : 7	(unsigned)
    <c33f5>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c33f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <c33fa>   DW_AT_byte_size   : 8
    <c33fb>   DW_AT_encoding    : 7	(unsigned)
    <c33fc>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c3400>: Abbrev Number: 2 (DW_TAG_base_type)
    <c3401>   DW_AT_byte_size   : 1
    <c3402>   DW_AT_encoding    : 6	(signed char)
    <c3403>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c3407>: Abbrev Number: 2 (DW_TAG_base_type)
    <c3408>   DW_AT_byte_size   : 2
    <c3409>   DW_AT_encoding    : 5	(signed)
    <c340a>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c340e>: Abbrev Number: 17 (DW_TAG_base_type)
    <c340f>   DW_AT_byte_size   : 4
    <c3410>   DW_AT_encoding    : 5	(signed)
    <c3411>   DW_AT_name        : int
 <1><c3415>: Abbrev Number: 2 (DW_TAG_base_type)
    <c3416>   DW_AT_byte_size   : 8
    <c3417>   DW_AT_encoding    : 5	(signed)
    <c3418>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c341c>: Abbrev Number: 5 (DW_TAG_typedef)
    <c341d>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <c3421>   DW_AT_decl_file   : 2
    <c3422>   DW_AT_decl_line   : 152
    <c3423>   DW_AT_decl_column : 25
    <c3424>   DW_AT_type        : <0xc3415>
 <1><c3428>: Abbrev Number: 5 (DW_TAG_typedef)
    <c3429>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <c342d>   DW_AT_decl_file   : 2
    <c342e>   DW_AT_decl_line   : 153
    <c342f>   DW_AT_decl_column : 27
    <c3430>   DW_AT_type        : <0xc3415>
 <1><c3434>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c3435>   DW_AT_byte_size   : 8
 <1><c3436>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3437>   DW_AT_byte_size   : 8
    <c3437>   DW_AT_type        : <0xc343b>
 <1><c343b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c343c>   DW_AT_byte_size   : 1
    <c343d>   DW_AT_encoding    : 6	(signed char)
    <c343e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c3442>: Abbrev Number: 5 (DW_TAG_typedef)
    <c3443>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <c3447>   DW_AT_decl_file   : 3
    <c3448>   DW_AT_decl_line   : 209
    <c3449>   DW_AT_decl_column : 23
    <c344a>   DW_AT_type        : <0xc33f9>
 <1><c344e>: Abbrev Number: 2 (DW_TAG_base_type)
    <c344f>   DW_AT_byte_size   : 8
    <c3450>   DW_AT_encoding    : 5	(signed)
    <c3451>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c3455>: Abbrev Number: 2 (DW_TAG_base_type)
    <c3456>   DW_AT_byte_size   : 8
    <c3457>   DW_AT_encoding    : 7	(unsigned)
    <c3458>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c345c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c345d>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <c3461>   DW_AT_byte_size   : 216
    <c3462>   DW_AT_decl_file   : 4
    <c3463>   DW_AT_decl_line   : 49
    <c3464>   DW_AT_decl_column : 8
    <c3464>   DW_AT_sibling     : <0xc35e2>
 <2><c3468>: Abbrev Number: 1 (DW_TAG_member)
    <c3469>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <c346d>   DW_AT_decl_file   : 4
    <c346e>   DW_AT_decl_line   : 51
    <c346f>   DW_AT_decl_column : 7
    <c3470>   DW_AT_type        : <0xc340e>
    <c3474>   DW_AT_data_member_location: 0
 <2><c3475>: Abbrev Number: 1 (DW_TAG_member)
    <c3476>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <c347a>   DW_AT_decl_file   : 4
    <c347b>   DW_AT_decl_line   : 54
    <c347c>   DW_AT_decl_column : 9
    <c347d>   DW_AT_type        : <0xc3436>
    <c3481>   DW_AT_data_member_location: 8
 <2><c3482>: Abbrev Number: 1 (DW_TAG_member)
    <c3483>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <c3487>   DW_AT_decl_file   : 4
    <c3488>   DW_AT_decl_line   : 55
    <c3489>   DW_AT_decl_column : 9
    <c348a>   DW_AT_type        : <0xc3436>
    <c348e>   DW_AT_data_member_location: 16
 <2><c348f>: Abbrev Number: 1 (DW_TAG_member)
    <c3490>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <c3494>   DW_AT_decl_file   : 4
    <c3495>   DW_AT_decl_line   : 56
    <c3496>   DW_AT_decl_column : 9
    <c3497>   DW_AT_type        : <0xc3436>
    <c349b>   DW_AT_data_member_location: 24
 <2><c349c>: Abbrev Number: 1 (DW_TAG_member)
    <c349d>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <c34a1>   DW_AT_decl_file   : 4
    <c34a2>   DW_AT_decl_line   : 57
    <c34a3>   DW_AT_decl_column : 9
    <c34a4>   DW_AT_type        : <0xc3436>
    <c34a8>   DW_AT_data_member_location: 32
 <2><c34a9>: Abbrev Number: 1 (DW_TAG_member)
    <c34aa>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <c34ae>   DW_AT_decl_file   : 4
    <c34af>   DW_AT_decl_line   : 58
    <c34b0>   DW_AT_decl_column : 9
    <c34b1>   DW_AT_type        : <0xc3436>
    <c34b5>   DW_AT_data_member_location: 40
 <2><c34b6>: Abbrev Number: 1 (DW_TAG_member)
    <c34b7>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <c34bb>   DW_AT_decl_file   : 4
    <c34bc>   DW_AT_decl_line   : 59
    <c34bd>   DW_AT_decl_column : 9
    <c34be>   DW_AT_type        : <0xc3436>
    <c34c2>   DW_AT_data_member_location: 48
 <2><c34c3>: Abbrev Number: 1 (DW_TAG_member)
    <c34c4>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <c34c8>   DW_AT_decl_file   : 4
    <c34c9>   DW_AT_decl_line   : 60
    <c34ca>   DW_AT_decl_column : 9
    <c34cb>   DW_AT_type        : <0xc3436>
    <c34cf>   DW_AT_data_member_location: 56
 <2><c34d0>: Abbrev Number: 1 (DW_TAG_member)
    <c34d1>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <c34d5>   DW_AT_decl_file   : 4
    <c34d6>   DW_AT_decl_line   : 61
    <c34d7>   DW_AT_decl_column : 9
    <c34d8>   DW_AT_type        : <0xc3436>
    <c34dc>   DW_AT_data_member_location: 64
 <2><c34dd>: Abbrev Number: 1 (DW_TAG_member)
    <c34de>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <c34e2>   DW_AT_decl_file   : 4
    <c34e3>   DW_AT_decl_line   : 64
    <c34e4>   DW_AT_decl_column : 9
    <c34e5>   DW_AT_type        : <0xc3436>
    <c34e9>   DW_AT_data_member_location: 72
 <2><c34ea>: Abbrev Number: 1 (DW_TAG_member)
    <c34eb>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <c34ef>   DW_AT_decl_file   : 4
    <c34f0>   DW_AT_decl_line   : 65
    <c34f1>   DW_AT_decl_column : 9
    <c34f2>   DW_AT_type        : <0xc3436>
    <c34f6>   DW_AT_data_member_location: 80
 <2><c34f7>: Abbrev Number: 1 (DW_TAG_member)
    <c34f8>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <c34fc>   DW_AT_decl_file   : 4
    <c34fd>   DW_AT_decl_line   : 66
    <c34fe>   DW_AT_decl_column : 9
    <c34ff>   DW_AT_type        : <0xc3436>
    <c3503>   DW_AT_data_member_location: 88
 <2><c3504>: Abbrev Number: 1 (DW_TAG_member)
    <c3505>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <c3509>   DW_AT_decl_file   : 4
    <c350a>   DW_AT_decl_line   : 68
    <c350b>   DW_AT_decl_column : 22
    <c350c>   DW_AT_type        : <0xc35fb>
    <c3510>   DW_AT_data_member_location: 96
 <2><c3511>: Abbrev Number: 1 (DW_TAG_member)
    <c3512>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <c3516>   DW_AT_decl_file   : 4
    <c3517>   DW_AT_decl_line   : 70
    <c3518>   DW_AT_decl_column : 20
    <c3519>   DW_AT_type        : <0xc3600>
    <c351d>   DW_AT_data_member_location: 104
 <2><c351e>: Abbrev Number: 1 (DW_TAG_member)
    <c351f>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <c3523>   DW_AT_decl_file   : 4
    <c3524>   DW_AT_decl_line   : 72
    <c3525>   DW_AT_decl_column : 7
    <c3526>   DW_AT_type        : <0xc340e>
    <c352a>   DW_AT_data_member_location: 112
 <2><c352b>: Abbrev Number: 1 (DW_TAG_member)
    <c352c>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <c3530>   DW_AT_decl_file   : 4
    <c3531>   DW_AT_decl_line   : 73
    <c3532>   DW_AT_decl_column : 7
    <c3533>   DW_AT_type        : <0xc340e>
    <c3537>   DW_AT_data_member_location: 116
 <2><c3538>: Abbrev Number: 1 (DW_TAG_member)
    <c3539>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <c353d>   DW_AT_decl_file   : 4
    <c353e>   DW_AT_decl_line   : 74
    <c353f>   DW_AT_decl_column : 11
    <c3540>   DW_AT_type        : <0xc341c>
    <c3544>   DW_AT_data_member_location: 120
 <2><c3545>: Abbrev Number: 1 (DW_TAG_member)
    <c3546>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <c354a>   DW_AT_decl_file   : 4
    <c354b>   DW_AT_decl_line   : 77
    <c354c>   DW_AT_decl_column : 18
    <c354d>   DW_AT_type        : <0xc33eb>
    <c3551>   DW_AT_data_member_location: 128
 <2><c3552>: Abbrev Number: 1 (DW_TAG_member)
    <c3553>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <c3557>   DW_AT_decl_file   : 4
    <c3558>   DW_AT_decl_line   : 78
    <c3559>   DW_AT_decl_column : 15
    <c355a>   DW_AT_type        : <0xc3400>
    <c355e>   DW_AT_data_member_location: 130
 <2><c355f>: Abbrev Number: 1 (DW_TAG_member)
    <c3560>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <c3564>   DW_AT_decl_file   : 4
    <c3565>   DW_AT_decl_line   : 79
    <c3566>   DW_AT_decl_column : 8
    <c3567>   DW_AT_type        : <0xc3605>
    <c356b>   DW_AT_data_member_location: 131
 <2><c356c>: Abbrev Number: 1 (DW_TAG_member)
    <c356d>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <c3571>   DW_AT_decl_file   : 4
    <c3572>   DW_AT_decl_line   : 81
    <c3573>   DW_AT_decl_column : 15
    <c3574>   DW_AT_type        : <0xc3615>
    <c3578>   DW_AT_data_member_location: 136
 <2><c3579>: Abbrev Number: 1 (DW_TAG_member)
    <c357a>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <c357e>   DW_AT_decl_file   : 4
    <c357f>   DW_AT_decl_line   : 89
    <c3580>   DW_AT_decl_column : 13
    <c3581>   DW_AT_type        : <0xc3428>
    <c3585>   DW_AT_data_member_location: 144
 <2><c3586>: Abbrev Number: 1 (DW_TAG_member)
    <c3587>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <c358b>   DW_AT_decl_file   : 4
    <c358c>   DW_AT_decl_line   : 91
    <c358d>   DW_AT_decl_column : 23
    <c358e>   DW_AT_type        : <0xc361f>
    <c3592>   DW_AT_data_member_location: 152
 <2><c3593>: Abbrev Number: 1 (DW_TAG_member)
    <c3594>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <c3598>   DW_AT_decl_file   : 4
    <c3599>   DW_AT_decl_line   : 92
    <c359a>   DW_AT_decl_column : 25
    <c359b>   DW_AT_type        : <0xc3629>
    <c359f>   DW_AT_data_member_location: 160
 <2><c35a0>: Abbrev Number: 1 (DW_TAG_member)
    <c35a1>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <c35a5>   DW_AT_decl_file   : 4
    <c35a6>   DW_AT_decl_line   : 93
    <c35a7>   DW_AT_decl_column : 20
    <c35a8>   DW_AT_type        : <0xc3600>
    <c35ac>   DW_AT_data_member_location: 168
 <2><c35ad>: Abbrev Number: 1 (DW_TAG_member)
    <c35ae>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <c35b2>   DW_AT_decl_file   : 4
    <c35b3>   DW_AT_decl_line   : 94
    <c35b4>   DW_AT_decl_column : 9
    <c35b5>   DW_AT_type        : <0xc3434>
    <c35b9>   DW_AT_data_member_location: 176
 <2><c35ba>: Abbrev Number: 1 (DW_TAG_member)
    <c35bb>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <c35bf>   DW_AT_decl_file   : 4
    <c35c0>   DW_AT_decl_line   : 95
    <c35c1>   DW_AT_decl_column : 10
    <c35c2>   DW_AT_type        : <0xc3442>
    <c35c6>   DW_AT_data_member_location: 184
 <2><c35c7>: Abbrev Number: 1 (DW_TAG_member)
    <c35c8>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <c35cc>   DW_AT_decl_file   : 4
    <c35cd>   DW_AT_decl_line   : 96
    <c35ce>   DW_AT_decl_column : 7
    <c35cf>   DW_AT_type        : <0xc340e>
    <c35d3>   DW_AT_data_member_location: 192
 <2><c35d4>: Abbrev Number: 1 (DW_TAG_member)
    <c35d5>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <c35d9>   DW_AT_decl_file   : 4
    <c35da>   DW_AT_decl_line   : 98
    <c35db>   DW_AT_decl_column : 8
    <c35dc>   DW_AT_type        : <0xc362e>
    <c35e0>   DW_AT_data_member_location: 196
 <2><c35e1>: Abbrev Number: 0
 <1><c35e2>: Abbrev Number: 5 (DW_TAG_typedef)
    <c35e3>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <c35e7>   DW_AT_decl_file   : 5
    <c35e8>   DW_AT_decl_line   : 7
    <c35e9>   DW_AT_decl_column : 25
    <c35ea>   DW_AT_type        : <0xc345c>
 <1><c35ee>: Abbrev Number: 19 (DW_TAG_typedef)
    <c35ef>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <c35f3>   DW_AT_decl_file   : 4
    <c35f4>   DW_AT_decl_line   : 43
    <c35f5>   DW_AT_decl_column : 14
 <1><c35f6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c35f7>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <c35fb>   DW_AT_declaration : 1
 <1><c35fb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c35fc>   DW_AT_byte_size   : 8
    <c35fc>   DW_AT_type        : <0xc35f6>
 <1><c3600>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3601>   DW_AT_byte_size   : 8
    <c3601>   DW_AT_type        : <0xc345c>
 <1><c3605>: Abbrev Number: 6 (DW_TAG_array_type)
    <c3606>   DW_AT_type        : <0xc343b>
    <c360a>   DW_AT_sibling     : <0xc3615>
 <2><c360e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c360f>   DW_AT_type        : <0xc33f9>
    <c3613>   DW_AT_upper_bound : 0
 <2><c3614>: Abbrev Number: 0
 <1><c3615>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3616>   DW_AT_byte_size   : 8
    <c3616>   DW_AT_type        : <0xc35ee>
 <1><c361a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c361b>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <c361f>   DW_AT_declaration : 1
 <1><c361f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3620>   DW_AT_byte_size   : 8
    <c3620>   DW_AT_type        : <0xc361a>
 <1><c3624>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c3625>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <c3629>   DW_AT_declaration : 1
 <1><c3629>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c362a>   DW_AT_byte_size   : 8
    <c362a>   DW_AT_type        : <0xc3624>
 <1><c362e>: Abbrev Number: 6 (DW_TAG_array_type)
    <c362f>   DW_AT_type        : <0xc343b>
    <c3633>   DW_AT_sibling     : <0xc363e>
 <2><c3637>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c3638>   DW_AT_type        : <0xc33f9>
    <c363c>   DW_AT_upper_bound : 19
 <2><c363d>: Abbrev Number: 0
 <1><c363e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c363f>   DW_AT_byte_size   : 8
    <c363f>   DW_AT_type        : <0xc35e2>
 <1><c3643>: Abbrev Number: 5 (DW_TAG_typedef)
    <c3644>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <c3648>   DW_AT_decl_file   : 6
    <c3649>   DW_AT_decl_line   : 23
    <c364a>   DW_AT_decl_column : 23
    <c364b>   DW_AT_type        : <0xc33e4>
 <1><c364f>: Abbrev Number: 5 (DW_TAG_typedef)
    <c3650>   DW_AT_name        : (indirect string, offset: 0x1b878): speed_t
    <c3654>   DW_AT_decl_file   : 6
    <c3655>   DW_AT_decl_line   : 24
    <c3656>   DW_AT_decl_column : 22
    <c3657>   DW_AT_type        : <0xc33f2>
 <1><c365b>: Abbrev Number: 5 (DW_TAG_typedef)
    <c365c>   DW_AT_name        : (indirect string, offset: 0x1b867): tcflag_t
    <c3660>   DW_AT_decl_file   : 6
    <c3661>   DW_AT_decl_line   : 25
    <c3662>   DW_AT_decl_column : 22
    <c3663>   DW_AT_type        : <0xc33f2>
 <1><c3667>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c3668>   DW_AT_name        : (indirect string, offset: 0x1b83b): termios
    <c366c>   DW_AT_byte_size   : 60
    <c366d>   DW_AT_decl_file   : 7
    <c366e>   DW_AT_decl_line   : 24
    <c366f>   DW_AT_decl_column : 8
    <c366f>   DW_AT_sibling     : <0xc36dc>
 <2><c3673>: Abbrev Number: 1 (DW_TAG_member)
    <c3674>   DW_AT_name        : (indirect string, offset: 0x1b8b8): c_iflag
    <c3678>   DW_AT_decl_file   : 7
    <c3679>   DW_AT_decl_line   : 26
    <c367a>   DW_AT_decl_column : 14
    <c367b>   DW_AT_type        : <0xc365b>
    <c367f>   DW_AT_data_member_location: 0
 <2><c3680>: Abbrev Number: 1 (DW_TAG_member)
    <c3681>   DW_AT_name        : (indirect string, offset: 0x1b8f0): c_oflag
    <c3685>   DW_AT_decl_file   : 7
    <c3686>   DW_AT_decl_line   : 27
    <c3687>   DW_AT_decl_column : 14
    <c3688>   DW_AT_type        : <0xc365b>
    <c368c>   DW_AT_data_member_location: 4
 <2><c368d>: Abbrev Number: 1 (DW_TAG_member)
    <c368e>   DW_AT_name        : (indirect string, offset: 0x1b870): c_cflag
    <c3692>   DW_AT_decl_file   : 7
    <c3693>   DW_AT_decl_line   : 28
    <c3694>   DW_AT_decl_column : 14
    <c3695>   DW_AT_type        : <0xc365b>
    <c3699>   DW_AT_data_member_location: 8
 <2><c369a>: Abbrev Number: 1 (DW_TAG_member)
    <c369b>   DW_AT_name        : (indirect string, offset: 0x1b935): c_lflag
    <c369f>   DW_AT_decl_file   : 7
    <c36a0>   DW_AT_decl_line   : 29
    <c36a1>   DW_AT_decl_column : 14
    <c36a2>   DW_AT_type        : <0xc365b>
    <c36a6>   DW_AT_data_member_location: 12
 <2><c36a7>: Abbrev Number: 1 (DW_TAG_member)
    <c36a8>   DW_AT_name        : (indirect string, offset: 0x1b7ba): c_line
    <c36ac>   DW_AT_decl_file   : 7
    <c36ad>   DW_AT_decl_line   : 30
    <c36ae>   DW_AT_decl_column : 10
    <c36af>   DW_AT_type        : <0xc3643>
    <c36b3>   DW_AT_data_member_location: 16
 <2><c36b4>: Abbrev Number: 1 (DW_TAG_member)
    <c36b5>   DW_AT_name        : (indirect string, offset: 0x1b7d7): c_cc
    <c36b9>   DW_AT_decl_file   : 7
    <c36ba>   DW_AT_decl_line   : 31
    <c36bb>   DW_AT_decl_column : 10
    <c36bc>   DW_AT_type        : <0xc36dc>
    <c36c0>   DW_AT_data_member_location: 17
 <2><c36c1>: Abbrev Number: 1 (DW_TAG_member)
    <c36c2>   DW_AT_name        : (indirect string, offset: 0x1b7f0): c_ispeed
    <c36c6>   DW_AT_decl_file   : 7
    <c36c7>   DW_AT_decl_line   : 32
    <c36c8>   DW_AT_decl_column : 13
    <c36c9>   DW_AT_type        : <0xc364f>
    <c36cd>   DW_AT_data_member_location: 52
 <2><c36ce>: Abbrev Number: 1 (DW_TAG_member)
    <c36cf>   DW_AT_name        : (indirect string, offset: 0x1b79a): c_ospeed
    <c36d3>   DW_AT_decl_file   : 7
    <c36d4>   DW_AT_decl_line   : 33
    <c36d5>   DW_AT_decl_column : 13
    <c36d6>   DW_AT_type        : <0xc364f>
    <c36da>   DW_AT_data_member_location: 56
 <2><c36db>: Abbrev Number: 0
 <1><c36dc>: Abbrev Number: 6 (DW_TAG_array_type)
    <c36dd>   DW_AT_type        : <0xc3643>
    <c36e1>   DW_AT_sibling     : <0xc36ec>
 <2><c36e5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c36e6>   DW_AT_type        : <0xc33f9>
    <c36ea>   DW_AT_upper_bound : 31
 <2><c36eb>: Abbrev Number: 0
 <1><c36ec>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c36ed>   DW_AT_byte_size   : 8
    <c36ed>   DW_AT_type        : <0xc36f1>
 <1><c36f1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <c36f2>   DW_AT_prototyped  : 1
 <1><c36f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <c36f3>   DW_AT_byte_size   : 8
    <c36f4>   DW_AT_encoding    : 4	(float)
    <c36f5>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><c36f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <c36fa>   DW_AT_byte_size   : 4
    <c36fb>   DW_AT_encoding    : 4	(float)
    <c36fc>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><c3700>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3701>   DW_AT_byte_size   : 8
    <c3701>   DW_AT_type        : <0xc3705>
 <1><c3705>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <c3706>   DW_AT_prototyped  : 1
    <c3706>   DW_AT_type        : <0xc340e>
 <1><c370a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c370b>   DW_AT_byte_size   : 8
    <c370b>   DW_AT_type        : <0xc340e>
 <1><c370f>: Abbrev Number: 22 (DW_TAG_structure_type)
    <c3710>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c3714>   DW_AT_byte_size   : 408
    <c3716>   DW_AT_decl_file   : 8
    <c3717>   DW_AT_decl_line   : 38
    <c3718>   DW_AT_decl_column : 16
    <c3719>   DW_AT_sibling     : <0xc3876>
 <2><c371d>: Abbrev Number: 1 (DW_TAG_member)
    <c371e>   DW_AT_name        : (indirect string, offset: 0x19832): inited
    <c3722>   DW_AT_decl_file   : 8
    <c3723>   DW_AT_decl_line   : 40
    <c3724>   DW_AT_decl_column : 6
    <c3725>   DW_AT_type        : <0xc340e>
    <c3729>   DW_AT_data_member_location: 0
 <2><c372a>: Abbrev Number: 1 (DW_TAG_member)
    <c372b>   DW_AT_name        : (indirect string, offset: 0x1b802): term_type
    <c372f>   DW_AT_decl_file   : 8
    <c3730>   DW_AT_decl_line   : 41
    <c3731>   DW_AT_decl_column : 6
    <c3732>   DW_AT_type        : <0xc340e>
    <c3736>   DW_AT_data_member_location: 4
 <2><c3737>: Abbrev Number: 1 (DW_TAG_member)
    <c3738>   DW_AT_name        : (indirect string, offset: 0x1b7c1): h_in
    <c373c>   DW_AT_decl_file   : 8
    <c373d>   DW_AT_decl_line   : 42
    <c373e>   DW_AT_decl_column : 6
    <c373f>   DW_AT_type        : <0xc340e>
    <c3743>   DW_AT_data_member_location: 8
 <2><c3744>: Abbrev Number: 1 (DW_TAG_member)
    <c3745>   DW_AT_name        : (indirect string, offset: 0x1b880): f_in
    <c3749>   DW_AT_decl_file   : 8
    <c374a>   DW_AT_decl_line   : 43
    <c374b>   DW_AT_decl_column : 8
    <c374c>   DW_AT_type        : <0xc363e>
    <c3750>   DW_AT_data_member_location: 16
 <2><c3751>: Abbrev Number: 1 (DW_TAG_member)
    <c3752>   DW_AT_name        : (indirect string, offset: 0x1b818): old_term_out
    <c3756>   DW_AT_decl_file   : 8
    <c3757>   DW_AT_decl_line   : 44
    <c3758>   DW_AT_decl_column : 17
    <c3759>   DW_AT_type        : <0xc3667>
    <c375d>   DW_AT_data_member_location: 24
 <2><c375e>: Abbrev Number: 1 (DW_TAG_member)
    <c375f>   DW_AT_name        : (indirect string, offset: 0x1b825): old_term_in
    <c3763>   DW_AT_decl_file   : 8
    <c3764>   DW_AT_decl_line   : 44
    <c3765>   DW_AT_decl_column : 31
    <c3766>   DW_AT_type        : <0xc3667>
    <c376a>   DW_AT_data_member_location: 84
 <2><c376b>: Abbrev Number: 1 (DW_TAG_member)
    <c376c>   DW_AT_name        : (indirect string, offset: 0x1b912): old_in_flags
    <c3770>   DW_AT_decl_file   : 8
    <c3771>   DW_AT_decl_line   : 45
    <c3772>   DW_AT_decl_column : 6
    <c3773>   DW_AT_type        : <0xc340e>
    <c3777>   DW_AT_data_member_location: 144
 <2><c3778>: Abbrev Number: 1 (DW_TAG_member)
    <c3779>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <c377d>   DW_AT_decl_file   : 8
    <c377e>   DW_AT_decl_line   : 46
    <c377f>   DW_AT_decl_column : 6
    <c3780>   DW_AT_type        : <0xc340e>
    <c3784>   DW_AT_data_member_location: 148
 <2><c3785>: Abbrev Number: 1 (DW_TAG_member)
    <c3786>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <c378a>   DW_AT_decl_file   : 8
    <c378b>   DW_AT_decl_line   : 46
    <c378c>   DW_AT_decl_column : 16
    <c378d>   DW_AT_type        : <0xc340e>
    <c3791>   DW_AT_data_member_location: 152
 <2><c3792>: Abbrev Number: 1 (DW_TAG_member)
    <c3793>   DW_AT_name        : (indirect string, offset: 0x1b8e4): cur_x
    <c3797>   DW_AT_decl_file   : 8
    <c3798>   DW_AT_decl_line   : 47
    <c3799>   DW_AT_decl_column : 6
    <c379a>   DW_AT_type        : <0xc340e>
    <c379e>   DW_AT_data_member_location: 156
 <2><c379f>: Abbrev Number: 1 (DW_TAG_member)
    <c37a0>   DW_AT_name        : (indirect string, offset: 0x1b8ea): cur_y
    <c37a4>   DW_AT_decl_file   : 8
    <c37a5>   DW_AT_decl_line   : 47
    <c37a6>   DW_AT_decl_column : 13
    <c37a7>   DW_AT_type        : <0xc340e>
    <c37ab>   DW_AT_data_member_location: 160
 <2><c37ac>: Abbrev Number: 10 (DW_TAG_member)
    <c37ad>   DW_AT_name        : w
    <c37af>   DW_AT_decl_file   : 8
    <c37af>   DW_AT_decl_line   : 48
    <c37b0>   DW_AT_decl_column : 6
    <c37b1>   DW_AT_type        : <0xc340e>
    <c37b5>   DW_AT_data_member_location: 164
 <2><c37b6>: Abbrev Number: 10 (DW_TAG_member)
    <c37b7>   DW_AT_name        : h
    <c37b9>   DW_AT_decl_file   : 8
    <c37b9>   DW_AT_decl_line   : 48
    <c37ba>   DW_AT_decl_column : 9
    <c37bb>   DW_AT_type        : <0xc340e>
    <c37bf>   DW_AT_data_member_location: 168
 <2><c37c0>: Abbrev Number: 1 (DW_TAG_member)
    <c37c1>   DW_AT_name        : (indirect string, offset: 0x1bce1): char_buffer
    <c37c5>   DW_AT_decl_file   : 8
    <c37c6>   DW_AT_decl_line   : 49
    <c37c7>   DW_AT_decl_column : 17
    <c37c8>   DW_AT_type        : <0xc3876>
    <c37cc>   DW_AT_data_member_location: 176
 <2><c37cd>: Abbrev Number: 1 (DW_TAG_member)
    <c37ce>   DW_AT_name        : (indirect string, offset: 0x1b91f): attr_buffer
    <c37d2>   DW_AT_decl_file   : 8
    <c37d3>   DW_AT_decl_line   : 49
    <c37d4>   DW_AT_decl_column : 31
    <c37d5>   DW_AT_type        : <0xc3876>
    <c37d9>   DW_AT_data_member_location: 184
 <2><c37da>: Abbrev Number: 1 (DW_TAG_member)
    <c37db>   DW_AT_name        : (indirect string, offset: 0x1b8c0): has_perm
    <c37df>   DW_AT_decl_file   : 8
    <c37e0>   DW_AT_decl_line   : 51
    <c37e1>   DW_AT_decl_column : 6
    <c37e2>   DW_AT_type        : <0xc340e>
    <c37e6>   DW_AT_data_member_location: 192
 <2><c37e7>: Abbrev Number: 1 (DW_TAG_member)
    <c37e8>   DW_AT_name        : (indirect string, offset: 0x1b851): scroll_region_changed
    <c37ec>   DW_AT_decl_file   : 8
    <c37ed>   DW_AT_decl_line   : 53
    <c37ee>   DW_AT_decl_column : 6
    <c37ef>   DW_AT_type        : <0xc340e>
    <c37f3>   DW_AT_data_member_location: 196
 <2><c37f4>: Abbrev Number: 10 (DW_TAG_member)
    <c37f5>   DW_AT_name        : seq
    <c37f9>   DW_AT_decl_file   : 8
    <c37f9>   DW_AT_decl_line   : 54
    <c37fa>   DW_AT_decl_column : 8
    <c37fb>   DW_AT_type        : <0xc387b>
    <c37ff>   DW_AT_data_member_location: 200
 <2><c3800>: Abbrev Number: 4 (DW_TAG_member)
    <c3801>   DW_AT_name        : (indirect string, offset: 0x1b8f8): keyboard_getch
    <c3805>   DW_AT_decl_file   : 8
    <c3805>   DW_AT_decl_line   : 55
    <c3806>   DW_AT_decl_column : 8
    <c3807>   DW_AT_type        : <0xc3700>
    <c380b>   DW_AT_data_member_location: 336
 <2><c380d>: Abbrev Number: 4 (DW_TAG_member)
    <c380e>   DW_AT_name        : (indirect string, offset: 0x1b89c): keyboard_init
    <c3812>   DW_AT_decl_file   : 8
    <c3812>   DW_AT_decl_line   : 56
    <c3813>   DW_AT_decl_column : 8
    <c3814>   DW_AT_type        : <0xc3700>
    <c3818>   DW_AT_data_member_location: 344
 <2><c381a>: Abbrev Number: 4 (DW_TAG_member)
    <c381b>   DW_AT_name        : (indirect string, offset: 0x1b843): keyboard_exit
    <c381f>   DW_AT_decl_file   : 8
    <c381f>   DW_AT_decl_line   : 57
    <c3820>   DW_AT_decl_column : 9
    <c3821>   DW_AT_type        : <0xc36ec>
    <c3825>   DW_AT_data_member_location: 352
 <2><c3827>: Abbrev Number: 4 (DW_TAG_member)
    <c3828>   DW_AT_name        : (indirect string, offset: 0x1b7c6): keyboard_handler
    <c382c>   DW_AT_decl_file   : 8
    <c382c>   DW_AT_decl_line   : 58
    <c382d>   DW_AT_decl_column : 9
    <c382e>   DW_AT_type        : <0xc36ec>
    <c3832>   DW_AT_data_member_location: 360
 <2><c3834>: Abbrev Number: 4 (DW_TAG_member)
    <c3835>   DW_AT_name        : (indirect string, offset: 0x1b907): mouse_init
    <c3839>   DW_AT_decl_file   : 8
    <c3839>   DW_AT_decl_line   : 59
    <c383a>   DW_AT_decl_column : 8
    <c383b>   DW_AT_type        : <0xc3700>
    <c383f>   DW_AT_data_member_location: 368
 <2><c3841>: Abbrev Number: 4 (DW_TAG_member)
    <c3842>   DW_AT_name        : (indirect string, offset: 0x1b7a3): mouse_exit
    <c3846>   DW_AT_decl_file   : 8
    <c3846>   DW_AT_decl_line   : 60
    <c3847>   DW_AT_decl_column : 9
    <c3848>   DW_AT_type        : <0xc36ec>
    <c384c>   DW_AT_data_member_location: 376
 <2><c384e>: Abbrev Number: 4 (DW_TAG_member)
    <c384f>   DW_AT_name        : (indirect string, offset: 0x1b8aa): mouse_handler
    <c3853>   DW_AT_decl_file   : 8
    <c3853>   DW_AT_decl_line   : 61
    <c3854>   DW_AT_decl_column : 9
    <c3855>   DW_AT_type        : <0xc36ec>
    <c3859>   DW_AT_data_member_location: 384
 <2><c385b>: Abbrev Number: 4 (DW_TAG_member)
    <c385c>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <c3860>   DW_AT_decl_file   : 8
    <c3860>   DW_AT_decl_line   : 62
    <c3861>   DW_AT_decl_column : 9
    <c3862>   DW_AT_type        : <0xc38a0>
    <c3866>   DW_AT_data_member_location: 392
 <2><c3868>: Abbrev Number: 4 (DW_TAG_member)
    <c3869>   DW_AT_name        : (indirect string, offset: 0x1b8db): gfx_exit
    <c386d>   DW_AT_decl_file   : 8
    <c386d>   DW_AT_decl_line   : 63
    <c386e>   DW_AT_decl_column : 9
    <c386f>   DW_AT_type        : <0xc36ec>
    <c3873>   DW_AT_data_member_location: 400
 <2><c3875>: Abbrev Number: 0
 <1><c3876>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c3877>   DW_AT_byte_size   : 8
    <c3877>   DW_AT_type        : <0xc33e4>
 <1><c387b>: Abbrev Number: 6 (DW_TAG_array_type)
    <c387c>   DW_AT_type        : <0xc3436>
    <c3880>   DW_AT_sibling     : <0xc388b>
 <2><c3884>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <c3885>   DW_AT_type        : <0xc33f9>
    <c3889>   DW_AT_upper_bound : 16
 <2><c388a>: Abbrev Number: 0
 <1><c388b>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <c388c>   DW_AT_prototyped  : 1
    <c388c>   DW_AT_sibling     : <0xc38a0>
 <2><c3890>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c3891>   DW_AT_type        : <0xc340e>
 <2><c3895>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c3896>   DW_AT_type        : <0xc340e>
 <2><c389a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c389b>   DW_AT_type        : <0xc340e>
 <2><c389f>: Abbrev Number: 0
 <1><c38a0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c38a1>   DW_AT_byte_size   : 8
    <c38a1>   DW_AT_type        : <0xc388b>
 <1><c38a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <c38a6>   DW_AT_name        : (indirect string, offset: 0x1b831): FBCONSOLE
    <c38aa>   DW_AT_decl_file   : 8
    <c38ab>   DW_AT_decl_line   : 64
    <c38ac>   DW_AT_decl_column : 3
    <c38ad>   DW_AT_type        : <0xc370f>
 <1><c38b1>: Abbrev Number: 24 (DW_TAG_variable)
    <c38b2>   DW_AT_name        : (indirect string, offset: 0x1b7f9): __fb_con
    <c38b6>   DW_AT_decl_file   : 8
    <c38b7>   DW_AT_decl_line   : 66
    <c38b8>   DW_AT_decl_column : 18
    <c38b9>   DW_AT_type        : <0xc38a5>
    <c38bd>   DW_AT_external    : 1
    <c38bd>   DW_AT_declaration : 1
 <1><c38bd>: Abbrev Number: 11 (DW_TAG_subprogram)
    <c38be>   DW_AT_external    : 1
    <c38be>   DW_AT_name        : (indirect string, offset: 0x1b7ae): fb_BgUnlock
    <c38c2>   DW_AT_decl_file   : 9
    <c38c3>   DW_AT_decl_line   : 25
    <c38c4>   DW_AT_decl_column : 13
    <c38c5>   DW_AT_prototyped  : 1
    <c38c5>   DW_AT_declaration : 1
 <1><c38c5>: Abbrev Number: 11 (DW_TAG_subprogram)
    <c38c6>   DW_AT_external    : 1
    <c38c6>   DW_AT_name        : (indirect string, offset: 0x1b93d): fb_hRecheckCursorPos
    <c38ca>   DW_AT_decl_file   : 8
    <c38cb>   DW_AT_decl_line   : 71
    <c38cc>   DW_AT_decl_column : 6
    <c38cd>   DW_AT_prototyped  : 1
    <c38cd>   DW_AT_declaration : 1
 <1><c38cd>: Abbrev Number: 25 (DW_TAG_subprogram)
    <c38ce>   DW_AT_external    : 1
    <c38ce>   DW_AT_name        : (indirect string, offset: 0x1b885): fb_hRecheckConsoleSize
    <c38d2>   DW_AT_decl_file   : 8
    <c38d3>   DW_AT_decl_line   : 72
    <c38d4>   DW_AT_decl_column : 6
    <c38d5>   DW_AT_prototyped  : 1
    <c38d5>   DW_AT_declaration : 1
    <c38d5>   DW_AT_sibling     : <0xc38df>
 <2><c38d9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c38da>   DW_AT_type        : <0xc340e>
 <2><c38de>: Abbrev Number: 0
 <1><c38df>: Abbrev Number: 11 (DW_TAG_subprogram)
    <c38e0>   DW_AT_external    : 1
    <c38e0>   DW_AT_name        : (indirect string, offset: 0x1b92b): fb_BgLock
    <c38e4>   DW_AT_decl_file   : 9
    <c38e5>   DW_AT_decl_line   : 24
    <c38e6>   DW_AT_decl_column : 13
    <c38e7>   DW_AT_prototyped  : 1
    <c38e7>   DW_AT_declaration : 1
 <1><c38e7>: Abbrev Number: 26 (DW_TAG_subprogram)
    <c38e8>   DW_AT_external    : 1
    <c38e8>   DW_AT_name        : (indirect string, offset: 0x1b62a): fb_ConsoleGetXY
    <c38ec>   DW_AT_decl_file   : 1
    <c38ed>   DW_AT_decl_line   : 4
    <c38ee>   DW_AT_decl_column : 13
    <c38ef>   DW_AT_prototyped  : 1
    <c38ef>   DW_AT_low_pc      : 0x472300
    <c38f7>   DW_AT_high_pc     : 0x6e
    <c38ff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c3901>   DW_AT_call_all_calls: 1
 <2><c3901>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c3902>   DW_AT_name        : col
    <c3906>   DW_AT_decl_file   : 1
    <c3906>   DW_AT_decl_line   : 4
    <c3906>   DW_AT_decl_column : 35
    <c3907>   DW_AT_type        : <0xc370a>
    <c390b>   DW_AT_location    : 0x3adcb (location list)
    <c390f>   DW_AT_GNU_locviews: 0x3adc1
 <2><c3913>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c3914>   DW_AT_name        : row
    <c3918>   DW_AT_decl_file   : 1
    <c3918>   DW_AT_decl_line   : 4
    <c3918>   DW_AT_decl_column : 45
    <c3919>   DW_AT_type        : <0xc370a>
    <c391d>   DW_AT_location    : 0x3adf0 (location list)
    <c3921>   DW_AT_GNU_locviews: 0x3ade8
 <2><c3925>: Abbrev Number: 15 (DW_TAG_variable)
    <c3926>   DW_AT_name        : x
    <c3928>   DW_AT_decl_file   : 1
    <c3928>   DW_AT_decl_line   : 6
    <c3928>   DW_AT_decl_column : 6
    <c3929>   DW_AT_type        : <0xc340e>
    <c392d>   DW_AT_location    : 0x3ae0c (location list)
    <c3931>   DW_AT_GNU_locviews: 0x3ae08
 <2><c3935>: Abbrev Number: 15 (DW_TAG_variable)
    <c3936>   DW_AT_name        : y
    <c3938>   DW_AT_decl_file   : 1
    <c3938>   DW_AT_decl_line   : 6
    <c3938>   DW_AT_decl_column : 9
    <c3939>   DW_AT_type        : <0xc340e>
    <c393d>   DW_AT_location    : 0x3ae1b (location list)
    <c3941>   DW_AT_GNU_locviews: 0x3ae17
 <2><c3945>: Abbrev Number: 12 (DW_TAG_call_site)
    <c3946>   DW_AT_call_return_pc: 0x47234d
    <c394e>   DW_AT_call_origin : <0xc38df>
 <2><c3952>: Abbrev Number: 27 (DW_TAG_call_site)
    <c3953>   DW_AT_call_return_pc: 0x472354
    <c395b>   DW_AT_call_origin : <0xc38cd>
    <c395f>   DW_AT_sibling     : <0xc3969>
 <3><c3963>: Abbrev Number: 28 (DW_TAG_call_site_parameter)
    <c3964>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <c3966>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><c3968>: Abbrev Number: 0
 <2><c3969>: Abbrev Number: 12 (DW_TAG_call_site)
    <c396a>   DW_AT_call_return_pc: 0x472359
    <c3972>   DW_AT_call_origin : <0xc38c5>
 <2><c3976>: Abbrev Number: 12 (DW_TAG_call_site)
    <c3977>   DW_AT_call_return_pc: 0x47236c
    <c397f>   DW_AT_call_origin : <0xc38bd>
 <2><c3983>: Abbrev Number: 0
 <1><c3984>: Abbrev Number: 0
  Compilation Unit @ offset 0xc3985:
   Length:        0x178 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xf689
   Pointer Size:  8
 <0><c3991>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <c3992>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <c3996>   DW_AT_language    : 29	(C11)
    <c3997>   DW_AT_name        : (indirect line string, offset: 0xfb2): src/rtlib/io_hinkey.c
    <c399b>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <c399f>   DW_AT_low_pc      : 0x472370
    <c39a7>   DW_AT_high_pc     : 0x2c
    <c39af>   DW_AT_stmt_list   : 0x66ec0
 <1><c39b3>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39b4>   DW_AT_byte_size   : 1
    <c39b5>   DW_AT_encoding    : 8	(unsigned char)
    <c39b6>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><c39ba>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39bb>   DW_AT_byte_size   : 2
    <c39bc>   DW_AT_encoding    : 7	(unsigned)
    <c39bd>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><c39c1>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39c2>   DW_AT_byte_size   : 4
    <c39c3>   DW_AT_encoding    : 7	(unsigned)
    <c39c4>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><c39c8>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39c9>   DW_AT_byte_size   : 8
    <c39ca>   DW_AT_encoding    : 7	(unsigned)
    <c39cb>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><c39cf>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39d0>   DW_AT_byte_size   : 1
    <c39d1>   DW_AT_encoding    : 6	(signed char)
    <c39d2>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><c39d6>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39d7>   DW_AT_byte_size   : 2
    <c39d8>   DW_AT_encoding    : 5	(signed)
    <c39d9>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><c39dd>: Abbrev Number: 7 (DW_TAG_base_type)
    <c39de>   DW_AT_byte_size   : 4
    <c39df>   DW_AT_encoding    : 5	(signed)
    <c39e0>   DW_AT_name        : int
 <1><c39e4>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39e5>   DW_AT_byte_size   : 8
    <c39e6>   DW_AT_encoding    : 5	(signed)
    <c39e7>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><c39eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <c39ec>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <c39f0>   DW_AT_decl_file   : 2
    <c39f1>   DW_AT_decl_line   : 194
    <c39f2>   DW_AT_decl_column : 27
    <c39f3>   DW_AT_type        : <0xc39e4>
 <1><c39f7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c39f8>   DW_AT_byte_size   : 8
    <c39f8>   DW_AT_type        : <0xc39fc>
 <1><c39fc>: Abbrev Number: 1 (DW_TAG_base_type)
    <c39fd>   DW_AT_byte_size   : 1
    <c39fe>   DW_AT_encoding    : 6	(signed char)
    <c39ff>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><c3a03>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3a04>   DW_AT_byte_size   : 8
    <c3a05>   DW_AT_encoding    : 5	(signed)
    <c3a06>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><c3a0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c3a0b>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <c3a0f>   DW_AT_decl_file   : 3
    <c3a10>   DW_AT_decl_line   : 108
    <c3a11>   DW_AT_decl_column : 19
    <c3a12>   DW_AT_type        : <0xc39eb>
 <1><c3a16>: Abbrev Number: 1 (DW_TAG_base_type)
    <c3a17>   DW_AT_byte_size   : 8
    <c3a18>   DW_AT_encoding    : 7	(unsigned)
    <c3a19>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><c3a1d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c3a1e>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <c3a22>   DW_AT_byte_size   : 24
    <c3a23>   DW_AT_decl_file   : 4
    <c3a24>   DW_AT_decl_line   : 82
    <c3a25>   DW_AT_decl_column : 16
    <c3a26>   DW_AT_sibling     : <0xc3a4e>
 <2><c3a2a>: Abbrev Number: 5 (DW_TAG_member)
    <c3a2b>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <c3a2f>   DW_AT_decl_file   : 4
    <c3a2f>   DW_AT_decl_line   : 83
    <c3a30>   DW_AT_decl_column : 21
    <c3a30>   DW_AT_type        : <0xc39f7>
    <c3a34>   DW_AT_data_member_location: 0
 <2><c3a35>: Abbrev Number: 9 (DW_TAG_member)
    <c3a36>   DW_AT_name        : len
    <c3a3a>   DW_AT_decl_file   : 4
    <c3a3b>   DW_AT_decl_line   : 84
    <c3a3c>   DW_AT_decl_column : 21
    <c3a3d>   DW_AT_type        : <0xc3a0a>
    <c3a41>   DW_AT_data_member_location: 8
 <2><c3a42>: Abbrev Number: 5 (DW_TAG_member)
    <c3a43>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <c3a47>   DW_AT_decl_file   : 4
    <c3a47>   DW_AT_decl_line   : 85
    <c3a48>   DW_AT_decl_column : 21
    <c3a48>   DW_AT_type        : <0xc3a0a>
