    <79281>   DW_AT_decl_file   : 15
    <79282>   DW_AT_decl_line   : 88
    <79283>   DW_AT_decl_column : 3
    <79284>   DW_AT_type        : <0x790af>
 <1><79288>: Abbrev Number: 12 (DW_TAG_structure_type)
    <79289>   DW_AT_name        : (indirect string, offset: 0x17736): FB_GL_PARAMS
    <7928d>   DW_AT_byte_size   : 80
    <7928e>   DW_AT_decl_file   : 15
    <7928f>   DW_AT_decl_line   : 90
    <79290>   DW_AT_decl_column : 16
    <79291>   DW_AT_sibling     : <0x79380>
 <2><79295>: Abbrev Number: 2 (DW_TAG_member)
    <79296>   DW_AT_name        : (indirect string, offset: 0x17f50): color_bits
    <7929a>   DW_AT_decl_file   : 15
    <7929b>   DW_AT_decl_line   : 91
    <7929c>   DW_AT_decl_column : 6
    <7929d>   DW_AT_type        : <0x77af9>
    <792a1>   DW_AT_data_member_location: 0
 <2><792a2>: Abbrev Number: 2 (DW_TAG_member)
    <792a3>   DW_AT_name        : (indirect string, offset: 0x172a4): color_red_bits
    <792a7>   DW_AT_decl_file   : 15
    <792a8>   DW_AT_decl_line   : 92
    <792a9>   DW_AT_decl_column : 6
    <792aa>   DW_AT_type        : <0x77af9>
    <792ae>   DW_AT_data_member_location: 4
 <2><792af>: Abbrev Number: 2 (DW_TAG_member)
    <792b0>   DW_AT_name        : (indirect string, offset: 0x16fcc): color_green_bits
    <792b4>   DW_AT_decl_file   : 15
    <792b5>   DW_AT_decl_line   : 93
    <792b6>   DW_AT_decl_column : 6
    <792b7>   DW_AT_type        : <0x77af9>
    <792bb>   DW_AT_data_member_location: 8
 <2><792bc>: Abbrev Number: 2 (DW_TAG_member)
    <792bd>   DW_AT_name        : (indirect string, offset: 0x176ea): color_blue_bits
    <792c1>   DW_AT_decl_file   : 15
    <792c2>   DW_AT_decl_line   : 94
    <792c3>   DW_AT_decl_column : 6
    <792c4>   DW_AT_type        : <0x77af9>
    <792c8>   DW_AT_data_member_location: 12
 <2><792c9>: Abbrev Number: 2 (DW_TAG_member)
    <792ca>   DW_AT_name        : (indirect string, offset: 0x17616): color_alpha_bits
    <792ce>   DW_AT_decl_file   : 15
    <792cf>   DW_AT_decl_line   : 95
    <792d0>   DW_AT_decl_column : 6
    <792d1>   DW_AT_type        : <0x77af9>
    <792d5>   DW_AT_data_member_location: 16
 <2><792d6>: Abbrev Number: 2 (DW_TAG_member)
    <792d7>   DW_AT_name        : (indirect string, offset: 0x16eb5): depth_bits
    <792db>   DW_AT_decl_file   : 15
    <792dc>   DW_AT_decl_line   : 96
    <792dd>   DW_AT_decl_column : 6
    <792de>   DW_AT_type        : <0x77af9>
    <792e2>   DW_AT_data_member_location: 20
 <2><792e3>: Abbrev Number: 2 (DW_TAG_member)
    <792e4>   DW_AT_name        : (indirect string, offset: 0x174f6): stencil_bits
    <792e8>   DW_AT_decl_file   : 15
    <792e9>   DW_AT_decl_line   : 97
    <792ea>   DW_AT_decl_column : 6
    <792eb>   DW_AT_type        : <0x77af9>
    <792ef>   DW_AT_data_member_location: 24
 <2><792f0>: Abbrev Number: 2 (DW_TAG_member)
    <792f1>   DW_AT_name        : (indirect string, offset: 0x17503): accum_bits
    <792f5>   DW_AT_decl_file   : 15
    <792f6>   DW_AT_decl_line   : 98
    <792f7>   DW_AT_decl_column : 6
    <792f8>   DW_AT_type        : <0x77af9>
    <792fc>   DW_AT_data_member_location: 28
 <2><792fd>: Abbrev Number: 2 (DW_TAG_member)
    <792fe>   DW_AT_name        : (indirect string, offset: 0x17095): accum_red_bits
    <79302>   DW_AT_decl_file   : 15
    <79303>   DW_AT_decl_line   : 99
    <79304>   DW_AT_decl_column : 6
    <79305>   DW_AT_type        : <0x77af9>
    <79309>   DW_AT_data_member_location: 32
 <2><7930a>: Abbrev Number: 2 (DW_TAG_member)
    <7930b>   DW_AT_name        : (indirect string, offset: 0x1747e): accum_green_bits
    <7930f>   DW_AT_decl_file   : 15
    <79310>   DW_AT_decl_line   : 100
    <79311>   DW_AT_decl_column : 6
    <79312>   DW_AT_type        : <0x77af9>
    <79316>   DW_AT_data_member_location: 36
 <2><79317>: Abbrev Number: 2 (DW_TAG_member)
    <79318>   DW_AT_name        : (indirect string, offset: 0x174c2): accum_blue_bits
    <7931c>   DW_AT_decl_file   : 15
    <7931d>   DW_AT_decl_line   : 101
    <7931e>   DW_AT_decl_column : 6
    <7931f>   DW_AT_type        : <0x77af9>
    <79323>   DW_AT_data_member_location: 40
 <2><79324>: Abbrev Number: 2 (DW_TAG_member)
    <79325>   DW_AT_name        : (indirect string, offset: 0x17084): accum_alpha_bits
    <79329>   DW_AT_decl_file   : 15
    <7932a>   DW_AT_decl_line   : 102
    <7932b>   DW_AT_decl_column : 6
    <7932c>   DW_AT_type        : <0x77af9>
    <79330>   DW_AT_data_member_location: 44
 <2><79331>: Abbrev Number: 2 (DW_TAG_member)
    <79332>   DW_AT_name        : (indirect string, offset: 0x171c8): num_samples
    <79336>   DW_AT_decl_file   : 15
    <79337>   DW_AT_decl_line   : 103
    <79338>   DW_AT_decl_column : 6
    <79339>   DW_AT_type        : <0x77af9>
    <7933d>   DW_AT_data_member_location: 48
 <2><7933e>: Abbrev Number: 2 (DW_TAG_member)
    <7933f>   DW_AT_name        : (indirect string, offset: 0x1753f): init_mode_2d
    <79343>   DW_AT_decl_file   : 15
    <79344>   DW_AT_decl_line   : 104
    <79345>   DW_AT_decl_column : 6
    <79346>   DW_AT_type        : <0x77af9>
    <7934a>   DW_AT_data_member_location: 52
 <2><7934b>: Abbrev Number: 2 (DW_TAG_member)
    <7934c>   DW_AT_name        : (indirect string, offset: 0x17544): mode_2d
    <79350>   DW_AT_decl_file   : 15
    <79351>   DW_AT_decl_line   : 105
    <79352>   DW_AT_decl_column : 6
    <79353>   DW_AT_type        : <0x77af9>
    <79357>   DW_AT_data_member_location: 56
 <2><79358>: Abbrev Number: 2 (DW_TAG_member)
    <79359>   DW_AT_name        : (indirect string, offset: 0x17534): init_scale
    <7935d>   DW_AT_decl_file   : 15
    <7935e>   DW_AT_decl_line   : 106
    <7935f>   DW_AT_decl_column : 6
    <79360>   DW_AT_type        : <0x77af9>
    <79364>   DW_AT_data_member_location: 60
 <2><79365>: Abbrev Number: 2 (DW_TAG_member)
    <79366>   DW_AT_name        : (indirect string, offset: 0x17539): scale
    <7936a>   DW_AT_decl_file   : 15
    <7936b>   DW_AT_decl_line   : 107
    <7936c>   DW_AT_decl_column : 6
    <7936d>   DW_AT_type        : <0x77af9>
    <79371>   DW_AT_data_member_location: 64
 <2><79372>: Abbrev Number: 2 (DW_TAG_member)
    <79373>   DW_AT_name        : (indirect string, offset: 0x17401): callback
    <79377>   DW_AT_decl_file   : 15
    <79378>   DW_AT_decl_line   : 108
    <79379>   DW_AT_decl_column : 9
    <7937a>   DW_AT_type        : <0x77bac>
    <7937e>   DW_AT_data_member_location: 72
 <2><7937f>: Abbrev Number: 0
 <1><79380>: Abbrev Number: 3 (DW_TAG_typedef)
    <79381>   DW_AT_name        : (indirect string, offset: 0x17736): FB_GL_PARAMS
    <79385>   DW_AT_decl_file   : 15
    <79386>   DW_AT_decl_line   : 109
    <79387>   DW_AT_decl_column : 3
    <79388>   DW_AT_type        : <0x79288>
 <1><7938c>: Abbrev Number: 39 (DW_TAG_variable)
    <7938d>   DW_AT_name        : (indirect string, offset: 0x1704c): __fb_gl
    <79391>   DW_AT_decl_file   : 15
    <79391>   DW_AT_decl_line   : 111
    <79392>   DW_AT_decl_column : 14
    <79393>   DW_AT_type        : <0x7927c>
    <79397>   DW_AT_external    : 1
    <79397>   DW_AT_declaration : 1
 <1><79397>: Abbrev Number: 39 (DW_TAG_variable)
    <79398>   DW_AT_name        : (indirect string, offset: 0x17054): __fb_gl_params
    <7939c>   DW_AT_decl_file   : 15
    <7939c>   DW_AT_decl_line   : 112
    <7939d>   DW_AT_decl_column : 21
    <7939e>   DW_AT_type        : <0x79380>
    <793a2>   DW_AT_external    : 1
    <793a2>   DW_AT_declaration : 1
 <1><793a2>: Abbrev Number: 30 (DW_TAG_subprogram)
    <793a3>   DW_AT_external    : 1
    <793a3>   DW_AT_name        : (indirect string, offset: 0x17337): fb_hScreenInfo
    <793a7>   DW_AT_decl_file   : 13
    <793a8>   DW_AT_decl_line   : 416
    <793aa>   DW_AT_decl_column : 13
    <793ab>   DW_AT_prototyped  : 1
    <793ab>   DW_AT_declaration : 1
    <793ab>   DW_AT_sibling     : <0x793c4>
 <2><793af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <793b0>   DW_AT_type        : <0x793c4>
 <2><793b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <793b5>   DW_AT_type        : <0x793c4>
 <2><793b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <793ba>   DW_AT_type        : <0x793c4>
 <2><793be>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <793bf>   DW_AT_type        : <0x793c4>
 <2><793c3>: Abbrev Number: 0
 <1><793c4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <793c5>   DW_AT_byte_size   : 8
    <793c5>   DW_AT_type        : <0x77b6d>
 <1><793c9>: Abbrev Number: 31 (DW_TAG_subprogram)
    <793ca>   DW_AT_external    : 1
    <793ca>   DW_AT_name        : (indirect string, offset: 0x17155): fb_hGetDisplayHandle
    <793ce>   DW_AT_decl_file   : 13
    <793ce>   DW_AT_decl_line   : 429
    <793d0>   DW_AT_decl_column : 16
    <793d1>   DW_AT_prototyped  : 1
    <793d1>   DW_AT_type        : <0x77b6d>
    <793d5>   DW_AT_declaration : 1
 <1><793d5>: Abbrev Number: 31 (DW_TAG_subprogram)
    <793d6>   DW_AT_external    : 1
    <793d6>   DW_AT_name        : (indirect string, offset: 0x17749): fb_hGetWindowHandle
    <793da>   DW_AT_decl_file   : 13
    <793da>   DW_AT_decl_line   : 428
    <793dc>   DW_AT_decl_column : 16
    <793dd>   DW_AT_prototyped  : 1
    <793dd>   DW_AT_type        : <0x77b6d>
    <793e1>   DW_AT_declaration : 1
 <1><793e1>: Abbrev Number: 31 (DW_TAG_subprogram)
    <793e2>   DW_AT_external    : 1
    <793e2>   DW_AT_name        : (indirect string, offset: 0x16758): fb_hGetContext
    <793e6>   DW_AT_decl_file   : 13
    <793e6>   DW_AT_decl_line   : 396
    <793e8>   DW_AT_decl_column : 19
    <793e9>   DW_AT_prototyped  : 1
    <793e9>   DW_AT_type        : <0x793ed>
    <793ed>   DW_AT_declaration : 1
 <1><793ed>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <793ee>   DW_AT_byte_size   : 8
    <793ee>   DW_AT_type        : <0x788be>
 <1><793f2>: Abbrev Number: 32 (DW_TAG_subprogram)
    <793f3>   DW_AT_external    : 1
    <793f3>   DW_AT_name        : (indirect string, offset: 0x17132): strdup
    <793f7>   DW_AT_decl_file   : 17
    <793f8>   DW_AT_decl_line   : 171
    <793f9>   DW_AT_decl_column : 14
    <793fa>   DW_AT_prototyped  : 1
    <793fa>   DW_AT_type        : <0x77b2b>
    <793fe>   DW_AT_declaration : 1
    <793fe>   DW_AT_sibling     : <0x79408>
 <2><79402>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79403>   DW_AT_type        : <0x77b96>
 <2><79407>: Abbrev Number: 0
 <1><79408>: Abbrev Number: 30 (DW_TAG_subprogram)
    <79409>   DW_AT_external    : 1
    <79409>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <7940d>   DW_AT_decl_file   : 16
    <7940e>   DW_AT_decl_line   : 565
    <79410>   DW_AT_decl_column : 13
    <79411>   DW_AT_prototyped  : 1
    <79411>   DW_AT_declaration : 1
    <79411>   DW_AT_sibling     : <0x7941b>
 <2><79415>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79416>   DW_AT_type        : <0x77b1d>
 <2><7941a>: Abbrev Number: 0
 <1><7941b>: Abbrev Number: 30 (DW_TAG_subprogram)
    <7941c>   DW_AT_external    : 1
    <7941c>   DW_AT_name        : (indirect string, offset: 0x5e5d): fb_GfxSetWindowTitle
    <79420>   DW_AT_decl_file   : 13
    <79421>   DW_AT_decl_line   : 472
    <79423>   DW_AT_decl_column : 20
    <79424>   DW_AT_prototyped  : 1
    <79424>   DW_AT_declaration : 1
    <79424>   DW_AT_sibling     : <0x7942e>
 <2><79428>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79429>   DW_AT_type        : <0x77eb8>
 <2><7942d>: Abbrev Number: 0
 <1><7942e>: Abbrev Number: 32 (DW_TAG_subprogram)
    <7942f>   DW_AT_external    : 1
    <7942f>   DW_AT_name        : (indirect string, offset: 0x16360): fb_StrAssign
    <79433>   DW_AT_decl_file   : 6
    <79434>   DW_AT_decl_line   : 121
    <79435>   DW_AT_decl_column : 21
    <79436>   DW_AT_prototyped  : 1
    <79436>   DW_AT_type        : <0x77b1d>
    <7943a>   DW_AT_declaration : 1
    <7943a>   DW_AT_sibling     : <0x79458>
 <2><7943e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7943f>   DW_AT_type        : <0x77b1d>
 <2><79443>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79444>   DW_AT_type        : <0x77b6d>
 <2><79448>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79449>   DW_AT_type        : <0x77b1d>
 <2><7944d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7944e>   DW_AT_type        : <0x77b6d>
 <2><79452>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79453>   DW_AT_type        : <0x77af9>
 <2><79457>: Abbrev Number: 0
 <1><79458>: Abbrev Number: 32 (DW_TAG_subprogram)
    <79459>   DW_AT_external    : 1
    <79459>   DW_AT_name        : (indirect string, offset: 0x175cb): fb_StrAllocTempDescF
    <7945d>   DW_AT_decl_file   : 6
    <7945e>   DW_AT_decl_line   : 129
    <7945f>   DW_AT_decl_column : 21
    <79460>   DW_AT_prototyped  : 1
    <79460>   DW_AT_type        : <0x77eb8>
    <79464>   DW_AT_declaration : 1
    <79464>   DW_AT_sibling     : <0x79473>
 <2><79468>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79469>   DW_AT_type        : <0x77b2b>
 <2><7946d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7946e>   DW_AT_type        : <0x77b6d>
 <2><79472>: Abbrev Number: 0
 <1><79473>: Abbrev Number: 55 (DW_TAG_subprogram)
    <79474>   DW_AT_external    : 1
    <79474>   DW_AT_name        : (indirect string, offset: 0x17063): strlen
    <79478>   DW_AT_decl_file   : 17
    <79479>   DW_AT_decl_line   : 391
    <7947b>   DW_AT_decl_column : 15
    <7947c>   DW_AT_prototyped  : 1
    <7947c>   DW_AT_type        : <0x77b3c>
    <79480>   DW_AT_declaration : 1
    <79480>   DW_AT_sibling     : <0x7948a>
 <2><79484>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79485>   DW_AT_type        : <0x77b96>
 <2><79489>: Abbrev Number: 0
 <1><7948a>: Abbrev Number: 40 (DW_TAG_subprogram)
    <7948b>   DW_AT_external    : 1
    <7948b>   DW_AT_name        : (indirect string, offset: 0x2f47): fb_GfxControl_i64
    <7948f>   DW_AT_decl_file   : 1
    <7948f>   DW_AT_decl_line   : 281
    <79491>   DW_AT_decl_column : 13
    <79491>   DW_AT_prototyped  : 1
    <79491>   DW_AT_low_pc      : 0x45a320
    <79499>   DW_AT_high_pc     : 0x82
    <794a1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <794a3>   DW_AT_call_all_calls: 1
    <794a3>   DW_AT_sibling     : <0x79588>
 <2><794a7>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <794a8>   DW_AT_name        : (indirect string, offset: 0x17711): what
    <794ac>   DW_AT_decl_file   : 1
    <794ac>   DW_AT_decl_line   : 281
    <794ae>   DW_AT_decl_column : 36
    <794af>   DW_AT_type        : <0x77af9>
    <794b3>   DW_AT_location    : 0x2216d (location list)
    <794b7>   DW_AT_GNU_locviews: 0x22169
 <2><794bb>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <794bc>   DW_AT_name        : (indirect string, offset: 0x17848): param1
    <794c0>   DW_AT_decl_file   : 1
    <794c0>   DW_AT_decl_line   : 281
    <794c2>   DW_AT_decl_column : 53
    <794c3>   DW_AT_type        : <0x79588>
    <794c7>   DW_AT_location    : 0x22187 (location list)
    <794cb>   DW_AT_GNU_locviews: 0x2217f
 <2><794cf>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <794d0>   DW_AT_name        : (indirect string, offset: 0x1784f): param2
    <794d4>   DW_AT_decl_file   : 1
    <794d4>   DW_AT_decl_line   : 281
    <794d6>   DW_AT_decl_column : 72
    <794d7>   DW_AT_type        : <0x79588>
    <794db>   DW_AT_location    : 0x221af (location list)
    <794df>   DW_AT_GNU_locviews: 0x221a7
 <2><794e3>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <794e4>   DW_AT_name        : (indirect string, offset: 0x17856): param3
    <794e8>   DW_AT_decl_file   : 1
    <794e8>   DW_AT_decl_line   : 281
    <794ea>   DW_AT_decl_column : 91
    <794eb>   DW_AT_type        : <0x79588>
    <794ef>   DW_AT_location    : 0x221d7 (location list)
    <794f3>   DW_AT_GNU_locviews: 0x221cf
 <2><794f7>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <794f8>   DW_AT_name        : (indirect string, offset: 0x1785d): param4
    <794fc>   DW_AT_decl_file   : 1
    <794fc>   DW_AT_decl_line   : 281
    <794fe>   DW_AT_decl_column : 110
    <794ff>   DW_AT_type        : <0x79588>
    <79503>   DW_AT_location    : 0x221ff (location list)
    <79507>   DW_AT_GNU_locviews: 0x221f7
 <2><7950b>: Abbrev Number: 14 (DW_TAG_variable)
    <7950c>   DW_AT_name        : p1
    <7950f>   DW_AT_decl_file   : 1
    <7950f>   DW_AT_decl_line   : 283
    <79511>   DW_AT_decl_column : 10
    <79512>   DW_AT_type        : <0x77b6d>
    <79516>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><7951a>: Abbrev Number: 14 (DW_TAG_variable)
    <7951b>   DW_AT_name        : p2
    <7951e>   DW_AT_decl_file   : 1
    <7951e>   DW_AT_decl_line   : 283
    <79520>   DW_AT_decl_column : 14
    <79521>   DW_AT_type        : <0x77b6d>
    <79525>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><79529>: Abbrev Number: 14 (DW_TAG_variable)
    <7952a>   DW_AT_name        : p3
    <7952d>   DW_AT_decl_file   : 1
    <7952d>   DW_AT_decl_line   : 283
    <7952f>   DW_AT_decl_column : 18
    <79530>   DW_AT_type        : <0x77b6d>
    <79534>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><79538>: Abbrev Number: 14 (DW_TAG_variable)
    <79539>   DW_AT_name        : p4
    <7953c>   DW_AT_decl_file   : 1
    <7953c>   DW_AT_decl_line   : 283
    <7953e>   DW_AT_decl_column : 22
    <7953f>   DW_AT_type        : <0x77b6d>
    <79543>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><79546>: Abbrev Number: 25 (DW_TAG_call_site)
    <79547>   DW_AT_call_return_pc: 0x45a35f
    <7954f>   DW_AT_call_origin : <0x7968b>
    <79553>   DW_AT_sibling     : <0x7957a>
 <3><79557>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79558>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7955a>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><7955e>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7955f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <79561>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><79565>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79566>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <79568>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><7956c>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7956d>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7956f>   DW_AT_call_value  : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><79573>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79574>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <79576>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><79579>: Abbrev Number: 0
 <2><7957a>: Abbrev Number: 15 (DW_TAG_call_site)
    <7957b>   DW_AT_call_return_pc: 0x45a3a2
    <79583>   DW_AT_call_origin : <0x79958>
 <2><79587>: Abbrev Number: 0
 <1><79588>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <79589>   DW_AT_byte_size   : 8
    <79589>   DW_AT_type        : <0x77b5a>
 <1><7958d>: Abbrev Number: 40 (DW_TAG_subprogram)
    <7958e>   DW_AT_external    : 1
    <7958e>   DW_AT_name        : (indirect string, offset: 0x173c0): fb_GfxControl_i32
    <79592>   DW_AT_decl_file   : 1
    <79592>   DW_AT_decl_line   : 271
    <79594>   DW_AT_decl_column : 13
    <79594>   DW_AT_prototyped  : 1
    <79594>   DW_AT_low_pc      : 0x45a2a0
    <7959c>   DW_AT_high_pc     : 0x80
    <795a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <795a6>   DW_AT_call_all_calls: 1
    <795a6>   DW_AT_sibling     : <0x7968b>
 <2><795aa>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <795ab>   DW_AT_name        : (indirect string, offset: 0x17711): what
    <795af>   DW_AT_decl_file   : 1
    <795af>   DW_AT_decl_line   : 271
    <795b1>   DW_AT_decl_column : 36
    <795b2>   DW_AT_type        : <0x77af9>
    <795b6>   DW_AT_location    : 0x22223 (location list)
    <795ba>   DW_AT_GNU_locviews: 0x2221f
 <2><795be>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <795bf>   DW_AT_name        : (indirect string, offset: 0x17848): param1
    <795c3>   DW_AT_decl_file   : 1
    <795c3>   DW_AT_decl_line   : 271
    <795c5>   DW_AT_decl_column : 47
    <795c6>   DW_AT_type        : <0x7818d>
    <795ca>   DW_AT_location    : 0x2223d (location list)
    <795ce>   DW_AT_GNU_locviews: 0x22235
 <2><795d2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <795d3>   DW_AT_name        : (indirect string, offset: 0x1784f): param2
    <795d7>   DW_AT_decl_file   : 1
    <795d7>   DW_AT_decl_line   : 271
    <795d9>   DW_AT_decl_column : 60
    <795da>   DW_AT_type        : <0x7818d>
    <795de>   DW_AT_location    : 0x22265 (location list)
    <795e2>   DW_AT_GNU_locviews: 0x2225d
 <2><795e6>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <795e7>   DW_AT_name        : (indirect string, offset: 0x17856): param3
    <795eb>   DW_AT_decl_file   : 1
    <795eb>   DW_AT_decl_line   : 271
    <795ed>   DW_AT_decl_column : 73
    <795ee>   DW_AT_type        : <0x7818d>
    <795f2>   DW_AT_location    : 0x2228d (location list)
    <795f6>   DW_AT_GNU_locviews: 0x22285
 <2><795fa>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <795fb>   DW_AT_name        : (indirect string, offset: 0x1785d): param4
    <795ff>   DW_AT_decl_file   : 1
    <795ff>   DW_AT_decl_line   : 271
    <79601>   DW_AT_decl_column : 86
    <79602>   DW_AT_type        : <0x7818d>
    <79606>   DW_AT_location    : 0x222b5 (location list)
    <7960a>   DW_AT_GNU_locviews: 0x222ad
 <2><7960e>: Abbrev Number: 14 (DW_TAG_variable)
    <7960f>   DW_AT_name        : p1
    <79612>   DW_AT_decl_file   : 1
    <79612>   DW_AT_decl_line   : 273
    <79614>   DW_AT_decl_column : 10
    <79615>   DW_AT_type        : <0x77b6d>
    <79619>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><7961d>: Abbrev Number: 14 (DW_TAG_variable)
    <7961e>   DW_AT_name        : p2
    <79621>   DW_AT_decl_file   : 1
    <79621>   DW_AT_decl_line   : 273
    <79623>   DW_AT_decl_column : 14
    <79624>   DW_AT_type        : <0x77b6d>
    <79628>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><7962c>: Abbrev Number: 14 (DW_TAG_variable)
    <7962d>   DW_AT_name        : p3
    <79630>   DW_AT_decl_file   : 1
    <79630>   DW_AT_decl_line   : 273
    <79632>   DW_AT_decl_column : 18
    <79633>   DW_AT_type        : <0x77b6d>
    <79637>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><7963b>: Abbrev Number: 14 (DW_TAG_variable)
    <7963c>   DW_AT_name        : p4
    <7963f>   DW_AT_decl_file   : 1
    <7963f>   DW_AT_decl_line   : 273
    <79641>   DW_AT_decl_column : 22
    <79642>   DW_AT_type        : <0x77b6d>
    <79646>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><79649>: Abbrev Number: 25 (DW_TAG_call_site)
    <7964a>   DW_AT_call_return_pc: 0x45a2df
    <79652>   DW_AT_call_origin : <0x7968b>
    <79656>   DW_AT_sibling     : <0x7967d>
 <3><7965a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7965b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7965d>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><79661>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79662>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <79664>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><79668>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79669>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <7966b>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><7966f>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79670>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <79672>   DW_AT_call_value  : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><79676>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79677>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <79679>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><7967c>: Abbrev Number: 0
 <2><7967d>: Abbrev Number: 15 (DW_TAG_call_site)
    <7967e>   DW_AT_call_return_pc: 0x45a320
    <79686>   DW_AT_call_origin : <0x79958>
 <2><7968a>: Abbrev Number: 0
 <1><7968b>: Abbrev Number: 56 (DW_TAG_subprogram)
    <7968c>   DW_AT_external    : 1
    <7968c>   DW_AT_name        : (indirect string, offset: 0x17226): fb_GfxControl_i
    <79690>   DW_AT_decl_file   : 1
    <79691>   DW_AT_decl_line   : 58
    <79692>   DW_AT_decl_column : 13
    <79693>   DW_AT_prototyped  : 1
    <79693>   DW_AT_low_pc      : 0x459da0
    <7969b>   DW_AT_high_pc     : 0x4f5
    <796a3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <796a5>   DW_AT_sibling     : <0x79873>
 <2><796a9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <796aa>   DW_AT_name        : (indirect string, offset: 0x17711): what
    <796ae>   DW_AT_decl_file   : 1
    <796ae>   DW_AT_decl_line   : 58
    <796af>   DW_AT_decl_column : 34
    <796b0>   DW_AT_type        : <0x77af9>
    <796b4>   DW_AT_location    : 0x22323 (location list)
    <796b8>   DW_AT_GNU_locviews: 0x222d5
 <2><796bc>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <796bd>   DW_AT_name        : (indirect string, offset: 0x17848): param1
    <796c1>   DW_AT_decl_file   : 1
    <796c1>   DW_AT_decl_line   : 58
    <796c2>   DW_AT_decl_column : 49
    <796c3>   DW_AT_type        : <0x793c4>
    <796c7>   DW_AT_location    : 0x2247e (location list)
    <796cb>   DW_AT_GNU_locviews: 0x2246e
 <2><796cf>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <796d0>   DW_AT_name        : (indirect string, offset: 0x1784f): param2
    <796d4>   DW_AT_decl_file   : 1
    <796d4>   DW_AT_decl_line   : 58
    <796d5>   DW_AT_decl_column : 66
    <796d6>   DW_AT_type        : <0x793c4>
    <796da>   DW_AT_location    : 0x224f7 (location list)
    <796de>   DW_AT_GNU_locviews: 0x224e7
 <2><796e2>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <796e3>   DW_AT_name        : (indirect string, offset: 0x17856): param3
    <796e7>   DW_AT_decl_file   : 1
    <796e7>   DW_AT_decl_line   : 58
    <796e8>   DW_AT_decl_column : 83
    <796e9>   DW_AT_type        : <0x793c4>
    <796ed>   DW_AT_location    : 0x22570 (location list)
    <796f1>   DW_AT_GNU_locviews: 0x22560
 <2><796f5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <796f6>   DW_AT_name        : (indirect string, offset: 0x1785d): param4
    <796fa>   DW_AT_decl_file   : 1
    <796fa>   DW_AT_decl_line   : 58
    <796fb>   DW_AT_decl_column : 100
    <796fc>   DW_AT_type        : <0x793c4>
    <79700>   DW_AT_location    : 0x225e9 (location list)
    <79704>   DW_AT_GNU_locviews: 0x225d9
 <2><79708>: Abbrev Number: 19 (DW_TAG_variable)
    <79709>   DW_AT_name        : (indirect string, offset: 0x1673f): context
    <7970d>   DW_AT_decl_file   : 1
    <7970d>   DW_AT_decl_line   : 60
    <7970e>   DW_AT_decl_column : 13
    <7970f>   DW_AT_type        : <0x793ed>
    <79713>   DW_AT_location    : 0x22666 (location list)
    <79717>   DW_AT_GNU_locviews: 0x22652
 <2><7971b>: Abbrev Number: 41 (DW_TAG_variable)
    <7971c>   DW_AT_name        : res
    <79720>   DW_AT_decl_file   : 1
    <79720>   DW_AT_decl_line   : 61
    <79721>   DW_AT_decl_column : 6
    <79722>   DW_AT_type        : <0x77af9>
    <79726>   DW_AT_location    : 0x226b7 (location list)
    <7972a>   DW_AT_GNU_locviews: 0x226ad
 <2><7972e>: Abbrev Number: 19 (DW_TAG_variable)
    <7972f>   DW_AT_name        : (indirect string, offset: 0x17763): res1
    <79733>   DW_AT_decl_file   : 1
    <79733>   DW_AT_decl_line   : 62
    <79734>   DW_AT_decl_column : 10
    <79735>   DW_AT_type        : <0x77b6d>
    <79739>   DW_AT_location    : 0x22715 (location list)
    <7973d>   DW_AT_GNU_locviews: 0x226df
 <2><79741>: Abbrev Number: 19 (DW_TAG_variable)
    <79742>   DW_AT_name        : (indirect string, offset: 0x17768): res2
    <79746>   DW_AT_decl_file   : 1
    <79746>   DW_AT_decl_line   : 62
    <79747>   DW_AT_decl_column : 20
    <79748>   DW_AT_type        : <0x77b6d>
    <7974c>   DW_AT_location    : 0x22805 (location list)
    <79750>   DW_AT_GNU_locviews: 0x227e1
 <2><79754>: Abbrev Number: 19 (DW_TAG_variable)
    <79755>   DW_AT_name        : (indirect string, offset: 0x1776d): res3
    <79759>   DW_AT_decl_file   : 1
    <79759>   DW_AT_decl_line   : 62
    <7975a>   DW_AT_decl_column : 30
    <7975b>   DW_AT_type        : <0x77b6d>
    <7975f>   DW_AT_location    : 0x22897 (location list)
    <79763>   DW_AT_GNU_locviews: 0x2288d
 <2><79767>: Abbrev Number: 19 (DW_TAG_variable)
    <79768>   DW_AT_name        : (indirect string, offset: 0x17772): res4
    <7976c>   DW_AT_decl_file   : 1
    <7976c>   DW_AT_decl_line   : 62
    <7976d>   DW_AT_decl_column : 40
    <7976e>   DW_AT_type        : <0x77b6d>
    <79772>   DW_AT_location    : 0x228c8 (location list)
    <79776>   DW_AT_GNU_locviews: 0x228be
 <2><7977a>: Abbrev Number: 17 (DW_TAG_variable)
    <7977b>   DW_AT_name        : (indirect string, offset: 0x17743): temp1
    <7977f>   DW_AT_decl_file   : 1
    <7977f>   DW_AT_decl_line   : 63
    <79780>   DW_AT_decl_column : 10
    <79781>   DW_AT_type        : <0x77b6d>
    <79785>   DW_AT_location    : 3 byte block: 91 88 7f 	(DW_OP_fbreg: -120)
 <2><79789>: Abbrev Number: 17 (DW_TAG_variable)
    <7978a>   DW_AT_name        : (indirect string, offset: 0x17175): temp2
    <7978e>   DW_AT_decl_file   : 1
    <7978e>   DW_AT_decl_line   : 63
    <7978f>   DW_AT_decl_column : 17
    <79790>   DW_AT_type        : <0x77b6d>
    <79794>   DW_AT_location    : 3 byte block: 91 90 7f 	(DW_OP_fbreg: -112)
 <2><79798>: Abbrev Number: 17 (DW_TAG_variable)
    <79799>   DW_AT_name        : (indirect string, offset: 0x1717b): temp3
    <7979d>   DW_AT_decl_file   : 1
    <7979d>   DW_AT_decl_line   : 63
    <7979e>   DW_AT_decl_column : 24
    <7979f>   DW_AT_type        : <0x77b6d>
    <797a3>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <2><797a7>: Abbrev Number: 17 (DW_TAG_variable)
    <797a8>   DW_AT_name        : (indirect string, offset: 0x1775d): temp4
    <797ac>   DW_AT_decl_file   : 1
    <797ac>   DW_AT_decl_line   : 63
    <797ad>   DW_AT_decl_column : 31
    <797ae>   DW_AT_type        : <0x77b6d>
    <797b2>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><797b6>: Abbrev Number: 57 (DW_TAG_lexical_block)
    <797b7>   DW_AT_ranges      : 0x171d2
    <797bb>   DW_AT_sibling     : <0x79820>
 <3><797bf>: Abbrev Number: 42 (DW_TAG_variable)
    <797c0>   DW_AT_name        : w
    <797c2>   DW_AT_decl_file   : 1
    <797c2>   DW_AT_decl_line   : 91
    <797c3>   DW_AT_decl_column : 12
    <797c4>   DW_AT_type        : <0x77b6d>
    <797c8>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><797cc>: Abbrev Number: 42 (DW_TAG_variable)
    <797cd>   DW_AT_name        : h
    <797cf>   DW_AT_decl_file   : 1
    <797cf>   DW_AT_decl_line   : 91
    <797d0>   DW_AT_decl_column : 19
    <797d1>   DW_AT_type        : <0x77b6d>
    <797d5>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><797d9>: Abbrev Number: 17 (DW_TAG_variable)
    <797da>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <797de>   DW_AT_decl_file   : 1
    <797de>   DW_AT_decl_line   : 91
    <797df>   DW_AT_decl_column : 26
    <797e0>   DW_AT_type        : <0x77b6d>
    <797e4>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><797e8>: Abbrev Number: 17 (DW_TAG_variable)
    <797e9>   DW_AT_name        : (indirect string, offset: 0x16fa0): refresh
    <797ed>   DW_AT_decl_file   : 1
    <797ed>   DW_AT_decl_line   : 91
    <797ee>   DW_AT_decl_column : 37
    <797ef>   DW_AT_type        : <0x77b6d>
    <797f3>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><797f6>: Abbrev Number: 58 (DW_TAG_call_site)
    <797f7>   DW_AT_call_return_pc: 0x45a13b
    <797ff>   DW_AT_call_origin : <0x793a2>
 <4><79803>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79804>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <79806>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <4><7980a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7980b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <7980d>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <4><79811>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79812>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <79814>   DW_AT_call_value  : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <4><79818>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79819>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <7981b>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><7981e>: Abbrev Number: 0
 <3><7981f>: Abbrev Number: 0
 <2><79820>: Abbrev Number: 15 (DW_TAG_call_site)
    <79821>   DW_AT_call_return_pc: 0x459e00
    <79829>   DW_AT_call_origin : <0x793e1>
 <2><7982d>: Abbrev Number: 59 (DW_TAG_call_site)
    <7982e>   DW_AT_call_return_pc: 0x459e8c
    <79836>   DW_AT_sibling     : <0x7984b>
 <3><7983a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7983b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7983d>   DW_AT_call_value  : 4 byte block: 40 4b 24 1f 	(DW_OP_lit16; DW_OP_lit27; DW_OP_shl; DW_OP_neg)
 <3><79842>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79843>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <79845>   DW_AT_call_value  : 4 byte block: 40 4b 24 1f 	(DW_OP_lit16; DW_OP_lit27; DW_OP_shl; DW_OP_neg)
 <3><7984a>: Abbrev Number: 0
 <2><7984b>: Abbrev Number: 15 (DW_TAG_call_site)
    <7984c>   DW_AT_call_return_pc: 0x45a161
    <79854>   DW_AT_call_origin : <0x793d5>
 <2><79858>: Abbrev Number: 15 (DW_TAG_call_site)
    <79859>   DW_AT_call_return_pc: 0x45a169
    <79861>   DW_AT_call_origin : <0x793c9>
 <2><79865>: Abbrev Number: 15 (DW_TAG_call_site)
    <79866>   DW_AT_call_return_pc: 0x45a295
    <7986e>   DW_AT_call_origin : <0x79958>
 <2><79872>: Abbrev Number: 0
 <1><79873>: Abbrev Number: 60 (DW_TAG_subprogram)
    <79874>   DW_AT_external    : 1
    <79874>   DW_AT_name        : (indirect string, offset: 0x17245): fb_GfxControl_s
    <79878>   DW_AT_decl_file   : 1
    <79879>   DW_AT_decl_line   : 6
    <7987a>   DW_AT_decl_column : 13
    <7987b>   DW_AT_prototyped  : 1
    <7987b>   DW_AT_low_pc      : 0x459c60
    <79883>   DW_AT_high_pc     : 0x139
    <7988b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7988d>   DW_AT_call_all_calls: 1
    <7988d>   DW_AT_sibling     : <0x79958>
 <2><79891>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <79892>   DW_AT_name        : (indirect string, offset: 0x17711): what
    <79896>   DW_AT_decl_file   : 1
    <79896>   DW_AT_decl_line   : 6
    <79897>   DW_AT_decl_column : 34
    <79898>   DW_AT_type        : <0x77af9>
    <7989c>   DW_AT_location    : 0x228ff (location list)
    <798a0>   DW_AT_GNU_locviews: 0x228ef
 <2><798a4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <798a5>   DW_AT_name        : (indirect string, offset: 0x173ee): param
    <798a9>   DW_AT_decl_file   : 1
    <798a9>   DW_AT_decl_line   : 6
    <798aa>   DW_AT_decl_column : 50
    <798ab>   DW_AT_type        : <0x77eb8>
    <798af>   DW_AT_location    : 0x22955 (location list)
    <798b3>   DW_AT_GNU_locviews: 0x2293f
 <2><798b7>: Abbrev Number: 41 (DW_TAG_variable)
    <798b8>   DW_AT_name        : src
    <798bc>   DW_AT_decl_file   : 1
    <798bc>   DW_AT_decl_line   : 8
    <798bd>   DW_AT_decl_column : 12
    <798be>   DW_AT_type        : <0x77eb8>
    <798c2>   DW_AT_location    : 0x229a7 (location list)
    <798c6>   DW_AT_GNU_locviews: 0x229a5
 <2><798ca>: Abbrev Number: 15 (DW_TAG_call_site)
    <798cb>   DW_AT_call_return_pc: 0x459c9d
    <798d3>   DW_AT_call_origin : <0x79408>
 <2><798d7>: Abbrev Number: 25 (DW_TAG_call_site)
    <798d8>   DW_AT_call_return_pc: 0x459d0b
    <798e0>   DW_AT_call_origin : <0x79473>
    <798e4>   DW_AT_sibling     : <0x798ef>
 <3><798e8>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <798e9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <798eb>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><798ee>: Abbrev Number: 0
 <2><798ef>: Abbrev Number: 25 (DW_TAG_call_site)
    <798f0>   DW_AT_call_return_pc: 0x459d17
    <798f8>   DW_AT_call_origin : <0x79458>
    <798fc>   DW_AT_sibling     : <0x79907>
 <3><79900>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79901>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <79903>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><79906>: Abbrev Number: 0
 <2><79907>: Abbrev Number: 43 (DW_TAG_call_site)
    <79908>   DW_AT_call_return_pc: 0x459d3a
    <79910>   DW_AT_call_tail_call: 1
    <79910>   DW_AT_call_origin : <0x7942e>
    <79914>   DW_AT_sibling     : <0x79931>
 <3><79918>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79919>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <7991b>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><7991f>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79920>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <79922>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><79925>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79926>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <79928>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <3><7992b>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <7992c>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <7992e>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><79930>: Abbrev Number: 0
 <2><79931>: Abbrev Number: 43 (DW_TAG_call_site)
    <79932>   DW_AT_call_return_pc: 0x459d4f
    <7993a>   DW_AT_call_tail_call: 1
    <7993a>   DW_AT_call_origin : <0x7941b>
    <7993e>   DW_AT_sibling     : <0x7994a>
 <3><79942>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <79943>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <79945>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><79949>: Abbrev Number: 0
 <2><7994a>: Abbrev Number: 15 (DW_TAG_call_site)
    <7994b>   DW_AT_call_return_pc: 0x459d8d
    <79953>   DW_AT_call_origin : <0x793f2>
 <2><79957>: Abbrev Number: 0
 <1><79958>: Abbrev Number: 61 (DW_TAG_subprogram)
    <79959>   DW_AT_external    : 1
    <79959>   DW_AT_declaration : 1
    <79959>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <7995d>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><79961>: Abbrev Number: 0
  Compilation Unit @ offset 0x79962:
   Length:        0x1696 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x15b2
   Pointer Size:  8
 <0><7996e>: Abbrev Number: 57 (DW_TAG_compile_unit)
    <7996f>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <79973>   DW_AT_language    : 29	(C11)
    <79974>   DW_AT_name        : (indirect line string, offset: 0x2d9): src/gfxlib2/gfx_core.c
    <79978>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <7997c>   DW_AT_low_pc      : 0x45a3b0
    <79984>   DW_AT_high_pc     : 0xfbb
    <7998c>   DW_AT_stmt_list   : 0x51ec4
 <1><79990>: Abbrev Number: 9 (DW_TAG_base_type)
    <79991>   DW_AT_byte_size   : 4
    <79992>   DW_AT_encoding    : 4	(float)
    <79993>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><79997>: Abbrev Number: 9 (DW_TAG_base_type)
    <79998>   DW_AT_byte_size   : 1
    <79999>   DW_AT_encoding    : 8	(unsigned char)
    <7999a>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><7999e>: Abbrev Number: 19 (DW_TAG_const_type)
    <7999f>   DW_AT_type        : <0x79997>
 <1><799a3>: Abbrev Number: 9 (DW_TAG_base_type)
    <799a4>   DW_AT_byte_size   : 2
    <799a5>   DW_AT_encoding    : 7	(unsigned)
    <799a6>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><799aa>: Abbrev Number: 9 (DW_TAG_base_type)
    <799ab>   DW_AT_byte_size   : 4
    <799ac>   DW_AT_encoding    : 7	(unsigned)
    <799ad>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><799b1>: Abbrev Number: 9 (DW_TAG_base_type)
    <799b2>   DW_AT_byte_size   : 8
    <799b3>   DW_AT_encoding    : 7	(unsigned)
    <799b4>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><799b8>: Abbrev Number: 9 (DW_TAG_base_type)
    <799b9>   DW_AT_byte_size   : 1
    <799ba>   DW_AT_encoding    : 6	(signed char)
    <799bb>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><799bf>: Abbrev Number: 9 (DW_TAG_base_type)
    <799c0>   DW_AT_byte_size   : 2
    <799c1>   DW_AT_encoding    : 5	(signed)
    <799c2>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><799c6>: Abbrev Number: 58 (DW_TAG_base_type)
    <799c7>   DW_AT_byte_size   : 4
    <799c8>   DW_AT_encoding    : 5	(signed)
    <799c9>   DW_AT_name        : int
 <1><799cd>: Abbrev Number: 59 (DW_TAG_volatile_type)
    <799ce>   DW_AT_type        : <0x799c6>
 <1><799d2>: Abbrev Number: 19 (DW_TAG_const_type)
    <799d3>   DW_AT_type        : <0x799c6>
 <1><799d7>: Abbrev Number: 9 (DW_TAG_base_type)
    <799d8>   DW_AT_byte_size   : 8
    <799d9>   DW_AT_encoding    : 5	(signed)
    <799da>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><799de>: Abbrev Number: 60 (DW_TAG_pointer_type)
    <799df>   DW_AT_byte_size   : 8
 <1><799e0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <799e1>   DW_AT_byte_size   : 8
    <799e1>   DW_AT_type        : <0x799e5>
 <1><799e5>: Abbrev Number: 9 (DW_TAG_base_type)
    <799e6>   DW_AT_byte_size   : 1
    <799e7>   DW_AT_encoding    : 6	(signed char)
    <799e8>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><799ec>: Abbrev Number: 12 (DW_TAG_typedef)
    <799ed>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <799f1>   DW_AT_decl_file   : 2
    <799f2>   DW_AT_decl_line   : 209
    <799f3>   DW_AT_decl_column : 23
    <799f4>   DW_AT_type        : <0x799b1>
 <1><799f8>: Abbrev Number: 44 (DW_TAG_typedef)
    <799f9>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <799fd>   DW_AT_decl_file   : 2
    <799fe>   DW_AT_decl_line   : 321
    <79a00>   DW_AT_decl_column : 24
    <79a01>   DW_AT_type        : <0x799c6>
 <1><79a05>: Abbrev Number: 9 (DW_TAG_base_type)
    <79a06>   DW_AT_byte_size   : 8
    <79a07>   DW_AT_encoding    : 5	(signed)
    <79a08>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><79a0c>: Abbrev Number: 9 (DW_TAG_base_type)
    <79a0d>   DW_AT_byte_size   : 8
    <79a0e>   DW_AT_encoding    : 7	(unsigned)
    <79a0f>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><79a13>: Abbrev Number: 28 (DW_TAG_array_type)
    <79a14>   DW_AT_type        : <0x799e5>
    <79a18>   DW_AT_sibling     : <0x79a23>
 <2><79a1c>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <79a1d>   DW_AT_type        : <0x799b1>
    <79a21>   DW_AT_upper_bound : 7
 <2><79a22>: Abbrev Number: 0
 <1><79a23>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79a24>   DW_AT_byte_size   : 8
    <79a24>   DW_AT_type        : <0x79a28>
 <1><79a28>: Abbrev Number: 61 (DW_TAG_const_type)
 <1><79a29>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79a2a>   DW_AT_byte_size   : 8
    <79a2a>   DW_AT_type        : <0x79a2e>
 <1><79a2e>: Abbrev Number: 62 (DW_TAG_subroutine_type)
    <79a2f>   DW_AT_prototyped  : 1
 <1><79a2f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79a30>   DW_AT_byte_size   : 8
    <79a30>   DW_AT_type        : <0x79a34>
 <1><79a34>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <79a35>   DW_AT_prototyped  : 1
    <79a35>   DW_AT_sibling     : <0x79a3f>
 <2><79a39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79a3a>   DW_AT_type        : <0x799de>
 <2><79a3e>: Abbrev Number: 0
 <1><79a3f>: Abbrev Number: 9 (DW_TAG_base_type)
    <79a40>   DW_AT_byte_size   : 8
    <79a41>   DW_AT_encoding    : 4	(float)
    <79a42>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><79a46>: Abbrev Number: 12 (DW_TAG_typedef)
    <79a47>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <79a4b>   DW_AT_decl_file   : 3
    <79a4c>   DW_AT_decl_line   : 7
    <79a4d>   DW_AT_decl_column : 25
    <79a4e>   DW_AT_type        : <0x79a52>
 <1><79a52>: Abbrev Number: 63 (DW_TAG_structure_type)
    <79a53>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <79a57>   DW_AT_declaration : 1
 <1><79a57>: Abbrev Number: 64 (DW_TAG_enumeration_type)
    <79a58>   DW_AT_encoding    : 7	(unsigned)
    <79a59>   DW_AT_byte_size   : 4
    <79a5a>   DW_AT_type        : <0x799aa>
    <79a5e>   DW_AT_decl_file   : 3
    <79a5f>   DW_AT_decl_line   : 34
    <79a60>   DW_AT_decl_column : 6
    <79a61>   DW_AT_sibling     : <0x79a90>
 <2><79a65>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a66>   DW_AT_name        : (indirect string, offset: 0x17ac3): FB_TLSKEY_ERROR
    <79a6a>   DW_AT_const_value : 0
 <2><79a6b>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a6c>   DW_AT_name        : (indirect string, offset: 0x17a8d): FB_TLSKEY_DIR
    <79a70>   DW_AT_const_value : 1
 <2><79a71>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a72>   DW_AT_name        : (indirect string, offset: 0x17a3a): FB_TLSKEY_INPUT
    <79a76>   DW_AT_const_value : 2
 <2><79a77>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a78>   DW_AT_name        : (indirect string, offset: 0x17a0c): FB_TLSKEY_PRINTUSG
    <79a7c>   DW_AT_const_value : 3
 <2><79a7d>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a7e>   DW_AT_name        : (indirect string, offset: 0x17ae5): FB_TLSKEY_GFX
    <79a82>   DW_AT_const_value : 4
 <2><79a83>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a84>   DW_AT_name        : (indirect string, offset: 0x1793c): FB_TLSKEY_FBTHREAD
    <79a88>   DW_AT_const_value : 5
 <2><79a89>: Abbrev Number: 7 (DW_TAG_enumerator)
    <79a8a>   DW_AT_name        : (indirect string, offset: 0x179b5): FB_TLSKEYS
    <79a8e>   DW_AT_const_value : 6
 <2><79a8f>: Abbrev Number: 0
 <1><79a90>: Abbrev Number: 12 (DW_TAG_typedef)
    <79a91>   DW_AT_name        : (indirect string, offset: 0x17b69): FB_TLS_DESTRUCTOR
    <79a95>   DW_AT_decl_file   : 3
    <79a96>   DW_AT_decl_line   : 44
    <79a97>   DW_AT_decl_column : 17
    <79a98>   DW_AT_type        : <0x79a2f>
 <1><79a9c>: Abbrev Number: 29 (DW_TAG_structure_type)
    <79a9d>   DW_AT_byte_size   : 8
    <79a9e>   DW_AT_decl_file   : 4
    <79a9f>   DW_AT_decl_line   : 4
    <79aa0>   DW_AT_decl_column : 3
    <79aa0>   DW_AT_sibling     : <0x79abf>
 <2><79aa4>: Abbrev Number: 2 (DW_TAG_member)
    <79aa5>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <79aa9>   DW_AT_decl_file   : 4
    <79aaa>   DW_AT_decl_line   : 5
    <79aab>   DW_AT_decl_column : 8
    <79aac>   DW_AT_type        : <0x799c6>
    <79ab0>   DW_AT_data_member_location: 0
 <2><79ab1>: Abbrev Number: 2 (DW_TAG_member)
    <79ab2>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <79ab6>   DW_AT_decl_file   : 4
    <79ab7>   DW_AT_decl_line   : 6
    <79ab8>   DW_AT_decl_column : 8
    <79ab9>   DW_AT_type        : <0x799c6>
    <79abd>   DW_AT_data_member_location: 4
 <2><79abe>: Abbrev Number: 0
 <1><79abf>: Abbrev Number: 29 (DW_TAG_structure_type)
    <79ac0>   DW_AT_byte_size   : 16
    <79ac1>   DW_AT_decl_file   : 4
    <79ac2>   DW_AT_decl_line   : 8
    <79ac3>   DW_AT_decl_column : 3
    <79ac3>   DW_AT_sibling     : <0x79af6>
 <2><79ac7>: Abbrev Number: 8 (DW_TAG_member)
    <79ac8>   DW_AT_name        : x
    <79aca>   DW_AT_decl_file   : 4
    <79acb>   DW_AT_decl_line   : 9
    <79acc>   DW_AT_decl_column : 8
    <79acd>   DW_AT_type        : <0x799c6>
    <79ad1>   DW_AT_data_member_location: 0
 <2><79ad2>: Abbrev Number: 8 (DW_TAG_member)
    <79ad3>   DW_AT_name        : y
    <79ad5>   DW_AT_decl_file   : 4
    <79ad6>   DW_AT_decl_line   : 9
    <79ad7>   DW_AT_decl_column : 11
    <79ad8>   DW_AT_type        : <0x799c6>
    <79adc>   DW_AT_data_member_location: 4
 <2><79add>: Abbrev Number: 8 (DW_TAG_member)
    <79ade>   DW_AT_name        : dx
    <79ae1>   DW_AT_decl_file   : 4
    <79ae2>   DW_AT_decl_line   : 10
    <79ae3>   DW_AT_decl_column : 8
    <79ae4>   DW_AT_type        : <0x799c6>
    <79ae8>   DW_AT_data_member_location: 8
 <2><79ae9>: Abbrev Number: 8 (DW_TAG_member)
    <79aea>   DW_AT_name        : dy
    <79aed>   DW_AT_decl_file   : 4
    <79aee>   DW_AT_decl_line   : 10
    <79aef>   DW_AT_decl_column : 12
    <79af0>   DW_AT_type        : <0x799c6>
    <79af4>   DW_AT_data_member_location: 12
 <2><79af5>: Abbrev Number: 0
 <1><79af6>: Abbrev Number: 37 (DW_TAG_union_type)
    <79af7>   DW_AT_byte_size   : 16
    <79af7>   DW_AT_decl_file   : 4
    <79af8>   DW_AT_decl_line   : 3
    <79af9>   DW_AT_decl_column : 2
    <79af9>   DW_AT_sibling     : <0x79b23>
 <2><79afd>: Abbrev Number: 30 (DW_TAG_member)
    <79afe>   DW_AT_type        : <0x79a9c>
 <2><79b02>: Abbrev Number: 30 (DW_TAG_member)
    <79b03>   DW_AT_type        : <0x79abf>
 <2><79b07>: Abbrev Number: 38 (DW_TAG_member)
    <79b08>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <79b0c>   DW_AT_decl_file   : 4
    <79b0d>   DW_AT_decl_line   : 12
    <79b0e>   DW_AT_decl_column : 7
    <79b0e>   DW_AT_type        : <0x799c6>
 <2><79b12>: Abbrev Number: 45 (DW_TAG_member)
    <79b13>   DW_AT_name        : z
    <79b15>   DW_AT_decl_file   : 4
    <79b15>   DW_AT_decl_line   : 13
    <79b16>   DW_AT_decl_column : 7
    <79b16>   DW_AT_type        : <0x799c6>
 <2><79b1a>: Abbrev Number: 45 (DW_TAG_member)
    <79b1b>   DW_AT_name        : w
    <79b1d>   DW_AT_decl_file   : 4
    <79b1d>   DW_AT_decl_line   : 14
    <79b1e>   DW_AT_decl_column : 7
    <79b1e>   DW_AT_type        : <0x799c6>
 <2><79b22>: Abbrev Number: 0
 <1><79b23>: Abbrev Number: 20 (DW_TAG_structure_type)
    <79b24>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <79b28>   DW_AT_byte_size   : 20
    <79b29>   DW_AT_decl_file   : 4
    <79b2a>   DW_AT_decl_line   : 1
    <79b2b>   DW_AT_decl_column : 8
    <79b2c>   DW_AT_sibling     : <0x79b44>
 <2><79b30>: Abbrev Number: 2 (DW_TAG_member)
    <79b31>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <79b35>   DW_AT_decl_file   : 4
    <79b36>   DW_AT_decl_line   : 2
    <79b37>   DW_AT_decl_column : 6
    <79b38>   DW_AT_type        : <0x799c6>
    <79b3c>   DW_AT_data_member_location: 0
 <2><79b3d>: Abbrev Number: 31 (DW_TAG_member)
    <79b3e>   DW_AT_type        : <0x79af6>
    <79b42>   DW_AT_data_member_location: 4
 <2><79b43>: Abbrev Number: 0
 <1><79b44>: Abbrev Number: 12 (DW_TAG_typedef)
    <79b45>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <79b49>   DW_AT_decl_file   : 4
    <79b4a>   DW_AT_decl_line   : 18
    <79b4b>   DW_AT_decl_column : 23
    <79b4c>   DW_AT_type        : <0x79b23>
 <1><79b50>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79b51>   DW_AT_byte_size   : 8
    <79b51>   DW_AT_type        : <0x79b55>
 <1><79b55>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <79b56>   DW_AT_prototyped  : 1
    <79b56>   DW_AT_type        : <0x799c6>
    <79b5a>   DW_AT_sibling     : <0x79b69>
 <2><79b5e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b5f>   DW_AT_type        : <0x799c6>
 <2><79b63>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b64>   DW_AT_type        : <0x799c6>
 <2><79b68>: Abbrev Number: 0
 <1><79b69>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79b6a>   DW_AT_byte_size   : 8
    <79b6a>   DW_AT_type        : <0x799c6>
 <1><79b6e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79b6f>   DW_AT_byte_size   : 8
    <79b6f>   DW_AT_type        : <0x79b73>
 <1><79b73>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <79b74>   DW_AT_prototyped  : 1
    <79b74>   DW_AT_type        : <0x799c6>
    <79b78>   DW_AT_sibling     : <0x79b96>
 <2><79b7c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b7d>   DW_AT_type        : <0x79b69>
 <2><79b81>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b82>   DW_AT_type        : <0x79b69>
 <2><79b86>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b87>   DW_AT_type        : <0x79b69>
 <2><79b8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b8c>   DW_AT_type        : <0x79b69>
 <2><79b90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79b91>   DW_AT_type        : <0x79b69>
 <2><79b95>: Abbrev Number: 0
 <1><79b96>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79b97>   DW_AT_byte_size   : 8
    <79b97>   DW_AT_type        : <0x79b44>
 <1><79b9b>: Abbrev Number: 12 (DW_TAG_typedef)
    <79b9c>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <79ba0>   DW_AT_decl_file   : 5
    <79ba1>   DW_AT_decl_line   : 13
    <79ba2>   DW_AT_decl_column : 30
    <79ba3>   DW_AT_type        : <0x79ba7>
 <1><79ba7>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <79ba8>   DW_AT_prototyped  : 1
    <79ba8>   DW_AT_type        : <0x799aa>
    <79bac>   DW_AT_sibling     : <0x79bc0>
 <2><79bb0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bb1>   DW_AT_type        : <0x799aa>
 <2><79bb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bb6>   DW_AT_type        : <0x799aa>
 <2><79bba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bbb>   DW_AT_type        : <0x799de>
 <2><79bbf>: Abbrev Number: 0
 <1><79bc0>: Abbrev Number: 12 (DW_TAG_typedef)
    <79bc1>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <79bc5>   DW_AT_decl_file   : 5
    <79bc6>   DW_AT_decl_line   : 14
    <79bc7>   DW_AT_decl_column : 15
    <79bc8>   DW_AT_type        : <0x79bcc>
 <1><79bcc>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <79bcd>   DW_AT_prototyped  : 1
    <79bcd>   DW_AT_sibling     : <0x79bff>
 <2><79bd1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bd2>   DW_AT_type        : <0x79bff>
 <2><79bd6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bd7>   DW_AT_type        : <0x79bff>
 <2><79bdb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bdc>   DW_AT_type        : <0x799c6>
 <2><79be0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79be1>   DW_AT_type        : <0x799c6>
 <2><79be5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79be6>   DW_AT_type        : <0x799c6>
 <2><79bea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79beb>   DW_AT_type        : <0x799c6>
 <2><79bef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bf0>   DW_AT_type        : <0x799c6>
 <2><79bf4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bf5>   DW_AT_type        : <0x79c04>
 <2><79bf9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79bfa>   DW_AT_type        : <0x799de>
 <2><79bfe>: Abbrev Number: 0
 <1><79bff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79c00>   DW_AT_byte_size   : 8
    <79c00>   DW_AT_type        : <0x79997>
 <1><79c04>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79c05>   DW_AT_byte_size   : 8
    <79c05>   DW_AT_type        : <0x79b9b>
 <1><79c09>: Abbrev Number: 29 (DW_TAG_structure_type)
    <79c0a>   DW_AT_byte_size   : 16
    <79c0b>   DW_AT_decl_file   : 5
    <79c0c>   DW_AT_decl_line   : 26
    <79c0d>   DW_AT_decl_column : 3
    <79c0d>   DW_AT_sibling     : <0x79c46>
 <2><79c11>: Abbrev Number: 2 (DW_TAG_member)
    <79c12>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <79c16>   DW_AT_decl_file   : 5
    <79c17>   DW_AT_decl_line   : 27
    <79c18>   DW_AT_decl_column : 8
    <79c19>   DW_AT_type        : <0x799c6>
    <79c1d>   DW_AT_data_member_location: 0
 <2><79c1e>: Abbrev Number: 2 (DW_TAG_member)
    <79c1f>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <79c23>   DW_AT_decl_file   : 5
    <79c24>   DW_AT_decl_line   : 27
    <79c25>   DW_AT_decl_column : 16
    <79c26>   DW_AT_type        : <0x799c6>
    <79c2a>   DW_AT_data_member_location: 4
 <2><79c2b>: Abbrev Number: 2 (DW_TAG_member)
    <79c2c>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <79c30>   DW_AT_decl_file   : 5
    <79c31>   DW_AT_decl_line   : 27
    <79c32>   DW_AT_decl_column : 24
    <79c33>   DW_AT_type        : <0x799c6>
    <79c37>   DW_AT_data_member_location: 8
 <2><79c38>: Abbrev Number: 2 (DW_TAG_member)
    <79c39>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <79c3d>   DW_AT_decl_file   : 5
    <79c3e>   DW_AT_decl_line   : 27
    <79c3f>   DW_AT_decl_column : 32
    <79c40>   DW_AT_type        : <0x799c6>
    <79c44>   DW_AT_data_member_location: 12
 <2><79c45>: Abbrev Number: 0
 <1><79c46>: Abbrev Number: 37 (DW_TAG_union_type)
    <79c47>   DW_AT_byte_size   : 16
    <79c47>   DW_AT_decl_file   : 5
    <79c48>   DW_AT_decl_line   : 25
    <79c49>   DW_AT_decl_column : 2
    <79c49>   DW_AT_sibling     : <0x79c5e>
 <2><79c4d>: Abbrev Number: 30 (DW_TAG_member)
    <79c4e>   DW_AT_type        : <0x79c09>
 <2><79c52>: Abbrev Number: 38 (DW_TAG_member)
    <79c53>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <79c57>   DW_AT_decl_file   : 5
    <79c58>   DW_AT_decl_line   : 29
    <79c59>   DW_AT_decl_column : 7
    <79c59>   DW_AT_type        : <0x79c5e>
 <2><79c5d>: Abbrev Number: 0
 <1><79c5e>: Abbrev Number: 28 (DW_TAG_array_type)
    <79c5f>   DW_AT_type        : <0x799c6>
    <79c63>   DW_AT_sibling     : <0x79c6e>
 <2><79c67>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <79c68>   DW_AT_type        : <0x799b1>
    <79c6c>   DW_AT_upper_bound : 3
 <2><79c6d>: Abbrev Number: 0
 <1><79c6e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <79c6f>   DW_AT_byte_size   : 16
    <79c70>   DW_AT_decl_file   : 5
    <79c71>   DW_AT_decl_line   : 32
    <79c72>   DW_AT_decl_column : 3
    <79c72>   DW_AT_sibling     : <0x79cab>
 <2><79c76>: Abbrev Number: 2 (DW_TAG_member)
    <79c77>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <79c7b>   DW_AT_decl_file   : 5
    <79c7c>   DW_AT_decl_line   : 33
    <79c7d>   DW_AT_decl_column : 8
    <79c7e>   DW_AT_type        : <0x799c6>
    <79c82>   DW_AT_data_member_location: 0
 <2><79c83>: Abbrev Number: 2 (DW_TAG_member)
    <79c84>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <79c88>   DW_AT_decl_file   : 5
    <79c89>   DW_AT_decl_line   : 33
    <79c8a>   DW_AT_decl_column : 20
    <79c8b>   DW_AT_type        : <0x799c6>
    <79c8f>   DW_AT_data_member_location: 4
 <2><79c90>: Abbrev Number: 2 (DW_TAG_member)
    <79c91>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <79c95>   DW_AT_decl_file   : 5
    <79c96>   DW_AT_decl_line   : 33
    <79c97>   DW_AT_decl_column : 32
    <79c98>   DW_AT_type        : <0x799c6>
    <79c9c>   DW_AT_data_member_location: 8
 <2><79c9d>: Abbrev Number: 2 (DW_TAG_member)
    <79c9e>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <79ca2>   DW_AT_decl_file   : 5
    <79ca3>   DW_AT_decl_line   : 33
    <79ca4>   DW_AT_decl_column : 44
    <79ca5>   DW_AT_type        : <0x799c6>
    <79ca9>   DW_AT_data_member_location: 12
 <2><79caa>: Abbrev Number: 0
 <1><79cab>: Abbrev Number: 37 (DW_TAG_union_type)
    <79cac>   DW_AT_byte_size   : 16
    <79cac>   DW_AT_decl_file   : 5
    <79cad>   DW_AT_decl_line   : 31
    <79cae>   DW_AT_decl_column : 2
    <79cae>   DW_AT_sibling     : <0x79cc3>
 <2><79cb2>: Abbrev Number: 30 (DW_TAG_member)
    <79cb3>   DW_AT_type        : <0x79c6e>
 <2><79cb7>: Abbrev Number: 38 (DW_TAG_member)
    <79cb8>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <79cbc>   DW_AT_decl_file   : 5
    <79cbd>   DW_AT_decl_line   : 35
    <79cbe>   DW_AT_decl_column : 7
    <79cbe>   DW_AT_type        : <0x79c5e>
 <2><79cc2>: Abbrev Number: 0
 <1><79cc3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <79cc4>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <79cc8>   DW_AT_byte_size   : 216
    <79cc9>   DW_AT_decl_file   : 5
    <79cca>   DW_AT_decl_line   : 16
    <79ccb>   DW_AT_decl_column : 16
    <79ccc>   DW_AT_sibling     : <0x79de0>
 <2><79cd0>: Abbrev Number: 8 (DW_TAG_member)
    <79cd1>   DW_AT_name        : id
    <79cd4>   DW_AT_decl_file   : 5
    <79cd5>   DW_AT_decl_line   : 17
    <79cd6>   DW_AT_decl_column : 6
    <79cd7>   DW_AT_type        : <0x799c6>
    <79cdb>   DW_AT_data_member_location: 0
 <2><79cdc>: Abbrev Number: 2 (DW_TAG_member)
    <79cdd>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <79ce1>   DW_AT_decl_file   : 5
    <79ce2>   DW_AT_decl_line   : 18
    <79ce3>   DW_AT_decl_column : 6
    <79ce4>   DW_AT_type        : <0x799c6>
    <79ce8>   DW_AT_data_member_location: 4
 <2><79ce9>: Abbrev Number: 2 (DW_TAG_member)
    <79cea>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <79cee>   DW_AT_decl_file   : 5
    <79cef>   DW_AT_decl_line   : 19
    <79cf0>   DW_AT_decl_column : 18
    <79cf1>   DW_AT_type        : <0x79de0>
    <79cf5>   DW_AT_data_member_location: 8
 <2><79cf6>: Abbrev Number: 2 (DW_TAG_member)
    <79cf7>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <79cfb>   DW_AT_decl_file   : 5
    <79cfc>   DW_AT_decl_line   : 20
    <79cfd>   DW_AT_decl_column : 6
    <79cfe>   DW_AT_type        : <0x799c6>
    <79d02>   DW_AT_data_member_location: 16
 <2><79d03>: Abbrev Number: 2 (DW_TAG_member)
    <79d04>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <79d08>   DW_AT_decl_file   : 5
    <79d09>   DW_AT_decl_line   : 21
    <79d0a>   DW_AT_decl_column : 6
    <79d0b>   DW_AT_type        : <0x799c6>
    <79d0f>   DW_AT_data_member_location: 20
 <2><79d10>: Abbrev Number: 2 (DW_TAG_member)
    <79d11>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <79d15>   DW_AT_decl_file   : 5
    <79d16>   DW_AT_decl_line   : 22
    <79d17>   DW_AT_decl_column : 6
    <79d18>   DW_AT_type        : <0x799c6>
    <79d1c>   DW_AT_data_member_location: 24
 <2><79d1d>: Abbrev Number: 2 (DW_TAG_member)
    <79d1e>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <79d22>   DW_AT_decl_file   : 5
    <79d23>   DW_AT_decl_line   : 23
    <79d24>   DW_AT_decl_column : 8
    <79d25>   DW_AT_type        : <0x799de>
    <79d29>   DW_AT_data_member_location: 32
 <2><79d2a>: Abbrev Number: 2 (DW_TAG_member)
    <79d2b>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <79d2f>   DW_AT_decl_file   : 5
    <79d30>   DW_AT_decl_line   : 24
    <79d31>   DW_AT_decl_column : 8
    <79d32>   DW_AT_type        : <0x79990>
    <79d36>   DW_AT_data_member_location: 40
 <2><79d37>: Abbrev Number: 2 (DW_TAG_member)
    <79d38>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <79d3c>   DW_AT_decl_file   : 5
    <79d3d>   DW_AT_decl_line   : 24
    <79d3e>   DW_AT_decl_column : 16
    <79d3f>   DW_AT_type        : <0x79990>
    <79d43>   DW_AT_data_member_location: 44
 <2><79d44>: Abbrev Number: 31 (DW_TAG_member)
    <79d45>   DW_AT_type        : <0x79c46>
    <79d49>   DW_AT_data_member_location: 48
 <2><79d4a>: Abbrev Number: 31 (DW_TAG_member)
    <79d4b>   DW_AT_type        : <0x79cab>
    <79d4f>   DW_AT_data_member_location: 64
 <2><79d50>: Abbrev Number: 2 (DW_TAG_member)
    <79d51>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <79d55>   DW_AT_decl_file   : 5
    <79d56>   DW_AT_decl_line   : 37
    <79d57>   DW_AT_decl_column : 8
    <79d58>   DW_AT_type        : <0x79990>
    <79d5c>   DW_AT_data_member_location: 80
 <2><79d5d>: Abbrev Number: 2 (DW_TAG_member)
    <79d5e>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <79d62>   DW_AT_decl_file   : 5
    <79d63>   DW_AT_decl_line   : 37
    <79d64>   DW_AT_decl_column : 15
    <79d65>   DW_AT_type        : <0x79990>
    <79d69>   DW_AT_data_member_location: 84
 <2><79d6a>: Abbrev Number: 2 (DW_TAG_member)
    <79d6b>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <79d6f>   DW_AT_decl_file   : 5
    <79d70>   DW_AT_decl_line   : 37
    <79d71>   DW_AT_decl_column : 22
    <79d72>   DW_AT_type        : <0x79990>
    <79d76>   DW_AT_data_member_location: 88
 <2><79d77>: Abbrev Number: 2 (DW_TAG_member)
    <79d78>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <79d7c>   DW_AT_decl_file   : 5
    <79d7d>   DW_AT_decl_line   : 37
    <79d7e>   DW_AT_decl_column : 29
    <79d7f>   DW_AT_type        : <0x79990>
    <79d83>   DW_AT_data_member_location: 92
 <2><79d84>: Abbrev Number: 2 (DW_TAG_member)
    <79d85>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <79d89>   DW_AT_decl_file   : 5
    <79d8a>   DW_AT_decl_line   : 38
    <79d8b>   DW_AT_decl_column : 15
    <79d8c>   DW_AT_type        : <0x799aa>
    <79d90>   DW_AT_data_member_location: 96
 <2><79d91>: Abbrev Number: 2 (DW_TAG_member)
    <79d92>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <79d96>   DW_AT_decl_file   : 5
    <79d97>   DW_AT_decl_line   : 38
    <79d98>   DW_AT_decl_column : 25
    <79d99>   DW_AT_type        : <0x799aa>
    <79d9d>   DW_AT_data_member_location: 100
 <2><79d9e>: Abbrev Number: 2 (DW_TAG_member)
    <79d9f>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <79da3>   DW_AT_decl_file   : 5
    <79da4>   DW_AT_decl_line   : 39
    <79da5>   DW_AT_decl_column : 9
    <79da6>   DW_AT_type        : <0x79e04>
    <79daa>   DW_AT_data_member_location: 104
 <2><79dab>: Abbrev Number: 2 (DW_TAG_member)
    <79dac>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <79db0>   DW_AT_decl_file   : 5
    <79db1>   DW_AT_decl_line   : 40
    <79db2>   DW_AT_decl_column : 17
    <79db3>   DW_AT_type        : <0x79e22>
    <79db7>   DW_AT_data_member_location: 112
 <2><79db8>: Abbrev Number: 2 (DW_TAG_member)
    <79db9>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <79dbd>   DW_AT_decl_file   : 5
    <79dbe>   DW_AT_decl_line   : 41
    <79dbf>   DW_AT_decl_column : 10
    <79dc0>   DW_AT_type        : <0x79e40>
    <79dc4>   DW_AT_data_member_location: 120
 <2><79dc5>: Abbrev Number: 2 (DW_TAG_member)
    <79dc6>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <79dca>   DW_AT_decl_file   : 5
    <79dcb>   DW_AT_decl_line   : 42
    <79dcc>   DW_AT_decl_column : 11
    <79dcd>   DW_AT_type        : <0x79e45>
    <79dd1>   DW_AT_data_member_location: 128
 <2><79dd2>: Abbrev Number: 2 (DW_TAG_member)
    <79dd3>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <79dd7>   DW_AT_decl_file   : 5
    <79dd8>   DW_AT_decl_line   : 43
    <79dd9>   DW_AT_decl_column : 6
    <79dda>   DW_AT_type        : <0x799c6>
    <79dde>   DW_AT_data_member_location: 208
 <2><79ddf>: Abbrev Number: 0
 <1><79de0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79de1>   DW_AT_byte_size   : 8
    <79de1>   DW_AT_type        : <0x79bff>
 <1><79de5>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <79de6>   DW_AT_prototyped  : 1
    <79de6>   DW_AT_sibling     : <0x79dff>
 <2><79dea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79deb>   DW_AT_type        : <0x79dff>
 <2><79def>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79df0>   DW_AT_type        : <0x799c6>
 <2><79df4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79df5>   DW_AT_type        : <0x799c6>
 <2><79df9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79dfa>   DW_AT_type        : <0x799aa>
 <2><79dfe>: Abbrev Number: 0
 <1><79dff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e00>   DW_AT_byte_size   : 8
    <79e00>   DW_AT_type        : <0x79cc3>
 <1><79e04>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e05>   DW_AT_byte_size   : 8
    <79e05>   DW_AT_type        : <0x79de5>
 <1><79e09>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <79e0a>   DW_AT_prototyped  : 1
    <79e0a>   DW_AT_type        : <0x799aa>
    <79e0e>   DW_AT_sibling     : <0x79e22>
 <2><79e12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e13>   DW_AT_type        : <0x79dff>
 <2><79e17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e18>   DW_AT_type        : <0x799c6>
 <2><79e1c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e1d>   DW_AT_type        : <0x799c6>
 <2><79e21>: Abbrev Number: 0
 <1><79e22>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e23>   DW_AT_byte_size   : 8
    <79e23>   DW_AT_type        : <0x79e09>
 <1><79e27>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <79e28>   DW_AT_prototyped  : 1
    <79e28>   DW_AT_type        : <0x799de>
    <79e2c>   DW_AT_sibling     : <0x79e40>
 <2><79e30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e31>   DW_AT_type        : <0x799de>
 <2><79e35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e36>   DW_AT_type        : <0x799c6>
 <2><79e3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e3b>   DW_AT_type        : <0x799ec>
 <2><79e3f>: Abbrev Number: 0
 <1><79e40>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e41>   DW_AT_byte_size   : 8
    <79e41>   DW_AT_type        : <0x79e27>
 <1><79e45>: Abbrev Number: 28 (DW_TAG_array_type)
    <79e46>   DW_AT_type        : <0x79e55>
    <79e4a>   DW_AT_sibling     : <0x79e55>
 <2><79e4e>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <79e4f>   DW_AT_type        : <0x799b1>
    <79e53>   DW_AT_upper_bound : 9
 <2><79e54>: Abbrev Number: 0
 <1><79e55>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e56>   DW_AT_byte_size   : 8
    <79e56>   DW_AT_type        : <0x79e5a>
 <1><79e5a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <79e5b>   DW_AT_byte_size   : 8
    <79e5b>   DW_AT_type        : <0x79bc0>
 <1><79e5f>: Abbrev Number: 12 (DW_TAG_typedef)
    <79e60>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <79e64>   DW_AT_decl_file   : 5
    <79e65>   DW_AT_decl_line   : 44
    <79e66>   DW_AT_decl_column : 3
    <79e67>   DW_AT_type        : <0x79cc3>
 <1><79e6b>: Abbrev Number: 20 (DW_TAG_structure_type)
    <79e6c>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <79e70>   DW_AT_byte_size   : 12
    <79e71>   DW_AT_decl_file   : 6
    <79e72>   DW_AT_decl_line   : 139
    <79e73>   DW_AT_decl_column : 16
    <79e74>   DW_AT_sibling     : <0x79e9d>
 <2><79e78>: Abbrev Number: 8 (DW_TAG_member)
    <79e79>   DW_AT_name        : ch
    <79e7c>   DW_AT_decl_file   : 6
    <79e7d>   DW_AT_decl_line   : 140
    <79e7e>   DW_AT_decl_column : 14
    <79e7f>   DW_AT_type        : <0x799f8>
    <79e83>   DW_AT_data_member_location: 0
 <2><79e84>: Abbrev Number: 8 (DW_TAG_member)
    <79e85>   DW_AT_name        : fg
    <79e88>   DW_AT_decl_file   : 6
    <79e89>   DW_AT_decl_line   : 141
    <79e8a>   DW_AT_decl_column : 14
    <79e8b>   DW_AT_type        : <0x799aa>
    <79e8f>   DW_AT_data_member_location: 4
 <2><79e90>: Abbrev Number: 8 (DW_TAG_member)
    <79e91>   DW_AT_name        : bg
    <79e94>   DW_AT_decl_file   : 6
    <79e95>   DW_AT_decl_line   : 141
    <79e96>   DW_AT_decl_column : 18
    <79e97>   DW_AT_type        : <0x799aa>
    <79e9b>   DW_AT_data_member_location: 8
 <2><79e9c>: Abbrev Number: 0
 <1><79e9d>: Abbrev Number: 12 (DW_TAG_typedef)
    <79e9e>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <79ea2>   DW_AT_decl_file   : 6
    <79ea3>   DW_AT_decl_line   : 142
    <79ea4>   DW_AT_decl_column : 3
    <79ea5>   DW_AT_type        : <0x79e6b>
 <1><79ea9>: Abbrev Number: 20 (DW_TAG_structure_type)
    <79eaa>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <79eae>   DW_AT_byte_size   : 208
    <79eaf>   DW_AT_decl_file   : 6
    <79eb0>   DW_AT_decl_line   : 144
    <79eb1>   DW_AT_decl_column : 16
    <79eb2>   DW_AT_sibling     : <0x7a06c>
 <2><79eb6>: Abbrev Number: 8 (DW_TAG_member)
    <79eb7>   DW_AT_name        : id
    <79eba>   DW_AT_decl_file   : 6
    <79ebb>   DW_AT_decl_line   : 146
    <79ebc>   DW_AT_decl_column : 6
    <79ebd>   DW_AT_type        : <0x799c6>
    <79ec1>   DW_AT_data_member_location: 0
 <2><79ec2>: Abbrev Number: 2 (DW_TAG_member)
    <79ec3>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <79ec7>   DW_AT_decl_file   : 6
    <79ec8>   DW_AT_decl_line   : 147
    <79ec9>   DW_AT_decl_column : 9
    <79eca>   DW_AT_type        : <0x799c6>
    <79ece>   DW_AT_data_member_location: 4
 <2><79ecf>: Abbrev Number: 2 (DW_TAG_member)
    <79ed0>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <79ed4>   DW_AT_decl_file   : 6
    <79ed5>   DW_AT_decl_line   : 148
    <79ed6>   DW_AT_decl_column : 21
    <79ed7>   DW_AT_type        : <0x79de0>
    <79edb>   DW_AT_data_member_location: 8
 <2><79edc>: Abbrev Number: 2 (DW_TAG_member)
    <79edd>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <79ee1>   DW_AT_decl_file   : 6
    <79ee2>   DW_AT_decl_line   : 149
    <79ee3>   DW_AT_decl_column : 9
    <79ee4>   DW_AT_type        : <0x799c6>
    <79ee8>   DW_AT_data_member_location: 16
 <2><79ee9>: Abbrev Number: 2 (DW_TAG_member)
    <79eea>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <79eee>   DW_AT_decl_file   : 6
    <79eef>   DW_AT_decl_line   : 150
    <79ef0>   DW_AT_decl_column : 9
    <79ef1>   DW_AT_type        : <0x799c6>
    <79ef5>   DW_AT_data_member_location: 20
 <2><79ef6>: Abbrev Number: 2 (DW_TAG_member)
    <79ef7>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <79efb>   DW_AT_decl_file   : 6
    <79efc>   DW_AT_decl_line   : 151
    <79efd>   DW_AT_decl_column : 20
    <79efe>   DW_AT_type        : <0x79bff>
    <79f02>   DW_AT_data_member_location: 24
 <2><79f03>: Abbrev Number: 8 (DW_TAG_member)
    <79f04>   DW_AT_name        : w
    <79f06>   DW_AT_decl_file   : 6
    <79f07>   DW_AT_decl_line   : 152
    <79f08>   DW_AT_decl_column : 9
    <79f09>   DW_AT_type        : <0x799c6>
    <79f0d>   DW_AT_data_member_location: 32
 <2><79f0e>: Abbrev Number: 8 (DW_TAG_member)
    <79f0f>   DW_AT_name        : h
    <79f11>   DW_AT_decl_file   : 6
    <79f12>   DW_AT_decl_line   : 152
    <79f13>   DW_AT_decl_column : 12
    <79f14>   DW_AT_type        : <0x799c6>
    <79f18>   DW_AT_data_member_location: 36
 <2><79f19>: Abbrev Number: 2 (DW_TAG_member)
    <79f1a>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <79f1e>   DW_AT_decl_file   : 6
    <79f1f>   DW_AT_decl_line   : 153
    <79f20>   DW_AT_decl_column : 9
    <79f21>   DW_AT_type        : <0x799c6>
    <79f25>   DW_AT_data_member_location: 40
 <2><79f26>: Abbrev Number: 8 (DW_TAG_member)
    <79f27>   DW_AT_name        : bpp
    <79f2b>   DW_AT_decl_file   : 6
    <79f2c>   DW_AT_decl_line   : 154
    <79f2d>   DW_AT_decl_column : 9
    <79f2e>   DW_AT_type        : <0x799c6>
    <79f32>   DW_AT_data_member_location: 44
 <2><79f33>: Abbrev Number: 2 (DW_TAG_member)
    <79f34>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <79f38>   DW_AT_decl_file   : 6
    <79f39>   DW_AT_decl_line   : 155
    <79f3a>   DW_AT_decl_column : 9
    <79f3b>   DW_AT_type        : <0x799c6>
    <79f3f>   DW_AT_data_member_location: 48
 <2><79f40>: Abbrev Number: 2 (DW_TAG_member)
    <79f41>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <79f45>   DW_AT_decl_file   : 6
    <79f46>   DW_AT_decl_line   : 156
    <79f47>   DW_AT_decl_column : 19
    <79f48>   DW_AT_type        : <0x7a06c>
    <79f4c>   DW_AT_data_member_location: 56
 <2><79f4d>: Abbrev Number: 2 (DW_TAG_member)
    <79f4e>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <79f52>   DW_AT_decl_file   : 6
    <79f53>   DW_AT_decl_line   : 157
    <79f54>   DW_AT_decl_column : 19
    <79f55>   DW_AT_type        : <0x7a06c>
    <79f59>   DW_AT_data_member_location: 64
 <2><79f5a>: Abbrev Number: 2 (DW_TAG_member)
    <79f5b>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <79f5f>   DW_AT_decl_file   : 6
    <79f60>   DW_AT_decl_line   : 158
    <79f61>   DW_AT_decl_column : 20
    <79f62>   DW_AT_type        : <0x79bff>
    <79f66>   DW_AT_data_member_location: 72
 <2><79f67>: Abbrev Number: 2 (DW_TAG_member)
    <79f68>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <79f6c>   DW_AT_decl_file   : 6
    <79f6d>   DW_AT_decl_line   : 159
    <79f6e>   DW_AT_decl_column : 11
    <79f6f>   DW_AT_type        : <0x799e0>
    <79f73>   DW_AT_data_member_location: 80
 <2><79f74>: Abbrev Number: 2 (DW_TAG_member)
    <79f75>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <79f79>   DW_AT_decl_file   : 6
    <79f7a>   DW_AT_decl_line   : 160
    <79f7b>   DW_AT_decl_column : 29
    <79f7c>   DW_AT_type        : <0x7a13a>
    <79f80>   DW_AT_data_member_location: 88
 <2><79f81>: Abbrev Number: 2 (DW_TAG_member)
    <79f82>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <79f86>   DW_AT_decl_file   : 6
    <79f87>   DW_AT_decl_line   : 161
    <79f88>   DW_AT_decl_column : 9
    <79f89>   DW_AT_type        : <0x799c6>
    <79f8d>   DW_AT_data_member_location: 96
 <2><79f8e>: Abbrev Number: 2 (DW_TAG_member)
    <79f8f>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <79f93>   DW_AT_decl_file   : 6
    <79f94>   DW_AT_decl_line   : 162
    <79f95>   DW_AT_decl_column : 27
    <79f96>   DW_AT_type        : <0x7a16c>
    <79f9a>   DW_AT_data_member_location: 104
 <2><79f9b>: Abbrev Number: 2 (DW_TAG_member)
    <79f9c>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <79fa0>   DW_AT_decl_file   : 6
    <79fa1>   DW_AT_decl_line   : 163
    <79fa2>   DW_AT_decl_column : 9
    <79fa3>   DW_AT_type        : <0x799c6>
    <79fa7>   DW_AT_data_member_location: 112
 <2><79fa8>: Abbrev Number: 2 (DW_TAG_member)
    <79fa9>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <79fad>   DW_AT_decl_file   : 6
    <79fae>   DW_AT_decl_line   : 164
    <79faf>   DW_AT_decl_column : 9
    <79fb0>   DW_AT_type        : <0x799c6>
    <79fb4>   DW_AT_data_member_location: 116
 <2><79fb5>: Abbrev Number: 2 (DW_TAG_member)
    <79fb6>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <79fba>   DW_AT_decl_file   : 6
    <79fbb>   DW_AT_decl_line   : 164
    <79fbc>   DW_AT_decl_column : 19
    <79fbd>   DW_AT_type        : <0x799c6>
    <79fc1>   DW_AT_data_member_location: 120
 <2><79fc2>: Abbrev Number: 2 (DW_TAG_member)
    <79fc3>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <79fc7>   DW_AT_decl_file   : 6
    <79fc8>   DW_AT_decl_line   : 165
    <79fc9>   DW_AT_decl_column : 24
    <79fca>   DW_AT_type        : <0x7a1a7>
    <79fce>   DW_AT_data_member_location: 128
 <2><79fcf>: Abbrev Number: 2 (DW_TAG_member)
    <79fd0>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <79fd4>   DW_AT_decl_file   : 6
    <79fd5>   DW_AT_decl_line   : 166
    <79fd6>   DW_AT_decl_column : 9
    <79fd7>   DW_AT_type        : <0x799c6>
    <79fdb>   DW_AT_data_member_location: 136
 <2><79fdc>: Abbrev Number: 2 (DW_TAG_member)
    <79fdd>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <79fe1>   DW_AT_decl_file   : 6
    <79fe2>   DW_AT_decl_line   : 166
    <79fe3>   DW_AT_decl_column : 17
    <79fe4>   DW_AT_type        : <0x799c6>
    <79fe8>   DW_AT_data_member_location: 140
 <2><79fe9>: Abbrev Number: 2 (DW_TAG_member)
    <79fea>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <79fee>   DW_AT_decl_file   : 6
    <79fef>   DW_AT_decl_line   : 167
    <79ff0>   DW_AT_decl_column : 11
    <79ff1>   DW_AT_type        : <0x79990>
    <79ff5>   DW_AT_data_member_location: 144
 <2><79ff6>: Abbrev Number: 8 (DW_TAG_member)
    <79ff7>   DW_AT_name        : key
    <79ffb>   DW_AT_decl_file   : 6
    <79ffc>   DW_AT_decl_line   : 168
    <79ffd>   DW_AT_decl_column : 11
    <79ffe>   DW_AT_type        : <0x799e0>
    <7a002>   DW_AT_data_member_location: 152
 <2><7a003>: Abbrev Number: 2 (DW_TAG_member)
    <7a004>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <7a008>   DW_AT_decl_file   : 6
    <7a009>   DW_AT_decl_line   : 169
    <7a00a>   DW_AT_decl_column : 6
    <7a00b>   DW_AT_type        : <0x799c6>
    <7a00f>   DW_AT_data_member_location: 160
 <2><7a010>: Abbrev Number: 2 (DW_TAG_member)
    <7a011>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <7a015>   DW_AT_decl_file   : 6
    <7a016>   DW_AT_decl_line   : 170
    <7a017>   DW_AT_decl_column : 18
    <7a018>   DW_AT_type        : <0x7a1ac>
    <7a01c>   DW_AT_data_member_location: 168
 <2><7a01d>: Abbrev Number: 2 (DW_TAG_member)
    <7a01e>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <7a022>   DW_AT_decl_file   : 6
    <7a023>   DW_AT_decl_line   : 171
    <7a024>   DW_AT_decl_column : 12
    <7a025>   DW_AT_type        : <0x79b96>
    <7a029>   DW_AT_data_member_location: 176
 <2><7a02a>: Abbrev Number: 2 (DW_TAG_member)
    <7a02b>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <7a02f>   DW_AT_decl_file   : 6
    <7a030>   DW_AT_decl_line   : 172
    <7a031>   DW_AT_decl_column : 9
    <7a032>   DW_AT_type        : <0x799c6>
    <7a036>   DW_AT_data_member_location: 184
 <2><7a037>: Abbrev Number: 2 (DW_TAG_member)
    <7a038>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <7a03c>   DW_AT_decl_file   : 6
    <7a03d>   DW_AT_decl_line   : 172
    <7a03e>   DW_AT_decl_column : 21
    <7a03f>   DW_AT_type        : <0x799c6>
    <7a043>   DW_AT_data_member_location: 188
 <2><7a044>: Abbrev Number: 2 (DW_TAG_member)
    <7a045>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <7a049>   DW_AT_decl_file   : 6
    <7a04a>   DW_AT_decl_line   : 173
    <7a04b>   DW_AT_decl_column : 11
    <7a04c>   DW_AT_type        : <0x7a1b6>
    <7a050>   DW_AT_data_member_location: 192
 <2><7a051>: Abbrev Number: 2 (DW_TAG_member)
    <7a052>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <7a056>   DW_AT_decl_file   : 6
    <7a057>   DW_AT_decl_line   : 174
    <7a058>   DW_AT_decl_column : 15
    <7a059>   DW_AT_type        : <0x799cd>
    <7a05d>   DW_AT_data_member_location: 200
 <2><7a05e>: Abbrev Number: 2 (DW_TAG_member)
    <7a05f>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <7a063>   DW_AT_decl_file   : 6
    <7a064>   DW_AT_decl_line   : 175
    <7a065>   DW_AT_decl_column : 6
    <7a066>   DW_AT_type        : <0x799c6>
    <7a06a>   DW_AT_data_member_location: 204
 <2><7a06b>: Abbrev Number: 0
 <1><7a06c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a06d>   DW_AT_byte_size   : 8
    <7a06d>   DW_AT_type        : <0x799aa>
 <1><7a071>: Abbrev Number: 20 (DW_TAG_structure_type)
    <7a072>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <7a076>   DW_AT_byte_size   : 112
    <7a077>   DW_AT_decl_file   : 6
    <7a078>   DW_AT_decl_line   : 178
    <7a079>   DW_AT_decl_column : 16
    <7a07a>   DW_AT_sibling     : <0x7a135>
 <2><7a07e>: Abbrev Number: 2 (DW_TAG_member)
    <7a07f>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <7a083>   DW_AT_decl_file   : 6
    <7a084>   DW_AT_decl_line   : 188
    <7a085>   DW_AT_decl_column : 8
    <7a086>   DW_AT_type        : <0x799e0>
    <7a08a>   DW_AT_data_member_location: 0
 <2><7a08b>: Abbrev Number: 2 (DW_TAG_member)
    <7a08c>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <7a090>   DW_AT_decl_file   : 6
    <7a091>   DW_AT_decl_line   : 208
    <7a092>   DW_AT_decl_column : 8
    <7a093>   DW_AT_type        : <0x7a1ef>
    <7a097>   DW_AT_data_member_location: 8
 <2><7a098>: Abbrev Number: 2 (DW_TAG_member)
    <7a099>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <7a09d>   DW_AT_decl_file   : 6
    <7a09e>   DW_AT_decl_line   : 222
    <7a09f>   DW_AT_decl_column : 9
    <7a0a0>   DW_AT_type        : <0x79a29>
    <7a0a4>   DW_AT_data_member_location: 16
 <2><7a0a5>: Abbrev Number: 2 (DW_TAG_member)
    <7a0a6>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <7a0aa>   DW_AT_decl_file   : 6
    <7a0ab>   DW_AT_decl_line   : 231
    <7a0ac>   DW_AT_decl_column : 9
    <7a0ad>   DW_AT_type        : <0x79a29>
    <7a0b1>   DW_AT_data_member_location: 24
 <2><7a0b2>: Abbrev Number: 2 (DW_TAG_member)
    <7a0b3>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <7a0b7>   DW_AT_decl_file   : 6
    <7a0b8>   DW_AT_decl_line   : 239
    <7a0b9>   DW_AT_decl_column : 9
    <7a0ba>   DW_AT_type        : <0x79a29>
    <7a0be>   DW_AT_data_member_location: 32
 <2><7a0bf>: Abbrev Number: 2 (DW_TAG_member)
    <7a0c0>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <7a0c4>   DW_AT_decl_file   : 6
    <7a0c5>   DW_AT_decl_line   : 248
    <7a0c6>   DW_AT_decl_column : 9
    <7a0c7>   DW_AT_type        : <0x7a20e>
    <7a0cb>   DW_AT_data_member_location: 40
 <2><7a0cc>: Abbrev Number: 6 (DW_TAG_member)
    <7a0cd>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <7a0d1>   DW_AT_decl_file   : 6
    <7a0d1>   DW_AT_decl_line   : 258
    <7a0d3>   DW_AT_decl_column : 9
    <7a0d4>   DW_AT_type        : <0x79a29>
    <7a0d8>   DW_AT_data_member_location: 48
 <2><7a0d9>: Abbrev Number: 6 (DW_TAG_member)
    <7a0da>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <7a0de>   DW_AT_decl_file   : 6
    <7a0de>   DW_AT_decl_line   : 274
    <7a0e0>   DW_AT_decl_column : 8
    <7a0e1>   DW_AT_type        : <0x79b6e>
    <7a0e5>   DW_AT_data_member_location: 56
 <2><7a0e6>: Abbrev Number: 6 (DW_TAG_member)
    <7a0e7>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <7a0eb>   DW_AT_decl_file   : 6
    <7a0eb>   DW_AT_decl_line   : 285
    <7a0ed>   DW_AT_decl_column : 9
    <7a0ee>   DW_AT_type        : <0x7a20e>
    <7a0f2>   DW_AT_data_member_location: 64
 <2><7a0f3>: Abbrev Number: 6 (DW_TAG_member)
    <7a0f4>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <7a0f8>   DW_AT_decl_file   : 6
    <7a0f8>   DW_AT_decl_line   : 293
    <7a0fa>   DW_AT_decl_column : 9
    <7a0fb>   DW_AT_type        : <0x7a21e>
    <7a0ff>   DW_AT_data_member_location: 72
 <2><7a100>: Abbrev Number: 6 (DW_TAG_member)
    <7a101>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <7a105>   DW_AT_decl_file   : 6
    <7a105>   DW_AT_decl_line   : 301
    <7a107>   DW_AT_decl_column : 8
    <7a108>   DW_AT_type        : <0x79b50>
    <7a10c>   DW_AT_data_member_location: 80
 <2><7a10d>: Abbrev Number: 6 (DW_TAG_member)
    <7a10e>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <7a112>   DW_AT_decl_file   : 6
    <7a112>   DW_AT_decl_line   : 314
    <7a114>   DW_AT_decl_column : 9
    <7a115>   DW_AT_type        : <0x7a237>
    <7a119>   DW_AT_data_member_location: 88
 <2><7a11a>: Abbrev Number: 6 (DW_TAG_member)
    <7a11b>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <7a11f>   DW_AT_decl_file   : 6
    <7a11f>   DW_AT_decl_line   : 321
    <7a121>   DW_AT_decl_column : 9
    <7a122>   DW_AT_type        : <0x79a29>
    <7a126>   DW_AT_data_member_location: 96
 <2><7a127>: Abbrev Number: 6 (DW_TAG_member)
    <7a128>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <7a12c>   DW_AT_decl_file   : 6
    <7a12c>   DW_AT_decl_line   : 328
    <7a12e>   DW_AT_decl_column : 9
    <7a12f>   DW_AT_type        : <0x79a29>
    <7a133>   DW_AT_data_member_location: 104
 <2><7a134>: Abbrev Number: 0
 <1><7a135>: Abbrev Number: 19 (DW_TAG_const_type)
    <7a136>   DW_AT_type        : <0x7a071>
 <1><7a13a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a13b>   DW_AT_byte_size   : 8
    <7a13b>   DW_AT_type        : <0x7a135>
 <1><7a13f>: Abbrev Number: 39 (DW_TAG_structure_type)
    <7a140>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <7a144>   DW_AT_byte_size   : 16
    <7a145>   DW_AT_decl_file   : 6
    <7a145>   DW_AT_decl_line   : 331
    <7a147>   DW_AT_decl_column : 16
    <7a148>   DW_AT_sibling     : <0x7a167>
 <2><7a14c>: Abbrev Number: 6 (DW_TAG_member)
    <7a14d>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <7a151>   DW_AT_decl_file   : 6
    <7a151>   DW_AT_decl_line   : 333
    <7a153>   DW_AT_decl_column : 12
    <7a154>   DW_AT_type        : <0x799d2>
    <7a158>   DW_AT_data_member_location: 0
 <2><7a159>: Abbrev Number: 6 (DW_TAG_member)
    <7a15a>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7a15e>   DW_AT_decl_file   : 6
    <7a15e>   DW_AT_decl_line   : 334
    <7a160>   DW_AT_decl_column : 23
    <7a161>   DW_AT_type        : <0x7a23c>
    <7a165>   DW_AT_data_member_location: 8
 <2><7a166>: Abbrev Number: 0
 <1><7a167>: Abbrev Number: 19 (DW_TAG_const_type)
    <7a168>   DW_AT_type        : <0x7a13f>
 <1><7a16c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a16d>   DW_AT_byte_size   : 8
    <7a16d>   DW_AT_type        : <0x7a167>
 <1><7a171>: Abbrev Number: 39 (DW_TAG_structure_type)
    <7a172>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <7a176>   DW_AT_byte_size   : 16
    <7a177>   DW_AT_decl_file   : 6
    <7a177>   DW_AT_decl_line   : 337
    <7a179>   DW_AT_decl_column : 16
    <7a17a>   DW_AT_sibling     : <0x7a1a2>
 <2><7a17e>: Abbrev Number: 32 (DW_TAG_member)
    <7a17f>   DW_AT_name        : w
    <7a181>   DW_AT_decl_file   : 6
    <7a181>   DW_AT_decl_line   : 339
    <7a183>   DW_AT_decl_column : 15
    <7a184>   DW_AT_type        : <0x799d2>
    <7a188>   DW_AT_data_member_location: 0
 <2><7a189>: Abbrev Number: 32 (DW_TAG_member)
    <7a18a>   DW_AT_name        : h
    <7a18c>   DW_AT_decl_file   : 6
    <7a18c>   DW_AT_decl_line   : 340
    <7a18e>   DW_AT_decl_column : 15
    <7a18f>   DW_AT_type        : <0x799d2>
    <7a193>   DW_AT_data_member_location: 4
 <2><7a194>: Abbrev Number: 6 (DW_TAG_member)
    <7a195>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7a199>   DW_AT_decl_file   : 6
    <7a199>   DW_AT_decl_line   : 341
    <7a19b>   DW_AT_decl_column : 23
    <7a19c>   DW_AT_type        : <0x7a23c>
    <7a1a0>   DW_AT_data_member_location: 8
 <2><7a1a1>: Abbrev Number: 0
 <1><7a1a2>: Abbrev Number: 19 (DW_TAG_const_type)
    <7a1a3>   DW_AT_type        : <0x7a171>
 <1><7a1a7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a1a8>   DW_AT_byte_size   : 8
    <7a1a8>   DW_AT_type        : <0x7a1a2>
 <1><7a1ac>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a1ad>   DW_AT_byte_size   : 8
    <7a1ad>   DW_AT_type        : <0x7a1b1>
 <1><7a1b1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a1b2>   DW_AT_byte_size   : 8
    <7a1b2>   DW_AT_type        : <0x79e9d>
 <1><7a1b6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a1b7>   DW_AT_byte_size   : 8
    <7a1b7>   DW_AT_type        : <0x79a46>
 <1><7a1bb>: Abbrev Number: 12 (DW_TAG_typedef)
    <7a1bc>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <7a1c0>   DW_AT_decl_file   : 6
    <7a1c1>   DW_AT_decl_line   : 176
    <7a1c2>   DW_AT_decl_column : 3
    <7a1c3>   DW_AT_type        : <0x79ea9>
 <1><7a1c7>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7a1c8>   DW_AT_prototyped  : 1
    <7a1c8>   DW_AT_type        : <0x799c6>
    <7a1cc>   DW_AT_sibling     : <0x7a1ef>
 <2><7a1d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1d1>   DW_AT_type        : <0x799e0>
 <2><7a1d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1d6>   DW_AT_type        : <0x799c6>
 <2><7a1da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1db>   DW_AT_type        : <0x799c6>
 <2><7a1df>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1e0>   DW_AT_type        : <0x799c6>
 <2><7a1e4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1e5>   DW_AT_type        : <0x799c6>
 <2><7a1e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1ea>   DW_AT_type        : <0x799c6>
 <2><7a1ee>: Abbrev Number: 0
 <1><7a1ef>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a1f0>   DW_AT_byte_size   : 8
    <7a1f0>   DW_AT_type        : <0x7a1c7>
 <1><7a1f4>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <7a1f5>   DW_AT_prototyped  : 1
    <7a1f5>   DW_AT_sibling     : <0x7a20e>
 <2><7a1f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1fa>   DW_AT_type        : <0x799c6>
 <2><7a1fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a1ff>   DW_AT_type        : <0x799c6>
 <2><7a203>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a204>   DW_AT_type        : <0x799c6>
 <2><7a208>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a209>   DW_AT_type        : <0x799c6>
 <2><7a20d>: Abbrev Number: 0
 <1><7a20e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a20f>   DW_AT_byte_size   : 8
    <7a20f>   DW_AT_type        : <0x7a1f4>
 <1><7a213>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <7a214>   DW_AT_prototyped  : 1
    <7a214>   DW_AT_sibling     : <0x7a21e>
 <2><7a218>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a219>   DW_AT_type        : <0x799e0>
 <2><7a21d>: Abbrev Number: 0
 <1><7a21e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a21f>   DW_AT_byte_size   : 8
    <7a21f>   DW_AT_type        : <0x7a213>
 <1><7a223>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <7a224>   DW_AT_prototyped  : 1
    <7a224>   DW_AT_type        : <0x79b69>
    <7a228>   DW_AT_sibling     : <0x7a237>
 <2><7a22c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a22d>   DW_AT_type        : <0x799c6>
 <2><7a231>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a232>   DW_AT_type        : <0x79b69>
 <2><7a236>: Abbrev Number: 0
 <1><7a237>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a238>   DW_AT_byte_size   : 8
    <7a238>   DW_AT_type        : <0x7a223>
 <1><7a23c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a23d>   DW_AT_byte_size   : 8
    <7a23d>   DW_AT_type        : <0x7999e>
 <1><7a241>: Abbrev Number: 65 (DW_TAG_structure_type)
    <7a242>   DW_AT_byte_size   : 4
    <7a243>   DW_AT_decl_file   : 6
    <7a244>   DW_AT_decl_line   : 346
    <7a246>   DW_AT_decl_column : 3
    <7a247>   DW_AT_sibling     : <0x7a277>
 <2><7a24b>: Abbrev Number: 66 (DW_TAG_member)
    <7a24c>   DW_AT_name        : bpp
    <7a250>   DW_AT_decl_file   : 6
    <7a251>   DW_AT_decl_line   : 347
    <7a253>   DW_AT_decl_column : 19
    <7a254>   DW_AT_type        : <0x799a3>
    <7a258>   DW_AT_bit_size    : 3
    <7a259>   DW_AT_data_bit_offset: 0
 <2><7a25a>: Abbrev Number: 67 (DW_TAG_member)
    <7a25b>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7a25f>   DW_AT_decl_file   : 6
    <7a260>   DW_AT_decl_line   : 348
    <7a262>   DW_AT_decl_column : 19
    <7a263>   DW_AT_type        : <0x799a3>
    <7a267>   DW_AT_bit_size    : 13
    <7a268>   DW_AT_data_bit_offset: 3
 <2><7a269>: Abbrev Number: 6 (DW_TAG_member)
    <7a26a>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7a26e>   DW_AT_decl_file   : 6
    <7a26e>   DW_AT_decl_line   : 349
    <7a270>   DW_AT_decl_column : 19
    <7a271>   DW_AT_type        : <0x799a3>
    <7a275>   DW_AT_data_member_location: 2
 <2><7a276>: Abbrev Number: 0
 <1><7a277>: Abbrev Number: 68 (DW_TAG_union_type)
    <7a278>   DW_AT_byte_size   : 4
    <7a279>   DW_AT_decl_file   : 6
    <7a27a>   DW_AT_decl_line   : 345
    <7a27c>   DW_AT_decl_column : 2
    <7a27d>   DW_AT_sibling     : <0x7a29c>
 <2><7a281>: Abbrev Number: 69 (DW_TAG_member)
    <7a282>   DW_AT_name        : old
    <7a286>   DW_AT_decl_file   : 6
    <7a287>   DW_AT_decl_line   : 350
    <7a289>   DW_AT_decl_column : 5
    <7a28a>   DW_AT_type        : <0x7a241>
 <2><7a28e>: Abbrev Number: 70 (DW_TAG_member)
    <7a28f>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <7a293>   DW_AT_decl_file   : 6
    <7a294>   DW_AT_decl_line   : 351
    <7a296>   DW_AT_decl_column : 16
    <7a297>   DW_AT_type        : <0x799aa>
 <2><7a29b>: Abbrev Number: 0
 <1><7a29c>: Abbrev Number: 39 (DW_TAG_structure_type)
    <7a29d>   DW_AT_name        : (indirect string, offset: 0x16c84): _PUT_HEADER
    <7a2a1>   DW_AT_byte_size   : 32
    <7a2a2>   DW_AT_decl_file   : 6
    <7a2a2>   DW_AT_decl_line   : 344
    <7a2a4>   DW_AT_decl_column : 8
    <7a2a5>   DW_AT_sibling     : <0x7a30b>
 <2><7a2a9>: Abbrev Number: 31 (DW_TAG_member)
    <7a2aa>   DW_AT_type        : <0x7a277>
    <7a2ae>   DW_AT_data_member_location: 0
 <2><7a2af>: Abbrev Number: 32 (DW_TAG_member)
    <7a2b0>   DW_AT_name        : bpp
    <7a2b4>   DW_AT_decl_file   : 6
    <7a2b4>   DW_AT_decl_line   : 353
    <7a2b6>   DW_AT_decl_column : 6
    <7a2b7>   DW_AT_type        : <0x799c6>
    <7a2bb>   DW_AT_data_member_location: 4
 <2><7a2bc>: Abbrev Number: 6 (DW_TAG_member)
    <7a2bd>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <7a2c1>   DW_AT_decl_file   : 6
    <7a2c1>   DW_AT_decl_line   : 354
    <7a2c3>   DW_AT_decl_column : 15
    <7a2c4>   DW_AT_type        : <0x799aa>
    <7a2c8>   DW_AT_data_member_location: 8
 <2><7a2c9>: Abbrev Number: 6 (DW_TAG_member)
    <7a2ca>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <7a2ce>   DW_AT_decl_file   : 6
    <7a2ce>   DW_AT_decl_line   : 355
    <7a2d0>   DW_AT_decl_column : 15
    <7a2d1>   DW_AT_type        : <0x799aa>
    <7a2d5>   DW_AT_data_member_location: 12
 <2><7a2d6>: Abbrev Number: 6 (DW_TAG_member)
    <7a2d7>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <7a2db>   DW_AT_decl_file   : 6
    <7a2db>   DW_AT_decl_line   : 356
    <7a2dd>   DW_AT_decl_column : 15
    <7a2de>   DW_AT_type        : <0x799aa>
    <7a2e2>   DW_AT_data_member_location: 16
 <2><7a2e3>: Abbrev Number: 32 (DW_TAG_member)
    <7a2e4>   DW_AT_name        : tex
    <7a2e8>   DW_AT_decl_file   : 6
    <7a2e8>   DW_AT_decl_line   : 357
    <7a2ea>   DW_AT_decl_column : 15
    <7a2eb>   DW_AT_type        : <0x799aa>
    <7a2ef>   DW_AT_data_member_location: 20
 <2><7a2f0>: Abbrev Number: 6 (DW_TAG_member)
    <7a2f1>   DW_AT_name        : (indirect string, offset: 0x1d25a): _reserved
    <7a2f5>   DW_AT_decl_file   : 6
    <7a2f5>   DW_AT_decl_line   : 358
    <7a2f7>   DW_AT_decl_column : 7
    <7a2f8>   DW_AT_type        : <0x79a13>
    <7a2fc>   DW_AT_data_member_location: 24
 <2><7a2fd>: Abbrev Number: 6 (DW_TAG_member)
    <7a2fe>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <7a302>   DW_AT_decl_file   : 6
    <7a302>   DW_AT_decl_line   : 359
    <7a304>   DW_AT_decl_column : 16
    <7a305>   DW_AT_type        : <0x7a30b>
    <7a309>   DW_AT_data_member_location: 32
 <2><7a30a>: Abbrev Number: 0
 <1><7a30b>: Abbrev Number: 28 (DW_TAG_array_type)
    <7a30c>   DW_AT_type        : <0x79997>
    <7a310>   DW_AT_sibling     : <0x7a31b>
 <2><7a314>: Abbrev Number: 71 (DW_TAG_subrange_type)
    <7a315>   DW_AT_type        : <0x799b1>
    <7a319>   DW_AT_count       : 0
 <2><7a31a>: Abbrev Number: 0
 <1><7a31b>: Abbrev Number: 44 (DW_TAG_typedef)
    <7a31c>   DW_AT_name        : (indirect string, offset: 0x16c85): PUT_HEADER
    <7a320>   DW_AT_decl_file   : 6
    <7a321>   DW_AT_decl_line   : 361
    <7a323>   DW_AT_decl_column : 28
    <7a324>   DW_AT_type        : <0x7a29c>
 <1><7a328>: Abbrev Number: 21 (DW_TAG_variable)
    <7a329>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <7a32d>   DW_AT_decl_file   : 6
    <7a32d>   DW_AT_decl_line   : 364
    <7a32f>   DW_AT_decl_column : 15
    <7a330>   DW_AT_type        : <0x7a334>
    <7a334>   DW_AT_external    : 1
    <7a334>   DW_AT_declaration : 1
 <1><7a334>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7a335>   DW_AT_byte_size   : 8
    <7a335>   DW_AT_type        : <0x7a1bb>
