    <963d4>   DW_AT_call_origin : <0x95919>
    <963d8>   DW_AT_sibling     : <0x963e3>
 <3><963dc>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <963dd>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <963df>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><963e2>: Abbrev Number: 0
 <2><963e3>: Abbrev Number: 13 (DW_TAG_call_site)
    <963e4>   DW_AT_call_return_pc: 0x4663f3
    <963ec>   DW_AT_call_origin : <0x95823>
 <2><963f0>: Abbrev Number: 4 (DW_TAG_call_site)
    <963f1>   DW_AT_call_return_pc: 0x46642a
    <963f9>   DW_AT_call_origin : <0x95996>
    <963fd>   DW_AT_sibling     : <0x96415>
 <3><96401>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <96402>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <96404>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><96407>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <96408>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <9640a>   DW_AT_call_value  : 3 byte block: a 1 46 	(DW_OP_const2u: 17921)
 <3><9640e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <9640f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <96411>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><96414>: Abbrev Number: 0
 <2><96415>: Abbrev Number: 4 (DW_TAG_call_site)
    <96416>   DW_AT_call_return_pc: 0x46644e
    <9641e>   DW_AT_call_origin : <0x95996>
    <96422>   DW_AT_sibling     : <0x9643a>

    <96e66>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><96e6a>: Abbrev Number: 0
  Compilation Unit @ offset 0x96e6b:
   Length:        0x2a3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x6b3b
   Pointer Size:  8
 <0><96e77>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <96e78>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <96e7c>   DW_AT_language    : 29	(C11)
    <96e7d>   DW_AT_name        : (indirect line string, offset: 0x873): src/gfxlib2/gfx_driver_null.c
    <96e81>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <96e85>   DW_AT_low_pc      : 0x466730
    <96e8d>   DW_AT_high_pc     : 0x1
    <96e95>   DW_AT_stmt_list   : 0x5b670
 <1><96e99>: Abbrev Number: 2 (DW_TAG_base_type)
    <96e9a>   DW_AT_byte_size   : 1
    <96e9b>   DW_AT_encoding    : 8	(unsigned char)
    <96e9c>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><96ea0>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ea1>   DW_AT_byte_size   : 2
    <96ea2>   DW_AT_encoding    : 7	(unsigned)
    <96ea3>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><96ea7>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ea8>   DW_AT_byte_size   : 4
    <96ea9>   DW_AT_encoding    : 7	(unsigned)
    <96eaa>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><96eae>: Abbrev Number: 2 (DW_TAG_base_type)
    <96eaf>   DW_AT_byte_size   : 8
    <96eb0>   DW_AT_encoding    : 7	(unsigned)
    <96eb1>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><96eb5>: Abbrev Number: 2 (DW_TAG_base_type)
    <96eb6>   DW_AT_byte_size   : 1
    <96eb7>   DW_AT_encoding    : 6	(signed char)
    <96eb8>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><96ebc>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ebd>   DW_AT_byte_size   : 2
    <96ebe>   DW_AT_encoding    : 5	(signed)
    <96ebf>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><96ec3>: Abbrev Number: 11 (DW_TAG_base_type)
    <96ec4>   DW_AT_byte_size   : 4
    <96ec5>   DW_AT_encoding    : 5	(signed)
    <96ec6>   DW_AT_name        : int
 <1><96eca>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ecb>   DW_AT_byte_size   : 8
    <96ecc>   DW_AT_encoding    : 5	(signed)
    <96ecd>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><96ed1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <96ed2>   DW_AT_byte_size   : 8
    <96ed2>   DW_AT_type        : <0x96ed6>
 <1><96ed6>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ed7>   DW_AT_byte_size   : 1
    <96ed8>   DW_AT_encoding    : 6	(signed char)
    <96ed9>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><96edd>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ede>   DW_AT_byte_size   : 8
    <96edf>   DW_AT_encoding    : 5	(signed)
    <96ee0>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><96ee4>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ee5>   DW_AT_byte_size   : 8
    <96ee6>   DW_AT_encoding    : 7	(unsigned)
    <96ee7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><96eeb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <96eec>   DW_AT_byte_size   : 8
    <96eec>   DW_AT_type        : <0x96ef0>
 <1><96ef0>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <96ef1>   DW_AT_prototyped  : 1
 <1><96ef1>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ef2>   DW_AT_byte_size   : 8
    <96ef3>   DW_AT_encoding    : 4	(float)
    <96ef4>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><96ef8>: Abbrev Number: 2 (DW_TAG_base_type)
    <96ef9>   DW_AT_byte_size   : 4
    <96efa>   DW_AT_encoding    : 4	(float)
    <96efb>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><96eff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <96f00>   DW_AT_byte_size   : 8
    <96f00>   DW_AT_type        : <0x96f04>
 <1><96f04>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <96f05>   DW_AT_prototyped  : 1
    <96f05>   DW_AT_type        : <0x96ec3>
    <96f09>   DW_AT_sibling     : <0x96f18>
 <2><96f0d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f0e>   DW_AT_type        : <0x96ec3>
 <2><96f12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f13>   DW_AT_type        : <0x96ec3>
 <2><96f17>: Abbrev Number: 0
 <1><96f18>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <96f19>   DW_AT_byte_size   : 8
    <96f19>   DW_AT_type        : <0x96ec3>
 <1><96f1d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <96f1e>   DW_AT_byte_size   : 8
    <96f1e>   DW_AT_type        : <0x96f22>
 <1><96f22>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <96f23>   DW_AT_prototyped  : 1
    <96f23>   DW_AT_type        : <0x96ec3>
    <96f27>   DW_AT_sibling     : <0x96f45>
 <2><96f2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f2c>   DW_AT_type        : <0x96f18>
 <2><96f30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f31>   DW_AT_type        : <0x96f18>
 <2><96f35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f36>   DW_AT_type        : <0x96f18>
 <2><96f3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f3b>   DW_AT_type        : <0x96f18>
 <2><96f3f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96f40>   DW_AT_type        : <0x96f18>
 <2><96f44>: Abbrev Number: 0
 <1><96f45>: Abbrev Number: 13 (DW_TAG_structure_type)
    <96f46>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <96f4a>   DW_AT_byte_size   : 112
    <96f4b>   DW_AT_decl_file   : 2
    <96f4c>   DW_AT_decl_line   : 178
    <96f4d>   DW_AT_decl_column : 16
    <96f4e>   DW_AT_sibling     : <0x97003>
 <2><96f52>: Abbrev Number: 6 (DW_TAG_member)
    <96f53>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <96f57>   DW_AT_decl_file   : 2
    <96f57>   DW_AT_decl_line   : 188
    <96f58>   DW_AT_decl_column : 8
    <96f59>   DW_AT_type        : <0x96ed1>
    <96f5d>   DW_AT_data_member_location: 0
 <2><96f5e>: Abbrev Number: 6 (DW_TAG_member)
    <96f5f>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <96f63>   DW_AT_decl_file   : 2
    <96f63>   DW_AT_decl_line   : 208
    <96f64>   DW_AT_decl_column : 8
    <96f65>   DW_AT_type        : <0x9702b>
    <96f69>   DW_AT_data_member_location: 8
 <2><96f6a>: Abbrev Number: 6 (DW_TAG_member)
    <96f6b>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <96f6f>   DW_AT_decl_file   : 2
    <96f6f>   DW_AT_decl_line   : 222
    <96f70>   DW_AT_decl_column : 9
    <96f71>   DW_AT_type        : <0x96eeb>
    <96f75>   DW_AT_data_member_location: 16
 <2><96f76>: Abbrev Number: 6 (DW_TAG_member)
    <96f77>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <96f7b>   DW_AT_decl_file   : 2
    <96f7b>   DW_AT_decl_line   : 231
    <96f7c>   DW_AT_decl_column : 9
    <96f7d>   DW_AT_type        : <0x96eeb>
    <96f81>   DW_AT_data_member_location: 24
 <2><96f82>: Abbrev Number: 6 (DW_TAG_member)
    <96f83>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <96f87>   DW_AT_decl_file   : 2
    <96f87>   DW_AT_decl_line   : 239
    <96f88>   DW_AT_decl_column : 9
    <96f89>   DW_AT_type        : <0x96eeb>
    <96f8d>   DW_AT_data_member_location: 32
 <2><96f8e>: Abbrev Number: 6 (DW_TAG_member)
    <96f8f>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <96f93>   DW_AT_decl_file   : 2
    <96f93>   DW_AT_decl_line   : 248
    <96f94>   DW_AT_decl_column : 9
    <96f95>   DW_AT_type        : <0x9704a>
    <96f99>   DW_AT_data_member_location: 40
 <2><96f9a>: Abbrev Number: 5 (DW_TAG_member)
    <96f9b>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <96f9f>   DW_AT_decl_file   : 2
    <96f9f>   DW_AT_decl_line   : 258
    <96fa1>   DW_AT_decl_column : 9
    <96fa2>   DW_AT_type        : <0x96eeb>
    <96fa6>   DW_AT_data_member_location: 48
 <2><96fa7>: Abbrev Number: 5 (DW_TAG_member)
    <96fa8>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <96fac>   DW_AT_decl_file   : 2
    <96fac>   DW_AT_decl_line   : 274
    <96fae>   DW_AT_decl_column : 8
    <96faf>   DW_AT_type        : <0x96f1d>
    <96fb3>   DW_AT_data_member_location: 56
 <2><96fb4>: Abbrev Number: 5 (DW_TAG_member)
    <96fb5>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <96fb9>   DW_AT_decl_file   : 2
    <96fb9>   DW_AT_decl_line   : 285
    <96fbb>   DW_AT_decl_column : 9
    <96fbc>   DW_AT_type        : <0x9704a>
    <96fc0>   DW_AT_data_member_location: 64
 <2><96fc1>: Abbrev Number: 5 (DW_TAG_member)
    <96fc2>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <96fc6>   DW_AT_decl_file   : 2
    <96fc6>   DW_AT_decl_line   : 293
    <96fc8>   DW_AT_decl_column : 9
    <96fc9>   DW_AT_type        : <0x9705a>
    <96fcd>   DW_AT_data_member_location: 72
 <2><96fce>: Abbrev Number: 5 (DW_TAG_member)
    <96fcf>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <96fd3>   DW_AT_decl_file   : 2
    <96fd3>   DW_AT_decl_line   : 301
    <96fd5>   DW_AT_decl_column : 8
    <96fd6>   DW_AT_type        : <0x96eff>
    <96fda>   DW_AT_data_member_location: 80
 <2><96fdb>: Abbrev Number: 5 (DW_TAG_member)
    <96fdc>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <96fe0>   DW_AT_decl_file   : 2
    <96fe0>   DW_AT_decl_line   : 314
    <96fe2>   DW_AT_decl_column : 9
    <96fe3>   DW_AT_type        : <0x97073>
    <96fe7>   DW_AT_data_member_location: 88
 <2><96fe8>: Abbrev Number: 5 (DW_TAG_member)
    <96fe9>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <96fed>   DW_AT_decl_file   : 2
    <96fed>   DW_AT_decl_line   : 321
    <96fef>   DW_AT_decl_column : 9
    <96ff0>   DW_AT_type        : <0x96eeb>
    <96ff4>   DW_AT_data_member_location: 96
 <2><96ff5>: Abbrev Number: 5 (DW_TAG_member)
    <96ff6>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <96ffa>   DW_AT_decl_file   : 2
    <96ffa>   DW_AT_decl_line   : 328
    <96ffc>   DW_AT_decl_column : 9
    <96ffd>   DW_AT_type        : <0x96eeb>
    <97001>   DW_AT_data_member_location: 104
 <2><97002>: Abbrev Number: 0
 <1><97003>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <97004>   DW_AT_prototyped  : 1
    <97004>   DW_AT_type        : <0x96ec3>
    <97008>   DW_AT_sibling     : <0x9702b>
 <2><9700c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9700d>   DW_AT_type        : <0x96ed1>
 <2><97011>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97012>   DW_AT_type        : <0x96ec3>
 <2><97016>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97017>   DW_AT_type        : <0x96ec3>
 <2><9701b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9701c>   DW_AT_type        : <0x96ec3>
 <2><97020>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97021>   DW_AT_type        : <0x96ec3>
 <2><97025>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97026>   DW_AT_type        : <0x96ec3>
 <2><9702a>: Abbrev Number: 0
 <1><9702b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9702c>   DW_AT_byte_size   : 8
    <9702c>   DW_AT_type        : <0x97003>
 <1><97030>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97031>   DW_AT_prototyped  : 1
    <97031>   DW_AT_sibling     : <0x9704a>
 <2><97035>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97036>   DW_AT_type        : <0x96ec3>
 <2><9703a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9703b>   DW_AT_type        : <0x96ec3>
 <2><9703f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97040>   DW_AT_type        : <0x96ec3>
 <2><97044>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97045>   DW_AT_type        : <0x96ec3>
 <2><97049>: Abbrev Number: 0
 <1><9704a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9704b>   DW_AT_byte_size   : 8
    <9704b>   DW_AT_type        : <0x97030>
 <1><9704f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97050>   DW_AT_prototyped  : 1
    <97050>   DW_AT_sibling     : <0x9705a>
 <2><97054>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97055>   DW_AT_type        : <0x96ed1>
 <2><97059>: Abbrev Number: 0
 <1><9705a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9705b>   DW_AT_byte_size   : 8
    <9705b>   DW_AT_type        : <0x9704f>
 <1><9705f>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <97060>   DW_AT_prototyped  : 1
    <97060>   DW_AT_type        : <0x96f18>
    <97064>   DW_AT_sibling     : <0x97073>
 <2><97068>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97069>   DW_AT_type        : <0x96ec3>
 <2><9706d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9706e>   DW_AT_type        : <0x96f18>
 <2><97072>: Abbrev Number: 0
 <1><97073>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <97074>   DW_AT_byte_size   : 8
    <97074>   DW_AT_type        : <0x9705f>
 <1><97078>: Abbrev Number: 14 (DW_TAG_typedef)
    <97079>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <9707d>   DW_AT_decl_file   : 2
    <9707e>   DW_AT_decl_line   : 329
    <97080>   DW_AT_decl_column : 3
    <97081>   DW_AT_type        : <0x96f45>
 <1><97085>: Abbrev Number: 15 (DW_TAG_const_type)
    <97086>   DW_AT_type        : <0x97078>
 <1><9708a>: Abbrev Number: 16 (DW_TAG_variable)
    <9708b>   DW_AT_name        : (indirect string, offset: 0x1819c): __fb_gfxDriverNull
    <9708f>   DW_AT_decl_file   : 2
    <97090>   DW_AT_decl_line   : 367
    <97092>   DW_AT_decl_column : 24
    <97093>   DW_AT_type        : <0x97085>
    <97097>   DW_AT_external    : 1
    <97097>   DW_AT_declaration : 1
 <1><97097>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <97098>   DW_AT_encoding    : 7	(void)
    <97098>   DW_AT_byte_size   : 4
    <97098>   DW_AT_type        : <0x96ea7>
    <9709c>   DW_AT_decl_file   : 2
    <9709c>   DW_AT_decl_line   : 376
    <9709e>   DW_AT_decl_column : 6
    <9709e>   DW_AT_sibling     : <0x970bb>
 <2><970a2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970a3>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <970a7>   DW_AT_const_value : 0
 <2><970a8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970a9>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <970ad>   DW_AT_const_value : 1
 <2><970ae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970af>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <970b3>   DW_AT_const_value : 2
 <2><970b4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970b5>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <970b9>   DW_AT_const_value : 3
 <2><970ba>: Abbrev Number: 0
 <1><970bb>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <970bc>   DW_AT_encoding    : 7	(void)
    <970bc>   DW_AT_byte_size   : 4
    <970bc>   DW_AT_type        : <0x96ea7>
    <970c0>   DW_AT_decl_file   : 2
    <970c0>   DW_AT_decl_line   : 384
    <970c2>   DW_AT_decl_column : 6
    <970c2>   DW_AT_sibling     : <0x970e5>
 <2><970c6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970c7>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <970cb>   DW_AT_const_value : 0
 <2><970cc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970cd>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <970d1>   DW_AT_const_value : 1
 <2><970d2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970d3>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <970d7>   DW_AT_const_value : 2
 <2><970d8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970d9>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <970dd>   DW_AT_const_value : 3
 <2><970de>: Abbrev Number: 4 (DW_TAG_enumerator)
    <970df>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <970e3>   DW_AT_const_value : 4
 <2><970e4>: Abbrev Number: 0
 <1><970e5>: Abbrev Number: 17 (DW_TAG_variable)
    <970e6>   DW_AT_specification: <0x9708a>
    <970ea>   DW_AT_decl_file   : 1
    <970eb>   DW_AT_decl_line   : 7
    <970ec>   DW_AT_decl_column : 17
    <970ed>   DW_AT_location    : 9 byte block: 3 a0 99 48 0 0 0 0 0 	(DW_OP_addr: 4899a0)
 <1><970f7>: Abbrev Number: 18 (DW_TAG_subprogram)
    <970f8>   DW_AT_name        : (indirect string, offset: 0x1a26e): driver_dummy
    <970fc>   DW_AT_decl_file   : 1
    <970fd>   DW_AT_decl_line   : 25
    <970fe>   DW_AT_decl_column : 13
    <970ff>   DW_AT_prototyped  : 1
    <970ff>   DW_AT_low_pc      : 0x466730
    <97107>   DW_AT_high_pc     : 0x1
    <9710f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <97111>   DW_AT_call_all_calls: 1
 <1><97111>: Abbrev Number: 0
  Compilation Unit @ offset 0x97112:
   Length:        0x1c54 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x6c35
   Pointer Size:  8
 <0><9711e>: Abbrev Number: 39 (DW_TAG_compile_unit)
    <9711f>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <97123>   DW_AT_language    : 29	(C11)
    <97124>   DW_AT_name        : (indirect line string, offset: 0x891): src/gfxlib2/unix/gfx_driver_opengl_x11.c
    <97128>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <9712c>   DW_AT_low_pc      : 0x466740
    <97134>   DW_AT_high_pc     : 0x83b
    <9713c>   DW_AT_stmt_list   : 0x5b6c5
 <1><97140>: Abbrev Number: 11 (DW_TAG_base_type)
    <97141>   DW_AT_byte_size   : 1
    <97142>   DW_AT_encoding    : 8	(unsigned char)
    <97143>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><97147>: Abbrev Number: 14 (DW_TAG_const_type)
    <97148>   DW_AT_type        : <0x97140>
 <1><9714c>: Abbrev Number: 11 (DW_TAG_base_type)
    <9714d>   DW_AT_byte_size   : 2
    <9714e>   DW_AT_encoding    : 7	(unsigned)
    <9714f>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><97153>: Abbrev Number: 11 (DW_TAG_base_type)
    <97154>   DW_AT_byte_size   : 4
    <97155>   DW_AT_encoding    : 7	(unsigned)
    <97156>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><9715a>: Abbrev Number: 11 (DW_TAG_base_type)
    <9715b>   DW_AT_byte_size   : 8
    <9715c>   DW_AT_encoding    : 7	(unsigned)
    <9715d>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><97161>: Abbrev Number: 11 (DW_TAG_base_type)
    <97162>   DW_AT_byte_size   : 1
    <97163>   DW_AT_encoding    : 6	(signed char)
    <97164>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><97168>: Abbrev Number: 11 (DW_TAG_base_type)
    <97169>   DW_AT_byte_size   : 2
    <9716a>   DW_AT_encoding    : 5	(signed)
    <9716b>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><9716f>: Abbrev Number: 40 (DW_TAG_base_type)
    <97170>   DW_AT_byte_size   : 4
    <97171>   DW_AT_encoding    : 5	(signed)
    <97172>   DW_AT_name        : int
 <1><97176>: Abbrev Number: 41 (DW_TAG_volatile_type)
    <97177>   DW_AT_type        : <0x9716f>
 <1><9717b>: Abbrev Number: 14 (DW_TAG_const_type)
    <9717c>   DW_AT_type        : <0x9716f>
 <1><97180>: Abbrev Number: 11 (DW_TAG_base_type)
    <97181>   DW_AT_byte_size   : 8
    <97182>   DW_AT_encoding    : 5	(signed)
    <97183>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><97187>: Abbrev Number: 42 (DW_TAG_pointer_type)
    <97188>   DW_AT_byte_size   : 8
 <1><97189>: Abbrev Number: 3 (DW_TAG_typedef)
    <9718a>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <9718e>   DW_AT_decl_file   : 2
    <9718f>   DW_AT_decl_line   : 194
    <97190>   DW_AT_decl_column : 27
    <97191>   DW_AT_type        : <0x97180>
 <1><97195>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97196>   DW_AT_byte_size   : 8
    <97196>   DW_AT_type        : <0x9719a>
 <1><9719a>: Abbrev Number: 11 (DW_TAG_base_type)
    <9719b>   DW_AT_byte_size   : 1
    <9719c>   DW_AT_encoding    : 6	(signed char)
    <9719d>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><971a1>: Abbrev Number: 14 (DW_TAG_const_type)
    <971a2>   DW_AT_type        : <0x9719a>
 <1><971a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <971a7>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <971ab>   DW_AT_decl_file   : 3
    <971ac>   DW_AT_decl_line   : 209
    <971ad>   DW_AT_decl_column : 23
    <971ae>   DW_AT_type        : <0x9715a>
 <1><971b2>: Abbrev Number: 25 (DW_TAG_typedef)
    <971b3>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <971b7>   DW_AT_decl_file   : 3
    <971b8>   DW_AT_decl_line   : 321
    <971ba>   DW_AT_decl_column : 24
    <971bb>   DW_AT_type        : <0x9716f>
 <1><971bf>: Abbrev Number: 11 (DW_TAG_base_type)
    <971c0>   DW_AT_byte_size   : 8
    <971c1>   DW_AT_encoding    : 5	(signed)
    <971c2>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><971c6>: Abbrev Number: 3 (DW_TAG_typedef)
    <971c7>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <971cb>   DW_AT_decl_file   : 4
    <971cc>   DW_AT_decl_line   : 108
    <971cd>   DW_AT_decl_column : 19
    <971ce>   DW_AT_type        : <0x97189>
 <1><971d2>: Abbrev Number: 11 (DW_TAG_base_type)
    <971d3>   DW_AT_byte_size   : 8
    <971d4>   DW_AT_encoding    : 7	(unsigned)
    <971d5>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><971d9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <971da>   DW_AT_byte_size   : 8
    <971da>   DW_AT_type        : <0x971a1>
 <1><971de>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <971df>   DW_AT_byte_size   : 8
    <971df>   DW_AT_type        : <0x971e3>
 <1><971e3>: Abbrev Number: 43 (DW_TAG_subroutine_type)
    <971e4>   DW_AT_prototyped  : 1
 <1><971e4>: Abbrev Number: 11 (DW_TAG_base_type)
    <971e5>   DW_AT_byte_size   : 8
    <971e6>   DW_AT_encoding    : 4	(float)
    <971e7>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><971eb>: Abbrev Number: 11 (DW_TAG_base_type)
    <971ec>   DW_AT_byte_size   : 4
    <971ed>   DW_AT_encoding    : 4	(float)
    <971ee>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><971f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <971f3>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <971f7>   DW_AT_decl_file   : 5
    <971f8>   DW_AT_decl_line   : 7
    <971f9>   DW_AT_decl_column : 25
    <971fa>   DW_AT_type        : <0x971fe>
 <1><971fe>: Abbrev Number: 22 (DW_TAG_structure_type)
    <971ff>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <97203>   DW_AT_declaration : 1
 <1><97203>: Abbrev Number: 26 (DW_TAG_structure_type)
    <97204>   DW_AT_byte_size   : 8
    <97205>   DW_AT_decl_file   : 6
    <97206>   DW_AT_decl_line   : 4
    <97207>   DW_AT_decl_column : 3
    <97208>   DW_AT_sibling     : <0x97227>
 <2><9720c>: Abbrev Number: 2 (DW_TAG_member)
    <9720d>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <97211>   DW_AT_decl_file   : 6
    <97212>   DW_AT_decl_line   : 5
    <97213>   DW_AT_decl_column : 8
    <97214>   DW_AT_type        : <0x9716f>
    <97218>   DW_AT_data_member_location: 0
 <2><97219>: Abbrev Number: 2 (DW_TAG_member)
    <9721a>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <9721e>   DW_AT_decl_file   : 6
    <9721f>   DW_AT_decl_line   : 6
    <97220>   DW_AT_decl_column : 8
    <97221>   DW_AT_type        : <0x9716f>
    <97225>   DW_AT_data_member_location: 4
 <2><97226>: Abbrev Number: 0
 <1><97227>: Abbrev Number: 26 (DW_TAG_structure_type)
    <97228>   DW_AT_byte_size   : 16
    <97229>   DW_AT_decl_file   : 6
    <9722a>   DW_AT_decl_line   : 8
    <9722b>   DW_AT_decl_column : 3
    <9722c>   DW_AT_sibling     : <0x9725f>
 <2><97230>: Abbrev Number: 10 (DW_TAG_member)
    <97231>   DW_AT_name        : x
    <97233>   DW_AT_decl_file   : 6
    <97234>   DW_AT_decl_line   : 9
    <97235>   DW_AT_decl_column : 8
    <97236>   DW_AT_type        : <0x9716f>
    <9723a>   DW_AT_data_member_location: 0
 <2><9723b>: Abbrev Number: 10 (DW_TAG_member)
    <9723c>   DW_AT_name        : y
    <9723e>   DW_AT_decl_file   : 6
    <9723f>   DW_AT_decl_line   : 9
    <97240>   DW_AT_decl_column : 11
    <97241>   DW_AT_type        : <0x9716f>
    <97245>   DW_AT_data_member_location: 4
 <2><97246>: Abbrev Number: 10 (DW_TAG_member)
    <97247>   DW_AT_name        : dx
    <9724a>   DW_AT_decl_file   : 6
    <9724b>   DW_AT_decl_line   : 10
    <9724c>   DW_AT_decl_column : 8
    <9724d>   DW_AT_type        : <0x9716f>
    <97251>   DW_AT_data_member_location: 8
 <2><97252>: Abbrev Number: 10 (DW_TAG_member)
    <97253>   DW_AT_name        : dy
    <97256>   DW_AT_decl_file   : 6
    <97257>   DW_AT_decl_line   : 10
    <97258>   DW_AT_decl_column : 12
    <97259>   DW_AT_type        : <0x9716f>
    <9725d>   DW_AT_data_member_location: 12
 <2><9725e>: Abbrev Number: 0
 <1><9725f>: Abbrev Number: 44 (DW_TAG_union_type)
    <97260>   DW_AT_byte_size   : 16
    <97261>   DW_AT_decl_file   : 6
    <97262>   DW_AT_decl_line   : 3
    <97263>   DW_AT_decl_column : 2
    <97264>   DW_AT_sibling     : <0x9728f>
 <2><97268>: Abbrev Number: 29 (DW_TAG_member)
    <97269>   DW_AT_type        : <0x97203>
 <2><9726d>: Abbrev Number: 29 (DW_TAG_member)
    <9726e>   DW_AT_type        : <0x97227>
 <2><97272>: Abbrev Number: 45 (DW_TAG_member)
    <97273>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <97277>   DW_AT_decl_file   : 6
    <97278>   DW_AT_decl_line   : 12
    <97279>   DW_AT_decl_column : 7
    <9727a>   DW_AT_type        : <0x9716f>
 <2><9727e>: Abbrev Number: 30 (DW_TAG_member)
    <9727f>   DW_AT_name        : z
    <97281>   DW_AT_decl_file   : 6
    <97281>   DW_AT_decl_line   : 13
    <97282>   DW_AT_decl_column : 7
    <97282>   DW_AT_type        : <0x9716f>
 <2><97286>: Abbrev Number: 30 (DW_TAG_member)
    <97287>   DW_AT_name        : w
    <97289>   DW_AT_decl_file   : 6
    <97289>   DW_AT_decl_line   : 14
    <9728a>   DW_AT_decl_column : 7
    <9728a>   DW_AT_type        : <0x9716f>
 <2><9728e>: Abbrev Number: 0
 <1><9728f>: Abbrev Number: 20 (DW_TAG_structure_type)
    <97290>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <97294>   DW_AT_byte_size   : 20
    <97295>   DW_AT_decl_file   : 6
    <97296>   DW_AT_decl_line   : 1
    <97297>   DW_AT_decl_column : 8
    <97298>   DW_AT_sibling     : <0x972b0>
 <2><9729c>: Abbrev Number: 2 (DW_TAG_member)
    <9729d>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <972a1>   DW_AT_decl_file   : 6
    <972a2>   DW_AT_decl_line   : 2
    <972a3>   DW_AT_decl_column : 6
    <972a4>   DW_AT_type        : <0x9716f>
    <972a8>   DW_AT_data_member_location: 0
 <2><972a9>: Abbrev Number: 46 (DW_TAG_member)
    <972aa>   DW_AT_type        : <0x9725f>
    <972ae>   DW_AT_data_member_location: 4
 <2><972af>: Abbrev Number: 0
 <1><972b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <972b1>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <972b5>   DW_AT_decl_file   : 6
    <972b6>   DW_AT_decl_line   : 18
    <972b7>   DW_AT_decl_column : 23
    <972b8>   DW_AT_type        : <0x9728f>
 <1><972bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <972bd>   DW_AT_byte_size   : 8
    <972bd>   DW_AT_type        : <0x972c1>
 <1><972c1>: Abbrev Number: 47 (DW_TAG_subroutine_type)
    <972c2>   DW_AT_prototyped  : 1
    <972c2>   DW_AT_type        : <0x9716f>
 <1><972c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <972c7>   DW_AT_byte_size   : 8
    <972c7>   DW_AT_type        : <0x972cb>
 <1><972cb>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <972cc>   DW_AT_prototyped  : 1
    <972cc>   DW_AT_type        : <0x9716f>
    <972d0>   DW_AT_sibling     : <0x972df>
 <2><972d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <972d5>   DW_AT_type        : <0x9716f>
 <2><972d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <972da>   DW_AT_type        : <0x9716f>
 <2><972de>: Abbrev Number: 0
 <1><972df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <972e0>   DW_AT_byte_size   : 8
    <972e0>   DW_AT_type        : <0x9716f>
 <1><972e4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <972e5>   DW_AT_byte_size   : 8
    <972e5>   DW_AT_type        : <0x972e9>
 <1><972e9>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <972ea>   DW_AT_prototyped  : 1
    <972ea>   DW_AT_type        : <0x9716f>
    <972ee>   DW_AT_sibling     : <0x9730c>
 <2><972f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <972f3>   DW_AT_type        : <0x972df>
 <2><972f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <972f8>   DW_AT_type        : <0x972df>
 <2><972fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <972fd>   DW_AT_type        : <0x972df>
 <2><97301>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97302>   DW_AT_type        : <0x972df>
 <2><97306>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97307>   DW_AT_type        : <0x972df>
 <2><9730b>: Abbrev Number: 0
 <1><9730c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9730d>   DW_AT_byte_size   : 8
    <9730d>   DW_AT_type        : <0x972b0>
 <1><97311>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97312>   DW_AT_byte_size   : 8
    <97312>   DW_AT_type        : <0x97140>
 <1><97316>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97317>   DW_AT_byte_size   : 8
    <97317>   DW_AT_type        : <0x97311>
 <1><9731b>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9731c>   DW_AT_prototyped  : 1
    <9731c>   DW_AT_type        : <0x97187>
    <97320>   DW_AT_sibling     : <0x97334>
 <2><97324>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97325>   DW_AT_type        : <0x97187>
 <2><97329>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9732a>   DW_AT_type        : <0x9716f>
 <2><9732e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9732f>   DW_AT_type        : <0x971a6>
 <2><97333>: Abbrev Number: 0
 <1><97334>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97335>   DW_AT_byte_size   : 8
    <97335>   DW_AT_type        : <0x9731b>
 <1><97339>: Abbrev Number: 20 (DW_TAG_structure_type)
    <9733a>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <9733e>   DW_AT_byte_size   : 12
    <9733f>   DW_AT_decl_file   : 7
    <97340>   DW_AT_decl_line   : 139
    <97341>   DW_AT_decl_column : 16
    <97342>   DW_AT_sibling     : <0x9736b>
 <2><97346>: Abbrev Number: 10 (DW_TAG_member)
    <97347>   DW_AT_name        : ch
    <9734a>   DW_AT_decl_file   : 7
    <9734b>   DW_AT_decl_line   : 140
    <9734c>   DW_AT_decl_column : 14
    <9734d>   DW_AT_type        : <0x971b2>
    <97351>   DW_AT_data_member_location: 0
 <2><97352>: Abbrev Number: 10 (DW_TAG_member)
    <97353>   DW_AT_name        : fg
    <97356>   DW_AT_decl_file   : 7
    <97357>   DW_AT_decl_line   : 141
    <97358>   DW_AT_decl_column : 14
    <97359>   DW_AT_type        : <0x97153>
    <9735d>   DW_AT_data_member_location: 4
 <2><9735e>: Abbrev Number: 10 (DW_TAG_member)
    <9735f>   DW_AT_name        : bg
    <97362>   DW_AT_decl_file   : 7
    <97363>   DW_AT_decl_line   : 141
    <97364>   DW_AT_decl_column : 18
    <97365>   DW_AT_type        : <0x97153>
    <97369>   DW_AT_data_member_location: 8
 <2><9736a>: Abbrev Number: 0
 <1><9736b>: Abbrev Number: 3 (DW_TAG_typedef)
    <9736c>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <97370>   DW_AT_decl_file   : 7
    <97371>   DW_AT_decl_line   : 142
    <97372>   DW_AT_decl_column : 3
    <97373>   DW_AT_type        : <0x97339>
 <1><97377>: Abbrev Number: 20 (DW_TAG_structure_type)
    <97378>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <9737c>   DW_AT_byte_size   : 208
    <9737d>   DW_AT_decl_file   : 7
    <9737e>   DW_AT_decl_line   : 144
    <9737f>   DW_AT_decl_column : 16
    <97380>   DW_AT_sibling     : <0x9753a>
 <2><97384>: Abbrev Number: 10 (DW_TAG_member)
    <97385>   DW_AT_name        : id
    <97388>   DW_AT_decl_file   : 7
    <97389>   DW_AT_decl_line   : 146
    <9738a>   DW_AT_decl_column : 6
    <9738b>   DW_AT_type        : <0x9716f>
    <9738f>   DW_AT_data_member_location: 0
 <2><97390>: Abbrev Number: 2 (DW_TAG_member)
    <97391>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <97395>   DW_AT_decl_file   : 7
    <97396>   DW_AT_decl_line   : 147
    <97397>   DW_AT_decl_column : 9
    <97398>   DW_AT_type        : <0x9716f>
    <9739c>   DW_AT_data_member_location: 4
 <2><9739d>: Abbrev Number: 2 (DW_TAG_member)
    <9739e>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <973a2>   DW_AT_decl_file   : 7
    <973a3>   DW_AT_decl_line   : 148
    <973a4>   DW_AT_decl_column : 21
    <973a5>   DW_AT_type        : <0x97316>
    <973a9>   DW_AT_data_member_location: 8
 <2><973aa>: Abbrev Number: 2 (DW_TAG_member)
    <973ab>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <973af>   DW_AT_decl_file   : 7
    <973b0>   DW_AT_decl_line   : 149
    <973b1>   DW_AT_decl_column : 9
    <973b2>   DW_AT_type        : <0x9716f>
    <973b6>   DW_AT_data_member_location: 16
 <2><973b7>: Abbrev Number: 2 (DW_TAG_member)
    <973b8>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <973bc>   DW_AT_decl_file   : 7
    <973bd>   DW_AT_decl_line   : 150
    <973be>   DW_AT_decl_column : 9
    <973bf>   DW_AT_type        : <0x9716f>
    <973c3>   DW_AT_data_member_location: 20
 <2><973c4>: Abbrev Number: 2 (DW_TAG_member)
    <973c5>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <973c9>   DW_AT_decl_file   : 7
    <973ca>   DW_AT_decl_line   : 151
    <973cb>   DW_AT_decl_column : 20
    <973cc>   DW_AT_type        : <0x97311>
    <973d0>   DW_AT_data_member_location: 24
 <2><973d1>: Abbrev Number: 10 (DW_TAG_member)
    <973d2>   DW_AT_name        : w
    <973d4>   DW_AT_decl_file   : 7
    <973d5>   DW_AT_decl_line   : 152
    <973d6>   DW_AT_decl_column : 9
    <973d7>   DW_AT_type        : <0x9716f>
    <973db>   DW_AT_data_member_location: 32
 <2><973dc>: Abbrev Number: 10 (DW_TAG_member)
    <973dd>   DW_AT_name        : h
    <973df>   DW_AT_decl_file   : 7
    <973e0>   DW_AT_decl_line   : 152
    <973e1>   DW_AT_decl_column : 12
    <973e2>   DW_AT_type        : <0x9716f>
    <973e6>   DW_AT_data_member_location: 36
 <2><973e7>: Abbrev Number: 2 (DW_TAG_member)
    <973e8>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <973ec>   DW_AT_decl_file   : 7
    <973ed>   DW_AT_decl_line   : 153
    <973ee>   DW_AT_decl_column : 9
    <973ef>   DW_AT_type        : <0x9716f>
    <973f3>   DW_AT_data_member_location: 40
 <2><973f4>: Abbrev Number: 10 (DW_TAG_member)
    <973f5>   DW_AT_name        : bpp
    <973f9>   DW_AT_decl_file   : 7
    <973fa>   DW_AT_decl_line   : 154
    <973fb>   DW_AT_decl_column : 9
    <973fc>   DW_AT_type        : <0x9716f>
    <97400>   DW_AT_data_member_location: 44
 <2><97401>: Abbrev Number: 2 (DW_TAG_member)
    <97402>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <97406>   DW_AT_decl_file   : 7
    <97407>   DW_AT_decl_line   : 155
    <97408>   DW_AT_decl_column : 9
    <97409>   DW_AT_type        : <0x9716f>
    <9740d>   DW_AT_data_member_location: 48
 <2><9740e>: Abbrev Number: 2 (DW_TAG_member)
    <9740f>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <97413>   DW_AT_decl_file   : 7
    <97414>   DW_AT_decl_line   : 156
    <97415>   DW_AT_decl_column : 19
    <97416>   DW_AT_type        : <0x9753a>
    <9741a>   DW_AT_data_member_location: 56
 <2><9741b>: Abbrev Number: 2 (DW_TAG_member)
    <9741c>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <97420>   DW_AT_decl_file   : 7
    <97421>   DW_AT_decl_line   : 157
    <97422>   DW_AT_decl_column : 19
    <97423>   DW_AT_type        : <0x9753a>
    <97427>   DW_AT_data_member_location: 64
 <2><97428>: Abbrev Number: 2 (DW_TAG_member)
    <97429>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <9742d>   DW_AT_decl_file   : 7
    <9742e>   DW_AT_decl_line   : 158
    <9742f>   DW_AT_decl_column : 20
    <97430>   DW_AT_type        : <0x97311>
    <97434>   DW_AT_data_member_location: 72
 <2><97435>: Abbrev Number: 2 (DW_TAG_member)
    <97436>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <9743a>   DW_AT_decl_file   : 7
    <9743b>   DW_AT_decl_line   : 159
    <9743c>   DW_AT_decl_column : 11
    <9743d>   DW_AT_type        : <0x97195>
    <97441>   DW_AT_data_member_location: 80
 <2><97442>: Abbrev Number: 2 (DW_TAG_member)
    <97443>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <97447>   DW_AT_decl_file   : 7
    <97448>   DW_AT_decl_line   : 160
    <97449>   DW_AT_decl_column : 29
    <9744a>   DW_AT_type        : <0x97610>
    <9744e>   DW_AT_data_member_location: 88
 <2><9744f>: Abbrev Number: 2 (DW_TAG_member)
    <97450>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <97454>   DW_AT_decl_file   : 7
    <97455>   DW_AT_decl_line   : 161
    <97456>   DW_AT_decl_column : 9
    <97457>   DW_AT_type        : <0x9716f>
    <9745b>   DW_AT_data_member_location: 96
 <2><9745c>: Abbrev Number: 2 (DW_TAG_member)
    <9745d>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <97461>   DW_AT_decl_file   : 7
    <97462>   DW_AT_decl_line   : 162
    <97463>   DW_AT_decl_column : 27
    <97464>   DW_AT_type        : <0x97642>
    <97468>   DW_AT_data_member_location: 104
 <2><97469>: Abbrev Number: 2 (DW_TAG_member)
    <9746a>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <9746e>   DW_AT_decl_file   : 7
    <9746f>   DW_AT_decl_line   : 163
    <97470>   DW_AT_decl_column : 9
    <97471>   DW_AT_type        : <0x9716f>
    <97475>   DW_AT_data_member_location: 112
 <2><97476>: Abbrev Number: 2 (DW_TAG_member)
    <97477>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <9747b>   DW_AT_decl_file   : 7
    <9747c>   DW_AT_decl_line   : 164
    <9747d>   DW_AT_decl_column : 9
    <9747e>   DW_AT_type        : <0x9716f>
    <97482>   DW_AT_data_member_location: 116
 <2><97483>: Abbrev Number: 2 (DW_TAG_member)
    <97484>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <97488>   DW_AT_decl_file   : 7
    <97489>   DW_AT_decl_line   : 164
    <9748a>   DW_AT_decl_column : 19
    <9748b>   DW_AT_type        : <0x9716f>
    <9748f>   DW_AT_data_member_location: 120
 <2><97490>: Abbrev Number: 2 (DW_TAG_member)
    <97491>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <97495>   DW_AT_decl_file   : 7
    <97496>   DW_AT_decl_line   : 165
    <97497>   DW_AT_decl_column : 24
    <97498>   DW_AT_type        : <0x9767a>
    <9749c>   DW_AT_data_member_location: 128
 <2><9749d>: Abbrev Number: 2 (DW_TAG_member)
    <9749e>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <974a2>   DW_AT_decl_file   : 7
    <974a3>   DW_AT_decl_line   : 166
    <974a4>   DW_AT_decl_column : 9
    <974a5>   DW_AT_type        : <0x9716f>
    <974a9>   DW_AT_data_member_location: 136
 <2><974aa>: Abbrev Number: 2 (DW_TAG_member)
    <974ab>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <974af>   DW_AT_decl_file   : 7
    <974b0>   DW_AT_decl_line   : 166
    <974b1>   DW_AT_decl_column : 17
    <974b2>   DW_AT_type        : <0x9716f>
    <974b6>   DW_AT_data_member_location: 140
 <2><974b7>: Abbrev Number: 2 (DW_TAG_member)
    <974b8>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <974bc>   DW_AT_decl_file   : 7
    <974bd>   DW_AT_decl_line   : 167
    <974be>   DW_AT_decl_column : 11
    <974bf>   DW_AT_type        : <0x971eb>
    <974c3>   DW_AT_data_member_location: 144
 <2><974c4>: Abbrev Number: 10 (DW_TAG_member)
    <974c5>   DW_AT_name        : key
    <974c9>   DW_AT_decl_file   : 7
    <974ca>   DW_AT_decl_line   : 168
    <974cb>   DW_AT_decl_column : 11
    <974cc>   DW_AT_type        : <0x97195>
    <974d0>   DW_AT_data_member_location: 152
 <2><974d1>: Abbrev Number: 2 (DW_TAG_member)
    <974d2>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <974d6>   DW_AT_decl_file   : 7
    <974d7>   DW_AT_decl_line   : 169
    <974d8>   DW_AT_decl_column : 6
    <974d9>   DW_AT_type        : <0x9716f>
    <974dd>   DW_AT_data_member_location: 160
 <2><974de>: Abbrev Number: 2 (DW_TAG_member)
    <974df>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <974e3>   DW_AT_decl_file   : 7
    <974e4>   DW_AT_decl_line   : 170
    <974e5>   DW_AT_decl_column : 18
    <974e6>   DW_AT_type        : <0x9767f>
    <974ea>   DW_AT_data_member_location: 168
 <2><974eb>: Abbrev Number: 2 (DW_TAG_member)
    <974ec>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <974f0>   DW_AT_decl_file   : 7
    <974f1>   DW_AT_decl_line   : 171
    <974f2>   DW_AT_decl_column : 12
    <974f3>   DW_AT_type        : <0x9730c>
    <974f7>   DW_AT_data_member_location: 176
 <2><974f8>: Abbrev Number: 2 (DW_TAG_member)
    <974f9>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <974fd>   DW_AT_decl_file   : 7
    <974fe>   DW_AT_decl_line   : 172
    <974ff>   DW_AT_decl_column : 9
    <97500>   DW_AT_type        : <0x9716f>
    <97504>   DW_AT_data_member_location: 184
 <2><97505>: Abbrev Number: 2 (DW_TAG_member)
    <97506>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <9750a>   DW_AT_decl_file   : 7
    <9750b>   DW_AT_decl_line   : 172
    <9750c>   DW_AT_decl_column : 21
    <9750d>   DW_AT_type        : <0x9716f>
    <97511>   DW_AT_data_member_location: 188
 <2><97512>: Abbrev Number: 2 (DW_TAG_member)
    <97513>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <97517>   DW_AT_decl_file   : 7
    <97518>   DW_AT_decl_line   : 173
    <97519>   DW_AT_decl_column : 11
    <9751a>   DW_AT_type        : <0x97689>
    <9751e>   DW_AT_data_member_location: 192
 <2><9751f>: Abbrev Number: 2 (DW_TAG_member)
    <97520>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <97524>   DW_AT_decl_file   : 7
    <97525>   DW_AT_decl_line   : 174
    <97526>   DW_AT_decl_column : 15
    <97527>   DW_AT_type        : <0x97176>
    <9752b>   DW_AT_data_member_location: 200
 <2><9752c>: Abbrev Number: 2 (DW_TAG_member)
    <9752d>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <97531>   DW_AT_decl_file   : 7
    <97532>   DW_AT_decl_line   : 175
    <97533>   DW_AT_decl_column : 6
    <97534>   DW_AT_type        : <0x9716f>
    <97538>   DW_AT_data_member_location: 204
 <2><97539>: Abbrev Number: 0
 <1><9753a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9753b>   DW_AT_byte_size   : 8
    <9753b>   DW_AT_type        : <0x97153>
 <1><9753f>: Abbrev Number: 20 (DW_TAG_structure_type)
    <97540>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <97544>   DW_AT_byte_size   : 112
    <97545>   DW_AT_decl_file   : 7
    <97546>   DW_AT_decl_line   : 178
    <97547>   DW_AT_decl_column : 16
    <97548>   DW_AT_sibling     : <0x9760b>
 <2><9754c>: Abbrev Number: 2 (DW_TAG_member)
    <9754d>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <97551>   DW_AT_decl_file   : 7
    <97552>   DW_AT_decl_line   : 188
    <97553>   DW_AT_decl_column : 8
    <97554>   DW_AT_type        : <0x97195>
    <97558>   DW_AT_data_member_location: 0
 <2><97559>: Abbrev Number: 2 (DW_TAG_member)
    <9755a>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <9755e>   DW_AT_decl_file   : 7
    <9755f>   DW_AT_decl_line   : 208
    <97560>   DW_AT_decl_column : 8
    <97561>   DW_AT_type        : <0x976c2>
    <97565>   DW_AT_data_member_location: 8
 <2><97566>: Abbrev Number: 2 (DW_TAG_member)
    <97567>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <9756b>   DW_AT_decl_file   : 7
    <9756c>   DW_AT_decl_line   : 222
    <9756d>   DW_AT_decl_column : 9
    <9756e>   DW_AT_type        : <0x971de>
    <97572>   DW_AT_data_member_location: 16
 <2><97573>: Abbrev Number: 2 (DW_TAG_member)
    <97574>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <97578>   DW_AT_decl_file   : 7
    <97579>   DW_AT_decl_line   : 231
    <9757a>   DW_AT_decl_column : 9
    <9757b>   DW_AT_type        : <0x971de>
    <9757f>   DW_AT_data_member_location: 24
 <2><97580>: Abbrev Number: 2 (DW_TAG_member)
    <97581>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <97585>   DW_AT_decl_file   : 7
    <97586>   DW_AT_decl_line   : 239
    <97587>   DW_AT_decl_column : 9
    <97588>   DW_AT_type        : <0x971de>
    <9758c>   DW_AT_data_member_location: 32
 <2><9758d>: Abbrev Number: 2 (DW_TAG_member)
    <9758e>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <97592>   DW_AT_decl_file   : 7
    <97593>   DW_AT_decl_line   : 248
    <97594>   DW_AT_decl_column : 9
    <97595>   DW_AT_type        : <0x976e1>
    <97599>   DW_AT_data_member_location: 40
 <2><9759a>: Abbrev Number: 6 (DW_TAG_member)
    <9759b>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <9759f>   DW_AT_decl_file   : 7
    <975a0>   DW_AT_decl_line   : 258
    <975a2>   DW_AT_decl_column : 9
    <975a3>   DW_AT_type        : <0x971de>
    <975a7>   DW_AT_data_member_location: 48
 <2><975a8>: Abbrev Number: 6 (DW_TAG_member)
    <975a9>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <975ad>   DW_AT_decl_file   : 7
    <975ae>   DW_AT_decl_line   : 274
    <975b0>   DW_AT_decl_column : 8
    <975b1>   DW_AT_type        : <0x972e4>
    <975b5>   DW_AT_data_member_location: 56
 <2><975b6>: Abbrev Number: 6 (DW_TAG_member)
    <975b7>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <975bb>   DW_AT_decl_file   : 7
    <975bc>   DW_AT_decl_line   : 285
    <975be>   DW_AT_decl_column : 9
    <975bf>   DW_AT_type        : <0x976e1>
    <975c3>   DW_AT_data_member_location: 64
 <2><975c4>: Abbrev Number: 6 (DW_TAG_member)
    <975c5>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <975c9>   DW_AT_decl_file   : 7
    <975ca>   DW_AT_decl_line   : 293
    <975cc>   DW_AT_decl_column : 9
    <975cd>   DW_AT_type        : <0x976f1>
    <975d1>   DW_AT_data_member_location: 72
 <2><975d2>: Abbrev Number: 6 (DW_TAG_member)
    <975d3>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <975d7>   DW_AT_decl_file   : 7
    <975d8>   DW_AT_decl_line   : 301
    <975da>   DW_AT_decl_column : 8
    <975db>   DW_AT_type        : <0x972c6>
    <975df>   DW_AT_data_member_location: 80
 <2><975e0>: Abbrev Number: 6 (DW_TAG_member)
    <975e1>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <975e5>   DW_AT_decl_file   : 7
    <975e6>   DW_AT_decl_line   : 314
    <975e8>   DW_AT_decl_column : 9
    <975e9>   DW_AT_type        : <0x9770a>
    <975ed>   DW_AT_data_member_location: 88
 <2><975ee>: Abbrev Number: 6 (DW_TAG_member)
    <975ef>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <975f3>   DW_AT_decl_file   : 7
    <975f4>   DW_AT_decl_line   : 321
    <975f6>   DW_AT_decl_column : 9
    <975f7>   DW_AT_type        : <0x971de>
    <975fb>   DW_AT_data_member_location: 96
 <2><975fc>: Abbrev Number: 6 (DW_TAG_member)
    <975fd>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <97601>   DW_AT_decl_file   : 7
    <97602>   DW_AT_decl_line   : 328
    <97604>   DW_AT_decl_column : 9
    <97605>   DW_AT_type        : <0x971de>
    <97609>   DW_AT_data_member_location: 104
 <2><9760a>: Abbrev Number: 0
 <1><9760b>: Abbrev Number: 14 (DW_TAG_const_type)
    <9760c>   DW_AT_type        : <0x9753f>
 <1><97610>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97611>   DW_AT_byte_size   : 8
    <97611>   DW_AT_type        : <0x9760b>
 <1><97615>: Abbrev Number: 31 (DW_TAG_structure_type)
    <97616>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <9761a>   DW_AT_byte_size   : 16
    <9761a>   DW_AT_decl_file   : 7
    <9761a>   DW_AT_decl_line   : 331
    <9761c>   DW_AT_decl_column : 16
    <9761c>   DW_AT_sibling     : <0x9763d>
 <2><97620>: Abbrev Number: 6 (DW_TAG_member)
    <97621>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <97625>   DW_AT_decl_file   : 7
    <97626>   DW_AT_decl_line   : 333
    <97628>   DW_AT_decl_column : 12
    <97629>   DW_AT_type        : <0x9717b>
    <9762d>   DW_AT_data_member_location: 0
 <2><9762e>: Abbrev Number: 6 (DW_TAG_member)
    <9762f>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <97633>   DW_AT_decl_file   : 7
    <97634>   DW_AT_decl_line   : 334
    <97636>   DW_AT_decl_column : 23
    <97637>   DW_AT_type        : <0x9771c>
    <9763b>   DW_AT_data_member_location: 8
 <2><9763c>: Abbrev Number: 0
 <1><9763d>: Abbrev Number: 14 (DW_TAG_const_type)
    <9763e>   DW_AT_type        : <0x97615>
 <1><97642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97643>   DW_AT_byte_size   : 8
    <97643>   DW_AT_type        : <0x9763d>
 <1><97647>: Abbrev Number: 31 (DW_TAG_structure_type)
    <97648>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <9764c>   DW_AT_byte_size   : 16
    <9764c>   DW_AT_decl_file   : 7
    <9764c>   DW_AT_decl_line   : 337
    <9764e>   DW_AT_decl_column : 16
    <9764e>   DW_AT_sibling     : <0x97675>
 <2><97652>: Abbrev Number: 32 (DW_TAG_member)
    <97653>   DW_AT_name        : w
    <97655>   DW_AT_decl_file   : 7
    <97655>   DW_AT_decl_line   : 339
    <97657>   DW_AT_decl_column : 15
    <97657>   DW_AT_type        : <0x9717b>
    <9765b>   DW_AT_data_member_location: 0
 <2><9765c>: Abbrev Number: 32 (DW_TAG_member)
    <9765d>   DW_AT_name        : h
    <9765f>   DW_AT_decl_file   : 7
    <9765f>   DW_AT_decl_line   : 340
    <97661>   DW_AT_decl_column : 15
    <97661>   DW_AT_type        : <0x9717b>
    <97665>   DW_AT_data_member_location: 4
 <2><97666>: Abbrev Number: 6 (DW_TAG_member)
    <97667>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <9766b>   DW_AT_decl_file   : 7
    <9766c>   DW_AT_decl_line   : 341
    <9766e>   DW_AT_decl_column : 23
    <9766f>   DW_AT_type        : <0x9771c>
    <97673>   DW_AT_data_member_location: 8
 <2><97674>: Abbrev Number: 0
 <1><97675>: Abbrev Number: 14 (DW_TAG_const_type)
    <97676>   DW_AT_type        : <0x97647>
 <1><9767a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9767b>   DW_AT_byte_size   : 8
    <9767b>   DW_AT_type        : <0x97675>
 <1><9767f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97680>   DW_AT_byte_size   : 8
    <97680>   DW_AT_type        : <0x97684>
 <1><97684>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97685>   DW_AT_byte_size   : 8
    <97685>   DW_AT_type        : <0x9736b>
 <1><97689>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9768a>   DW_AT_byte_size   : 8
    <9768a>   DW_AT_type        : <0x971f2>
 <1><9768e>: Abbrev Number: 3 (DW_TAG_typedef)
    <9768f>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <97693>   DW_AT_decl_file   : 7
    <97694>   DW_AT_decl_line   : 176
    <97695>   DW_AT_decl_column : 3
    <97696>   DW_AT_type        : <0x97377>
 <1><9769a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9769b>   DW_AT_prototyped  : 1
    <9769b>   DW_AT_type        : <0x9716f>
    <9769f>   DW_AT_sibling     : <0x976c2>
 <2><976a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976a4>   DW_AT_type        : <0x97195>
 <2><976a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976a9>   DW_AT_type        : <0x9716f>
 <2><976ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976ae>   DW_AT_type        : <0x9716f>
 <2><976b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976b3>   DW_AT_type        : <0x9716f>
 <2><976b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976b8>   DW_AT_type        : <0x9716f>
 <2><976bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976bd>   DW_AT_type        : <0x9716f>
 <2><976c1>: Abbrev Number: 0
 <1><976c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <976c3>   DW_AT_byte_size   : 8
    <976c3>   DW_AT_type        : <0x9769a>
 <1><976c7>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <976c8>   DW_AT_prototyped  : 1
    <976c8>   DW_AT_sibling     : <0x976e1>
 <2><976cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976cd>   DW_AT_type        : <0x9716f>
 <2><976d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976d2>   DW_AT_type        : <0x9716f>
 <2><976d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976d7>   DW_AT_type        : <0x9716f>
 <2><976db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976dc>   DW_AT_type        : <0x9716f>
 <2><976e0>: Abbrev Number: 0
 <1><976e1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <976e2>   DW_AT_byte_size   : 8
    <976e2>   DW_AT_type        : <0x976c7>
 <1><976e6>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <976e7>   DW_AT_prototyped  : 1
    <976e7>   DW_AT_sibling     : <0x976f1>
 <2><976eb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <976ec>   DW_AT_type        : <0x97195>
 <2><976f0>: Abbrev Number: 0
 <1><976f1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <976f2>   DW_AT_byte_size   : 8
    <976f2>   DW_AT_type        : <0x976e6>
 <1><976f6>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <976f7>   DW_AT_prototyped  : 1
    <976f7>   DW_AT_type        : <0x972df>
    <976fb>   DW_AT_sibling     : <0x9770a>
 <2><976ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97700>   DW_AT_type        : <0x9716f>
 <2><97704>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97705>   DW_AT_type        : <0x972df>
 <2><97709>: Abbrev Number: 0
 <1><9770a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9770b>   DW_AT_byte_size   : 8
    <9770b>   DW_AT_type        : <0x976f6>
 <1><9770f>: Abbrev Number: 25 (DW_TAG_typedef)
    <97710>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <97714>   DW_AT_decl_file   : 7
    <97715>   DW_AT_decl_line   : 329
    <97717>   DW_AT_decl_column : 3
    <97718>   DW_AT_type        : <0x9753f>
 <1><9771c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9771d>   DW_AT_byte_size   : 8
    <9771d>   DW_AT_type        : <0x97147>
 <1><97721>: Abbrev Number: 33 (DW_TAG_variable)
    <97722>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <97726>   DW_AT_decl_file   : 7
    <97726>   DW_AT_decl_line   : 364
    <97728>   DW_AT_decl_column : 15
    <97729>   DW_AT_type        : <0x9772d>
    <9772d>   DW_AT_external    : 1
    <9772d>   DW_AT_declaration : 1
 <1><9772d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9772e>   DW_AT_byte_size   : 8
    <9772e>   DW_AT_type        : <0x9768e>
 <1><97732>: Abbrev Number: 33 (DW_TAG_variable)
    <97733>   DW_AT_name        : (indirect string, offset: 0x166c4): fb_hMemSet
    <97737>   DW_AT_decl_file   : 7
    <97737>   DW_AT_decl_line   : 369
    <97739>   DW_AT_decl_column : 16
    <9773a>   DW_AT_type        : <0x97334>
    <9773e>   DW_AT_external    : 1
    <9773e>   DW_AT_declaration : 1
 <1><9773e>: Abbrev Number: 34 (DW_TAG_enumeration_type)
    <9773f>   DW_AT_encoding    : 7	(void)
    <9773f>   DW_AT_byte_size   : 4
    <9773f>   DW_AT_type        : <0x97153>
    <97743>   DW_AT_decl_file   : 7
    <97743>   DW_AT_decl_line   : 376
    <97745>   DW_AT_decl_column : 6
    <97745>   DW_AT_sibling     : <0x97762>
 <2><97749>: Abbrev Number: 15 (DW_TAG_enumerator)
    <9774a>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <9774e>   DW_AT_const_value : 0
 <2><9774f>: Abbrev Number: 15 (DW_TAG_enumerator)
    <97750>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <97754>   DW_AT_const_value : 1
 <2><97755>: Abbrev Number: 15 (DW_TAG_enumerator)
    <97756>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <9775a>   DW_AT_const_value : 2
 <2><9775b>: Abbrev Number: 15 (DW_TAG_enumerator)
    <9775c>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <97760>   DW_AT_const_value : 3
 <2><97761>: Abbrev Number: 0
 <1><97762>: Abbrev Number: 34 (DW_TAG_enumeration_type)
    <97763>   DW_AT_encoding    : 7	(void)
    <97763>   DW_AT_byte_size   : 4
    <97763>   DW_AT_type        : <0x97153>
    <97767>   DW_AT_decl_file   : 7
    <97767>   DW_AT_decl_line   : 384
    <97769>   DW_AT_decl_column : 6
    <97769>   DW_AT_sibling     : <0x9778c>
 <2><9776d>: Abbrev Number: 15 (DW_TAG_enumerator)
    <9776e>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <97772>   DW_AT_const_value : 0
 <2><97773>: Abbrev Number: 15 (DW_TAG_enumerator)
    <97774>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <97778>   DW_AT_const_value : 1
 <2><97779>: Abbrev Number: 15 (DW_TAG_enumerator)
    <9777a>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <9777e>   DW_AT_const_value : 2
 <2><9777f>: Abbrev Number: 15 (DW_TAG_enumerator)
    <97780>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <97784>   DW_AT_const_value : 3
 <2><97785>: Abbrev Number: 15 (DW_TAG_enumerator)
    <97786>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <9778a>   DW_AT_const_value : 4
 <2><9778b>: Abbrev Number: 0
 <1><9778c>: Abbrev Number: 35 (DW_TAG_typedef)
    <9778d>   DW_AT_name        : XID
    <97791>   DW_AT_decl_file   : 8
    <97792>   DW_AT_decl_line   : 66
    <97793>   DW_AT_decl_column : 23
    <97794>   DW_AT_type        : <0x9715a>
 <1><97798>: Abbrev Number: 3 (DW_TAG_typedef)
    <97799>   DW_AT_name        : (indirect string, offset: 0x18bdd): VisualID
    <9779d>   DW_AT_decl_file   : 8
    <9779e>   DW_AT_decl_line   : 76
    <9779f>   DW_AT_decl_column : 23
    <977a0>   DW_AT_type        : <0x9715a>
 <1><977a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <977a5>   DW_AT_name        : (indirect string, offset: 0x18e45): Window
    <977a9>   DW_AT_decl_file   : 8
    <977aa>   DW_AT_decl_line   : 96
    <977ab>   DW_AT_decl_column : 13
    <977ac>   DW_AT_type        : <0x9778c>
 <1><977b0>: Abbrev Number: 11 (DW_TAG_base_type)
    <977b1>   DW_AT_byte_size   : 16
    <977b2>   DW_AT_encoding    : 4	(float)
    <977b3>   DW_AT_name        : (indirect string, offset: 0x184ef): long double
 <1><977b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <977b8>   DW_AT_name        : (indirect string, offset: 0x19ba7): XPointer
    <977bc>   DW_AT_decl_file   : 9
    <977bd>   DW_AT_decl_line   : 80
    <977be>   DW_AT_decl_column : 15
    <977bf>   DW_AT_type        : <0x97195>
 <1><977c3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <977c4>   DW_AT_name        : (indirect string, offset: 0x19a2b): _XExtData
    <977c8>   DW_AT_byte_size   : 32
    <977c9>   DW_AT_decl_file   : 9
    <977ca>   DW_AT_decl_line   : 148
    <977cb>   DW_AT_decl_column : 16
    <977cc>   DW_AT_sibling     : <0x97805>
 <2><977d0>: Abbrev Number: 2 (DW_TAG_member)
    <977d1>   DW_AT_name        : (indirect string, offset: 0x18b66): number
    <977d5>   DW_AT_decl_file   : 9
    <977d6>   DW_AT_decl_line   : 149
    <977d7>   DW_AT_decl_column : 6
    <977d8>   DW_AT_type        : <0x9716f>
    <977dc>   DW_AT_data_member_location: 0
 <2><977dd>: Abbrev Number: 2 (DW_TAG_member)
    <977de>   DW_AT_name        : (indirect string, offset: 0x190a5): next
    <977e2>   DW_AT_decl_file   : 9
    <977e3>   DW_AT_decl_line   : 150
    <977e4>   DW_AT_decl_column : 20
    <977e5>   DW_AT_type        : <0x97805>
    <977e9>   DW_AT_data_member_location: 8
 <2><977ea>: Abbrev Number: 2 (DW_TAG_member)
    <977eb>   DW_AT_name        : (indirect string, offset: 0x19b3f): free_private
    <977ef>   DW_AT_decl_file   : 9
    <977f0>   DW_AT_decl_line   : 151
    <977f1>   DW_AT_decl_column : 8
    <977f2>   DW_AT_type        : <0x97819>
    <977f6>   DW_AT_data_member_location: 16
 <2><977f7>: Abbrev Number: 2 (DW_TAG_member)
    <977f8>   DW_AT_name        : (indirect string, offset: 0x1873c): private_data
    <977fc>   DW_AT_decl_file   : 9
    <977fd>   DW_AT_decl_line   : 154
    <977fe>   DW_AT_decl_column : 11
    <977ff>   DW_AT_type        : <0x977b7>
    <97803>   DW_AT_data_member_location: 24
 <2><97804>: Abbrev Number: 0
 <1><97805>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97806>   DW_AT_byte_size   : 8
    <97806>   DW_AT_type        : <0x977c3>
 <1><9780a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <9780b>   DW_AT_prototyped  : 1
    <9780b>   DW_AT_type        : <0x9716f>
    <9780f>   DW_AT_sibling     : <0x97819>
 <2><97813>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97814>   DW_AT_type        : <0x97805>
 <2><97818>: Abbrev Number: 0
 <1><97819>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9781a>   DW_AT_byte_size   : 8
    <9781a>   DW_AT_type        : <0x9780a>
 <1><9781e>: Abbrev Number: 3 (DW_TAG_typedef)
    <9781f>   DW_AT_name        : (indirect string, offset: 0x19a2c): XExtData
    <97823>   DW_AT_decl_file   : 9
    <97824>   DW_AT_decl_line   : 155
    <97825>   DW_AT_decl_column : 3
    <97826>   DW_AT_type        : <0x977c3>
 <1><9782a>: Abbrev Number: 35 (DW_TAG_typedef)
    <9782b>   DW_AT_name        : GC
    <9782e>   DW_AT_decl_file   : 9
    <9782f>   DW_AT_decl_line   : 222
    <97830>   DW_AT_decl_column : 2
    <97831>   DW_AT_type        : <0x97835>
 <1><97835>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97836>   DW_AT_byte_size   : 8
    <97836>   DW_AT_type        : <0x9783a>
 <1><9783a>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9783b>   DW_AT_name        : (indirect string, offset: 0x196cf): _XGC
    <9783f>   DW_AT_declaration : 1
 <1><9783f>: Abbrev Number: 26 (DW_TAG_structure_type)
    <97840>   DW_AT_byte_size   : 56
    <97841>   DW_AT_decl_file   : 9
    <97842>   DW_AT_decl_line   : 227
    <97843>   DW_AT_decl_column : 9
    <97844>   DW_AT_sibling     : <0x978b1>
 <2><97848>: Abbrev Number: 2 (DW_TAG_member)
    <97849>   DW_AT_name        : (indirect string, offset: 0x18c93): ext_data
    <9784d>   DW_AT_decl_file   : 9
    <9784e>   DW_AT_decl_line   : 228
    <9784f>   DW_AT_decl_column : 12
    <97850>   DW_AT_type        : <0x978b1>
    <97854>   DW_AT_data_member_location: 0
 <2><97855>: Abbrev Number: 2 (DW_TAG_member)
    <97856>   DW_AT_name        : (indirect string, offset: 0x18bd4): visualid
    <9785a>   DW_AT_decl_file   : 9
    <9785b>   DW_AT_decl_line   : 229
    <9785c>   DW_AT_decl_column : 11
    <9785d>   DW_AT_type        : <0x97798>
    <97861>   DW_AT_data_member_location: 8
 <2><97862>: Abbrev Number: 2 (DW_TAG_member)
    <97863>   DW_AT_name        : (indirect string, offset: 0x18ab7): class
    <97867>   DW_AT_decl_file   : 9
    <97868>   DW_AT_decl_line   : 233
    <97869>   DW_AT_decl_column : 6
    <9786a>   DW_AT_type        : <0x9716f>
    <9786e>   DW_AT_data_member_location: 16
 <2><9786f>: Abbrev Number: 2 (DW_TAG_member)
    <97870>   DW_AT_name        : (indirect string, offset: 0x18d79): red_mask
    <97874>   DW_AT_decl_file   : 9
    <97875>   DW_AT_decl_line   : 235
    <97876>   DW_AT_decl_column : 16
    <97877>   DW_AT_type        : <0x9715a>
    <9787b>   DW_AT_data_member_location: 24
 <2><9787c>: Abbrev Number: 2 (DW_TAG_member)
    <9787d>   DW_AT_name        : (indirect string, offset: 0x185d1): green_mask
    <97881>   DW_AT_decl_file   : 9
    <97882>   DW_AT_decl_line   : 235
    <97883>   DW_AT_decl_column : 26
    <97884>   DW_AT_type        : <0x9715a>
    <97888>   DW_AT_data_member_location: 32
 <2><97889>: Abbrev Number: 2 (DW_TAG_member)
    <9788a>   DW_AT_name        : (indirect string, offset: 0x19307): blue_mask
    <9788e>   DW_AT_decl_file   : 9
    <9788f>   DW_AT_decl_line   : 235
    <97890>   DW_AT_decl_column : 38
    <97891>   DW_AT_type        : <0x9715a>
    <97895>   DW_AT_data_member_location: 40
 <2><97896>: Abbrev Number: 2 (DW_TAG_member)
    <97897>   DW_AT_name        : (indirect string, offset: 0x1994e): bits_per_rgb
    <9789b>   DW_AT_decl_file   : 9
    <9789c>   DW_AT_decl_line   : 236
    <9789d>   DW_AT_decl_column : 6
    <9789e>   DW_AT_type        : <0x9716f>
    <978a2>   DW_AT_data_member_location: 48
 <2><978a3>: Abbrev Number: 2 (DW_TAG_member)
    <978a4>   DW_AT_name        : (indirect string, offset: 0x1883a): map_entries
    <978a8>   DW_AT_decl_file   : 9
    <978a9>   DW_AT_decl_line   : 237
    <978aa>   DW_AT_decl_column : 6
    <978ab>   DW_AT_type        : <0x9716f>
    <978af>   DW_AT_data_member_location: 52
 <2><978b0>: Abbrev Number: 0
 <1><978b1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <978b2>   DW_AT_byte_size   : 8
    <978b2>   DW_AT_type        : <0x9781e>
 <1><978b6>: Abbrev Number: 3 (DW_TAG_typedef)
    <978b7>   DW_AT_name        : (indirect string, offset: 0x1a37a): Visual
    <978bb>   DW_AT_decl_file   : 9
    <978bc>   DW_AT_decl_line   : 238
    <978bd>   DW_AT_decl_column : 3
    <978be>   DW_AT_type        : <0x9783f>
 <1><978c2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <978c3>   DW_AT_byte_size   : 8
    <978c3>   DW_AT_type        : <0x978b6>
 <1><978c7>: Abbrev Number: 22 (DW_TAG_structure_type)
    <978c8>   DW_AT_name        : (indirect string, offset: 0x18d82): _XDisplay
    <978cc>   DW_AT_declaration : 1
 <1><978cc>: Abbrev Number: 25 (DW_TAG_typedef)
    <978cd>   DW_AT_name        : (indirect string, offset: 0x18d84): Display
    <978d1>   DW_AT_decl_file   : 9
    <978d2>   DW_AT_decl_line   : 487
    <978d4>   DW_AT_decl_column : 26
    <978d5>   DW_AT_type        : <0x978c7>
 <1><978d9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <978da>   DW_AT_byte_size   : 8
    <978da>   DW_AT_type        : <0x978cc>
 <1><978de>: Abbrev Number: 48 (DW_TAG_structure_type)
    <978df>   DW_AT_byte_size   : 64
    <978e0>   DW_AT_decl_file   : 10
    <978e1>   DW_AT_decl_line   : 287
    <978e3>   DW_AT_decl_column : 9
    <978e4>   DW_AT_sibling     : <0x97975>
 <2><978e8>: Abbrev Number: 6 (DW_TAG_member)
    <978e9>   DW_AT_name        : (indirect string, offset: 0x18ad5): visual
    <978ed>   DW_AT_decl_file   : 10
    <978ee>   DW_AT_decl_line   : 288
    <978f0>   DW_AT_decl_column : 11
    <978f1>   DW_AT_type        : <0x978c2>
    <978f5>   DW_AT_data_member_location: 0
 <2><978f6>: Abbrev Number: 6 (DW_TAG_member)
    <978f7>   DW_AT_name        : (indirect string, offset: 0x18bd4): visualid
    <978fb>   DW_AT_decl_file   : 10
    <978fc>   DW_AT_decl_line   : 289
    <978fe>   DW_AT_decl_column : 12
    <978ff>   DW_AT_type        : <0x97798>
    <97903>   DW_AT_data_member_location: 8
 <2><97904>: Abbrev Number: 6 (DW_TAG_member)
    <97905>   DW_AT_name        : (indirect string, offset: 0x192fb): screen
    <97909>   DW_AT_decl_file   : 10
    <9790a>   DW_AT_decl_line   : 290
    <9790c>   DW_AT_decl_column : 7
    <9790d>   DW_AT_type        : <0x9716f>
    <97911>   DW_AT_data_member_location: 16
 <2><97912>: Abbrev Number: 6 (DW_TAG_member)
    <97913>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <97917>   DW_AT_decl_file   : 10
    <97918>   DW_AT_decl_line   : 291
    <9791a>   DW_AT_decl_column : 7
    <9791b>   DW_AT_type        : <0x9716f>
    <9791f>   DW_AT_data_member_location: 20
 <2><97920>: Abbrev Number: 6 (DW_TAG_member)
    <97921>   DW_AT_name        : (indirect string, offset: 0x18ab7): class
    <97925>   DW_AT_decl_file   : 10
    <97926>   DW_AT_decl_line   : 295
    <97928>   DW_AT_decl_column : 7
    <97929>   DW_AT_type        : <0x9716f>
    <9792d>   DW_AT_data_member_location: 24
 <2><9792e>: Abbrev Number: 6 (DW_TAG_member)
    <9792f>   DW_AT_name        : (indirect string, offset: 0x18d79): red_mask
    <97933>   DW_AT_decl_file   : 10
    <97934>   DW_AT_decl_line   : 297
    <97936>   DW_AT_decl_column : 17
    <97937>   DW_AT_type        : <0x9715a>
    <9793b>   DW_AT_data_member_location: 32
 <2><9793c>: Abbrev Number: 6 (DW_TAG_member)
    <9793d>   DW_AT_name        : (indirect string, offset: 0x185d1): green_mask
    <97941>   DW_AT_decl_file   : 10
    <97942>   DW_AT_decl_line   : 298
    <97944>   DW_AT_decl_column : 17
    <97945>   DW_AT_type        : <0x9715a>
    <97949>   DW_AT_data_member_location: 40
 <2><9794a>: Abbrev Number: 6 (DW_TAG_member)
    <9794b>   DW_AT_name        : (indirect string, offset: 0x19307): blue_mask
    <9794f>   DW_AT_decl_file   : 10
    <97950>   DW_AT_decl_line   : 299
    <97952>   DW_AT_decl_column : 17
    <97953>   DW_AT_type        : <0x9715a>
    <97957>   DW_AT_data_member_location: 48
 <2><97958>: Abbrev Number: 6 (DW_TAG_member)
    <97959>   DW_AT_name        : (indirect string, offset: 0x1a402): colormap_size
    <9795d>   DW_AT_decl_file   : 10
    <9795e>   DW_AT_decl_line   : 300
    <97960>   DW_AT_decl_column : 7
    <97961>   DW_AT_type        : <0x9716f>
    <97965>   DW_AT_data_member_location: 56
 <2><97966>: Abbrev Number: 6 (DW_TAG_member)
    <97967>   DW_AT_name        : (indirect string, offset: 0x1994e): bits_per_rgb
    <9796b>   DW_AT_decl_file   : 10
    <9796c>   DW_AT_decl_line   : 301
    <9796e>   DW_AT_decl_column : 7
    <9796f>   DW_AT_type        : <0x9716f>
    <97973>   DW_AT_data_member_location: 60
 <2><97974>: Abbrev Number: 0
 <1><97975>: Abbrev Number: 25 (DW_TAG_typedef)
    <97976>   DW_AT_name        : (indirect string, offset: 0x1a3b0): XVisualInfo
    <9797a>   DW_AT_decl_file   : 10
    <9797b>   DW_AT_decl_line   : 302
    <9797d>   DW_AT_decl_column : 3
    <9797e>   DW_AT_type        : <0x978de>
 <1><97982>: Abbrev Number: 3 (DW_TAG_typedef)
    <97983>   DW_AT_name        : (indirect string, offset: 0x18b7c): XRRScreenConfiguration
    <97987>   DW_AT_decl_file   : 11
    <97988>   DW_AT_decl_line   : 158
    <97989>   DW_AT_decl_column : 40
    <9798a>   DW_AT_type        : <0x9798e>
 <1><9798e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9798f>   DW_AT_name        : (indirect string, offset: 0x18b7b): _XRRScreenConfiguration
    <97993>   DW_AT_declaration : 1
 <1><97993>: Abbrev Number: 20 (DW_TAG_structure_type)
    <97994>   DW_AT_name        : (indirect string, offset: 0x19779): X11DRIVER
    <97998>   DW_AT_byte_size   : 128
    <97999>   DW_AT_decl_file   : 12
    <9799a>   DW_AT_decl_line   : 19
    <9799b>   DW_AT_decl_column : 16
    <9799c>   DW_AT_sibling     : <0x97a93>
 <2><979a0>: Abbrev Number: 2 (DW_TAG_member)
    <979a1>   DW_AT_name        : (indirect string, offset: 0x19c66): display
    <979a5>   DW_AT_decl_file   : 12
    <979a6>   DW_AT_decl_line   : 21
    <979a7>   DW_AT_decl_column : 11
    <979a8>   DW_AT_type        : <0x978d9>
    <979ac>   DW_AT_data_member_location: 0
 <2><979ad>: Abbrev Number: 2 (DW_TAG_member)
    <979ae>   DW_AT_name        : (indirect string, offset: 0x18ad5): visual
    <979b2>   DW_AT_decl_file   : 12
    <979b3>   DW_AT_decl_line   : 22
    <979b4>   DW_AT_decl_column : 10
    <979b5>   DW_AT_type        : <0x978c2>
    <979b9>   DW_AT_data_member_location: 8
 <2><979ba>: Abbrev Number: 2 (DW_TAG_member)
    <979bb>   DW_AT_name        : (indirect string, offset: 0x192fb): screen
    <979bf>   DW_AT_decl_file   : 12
    <979c0>   DW_AT_decl_line   : 23
    <979c1>   DW_AT_decl_column : 6
    <979c2>   DW_AT_type        : <0x9716f>
    <979c6>   DW_AT_data_member_location: 16
 <2><979c7>: Abbrev Number: 2 (DW_TAG_member)
    <979c8>   DW_AT_name        : (indirect string, offset: 0x19a84): window
    <979cc>   DW_AT_decl_file   : 12
    <979cd>   DW_AT_decl_line   : 24
    <979ce>   DW_AT_decl_column : 9
    <979cf>   DW_AT_type        : <0x977a4>
    <979d3>   DW_AT_data_member_location: 24
 <2><979d4>: Abbrev Number: 2 (DW_TAG_member)
    <979d5>   DW_AT_name        : (indirect string, offset: 0x1980a): wmwindow
    <979d9>   DW_AT_decl_file   : 12
    <979da>   DW_AT_decl_line   : 25
    <979db>   DW_AT_decl_column : 9
    <979dc>   DW_AT_type        : <0x977a4>
    <979e0>   DW_AT_data_member_location: 32
 <2><979e1>: Abbrev Number: 2 (DW_TAG_member)
    <979e2>   DW_AT_name        : (indirect string, offset: 0x18bf1): fswindow
    <979e6>   DW_AT_decl_file   : 12
    <979e7>   DW_AT_decl_line   : 26
    <979e8>   DW_AT_decl_column : 9
    <979e9>   DW_AT_type        : <0x977a4>
    <979ed>   DW_AT_data_member_location: 40
 <2><979ee>: Abbrev Number: 10 (DW_TAG_member)
    <979ef>   DW_AT_name        : gc
    <979f2>   DW_AT_decl_file   : 12
    <979f3>   DW_AT_decl_line   : 27
    <979f4>   DW_AT_decl_column : 5
    <979f5>   DW_AT_type        : <0x9782a>
    <979f9>   DW_AT_data_member_location: 48
 <2><979fa>: Abbrev Number: 2 (DW_TAG_member)
    <979fb>   DW_AT_name        : (indirect string, offset: 0x19670): config
    <979ff>   DW_AT_decl_file   : 12
    <97a00>   DW_AT_decl_line   : 28
    <97a01>   DW_AT_decl_column : 26
    <97a02>   DW_AT_type        : <0x97a93>
    <97a06>   DW_AT_data_member_location: 56
 <2><97a07>: Abbrev Number: 10 (DW_TAG_member)
    <97a08>   DW_AT_name        : w
    <97a0a>   DW_AT_decl_file   : 12
    <97a0b>   DW_AT_decl_line   : 29
    <97a0c>   DW_AT_decl_column : 6
    <97a0d>   DW_AT_type        : <0x9716f>
    <97a11>   DW_AT_data_member_location: 64
 <2><97a12>: Abbrev Number: 10 (DW_TAG_member)
    <97a13>   DW_AT_name        : h
    <97a15>   DW_AT_decl_file   : 12
    <97a16>   DW_AT_decl_line   : 29
    <97a17>   DW_AT_decl_column : 9
    <97a18>   DW_AT_type        : <0x9716f>
    <97a1c>   DW_AT_data_member_location: 68
 <2><97a1d>: Abbrev Number: 2 (DW_TAG_member)
    <97a1e>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <97a22>   DW_AT_decl_file   : 12
    <97a23>   DW_AT_decl_line   : 29
    <97a24>   DW_AT_decl_column : 12
    <97a25>   DW_AT_type        : <0x9716f>
    <97a29>   DW_AT_data_member_location: 72
 <2><97a2a>: Abbrev Number: 2 (DW_TAG_member)
    <97a2b>   DW_AT_name        : (indirect string, offset: 0x18db4): visual_depth
    <97a2f>   DW_AT_decl_file   : 12
    <97a30>   DW_AT_decl_line   : 29
    <97a31>   DW_AT_decl_column : 19
    <97a32>   DW_AT_type        : <0x9716f>
    <97a36>   DW_AT_data_member_location: 76
 <2><97a37>: Abbrev Number: 2 (DW_TAG_member)
    <97a38>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <97a3c>   DW_AT_decl_file   : 12
    <97a3d>   DW_AT_decl_line   : 29
    <97a3e>   DW_AT_decl_column : 33
    <97a3f>   DW_AT_type        : <0x9716f>
    <97a43>   DW_AT_data_member_location: 80
 <2><97a44>: Abbrev Number: 2 (DW_TAG_member)
    <97a45>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <97a49>   DW_AT_decl_file   : 12
    <97a4a>   DW_AT_decl_line   : 30
    <97a4b>   DW_AT_decl_column : 6
    <97a4c>   DW_AT_type        : <0x9716f>
    <97a50>   DW_AT_data_member_location: 84
 <2><97a51>: Abbrev Number: 2 (DW_TAG_member)
    <97a52>   DW_AT_name        : (indirect string, offset: 0x18dff): display_offset
    <97a56>   DW_AT_decl_file   : 12
    <97a57>   DW_AT_decl_line   : 30
    <97a58>   DW_AT_decl_column : 20
    <97a59>   DW_AT_type        : <0x9716f>
    <97a5d>   DW_AT_data_member_location: 88
 <2><97a5e>: Abbrev Number: 2 (DW_TAG_member)
    <97a5f>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <97a63>   DW_AT_decl_file   : 12
    <97a64>   DW_AT_decl_line   : 31
    <97a65>   DW_AT_decl_column : 8
    <97a66>   DW_AT_type        : <0x972bc>
    <97a6a>   DW_AT_data_member_location: 96
 <2><97a6b>: Abbrev Number: 2 (DW_TAG_member)
    <97a6c>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <97a70>   DW_AT_decl_file   : 12
    <97a71>   DW_AT_decl_line   : 32
    <97a72>   DW_AT_decl_column : 9
    <97a73>   DW_AT_type        : <0x971de>
    <97a77>   DW_AT_data_member_location: 104
 <2><97a78>: Abbrev Number: 2 (DW_TAG_member)
    <97a79>   DW_AT_name        : (indirect string, offset: 0x1a6d4): update
    <97a7d>   DW_AT_decl_file   : 12
    <97a7e>   DW_AT_decl_line   : 33
    <97a7f>   DW_AT_decl_column : 9
    <97a80>   DW_AT_type        : <0x971de>
    <97a84>   DW_AT_data_member_location: 112
 <2><97a85>: Abbrev Number: 2 (DW_TAG_member)
    <97a86>   DW_AT_name        : (indirect string, offset: 0x19423): mouse_clip
    <97a8a>   DW_AT_decl_file   : 12
    <97a8b>   DW_AT_decl_line   : 34
    <97a8c>   DW_AT_decl_column : 6
    <97a8d>   DW_AT_type        : <0x9716f>
    <97a91>   DW_AT_data_member_location: 120
 <2><97a92>: Abbrev Number: 0
 <1><97a93>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97a94>   DW_AT_byte_size   : 8
    <97a94>   DW_AT_type        : <0x97982>
 <1><97a98>: Abbrev Number: 3 (DW_TAG_typedef)
    <97a99>   DW_AT_name        : (indirect string, offset: 0x19779): X11DRIVER
    <97a9d>   DW_AT_decl_file   : 12
    <97a9e>   DW_AT_decl_line   : 35
    <97a9f>   DW_AT_decl_column : 3
    <97aa0>   DW_AT_type        : <0x97993>
 <1><97aa4>: Abbrev Number: 27 (DW_TAG_variable)
    <97aa5>   DW_AT_name        : (indirect string, offset: 0x193eb): fb_x11
    <97aa9>   DW_AT_decl_file   : 12
    <97aaa>   DW_AT_decl_line   : 38
    <97aab>   DW_AT_decl_column : 18
    <97aac>   DW_AT_type        : <0x97a98>
    <97ab0>   DW_AT_external    : 1
    <97ab0>   DW_AT_declaration : 1
 <1><97ab0>: Abbrev Number: 27 (DW_TAG_variable)
    <97ab1>   DW_AT_name        : (indirect string, offset: 0x184fb): fb_gfxDriverOpenGL
    <97ab5>   DW_AT_decl_file   : 12
    <97ab6>   DW_AT_decl_line   : 40
    <97ab7>   DW_AT_decl_column : 18
    <97ab8>   DW_AT_type        : <0x9770f>
    <97abc>   DW_AT_external    : 1
    <97abc>   DW_AT_declaration : 1
 <1><97abc>: Abbrev Number: 3 (DW_TAG_typedef)
    <97abd>   DW_AT_name        : (indirect string, offset: 0x176c0): GLenum
    <97ac1>   DW_AT_decl_file   : 13
    <97ac2>   DW_AT_decl_line   : 116
    <97ac3>   DW_AT_decl_column : 22
    <97ac4>   DW_AT_type        : <0x97153>
 <1><97ac8>: Abbrev Number: 3 (DW_TAG_typedef)
    <97ac9>   DW_AT_name        : (indirect string, offset: 0x17864): GLboolean
    <97acd>   DW_AT_decl_file   : 13
    <97ace>   DW_AT_decl_line   : 117
    <97acf>   DW_AT_decl_column : 23
    <97ad0>   DW_AT_type        : <0x97140>
 <1><97ad4>: Abbrev Number: 3 (DW_TAG_typedef)
    <97ad5>   DW_AT_name        : (indirect string, offset: 0x1736d): GLbitfield
    <97ad9>   DW_AT_decl_file   : 13
    <97ada>   DW_AT_decl_line   : 118
    <97adb>   DW_AT_decl_column : 22
    <97adc>   DW_AT_type        : <0x97153>
 <1><97ae0>: Abbrev Number: 49 (DW_TAG_typedef)
    <97ae1>   DW_AT_name        : (indirect string, offset: 0x16fc5): GLvoid
    <97ae5>   DW_AT_decl_file   : 13
    <97ae6>   DW_AT_decl_line   : 119
    <97ae7>   DW_AT_decl_column : 15
 <1><97ae8>: Abbrev Number: 14 (DW_TAG_const_type)
    <97ae9>   DW_AT_type        : <0x97ae0>
 <1><97aed>: Abbrev Number: 3 (DW_TAG_typedef)
    <97aee>   DW_AT_name        : (indirect string, offset: 0x16edc): GLint
    <97af2>   DW_AT_decl_file   : 13
    <97af3>   DW_AT_decl_line   : 122
    <97af4>   DW_AT_decl_column : 14
    <97af5>   DW_AT_type        : <0x9716f>
 <1><97af9>: Abbrev Number: 3 (DW_TAG_typedef)
    <97afa>   DW_AT_name        : (indirect string, offset: 0x17413): GLubyte
    <97afe>   DW_AT_decl_file   : 13
    <97aff>   DW_AT_decl_line   : 123
    <97b00>   DW_AT_decl_column : 23
    <97b01>   DW_AT_type        : <0x97140>
 <1><97b05>: Abbrev Number: 14 (DW_TAG_const_type)
    <97b06>   DW_AT_type        : <0x97af9>
 <1><97b0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b0b>   DW_AT_name        : (indirect string, offset: 0x17346): GLuint
    <97b0f>   DW_AT_decl_file   : 13
    <97b10>   DW_AT_decl_line   : 125
    <97b11>   DW_AT_decl_column : 22
    <97b12>   DW_AT_type        : <0x97153>
 <1><97b16>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b17>   DW_AT_name        : (indirect string, offset: 0x175a8): GLsizei
    <97b1b>   DW_AT_decl_file   : 13
    <97b1c>   DW_AT_decl_line   : 126
    <97b1d>   DW_AT_decl_column : 14
    <97b1e>   DW_AT_type        : <0x9716f>
 <1><97b22>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b23>   DW_AT_name        : (indirect string, offset: 0x171f7): GLfloat
    <97b27>   DW_AT_decl_file   : 13
    <97b28>   DW_AT_decl_line   : 127
    <97b29>   DW_AT_decl_column : 16
    <97b2a>   DW_AT_type        : <0x971eb>
 <1><97b2e>: Abbrev Number: 14 (DW_TAG_const_type)
    <97b2f>   DW_AT_type        : <0x97b22>
 <1><97b33>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b34>   DW_AT_name        : (indirect string, offset: 0x173a6): GLclampf
    <97b38>   DW_AT_decl_file   : 13
    <97b39>   DW_AT_decl_line   : 128
    <97b3a>   DW_AT_decl_column : 16
    <97b3b>   DW_AT_type        : <0x971eb>
 <1><97b3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b40>   DW_AT_name        : (indirect string, offset: 0x16efb): GLdouble
    <97b44>   DW_AT_decl_file   : 13
    <97b45>   DW_AT_decl_line   : 129
    <97b46>   DW_AT_decl_column : 17
    <97b47>   DW_AT_type        : <0x971e4>
 <1><97b4b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b4c>   DW_AT_byte_size   : 8
    <97b4c>   DW_AT_type        : <0x97ae8>
 <1><97b50>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b51>   DW_AT_byte_size   : 8
    <97b51>   DW_AT_type        : <0x97b55>
 <1><97b55>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97b56>   DW_AT_prototyped  : 1
    <97b56>   DW_AT_sibling     : <0x97b60>
 <2><97b5a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97b5b>   DW_AT_type        : <0x97abc>
 <2><97b5f>: Abbrev Number: 0
 <1><97b60>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b61>   DW_AT_byte_size   : 8
    <97b61>   DW_AT_type        : <0x97b2e>
 <1><97b65>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b66>   DW_AT_byte_size   : 8
    <97b66>   DW_AT_type        : <0x97b6a>
 <1><97b6a>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97b6b>   DW_AT_prototyped  : 1
    <97b6b>   DW_AT_sibling     : <0x97b7a>
 <2><97b6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97b70>   DW_AT_type        : <0x97abc>
 <2><97b74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97b75>   DW_AT_type        : <0x97aed>
 <2><97b79>: Abbrev Number: 0
 <1><97b7a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b7b>   DW_AT_byte_size   : 8
    <97b7b>   DW_AT_type        : <0x97b05>
 <1><97b7f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b80>   DW_AT_byte_size   : 8
    <97b80>   DW_AT_type        : <0x97b84>
 <1><97b84>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97b85>   DW_AT_prototyped  : 1
    <97b85>   DW_AT_sibling     : <0x97b94>
 <2><97b89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97b8a>   DW_AT_type        : <0x97b16>
 <2><97b8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97b8f>   DW_AT_type        : <0x97b94>
 <2><97b93>: Abbrev Number: 0
 <1><97b94>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b95>   DW_AT_byte_size   : 8
    <97b95>   DW_AT_type        : <0x97b0a>
 <1><97b99>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97b9a>   DW_AT_byte_size   : 8
    <97b9a>   DW_AT_type        : <0x97b9e>
 <1><97b9e>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97b9f>   DW_AT_prototyped  : 1
    <97b9f>   DW_AT_sibling     : <0x97bae>
 <2><97ba3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ba4>   DW_AT_type        : <0x97abc>
 <2><97ba8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ba9>   DW_AT_type        : <0x97b0a>
 <2><97bad>: Abbrev Number: 0
 <1><97bae>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97baf>   DW_AT_byte_size   : 8
    <97baf>   DW_AT_type        : <0x97187>
 <1><97bb3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97bb4>   DW_AT_byte_size   : 8
    <97bb4>   DW_AT_type        : <0x97bb8>
 <1><97bb8>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97bb9>   DW_AT_prototyped  : 1
    <97bb9>   DW_AT_sibling     : <0x97bc3>
 <2><97bbd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bbe>   DW_AT_type        : <0x97ad4>
 <2><97bc2>: Abbrev Number: 0
 <1><97bc3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97bc4>   DW_AT_byte_size   : 8
    <97bc4>   DW_AT_type        : <0x97bc8>
 <1><97bc8>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97bc9>   DW_AT_prototyped  : 1
    <97bc9>   DW_AT_sibling     : <0x97bdd>
 <2><97bcd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bce>   DW_AT_type        : <0x97abc>
 <2><97bd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bd3>   DW_AT_type        : <0x97abc>
 <2><97bd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bd8>   DW_AT_type        : <0x97aed>
 <2><97bdc>: Abbrev Number: 0
 <1><97bdd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97bde>   DW_AT_byte_size   : 8
    <97bde>   DW_AT_type        : <0x97be2>
 <1><97be2>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97be3>   DW_AT_prototyped  : 1
    <97be3>   DW_AT_sibling     : <0x97bf7>
 <2><97be7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97be8>   DW_AT_type        : <0x97abc>
 <2><97bec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bed>   DW_AT_type        : <0x97aed>
 <2><97bf1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97bf2>   DW_AT_type        : <0x97b16>
 <2><97bf6>: Abbrev Number: 0
 <1><97bf7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97bf8>   DW_AT_byte_size   : 8
    <97bf8>   DW_AT_type        : <0x97bfc>
 <1><97bfc>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97bfd>   DW_AT_prototyped  : 1
    <97bfd>   DW_AT_sibling     : <0x97c16>
 <2><97c01>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c02>   DW_AT_type        : <0x97aed>
 <2><97c06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c07>   DW_AT_type        : <0x97aed>
 <2><97c0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c0c>   DW_AT_type        : <0x97b16>
 <2><97c10>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c11>   DW_AT_type        : <0x97b16>
 <2><97c15>: Abbrev Number: 0
 <1><97c16>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97c17>   DW_AT_byte_size   : 8
    <97c17>   DW_AT_type        : <0x97c1b>
 <1><97c1b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97c1c>   DW_AT_prototyped  : 1
    <97c1c>   DW_AT_sibling     : <0x97c26>
 <2><97c20>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c21>   DW_AT_type        : <0x97ac8>
 <2><97c25>: Abbrev Number: 0
 <1><97c26>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97c27>   DW_AT_byte_size   : 8
    <97c27>   DW_AT_type        : <0x97c2b>
 <1><97c2b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97c2c>   DW_AT_prototyped  : 1
    <97c2c>   DW_AT_sibling     : <0x97c40>
 <2><97c30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c31>   DW_AT_type        : <0x97abc>
 <2><97c35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c36>   DW_AT_type        : <0x97b16>
 <2><97c3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c3b>   DW_AT_type        : <0x97b60>
 <2><97c3f>: Abbrev Number: 0
 <1><97c40>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c41>   DW_AT_name        : (indirect string, offset: 0x17f2b): FB_DYLIB
    <97c45>   DW_AT_decl_file   : 14
    <97c46>   DW_AT_decl_line   : 7
    <97c47>   DW_AT_decl_column : 16
    <97c48>   DW_AT_type        : <0x97187>
 <1><97c4c>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c4d>   DW_AT_name        : (indirect string, offset: 0x178f0): GLENABLE
    <97c51>   DW_AT_decl_file   : 15
    <97c52>   DW_AT_decl_line   : 21
    <97c53>   DW_AT_decl_column : 25
    <97c54>   DW_AT_type        : <0x97b50>
 <1><97c58>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c59>   DW_AT_name        : (indirect string, offset: 0x177a9): GLDISABLE
    <97c5d>   DW_AT_decl_file   : 15
    <97c5e>   DW_AT_decl_line   : 22
    <97c5f>   DW_AT_decl_column : 25
    <97c60>   DW_AT_type        : <0x97b50>
 <1><97c64>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c65>   DW_AT_name        : (indirect string, offset: 0x16fe8): GLENABLECLIENTSTATE
    <97c69>   DW_AT_decl_file   : 15
    <97c6a>   DW_AT_decl_line   : 23
    <97c6b>   DW_AT_decl_column : 25
    <97c6c>   DW_AT_type        : <0x97b50>
 <1><97c70>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c71>   DW_AT_name        : (indirect string, offset: 0x17272): GLDISABLECLIENTSTATE
    <97c75>   DW_AT_decl_file   : 15
    <97c76>   DW_AT_decl_line   : 24
    <97c77>   DW_AT_decl_column : 25
    <97c78>   DW_AT_type        : <0x97b50>
 <1><97c7c>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c7d>   DW_AT_name        : (indirect string, offset: 0x17181): GLGETSTRING
    <97c81>   DW_AT_decl_file   : 15
    <97c82>   DW_AT_decl_line   : 25
    <97c83>   DW_AT_decl_column : 35
    <97c84>   DW_AT_type        : <0x97c88>
 <1><97c88>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97c89>   DW_AT_byte_size   : 8
    <97c89>   DW_AT_type        : <0x97c8d>
 <1><97c8d>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <97c8e>   DW_AT_prototyped  : 1
    <97c8e>   DW_AT_type        : <0x97b7a>
    <97c92>   DW_AT_sibling     : <0x97c9c>
 <2><97c96>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c97>   DW_AT_type        : <0x97abc>
 <2><97c9b>: Abbrev Number: 0
 <1><97c9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <97c9d>   DW_AT_name        : (indirect string, offset: 0x1718d): GLVIEWPORT
    <97ca1>   DW_AT_decl_file   : 15
    <97ca2>   DW_AT_decl_line   : 26
    <97ca3>   DW_AT_decl_column : 25
    <97ca4>   DW_AT_type        : <0x97bf7>
 <1><97ca8>: Abbrev Number: 3 (DW_TAG_typedef)
    <97ca9>   DW_AT_name        : (indirect string, offset: 0x17796): GLMATRIXMODE
    <97cad>   DW_AT_decl_file   : 15
    <97cae>   DW_AT_decl_line   : 27
    <97caf>   DW_AT_decl_column : 25
    <97cb0>   DW_AT_type        : <0x97b50>
 <1><97cb4>: Abbrev Number: 3 (DW_TAG_typedef)
    <97cb5>   DW_AT_name        : (indirect string, offset: 0x1754c): GLLOADIDENTITY
    <97cb9>   DW_AT_decl_file   : 15
    <97cba>   DW_AT_decl_line   : 28
    <97cbb>   DW_AT_decl_column : 25
    <97cbc>   DW_AT_type        : <0x971de>
 <1><97cc0>: Abbrev Number: 3 (DW_TAG_typedef)
    <97cc1>   DW_AT_name        : (indirect string, offset: 0x171a0): GLORTHO
    <97cc5>   DW_AT_decl_file   : 15
    <97cc6>   DW_AT_decl_line   : 29
    <97cc7>   DW_AT_decl_column : 25
    <97cc8>   DW_AT_type        : <0x97ccc>
 <1><97ccc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97ccd>   DW_AT_byte_size   : 8
    <97ccd>   DW_AT_type        : <0x97cd1>
 <1><97cd1>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97cd2>   DW_AT_prototyped  : 1
    <97cd2>   DW_AT_sibling     : <0x97cf5>
 <2><97cd6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97cd7>   DW_AT_type        : <0x97b3f>
 <2><97cdb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97cdc>   DW_AT_type        : <0x97b3f>
 <2><97ce0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ce1>   DW_AT_type        : <0x97b3f>
 <2><97ce5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ce6>   DW_AT_type        : <0x97b3f>
 <2><97cea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ceb>   DW_AT_type        : <0x97b3f>
 <2><97cef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97cf0>   DW_AT_type        : <0x97b3f>
 <2><97cf4>: Abbrev Number: 0
 <1><97cf5>: Abbrev Number: 3 (DW_TAG_typedef)
    <97cf6>   DW_AT_name        : (indirect string, offset: 0x177d3): GLSHADEMODEL
    <97cfa>   DW_AT_decl_file   : 15
    <97cfb>   DW_AT_decl_line   : 30
    <97cfc>   DW_AT_decl_column : 25
    <97cfd>   DW_AT_type        : <0x97b50>
 <1><97d01>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d02>   DW_AT_name        : (indirect string, offset: 0x17126): GLDEPTHMASK
    <97d06>   DW_AT_decl_file   : 15
    <97d07>   DW_AT_decl_line   : 31
    <97d08>   DW_AT_decl_column : 25
    <97d09>   DW_AT_type        : <0x97c16>
 <1><97d0d>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d0e>   DW_AT_name        : (indirect string, offset: 0x171a8): GLCLEARCOLOR
    <97d12>   DW_AT_decl_file   : 15
    <97d13>   DW_AT_decl_line   : 32
    <97d14>   DW_AT_decl_column : 25
    <97d15>   DW_AT_type        : <0x97d19>
 <1><97d19>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97d1a>   DW_AT_byte_size   : 8
    <97d1a>   DW_AT_type        : <0x97d1e>
 <1><97d1e>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97d1f>   DW_AT_prototyped  : 1
    <97d1f>   DW_AT_sibling     : <0x97d38>
 <2><97d23>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d24>   DW_AT_type        : <0x97b33>
 <2><97d28>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d29>   DW_AT_type        : <0x97b33>
 <2><97d2d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d2e>   DW_AT_type        : <0x97b33>
 <2><97d32>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d33>   DW_AT_type        : <0x97b33>
 <2><97d37>: Abbrev Number: 0
 <1><97d38>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d39>   DW_AT_name        : (indirect string, offset: 0x17198): GLCLEAR
    <97d3d>   DW_AT_decl_file   : 15
    <97d3e>   DW_AT_decl_line   : 33
    <97d3f>   DW_AT_decl_column : 25
    <97d40>   DW_AT_type        : <0x97bb3>
 <1><97d44>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d45>   DW_AT_name        : (indirect string, offset: 0x176b2): GLGENTEXTURES
    <97d49>   DW_AT_decl_file   : 15
    <97d4a>   DW_AT_decl_line   : 34
    <97d4b>   DW_AT_decl_column : 25
    <97d4c>   DW_AT_type        : <0x97b7f>
 <1><97d50>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d51>   DW_AT_name        : (indirect string, offset: 0x175eb): GLDELETETEXTURES
    <97d55>   DW_AT_decl_file   : 15
    <97d56>   DW_AT_decl_line   : 35
    <97d57>   DW_AT_decl_column : 25
    <97d58>   DW_AT_type        : <0x97b7f>
 <1><97d5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d5d>   DW_AT_name        : (indirect string, offset: 0x17627): GLBINDTEXTURE
    <97d61>   DW_AT_decl_file   : 15
    <97d62>   DW_AT_decl_line   : 36
    <97d63>   DW_AT_decl_column : 25
    <97d64>   DW_AT_type        : <0x97b99>
 <1><97d68>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d69>   DW_AT_name        : (indirect string, offset: 0x17255): GLTEXPARAMETERI
    <97d6d>   DW_AT_decl_file   : 15
    <97d6e>   DW_AT_decl_line   : 37
    <97d6f>   DW_AT_decl_column : 25
    <97d70>   DW_AT_type        : <0x97bc3>
 <1><97d74>: Abbrev Number: 3 (DW_TAG_typedef)
    <97d75>   DW_AT_name        : (indirect string, offset: 0x16e91): GLTEXIMAGE2D
    <97d79>   DW_AT_decl_file   : 15
    <97d7a>   DW_AT_decl_line   : 38
    <97d7b>   DW_AT_decl_column : 25
    <97d7c>   DW_AT_type        : <0x97d80>
 <1><97d80>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97d81>   DW_AT_byte_size   : 8
    <97d81>   DW_AT_type        : <0x97d85>
 <1><97d85>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97d86>   DW_AT_prototyped  : 1
    <97d86>   DW_AT_sibling     : <0x97db8>
 <2><97d8a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d8b>   DW_AT_type        : <0x97abc>
 <2><97d8f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d90>   DW_AT_type        : <0x97aed>
 <2><97d94>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d95>   DW_AT_type        : <0x97aed>
 <2><97d99>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d9a>   DW_AT_type        : <0x97b16>
 <2><97d9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97d9f>   DW_AT_type        : <0x97b16>
 <2><97da3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97da4>   DW_AT_type        : <0x97aed>
 <2><97da8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97da9>   DW_AT_type        : <0x97abc>
 <2><97dad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97dae>   DW_AT_type        : <0x97abc>
 <2><97db2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97db3>   DW_AT_type        : <0x97b4b>
 <2><97db7>: Abbrev Number: 0
 <1><97db8>: Abbrev Number: 3 (DW_TAG_typedef)
    <97db9>   DW_AT_name        : (indirect string, offset: 0x170de): GLTEXSUBIMAGE2D
    <97dbd>   DW_AT_decl_file   : 15
    <97dbe>   DW_AT_decl_line   : 39
    <97dbf>   DW_AT_decl_column : 25
    <97dc0>   DW_AT_type        : <0x97dc4>
 <1><97dc4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97dc5>   DW_AT_byte_size   : 8
    <97dc5>   DW_AT_type        : <0x97dc9>
 <1><97dc9>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97dca>   DW_AT_prototyped  : 1
    <97dca>   DW_AT_sibling     : <0x97dfc>
 <2><97dce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97dcf>   DW_AT_type        : <0x97abc>
 <2><97dd3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97dd4>   DW_AT_type        : <0x97aed>
 <2><97dd8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97dd9>   DW_AT_type        : <0x97aed>
 <2><97ddd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97dde>   DW_AT_type        : <0x97aed>
 <2><97de2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97de3>   DW_AT_type        : <0x97b16>
 <2><97de7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97de8>   DW_AT_type        : <0x97b16>
 <2><97dec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97ded>   DW_AT_type        : <0x97abc>
 <2><97df1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97df2>   DW_AT_type        : <0x97abc>
 <2><97df6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97df7>   DW_AT_type        : <0x97b4b>
 <2><97dfb>: Abbrev Number: 0
 <1><97dfc>: Abbrev Number: 3 (DW_TAG_typedef)
    <97dfd>   DW_AT_name        : (indirect string, offset: 0x1734d): GLVERTEXPOINTER
    <97e01>   DW_AT_decl_file   : 15
    <97e02>   DW_AT_decl_line   : 40
    <97e03>   DW_AT_decl_column : 25
    <97e04>   DW_AT_type        : <0x97e08>
 <1><97e08>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <97e09>   DW_AT_byte_size   : 8
    <97e09>   DW_AT_type        : <0x97e0d>
 <1><97e0d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97e0e>   DW_AT_prototyped  : 1
    <97e0e>   DW_AT_sibling     : <0x97e27>
 <2><97e12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97e13>   DW_AT_type        : <0x97aed>
 <2><97e17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97e18>   DW_AT_type        : <0x97abc>
 <2><97e1c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97e1d>   DW_AT_type        : <0x97b16>
 <2><97e21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97e22>   DW_AT_type        : <0x97b4b>
 <2><97e26>: Abbrev Number: 0
 <1><97e27>: Abbrev Number: 3 (DW_TAG_typedef)
    <97e28>   DW_AT_name        : (indirect string, offset: 0x1786e): GLTEXCOORDPOINTER
    <97e2c>   DW_AT_decl_file   : 15
    <97e2d>   DW_AT_decl_line   : 41
    <97e2e>   DW_AT_decl_column : 25
    <97e2f>   DW_AT_type        : <0x97e08>
 <1><97e33>: Abbrev Number: 3 (DW_TAG_typedef)
    <97e34>   DW_AT_name        : (indirect string, offset: 0x173d2): GLDRAWARRAYS
    <97e38>   DW_AT_decl_file   : 15
