    <8656b>   DW_AT_data_member_location: 40
 <2><8656c>: Abbrev Number: 2 (DW_TAG_member)
    <8656d>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <86571>   DW_AT_decl_file   : 9
    <86572>   DW_AT_decl_line   : 109
    <86573>   DW_AT_decl_column : 21
    <86574>   DW_AT_type        : <0x8638b>
    <86578>   DW_AT_data_member_location: 44
 <2><86579>: Abbrev Number: 2 (DW_TAG_member)
    <8657a>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <8657e>   DW_AT_decl_file   : 9
    <8657f>   DW_AT_decl_line   : 110
    <86580>   DW_AT_decl_column : 21
    <86581>   DW_AT_type        : <0x86347>
    <86585>   DW_AT_data_member_location: 48
 <2><86586>: Abbrev Number: 2 (DW_TAG_member)
    <86587>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <8658b>   DW_AT_decl_file   : 9
    <8658c>   DW_AT_decl_line   : 112
    <8658d>   DW_AT_decl_column : 22
    <8658e>   DW_AT_type        : <0x86846>
    <86592>   DW_AT_data_member_location: 56
 <2><86593>: Abbrev Number: 2 (DW_TAG_member)
    <86594>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <86598>   DW_AT_decl_file   : 9
    <86599>   DW_AT_decl_line   : 114
    <8659a>   DW_AT_decl_column : 14
    <8659b>   DW_AT_type        : <0x8631c>
    <8659f>   DW_AT_data_member_location: 64
 <2><865a0>: Abbrev Number: 2 (DW_TAG_member)
    <865a1>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <865a5>   DW_AT_decl_file   : 9
    <865a6>   DW_AT_decl_line   : 116
    <865a7>   DW_AT_decl_column : 22
    <865a8>   DW_AT_type        : <0x864e5>
    <865ac>   DW_AT_data_member_location: 72
 <2><865ad>: Abbrev Number: 0
 <1><865ae>: Abbrev Number: 5 (DW_TAG_typedef)
    <865af>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <865b3>   DW_AT_decl_file   : 9
    <865b4>   DW_AT_decl_line   : 59
    <865b5>   DW_AT_decl_column : 15
    <865b6>   DW_AT_type        : <0x865ba>
 <1><865ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <865bb>   DW_AT_byte_size   : 8
    <865bb>   DW_AT_type        : <0x865bf>
 <1><865bf>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <865c0>   DW_AT_prototyped  : 1
    <865c0>   DW_AT_type        : <0x862f8>
    <865c4>   DW_AT_sibling     : <0x865ce>
 <2><865c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <865c9>   DW_AT_type        : <0x864e5>
 <2><865cd>: Abbrev Number: 0
 <1><865ce>: Abbrev Number: 5 (DW_TAG_typedef)
    <865cf>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <865d3>   DW_AT_decl_file   : 9
    <865d4>   DW_AT_decl_line   : 60
    <865d5>   DW_AT_decl_column : 15
    <865d6>   DW_AT_type        : <0x865ba>
 <1><865da>: Abbrev Number: 5 (DW_TAG_typedef)
    <865db>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <865df>   DW_AT_decl_file   : 9
    <865e0>   DW_AT_decl_line   : 61
    <865e1>   DW_AT_decl_column : 15
    <865e2>   DW_AT_type        : <0x865e6>
 <1><865e6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <865e7>   DW_AT_byte_size   : 8
    <865e7>   DW_AT_type        : <0x865eb>
 <1><865eb>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <865ec>   DW_AT_prototyped  : 1
    <865ec>   DW_AT_type        : <0x862f8>
    <865f0>   DW_AT_sibling     : <0x86604>
 <2><865f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <865f5>   DW_AT_type        : <0x864e5>
 <2><865f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <865fa>   DW_AT_type        : <0x863ab>
 <2><865fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <865ff>   DW_AT_type        : <0x862f8>
 <2><86603>: Abbrev Number: 0
 <1><86604>: Abbrev Number: 5 (DW_TAG_typedef)
    <86605>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <86609>   DW_AT_decl_file   : 9
    <8660a>   DW_AT_decl_line   : 62
    <8660b>   DW_AT_decl_column : 15
    <8660c>   DW_AT_type        : <0x86610>
 <1><86610>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86611>   DW_AT_byte_size   : 8
    <86611>   DW_AT_type        : <0x86615>
 <1><86615>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86616>   DW_AT_prototyped  : 1
    <86616>   DW_AT_type        : <0x862f8>
    <8661a>   DW_AT_sibling     : <0x86629>
 <2><8661e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8661f>   DW_AT_type        : <0x864e5>
 <2><86623>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86624>   DW_AT_type        : <0x86629>
 <2><86628>: Abbrev Number: 0
 <1><86629>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8662a>   DW_AT_byte_size   : 8
    <8662a>   DW_AT_type        : <0x863ab>
 <1><8662e>: Abbrev Number: 5 (DW_TAG_typedef)
    <8662f>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <86633>   DW_AT_decl_file   : 9
    <86634>   DW_AT_decl_line   : 63
    <86635>   DW_AT_decl_column : 15
    <86636>   DW_AT_type        : <0x8663a>
 <1><8663a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8663b>   DW_AT_byte_size   : 8
    <8663b>   DW_AT_type        : <0x8663f>
 <1><8663f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86640>   DW_AT_prototyped  : 1
    <86640>   DW_AT_type        : <0x862f8>
    <86644>   DW_AT_sibling     : <0x86658>
 <2><86648>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86649>   DW_AT_type        : <0x864e5>
 <2><8664d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8664e>   DW_AT_type        : <0x8631c>
 <2><86652>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86653>   DW_AT_type        : <0x86658>
 <2><86657>: Abbrev Number: 0
 <1><86658>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86659>   DW_AT_byte_size   : 8
    <86659>   DW_AT_type        : <0x86347>
 <1><8665d>: Abbrev Number: 5 (DW_TAG_typedef)
    <8665e>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <86662>   DW_AT_decl_file   : 9
    <86663>   DW_AT_decl_line   : 65
    <86664>   DW_AT_decl_column : 15
    <86665>   DW_AT_type        : <0x86669>
 <1><86669>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8666a>   DW_AT_byte_size   : 8
    <8666a>   DW_AT_type        : <0x8666e>
 <1><8666e>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <8666f>   DW_AT_prototyped  : 1
    <8666f>   DW_AT_type        : <0x862f8>
    <86673>   DW_AT_sibling     : <0x86687>
 <2><86677>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86678>   DW_AT_type        : <0x864e5>
 <2><8667c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8667d>   DW_AT_type        : <0x86487>
 <2><86681>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86682>   DW_AT_type        : <0x86658>
 <2><86686>: Abbrev Number: 0
 <1><86687>: Abbrev Number: 5 (DW_TAG_typedef)
    <86688>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <8668c>   DW_AT_decl_file   : 9
    <8668d>   DW_AT_decl_line   : 67
    <8668e>   DW_AT_decl_column : 15
    <8668f>   DW_AT_type        : <0x86693>
 <1><86693>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86694>   DW_AT_byte_size   : 8
    <86694>   DW_AT_type        : <0x86698>
 <1><86698>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86699>   DW_AT_prototyped  : 1
    <86699>   DW_AT_type        : <0x862f8>
    <8669d>   DW_AT_sibling     : <0x866b1>
 <2><866a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866a2>   DW_AT_type        : <0x864e5>
 <2><866a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866a7>   DW_AT_type        : <0x8639b>
 <2><866ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866ac>   DW_AT_type        : <0x86347>
 <2><866b0>: Abbrev Number: 0
 <1><866b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <866b2>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <866b6>   DW_AT_decl_file   : 9
    <866b7>   DW_AT_decl_line   : 69
    <866b8>   DW_AT_decl_column : 15
    <866b9>   DW_AT_type        : <0x866bd>
 <1><866bd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <866be>   DW_AT_byte_size   : 8
    <866be>   DW_AT_type        : <0x866c2>
 <1><866c2>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <866c3>   DW_AT_prototyped  : 1
    <866c3>   DW_AT_type        : <0x862f8>
    <866c7>   DW_AT_sibling     : <0x866db>
 <2><866cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866cc>   DW_AT_type        : <0x864e5>
 <2><866d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866d1>   DW_AT_type        : <0x866db>
 <2><866d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866d6>   DW_AT_type        : <0x86347>
 <2><866da>: Abbrev Number: 0
 <1><866db>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <866dc>   DW_AT_byte_size   : 8
    <866dc>   DW_AT_type        : <0x86360>
 <1><866e0>: Abbrev Number: 5 (DW_TAG_typedef)
    <866e1>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <866e5>   DW_AT_decl_file   : 9
    <866e6>   DW_AT_decl_line   : 71
    <866e7>   DW_AT_decl_column : 15
    <866e8>   DW_AT_type        : <0x866ec>
 <1><866ec>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <866ed>   DW_AT_byte_size   : 8
    <866ed>   DW_AT_type        : <0x866f1>
 <1><866f1>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <866f2>   DW_AT_prototyped  : 1
    <866f2>   DW_AT_type        : <0x862f8>
    <866f6>   DW_AT_sibling     : <0x8670a>
 <2><866fa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866fb>   DW_AT_type        : <0x864e5>
 <2><866ff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86700>   DW_AT_type        : <0x863ab>
 <2><86704>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86705>   DW_AT_type        : <0x863ab>
 <2><86709>: Abbrev Number: 0
 <1><8670a>: Abbrev Number: 5 (DW_TAG_typedef)
    <8670b>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <8670f>   DW_AT_decl_file   : 9
    <86710>   DW_AT_decl_line   : 73
    <86711>   DW_AT_decl_column : 15
    <86712>   DW_AT_type        : <0x866ec>
 <1><86716>: Abbrev Number: 5 (DW_TAG_typedef)
    <86717>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <8671b>   DW_AT_decl_file   : 9
    <8671c>   DW_AT_decl_line   : 75
    <8671d>   DW_AT_decl_column : 15
    <8671e>   DW_AT_type        : <0x86722>
 <1><86722>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86723>   DW_AT_byte_size   : 8
    <86723>   DW_AT_type        : <0x86727>
 <1><86727>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86728>   DW_AT_prototyped  : 1
    <86728>   DW_AT_type        : <0x862f8>
    <8672c>   DW_AT_sibling     : <0x8673b>
 <2><86730>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86731>   DW_AT_type        : <0x864e5>
 <2><86735>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86736>   DW_AT_type        : <0x8673b>
 <2><8673a>: Abbrev Number: 0
 <1><8673b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8673c>   DW_AT_byte_size   : 8
    <8673c>   DW_AT_type        : <0x86474>
 <1><86740>: Abbrev Number: 5 (DW_TAG_typedef)
    <86741>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <86745>   DW_AT_decl_file   : 9
    <86746>   DW_AT_decl_line   : 76
    <86747>   DW_AT_decl_column : 15
    <86748>   DW_AT_type        : <0x8674c>
 <1><8674c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8674d>   DW_AT_byte_size   : 8
    <8674d>   DW_AT_type        : <0x86751>
 <1><86751>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86752>   DW_AT_prototyped  : 1
    <86752>   DW_AT_type        : <0x862f8>
    <86756>   DW_AT_sibling     : <0x8676a>
 <2><8675a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8675b>   DW_AT_type        : <0x864e5>
 <2><8675f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86760>   DW_AT_type        : <0x86487>
 <2><86764>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86765>   DW_AT_type        : <0x86378>
 <2><86769>: Abbrev Number: 0
 <1><8676a>: Abbrev Number: 5 (DW_TAG_typedef)
    <8676b>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <8676f>   DW_AT_decl_file   : 9
    <86770>   DW_AT_decl_line   : 77
    <86771>   DW_AT_decl_column : 15
    <86772>   DW_AT_type        : <0x865ba>
 <1><86776>: Abbrev Number: 19 (DW_TAG_structure_type)
    <86777>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <8677b>   DW_AT_byte_size   : 112
    <8677c>   DW_AT_decl_file   : 9
    <8677d>   DW_AT_decl_line   : 80
    <8677e>   DW_AT_decl_column : 16
    <8677f>   DW_AT_sibling     : <0x8683a>
 <2><86783>: Abbrev Number: 2 (DW_TAG_member)
    <86784>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <86788>   DW_AT_decl_file   : 9
    <86789>   DW_AT_decl_line   : 81
    <8678a>   DW_AT_decl_column : 25
    <8678b>   DW_AT_type        : <0x865ae>
    <8678f>   DW_AT_data_member_location: 0
 <2><86790>: Abbrev Number: 2 (DW_TAG_member)
    <86791>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <86795>   DW_AT_decl_file   : 9
    <86796>   DW_AT_decl_line   : 82
    <86797>   DW_AT_decl_column : 25
    <86798>   DW_AT_type        : <0x865ce>
    <8679c>   DW_AT_data_member_location: 8
 <2><8679d>: Abbrev Number: 2 (DW_TAG_member)
    <8679e>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <867a2>   DW_AT_decl_file   : 9
    <867a3>   DW_AT_decl_line   : 83
    <867a4>   DW_AT_decl_column : 25
    <867a5>   DW_AT_type        : <0x865da>
    <867a9>   DW_AT_data_member_location: 16
 <2><867aa>: Abbrev Number: 2 (DW_TAG_member)
    <867ab>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <867af>   DW_AT_decl_file   : 9
    <867b0>   DW_AT_decl_line   : 84
    <867b1>   DW_AT_decl_column : 25
    <867b2>   DW_AT_type        : <0x86604>
    <867b6>   DW_AT_data_member_location: 24
 <2><867b7>: Abbrev Number: 2 (DW_TAG_member)
    <867b8>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <867bc>   DW_AT_decl_file   : 9
    <867bd>   DW_AT_decl_line   : 85
    <867be>   DW_AT_decl_column : 25
    <867bf>   DW_AT_type        : <0x8662e>
    <867c3>   DW_AT_data_member_location: 32
 <2><867c4>: Abbrev Number: 2 (DW_TAG_member)
    <867c5>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <867c9>   DW_AT_decl_file   : 9
    <867ca>   DW_AT_decl_line   : 86
    <867cb>   DW_AT_decl_column : 25
    <867cc>   DW_AT_type        : <0x8665d>
    <867d0>   DW_AT_data_member_location: 40
 <2><867d1>: Abbrev Number: 2 (DW_TAG_member)
    <867d2>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <867d6>   DW_AT_decl_file   : 9
    <867d7>   DW_AT_decl_line   : 87
    <867d8>   DW_AT_decl_column : 25
    <867d9>   DW_AT_type        : <0x86687>
    <867dd>   DW_AT_data_member_location: 48
 <2><867de>: Abbrev Number: 2 (DW_TAG_member)
    <867df>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <867e3>   DW_AT_decl_file   : 9
    <867e4>   DW_AT_decl_line   : 88
    <867e5>   DW_AT_decl_column : 25
    <867e6>   DW_AT_type        : <0x866b1>
    <867ea>   DW_AT_data_member_location: 56
 <2><867eb>: Abbrev Number: 2 (DW_TAG_member)
    <867ec>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <867f0>   DW_AT_decl_file   : 9
    <867f1>   DW_AT_decl_line   : 89
    <867f2>   DW_AT_decl_column : 25
    <867f3>   DW_AT_type        : <0x866e0>
    <867f7>   DW_AT_data_member_location: 64
 <2><867f8>: Abbrev Number: 2 (DW_TAG_member)
    <867f9>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <867fd>   DW_AT_decl_file   : 9
    <867fe>   DW_AT_decl_line   : 90
    <867ff>   DW_AT_decl_column : 25
    <86800>   DW_AT_type        : <0x8670a>
    <86804>   DW_AT_data_member_location: 72
 <2><86805>: Abbrev Number: 2 (DW_TAG_member)
    <86806>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <8680a>   DW_AT_decl_file   : 9
    <8680b>   DW_AT_decl_line   : 91
    <8680c>   DW_AT_decl_column : 25
    <8680d>   DW_AT_type        : <0x86716>
    <86811>   DW_AT_data_member_location: 80
 <2><86812>: Abbrev Number: 2 (DW_TAG_member)
    <86813>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <86817>   DW_AT_decl_file   : 9
    <86818>   DW_AT_decl_line   : 92
    <86819>   DW_AT_decl_column : 25
    <8681a>   DW_AT_type        : <0x86740>
    <8681e>   DW_AT_data_member_location: 88
 <2><8681f>: Abbrev Number: 2 (DW_TAG_member)
    <86820>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <86824>   DW_AT_decl_file   : 9
    <86825>   DW_AT_decl_line   : 93
    <86826>   DW_AT_decl_column : 25
    <86827>   DW_AT_type        : <0x864c0>
    <8682b>   DW_AT_data_member_location: 96
 <2><8682c>: Abbrev Number: 2 (DW_TAG_member)
    <8682d>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <86831>   DW_AT_decl_file   : 9
    <86832>   DW_AT_decl_line   : 94
    <86833>   DW_AT_decl_column : 25
    <86834>   DW_AT_type        : <0x8676a>
    <86838>   DW_AT_data_member_location: 104
 <2><86839>: Abbrev Number: 0
 <1><8683a>: Abbrev Number: 5 (DW_TAG_typedef)
    <8683b>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <8683f>   DW_AT_decl_file   : 9
    <86840>   DW_AT_decl_line   : 95
    <86841>   DW_AT_decl_column : 3
    <86842>   DW_AT_type        : <0x86776>
 <1><86846>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86847>   DW_AT_byte_size   : 8
    <86847>   DW_AT_type        : <0x8683a>
 <1><8684b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8684c>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <86850>   DW_AT_decl_file   : 9
    <86851>   DW_AT_decl_line   : 117
    <86852>   DW_AT_decl_column : 3
    <86853>   DW_AT_type        : <0x864ea>
 <1><86857>: Abbrev Number: 5 (DW_TAG_typedef)
    <86858>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <8685c>   DW_AT_decl_file   : 10
    <8685d>   DW_AT_decl_line   : 7
    <8685e>   DW_AT_decl_column : 25
    <8685f>   DW_AT_type        : <0x86863>
 <1><86863>: Abbrev Number: 73 (DW_TAG_structure_type)
    <86864>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <86868>   DW_AT_declaration : 1
 <1><86868>: Abbrev Number: 31 (DW_TAG_structure_type)
    <86869>   DW_AT_byte_size   : 8
    <8686a>   DW_AT_decl_file   : 11
    <8686b>   DW_AT_decl_line   : 4
    <8686c>   DW_AT_decl_column : 3
    <8686d>   DW_AT_sibling     : <0x8688c>
 <2><86871>: Abbrev Number: 2 (DW_TAG_member)
    <86872>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <86876>   DW_AT_decl_file   : 11
    <86877>   DW_AT_decl_line   : 5
    <86878>   DW_AT_decl_column : 8
    <86879>   DW_AT_type        : <0x862f8>
    <8687d>   DW_AT_data_member_location: 0
 <2><8687e>: Abbrev Number: 2 (DW_TAG_member)
    <8687f>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <86883>   DW_AT_decl_file   : 11
    <86884>   DW_AT_decl_line   : 6
    <86885>   DW_AT_decl_column : 8
    <86886>   DW_AT_type        : <0x862f8>
    <8688a>   DW_AT_data_member_location: 4
 <2><8688b>: Abbrev Number: 0
 <1><8688c>: Abbrev Number: 31 (DW_TAG_structure_type)
    <8688d>   DW_AT_byte_size   : 16
    <8688e>   DW_AT_decl_file   : 11
    <8688f>   DW_AT_decl_line   : 8
    <86890>   DW_AT_decl_column : 3
    <86891>   DW_AT_sibling     : <0x868c4>
 <2><86895>: Abbrev Number: 13 (DW_TAG_member)
    <86896>   DW_AT_name        : x
    <86898>   DW_AT_decl_file   : 11
    <86899>   DW_AT_decl_line   : 9
    <8689a>   DW_AT_decl_column : 8
    <8689b>   DW_AT_type        : <0x862f8>
    <8689f>   DW_AT_data_member_location: 0
 <2><868a0>: Abbrev Number: 13 (DW_TAG_member)
    <868a1>   DW_AT_name        : y
    <868a3>   DW_AT_decl_file   : 11
    <868a4>   DW_AT_decl_line   : 9
    <868a5>   DW_AT_decl_column : 11
    <868a6>   DW_AT_type        : <0x862f8>
    <868aa>   DW_AT_data_member_location: 4
 <2><868ab>: Abbrev Number: 13 (DW_TAG_member)
    <868ac>   DW_AT_name        : dx
    <868af>   DW_AT_decl_file   : 11
    <868b0>   DW_AT_decl_line   : 10
    <868b1>   DW_AT_decl_column : 8
    <868b2>   DW_AT_type        : <0x862f8>
    <868b6>   DW_AT_data_member_location: 8
 <2><868b7>: Abbrev Number: 13 (DW_TAG_member)
    <868b8>   DW_AT_name        : dy
    <868bb>   DW_AT_decl_file   : 11
    <868bc>   DW_AT_decl_line   : 10
    <868bd>   DW_AT_decl_column : 12
    <868be>   DW_AT_type        : <0x862f8>
    <868c2>   DW_AT_data_member_location: 12
 <2><868c3>: Abbrev Number: 0
 <1><868c4>: Abbrev Number: 44 (DW_TAG_union_type)
    <868c5>   DW_AT_byte_size   : 16
    <868c5>   DW_AT_decl_file   : 11
    <868c6>   DW_AT_decl_line   : 3
    <868c7>   DW_AT_decl_column : 2
    <868c7>   DW_AT_sibling     : <0x868f1>
 <2><868cb>: Abbrev Number: 36 (DW_TAG_member)
    <868cc>   DW_AT_type        : <0x86868>
 <2><868d0>: Abbrev Number: 36 (DW_TAG_member)
    <868d1>   DW_AT_type        : <0x8688c>
 <2><868d5>: Abbrev Number: 45 (DW_TAG_member)
    <868d6>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <868da>   DW_AT_decl_file   : 11
    <868db>   DW_AT_decl_line   : 12
    <868dc>   DW_AT_decl_column : 7
    <868dc>   DW_AT_type        : <0x862f8>
 <2><868e0>: Abbrev Number: 54 (DW_TAG_member)
    <868e1>   DW_AT_name        : z
    <868e3>   DW_AT_decl_file   : 11
    <868e3>   DW_AT_decl_line   : 13
    <868e4>   DW_AT_decl_column : 7
    <868e4>   DW_AT_type        : <0x862f8>
 <2><868e8>: Abbrev Number: 54 (DW_TAG_member)
    <868e9>   DW_AT_name        : w
    <868eb>   DW_AT_decl_file   : 11
    <868eb>   DW_AT_decl_line   : 14
    <868ec>   DW_AT_decl_column : 7
    <868ec>   DW_AT_type        : <0x862f8>
 <2><868f0>: Abbrev Number: 0
 <1><868f1>: Abbrev Number: 19 (DW_TAG_structure_type)
    <868f2>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <868f6>   DW_AT_byte_size   : 20
    <868f7>   DW_AT_decl_file   : 11
    <868f8>   DW_AT_decl_line   : 1
    <868f9>   DW_AT_decl_column : 8
    <868fa>   DW_AT_sibling     : <0x86912>
 <2><868fe>: Abbrev Number: 2 (DW_TAG_member)
    <868ff>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <86903>   DW_AT_decl_file   : 11
    <86904>   DW_AT_decl_line   : 2
    <86905>   DW_AT_decl_column : 6
    <86906>   DW_AT_type        : <0x862f8>
    <8690a>   DW_AT_data_member_location: 0
 <2><8690b>: Abbrev Number: 46 (DW_TAG_member)
    <8690c>   DW_AT_type        : <0x868c4>
    <86910>   DW_AT_data_member_location: 4
 <2><86911>: Abbrev Number: 0
 <1><86912>: Abbrev Number: 5 (DW_TAG_typedef)
    <86913>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <86917>   DW_AT_decl_file   : 11
    <86918>   DW_AT_decl_line   : 18
    <86919>   DW_AT_decl_column : 23
    <8691a>   DW_AT_type        : <0x868f1>
 <1><8691e>: Abbrev Number: 5 (DW_TAG_typedef)
    <8691f>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <86923>   DW_AT_decl_file   : 12
    <86924>   DW_AT_decl_line   : 1
    <86925>   DW_AT_decl_column : 23
    <86926>   DW_AT_type        : <0x8692a>
 <1><8692a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8692b>   DW_AT_byte_size   : 8
    <8692b>   DW_AT_type        : <0x8692f>
 <1><8692f>: Abbrev Number: 55 (DW_TAG_subroutine_type)
    <86930>   DW_AT_prototyped  : 1
    <86930>   DW_AT_type        : <0x8673b>
 <1><86934>: Abbrev Number: 5 (DW_TAG_typedef)
    <86935>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <86939>   DW_AT_decl_file   : 12
    <8693a>   DW_AT_decl_line   : 2
    <8693b>   DW_AT_decl_column : 23
    <8693c>   DW_AT_type        : <0x86940>
 <1><86940>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86941>   DW_AT_byte_size   : 8
    <86941>   DW_AT_type        : <0x86945>
 <1><86945>: Abbrev Number: 55 (DW_TAG_subroutine_type)
    <86946>   DW_AT_prototyped  : 1
    <86946>   DW_AT_type        : <0x862f8>
 <1><8694a>: Abbrev Number: 5 (DW_TAG_typedef)
    <8694b>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <8694f>   DW_AT_decl_file   : 12
    <86950>   DW_AT_decl_line   : 3
    <86951>   DW_AT_decl_column : 23
    <86952>   DW_AT_type        : <0x86940>
 <1><86956>: Abbrev Number: 5 (DW_TAG_typedef)
    <86957>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <8695b>   DW_AT_decl_file   : 12
    <8695c>   DW_AT_decl_line   : 10
    <8695d>   DW_AT_decl_column : 23
    <8695e>   DW_AT_type        : <0x86962>
 <1><86962>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86963>   DW_AT_byte_size   : 8
    <86963>   DW_AT_type        : <0x86967>
 <1><86967>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86968>   DW_AT_prototyped  : 1
    <86968>   DW_AT_sibling     : <0x86972>
 <2><8696c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8696d>   DW_AT_type        : <0x862f8>
 <2><86971>: Abbrev Number: 0
 <1><86972>: Abbrev Number: 5 (DW_TAG_typedef)
    <86973>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <86977>   DW_AT_decl_file   : 12
    <86978>   DW_AT_decl_line   : 14
    <86979>   DW_AT_decl_column : 23
    <8697a>   DW_AT_type        : <0x8697e>
 <1><8697e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8697f>   DW_AT_byte_size   : 8
    <8697f>   DW_AT_type        : <0x86983>
 <1><86983>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86984>   DW_AT_prototyped  : 1
    <86984>   DW_AT_type        : <0x862f8>
    <86988>   DW_AT_sibling     : <0x8699c>
 <2><8698c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8698d>   DW_AT_type        : <0x862f8>
 <2><86991>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86992>   DW_AT_type        : <0x862f8>
 <2><86996>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86997>   DW_AT_type        : <0x862f8>
 <2><8699b>: Abbrev Number: 0
 <1><8699c>: Abbrev Number: 5 (DW_TAG_typedef)
    <8699d>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <869a1>   DW_AT_decl_file   : 12
    <869a2>   DW_AT_decl_line   : 18
    <869a3>   DW_AT_decl_column : 23
    <869a4>   DW_AT_type        : <0x8697e>
 <1><869a8>: Abbrev Number: 5 (DW_TAG_typedef)
    <869a9>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <869ad>   DW_AT_decl_file   : 12
    <869ae>   DW_AT_decl_line   : 24
    <869af>   DW_AT_decl_column : 23
    <869b0>   DW_AT_type        : <0x86439>
 <1><869b4>: Abbrev Number: 5 (DW_TAG_typedef)
    <869b5>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <869b9>   DW_AT_decl_file   : 12
    <869ba>   DW_AT_decl_line   : 28
    <869bb>   DW_AT_decl_column : 23
    <869bc>   DW_AT_type        : <0x869c0>
 <1><869c0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <869c1>   DW_AT_byte_size   : 8
    <869c1>   DW_AT_type        : <0x869c5>
 <1><869c5>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <869c6>   DW_AT_prototyped  : 1
    <869c6>   DW_AT_type        : <0x862f8>
    <869ca>   DW_AT_sibling     : <0x869d9>
 <2><869ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <869cf>   DW_AT_type        : <0x862f8>
 <2><869d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <869d4>   DW_AT_type        : <0x862f8>
 <2><869d8>: Abbrev Number: 0
 <1><869d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <869da>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <869de>   DW_AT_decl_file   : 12
    <869df>   DW_AT_decl_line   : 34
    <869e0>   DW_AT_decl_column : 23
    <869e1>   DW_AT_type        : <0x86940>
 <1><869e5>: Abbrev Number: 5 (DW_TAG_typedef)
    <869e6>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <869ea>   DW_AT_decl_file   : 12
    <869eb>   DW_AT_decl_line   : 35
    <869ec>   DW_AT_decl_column : 23
    <869ed>   DW_AT_type        : <0x86940>
 <1><869f1>: Abbrev Number: 5 (DW_TAG_typedef)
    <869f2>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <869f6>   DW_AT_decl_file   : 12
    <869f7>   DW_AT_decl_line   : 36
    <869f8>   DW_AT_decl_column : 23
    <869f9>   DW_AT_type        : <0x869fd>
 <1><869fd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <869fe>   DW_AT_byte_size   : 8
    <869fe>   DW_AT_type        : <0x86a02>
 <1><86a02>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86a03>   DW_AT_prototyped  : 1
    <86a03>   DW_AT_sibling     : <0x86a12>
 <2><86a07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a08>   DW_AT_type        : <0x86a12>
 <2><86a0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a0d>   DW_AT_type        : <0x86a12>
 <2><86a11>: Abbrev Number: 0
 <1><86a12>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86a13>   DW_AT_byte_size   : 8
    <86a13>   DW_AT_type        : <0x862f8>
 <1><86a17>: Abbrev Number: 5 (DW_TAG_typedef)
    <86a18>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <86a1c>   DW_AT_decl_file   : 12
    <86a1d>   DW_AT_decl_line   : 37
    <86a1e>   DW_AT_decl_column : 23
    <86a1f>   DW_AT_type        : <0x869fd>
 <1><86a23>: Abbrev Number: 5 (DW_TAG_typedef)
    <86a24>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <86a28>   DW_AT_decl_file   : 12
    <86a29>   DW_AT_decl_line   : 45
    <86a2a>   DW_AT_decl_column : 24
    <86a2b>   DW_AT_type        : <0x86a2f>
 <1><86a2f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86a30>   DW_AT_byte_size   : 8
    <86a30>   DW_AT_type        : <0x86a34>
 <1><86a34>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86a35>   DW_AT_prototyped  : 1
    <86a35>   DW_AT_type        : <0x862dc>
    <86a39>   DW_AT_sibling     : <0x86a4d>
 <2><86a3d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a3e>   DW_AT_type        : <0x862f8>
 <2><86a42>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a43>   DW_AT_type        : <0x862f8>
 <2><86a47>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a48>   DW_AT_type        : <0x862f8>
 <2><86a4c>: Abbrev Number: 0
 <1><86a4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <86a4e>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <86a52>   DW_AT_decl_file   : 12
    <86a53>   DW_AT_decl_line   : 48
    <86a54>   DW_AT_decl_column : 23
    <86a55>   DW_AT_type        : <0x86a59>
 <1><86a59>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86a5a>   DW_AT_byte_size   : 8
    <86a5a>   DW_AT_type        : <0x86a5e>
 <1><86a5e>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86a5f>   DW_AT_prototyped  : 1
    <86a5f>   DW_AT_sibling     : <0x86a73>
 <2><86a63>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a64>   DW_AT_type        : <0x8639b>
 <2><86a68>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a69>   DW_AT_type        : <0x86347>
 <2><86a6d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a6e>   DW_AT_type        : <0x862f8>
 <2><86a72>: Abbrev Number: 0
 <1><86a73>: Abbrev Number: 5 (DW_TAG_typedef)
    <86a74>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <86a78>   DW_AT_decl_file   : 12
    <86a79>   DW_AT_decl_line   : 49
    <86a7a>   DW_AT_decl_column : 23
    <86a7b>   DW_AT_type        : <0x86a7f>
 <1><86a7f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86a80>   DW_AT_byte_size   : 8
    <86a80>   DW_AT_type        : <0x86a84>
 <1><86a84>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86a85>   DW_AT_prototyped  : 1
    <86a85>   DW_AT_sibling     : <0x86a99>
 <2><86a89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a8a>   DW_AT_type        : <0x866db>
 <2><86a8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a8f>   DW_AT_type        : <0x86347>
 <2><86a93>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86a94>   DW_AT_type        : <0x862f8>
 <2><86a98>: Abbrev Number: 0
 <1><86a99>: Abbrev Number: 5 (DW_TAG_typedef)
    <86a9a>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <86a9e>   DW_AT_decl_file   : 12
    <86a9f>   DW_AT_decl_line   : 51
    <86aa0>   DW_AT_decl_column : 24
    <86aa1>   DW_AT_type        : <0x86aa5>
 <1><86aa5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86aa6>   DW_AT_byte_size   : 8
    <86aa6>   DW_AT_type        : <0x86aaa>
 <1><86aaa>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86aab>   DW_AT_prototyped  : 1
    <86aab>   DW_AT_type        : <0x8632a>
    <86aaf>   DW_AT_sibling     : <0x86abe>
 <2><86ab3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ab4>   DW_AT_type        : <0x8632a>
 <2><86ab8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ab9>   DW_AT_type        : <0x86378>
 <2><86abd>: Abbrev Number: 0
 <1><86abe>: Abbrev Number: 5 (DW_TAG_typedef)
    <86abf>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <86ac3>   DW_AT_decl_file   : 12
    <86ac4>   DW_AT_decl_line   : 54
    <86ac5>   DW_AT_decl_column : 23
    <86ac6>   DW_AT_type        : <0x86aca>
 <1><86aca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86acb>   DW_AT_byte_size   : 8
    <86acb>   DW_AT_type        : <0x86acf>
 <1><86acf>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86ad0>   DW_AT_prototyped  : 1
    <86ad0>   DW_AT_type        : <0x862f8>
    <86ad4>   DW_AT_sibling     : <0x86af7>
 <2><86ad8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ad9>   DW_AT_type        : <0x8673b>
 <2><86add>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ade>   DW_AT_type        : <0x8631c>
 <2><86ae2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ae3>   DW_AT_type        : <0x86378>
 <2><86ae7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ae8>   DW_AT_type        : <0x862f8>
 <2><86aec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86aed>   DW_AT_type        : <0x862f8>
 <2><86af1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86af2>   DW_AT_type        : <0x862f8>
 <2><86af6>: Abbrev Number: 0
 <1><86af7>: Abbrev Number: 5 (DW_TAG_typedef)
    <86af8>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <86afc>   DW_AT_decl_file   : 12
    <86afd>   DW_AT_decl_line   : 56
    <86afe>   DW_AT_decl_column : 23
    <86aff>   DW_AT_type        : <0x86b03>
 <1><86b03>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86b04>   DW_AT_byte_size   : 8
    <86b04>   DW_AT_type        : <0x86b08>
 <1><86b08>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86b09>   DW_AT_prototyped  : 1
    <86b09>   DW_AT_type        : <0x862f8>
    <86b0d>   DW_AT_sibling     : <0x86b2b>
 <2><86b11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b12>   DW_AT_type        : <0x866db>
 <2><86b16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b17>   DW_AT_type        : <0x86487>
 <2><86b1b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b1c>   DW_AT_type        : <0x86378>
 <2><86b20>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b21>   DW_AT_type        : <0x862f8>
 <2><86b25>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b26>   DW_AT_type        : <0x862f8>
 <2><86b2a>: Abbrev Number: 0
 <1><86b2b>: Abbrev Number: 5 (DW_TAG_typedef)
    <86b2c>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <86b30>   DW_AT_decl_file   : 12
    <86b31>   DW_AT_decl_line   : 67
    <86b32>   DW_AT_decl_column : 23
    <86b33>   DW_AT_type        : <0x86b37>
 <1><86b37>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86b38>   DW_AT_byte_size   : 8
    <86b38>   DW_AT_type        : <0x86b3c>
 <1><86b3c>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86b3d>   DW_AT_prototyped  : 1
    <86b3d>   DW_AT_type        : <0x862f8>
    <86b41>   DW_AT_sibling     : <0x86b4b>
 <2><86b45>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b46>   DW_AT_type        : <0x862f8>
 <2><86b4a>: Abbrev Number: 0
 <1><86b4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <86b4c>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <86b50>   DW_AT_decl_file   : 12
    <86b51>   DW_AT_decl_line   : 68
    <86b52>   DW_AT_decl_column : 23
    <86b53>   DW_AT_type        : <0x86b57>
 <1><86b57>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86b58>   DW_AT_byte_size   : 8
    <86b58>   DW_AT_type        : <0x86b5c>
 <1><86b5c>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86b5d>   DW_AT_prototyped  : 1
    <86b5d>   DW_AT_type        : <0x862f8>
    <86b61>   DW_AT_sibling     : <0x86b7f>
 <2><86b65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b66>   DW_AT_type        : <0x86a12>
 <2><86b6a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b6b>   DW_AT_type        : <0x86a12>
 <2><86b6f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b70>   DW_AT_type        : <0x86a12>
 <2><86b74>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b75>   DW_AT_type        : <0x86a12>
 <2><86b79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b7a>   DW_AT_type        : <0x86a12>
 <2><86b7e>: Abbrev Number: 0
 <1><86b7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <86b80>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <86b84>   DW_AT_decl_file   : 12
    <86b85>   DW_AT_decl_line   : 69
    <86b86>   DW_AT_decl_column : 23
    <86b87>   DW_AT_type        : <0x86b8b>
 <1><86b8b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86b8c>   DW_AT_byte_size   : 8
    <86b8c>   DW_AT_type        : <0x86b90>
 <1><86b90>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86b91>   DW_AT_prototyped  : 1
    <86b91>   DW_AT_type        : <0x862f8>
    <86b95>   DW_AT_sibling     : <0x86bae>
 <2><86b99>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b9a>   DW_AT_type        : <0x862f8>
 <2><86b9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b9f>   DW_AT_type        : <0x862f8>
 <2><86ba3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ba4>   DW_AT_type        : <0x862f8>
 <2><86ba8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ba9>   DW_AT_type        : <0x862f8>
 <2><86bad>: Abbrev Number: 0
 <1><86bae>: Abbrev Number: 5 (DW_TAG_typedef)
    <86baf>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <86bb3>   DW_AT_decl_file   : 12
    <86bb4>   DW_AT_decl_line   : 73
    <86bb5>   DW_AT_decl_column : 23
    <86bb6>   DW_AT_type        : <0x86bba>
 <1><86bba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86bbb>   DW_AT_byte_size   : 8
    <86bbb>   DW_AT_type        : <0x86bbf>
 <1><86bbf>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86bc0>   DW_AT_prototyped  : 1
    <86bc0>   DW_AT_type        : <0x862f8>
    <86bc4>   DW_AT_sibling     : <0x86bce>
 <2><86bc8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86bc9>   DW_AT_type        : <0x862d5>
 <2><86bcd>: Abbrev Number: 0
 <1><86bce>: Abbrev Number: 5 (DW_TAG_typedef)
    <86bcf>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <86bd3>   DW_AT_decl_file   : 12
    <86bd4>   DW_AT_decl_line   : 74
    <86bd5>   DW_AT_decl_column : 23
    <86bd6>   DW_AT_type        : <0x86bda>
 <1><86bda>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86bdb>   DW_AT_byte_size   : 8
    <86bdb>   DW_AT_type        : <0x86bdf>
 <1><86bdf>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86be0>   DW_AT_prototyped  : 1
    <86be0>   DW_AT_type        : <0x862f8>
    <86be4>   DW_AT_sibling     : <0x86bf3>
 <2><86be8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86be9>   DW_AT_type        : <0x862d5>
 <2><86bed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86bee>   DW_AT_type        : <0x862c9>
 <2><86bf2>: Abbrev Number: 0
 <1><86bf3>: Abbrev Number: 5 (DW_TAG_typedef)
    <86bf4>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <86bf8>   DW_AT_decl_file   : 12
    <86bf9>   DW_AT_decl_line   : 80
    <86bfa>   DW_AT_decl_column : 23
    <86bfb>   DW_AT_type        : <0x86962>
 <1><86bff>: Abbrev Number: 5 (DW_TAG_typedef)
    <86c00>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <86c04>   DW_AT_decl_file   : 12
    <86c05>   DW_AT_decl_line   : 83
    <86c06>   DW_AT_decl_column : 23
    <86c07>   DW_AT_type        : <0x86b37>
 <1><86c0b>: Abbrev Number: 5 (DW_TAG_typedef)
    <86c0c>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <86c10>   DW_AT_decl_file   : 12
    <86c11>   DW_AT_decl_line   : 86
    <86c12>   DW_AT_decl_column : 23
    <86c13>   DW_AT_type        : <0x869c0>
 <1><86c17>: Abbrev Number: 5 (DW_TAG_typedef)
    <86c18>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <86c1c>   DW_AT_decl_file   : 12
    <86c1d>   DW_AT_decl_line   : 89
    <86c1e>   DW_AT_decl_column : 23
    <86c1f>   DW_AT_type        : <0x869c0>
 <1><86c23>: Abbrev Number: 5 (DW_TAG_typedef)
    <86c24>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <86c28>   DW_AT_decl_file   : 12
    <86c29>   DW_AT_decl_line   : 91
    <86c2a>   DW_AT_decl_column : 23
    <86c2b>   DW_AT_type        : <0x86c2f>
 <1><86c2f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86c30>   DW_AT_byte_size   : 8
    <86c30>   DW_AT_type        : <0x86c34>
 <1><86c34>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86c35>   DW_AT_prototyped  : 1
    <86c35>   DW_AT_sibling     : <0x86c3f>
 <2><86c39>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86c3a>   DW_AT_type        : <0x86c3f>
 <2><86c3e>: Abbrev Number: 0
 <1><86c3f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86c40>   DW_AT_byte_size   : 8
    <86c40>   DW_AT_type        : <0x86912>
 <1><86c44>: Abbrev Number: 19 (DW_TAG_structure_type)
    <86c45>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <86c49>   DW_AT_byte_size   : 224
    <86c4a>   DW_AT_decl_file   : 12
    <86c4b>   DW_AT_decl_line   : 93
    <86c4c>   DW_AT_decl_column : 16
    <86c4d>   DW_AT_sibling     : <0x86dbe>
 <2><86c51>: Abbrev Number: 2 (DW_TAG_member)
    <86c52>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <86c56>   DW_AT_decl_file   : 12
    <86c57>   DW_AT_decl_line   : 94
    <86c58>   DW_AT_decl_column : 23
    <86c59>   DW_AT_type        : <0x8691e>
    <86c5d>   DW_AT_data_member_location: 0
 <2><86c5e>: Abbrev Number: 2 (DW_TAG_member)
    <86c5f>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <86c63>   DW_AT_decl_file   : 12
    <86c64>   DW_AT_decl_line   : 95
    <86c65>   DW_AT_decl_column : 23
    <86c66>   DW_AT_type        : <0x86934>
    <86c6a>   DW_AT_data_member_location: 8
 <2><86c6b>: Abbrev Number: 2 (DW_TAG_member)
    <86c6c>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <86c70>   DW_AT_decl_file   : 12
    <86c71>   DW_AT_decl_line   : 96
    <86c72>   DW_AT_decl_column : 23
    <86c73>   DW_AT_type        : <0x8694a>
    <86c77>   DW_AT_data_member_location: 16
 <2><86c78>: Abbrev Number: 2 (DW_TAG_member)
    <86c79>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <86c7d>   DW_AT_decl_file   : 12
    <86c7e>   DW_AT_decl_line   : 97
    <86c7f>   DW_AT_decl_column : 23
    <86c80>   DW_AT_type        : <0x86956>
    <86c84>   DW_AT_data_member_location: 24
 <2><86c85>: Abbrev Number: 2 (DW_TAG_member)
    <86c86>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <86c8a>   DW_AT_decl_file   : 12
    <86c8b>   DW_AT_decl_line   : 98
    <86c8c>   DW_AT_decl_column : 23
    <86c8d>   DW_AT_type        : <0x86972>
    <86c91>   DW_AT_data_member_location: 32
 <2><86c92>: Abbrev Number: 2 (DW_TAG_member)
    <86c93>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <86c97>   DW_AT_decl_file   : 12
    <86c98>   DW_AT_decl_line   : 99
    <86c99>   DW_AT_decl_column : 23
    <86c9a>   DW_AT_type        : <0x8699c>
    <86c9e>   DW_AT_data_member_location: 40
 <2><86c9f>: Abbrev Number: 2 (DW_TAG_member)
    <86ca0>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <86ca4>   DW_AT_decl_file   : 12
    <86ca5>   DW_AT_decl_line   : 100
    <86ca6>   DW_AT_decl_column : 23
    <86ca7>   DW_AT_type        : <0x869b4>
    <86cab>   DW_AT_data_member_location: 48
 <2><86cac>: Abbrev Number: 2 (DW_TAG_member)
    <86cad>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <86cb1>   DW_AT_decl_file   : 12
    <86cb2>   DW_AT_decl_line   : 101
    <86cb3>   DW_AT_decl_column : 23
    <86cb4>   DW_AT_type        : <0x869d9>
    <86cb8>   DW_AT_data_member_location: 56
 <2><86cb9>: Abbrev Number: 2 (DW_TAG_member)
    <86cba>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <86cbe>   DW_AT_decl_file   : 12
    <86cbf>   DW_AT_decl_line   : 102
    <86cc0>   DW_AT_decl_column : 23
    <86cc1>   DW_AT_type        : <0x869e5>
    <86cc5>   DW_AT_data_member_location: 64
 <2><86cc6>: Abbrev Number: 2 (DW_TAG_member)
    <86cc7>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <86ccb>   DW_AT_decl_file   : 12
    <86ccc>   DW_AT_decl_line   : 103
    <86ccd>   DW_AT_decl_column : 23
    <86cce>   DW_AT_type        : <0x869f1>
    <86cd2>   DW_AT_data_member_location: 72
 <2><86cd3>: Abbrev Number: 2 (DW_TAG_member)
    <86cd4>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <86cd8>   DW_AT_decl_file   : 12
    <86cd9>   DW_AT_decl_line   : 104
    <86cda>   DW_AT_decl_column : 23
    <86cdb>   DW_AT_type        : <0x86a17>
    <86cdf>   DW_AT_data_member_location: 80
 <2><86ce0>: Abbrev Number: 2 (DW_TAG_member)
    <86ce1>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <86ce5>   DW_AT_decl_file   : 12
    <86ce6>   DW_AT_decl_line   : 105
    <86ce7>   DW_AT_decl_column : 24
    <86ce8>   DW_AT_type        : <0x86a4d>
    <86cec>   DW_AT_data_member_location: 88
 <2><86ced>: Abbrev Number: 2 (DW_TAG_member)
    <86cee>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <86cf2>   DW_AT_decl_file   : 12
    <86cf3>   DW_AT_decl_line   : 106
    <86cf4>   DW_AT_decl_column : 25
    <86cf5>   DW_AT_type        : <0x86a73>
    <86cf9>   DW_AT_data_member_location: 96
 <2><86cfa>: Abbrev Number: 2 (DW_TAG_member)
    <86cfb>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <86cff>   DW_AT_decl_file   : 12
    <86d00>   DW_AT_decl_line   : 107
    <86d01>   DW_AT_decl_column : 23
    <86d02>   DW_AT_type        : <0x86a99>
    <86d06>   DW_AT_data_member_location: 104
 <2><86d07>: Abbrev Number: 2 (DW_TAG_member)
    <86d08>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <86d0c>   DW_AT_decl_file   : 12
    <86d0d>   DW_AT_decl_line   : 108
    <86d0e>   DW_AT_decl_column : 23
    <86d0f>   DW_AT_type        : <0x86b2b>
    <86d13>   DW_AT_data_member_location: 112
 <2><86d14>: Abbrev Number: 2 (DW_TAG_member)
    <86d15>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <86d19>   DW_AT_decl_file   : 12
    <86d1a>   DW_AT_decl_line   : 109
    <86d1b>   DW_AT_decl_column : 23
    <86d1c>   DW_AT_type        : <0x86b4b>
    <86d20>   DW_AT_data_member_location: 120
 <2><86d21>: Abbrev Number: 2 (DW_TAG_member)
    <86d22>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <86d26>   DW_AT_decl_file   : 12
    <86d27>   DW_AT_decl_line   : 110
    <86d28>   DW_AT_decl_column : 23
    <86d29>   DW_AT_type        : <0x86b7f>
    <86d2d>   DW_AT_data_member_location: 128
 <2><86d2e>: Abbrev Number: 2 (DW_TAG_member)
    <86d2f>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <86d33>   DW_AT_decl_file   : 12
    <86d34>   DW_AT_decl_line   : 111
    <86d35>   DW_AT_decl_column : 23
    <86d36>   DW_AT_type        : <0x86bae>
    <86d3a>   DW_AT_data_member_location: 136
 <2><86d3b>: Abbrev Number: 2 (DW_TAG_member)
    <86d3c>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <86d40>   DW_AT_decl_file   : 12
    <86d41>   DW_AT_decl_line   : 112
    <86d42>   DW_AT_decl_column : 23
    <86d43>   DW_AT_type        : <0x86bce>
    <86d47>   DW_AT_data_member_location: 144
 <2><86d48>: Abbrev Number: 2 (DW_TAG_member)
    <86d49>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <86d4d>   DW_AT_decl_file   : 12
    <86d4e>   DW_AT_decl_line   : 113
    <86d4f>   DW_AT_decl_column : 25
    <86d50>   DW_AT_type        : <0x869a8>
    <86d54>   DW_AT_data_member_location: 152
 <2><86d55>: Abbrev Number: 2 (DW_TAG_member)
    <86d56>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <86d5a>   DW_AT_decl_file   : 12
    <86d5b>   DW_AT_decl_line   : 114
    <86d5c>   DW_AT_decl_column : 24
    <86d5d>   DW_AT_type        : <0x86abe>
    <86d61>   DW_AT_data_member_location: 160
 <2><86d62>: Abbrev Number: 2 (DW_TAG_member)
    <86d63>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <86d67>   DW_AT_decl_file   : 12
    <86d68>   DW_AT_decl_line   : 115
    <86d69>   DW_AT_decl_column : 25
    <86d6a>   DW_AT_type        : <0x86af7>
    <86d6e>   DW_AT_data_member_location: 168
 <2><86d6f>: Abbrev Number: 2 (DW_TAG_member)
    <86d70>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <86d74>   DW_AT_decl_file   : 12
    <86d75>   DW_AT_decl_line   : 116
    <86d76>   DW_AT_decl_column : 23
    <86d77>   DW_AT_type        : <0x86a23>
    <86d7b>   DW_AT_data_member_location: 176
 <2><86d7c>: Abbrev Number: 2 (DW_TAG_member)
    <86d7d>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <86d81>   DW_AT_decl_file   : 12
    <86d82>   DW_AT_decl_line   : 117
    <86d83>   DW_AT_decl_column : 23
    <86d84>   DW_AT_type        : <0x86bf3>
    <86d88>   DW_AT_data_member_location: 184
 <2><86d89>: Abbrev Number: 2 (DW_TAG_member)
    <86d8a>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <86d8e>   DW_AT_decl_file   : 12
    <86d8f>   DW_AT_decl_line   : 118
    <86d90>   DW_AT_decl_column : 22
    <86d91>   DW_AT_type        : <0x86bff>
    <86d95>   DW_AT_data_member_location: 192
 <2><86d96>: Abbrev Number: 2 (DW_TAG_member)
    <86d97>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <86d9b>   DW_AT_decl_file   : 12
    <86d9c>   DW_AT_decl_line   : 119
    <86d9d>   DW_AT_decl_column : 23
    <86d9e>   DW_AT_type        : <0x86c0b>
    <86da2>   DW_AT_data_member_location: 200
 <2><86da3>: Abbrev Number: 2 (DW_TAG_member)
    <86da4>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <86da8>   DW_AT_decl_file   : 12
    <86da9>   DW_AT_decl_line   : 120
    <86daa>   DW_AT_decl_column : 22
    <86dab>   DW_AT_type        : <0x86c17>
    <86daf>   DW_AT_data_member_location: 208
 <2><86db0>: Abbrev Number: 2 (DW_TAG_member)
    <86db1>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <86db5>   DW_AT_decl_file   : 12
    <86db6>   DW_AT_decl_line   : 121
    <86db7>   DW_AT_decl_column : 23
    <86db8>   DW_AT_type        : <0x86c23>
    <86dbc>   DW_AT_data_member_location: 216
 <2><86dbd>: Abbrev Number: 0
 <1><86dbe>: Abbrev Number: 5 (DW_TAG_typedef)
    <86dbf>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <86dc3>   DW_AT_decl_file   : 12
    <86dc4>   DW_AT_decl_line   : 122
    <86dc5>   DW_AT_decl_column : 3
    <86dc6>   DW_AT_type        : <0x86c44>
 <1><86dca>: Abbrev Number: 74 (DW_TAG_structure_type)
    <86dcb>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <86dcf>   DW_AT_byte_size   : 20848
    <86dd1>   DW_AT_decl_file   : 13
    <86dd2>   DW_AT_decl_line   : 349
    <86dd4>   DW_AT_decl_column : 16
    <86dd5>   DW_AT_sibling     : <0x86e54>
 <2><86dd9>: Abbrev Number: 14 (DW_TAG_member)
    <86dda>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <86dde>   DW_AT_decl_file   : 13
    <86ddf>   DW_AT_decl_line   : 350
    <86de1>   DW_AT_decl_column : 18
    <86de2>   DW_AT_type        : <0x862f8>
    <86de6>   DW_AT_data_member_location: 0
 <2><86de7>: Abbrev Number: 14 (DW_TAG_member)
    <86de8>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <86dec>   DW_AT_decl_file   : 13
    <86ded>   DW_AT_decl_line   : 351
    <86def>   DW_AT_decl_column : 18
    <86df0>   DW_AT_type        : <0x863a6>
    <86df4>   DW_AT_data_member_location: 8
 <2><86df5>: Abbrev Number: 14 (DW_TAG_member)
    <86df6>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <86dfa>   DW_AT_decl_file   : 13
    <86dfb>   DW_AT_decl_line   : 352
    <86dfd>   DW_AT_decl_column : 18
    <86dfe>   DW_AT_type        : <0x86474>
    <86e02>   DW_AT_data_member_location: 16
 <2><86e03>: Abbrev Number: 14 (DW_TAG_member)
    <86e04>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <86e08>   DW_AT_decl_file   : 13
    <86e09>   DW_AT_decl_line   : 353
    <86e0b>   DW_AT_decl_column : 18
    <86e0c>   DW_AT_type        : <0x8632a>
    <86e10>   DW_AT_data_member_location: 40
 <2><86e11>: Abbrev Number: 14 (DW_TAG_member)
    <86e12>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <86e16>   DW_AT_decl_file   : 13
    <86e17>   DW_AT_decl_line   : 354
    <86e19>   DW_AT_decl_column : 18
    <86e1a>   DW_AT_type        : <0x86dbe>
    <86e1e>   DW_AT_data_member_location: 48
 <2><86e1f>: Abbrev Number: 37 (DW_TAG_member)
    <86e20>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <86e24>   DW_AT_decl_file   : 13
    <86e24>   DW_AT_decl_line   : 355
    <86e26>   DW_AT_decl_column : 18
    <86e26>   DW_AT_type        : <0x86e54>
    <86e2a>   DW_AT_data_member_location: 272
 <2><86e2c>: Abbrev Number: 37 (DW_TAG_member)
    <86e2d>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <86e31>   DW_AT_decl_file   : 13
    <86e31>   DW_AT_decl_line   : 356
    <86e33>   DW_AT_decl_column : 18
    <86e33>   DW_AT_type        : <0x862f8>
    <86e37>   DW_AT_data_member_location: 20832
 <2><86e39>: Abbrev Number: 37 (DW_TAG_member)
    <86e3a>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <86e3e>   DW_AT_decl_file   : 13
    <86e3e>   DW_AT_decl_line   : 357
    <86e40>   DW_AT_decl_column : 18
    <86e40>   DW_AT_type        : <0x862f8>
    <86e44>   DW_AT_data_member_location: 20836
 <2><86e46>: Abbrev Number: 37 (DW_TAG_member)
    <86e47>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <86e4b>   DW_AT_decl_file   : 13
    <86e4b>   DW_AT_decl_line   : 358
    <86e4d>   DW_AT_decl_column : 18
    <86e4d>   DW_AT_type        : <0x86439>
    <86e51>   DW_AT_data_member_location: 20840
 <2><86e53>: Abbrev Number: 0
 <1><86e54>: Abbrev Number: 18 (DW_TAG_array_type)
    <86e55>   DW_AT_type        : <0x8684b>
    <86e59>   DW_AT_sibling     : <0x86e65>
 <2><86e5d>: Abbrev Number: 75 (DW_TAG_subrange_type)
    <86e5e>   DW_AT_type        : <0x862e3>
    <86e62>   DW_AT_upper_bound : 256
 <2><86e64>: Abbrev Number: 0
 <1><86e65>: Abbrev Number: 30 (DW_TAG_typedef)
    <86e66>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <86e6a>   DW_AT_decl_file   : 13
    <86e6b>   DW_AT_decl_line   : 359
    <86e6d>   DW_AT_decl_column : 3
    <86e6e>   DW_AT_type        : <0x86dca>
 <1><86e72>: Abbrev Number: 17 (DW_TAG_variable)
    <86e73>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <86e77>   DW_AT_decl_file   : 13
    <86e78>   DW_AT_decl_line   : 361
    <86e7a>   DW_AT_decl_column : 21
    <86e7b>   DW_AT_type        : <0x86e65>
    <86e7f>   DW_AT_external    : 1
    <86e7f>   DW_AT_declaration : 1
 <1><86e7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <86e80>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <86e84>   DW_AT_decl_file   : 14
    <86e85>   DW_AT_decl_line   : 13
    <86e86>   DW_AT_decl_column : 30
    <86e87>   DW_AT_type        : <0x86e8b>
 <1><86e8b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86e8c>   DW_AT_prototyped  : 1
    <86e8c>   DW_AT_type        : <0x862dc>
    <86e90>   DW_AT_sibling     : <0x86ea4>
 <2><86e94>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86e95>   DW_AT_type        : <0x862dc>
 <2><86e99>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86e9a>   DW_AT_type        : <0x862dc>
 <2><86e9e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86e9f>   DW_AT_type        : <0x8631c>
 <2><86ea3>: Abbrev Number: 0
 <1><86ea4>: Abbrev Number: 5 (DW_TAG_typedef)
    <86ea5>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <86ea9>   DW_AT_decl_file   : 14
    <86eaa>   DW_AT_decl_line   : 14
    <86eab>   DW_AT_decl_column : 15
    <86eac>   DW_AT_type        : <0x86eb0>
 <1><86eb0>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <86eb1>   DW_AT_prototyped  : 1
    <86eb1>   DW_AT_sibling     : <0x86ee3>
 <2><86eb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86eb6>   DW_AT_type        : <0x86ee3>
 <2><86eba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ebb>   DW_AT_type        : <0x86ee3>
 <2><86ebf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ec0>   DW_AT_type        : <0x862f8>
 <2><86ec4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ec5>   DW_AT_type        : <0x862f8>
 <2><86ec9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86eca>   DW_AT_type        : <0x862f8>
 <2><86ece>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ecf>   DW_AT_type        : <0x862f8>
 <2><86ed3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ed4>   DW_AT_type        : <0x862f8>
 <2><86ed8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ed9>   DW_AT_type        : <0x86ee8>
 <2><86edd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86ede>   DW_AT_type        : <0x8631c>
 <2><86ee2>: Abbrev Number: 0
 <1><86ee3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86ee4>   DW_AT_byte_size   : 8
    <86ee4>   DW_AT_type        : <0x862c9>
 <1><86ee8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86ee9>   DW_AT_byte_size   : 8
    <86ee9>   DW_AT_type        : <0x86e7f>
 <1><86eed>: Abbrev Number: 31 (DW_TAG_structure_type)
    <86eee>   DW_AT_byte_size   : 16
    <86eef>   DW_AT_decl_file   : 14
    <86ef0>   DW_AT_decl_line   : 26
    <86ef1>   DW_AT_decl_column : 3
    <86ef2>   DW_AT_sibling     : <0x86f2b>
 <2><86ef6>: Abbrev Number: 2 (DW_TAG_member)
    <86ef7>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <86efb>   DW_AT_decl_file   : 14
    <86efc>   DW_AT_decl_line   : 27
    <86efd>   DW_AT_decl_column : 8
    <86efe>   DW_AT_type        : <0x862f8>
    <86f02>   DW_AT_data_member_location: 0
 <2><86f03>: Abbrev Number: 2 (DW_TAG_member)
    <86f04>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <86f08>   DW_AT_decl_file   : 14
    <86f09>   DW_AT_decl_line   : 27
    <86f0a>   DW_AT_decl_column : 16
    <86f0b>   DW_AT_type        : <0x862f8>
    <86f0f>   DW_AT_data_member_location: 4
 <2><86f10>: Abbrev Number: 2 (DW_TAG_member)
    <86f11>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <86f15>   DW_AT_decl_file   : 14
    <86f16>   DW_AT_decl_line   : 27
    <86f17>   DW_AT_decl_column : 24
    <86f18>   DW_AT_type        : <0x862f8>
    <86f1c>   DW_AT_data_member_location: 8
 <2><86f1d>: Abbrev Number: 2 (DW_TAG_member)
    <86f1e>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <86f22>   DW_AT_decl_file   : 14
    <86f23>   DW_AT_decl_line   : 27
    <86f24>   DW_AT_decl_column : 32
    <86f25>   DW_AT_type        : <0x862f8>
    <86f29>   DW_AT_data_member_location: 12
 <2><86f2a>: Abbrev Number: 0
 <1><86f2b>: Abbrev Number: 44 (DW_TAG_union_type)
    <86f2c>   DW_AT_byte_size   : 16
    <86f2c>   DW_AT_decl_file   : 14
    <86f2d>   DW_AT_decl_line   : 25
    <86f2e>   DW_AT_decl_column : 2
    <86f2e>   DW_AT_sibling     : <0x86f43>
 <2><86f32>: Abbrev Number: 36 (DW_TAG_member)
    <86f33>   DW_AT_type        : <0x86eed>
 <2><86f37>: Abbrev Number: 45 (DW_TAG_member)
    <86f38>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <86f3c>   DW_AT_decl_file   : 14
    <86f3d>   DW_AT_decl_line   : 29
    <86f3e>   DW_AT_decl_column : 7
    <86f3e>   DW_AT_type        : <0x86f43>
 <2><86f42>: Abbrev Number: 0
 <1><86f43>: Abbrev Number: 18 (DW_TAG_array_type)
    <86f44>   DW_AT_type        : <0x862f8>
    <86f48>   DW_AT_sibling     : <0x86f53>
 <2><86f4c>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <86f4d>   DW_AT_type        : <0x862e3>
    <86f51>   DW_AT_upper_bound : 3
 <2><86f52>: Abbrev Number: 0
 <1><86f53>: Abbrev Number: 31 (DW_TAG_structure_type)
    <86f54>   DW_AT_byte_size   : 16
    <86f55>   DW_AT_decl_file   : 14
    <86f56>   DW_AT_decl_line   : 32
    <86f57>   DW_AT_decl_column : 3
    <86f58>   DW_AT_sibling     : <0x86f91>
 <2><86f5c>: Abbrev Number: 2 (DW_TAG_member)
    <86f5d>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <86f61>   DW_AT_decl_file   : 14
    <86f62>   DW_AT_decl_line   : 33
    <86f63>   DW_AT_decl_column : 8
    <86f64>   DW_AT_type        : <0x862f8>
    <86f68>   DW_AT_data_member_location: 0
 <2><86f69>: Abbrev Number: 2 (DW_TAG_member)
    <86f6a>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <86f6e>   DW_AT_decl_file   : 14
    <86f6f>   DW_AT_decl_line   : 33
    <86f70>   DW_AT_decl_column : 20
    <86f71>   DW_AT_type        : <0x862f8>
    <86f75>   DW_AT_data_member_location: 4
 <2><86f76>: Abbrev Number: 2 (DW_TAG_member)
    <86f77>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <86f7b>   DW_AT_decl_file   : 14
    <86f7c>   DW_AT_decl_line   : 33
    <86f7d>   DW_AT_decl_column : 32
    <86f7e>   DW_AT_type        : <0x862f8>
    <86f82>   DW_AT_data_member_location: 8
 <2><86f83>: Abbrev Number: 2 (DW_TAG_member)
    <86f84>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <86f88>   DW_AT_decl_file   : 14
    <86f89>   DW_AT_decl_line   : 33
    <86f8a>   DW_AT_decl_column : 44
    <86f8b>   DW_AT_type        : <0x862f8>
    <86f8f>   DW_AT_data_member_location: 12
 <2><86f90>: Abbrev Number: 0
 <1><86f91>: Abbrev Number: 44 (DW_TAG_union_type)
    <86f92>   DW_AT_byte_size   : 16
    <86f92>   DW_AT_decl_file   : 14
    <86f93>   DW_AT_decl_line   : 31
    <86f94>   DW_AT_decl_column : 2
    <86f94>   DW_AT_sibling     : <0x86fa9>
 <2><86f98>: Abbrev Number: 36 (DW_TAG_member)
    <86f99>   DW_AT_type        : <0x86f53>
 <2><86f9d>: Abbrev Number: 45 (DW_TAG_member)
    <86f9e>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <86fa2>   DW_AT_decl_file   : 14
    <86fa3>   DW_AT_decl_line   : 35
    <86fa4>   DW_AT_decl_column : 7
    <86fa4>   DW_AT_type        : <0x86f43>
 <2><86fa8>: Abbrev Number: 0
 <1><86fa9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <86faa>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <86fae>   DW_AT_byte_size   : 216
    <86faf>   DW_AT_decl_file   : 14
    <86fb0>   DW_AT_decl_line   : 16
    <86fb1>   DW_AT_decl_column : 16
    <86fb2>   DW_AT_sibling     : <0x870c6>
 <2><86fb6>: Abbrev Number: 13 (DW_TAG_member)
    <86fb7>   DW_AT_name        : id
    <86fba>   DW_AT_decl_file   : 14
    <86fbb>   DW_AT_decl_line   : 17
    <86fbc>   DW_AT_decl_column : 6
    <86fbd>   DW_AT_type        : <0x862f8>
    <86fc1>   DW_AT_data_member_location: 0
 <2><86fc2>: Abbrev Number: 2 (DW_TAG_member)
    <86fc3>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <86fc7>   DW_AT_decl_file   : 14
    <86fc8>   DW_AT_decl_line   : 18
    <86fc9>   DW_AT_decl_column : 6
    <86fca>   DW_AT_type        : <0x862f8>
    <86fce>   DW_AT_data_member_location: 4
 <2><86fcf>: Abbrev Number: 2 (DW_TAG_member)
    <86fd0>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <86fd4>   DW_AT_decl_file   : 14
    <86fd5>   DW_AT_decl_line   : 19
    <86fd6>   DW_AT_decl_column : 18
    <86fd7>   DW_AT_type        : <0x870c6>
    <86fdb>   DW_AT_data_member_location: 8
 <2><86fdc>: Abbrev Number: 2 (DW_TAG_member)
    <86fdd>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <86fe1>   DW_AT_decl_file   : 14
    <86fe2>   DW_AT_decl_line   : 20
    <86fe3>   DW_AT_decl_column : 6
    <86fe4>   DW_AT_type        : <0x862f8>
    <86fe8>   DW_AT_data_member_location: 16
 <2><86fe9>: Abbrev Number: 2 (DW_TAG_member)
    <86fea>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <86fee>   DW_AT_decl_file   : 14
    <86fef>   DW_AT_decl_line   : 21
    <86ff0>   DW_AT_decl_column : 6
    <86ff1>   DW_AT_type        : <0x862f8>
    <86ff5>   DW_AT_data_member_location: 20
 <2><86ff6>: Abbrev Number: 2 (DW_TAG_member)
    <86ff7>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <86ffb>   DW_AT_decl_file   : 14
    <86ffc>   DW_AT_decl_line   : 22
    <86ffd>   DW_AT_decl_column : 6
    <86ffe>   DW_AT_type        : <0x862f8>
    <87002>   DW_AT_data_member_location: 24
 <2><87003>: Abbrev Number: 2 (DW_TAG_member)
    <87004>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <87008>   DW_AT_decl_file   : 14
    <87009>   DW_AT_decl_line   : 23
    <8700a>   DW_AT_decl_column : 8
    <8700b>   DW_AT_type        : <0x8631c>
    <8700f>   DW_AT_data_member_location: 32
 <2><87010>: Abbrev Number: 2 (DW_TAG_member)
    <87011>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <87015>   DW_AT_decl_file   : 14
    <87016>   DW_AT_decl_line   : 24
    <87017>   DW_AT_decl_column : 8
    <87018>   DW_AT_type        : <0x862c2>
    <8701c>   DW_AT_data_member_location: 40
 <2><8701d>: Abbrev Number: 2 (DW_TAG_member)
    <8701e>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <87022>   DW_AT_decl_file   : 14
    <87023>   DW_AT_decl_line   : 24
    <87024>   DW_AT_decl_column : 16
    <87025>   DW_AT_type        : <0x862c2>
    <87029>   DW_AT_data_member_location: 44
 <2><8702a>: Abbrev Number: 46 (DW_TAG_member)
    <8702b>   DW_AT_type        : <0x86f2b>
    <8702f>   DW_AT_data_member_location: 48
 <2><87030>: Abbrev Number: 46 (DW_TAG_member)
    <87031>   DW_AT_type        : <0x86f91>
    <87035>   DW_AT_data_member_location: 64
 <2><87036>: Abbrev Number: 2 (DW_TAG_member)
    <87037>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <8703b>   DW_AT_decl_file   : 14
    <8703c>   DW_AT_decl_line   : 37
    <8703d>   DW_AT_decl_column : 8
    <8703e>   DW_AT_type        : <0x862c2>
    <87042>   DW_AT_data_member_location: 80
 <2><87043>: Abbrev Number: 2 (DW_TAG_member)
    <87044>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <87048>   DW_AT_decl_file   : 14
    <87049>   DW_AT_decl_line   : 37
    <8704a>   DW_AT_decl_column : 15
    <8704b>   DW_AT_type        : <0x862c2>
    <8704f>   DW_AT_data_member_location: 84
 <2><87050>: Abbrev Number: 2 (DW_TAG_member)
    <87051>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <87055>   DW_AT_decl_file   : 14
    <87056>   DW_AT_decl_line   : 37
    <87057>   DW_AT_decl_column : 22
    <87058>   DW_AT_type        : <0x862c2>
    <8705c>   DW_AT_data_member_location: 88
 <2><8705d>: Abbrev Number: 2 (DW_TAG_member)
    <8705e>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <87062>   DW_AT_decl_file   : 14
    <87063>   DW_AT_decl_line   : 37
    <87064>   DW_AT_decl_column : 29
    <87065>   DW_AT_type        : <0x862c2>
    <87069>   DW_AT_data_member_location: 92
 <2><8706a>: Abbrev Number: 2 (DW_TAG_member)
    <8706b>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <8706f>   DW_AT_decl_file   : 14
    <87070>   DW_AT_decl_line   : 38
    <87071>   DW_AT_decl_column : 15
    <87072>   DW_AT_type        : <0x862dc>
    <87076>   DW_AT_data_member_location: 96
 <2><87077>: Abbrev Number: 2 (DW_TAG_member)
    <87078>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <8707c>   DW_AT_decl_file   : 14
    <8707d>   DW_AT_decl_line   : 38
    <8707e>   DW_AT_decl_column : 25
    <8707f>   DW_AT_type        : <0x862dc>
    <87083>   DW_AT_data_member_location: 100
 <2><87084>: Abbrev Number: 2 (DW_TAG_member)
    <87085>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <87089>   DW_AT_decl_file   : 14
    <8708a>   DW_AT_decl_line   : 39
    <8708b>   DW_AT_decl_column : 9
    <8708c>   DW_AT_type        : <0x870ea>
    <87090>   DW_AT_data_member_location: 104
 <2><87091>: Abbrev Number: 2 (DW_TAG_member)
    <87092>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <87096>   DW_AT_decl_file   : 14
    <87097>   DW_AT_decl_line   : 40
    <87098>   DW_AT_decl_column : 17
    <87099>   DW_AT_type        : <0x87108>
    <8709d>   DW_AT_data_member_location: 112
 <2><8709e>: Abbrev Number: 2 (DW_TAG_member)
    <8709f>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <870a3>   DW_AT_decl_file   : 14
    <870a4>   DW_AT_decl_line   : 41
    <870a5>   DW_AT_decl_column : 10
    <870a6>   DW_AT_type        : <0x87126>
    <870aa>   DW_AT_data_member_location: 120
 <2><870ab>: Abbrev Number: 2 (DW_TAG_member)
    <870ac>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <870b0>   DW_AT_decl_file   : 14
    <870b1>   DW_AT_decl_line   : 42
    <870b2>   DW_AT_decl_column : 11
    <870b3>   DW_AT_type        : <0x8712b>
    <870b7>   DW_AT_data_member_location: 128
 <2><870b8>: Abbrev Number: 2 (DW_TAG_member)
    <870b9>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <870bd>   DW_AT_decl_file   : 14
    <870be>   DW_AT_decl_line   : 43
    <870bf>   DW_AT_decl_column : 6
    <870c0>   DW_AT_type        : <0x862f8>
    <870c4>   DW_AT_data_member_location: 208
 <2><870c5>: Abbrev Number: 0
 <1><870c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <870c7>   DW_AT_byte_size   : 8
    <870c7>   DW_AT_type        : <0x86ee3>
 <1><870cb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <870cc>   DW_AT_prototyped  : 1
    <870cc>   DW_AT_sibling     : <0x870e5>
 <2><870d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870d1>   DW_AT_type        : <0x870e5>
 <2><870d5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870d6>   DW_AT_type        : <0x862f8>
 <2><870da>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870db>   DW_AT_type        : <0x862f8>
 <2><870df>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870e0>   DW_AT_type        : <0x862dc>
 <2><870e4>: Abbrev Number: 0
 <1><870e5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <870e6>   DW_AT_byte_size   : 8
    <870e6>   DW_AT_type        : <0x86fa9>
 <1><870ea>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <870eb>   DW_AT_byte_size   : 8
    <870eb>   DW_AT_type        : <0x870cb>
 <1><870ef>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <870f0>   DW_AT_prototyped  : 1
    <870f0>   DW_AT_type        : <0x862dc>
    <870f4>   DW_AT_sibling     : <0x87108>
 <2><870f8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870f9>   DW_AT_type        : <0x870e5>
 <2><870fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <870fe>   DW_AT_type        : <0x862f8>
 <2><87102>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87103>   DW_AT_type        : <0x862f8>
 <2><87107>: Abbrev Number: 0
 <1><87108>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87109>   DW_AT_byte_size   : 8
    <87109>   DW_AT_type        : <0x870ef>
 <1><8710d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <8710e>   DW_AT_prototyped  : 1
    <8710e>   DW_AT_type        : <0x8631c>
    <87112>   DW_AT_sibling     : <0x87126>
 <2><87116>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87117>   DW_AT_type        : <0x8631c>
 <2><8711b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8711c>   DW_AT_type        : <0x862f8>
 <2><87120>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87121>   DW_AT_type        : <0x86347>
 <2><87125>: Abbrev Number: 0
 <1><87126>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87127>   DW_AT_byte_size   : 8
    <87127>   DW_AT_type        : <0x8710d>
 <1><8712b>: Abbrev Number: 18 (DW_TAG_array_type)
    <8712c>   DW_AT_type        : <0x8713b>
    <87130>   DW_AT_sibling     : <0x8713b>
 <2><87134>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <87135>   DW_AT_type        : <0x862e3>
    <87139>   DW_AT_upper_bound : 9
 <2><8713a>: Abbrev Number: 0
 <1><8713b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8713c>   DW_AT_byte_size   : 8
    <8713c>   DW_AT_type        : <0x87140>
 <1><87140>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87141>   DW_AT_byte_size   : 8
    <87141>   DW_AT_type        : <0x86ea4>
 <1><87145>: Abbrev Number: 5 (DW_TAG_typedef)
    <87146>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <8714a>   DW_AT_decl_file   : 14
    <8714b>   DW_AT_decl_line   : 44
    <8714c>   DW_AT_decl_column : 3
    <8714d>   DW_AT_type        : <0x86fa9>
 <1><87151>: Abbrev Number: 19 (DW_TAG_structure_type)
    <87152>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <87156>   DW_AT_byte_size   : 12
    <87157>   DW_AT_decl_file   : 15
    <87158>   DW_AT_decl_line   : 139
    <87159>   DW_AT_decl_column : 16
    <8715a>   DW_AT_sibling     : <0x87183>
 <2><8715e>: Abbrev Number: 13 (DW_TAG_member)
    <8715f>   DW_AT_name        : ch
    <87162>   DW_AT_decl_file   : 15
    <87163>   DW_AT_decl_line   : 140
    <87164>   DW_AT_decl_column : 14
    <87165>   DW_AT_type        : <0x86353>
    <87169>   DW_AT_data_member_location: 0
 <2><8716a>: Abbrev Number: 13 (DW_TAG_member)
    <8716b>   DW_AT_name        : fg
    <8716e>   DW_AT_decl_file   : 15
    <8716f>   DW_AT_decl_line   : 141
    <87170>   DW_AT_decl_column : 14
    <87171>   DW_AT_type        : <0x862dc>
    <87175>   DW_AT_data_member_location: 4
 <2><87176>: Abbrev Number: 13 (DW_TAG_member)
    <87177>   DW_AT_name        : bg
    <8717a>   DW_AT_decl_file   : 15
    <8717b>   DW_AT_decl_line   : 141
    <8717c>   DW_AT_decl_column : 18
    <8717d>   DW_AT_type        : <0x862dc>
    <87181>   DW_AT_data_member_location: 8
 <2><87182>: Abbrev Number: 0
 <1><87183>: Abbrev Number: 5 (DW_TAG_typedef)
    <87184>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <87188>   DW_AT_decl_file   : 15
    <87189>   DW_AT_decl_line   : 142
    <8718a>   DW_AT_decl_column : 3
    <8718b>   DW_AT_type        : <0x87151>
 <1><8718f>: Abbrev Number: 19 (DW_TAG_structure_type)
    <87190>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <87194>   DW_AT_byte_size   : 208
    <87195>   DW_AT_decl_file   : 15
    <87196>   DW_AT_decl_line   : 144
    <87197>   DW_AT_decl_column : 16
    <87198>   DW_AT_sibling     : <0x87352>
 <2><8719c>: Abbrev Number: 13 (DW_TAG_member)
    <8719d>   DW_AT_name        : id
    <871a0>   DW_AT_decl_file   : 15
    <871a1>   DW_AT_decl_line   : 146
    <871a2>   DW_AT_decl_column : 6
    <871a3>   DW_AT_type        : <0x862f8>
    <871a7>   DW_AT_data_member_location: 0
 <2><871a8>: Abbrev Number: 2 (DW_TAG_member)
    <871a9>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <871ad>   DW_AT_decl_file   : 15
    <871ae>   DW_AT_decl_line   : 147
    <871af>   DW_AT_decl_column : 9
    <871b0>   DW_AT_type        : <0x862f8>
    <871b4>   DW_AT_data_member_location: 4
 <2><871b5>: Abbrev Number: 2 (DW_TAG_member)
    <871b6>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <871ba>   DW_AT_decl_file   : 15
    <871bb>   DW_AT_decl_line   : 148
    <871bc>   DW_AT_decl_column : 21
    <871bd>   DW_AT_type        : <0x870c6>
    <871c1>   DW_AT_data_member_location: 8
 <2><871c2>: Abbrev Number: 2 (DW_TAG_member)
    <871c3>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <871c7>   DW_AT_decl_file   : 15
    <871c8>   DW_AT_decl_line   : 149
    <871c9>   DW_AT_decl_column : 9
    <871ca>   DW_AT_type        : <0x862f8>
    <871ce>   DW_AT_data_member_location: 16
 <2><871cf>: Abbrev Number: 2 (DW_TAG_member)
    <871d0>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <871d4>   DW_AT_decl_file   : 15
    <871d5>   DW_AT_decl_line   : 150
    <871d6>   DW_AT_decl_column : 9
    <871d7>   DW_AT_type        : <0x862f8>
    <871db>   DW_AT_data_member_location: 20
 <2><871dc>: Abbrev Number: 2 (DW_TAG_member)
    <871dd>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <871e1>   DW_AT_decl_file   : 15
    <871e2>   DW_AT_decl_line   : 151
    <871e3>   DW_AT_decl_column : 20
    <871e4>   DW_AT_type        : <0x86ee3>
    <871e8>   DW_AT_data_member_location: 24
 <2><871e9>: Abbrev Number: 13 (DW_TAG_member)
    <871ea>   DW_AT_name        : w
    <871ec>   DW_AT_decl_file   : 15
    <871ed>   DW_AT_decl_line   : 152
    <871ee>   DW_AT_decl_column : 9
    <871ef>   DW_AT_type        : <0x862f8>
    <871f3>   DW_AT_data_member_location: 32
 <2><871f4>: Abbrev Number: 13 (DW_TAG_member)
    <871f5>   DW_AT_name        : h
    <871f7>   DW_AT_decl_file   : 15
    <871f8>   DW_AT_decl_line   : 152
    <871f9>   DW_AT_decl_column : 12
    <871fa>   DW_AT_type        : <0x862f8>
    <871fe>   DW_AT_data_member_location: 36
 <2><871ff>: Abbrev Number: 2 (DW_TAG_member)
    <87200>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <87204>   DW_AT_decl_file   : 15
    <87205>   DW_AT_decl_line   : 153
    <87206>   DW_AT_decl_column : 9
    <87207>   DW_AT_type        : <0x862f8>
    <8720b>   DW_AT_data_member_location: 40
 <2><8720c>: Abbrev Number: 13 (DW_TAG_member)
    <8720d>   DW_AT_name        : bpp
    <87211>   DW_AT_decl_file   : 15
    <87212>   DW_AT_decl_line   : 154
    <87213>   DW_AT_decl_column : 9
    <87214>   DW_AT_type        : <0x862f8>
    <87218>   DW_AT_data_member_location: 44
 <2><87219>: Abbrev Number: 2 (DW_TAG_member)
    <8721a>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8721e>   DW_AT_decl_file   : 15
    <8721f>   DW_AT_decl_line   : 155
    <87220>   DW_AT_decl_column : 9
    <87221>   DW_AT_type        : <0x862f8>
    <87225>   DW_AT_data_member_location: 48
 <2><87226>: Abbrev Number: 2 (DW_TAG_member)
    <87227>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <8722b>   DW_AT_decl_file   : 15
    <8722c>   DW_AT_decl_line   : 156
    <8722d>   DW_AT_decl_column : 19
    <8722e>   DW_AT_type        : <0x87352>
    <87232>   DW_AT_data_member_location: 56
 <2><87233>: Abbrev Number: 2 (DW_TAG_member)
    <87234>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <87238>   DW_AT_decl_file   : 15
    <87239>   DW_AT_decl_line   : 157
    <8723a>   DW_AT_decl_column : 19
    <8723b>   DW_AT_type        : <0x87352>
    <8723f>   DW_AT_data_member_location: 64
 <2><87240>: Abbrev Number: 2 (DW_TAG_member)
    <87241>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <87245>   DW_AT_decl_file   : 15
    <87246>   DW_AT_decl_line   : 158
    <87247>   DW_AT_decl_column : 20
    <87248>   DW_AT_type        : <0x86ee3>
    <8724c>   DW_AT_data_member_location: 72
 <2><8724d>: Abbrev Number: 2 (DW_TAG_member)
    <8724e>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <87252>   DW_AT_decl_file   : 15
    <87253>   DW_AT_decl_line   : 159
    <87254>   DW_AT_decl_column : 11
    <87255>   DW_AT_type        : <0x8632a>
    <87259>   DW_AT_data_member_location: 80
 <2><8725a>: Abbrev Number: 2 (DW_TAG_member)
    <8725b>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <8725f>   DW_AT_decl_file   : 15
    <87260>   DW_AT_decl_line   : 160
    <87261>   DW_AT_decl_column : 29
    <87262>   DW_AT_type        : <0x87428>
    <87266>   DW_AT_data_member_location: 88
 <2><87267>: Abbrev Number: 2 (DW_TAG_member)
    <87268>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <8726c>   DW_AT_decl_file   : 15
    <8726d>   DW_AT_decl_line   : 161
    <8726e>   DW_AT_decl_column : 9
    <8726f>   DW_AT_type        : <0x862f8>
    <87273>   DW_AT_data_member_location: 96
 <2><87274>: Abbrev Number: 2 (DW_TAG_member)
    <87275>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <87279>   DW_AT_decl_file   : 15
    <8727a>   DW_AT_decl_line   : 162
    <8727b>   DW_AT_decl_column : 27
    <8727c>   DW_AT_type        : <0x8745a>
    <87280>   DW_AT_data_member_location: 104
 <2><87281>: Abbrev Number: 2 (DW_TAG_member)
    <87282>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <87286>   DW_AT_decl_file   : 15
    <87287>   DW_AT_decl_line   : 163
    <87288>   DW_AT_decl_column : 9
    <87289>   DW_AT_type        : <0x862f8>
    <8728d>   DW_AT_data_member_location: 112
 <2><8728e>: Abbrev Number: 2 (DW_TAG_member)
    <8728f>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <87293>   DW_AT_decl_file   : 15
    <87294>   DW_AT_decl_line   : 164
    <87295>   DW_AT_decl_column : 9
    <87296>   DW_AT_type        : <0x862f8>
    <8729a>   DW_AT_data_member_location: 116
 <2><8729b>: Abbrev Number: 2 (DW_TAG_member)
    <8729c>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <872a0>   DW_AT_decl_file   : 15
    <872a1>   DW_AT_decl_line   : 164
    <872a2>   DW_AT_decl_column : 19
    <872a3>   DW_AT_type        : <0x862f8>
    <872a7>   DW_AT_data_member_location: 120
 <2><872a8>: Abbrev Number: 2 (DW_TAG_member)
    <872a9>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <872ad>   DW_AT_decl_file   : 15
    <872ae>   DW_AT_decl_line   : 165
    <872af>   DW_AT_decl_column : 24
    <872b0>   DW_AT_type        : <0x87492>
    <872b4>   DW_AT_data_member_location: 128
 <2><872b5>: Abbrev Number: 2 (DW_TAG_member)
    <872b6>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <872ba>   DW_AT_decl_file   : 15
    <872bb>   DW_AT_decl_line   : 166
    <872bc>   DW_AT_decl_column : 9
    <872bd>   DW_AT_type        : <0x862f8>
    <872c1>   DW_AT_data_member_location: 136
 <2><872c2>: Abbrev Number: 2 (DW_TAG_member)
    <872c3>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <872c7>   DW_AT_decl_file   : 15
    <872c8>   DW_AT_decl_line   : 166
    <872c9>   DW_AT_decl_column : 17
    <872ca>   DW_AT_type        : <0x862f8>
    <872ce>   DW_AT_data_member_location: 140
 <2><872cf>: Abbrev Number: 2 (DW_TAG_member)
    <872d0>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <872d4>   DW_AT_decl_file   : 15
    <872d5>   DW_AT_decl_line   : 167
    <872d6>   DW_AT_decl_column : 11
    <872d7>   DW_AT_type        : <0x862c2>
    <872db>   DW_AT_data_member_location: 144
 <2><872dc>: Abbrev Number: 13 (DW_TAG_member)
    <872dd>   DW_AT_name        : key
    <872e1>   DW_AT_decl_file   : 15
    <872e2>   DW_AT_decl_line   : 168
    <872e3>   DW_AT_decl_column : 11
    <872e4>   DW_AT_type        : <0x8632a>
    <872e8>   DW_AT_data_member_location: 152
 <2><872e9>: Abbrev Number: 2 (DW_TAG_member)
    <872ea>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <872ee>   DW_AT_decl_file   : 15
    <872ef>   DW_AT_decl_line   : 169
    <872f0>   DW_AT_decl_column : 6
    <872f1>   DW_AT_type        : <0x862f8>
    <872f5>   DW_AT_data_member_location: 160
 <2><872f6>: Abbrev Number: 2 (DW_TAG_member)
    <872f7>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <872fb>   DW_AT_decl_file   : 15
    <872fc>   DW_AT_decl_line   : 170
    <872fd>   DW_AT_decl_column : 18
    <872fe>   DW_AT_type        : <0x87497>
    <87302>   DW_AT_data_member_location: 168
 <2><87303>: Abbrev Number: 2 (DW_TAG_member)
    <87304>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <87308>   DW_AT_decl_file   : 15
    <87309>   DW_AT_decl_line   : 171
    <8730a>   DW_AT_decl_column : 12
    <8730b>   DW_AT_type        : <0x86c3f>
    <8730f>   DW_AT_data_member_location: 176
 <2><87310>: Abbrev Number: 2 (DW_TAG_member)
    <87311>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <87315>   DW_AT_decl_file   : 15
    <87316>   DW_AT_decl_line   : 172
    <87317>   DW_AT_decl_column : 9
    <87318>   DW_AT_type        : <0x862f8>
    <8731c>   DW_AT_data_member_location: 184
 <2><8731d>: Abbrev Number: 2 (DW_TAG_member)
    <8731e>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <87322>   DW_AT_decl_file   : 15
    <87323>   DW_AT_decl_line   : 172
    <87324>   DW_AT_decl_column : 21
    <87325>   DW_AT_type        : <0x862f8>
    <87329>   DW_AT_data_member_location: 188
 <2><8732a>: Abbrev Number: 2 (DW_TAG_member)
    <8732b>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <8732f>   DW_AT_decl_file   : 15
    <87330>   DW_AT_decl_line   : 173
    <87331>   DW_AT_decl_column : 11
    <87332>   DW_AT_type        : <0x874a1>
    <87336>   DW_AT_data_member_location: 192
 <2><87337>: Abbrev Number: 2 (DW_TAG_member)
    <87338>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8733c>   DW_AT_decl_file   : 15
    <8733d>   DW_AT_decl_line   : 174
    <8733e>   DW_AT_decl_column : 15
    <8733f>   DW_AT_type        : <0x862ff>
    <87343>   DW_AT_data_member_location: 200
 <2><87344>: Abbrev Number: 2 (DW_TAG_member)
    <87345>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <87349>   DW_AT_decl_file   : 15
    <8734a>   DW_AT_decl_line   : 175
    <8734b>   DW_AT_decl_column : 6
    <8734c>   DW_AT_type        : <0x862f8>
    <87350>   DW_AT_data_member_location: 204
 <2><87351>: Abbrev Number: 0
 <1><87352>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87353>   DW_AT_byte_size   : 8
    <87353>   DW_AT_type        : <0x862dc>
 <1><87357>: Abbrev Number: 19 (DW_TAG_structure_type)
    <87358>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <8735c>   DW_AT_byte_size   : 112
    <8735d>   DW_AT_decl_file   : 15
    <8735e>   DW_AT_decl_line   : 178
    <8735f>   DW_AT_decl_column : 16
    <87360>   DW_AT_sibling     : <0x87423>
 <2><87364>: Abbrev Number: 2 (DW_TAG_member)
    <87365>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <87369>   DW_AT_decl_file   : 15
    <8736a>   DW_AT_decl_line   : 188
    <8736b>   DW_AT_decl_column : 8
    <8736c>   DW_AT_type        : <0x8632a>
    <87370>   DW_AT_data_member_location: 0
 <2><87371>: Abbrev Number: 2 (DW_TAG_member)
    <87372>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <87376>   DW_AT_decl_file   : 15
    <87377>   DW_AT_decl_line   : 208
    <87378>   DW_AT_decl_column : 8
    <87379>   DW_AT_type        : <0x874da>
    <8737d>   DW_AT_data_member_location: 8
 <2><8737e>: Abbrev Number: 2 (DW_TAG_member)
    <8737f>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <87383>   DW_AT_decl_file   : 15
    <87384>   DW_AT_decl_line   : 222
    <87385>   DW_AT_decl_column : 9
    <87386>   DW_AT_type        : <0x86439>
    <8738a>   DW_AT_data_member_location: 16
 <2><8738b>: Abbrev Number: 2 (DW_TAG_member)
    <8738c>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <87390>   DW_AT_decl_file   : 15
    <87391>   DW_AT_decl_line   : 231
    <87392>   DW_AT_decl_column : 9
    <87393>   DW_AT_type        : <0x86439>
    <87397>   DW_AT_data_member_location: 24
 <2><87398>: Abbrev Number: 2 (DW_TAG_member)
    <87399>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <8739d>   DW_AT_decl_file   : 15
    <8739e>   DW_AT_decl_line   : 239
    <8739f>   DW_AT_decl_column : 9
    <873a0>   DW_AT_type        : <0x86439>
    <873a4>   DW_AT_data_member_location: 32
 <2><873a5>: Abbrev Number: 2 (DW_TAG_member)
    <873a6>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <873aa>   DW_AT_decl_file   : 15
    <873ab>   DW_AT_decl_line   : 248
    <873ac>   DW_AT_decl_column : 9
    <873ad>   DW_AT_type        : <0x874f9>
    <873b1>   DW_AT_data_member_location: 40
 <2><873b2>: Abbrev Number: 14 (DW_TAG_member)
    <873b3>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <873b7>   DW_AT_decl_file   : 15
    <873b8>   DW_AT_decl_line   : 258
    <873ba>   DW_AT_decl_column : 9
    <873bb>   DW_AT_type        : <0x86439>
    <873bf>   DW_AT_data_member_location: 48
 <2><873c0>: Abbrev Number: 14 (DW_TAG_member)
    <873c1>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <873c5>   DW_AT_decl_file   : 15
    <873c6>   DW_AT_decl_line   : 274
    <873c8>   DW_AT_decl_column : 8
    <873c9>   DW_AT_type        : <0x86b57>
    <873cd>   DW_AT_data_member_location: 56
 <2><873ce>: Abbrev Number: 14 (DW_TAG_member)
    <873cf>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <873d3>   DW_AT_decl_file   : 15
    <873d4>   DW_AT_decl_line   : 285
    <873d6>   DW_AT_decl_column : 9
    <873d7>   DW_AT_type        : <0x874f9>
    <873db>   DW_AT_data_member_location: 64
 <2><873dc>: Abbrev Number: 14 (DW_TAG_member)
    <873dd>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <873e1>   DW_AT_decl_file   : 15
    <873e2>   DW_AT_decl_line   : 293
    <873e4>   DW_AT_decl_column : 9
    <873e5>   DW_AT_type        : <0x87509>
    <873e9>   DW_AT_data_member_location: 72
 <2><873ea>: Abbrev Number: 14 (DW_TAG_member)
    <873eb>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <873ef>   DW_AT_decl_file   : 15
    <873f0>   DW_AT_decl_line   : 301
    <873f2>   DW_AT_decl_column : 8
    <873f3>   DW_AT_type        : <0x869c0>
    <873f7>   DW_AT_data_member_location: 80
 <2><873f8>: Abbrev Number: 14 (DW_TAG_member)
    <873f9>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <873fd>   DW_AT_decl_file   : 15
    <873fe>   DW_AT_decl_line   : 314
    <87400>   DW_AT_decl_column : 9
    <87401>   DW_AT_type        : <0x87522>
    <87405>   DW_AT_data_member_location: 88
 <2><87406>: Abbrev Number: 14 (DW_TAG_member)
    <87407>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <8740b>   DW_AT_decl_file   : 15
    <8740c>   DW_AT_decl_line   : 321
    <8740e>   DW_AT_decl_column : 9
    <8740f>   DW_AT_type        : <0x86439>
    <87413>   DW_AT_data_member_location: 96
 <2><87414>: Abbrev Number: 14 (DW_TAG_member)
    <87415>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <87419>   DW_AT_decl_file   : 15
    <8741a>   DW_AT_decl_line   : 328
    <8741c>   DW_AT_decl_column : 9
    <8741d>   DW_AT_type        : <0x86439>
    <87421>   DW_AT_data_member_location: 104
 <2><87422>: Abbrev Number: 0
 <1><87423>: Abbrev Number: 15 (DW_TAG_const_type)
    <87424>   DW_AT_type        : <0x87357>
 <1><87428>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87429>   DW_AT_byte_size   : 8
    <87429>   DW_AT_type        : <0x87423>
 <1><8742d>: Abbrev Number: 56 (DW_TAG_structure_type)
    <8742e>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <87432>   DW_AT_byte_size   : 16
    <87432>   DW_AT_decl_file   : 15
    <87432>   DW_AT_decl_line   : 331
    <87434>   DW_AT_decl_column : 16
    <87434>   DW_AT_sibling     : <0x87455>
 <2><87438>: Abbrev Number: 14 (DW_TAG_member)
    <87439>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <8743d>   DW_AT_decl_file   : 15
    <8743e>   DW_AT_decl_line   : 333
    <87440>   DW_AT_decl_column : 12
    <87441>   DW_AT_type        : <0x86304>
    <87445>   DW_AT_data_member_location: 0
 <2><87446>: Abbrev Number: 14 (DW_TAG_member)
    <87447>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <8744b>   DW_AT_decl_file   : 15
    <8744c>   DW_AT_decl_line   : 334
    <8744e>   DW_AT_decl_column : 23
    <8744f>   DW_AT_type        : <0x87539>
    <87453>   DW_AT_data_member_location: 8
 <2><87454>: Abbrev Number: 0
 <1><87455>: Abbrev Number: 15 (DW_TAG_const_type)
    <87456>   DW_AT_type        : <0x8742d>
 <1><8745a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8745b>   DW_AT_byte_size   : 8
    <8745b>   DW_AT_type        : <0x87455>
 <1><8745f>: Abbrev Number: 56 (DW_TAG_structure_type)
    <87460>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <87464>   DW_AT_byte_size   : 16
    <87464>   DW_AT_decl_file   : 15
    <87464>   DW_AT_decl_line   : 337
    <87466>   DW_AT_decl_column : 16
    <87466>   DW_AT_sibling     : <0x8748d>
 <2><8746a>: Abbrev Number: 57 (DW_TAG_member)
    <8746b>   DW_AT_name        : w
    <8746d>   DW_AT_decl_file   : 15
    <8746d>   DW_AT_decl_line   : 339
    <8746f>   DW_AT_decl_column : 15
    <8746f>   DW_AT_type        : <0x86304>
    <87473>   DW_AT_data_member_location: 0
 <2><87474>: Abbrev Number: 57 (DW_TAG_member)
    <87475>   DW_AT_name        : h
    <87477>   DW_AT_decl_file   : 15
    <87477>   DW_AT_decl_line   : 340
    <87479>   DW_AT_decl_column : 15
    <87479>   DW_AT_type        : <0x86304>
    <8747d>   DW_AT_data_member_location: 4
 <2><8747e>: Abbrev Number: 14 (DW_TAG_member)
    <8747f>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <87483>   DW_AT_decl_file   : 15
    <87484>   DW_AT_decl_line   : 341
    <87486>   DW_AT_decl_column : 23
    <87487>   DW_AT_type        : <0x87539>
    <8748b>   DW_AT_data_member_location: 8
 <2><8748c>: Abbrev Number: 0
 <1><8748d>: Abbrev Number: 15 (DW_TAG_const_type)
    <8748e>   DW_AT_type        : <0x8745f>
 <1><87492>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87493>   DW_AT_byte_size   : 8
    <87493>   DW_AT_type        : <0x8748d>
 <1><87497>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87498>   DW_AT_byte_size   : 8
    <87498>   DW_AT_type        : <0x8749c>
 <1><8749c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8749d>   DW_AT_byte_size   : 8
    <8749d>   DW_AT_type        : <0x87183>
 <1><874a1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <874a2>   DW_AT_byte_size   : 8
    <874a2>   DW_AT_type        : <0x86857>
 <1><874a6>: Abbrev Number: 5 (DW_TAG_typedef)
    <874a7>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <874ab>   DW_AT_decl_file   : 15
    <874ac>   DW_AT_decl_line   : 176
    <874ad>   DW_AT_decl_column : 3
    <874ae>   DW_AT_type        : <0x8718f>
 <1><874b2>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <874b3>   DW_AT_prototyped  : 1
    <874b3>   DW_AT_type        : <0x862f8>
    <874b7>   DW_AT_sibling     : <0x874da>
 <2><874bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874bc>   DW_AT_type        : <0x8632a>
 <2><874c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874c1>   DW_AT_type        : <0x862f8>
 <2><874c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874c6>   DW_AT_type        : <0x862f8>
 <2><874ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874cb>   DW_AT_type        : <0x862f8>
 <2><874cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874d0>   DW_AT_type        : <0x862f8>
 <2><874d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874d5>   DW_AT_type        : <0x862f8>
 <2><874d9>: Abbrev Number: 0
 <1><874da>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <874db>   DW_AT_byte_size   : 8
    <874db>   DW_AT_type        : <0x874b2>
 <1><874df>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <874e0>   DW_AT_prototyped  : 1
    <874e0>   DW_AT_sibling     : <0x874f9>
 <2><874e4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874e5>   DW_AT_type        : <0x862f8>
 <2><874e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874ea>   DW_AT_type        : <0x862f8>
 <2><874ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874ef>   DW_AT_type        : <0x862f8>
 <2><874f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <874f4>   DW_AT_type        : <0x862f8>
 <2><874f8>: Abbrev Number: 0
 <1><874f9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <874fa>   DW_AT_byte_size   : 8
    <874fa>   DW_AT_type        : <0x874df>
 <1><874fe>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <874ff>   DW_AT_prototyped  : 1
    <874ff>   DW_AT_sibling     : <0x87509>
 <2><87503>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87504>   DW_AT_type        : <0x8632a>
 <2><87508>: Abbrev Number: 0
 <1><87509>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8750a>   DW_AT_byte_size   : 8
    <8750a>   DW_AT_type        : <0x874fe>
 <1><8750e>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <8750f>   DW_AT_prototyped  : 1
    <8750f>   DW_AT_type        : <0x86a12>
    <87513>   DW_AT_sibling     : <0x87522>
 <2><87517>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87518>   DW_AT_type        : <0x862f8>
 <2><8751c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8751d>   DW_AT_type        : <0x86a12>
 <2><87521>: Abbrev Number: 0
 <1><87522>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87523>   DW_AT_byte_size   : 8
    <87523>   DW_AT_type        : <0x8750e>
 <1><87527>: Abbrev Number: 30 (DW_TAG_typedef)
    <87528>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <8752c>   DW_AT_decl_file   : 15
    <8752d>   DW_AT_decl_line   : 329
    <8752f>   DW_AT_decl_column : 3
    <87530>   DW_AT_type        : <0x87357>
 <1><87534>: Abbrev Number: 15 (DW_TAG_const_type)
    <87535>   DW_AT_type        : <0x87527>
 <1><87539>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8753a>   DW_AT_byte_size   : 8
    <8753a>   DW_AT_type        : <0x862d0>
 <1><8753e>: Abbrev Number: 30 (DW_TAG_typedef)
    <8753f>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <87543>   DW_AT_decl_file   : 15
    <87544>   DW_AT_decl_line   : 335
    <87546>   DW_AT_decl_column : 3
    <87547>   DW_AT_type        : <0x8742d>
 <1><8754b>: Abbrev Number: 15 (DW_TAG_const_type)
    <8754c>   DW_AT_type        : <0x8753e>
 <1><87550>: Abbrev Number: 30 (DW_TAG_typedef)
    <87551>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <87555>   DW_AT_decl_file   : 15
    <87556>   DW_AT_decl_line   : 342
    <87558>   DW_AT_decl_column : 3
    <87559>   DW_AT_type        : <0x8745f>
 <1><8755d>: Abbrev Number: 15 (DW_TAG_const_type)
    <8755e>   DW_AT_type        : <0x87550>
 <1><87562>: Abbrev Number: 17 (DW_TAG_variable)
    <87563>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <87567>   DW_AT_decl_file   : 15
    <87568>   DW_AT_decl_line   : 364
    <8756a>   DW_AT_decl_column : 15
    <8756b>   DW_AT_type        : <0x8756f>
    <8756f>   DW_AT_external    : 1
    <8756f>   DW_AT_declaration : 1
 <1><8756f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <87570>   DW_AT_byte_size   : 8
    <87570>   DW_AT_type        : <0x874a6>
 <1><87574>: Abbrev Number: 17 (DW_TAG_variable)
    <87575>   DW_AT_name        : (indirect string, offset: 0x16f18): __fb_gfx_driver_name
    <87579>   DW_AT_decl_file   : 15
    <8757a>   DW_AT_decl_line   : 365
    <8757c>   DW_AT_decl_column : 14
    <8757d>   DW_AT_type        : <0x8632a>
    <87581>   DW_AT_external    : 1
    <87581>   DW_AT_declaration : 1
 <1><87581>: Abbrev Number: 18 (DW_TAG_array_type)
    <87582>   DW_AT_type        : <0x8758c>
    <87586>   DW_AT_sibling     : <0x8758c>
 <2><8758a>: Abbrev Number: 76 (DW_TAG_subrange_type)
 <2><8758b>: Abbrev Number: 0
 <1><8758c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8758d>   DW_AT_byte_size   : 8
    <8758d>   DW_AT_type        : <0x87534>
 <1><87591>: Abbrev Number: 17 (DW_TAG_variable)
    <87592>   DW_AT_name        : (indirect string, offset: 0x18204): __fb_gfx_drivers_list
    <87596>   DW_AT_decl_file   : 15
    <87597>   DW_AT_decl_line   : 366
    <87599>   DW_AT_decl_column : 25
    <8759a>   DW_AT_type        : <0x87581>
    <8759e>   DW_AT_external    : 1
    <8759e>   DW_AT_declaration : 1
 <1><8759e>: Abbrev Number: 17 (DW_TAG_variable)
    <8759f>   DW_AT_name        : (indirect string, offset: 0x1819c): __fb_gfxDriverNull
    <875a3>   DW_AT_decl_file   : 15
    <875a4>   DW_AT_decl_line   : 367
    <875a6>   DW_AT_decl_column : 24
    <875a7>   DW_AT_type        : <0x87534>
    <875ab>   DW_AT_external    : 1
    <875ab>   DW_AT_declaration : 1
 <1><875ab>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <875ac>   DW_AT_prototyped  : 1
    <875ac>   DW_AT_type        : <0x8631c>
    <875b0>   DW_AT_sibling     : <0x875c4>
 <2><875b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <875b5>   DW_AT_type        : <0x8631c>
 <2><875b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
