    <ae140>   DW_AT_call_return_pc: 0x46ed4a
    <ae148>   DW_AT_call_origin : <0xad512>
 <7><ae14c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ae14d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ae14f>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <7><ae151>: Abbrev Number: 0
 <6><ae152>: Abbrev Number: 0
 <5><ae153>: Abbrev Number: 0
 <4><ae154>: Abbrev Number: 28 (DW_TAG_call_site)
    <ae155>   DW_AT_call_return_pc: 0x46e94b
    <ae15d>   DW_AT_call_tail_call: 1
    <ae15d>   DW_AT_call_origin : <0xad512>
 <5><ae161>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <ae162>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ae164>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><ae166>: Abbrev Number: 0
 <4><ae167>: Abbrev Number: 0
 <3><ae168>: Abbrev Number: 0
 <2><ae169>: Abbrev Number: 15 (DW_TAG_call_site)
    <ae16a>   DW_AT_call_return_pc: 0x46edb8
    <ae172>   DW_AT_call_origin : <0xae81a>
 <2><ae176>: Abbrev Number: 0
 <1><ae177>: Abbrev Number: 27 (DW_TAG_subprogram)
    <ae178>   DW_AT_external    : 1
    <ae178>   DW_AT_name        : (indirect string, offset: 0x1b3e6): fb_FileGetData
    <ae17c>   DW_AT_decl_file   : 1
    <ae17c>   DW_AT_decl_line   : 179
    <ae17d>   DW_AT_decl_column : 5
    <ae17e>   DW_AT_prototyped  : 1
    <ae17e>   DW_AT_type        : <0xac95f>
    <ae182>   DW_AT_low_pc      : 0x46e410
    <ae18a>   DW_AT_high_pc     : 0x4c7

    <aea1b>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <aea1f>   DW_AT_decl_file   : 4
    <aea20>   DW_AT_decl_line   : 108
    <aea21>   DW_AT_decl_column : 19
    <aea22>   DW_AT_type        : <0xae9d1>
 <1><aea26>: Abbrev Number: 7 (DW_TAG_base_type)
    <aea27>   DW_AT_byte_size   : 8
    <aea28>   DW_AT_encoding    : 7	(unsigned)
    <aea29>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><aea2d>: Abbrev Number: 16 (DW_TAG_array_type)
    <aea2e>   DW_AT_type        : <0xae9e2>
    <aea32>   DW_AT_sibling     : <0xaea3d>
 <2><aea36>: Abbrev Number: 30 (DW_TAG_subrange_type)
    <aea37>   DW_AT_type        : <0xae9a0>
    <aea3b>   DW_AT_upper_bound : 3
 <2><aea3c>: Abbrev Number: 0
 <1><aea3d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aea3e>   DW_AT_byte_size   : 8
    <aea3e>   DW_AT_type        : <0xaea42>
 <1><aea42>: Abbrev Number: 31 (DW_TAG_const_type)
 <1><aea43>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aea44>   DW_AT_byte_size   : 8
    <aea44>   DW_AT_type        : <0xae9dd>
 <1><aea48>: Abbrev Number: 3 (DW_TAG_typedef)
    <aea49>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <aea4d>   DW_AT_decl_file   : 5
    <aea4e>   DW_AT_decl_line   : 22
    <aea4f>   DW_AT_decl_column : 15
    <aea50>   DW_AT_type        : <0xaea0e>
 <1><aea54>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <aea55>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <aea59>   DW_AT_encoding    : 7	(void)
    <aea59>   DW_AT_byte_size   : 4
    <aea59>   DW_AT_type        : <0xae999>
    <aea5d>   DW_AT_decl_file   : 7
    <aea5e>   DW_AT_decl_line   : 1
    <aea5f>   DW_AT_decl_column : 14
    <aea5f>   DW_AT_sibling     : <0xaead6>
 <2><aea63>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea64>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <aea68>   DW_AT_const_value : 0
 <2><aea69>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea6a>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <aea6e>   DW_AT_const_value : 1
 <2><aea6f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea70>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <aea74>   DW_AT_const_value : 2
 <2><aea75>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea76>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <aea7a>   DW_AT_const_value : 3
 <2><aea7b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea7c>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <aea80>   DW_AT_const_value : 4
 <2><aea81>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea82>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <aea86>   DW_AT_const_value : 5
 <2><aea87>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea88>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <aea8c>   DW_AT_const_value : 6
 <2><aea8d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea8e>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <aea92>   DW_AT_const_value : 7
 <2><aea93>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea94>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <aea98>   DW_AT_const_value : 8
 <2><aea99>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aea9a>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <aea9e>   DW_AT_const_value : 9
 <2><aea9f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeaa0>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <aeaa4>   DW_AT_const_value : 10
 <2><aeaa5>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeaa6>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <aeaaa>   DW_AT_const_value : 11
 <2><aeaab>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeaac>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <aeab0>   DW_AT_const_value : 12
 <2><aeab1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeab2>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <aeab6>   DW_AT_const_value : 13
 <2><aeab7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeab8>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <aeabc>   DW_AT_const_value : 14
 <2><aeabd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeabe>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <aeac2>   DW_AT_const_value : 15
 <2><aeac3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeac4>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <aeac8>   DW_AT_const_value : 16
 <2><aeac9>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeaca>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <aeace>   DW_AT_const_value : 17
 <2><aeacf>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aead0>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <aead4>   DW_AT_const_value : 18
 <2><aead5>: Abbrev Number: 0
 <1><aead6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aead7>   DW_AT_byte_size   : 8
    <aead7>   DW_AT_type        : <0xaeadb>
 <1><aeadb>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <aeadc>   DW_AT_prototyped  : 1
 <1><aeadc>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aeadd>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <aeae1>   DW_AT_byte_size   : 24
    <aeae2>   DW_AT_decl_file   : 6
    <aeae3>   DW_AT_decl_line   : 82
    <aeae4>   DW_AT_decl_column : 16
    <aeae5>   DW_AT_sibling     : <0xaeb11>
 <2><aeae9>: Abbrev Number: 2 (DW_TAG_member)
    <aeaea>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <aeaee>   DW_AT_decl_file   : 6
    <aeaef>   DW_AT_decl_line   : 83
    <aeaf0>   DW_AT_decl_column : 21
    <aeaf1>   DW_AT_type        : <0xae9dd>
    <aeaf5>   DW_AT_data_member_location: 0
 <2><aeaf6>: Abbrev Number: 8 (DW_TAG_member)
    <aeaf7>   DW_AT_name        : len
    <aeafb>   DW_AT_decl_file   : 6
    <aeafc>   DW_AT_decl_line   : 84
    <aeafd>   DW_AT_decl_column : 21
    <aeafe>   DW_AT_type        : <0xaea1a>
    <aeb02>   DW_AT_data_member_location: 8
 <2><aeb03>: Abbrev Number: 2 (DW_TAG_member)
    <aeb04>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <aeb08>   DW_AT_decl_file   : 6
    <aeb09>   DW_AT_decl_line   : 85
    <aeb0a>   DW_AT_decl_column : 21
    <aeb0b>   DW_AT_type        : <0xaea1a>
    <aeb0f>   DW_AT_data_member_location: 16
 <2><aeb10>: Abbrev Number: 0
 <1><aeb11>: Abbrev Number: 3 (DW_TAG_typedef)
    <aeb12>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <aeb16>   DW_AT_decl_file   : 6
    <aeb17>   DW_AT_decl_line   : 86
    <aeb18>   DW_AT_decl_column : 3
    <aeb19>   DW_AT_type        : <0xaeadc>
 <1><aeb1d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeb1e>   DW_AT_byte_size   : 8
    <aeb1e>   DW_AT_type        : <0xaeb22>
 <1><aeb22>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <aeb23>   DW_AT_prototyped  : 1
    <aeb23>   DW_AT_sibling     : <0xaeb2d>
 <2><aeb27>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aeb28>   DW_AT_type        : <0xae9cf>
 <2><aeb2c>: Abbrev Number: 0
 <1><aeb2d>: Abbrev Number: 7 (DW_TAG_base_type)
    <aeb2e>   DW_AT_byte_size   : 8
    <aeb2f>   DW_AT_encoding    : 4	(float)
    <aeb30>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><aeb34>: Abbrev Number: 7 (DW_TAG_base_type)
    <aeb35>   DW_AT_byte_size   : 4
    <aeb36>   DW_AT_encoding    : 4	(float)
    <aeb37>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><aeb3b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeb3c>   DW_AT_byte_size   : 8
    <aeb3c>   DW_AT_type        : <0xae9f5>
 <1><aeb40>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <aeb41>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <aeb45>   DW_AT_encoding    : 7	(void)
    <aeb45>   DW_AT_byte_size   : 4
    <aeb45>   DW_AT_type        : <0xae999>
    <aeb49>   DW_AT_decl_file   : 8
    <aeb4a>   DW_AT_decl_line   : 25
    <aeb4b>   DW_AT_decl_column : 14
    <aeb4b>   DW_AT_sibling     : <0xaeb68>
 <2><aeb4f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeb50>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <aeb54>   DW_AT_const_value : 0
 <2><aeb55>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeb56>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <aeb5a>   DW_AT_const_value : 1
 <2><aeb5b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeb5c>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <aeb60>   DW_AT_const_value : 2
 <2><aeb61>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aeb62>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <aeb66>   DW_AT_const_value : 3
 <2><aeb67>: Abbrev Number: 0
 <1><aeb68>: Abbrev Number: 3 (DW_TAG_typedef)
    <aeb69>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <aeb6d>   DW_AT_decl_file   : 8
    <aeb6e>   DW_AT_decl_line   : 30
    <aeb6f>   DW_AT_decl_column : 3
    <aeb70>   DW_AT_type        : <0xaeb40>
 <1><aeb74>: Abbrev Number: 3 (DW_TAG_typedef)
    <aeb75>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <aeb79>   DW_AT_decl_file   : 8
    <aeb7a>   DW_AT_decl_line   : 54
    <aeb7b>   DW_AT_decl_column : 15
    <aeb7c>   DW_AT_type        : <0xaeb80>
 <1><aeb80>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeb81>   DW_AT_byte_size   : 8
    <aeb81>   DW_AT_type        : <0xaeb85>
 <1><aeb85>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aeb86>   DW_AT_prototyped  : 1
    <aeb86>   DW_AT_type        : <0xae9b5>
    <aeb8a>   DW_AT_sibling     : <0xaeb99>
 <2><aeb8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aeb8f>   DW_AT_type        : <0xaeb99>
 <2><aeb93>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aeb94>   DW_AT_type        : <0xae9b5>
 <2><aeb98>: Abbrev Number: 0
 <1><aeb99>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeb9a>   DW_AT_byte_size   : 8
    <aeb9a>   DW_AT_type        : <0xaeb9e>
 <1><aeb9e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aeb9f>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <aeba3>   DW_AT_byte_size   : 80
    <aeba4>   DW_AT_decl_file   : 8
    <aeba5>   DW_AT_decl_line   : 97
    <aeba6>   DW_AT_decl_column : 16
    <aeba7>   DW_AT_sibling     : <0xaec62>
 <2><aebab>: Abbrev Number: 2 (DW_TAG_member)
    <aebac>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <aebb0>   DW_AT_decl_file   : 8
    <aebb1>   DW_AT_decl_line   : 98
    <aebb2>   DW_AT_decl_column : 21
    <aebb3>   DW_AT_type        : <0xae9b5>
    <aebb7>   DW_AT_data_member_location: 0
 <2><aebb8>: Abbrev Number: 8 (DW_TAG_member)
    <aebb9>   DW_AT_name        : len
    <aebbd>   DW_AT_decl_file   : 8
    <aebbe>   DW_AT_decl_line   : 99
    <aebbf>   DW_AT_decl_column : 21
    <aebc0>   DW_AT_type        : <0xae9b5>
    <aebc4>   DW_AT_data_member_location: 4
 <2><aebc5>: Abbrev Number: 2 (DW_TAG_member)
    <aebc6>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <aebca>   DW_AT_decl_file   : 8
    <aebcb>   DW_AT_decl_line   : 100
    <aebcc>   DW_AT_decl_column : 21
    <aebcd>   DW_AT_type        : <0xaeb68>
    <aebd1>   DW_AT_data_member_location: 8
 <2><aebd2>: Abbrev Number: 2 (DW_TAG_member)
    <aebd3>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <aebd7>   DW_AT_decl_file   : 8
    <aebd8>   DW_AT_decl_line   : 101
    <aebd9>   DW_AT_decl_column : 21
    <aebda>   DW_AT_type        : <0xaea48>
    <aebde>   DW_AT_data_member_location: 16
 <2><aebdf>: Abbrev Number: 2 (DW_TAG_member)
    <aebe0>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <aebe4>   DW_AT_decl_file   : 8
    <aebe5>   DW_AT_decl_line   : 102
    <aebe6>   DW_AT_decl_column : 21
    <aebe7>   DW_AT_type        : <0xae9b5>
    <aebeb>   DW_AT_data_member_location: 24
 <2><aebec>: Abbrev Number: 2 (DW_TAG_member)
    <aebed>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <aebf1>   DW_AT_decl_file   : 8
    <aebf2>   DW_AT_decl_line   : 103
    <aebf3>   DW_AT_decl_column : 21
    <aebf4>   DW_AT_type        : <0xae9b5>
    <aebf8>   DW_AT_data_member_location: 28
 <2><aebf9>: Abbrev Number: 2 (DW_TAG_member)
    <aebfa>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <aebfe>   DW_AT_decl_file   : 8
    <aebff>   DW_AT_decl_line   : 104
    <aec00>   DW_AT_decl_column : 21
    <aec01>   DW_AT_type        : <0xae9b5>
    <aec05>   DW_AT_data_member_location: 32
 <2><aec06>: Abbrev Number: 2 (DW_TAG_member)
    <aec07>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <aec0b>   DW_AT_decl_file   : 8
    <aec0c>   DW_AT_decl_line   : 105
    <aec0d>   DW_AT_decl_column : 21
    <aec0e>   DW_AT_type        : <0xae999>
    <aec12>   DW_AT_data_member_location: 36
 <2><aec13>: Abbrev Number: 2 (DW_TAG_member)
    <aec14>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <aec18>   DW_AT_decl_file   : 8
    <aec19>   DW_AT_decl_line   : 106
    <aec1a>   DW_AT_decl_column : 21
    <aec1b>   DW_AT_type        : <0xae999>
    <aec1f>   DW_AT_data_member_location: 40
 <2><aec20>: Abbrev Number: 2 (DW_TAG_member)
    <aec21>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <aec25>   DW_AT_decl_file   : 8
    <aec26>   DW_AT_decl_line   : 109
    <aec27>   DW_AT_decl_column : 21
    <aec28>   DW_AT_type        : <0xaea2d>
    <aec2c>   DW_AT_data_member_location: 44
 <2><aec2d>: Abbrev Number: 2 (DW_TAG_member)
    <aec2e>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <aec32>   DW_AT_decl_file   : 8
    <aec33>   DW_AT_decl_line   : 110
    <aec34>   DW_AT_decl_column : 21
    <aec35>   DW_AT_type        : <0xae9e9>
    <aec39>   DW_AT_data_member_location: 48
 <2><aec3a>: Abbrev Number: 2 (DW_TAG_member)
    <aec3b>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <aec3f>   DW_AT_decl_file   : 8
    <aec40>   DW_AT_decl_line   : 112
    <aec41>   DW_AT_decl_column : 22
    <aec42>   DW_AT_type        : <0xaeefa>
    <aec46>   DW_AT_data_member_location: 56
 <2><aec47>: Abbrev Number: 2 (DW_TAG_member)
    <aec48>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <aec4c>   DW_AT_decl_file   : 8
    <aec4d>   DW_AT_decl_line   : 114
    <aec4e>   DW_AT_decl_column : 14
    <aec4f>   DW_AT_type        : <0xae9cf>
    <aec53>   DW_AT_data_member_location: 64
 <2><aec54>: Abbrev Number: 2 (DW_TAG_member)
    <aec55>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <aec59>   DW_AT_decl_file   : 8
    <aec5a>   DW_AT_decl_line   : 116
    <aec5b>   DW_AT_decl_column : 22
    <aec5c>   DW_AT_type        : <0xaeb99>
    <aec60>   DW_AT_data_member_location: 72
 <2><aec61>: Abbrev Number: 0
 <1><aec62>: Abbrev Number: 3 (DW_TAG_typedef)
    <aec63>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <aec67>   DW_AT_decl_file   : 8
    <aec68>   DW_AT_decl_line   : 59
    <aec69>   DW_AT_decl_column : 15
    <aec6a>   DW_AT_type        : <0xaec6e>
 <1><aec6e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aec6f>   DW_AT_byte_size   : 8
    <aec6f>   DW_AT_type        : <0xaec73>
 <1><aec73>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aec74>   DW_AT_prototyped  : 1
    <aec74>   DW_AT_type        : <0xae9b5>
    <aec78>   DW_AT_sibling     : <0xaec82>
 <2><aec7c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aec7d>   DW_AT_type        : <0xaeb99>
 <2><aec81>: Abbrev Number: 0
 <1><aec82>: Abbrev Number: 3 (DW_TAG_typedef)
    <aec83>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <aec87>   DW_AT_decl_file   : 8
    <aec88>   DW_AT_decl_line   : 60
    <aec89>   DW_AT_decl_column : 15
    <aec8a>   DW_AT_type        : <0xaec6e>
 <1><aec8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <aec8f>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <aec93>   DW_AT_decl_file   : 8
    <aec94>   DW_AT_decl_line   : 61
    <aec95>   DW_AT_decl_column : 15
    <aec96>   DW_AT_type        : <0xaec9a>
 <1><aec9a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aec9b>   DW_AT_byte_size   : 8
    <aec9b>   DW_AT_type        : <0xaec9f>
 <1><aec9f>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aeca0>   DW_AT_prototyped  : 1
    <aeca0>   DW_AT_type        : <0xae9b5>
    <aeca4>   DW_AT_sibling     : <0xaecb8>
 <2><aeca8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aeca9>   DW_AT_type        : <0xaeb99>
 <2><aecad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aecae>   DW_AT_type        : <0xaea48>
 <2><aecb2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aecb3>   DW_AT_type        : <0xae9b5>
 <2><aecb7>: Abbrev Number: 0
 <1><aecb8>: Abbrev Number: 3 (DW_TAG_typedef)
    <aecb9>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <aecbd>   DW_AT_decl_file   : 8
    <aecbe>   DW_AT_decl_line   : 62
    <aecbf>   DW_AT_decl_column : 15
    <aecc0>   DW_AT_type        : <0xaecc4>
 <1><aecc4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aecc5>   DW_AT_byte_size   : 8
    <aecc5>   DW_AT_type        : <0xaecc9>
 <1><aecc9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aecca>   DW_AT_prototyped  : 1
    <aecca>   DW_AT_type        : <0xae9b5>
    <aecce>   DW_AT_sibling     : <0xaecdd>
 <2><aecd2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aecd3>   DW_AT_type        : <0xaeb99>
 <2><aecd7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aecd8>   DW_AT_type        : <0xaecdd>
 <2><aecdc>: Abbrev Number: 0
 <1><aecdd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aecde>   DW_AT_byte_size   : 8
    <aecde>   DW_AT_type        : <0xaea48>
 <1><aece2>: Abbrev Number: 3 (DW_TAG_typedef)
    <aece3>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <aece7>   DW_AT_decl_file   : 8
    <aece8>   DW_AT_decl_line   : 63
    <aece9>   DW_AT_decl_column : 15
    <aecea>   DW_AT_type        : <0xaecee>
 <1><aecee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aecef>   DW_AT_byte_size   : 8
    <aecef>   DW_AT_type        : <0xaecf3>
 <1><aecf3>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aecf4>   DW_AT_prototyped  : 1
    <aecf4>   DW_AT_type        : <0xae9b5>
    <aecf8>   DW_AT_sibling     : <0xaed0c>
 <2><aecfc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aecfd>   DW_AT_type        : <0xaeb99>
 <2><aed01>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed02>   DW_AT_type        : <0xae9cf>
 <2><aed06>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed07>   DW_AT_type        : <0xaed0c>
 <2><aed0b>: Abbrev Number: 0
 <1><aed0c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aed0d>   DW_AT_byte_size   : 8
    <aed0d>   DW_AT_type        : <0xae9e9>
 <1><aed11>: Abbrev Number: 3 (DW_TAG_typedef)
    <aed12>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <aed16>   DW_AT_decl_file   : 8
    <aed17>   DW_AT_decl_line   : 65
    <aed18>   DW_AT_decl_column : 15
    <aed19>   DW_AT_type        : <0xaed1d>
 <1><aed1d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aed1e>   DW_AT_byte_size   : 8
    <aed1e>   DW_AT_type        : <0xaed22>
 <1><aed22>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aed23>   DW_AT_prototyped  : 1
    <aed23>   DW_AT_type        : <0xae9b5>
    <aed27>   DW_AT_sibling     : <0xaed3b>
 <2><aed2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed2c>   DW_AT_type        : <0xaeb99>
 <2><aed30>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed31>   DW_AT_type        : <0xaeb3b>
 <2><aed35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed36>   DW_AT_type        : <0xaed0c>
 <2><aed3a>: Abbrev Number: 0
 <1><aed3b>: Abbrev Number: 3 (DW_TAG_typedef)
    <aed3c>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <aed40>   DW_AT_decl_file   : 8
    <aed41>   DW_AT_decl_line   : 67
    <aed42>   DW_AT_decl_column : 15
    <aed43>   DW_AT_type        : <0xaed47>
 <1><aed47>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aed48>   DW_AT_byte_size   : 8
    <aed48>   DW_AT_type        : <0xaed4c>
 <1><aed4c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aed4d>   DW_AT_prototyped  : 1
    <aed4d>   DW_AT_type        : <0xae9b5>
    <aed51>   DW_AT_sibling     : <0xaed65>
 <2><aed55>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed56>   DW_AT_type        : <0xaeb99>
 <2><aed5a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed5b>   DW_AT_type        : <0xaea3d>
 <2><aed5f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed60>   DW_AT_type        : <0xae9e9>
 <2><aed64>: Abbrev Number: 0
 <1><aed65>: Abbrev Number: 3 (DW_TAG_typedef)
    <aed66>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <aed6a>   DW_AT_decl_file   : 8
    <aed6b>   DW_AT_decl_line   : 69
    <aed6c>   DW_AT_decl_column : 15
    <aed6d>   DW_AT_type        : <0xaed71>
 <1><aed71>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aed72>   DW_AT_byte_size   : 8
    <aed72>   DW_AT_type        : <0xaed76>
 <1><aed76>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aed77>   DW_AT_prototyped  : 1
    <aed77>   DW_AT_type        : <0xae9b5>
    <aed7b>   DW_AT_sibling     : <0xaed8f>
 <2><aed7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed80>   DW_AT_type        : <0xaeb99>
 <2><aed84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed85>   DW_AT_type        : <0xaed8f>
 <2><aed89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aed8a>   DW_AT_type        : <0xae9e9>
 <2><aed8e>: Abbrev Number: 0
 <1><aed8f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aed90>   DW_AT_byte_size   : 8
    <aed90>   DW_AT_type        : <0xaea02>
 <1><aed94>: Abbrev Number: 3 (DW_TAG_typedef)
    <aed95>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <aed99>   DW_AT_decl_file   : 8
    <aed9a>   DW_AT_decl_line   : 71
    <aed9b>   DW_AT_decl_column : 15
    <aed9c>   DW_AT_type        : <0xaeda0>
 <1><aeda0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeda1>   DW_AT_byte_size   : 8
    <aeda1>   DW_AT_type        : <0xaeda5>
 <1><aeda5>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aeda6>   DW_AT_prototyped  : 1
    <aeda6>   DW_AT_type        : <0xae9b5>
    <aedaa>   DW_AT_sibling     : <0xaedbe>
 <2><aedae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aedaf>   DW_AT_type        : <0xaeb99>
 <2><aedb3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aedb4>   DW_AT_type        : <0xaea48>
 <2><aedb8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aedb9>   DW_AT_type        : <0xaea48>
 <2><aedbd>: Abbrev Number: 0
 <1><aedbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <aedbf>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <aedc3>   DW_AT_decl_file   : 8
    <aedc4>   DW_AT_decl_line   : 73
    <aedc5>   DW_AT_decl_column : 15
    <aedc6>   DW_AT_type        : <0xaeda0>
 <1><aedca>: Abbrev Number: 3 (DW_TAG_typedef)
    <aedcb>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <aedcf>   DW_AT_decl_file   : 8
    <aedd0>   DW_AT_decl_line   : 75
    <aedd1>   DW_AT_decl_column : 15
    <aedd2>   DW_AT_type        : <0xaedd6>
 <1><aedd6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aedd7>   DW_AT_byte_size   : 8
    <aedd7>   DW_AT_type        : <0xaeddb>
 <1><aeddb>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aeddc>   DW_AT_prototyped  : 1
    <aeddc>   DW_AT_type        : <0xae9b5>
    <aede0>   DW_AT_sibling     : <0xaedef>
 <2><aede4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aede5>   DW_AT_type        : <0xaeb99>
 <2><aede9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aedea>   DW_AT_type        : <0xaedef>
 <2><aedee>: Abbrev Number: 0
 <1><aedef>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aedf0>   DW_AT_byte_size   : 8
    <aedf0>   DW_AT_type        : <0xaeb11>
 <1><aedf4>: Abbrev Number: 3 (DW_TAG_typedef)
    <aedf5>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <aedf9>   DW_AT_decl_file   : 8
    <aedfa>   DW_AT_decl_line   : 76
    <aedfb>   DW_AT_decl_column : 15
    <aedfc>   DW_AT_type        : <0xaee00>
 <1><aee00>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aee01>   DW_AT_byte_size   : 8
    <aee01>   DW_AT_type        : <0xaee05>
 <1><aee05>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <aee06>   DW_AT_prototyped  : 1
    <aee06>   DW_AT_type        : <0xae9b5>
    <aee0a>   DW_AT_sibling     : <0xaee1e>
 <2><aee0e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aee0f>   DW_AT_type        : <0xaeb99>
 <2><aee13>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aee14>   DW_AT_type        : <0xaeb3b>
 <2><aee18>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aee19>   DW_AT_type        : <0xaea1a>
 <2><aee1d>: Abbrev Number: 0
 <1><aee1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <aee1f>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <aee23>   DW_AT_decl_file   : 8
    <aee24>   DW_AT_decl_line   : 77
    <aee25>   DW_AT_decl_column : 15
    <aee26>   DW_AT_type        : <0xaec6e>
 <1><aee2a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aee2b>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <aee2f>   DW_AT_byte_size   : 112
    <aee30>   DW_AT_decl_file   : 8
    <aee31>   DW_AT_decl_line   : 80
    <aee32>   DW_AT_decl_column : 16
    <aee33>   DW_AT_sibling     : <0xaeeee>
 <2><aee37>: Abbrev Number: 2 (DW_TAG_member)
    <aee38>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <aee3c>   DW_AT_decl_file   : 8
    <aee3d>   DW_AT_decl_line   : 81
    <aee3e>   DW_AT_decl_column : 25
    <aee3f>   DW_AT_type        : <0xaec62>
    <aee43>   DW_AT_data_member_location: 0
 <2><aee44>: Abbrev Number: 2 (DW_TAG_member)
    <aee45>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <aee49>   DW_AT_decl_file   : 8
    <aee4a>   DW_AT_decl_line   : 82
    <aee4b>   DW_AT_decl_column : 25
    <aee4c>   DW_AT_type        : <0xaec82>
    <aee50>   DW_AT_data_member_location: 8
 <2><aee51>: Abbrev Number: 2 (DW_TAG_member)
    <aee52>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <aee56>   DW_AT_decl_file   : 8
    <aee57>   DW_AT_decl_line   : 83
    <aee58>   DW_AT_decl_column : 25
    <aee59>   DW_AT_type        : <0xaec8e>
    <aee5d>   DW_AT_data_member_location: 16
 <2><aee5e>: Abbrev Number: 2 (DW_TAG_member)
    <aee5f>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <aee63>   DW_AT_decl_file   : 8
    <aee64>   DW_AT_decl_line   : 84
    <aee65>   DW_AT_decl_column : 25
    <aee66>   DW_AT_type        : <0xaecb8>
    <aee6a>   DW_AT_data_member_location: 24
 <2><aee6b>: Abbrev Number: 2 (DW_TAG_member)
    <aee6c>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <aee70>   DW_AT_decl_file   : 8
    <aee71>   DW_AT_decl_line   : 85
    <aee72>   DW_AT_decl_column : 25
    <aee73>   DW_AT_type        : <0xaece2>
    <aee77>   DW_AT_data_member_location: 32
 <2><aee78>: Abbrev Number: 2 (DW_TAG_member)
    <aee79>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <aee7d>   DW_AT_decl_file   : 8
    <aee7e>   DW_AT_decl_line   : 86
    <aee7f>   DW_AT_decl_column : 25
    <aee80>   DW_AT_type        : <0xaed11>
    <aee84>   DW_AT_data_member_location: 40
 <2><aee85>: Abbrev Number: 2 (DW_TAG_member)
    <aee86>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <aee8a>   DW_AT_decl_file   : 8
    <aee8b>   DW_AT_decl_line   : 87
    <aee8c>   DW_AT_decl_column : 25
    <aee8d>   DW_AT_type        : <0xaed3b>
    <aee91>   DW_AT_data_member_location: 48
 <2><aee92>: Abbrev Number: 2 (DW_TAG_member)
    <aee93>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <aee97>   DW_AT_decl_file   : 8
    <aee98>   DW_AT_decl_line   : 88
    <aee99>   DW_AT_decl_column : 25
    <aee9a>   DW_AT_type        : <0xaed65>
    <aee9e>   DW_AT_data_member_location: 56
 <2><aee9f>: Abbrev Number: 2 (DW_TAG_member)
    <aeea0>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <aeea4>   DW_AT_decl_file   : 8
    <aeea5>   DW_AT_decl_line   : 89
    <aeea6>   DW_AT_decl_column : 25
    <aeea7>   DW_AT_type        : <0xaed94>
    <aeeab>   DW_AT_data_member_location: 64
 <2><aeeac>: Abbrev Number: 2 (DW_TAG_member)
    <aeead>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <aeeb1>   DW_AT_decl_file   : 8
    <aeeb2>   DW_AT_decl_line   : 90
    <aeeb3>   DW_AT_decl_column : 25
    <aeeb4>   DW_AT_type        : <0xaedbe>
    <aeeb8>   DW_AT_data_member_location: 72
 <2><aeeb9>: Abbrev Number: 2 (DW_TAG_member)
    <aeeba>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <aeebe>   DW_AT_decl_file   : 8
    <aeebf>   DW_AT_decl_line   : 91
    <aeec0>   DW_AT_decl_column : 25
    <aeec1>   DW_AT_type        : <0xaedca>
    <aeec5>   DW_AT_data_member_location: 80
 <2><aeec6>: Abbrev Number: 2 (DW_TAG_member)
    <aeec7>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <aeecb>   DW_AT_decl_file   : 8
    <aeecc>   DW_AT_decl_line   : 92
    <aeecd>   DW_AT_decl_column : 25
    <aeece>   DW_AT_type        : <0xaedf4>
    <aeed2>   DW_AT_data_member_location: 88
 <2><aeed3>: Abbrev Number: 2 (DW_TAG_member)
    <aeed4>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <aeed8>   DW_AT_decl_file   : 8
    <aeed9>   DW_AT_decl_line   : 93
    <aeeda>   DW_AT_decl_column : 25
    <aeedb>   DW_AT_type        : <0xaeb74>
    <aeedf>   DW_AT_data_member_location: 96
 <2><aeee0>: Abbrev Number: 2 (DW_TAG_member)
    <aeee1>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <aeee5>   DW_AT_decl_file   : 8
    <aeee6>   DW_AT_decl_line   : 94
    <aeee7>   DW_AT_decl_column : 25
    <aeee8>   DW_AT_type        : <0xaee1e>
    <aeeec>   DW_AT_data_member_location: 104
 <2><aeeed>: Abbrev Number: 0
 <1><aeeee>: Abbrev Number: 3 (DW_TAG_typedef)
    <aeeef>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <aeef3>   DW_AT_decl_file   : 8
    <aeef4>   DW_AT_decl_line   : 95
    <aeef5>   DW_AT_decl_column : 3
    <aeef6>   DW_AT_type        : <0xaee2a>
 <1><aeefa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aeefb>   DW_AT_byte_size   : 8
    <aeefb>   DW_AT_type        : <0xaeeee>
 <1><aeeff>: Abbrev Number: 3 (DW_TAG_typedef)
    <aef00>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <aef04>   DW_AT_decl_file   : 8
    <aef05>   DW_AT_decl_line   : 117
    <aef06>   DW_AT_decl_column : 3
    <aef07>   DW_AT_type        : <0xaeb9e>
 <1><aef0b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <aef0c>   DW_AT_byte_size   : 48
    <aef0d>   DW_AT_decl_file   : 8
    <aef0e>   DW_AT_decl_line   : 119
    <aef0f>   DW_AT_decl_column : 9
    <aef10>   DW_AT_sibling     : <0xaef49>
 <2><aef14>: Abbrev Number: 2 (DW_TAG_member)
    <aef15>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <aef19>   DW_AT_decl_file   : 8
    <aef1a>   DW_AT_decl_line   : 120
    <aef1b>   DW_AT_decl_column : 16
    <aef1c>   DW_AT_type        : <0xaef49>
    <aef20>   DW_AT_data_member_location: 0
 <2><aef21>: Abbrev Number: 2 (DW_TAG_member)
    <aef22>   DW_AT_name        : (indirect string, offset: 0x1aea9): status
    <aef26>   DW_AT_decl_file   : 8
    <aef27>   DW_AT_decl_line   : 121
    <aef28>   DW_AT_decl_column : 16
    <aef29>   DW_AT_type        : <0xae9b5>
    <aef2d>   DW_AT_data_member_location: 8
 <2><aef2e>: Abbrev Number: 8 (DW_TAG_member)
    <aef2f>   DW_AT_name        : str
    <aef33>   DW_AT_decl_file   : 8
    <aef34>   DW_AT_decl_line   : 122
    <aef35>   DW_AT_decl_column : 16
    <aef36>   DW_AT_type        : <0xaeb11>
    <aef3a>   DW_AT_data_member_location: 16
 <2><aef3b>: Abbrev Number: 2 (DW_TAG_member)
    <aef3c>   DW_AT_name        : (indirect string, offset: 0x1baf1): index
    <aef40>   DW_AT_decl_file   : 8
    <aef41>   DW_AT_decl_line   : 123
    <aef42>   DW_AT_decl_column : 15
    <aef43>   DW_AT_type        : <0xae9b5>
    <aef47>   DW_AT_data_member_location: 40
 <2><aef48>: Abbrev Number: 0
 <1><aef49>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <aef4a>   DW_AT_byte_size   : 8
    <aef4a>   DW_AT_type        : <0xaeeff>
 <1><aef4e>: Abbrev Number: 3 (DW_TAG_typedef)
    <aef4f>   DW_AT_name        : (indirect string, offset: 0x1ae86): FB_INPUTCTX
    <aef53>   DW_AT_decl_file   : 8
    <aef54>   DW_AT_decl_line   : 124
    <aef55>   DW_AT_decl_column : 3
    <aef56>   DW_AT_type        : <0xaef0b>
 <1><aef5a>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <aef5b>   DW_AT_encoding    : 7	(unsigned)
    <aef5c>   DW_AT_byte_size   : 4
    <aef5d>   DW_AT_type        : <0xae999>
    <aef61>   DW_AT_decl_file   : 9
    <aef62>   DW_AT_decl_line   : 34
    <aef63>   DW_AT_decl_column : 6
    <aef64>   DW_AT_sibling     : <0xaef93>
 <2><aef68>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef69>   DW_AT_name        : (indirect string, offset: 0x17ac3): FB_TLSKEY_ERROR
    <aef6d>   DW_AT_const_value : 0
 <2><aef6e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef6f>   DW_AT_name        : (indirect string, offset: 0x17a8d): FB_TLSKEY_DIR
    <aef73>   DW_AT_const_value : 1
 <2><aef74>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef75>   DW_AT_name        : (indirect string, offset: 0x17a3a): FB_TLSKEY_INPUT
    <aef79>   DW_AT_const_value : 2
 <2><aef7a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef7b>   DW_AT_name        : (indirect string, offset: 0x17a0c): FB_TLSKEY_PRINTUSG
    <aef7f>   DW_AT_const_value : 3
 <2><aef80>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef81>   DW_AT_name        : (indirect string, offset: 0x17ae5): FB_TLSKEY_GFX
    <aef85>   DW_AT_const_value : 4
 <2><aef86>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef87>   DW_AT_name        : (indirect string, offset: 0x1793c): FB_TLSKEY_FBTHREAD
    <aef8b>   DW_AT_const_value : 5
 <2><aef8c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <aef8d>   DW_AT_name        : (indirect string, offset: 0x179b5): FB_TLSKEYS
    <aef91>   DW_AT_const_value : 6
 <2><aef92>: Abbrev Number: 0
 <1><aef93>: Abbrev Number: 3 (DW_TAG_typedef)
    <aef94>   DW_AT_name        : (indirect string, offset: 0x17b69): FB_TLS_DESTRUCTOR
    <aef98>   DW_AT_decl_file   : 9
    <aef99>   DW_AT_decl_line   : 44
    <aef9a>   DW_AT_decl_column : 17
    <aef9b>   DW_AT_type        : <0xaeb1d>
 <1><aef9f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <aefa0>   DW_AT_byte_size   : 8
    <aefa1>   DW_AT_decl_file   : 10
    <aefa2>   DW_AT_decl_line   : 4
    <aefa3>   DW_AT_decl_column : 3
    <aefa4>   DW_AT_sibling     : <0xaefc3>
 <2><aefa8>: Abbrev Number: 2 (DW_TAG_member)
    <aefa9>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <aefad>   DW_AT_decl_file   : 10
    <aefae>   DW_AT_decl_line   : 5
    <aefaf>   DW_AT_decl_column : 8
    <aefb0>   DW_AT_type        : <0xae9b5>
    <aefb4>   DW_AT_data_member_location: 0
 <2><aefb5>: Abbrev Number: 2 (DW_TAG_member)
    <aefb6>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <aefba>   DW_AT_decl_file   : 10
    <aefbb>   DW_AT_decl_line   : 6
    <aefbc>   DW_AT_decl_column : 8
    <aefbd>   DW_AT_type        : <0xae9b5>
    <aefc1>   DW_AT_data_member_location: 4
 <2><aefc2>: Abbrev Number: 0
 <1><aefc3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <aefc4>   DW_AT_byte_size   : 16
    <aefc5>   DW_AT_decl_file   : 10
    <aefc6>   DW_AT_decl_line   : 8
    <aefc7>   DW_AT_decl_column : 3
    <aefc8>   DW_AT_sibling     : <0xaeffb>
 <2><aefcc>: Abbrev Number: 8 (DW_TAG_member)
    <aefcd>   DW_AT_name        : x
    <aefcf>   DW_AT_decl_file   : 10
    <aefd0>   DW_AT_decl_line   : 9
    <aefd1>   DW_AT_decl_column : 8
    <aefd2>   DW_AT_type        : <0xae9b5>
    <aefd6>   DW_AT_data_member_location: 0
 <2><aefd7>: Abbrev Number: 8 (DW_TAG_member)
    <aefd8>   DW_AT_name        : y
    <aefda>   DW_AT_decl_file   : 10
    <aefdb>   DW_AT_decl_line   : 9
    <aefdc>   DW_AT_decl_column : 11
    <aefdd>   DW_AT_type        : <0xae9b5>
    <aefe1>   DW_AT_data_member_location: 4
 <2><aefe2>: Abbrev Number: 8 (DW_TAG_member)
    <aefe3>   DW_AT_name        : dx
    <aefe6>   DW_AT_decl_file   : 10
    <aefe7>   DW_AT_decl_line   : 10
    <aefe8>   DW_AT_decl_column : 8
    <aefe9>   DW_AT_type        : <0xae9b5>
    <aefed>   DW_AT_data_member_location: 8
 <2><aefee>: Abbrev Number: 8 (DW_TAG_member)
    <aefef>   DW_AT_name        : dy
    <aeff2>   DW_AT_decl_file   : 10
    <aeff3>   DW_AT_decl_line   : 10
    <aeff4>   DW_AT_decl_column : 12
    <aeff5>   DW_AT_type        : <0xae9b5>
    <aeff9>   DW_AT_data_member_location: 12
 <2><aeffa>: Abbrev Number: 0
 <1><aeffb>: Abbrev Number: 34 (DW_TAG_union_type)
    <aeffc>   DW_AT_byte_size   : 16
    <aeffd>   DW_AT_decl_file   : 10
    <aeffe>   DW_AT_decl_line   : 3
    <aefff>   DW_AT_decl_column : 2
    <af000>   DW_AT_sibling     : <0xaf02b>
 <2><af004>: Abbrev Number: 18 (DW_TAG_member)
    <af005>   DW_AT_type        : <0xaef9f>
 <2><af009>: Abbrev Number: 18 (DW_TAG_member)
    <af00a>   DW_AT_type        : <0xaefc3>
 <2><af00e>: Abbrev Number: 35 (DW_TAG_member)
    <af00f>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <af013>   DW_AT_decl_file   : 10
    <af014>   DW_AT_decl_line   : 12
    <af015>   DW_AT_decl_column : 7
    <af016>   DW_AT_type        : <0xae9b5>
 <2><af01a>: Abbrev Number: 19 (DW_TAG_member)
    <af01b>   DW_AT_name        : z
    <af01d>   DW_AT_decl_file   : 10
    <af01d>   DW_AT_decl_line   : 13
    <af01e>   DW_AT_decl_column : 7
    <af01e>   DW_AT_type        : <0xae9b5>
 <2><af022>: Abbrev Number: 19 (DW_TAG_member)
    <af023>   DW_AT_name        : w
    <af025>   DW_AT_decl_file   : 10
    <af025>   DW_AT_decl_line   : 14
    <af026>   DW_AT_decl_column : 7
    <af026>   DW_AT_type        : <0xae9b5>
 <2><af02a>: Abbrev Number: 0
 <1><af02b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <af02c>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <af030>   DW_AT_byte_size   : 20
    <af031>   DW_AT_decl_file   : 10
    <af032>   DW_AT_decl_line   : 1
    <af033>   DW_AT_decl_column : 8
    <af034>   DW_AT_sibling     : <0xaf04c>
 <2><af038>: Abbrev Number: 2 (DW_TAG_member)
    <af039>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <af03d>   DW_AT_decl_file   : 10
    <af03e>   DW_AT_decl_line   : 2
    <af03f>   DW_AT_decl_column : 6
    <af040>   DW_AT_type        : <0xae9b5>
    <af044>   DW_AT_data_member_location: 0
 <2><af045>: Abbrev Number: 36 (DW_TAG_member)
    <af046>   DW_AT_type        : <0xaeffb>
    <af04a>   DW_AT_data_member_location: 4
 <2><af04b>: Abbrev Number: 0
 <1><af04c>: Abbrev Number: 3 (DW_TAG_typedef)
    <af04d>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <af051>   DW_AT_decl_file   : 10
    <af052>   DW_AT_decl_line   : 18
    <af053>   DW_AT_decl_column : 23
    <af054>   DW_AT_type        : <0xaf02b>
 <1><af058>: Abbrev Number: 3 (DW_TAG_typedef)
    <af059>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <af05d>   DW_AT_decl_file   : 11
    <af05e>   DW_AT_decl_line   : 1
    <af05f>   DW_AT_decl_column : 23
    <af060>   DW_AT_type        : <0xaf064>
 <1><af064>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af065>   DW_AT_byte_size   : 8
    <af065>   DW_AT_type        : <0xaf069>
 <1><af069>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <af06a>   DW_AT_prototyped  : 1
    <af06a>   DW_AT_type        : <0xaedef>
 <1><af06e>: Abbrev Number: 3 (DW_TAG_typedef)
    <af06f>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <af073>   DW_AT_decl_file   : 11
    <af074>   DW_AT_decl_line   : 2
    <af075>   DW_AT_decl_column : 23
    <af076>   DW_AT_type        : <0xaf07a>
 <1><af07a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af07b>   DW_AT_byte_size   : 8
    <af07b>   DW_AT_type        : <0xaf07f>
 <1><af07f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <af080>   DW_AT_prototyped  : 1
    <af080>   DW_AT_type        : <0xae9b5>
 <1><af084>: Abbrev Number: 3 (DW_TAG_typedef)
    <af085>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <af089>   DW_AT_decl_file   : 11
    <af08a>   DW_AT_decl_line   : 3
    <af08b>   DW_AT_decl_column : 23
    <af08c>   DW_AT_type        : <0xaf07a>
 <1><af090>: Abbrev Number: 3 (DW_TAG_typedef)
    <af091>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <af095>   DW_AT_decl_file   : 11
    <af096>   DW_AT_decl_line   : 10
    <af097>   DW_AT_decl_column : 23
    <af098>   DW_AT_type        : <0xaf09c>
 <1><af09c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af09d>   DW_AT_byte_size   : 8
    <af09d>   DW_AT_type        : <0xaf0a1>
 <1><af0a1>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <af0a2>   DW_AT_prototyped  : 1
    <af0a2>   DW_AT_sibling     : <0xaf0ac>
 <2><af0a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af0a7>   DW_AT_type        : <0xae9b5>
 <2><af0ab>: Abbrev Number: 0
 <1><af0ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <af0ad>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <af0b1>   DW_AT_decl_file   : 11
    <af0b2>   DW_AT_decl_line   : 14
    <af0b3>   DW_AT_decl_column : 23
    <af0b4>   DW_AT_type        : <0xaf0b8>
 <1><af0b8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af0b9>   DW_AT_byte_size   : 8
    <af0b9>   DW_AT_type        : <0xaf0bd>
 <1><af0bd>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af0be>   DW_AT_prototyped  : 1
    <af0be>   DW_AT_type        : <0xae9b5>
    <af0c2>   DW_AT_sibling     : <0xaf0d6>
 <2><af0c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af0c7>   DW_AT_type        : <0xae9b5>
 <2><af0cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af0cc>   DW_AT_type        : <0xae9b5>
 <2><af0d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af0d1>   DW_AT_type        : <0xae9b5>
 <2><af0d5>: Abbrev Number: 0
 <1><af0d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <af0d7>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <af0db>   DW_AT_decl_file   : 11
    <af0dc>   DW_AT_decl_line   : 18
    <af0dd>   DW_AT_decl_column : 23
    <af0de>   DW_AT_type        : <0xaf0b8>
 <1><af0e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <af0e3>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <af0e7>   DW_AT_decl_file   : 11
    <af0e8>   DW_AT_decl_line   : 24
    <af0e9>   DW_AT_decl_column : 23
    <af0ea>   DW_AT_type        : <0xaead6>
 <1><af0ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <af0ef>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <af0f3>   DW_AT_decl_file   : 11
    <af0f4>   DW_AT_decl_line   : 28
    <af0f5>   DW_AT_decl_column : 23
    <af0f6>   DW_AT_type        : <0xaf0fa>
 <1><af0fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af0fb>   DW_AT_byte_size   : 8
    <af0fb>   DW_AT_type        : <0xaf0ff>
 <1><af0ff>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af100>   DW_AT_prototyped  : 1
    <af100>   DW_AT_type        : <0xae9b5>
    <af104>   DW_AT_sibling     : <0xaf113>
 <2><af108>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af109>   DW_AT_type        : <0xae9b5>
 <2><af10d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af10e>   DW_AT_type        : <0xae9b5>
 <2><af112>: Abbrev Number: 0
 <1><af113>: Abbrev Number: 3 (DW_TAG_typedef)
    <af114>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <af118>   DW_AT_decl_file   : 11
    <af119>   DW_AT_decl_line   : 34
    <af11a>   DW_AT_decl_column : 23
    <af11b>   DW_AT_type        : <0xaf07a>
 <1><af11f>: Abbrev Number: 3 (DW_TAG_typedef)
    <af120>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <af124>   DW_AT_decl_file   : 11
    <af125>   DW_AT_decl_line   : 35
    <af126>   DW_AT_decl_column : 23
    <af127>   DW_AT_type        : <0xaf07a>
 <1><af12b>: Abbrev Number: 3 (DW_TAG_typedef)
    <af12c>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <af130>   DW_AT_decl_file   : 11
    <af131>   DW_AT_decl_line   : 36
    <af132>   DW_AT_decl_column : 23
    <af133>   DW_AT_type        : <0xaf137>
 <1><af137>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af138>   DW_AT_byte_size   : 8
    <af138>   DW_AT_type        : <0xaf13c>
 <1><af13c>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <af13d>   DW_AT_prototyped  : 1
    <af13d>   DW_AT_sibling     : <0xaf14c>
 <2><af141>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af142>   DW_AT_type        : <0xaf14c>
 <2><af146>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af147>   DW_AT_type        : <0xaf14c>
 <2><af14b>: Abbrev Number: 0
 <1><af14c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af14d>   DW_AT_byte_size   : 8
    <af14d>   DW_AT_type        : <0xae9b5>
 <1><af151>: Abbrev Number: 3 (DW_TAG_typedef)
    <af152>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <af156>   DW_AT_decl_file   : 11
    <af157>   DW_AT_decl_line   : 37
    <af158>   DW_AT_decl_column : 23
    <af159>   DW_AT_type        : <0xaf137>
 <1><af15d>: Abbrev Number: 3 (DW_TAG_typedef)
    <af15e>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <af162>   DW_AT_decl_file   : 11
    <af163>   DW_AT_decl_line   : 45
    <af164>   DW_AT_decl_column : 24
    <af165>   DW_AT_type        : <0xaf169>
 <1><af169>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af16a>   DW_AT_byte_size   : 8
    <af16a>   DW_AT_type        : <0xaf16e>
 <1><af16e>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af16f>   DW_AT_prototyped  : 1
    <af16f>   DW_AT_type        : <0xae999>
    <af173>   DW_AT_sibling     : <0xaf187>
 <2><af177>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af178>   DW_AT_type        : <0xae9b5>
 <2><af17c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af17d>   DW_AT_type        : <0xae9b5>
 <2><af181>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af182>   DW_AT_type        : <0xae9b5>
 <2><af186>: Abbrev Number: 0
 <1><af187>: Abbrev Number: 3 (DW_TAG_typedef)
    <af188>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <af18c>   DW_AT_decl_file   : 11
    <af18d>   DW_AT_decl_line   : 48
    <af18e>   DW_AT_decl_column : 23
    <af18f>   DW_AT_type        : <0xaf193>
 <1><af193>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af194>   DW_AT_byte_size   : 8
    <af194>   DW_AT_type        : <0xaf198>
 <1><af198>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <af199>   DW_AT_prototyped  : 1
    <af199>   DW_AT_sibling     : <0xaf1ad>
 <2><af19d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af19e>   DW_AT_type        : <0xaea3d>
 <2><af1a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1a3>   DW_AT_type        : <0xae9e9>
 <2><af1a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1a8>   DW_AT_type        : <0xae9b5>
 <2><af1ac>: Abbrev Number: 0
 <1><af1ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <af1ae>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <af1b2>   DW_AT_decl_file   : 11
    <af1b3>   DW_AT_decl_line   : 49
    <af1b4>   DW_AT_decl_column : 23
    <af1b5>   DW_AT_type        : <0xaf1b9>
 <1><af1b9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af1ba>   DW_AT_byte_size   : 8
    <af1ba>   DW_AT_type        : <0xaf1be>
 <1><af1be>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <af1bf>   DW_AT_prototyped  : 1
    <af1bf>   DW_AT_sibling     : <0xaf1d3>
 <2><af1c3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1c4>   DW_AT_type        : <0xaed8f>
 <2><af1c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1c9>   DW_AT_type        : <0xae9e9>
 <2><af1cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1ce>   DW_AT_type        : <0xae9b5>
 <2><af1d2>: Abbrev Number: 0
 <1><af1d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <af1d4>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <af1d8>   DW_AT_decl_file   : 11
    <af1d9>   DW_AT_decl_line   : 51
    <af1da>   DW_AT_decl_column : 24
    <af1db>   DW_AT_type        : <0xaf1df>
 <1><af1df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af1e0>   DW_AT_byte_size   : 8
    <af1e0>   DW_AT_type        : <0xaf1e4>
 <1><af1e4>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af1e5>   DW_AT_prototyped  : 1
    <af1e5>   DW_AT_type        : <0xae9dd>
    <af1e9>   DW_AT_sibling     : <0xaf1f8>
 <2><af1ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1ee>   DW_AT_type        : <0xae9dd>
 <2><af1f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af1f3>   DW_AT_type        : <0xaea1a>
 <2><af1f7>: Abbrev Number: 0
 <1><af1f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <af1f9>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <af1fd>   DW_AT_decl_file   : 11
    <af1fe>   DW_AT_decl_line   : 54
    <af1ff>   DW_AT_decl_column : 23
    <af200>   DW_AT_type        : <0xaf204>
 <1><af204>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af205>   DW_AT_byte_size   : 8
    <af205>   DW_AT_type        : <0xaf209>
 <1><af209>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af20a>   DW_AT_prototyped  : 1
    <af20a>   DW_AT_type        : <0xae9b5>
    <af20e>   DW_AT_sibling     : <0xaf231>
 <2><af212>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af213>   DW_AT_type        : <0xaedef>
 <2><af217>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af218>   DW_AT_type        : <0xae9cf>
 <2><af21c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af21d>   DW_AT_type        : <0xaea1a>
 <2><af221>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af222>   DW_AT_type        : <0xae9b5>
 <2><af226>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af227>   DW_AT_type        : <0xae9b5>
 <2><af22b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af22c>   DW_AT_type        : <0xae9b5>
 <2><af230>: Abbrev Number: 0
 <1><af231>: Abbrev Number: 3 (DW_TAG_typedef)
    <af232>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <af236>   DW_AT_decl_file   : 11
    <af237>   DW_AT_decl_line   : 56
    <af238>   DW_AT_decl_column : 23
    <af239>   DW_AT_type        : <0xaf23d>
 <1><af23d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af23e>   DW_AT_byte_size   : 8
    <af23e>   DW_AT_type        : <0xaf242>
 <1><af242>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af243>   DW_AT_prototyped  : 1
    <af243>   DW_AT_type        : <0xae9b5>
    <af247>   DW_AT_sibling     : <0xaf265>
 <2><af24b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af24c>   DW_AT_type        : <0xaed8f>
 <2><af250>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af251>   DW_AT_type        : <0xaeb3b>
 <2><af255>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af256>   DW_AT_type        : <0xaea1a>
 <2><af25a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af25b>   DW_AT_type        : <0xae9b5>
 <2><af25f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af260>   DW_AT_type        : <0xae9b5>
 <2><af264>: Abbrev Number: 0
 <1><af265>: Abbrev Number: 3 (DW_TAG_typedef)
    <af266>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <af26a>   DW_AT_decl_file   : 11
    <af26b>   DW_AT_decl_line   : 67
    <af26c>   DW_AT_decl_column : 23
    <af26d>   DW_AT_type        : <0xaf271>
 <1><af271>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af272>   DW_AT_byte_size   : 8
    <af272>   DW_AT_type        : <0xaf276>
 <1><af276>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af277>   DW_AT_prototyped  : 1
    <af277>   DW_AT_type        : <0xae9b5>
    <af27b>   DW_AT_sibling     : <0xaf285>
 <2><af27f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af280>   DW_AT_type        : <0xae9b5>
 <2><af284>: Abbrev Number: 0
 <1><af285>: Abbrev Number: 3 (DW_TAG_typedef)
    <af286>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <af28a>   DW_AT_decl_file   : 11
    <af28b>   DW_AT_decl_line   : 68
    <af28c>   DW_AT_decl_column : 23
    <af28d>   DW_AT_type        : <0xaf291>
 <1><af291>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af292>   DW_AT_byte_size   : 8
    <af292>   DW_AT_type        : <0xaf296>
 <1><af296>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af297>   DW_AT_prototyped  : 1
    <af297>   DW_AT_type        : <0xae9b5>
    <af29b>   DW_AT_sibling     : <0xaf2b9>
 <2><af29f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2a0>   DW_AT_type        : <0xaf14c>
 <2><af2a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2a5>   DW_AT_type        : <0xaf14c>
 <2><af2a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2aa>   DW_AT_type        : <0xaf14c>
 <2><af2ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2af>   DW_AT_type        : <0xaf14c>
 <2><af2b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2b4>   DW_AT_type        : <0xaf14c>
 <2><af2b8>: Abbrev Number: 0
 <1><af2b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <af2ba>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <af2be>   DW_AT_decl_file   : 11
    <af2bf>   DW_AT_decl_line   : 69
    <af2c0>   DW_AT_decl_column : 23
    <af2c1>   DW_AT_type        : <0xaf2c5>
 <1><af2c5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af2c6>   DW_AT_byte_size   : 8
    <af2c6>   DW_AT_type        : <0xaf2ca>
 <1><af2ca>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af2cb>   DW_AT_prototyped  : 1
    <af2cb>   DW_AT_type        : <0xae9b5>
    <af2cf>   DW_AT_sibling     : <0xaf2e8>
 <2><af2d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2d4>   DW_AT_type        : <0xae9b5>
 <2><af2d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2d9>   DW_AT_type        : <0xae9b5>
 <2><af2dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2de>   DW_AT_type        : <0xae9b5>
 <2><af2e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af2e3>   DW_AT_type        : <0xae9b5>
 <2><af2e7>: Abbrev Number: 0
 <1><af2e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <af2e9>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <af2ed>   DW_AT_decl_file   : 11
    <af2ee>   DW_AT_decl_line   : 73
    <af2ef>   DW_AT_decl_column : 23
    <af2f0>   DW_AT_type        : <0xaf2f4>
 <1><af2f4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af2f5>   DW_AT_byte_size   : 8
    <af2f5>   DW_AT_type        : <0xaf2f9>
 <1><af2f9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af2fa>   DW_AT_prototyped  : 1
    <af2fa>   DW_AT_type        : <0xae9b5>
    <af2fe>   DW_AT_sibling     : <0xaf308>
 <2><af302>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af303>   DW_AT_type        : <0xae992>
 <2><af307>: Abbrev Number: 0
 <1><af308>: Abbrev Number: 3 (DW_TAG_typedef)
    <af309>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <af30d>   DW_AT_decl_file   : 11
    <af30e>   DW_AT_decl_line   : 74
    <af30f>   DW_AT_decl_column : 23
    <af310>   DW_AT_type        : <0xaf314>
 <1><af314>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af315>   DW_AT_byte_size   : 8
    <af315>   DW_AT_type        : <0xaf319>
 <1><af319>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <af31a>   DW_AT_prototyped  : 1
    <af31a>   DW_AT_type        : <0xae9b5>
    <af31e>   DW_AT_sibling     : <0xaf32d>
 <2><af322>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af323>   DW_AT_type        : <0xae992>
 <2><af327>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af328>   DW_AT_type        : <0xae98b>
 <2><af32c>: Abbrev Number: 0
 <1><af32d>: Abbrev Number: 3 (DW_TAG_typedef)
    <af32e>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <af332>   DW_AT_decl_file   : 11
    <af333>   DW_AT_decl_line   : 80
    <af334>   DW_AT_decl_column : 23
    <af335>   DW_AT_type        : <0xaf09c>
 <1><af339>: Abbrev Number: 3 (DW_TAG_typedef)
    <af33a>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <af33e>   DW_AT_decl_file   : 11
    <af33f>   DW_AT_decl_line   : 83
    <af340>   DW_AT_decl_column : 23
    <af341>   DW_AT_type        : <0xaf271>
 <1><af345>: Abbrev Number: 3 (DW_TAG_typedef)
    <af346>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <af34a>   DW_AT_decl_file   : 11
    <af34b>   DW_AT_decl_line   : 86
    <af34c>   DW_AT_decl_column : 23
    <af34d>   DW_AT_type        : <0xaf0fa>
 <1><af351>: Abbrev Number: 3 (DW_TAG_typedef)
    <af352>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <af356>   DW_AT_decl_file   : 11
    <af357>   DW_AT_decl_line   : 89
    <af358>   DW_AT_decl_column : 23
    <af359>   DW_AT_type        : <0xaf0fa>
 <1><af35d>: Abbrev Number: 3 (DW_TAG_typedef)
    <af35e>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <af362>   DW_AT_decl_file   : 11
    <af363>   DW_AT_decl_line   : 91
    <af364>   DW_AT_decl_column : 23
    <af365>   DW_AT_type        : <0xaf369>
 <1><af369>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af36a>   DW_AT_byte_size   : 8
    <af36a>   DW_AT_type        : <0xaf36e>
 <1><af36e>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <af36f>   DW_AT_prototyped  : 1
    <af36f>   DW_AT_sibling     : <0xaf379>
 <2><af373>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af374>   DW_AT_type        : <0xaf379>
 <2><af378>: Abbrev Number: 0
 <1><af379>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af37a>   DW_AT_byte_size   : 8
    <af37a>   DW_AT_type        : <0xaf04c>
 <1><af37e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <af37f>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <af383>   DW_AT_byte_size   : 224
    <af384>   DW_AT_decl_file   : 11
    <af385>   DW_AT_decl_line   : 93
    <af386>   DW_AT_decl_column : 16
    <af387>   DW_AT_sibling     : <0xaf4f8>
 <2><af38b>: Abbrev Number: 2 (DW_TAG_member)
    <af38c>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <af390>   DW_AT_decl_file   : 11
    <af391>   DW_AT_decl_line   : 94
    <af392>   DW_AT_decl_column : 23
    <af393>   DW_AT_type        : <0xaf058>
    <af397>   DW_AT_data_member_location: 0
 <2><af398>: Abbrev Number: 2 (DW_TAG_member)
    <af399>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <af39d>   DW_AT_decl_file   : 11
    <af39e>   DW_AT_decl_line   : 95
    <af39f>   DW_AT_decl_column : 23
    <af3a0>   DW_AT_type        : <0xaf06e>
    <af3a4>   DW_AT_data_member_location: 8
 <2><af3a5>: Abbrev Number: 2 (DW_TAG_member)
    <af3a6>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <af3aa>   DW_AT_decl_file   : 11
    <af3ab>   DW_AT_decl_line   : 96
    <af3ac>   DW_AT_decl_column : 23
    <af3ad>   DW_AT_type        : <0xaf084>
    <af3b1>   DW_AT_data_member_location: 16
 <2><af3b2>: Abbrev Number: 2 (DW_TAG_member)
    <af3b3>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <af3b7>   DW_AT_decl_file   : 11
    <af3b8>   DW_AT_decl_line   : 97
    <af3b9>   DW_AT_decl_column : 23
    <af3ba>   DW_AT_type        : <0xaf090>
    <af3be>   DW_AT_data_member_location: 24
 <2><af3bf>: Abbrev Number: 2 (DW_TAG_member)
    <af3c0>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <af3c4>   DW_AT_decl_file   : 11
    <af3c5>   DW_AT_decl_line   : 98
    <af3c6>   DW_AT_decl_column : 23
    <af3c7>   DW_AT_type        : <0xaf0ac>
    <af3cb>   DW_AT_data_member_location: 32
 <2><af3cc>: Abbrev Number: 2 (DW_TAG_member)
    <af3cd>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <af3d1>   DW_AT_decl_file   : 11
    <af3d2>   DW_AT_decl_line   : 99
    <af3d3>   DW_AT_decl_column : 23
    <af3d4>   DW_AT_type        : <0xaf0d6>
    <af3d8>   DW_AT_data_member_location: 40
 <2><af3d9>: Abbrev Number: 2 (DW_TAG_member)
    <af3da>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <af3de>   DW_AT_decl_file   : 11
    <af3df>   DW_AT_decl_line   : 100
    <af3e0>   DW_AT_decl_column : 23
    <af3e1>   DW_AT_type        : <0xaf0ee>
    <af3e5>   DW_AT_data_member_location: 48
 <2><af3e6>: Abbrev Number: 2 (DW_TAG_member)
    <af3e7>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <af3eb>   DW_AT_decl_file   : 11
    <af3ec>   DW_AT_decl_line   : 101
    <af3ed>   DW_AT_decl_column : 23
    <af3ee>   DW_AT_type        : <0xaf113>
    <af3f2>   DW_AT_data_member_location: 56
 <2><af3f3>: Abbrev Number: 2 (DW_TAG_member)
    <af3f4>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <af3f8>   DW_AT_decl_file   : 11
    <af3f9>   DW_AT_decl_line   : 102
    <af3fa>   DW_AT_decl_column : 23
    <af3fb>   DW_AT_type        : <0xaf11f>
    <af3ff>   DW_AT_data_member_location: 64
 <2><af400>: Abbrev Number: 2 (DW_TAG_member)
    <af401>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <af405>   DW_AT_decl_file   : 11
    <af406>   DW_AT_decl_line   : 103
    <af407>   DW_AT_decl_column : 23
    <af408>   DW_AT_type        : <0xaf12b>
    <af40c>   DW_AT_data_member_location: 72
 <2><af40d>: Abbrev Number: 2 (DW_TAG_member)
    <af40e>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <af412>   DW_AT_decl_file   : 11
    <af413>   DW_AT_decl_line   : 104
    <af414>   DW_AT_decl_column : 23
    <af415>   DW_AT_type        : <0xaf151>
    <af419>   DW_AT_data_member_location: 80
 <2><af41a>: Abbrev Number: 2 (DW_TAG_member)
    <af41b>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <af41f>   DW_AT_decl_file   : 11
    <af420>   DW_AT_decl_line   : 105
    <af421>   DW_AT_decl_column : 24
    <af422>   DW_AT_type        : <0xaf187>
    <af426>   DW_AT_data_member_location: 88
 <2><af427>: Abbrev Number: 2 (DW_TAG_member)
    <af428>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <af42c>   DW_AT_decl_file   : 11
    <af42d>   DW_AT_decl_line   : 106
    <af42e>   DW_AT_decl_column : 25
    <af42f>   DW_AT_type        : <0xaf1ad>
    <af433>   DW_AT_data_member_location: 96
 <2><af434>: Abbrev Number: 2 (DW_TAG_member)
    <af435>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <af439>   DW_AT_decl_file   : 11
    <af43a>   DW_AT_decl_line   : 107
    <af43b>   DW_AT_decl_column : 23
    <af43c>   DW_AT_type        : <0xaf1d3>
    <af440>   DW_AT_data_member_location: 104
 <2><af441>: Abbrev Number: 2 (DW_TAG_member)
    <af442>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <af446>   DW_AT_decl_file   : 11
    <af447>   DW_AT_decl_line   : 108
    <af448>   DW_AT_decl_column : 23
    <af449>   DW_AT_type        : <0xaf265>
    <af44d>   DW_AT_data_member_location: 112
 <2><af44e>: Abbrev Number: 2 (DW_TAG_member)
    <af44f>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <af453>   DW_AT_decl_file   : 11
    <af454>   DW_AT_decl_line   : 109
    <af455>   DW_AT_decl_column : 23
    <af456>   DW_AT_type        : <0xaf285>
    <af45a>   DW_AT_data_member_location: 120
 <2><af45b>: Abbrev Number: 2 (DW_TAG_member)
    <af45c>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <af460>   DW_AT_decl_file   : 11
    <af461>   DW_AT_decl_line   : 110
    <af462>   DW_AT_decl_column : 23
    <af463>   DW_AT_type        : <0xaf2b9>
    <af467>   DW_AT_data_member_location: 128
 <2><af468>: Abbrev Number: 2 (DW_TAG_member)
    <af469>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <af46d>   DW_AT_decl_file   : 11
    <af46e>   DW_AT_decl_line   : 111
    <af46f>   DW_AT_decl_column : 23
    <af470>   DW_AT_type        : <0xaf2e8>
    <af474>   DW_AT_data_member_location: 136
 <2><af475>: Abbrev Number: 2 (DW_TAG_member)
    <af476>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <af47a>   DW_AT_decl_file   : 11
    <af47b>   DW_AT_decl_line   : 112
    <af47c>   DW_AT_decl_column : 23
    <af47d>   DW_AT_type        : <0xaf308>
    <af481>   DW_AT_data_member_location: 144
 <2><af482>: Abbrev Number: 2 (DW_TAG_member)
    <af483>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <af487>   DW_AT_decl_file   : 11
    <af488>   DW_AT_decl_line   : 113
    <af489>   DW_AT_decl_column : 25
    <af48a>   DW_AT_type        : <0xaf0e2>
    <af48e>   DW_AT_data_member_location: 152
 <2><af48f>: Abbrev Number: 2 (DW_TAG_member)
    <af490>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <af494>   DW_AT_decl_file   : 11
    <af495>   DW_AT_decl_line   : 114
    <af496>   DW_AT_decl_column : 24
    <af497>   DW_AT_type        : <0xaf1f8>
    <af49b>   DW_AT_data_member_location: 160
 <2><af49c>: Abbrev Number: 2 (DW_TAG_member)
    <af49d>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <af4a1>   DW_AT_decl_file   : 11
    <af4a2>   DW_AT_decl_line   : 115
    <af4a3>   DW_AT_decl_column : 25
    <af4a4>   DW_AT_type        : <0xaf231>
    <af4a8>   DW_AT_data_member_location: 168
 <2><af4a9>: Abbrev Number: 2 (DW_TAG_member)
    <af4aa>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <af4ae>   DW_AT_decl_file   : 11
    <af4af>   DW_AT_decl_line   : 116
    <af4b0>   DW_AT_decl_column : 23
    <af4b1>   DW_AT_type        : <0xaf15d>
    <af4b5>   DW_AT_data_member_location: 176
 <2><af4b6>: Abbrev Number: 2 (DW_TAG_member)
    <af4b7>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <af4bb>   DW_AT_decl_file   : 11
    <af4bc>   DW_AT_decl_line   : 117
    <af4bd>   DW_AT_decl_column : 23
    <af4be>   DW_AT_type        : <0xaf32d>
    <af4c2>   DW_AT_data_member_location: 184
 <2><af4c3>: Abbrev Number: 2 (DW_TAG_member)
    <af4c4>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <af4c8>   DW_AT_decl_file   : 11
    <af4c9>   DW_AT_decl_line   : 118
    <af4ca>   DW_AT_decl_column : 22
    <af4cb>   DW_AT_type        : <0xaf339>
    <af4cf>   DW_AT_data_member_location: 192
 <2><af4d0>: Abbrev Number: 2 (DW_TAG_member)
    <af4d1>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <af4d5>   DW_AT_decl_file   : 11
    <af4d6>   DW_AT_decl_line   : 119
    <af4d7>   DW_AT_decl_column : 23
    <af4d8>   DW_AT_type        : <0xaf345>
    <af4dc>   DW_AT_data_member_location: 200
 <2><af4dd>: Abbrev Number: 2 (DW_TAG_member)
    <af4de>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <af4e2>   DW_AT_decl_file   : 11
    <af4e3>   DW_AT_decl_line   : 120
    <af4e4>   DW_AT_decl_column : 22
    <af4e5>   DW_AT_type        : <0xaf351>
    <af4e9>   DW_AT_data_member_location: 208
 <2><af4ea>: Abbrev Number: 2 (DW_TAG_member)
    <af4eb>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <af4ef>   DW_AT_decl_file   : 11
    <af4f0>   DW_AT_decl_line   : 121
    <af4f1>   DW_AT_decl_column : 23
    <af4f2>   DW_AT_type        : <0xaf35d>
    <af4f6>   DW_AT_data_member_location: 216
 <2><af4f7>: Abbrev Number: 0
 <1><af4f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <af4f9>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <af4fd>   DW_AT_decl_file   : 11
    <af4fe>   DW_AT_decl_line   : 122
    <af4ff>   DW_AT_decl_column : 3
    <af500>   DW_AT_type        : <0xaf37e>
 <1><af504>: Abbrev Number: 37 (DW_TAG_structure_type)
    <af505>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <af509>   DW_AT_byte_size   : 20848
    <af50b>   DW_AT_decl_file   : 12
    <af50c>   DW_AT_decl_line   : 349
    <af50e>   DW_AT_decl_column : 16
    <af50f>   DW_AT_sibling     : <0xaf584>
 <2><af513>: Abbrev Number: 12 (DW_TAG_member)
    <af514>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <af518>   DW_AT_decl_file   : 12
    <af518>   DW_AT_decl_line   : 350
    <af51a>   DW_AT_decl_column : 18
    <af51a>   DW_AT_type        : <0xae9b5>
    <af51e>   DW_AT_data_member_location: 0
 <2><af51f>: Abbrev Number: 12 (DW_TAG_member)
    <af520>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <af524>   DW_AT_decl_file   : 12
    <af524>   DW_AT_decl_line   : 351
    <af526>   DW_AT_decl_column : 18
    <af526>   DW_AT_type        : <0xaea43>
    <af52a>   DW_AT_data_member_location: 8
 <2><af52b>: Abbrev Number: 12 (DW_TAG_member)
    <af52c>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <af530>   DW_AT_decl_file   : 12
    <af530>   DW_AT_decl_line   : 352
    <af532>   DW_AT_decl_column : 18
    <af532>   DW_AT_type        : <0xaeb11>
    <af536>   DW_AT_data_member_location: 16
 <2><af537>: Abbrev Number: 12 (DW_TAG_member)
    <af538>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <af53c>   DW_AT_decl_file   : 12
    <af53c>   DW_AT_decl_line   : 353
    <af53e>   DW_AT_decl_column : 18
    <af53e>   DW_AT_type        : <0xae9dd>
    <af542>   DW_AT_data_member_location: 40
 <2><af543>: Abbrev Number: 12 (DW_TAG_member)
    <af544>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <af548>   DW_AT_decl_file   : 12
    <af548>   DW_AT_decl_line   : 354
    <af54a>   DW_AT_decl_column : 18
    <af54a>   DW_AT_type        : <0xaf4f8>
    <af54e>   DW_AT_data_member_location: 48
 <2><af54f>: Abbrev Number: 13 (DW_TAG_member)
    <af550>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <af554>   DW_AT_decl_file   : 12
    <af554>   DW_AT_decl_line   : 355
    <af556>   DW_AT_decl_column : 18
    <af556>   DW_AT_type        : <0xaf584>
    <af55a>   DW_AT_data_member_location: 272
 <2><af55c>: Abbrev Number: 13 (DW_TAG_member)
    <af55d>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <af561>   DW_AT_decl_file   : 12
    <af561>   DW_AT_decl_line   : 356
    <af563>   DW_AT_decl_column : 18
    <af563>   DW_AT_type        : <0xae9b5>
    <af567>   DW_AT_data_member_location: 20832
 <2><af569>: Abbrev Number: 13 (DW_TAG_member)
    <af56a>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <af56e>   DW_AT_decl_file   : 12
    <af56e>   DW_AT_decl_line   : 357
    <af570>   DW_AT_decl_column : 18
    <af570>   DW_AT_type        : <0xae9b5>
    <af574>   DW_AT_data_member_location: 20836
 <2><af576>: Abbrev Number: 13 (DW_TAG_member)
    <af577>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <af57b>   DW_AT_decl_file   : 12
    <af57b>   DW_AT_decl_line   : 358
    <af57d>   DW_AT_decl_column : 18
    <af57d>   DW_AT_type        : <0xaead6>
    <af581>   DW_AT_data_member_location: 20840
 <2><af583>: Abbrev Number: 0
 <1><af584>: Abbrev Number: 16 (DW_TAG_array_type)
    <af585>   DW_AT_type        : <0xaeeff>
    <af589>   DW_AT_sibling     : <0xaf595>
 <2><af58d>: Abbrev Number: 38 (DW_TAG_subrange_type)
    <af58e>   DW_AT_type        : <0xae9a0>
    <af592>   DW_AT_upper_bound : 256
 <2><af594>: Abbrev Number: 0
 <1><af595>: Abbrev Number: 15 (DW_TAG_typedef)
    <af596>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <af59a>   DW_AT_decl_file   : 12
    <af59b>   DW_AT_decl_line   : 359
    <af59d>   DW_AT_decl_column : 3
    <af59e>   DW_AT_type        : <0xaf504>
 <1><af5a2>: Abbrev Number: 39 (DW_TAG_variable)
    <af5a3>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <af5a7>   DW_AT_decl_file   : 12
    <af5a8>   DW_AT_decl_line   : 361
    <af5aa>   DW_AT_decl_column : 21
    <af5ab>   DW_AT_type        : <0xaf595>
    <af5af>   DW_AT_external    : 1
    <af5af>   DW_AT_declaration : 1
 <1><af5af>: Abbrev Number: 40 (DW_TAG_subprogram)
    <af5b0>   DW_AT_external    : 1
    <af5b0>   DW_AT_name        : (indirect string, offset: 0x129ce): fb_StrDelete
    <af5b4>   DW_AT_decl_file   : 6
    <af5b5>   DW_AT_decl_line   : 123
    <af5b6>   DW_AT_decl_column : 21
    <af5b7>   DW_AT_prototyped  : 1
    <af5b7>   DW_AT_declaration : 1
    <af5b7>   DW_AT_sibling     : <0xaf5c1>
 <2><af5bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af5bc>   DW_AT_type        : <0xaedef>
 <2><af5c0>: Abbrev Number: 0
 <1><af5c1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <af5c2>   DW_AT_external    : 1
    <af5c2>   DW_AT_name        : (indirect string, offset: 0x17aa9): fb_TlsGetCtx
    <af5c6>   DW_AT_decl_file   : 9
    <af5c7>   DW_AT_decl_line   : 52
    <af5c8>   DW_AT_decl_column : 26
    <af5c9>   DW_AT_prototyped  : 1
    <af5c9>   DW_AT_type        : <0xae9cf>
    <af5cd>   DW_AT_declaration : 1
    <af5cd>   DW_AT_sibling     : <0xaf5e1>
 <2><af5d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af5d2>   DW_AT_type        : <0xae9b5>
 <2><af5d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af5d7>   DW_AT_type        : <0xae9e9>
 <2><af5db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af5dc>   DW_AT_type        : <0xaef93>
 <2><af5e0>: Abbrev Number: 0
 <1><af5e1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <af5e2>   DW_AT_external    : 1
    <af5e2>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <af5e6>   DW_AT_decl_file   : 7
    <af5e7>   DW_AT_decl_line   : 50
    <af5e8>   DW_AT_decl_column : 22
    <af5e9>   DW_AT_prototyped  : 1
    <af5e9>   DW_AT_type        : <0xae9b5>
    <af5ed>   DW_AT_declaration : 1
    <af5ed>   DW_AT_sibling     : <0xaf5f7>
 <2><af5f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af5f2>   DW_AT_type        : <0xae9b5>
 <2><af5f6>: Abbrev Number: 0
 <1><af5f7>: Abbrev Number: 41 (DW_TAG_subprogram)
    <af5f8>   DW_AT_external    : 1
    <af5f8>   DW_AT_name        : (indirect string, offset: 0x1ae92): fb_INPUTCTX_Destructor
    <af5fc>   DW_AT_decl_file   : 1
    <af5fd>   DW_AT_decl_line   : 31
    <af5fe>   DW_AT_decl_column : 6
    <af5ff>   DW_AT_prototyped  : 1
    <af5ff>   DW_AT_low_pc      : 0x46fcc0
    <af607>   DW_AT_high_pc     : 0x9
    <af60f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <af611>   DW_AT_call_all_calls: 1
    <af611>   DW_AT_sibling     : <0xaf652>
 <2><af615>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <af616>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <af61a>   DW_AT_decl_file   : 1
    <af61a>   DW_AT_decl_line   : 31
    <af61b>   DW_AT_decl_column : 36
    <af61c>   DW_AT_type        : <0xae9cf>
    <af620>   DW_AT_location    : 0x37418 (location list)
    <af624>   DW_AT_GNU_locviews: 0x37412
 <2><af628>: Abbrev Number: 23 (DW_TAG_variable)
    <af629>   DW_AT_name        : ctx
    <af62d>   DW_AT_decl_file   : 1
    <af62d>   DW_AT_decl_line   : 33
    <af62e>   DW_AT_decl_column : 18
    <af62e>   DW_AT_type        : <0xaf652>
    <af632>   DW_AT_location    : 0x37433 (location list)
    <af636>   DW_AT_GNU_locviews: 0x3742d
 <2><af63a>: Abbrev Number: 24 (DW_TAG_call_site)
    <af63b>   DW_AT_call_return_pc: 0x46fcc9
    <af643>   DW_AT_call_tail_call: 1
    <af643>   DW_AT_call_origin : <0xaf5af>
 <3><af647>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af648>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af64a>   DW_AT_call_value  : 5 byte block: a3 1 55 23 10 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)); DW_OP_plus_uconst: 16)
 <3><af650>: Abbrev Number: 0
 <2><af651>: Abbrev Number: 0
 <1><af652>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <af653>   DW_AT_byte_size   : 8
    <af653>   DW_AT_type        : <0xaef4e>
 <1><af657>: Abbrev Number: 42 (DW_TAG_subprogram)
    <af658>   DW_AT_external    : 1
    <af658>   DW_AT_name        : (indirect string, offset: 0x14427): fb_FileInput
    <af65c>   DW_AT_decl_file   : 1
    <af65d>   DW_AT_decl_line   : 5
    <af65e>   DW_AT_decl_column : 12
    <af65f>   DW_AT_prototyped  : 1
    <af65f>   DW_AT_type        : <0xae9b5>
    <af663>   DW_AT_low_pc      : 0x46fcd0
    <af66b>   DW_AT_high_pc     : 0xa9
    <af673>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <af675>   DW_AT_call_all_calls: 1
 <2><af675>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <af676>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <af67a>   DW_AT_decl_file   : 1
    <af67a>   DW_AT_decl_line   : 5
    <af67b>   DW_AT_decl_column : 30
    <af67c>   DW_AT_type        : <0xae9b5>
    <af680>   DW_AT_location    : 0x37454 (location list)
    <af684>   DW_AT_GNU_locviews: 0x37448
 <2><af688>: Abbrev Number: 23 (DW_TAG_variable)
    <af689>   DW_AT_name        : ctx
    <af68d>   DW_AT_decl_file   : 1
    <af68d>   DW_AT_decl_line   : 7
    <af68e>   DW_AT_decl_column : 18
    <af68e>   DW_AT_type        : <0xaf652>
    <af692>   DW_AT_location    : 0x37482 (location list)
    <af696>   DW_AT_GNU_locviews: 0x3747e
 <2><af69a>: Abbrev Number: 43 (DW_TAG_variable)
    <af69b>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <af69f>   DW_AT_decl_file   : 1
    <af6a0>   DW_AT_decl_line   : 8
    <af6a1>   DW_AT_decl_column : 14
    <af6a2>   DW_AT_type        : <0xaef49>
    <af6a6>   DW_AT_location    : 0x3749b (location list)
    <af6aa>   DW_AT_GNU_locviews: 0x37491
 <2><af6ae>: Abbrev Number: 44 (DW_TAG_call_site)
    <af6af>   DW_AT_call_return_pc: 0x46fd1c
    <af6b7>   DW_AT_call_tail_call: 1
    <af6b7>   DW_AT_call_origin : <0xaf5e1>
    <af6bb>   DW_AT_sibling     : <0xaf6c5>
 <3><af6bf>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af6c0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af6c2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><af6c4>: Abbrev Number: 0
 <2><af6c5>: Abbrev Number: 25 (DW_TAG_call_site)
    <af6c6>   DW_AT_call_return_pc: 0x46fd44
    <af6ce>   DW_AT_call_origin : <0xaf5c1>
    <af6d2>   DW_AT_sibling     : <0xaf6ef>
 <3><af6d6>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af6d7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af6d9>   DW_AT_call_value  : 1 byte block: 32 	(DW_OP_lit2)
 <3><af6db>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af6dc>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <af6de>   DW_AT_call_value  : 2 byte block: 8 30 	(DW_OP_const1u: 48)
 <3><af6e1>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af6e2>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <af6e4>   DW_AT_call_value  : 9 byte block: 3 c0 fc 46 0 0 0 0 0 	(DW_OP_addr: 46fcc0)
 <3><af6ee>: Abbrev Number: 0
 <2><af6ef>: Abbrev Number: 25 (DW_TAG_call_site)
    <af6f0>   DW_AT_call_return_pc: 0x46fd5a
    <af6f8>   DW_AT_call_origin : <0xaf5af>
    <af6fc>   DW_AT_sibling     : <0xaf707>
 <3><af700>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af701>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af703>   DW_AT_call_value  : 2 byte block: 73 10 	(DW_OP_breg3 (rbx): 16)
 <3><af706>: Abbrev Number: 0
 <2><af707>: Abbrev Number: 24 (DW_TAG_call_site)
    <af708>   DW_AT_call_return_pc: 0x46fd6e
    <af710>   DW_AT_call_tail_call: 1
    <af710>   DW_AT_call_origin : <0xaf5e1>
 <3><af714>: Abbrev Number: 9 (DW_TAG_call_site_parameter)
    <af715>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af717>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><af719>: Abbrev Number: 0
 <2><af71a>: Abbrev Number: 0
 <1><af71b>: Abbrev Number: 0
  Compilation Unit @ offset 0xaf71c:
   Length:        0x2a8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xb860
   Pointer Size:  8
 <0><af728>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <af729>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <af72d>   DW_AT_language    : 29	(C11)
    <af72e>   DW_AT_name        : (indirect line string, offset: 0xc8e): src/rtlib/file_input_str.c
    <af732>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <af736>   DW_AT_low_pc      : 0x46fd80
    <af73e>   DW_AT_high_pc     : 0x84
    <af746>   DW_AT_stmt_list   : 0x6404b
 <1><af74a>: Abbrev Number: 2 (DW_TAG_base_type)
    <af74b>   DW_AT_byte_size   : 1
    <af74c>   DW_AT_encoding    : 8	(unsigned char)
    <af74d>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><af751>: Abbrev Number: 2 (DW_TAG_base_type)
    <af752>   DW_AT_byte_size   : 2
    <af753>   DW_AT_encoding    : 7	(unsigned)
    <af754>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><af758>: Abbrev Number: 2 (DW_TAG_base_type)
    <af759>   DW_AT_byte_size   : 4
    <af75a>   DW_AT_encoding    : 7	(unsigned)
    <af75b>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><af75f>: Abbrev Number: 2 (DW_TAG_base_type)
    <af760>   DW_AT_byte_size   : 8
    <af761>   DW_AT_encoding    : 7	(unsigned)
    <af762>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><af766>: Abbrev Number: 2 (DW_TAG_base_type)
    <af767>   DW_AT_byte_size   : 1
    <af768>   DW_AT_encoding    : 6	(signed char)
    <af769>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><af76d>: Abbrev Number: 2 (DW_TAG_base_type)
    <af76e>   DW_AT_byte_size   : 2
    <af76f>   DW_AT_encoding    : 5	(signed)
    <af770>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><af774>: Abbrev Number: 12 (DW_TAG_base_type)
    <af775>   DW_AT_byte_size   : 4
    <af776>   DW_AT_encoding    : 5	(signed)
    <af777>   DW_AT_name        : int
 <1><af77b>: Abbrev Number: 2 (DW_TAG_base_type)
    <af77c>   DW_AT_byte_size   : 8
    <af77d>   DW_AT_encoding    : 5	(signed)
    <af77e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><af782>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <af783>   DW_AT_byte_size   : 8
 <1><af784>: Abbrev Number: 6 (DW_TAG_typedef)
    <af785>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <af789>   DW_AT_decl_file   : 2
    <af78a>   DW_AT_decl_line   : 194
    <af78b>   DW_AT_decl_column : 27
    <af78c>   DW_AT_type        : <0xaf77b>
 <1><af790>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <af791>   DW_AT_byte_size   : 8
    <af791>   DW_AT_type        : <0xaf795>
 <1><af795>: Abbrev Number: 2 (DW_TAG_base_type)
    <af796>   DW_AT_byte_size   : 1
    <af797>   DW_AT_encoding    : 6	(signed char)
    <af798>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><af79c>: Abbrev Number: 2 (DW_TAG_base_type)
    <af79d>   DW_AT_byte_size   : 8
    <af79e>   DW_AT_encoding    : 5	(signed)
    <af79f>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><af7a3>: Abbrev Number: 6 (DW_TAG_typedef)
    <af7a4>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <af7a8>   DW_AT_decl_file   : 3
    <af7a9>   DW_AT_decl_line   : 108
    <af7aa>   DW_AT_decl_column : 19
    <af7ab>   DW_AT_type        : <0xaf784>
 <1><af7af>: Abbrev Number: 2 (DW_TAG_base_type)
    <af7b0>   DW_AT_byte_size   : 8
    <af7b1>   DW_AT_encoding    : 7	(unsigned)
    <af7b2>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><af7b6>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <af7b7>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <af7bb>   DW_AT_encoding    : 7	(unsigned)
    <af7bc>   DW_AT_byte_size   : 4
    <af7bd>   DW_AT_type        : <0xaf758>
    <af7c1>   DW_AT_decl_file   : 4
    <af7c2>   DW_AT_decl_line   : 1
    <af7c3>   DW_AT_decl_column : 14
    <af7c4>   DW_AT_sibling     : <0xaf83b>
 <2><af7c8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7c9>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <af7cd>   DW_AT_const_value : 0
 <2><af7ce>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7cf>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <af7d3>   DW_AT_const_value : 1
 <2><af7d4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7d5>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <af7d9>   DW_AT_const_value : 2
 <2><af7da>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7db>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <af7df>   DW_AT_const_value : 3
 <2><af7e0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7e1>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <af7e5>   DW_AT_const_value : 4
 <2><af7e6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7e7>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <af7eb>   DW_AT_const_value : 5
 <2><af7ec>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7ed>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <af7f1>   DW_AT_const_value : 6
 <2><af7f2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7f3>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <af7f7>   DW_AT_const_value : 7
 <2><af7f8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7f9>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <af7fd>   DW_AT_const_value : 8
 <2><af7fe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7ff>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <af803>   DW_AT_const_value : 9
 <2><af804>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af805>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <af809>   DW_AT_const_value : 10
 <2><af80a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af80b>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <af80f>   DW_AT_const_value : 11
 <2><af810>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af811>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <af815>   DW_AT_const_value : 12
 <2><af816>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af817>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <af81b>   DW_AT_const_value : 13
 <2><af81c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af81d>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <af821>   DW_AT_const_value : 14
 <2><af822>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af823>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <af827>   DW_AT_const_value : 15
 <2><af828>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af829>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <af82d>   DW_AT_const_value : 16
 <2><af82e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af82f>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <af833>   DW_AT_const_value : 17
 <2><af834>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af835>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <af839>   DW_AT_const_value : 18
 <2><af83a>: Abbrev Number: 0
 <1><af83b>: Abbrev Number: 2 (DW_TAG_base_type)
    <af83c>   DW_AT_byte_size   : 8
    <af83d>   DW_AT_encoding    : 4	(float)
    <af83e>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><af842>: Abbrev Number: 2 (DW_TAG_base_type)
    <af843>   DW_AT_byte_size   : 4
    <af844>   DW_AT_encoding    : 4	(float)
    <af845>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><af849>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <af84a>   DW_AT_byte_size   : 8
    <af84a>   DW_AT_type        : <0xaf774>
 <1><af84e>: Abbrev Number: 8 (DW_TAG_subprogram)
    <af84f>   DW_AT_external    : 1
    <af84f>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <af853>   DW_AT_decl_file   : 4
    <af854>   DW_AT_decl_line   : 50
    <af855>   DW_AT_decl_column : 22
    <af856>   DW_AT_prototyped  : 1
    <af856>   DW_AT_type        : <0xaf774>
    <af85a>   DW_AT_declaration : 1
    <af85a>   DW_AT_sibling     : <0xaf864>
 <2><af85e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af85f>   DW_AT_type        : <0xaf774>
 <2><af863>: Abbrev Number: 0
 <1><af864>: Abbrev Number: 8 (DW_TAG_subprogram)
    <af865>   DW_AT_external    : 1
    <af865>   DW_AT_name        : (indirect string, offset: 0x16360): fb_StrAssign
    <af869>   DW_AT_decl_file   : 5
    <af86a>   DW_AT_decl_line   : 121
    <af86b>   DW_AT_decl_column : 21
    <af86c>   DW_AT_prototyped  : 1
    <af86c>   DW_AT_type        : <0xaf782>
    <af870>   DW_AT_declaration : 1
    <af870>   DW_AT_sibling     : <0xaf88e>
 <2><af874>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af875>   DW_AT_type        : <0xaf782>
 <2><af879>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af87a>   DW_AT_type        : <0xaf7a3>
 <2><af87e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af87f>   DW_AT_type        : <0xaf782>
 <2><af883>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af884>   DW_AT_type        : <0xaf7a3>
 <2><af888>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af889>   DW_AT_type        : <0xaf774>
 <2><af88d>: Abbrev Number: 0
 <1><af88e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <af88f>   DW_AT_external    : 1
    <af88f>   DW_AT_name        : (indirect string, offset: 0x1b3fa): fb_FileInputNextToken
    <af893>   DW_AT_decl_file   : 6
    <af894>   DW_AT_decl_line   : 315
    <af896>   DW_AT_decl_column : 21
    <af897>   DW_AT_prototyped  : 1
    <af897>   DW_AT_type        : <0xaf774>
    <af89b>   DW_AT_declaration : 1
    <af89b>   DW_AT_sibling     : <0xaf8b4>
 <2><af89f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af8a0>   DW_AT_type        : <0xaf790>
 <2><af8a4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af8a5>   DW_AT_type        : <0xaf7a3>
 <2><af8a9>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af8aa>   DW_AT_type        : <0xaf774>
 <2><af8ae>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <af8af>   DW_AT_type        : <0xaf849>
 <2><af8b3>: Abbrev Number: 0
 <1><af8b4>: Abbrev Number: 16 (DW_TAG_subprogram)
    <af8b5>   DW_AT_external    : 1
    <af8b5>   DW_AT_name        : (indirect string, offset: 0x3584): fb_InputString
    <af8b9>   DW_AT_decl_file   : 1
    <af8ba>   DW_AT_decl_line   : 5
    <af8bb>   DW_AT_decl_column : 12
    <af8bc>   DW_AT_prototyped  : 1
    <af8bc>   DW_AT_type        : <0xaf774>
    <af8c0>   DW_AT_low_pc      : 0x46fd80
    <af8c8>   DW_AT_high_pc     : 0x84
    <af8d0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <af8d2>   DW_AT_call_all_calls: 1
    <af8d2>   DW_AT_sibling     : <0xaf9ad>
 <2><af8d6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <af8d7>   DW_AT_name        : dst
    <af8db>   DW_AT_decl_file   : 1
    <af8dc>   DW_AT_decl_line   : 5
    <af8dd>   DW_AT_decl_column : 34
    <af8de>   DW_AT_type        : <0xaf782>
    <af8e2>   DW_AT_location    : 0x374cf (location list)
    <af8e6>   DW_AT_GNU_locviews: 0x374c7
 <2><af8ea>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <af8eb>   DW_AT_name        : (indirect string, offset: 0x17063): strlen
    <af8ef>   DW_AT_decl_file   : 1
    <af8ef>   DW_AT_decl_line   : 5
    <af8ef>   DW_AT_decl_column : 47
    <af8f0>   DW_AT_type        : <0xaf7a3>
    <af8f4>   DW_AT_location    : 0x374f0 (location list)
    <af8f8>   DW_AT_GNU_locviews: 0x374e8
 <2><af8fc>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <af8fd>   DW_AT_name        : (indirect string, offset: 0x1a7b0): fillrem
    <af901>   DW_AT_decl_file   : 1
    <af901>   DW_AT_decl_line   : 5
    <af901>   DW_AT_decl_column : 59
    <af902>   DW_AT_type        : <0xaf774>
    <af906>   DW_AT_location    : 0x37511 (location list)
    <af90a>   DW_AT_GNU_locviews: 0x37509
 <2><af90e>: Abbrev Number: 10 (DW_TAG_variable)
    <af90f>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <af913>   DW_AT_decl_file   : 1
    <af913>   DW_AT_decl_line   : 7
    <af914>   DW_AT_decl_column : 10
    <af915>   DW_AT_type        : <0xaf9ad>
    <af919>   DW_AT_location    : 3 byte block: 91 c0 5f 	(DW_OP_fbreg: -4160)
 <2><af91d>: Abbrev Number: 10 (DW_TAG_variable)
    <af91e>   DW_AT_name        : (indirect string, offset: 0x1b410): isfp
    <af922>   DW_AT_decl_file   : 1
    <af922>   DW_AT_decl_line   : 8
    <af923>   DW_AT_decl_column : 6
    <af924>   DW_AT_type        : <0xaf774>
    <af928>   DW_AT_location    : 3 byte block: 91 bc 5f 	(DW_OP_fbreg: -4164)
 <2><af92c>: Abbrev Number: 5 (DW_TAG_call_site)
    <af92d>   DW_AT_call_return_pc: 0x46fdc4
    <af935>   DW_AT_call_origin : <0xaf88e>
    <af939>   DW_AT_sibling     : <0xaf958>
 <3><af93d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af93e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af940>   DW_AT_call_value  : 3 byte block: 91 c0 5f 	(DW_OP_fbreg: -4160)
 <3><af944>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af945>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <af947>   DW_AT_call_value  : 3 byte block: a 0 10 	(DW_OP_const2u: 4096)
 <3><af94b>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af94c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <af94e>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><af950>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af951>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <af953>   DW_AT_call_value  : 3 byte block: 91 bc 5f 	(DW_OP_fbreg: -4164)
 <3><af957>: Abbrev Number: 0
 <2><af958>: Abbrev Number: 5 (DW_TAG_call_site)
    <af959>   DW_AT_call_return_pc: 0x46fdd7
    <af961>   DW_AT_call_origin : <0xaf864>
    <af965>   DW_AT_sibling     : <0xaf988>
 <3><af969>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af96a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af96c>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><af96f>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af970>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <af972>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><af975>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af976>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <af978>   DW_AT_call_value  : 3 byte block: 91 c0 5f 	(DW_OP_fbreg: -4160)
 <3><af97c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af97d>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <af97f>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><af981>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af982>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <af984>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><af987>: Abbrev Number: 0
 <2><af988>: Abbrev Number: 5 (DW_TAG_call_site)
    <af989>   DW_AT_call_return_pc: 0x46fdde
    <af991>   DW_AT_call_origin : <0xaf84e>
    <af995>   DW_AT_sibling     : <0xaf99f>
 <3><af999>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <af99a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <af99c>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><af99e>: Abbrev Number: 0
 <2><af99f>: Abbrev Number: 18 (DW_TAG_call_site)
    <af9a0>   DW_AT_call_return_pc: 0x46fe04
    <af9a8>   DW_AT_call_origin : <0xaf9be>
 <2><af9ac>: Abbrev Number: 0
 <1><af9ad>: Abbrev Number: 19 (DW_TAG_array_type)
    <af9ae>   DW_AT_type        : <0xaf795>
    <af9b2>   DW_AT_sibling     : <0xaf9be>
 <2><af9b6>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <af9b7>   DW_AT_type        : <0xaf75f>
    <af9bb>   DW_AT_upper_bound : 4096
 <2><af9bd>: Abbrev Number: 0
 <1><af9be>: Abbrev Number: 21 (DW_TAG_subprogram)
    <af9bf>   DW_AT_external    : 1
    <af9bf>   DW_AT_declaration : 1
    <af9bf>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <af9c3>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><af9c7>: Abbrev Number: 0
  Compilation Unit @ offset 0xaf9c8:
   Length:        0xd92 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xb992
   Pointer Size:  8
 <0><af9d4>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <af9d5>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <af9d9>   DW_AT_language    : 29	(C11)
    <af9da>   DW_AT_name        : (indirect line string, offset: 0xca9): src/rtlib/file_input_tok.c
    <af9de>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <af9e2>   DW_AT_ranges      : 0x17dd8
    <af9e6>   DW_AT_low_pc      : 0x0
    <af9ee>   DW_AT_stmt_list   : 0x640e1
 <1><af9f2>: Abbrev Number: 8 (DW_TAG_base_type)
    <af9f3>   DW_AT_byte_size   : 1
    <af9f4>   DW_AT_encoding    : 8	(unsigned char)
    <af9f5>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><af9f9>: Abbrev Number: 8 (DW_TAG_base_type)
    <af9fa>   DW_AT_byte_size   : 2
    <af9fb>   DW_AT_encoding    : 7	(unsigned)
    <af9fc>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><afa00>: Abbrev Number: 8 (DW_TAG_base_type)
    <afa01>   DW_AT_byte_size   : 4
    <afa02>   DW_AT_encoding    : 7	(unsigned)
    <afa03>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><afa07>: Abbrev Number: 8 (DW_TAG_base_type)
    <afa08>   DW_AT_byte_size   : 8
    <afa09>   DW_AT_encoding    : 7	(unsigned)
    <afa0a>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><afa0e>: Abbrev Number: 8 (DW_TAG_base_type)
    <afa0f>   DW_AT_byte_size   : 1
    <afa10>   DW_AT_encoding    : 6	(signed char)
    <afa11>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><afa15>: Abbrev Number: 8 (DW_TAG_base_type)
    <afa16>   DW_AT_byte_size   : 2
    <afa17>   DW_AT_encoding    : 5	(signed)
    <afa18>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><afa1c>: Abbrev Number: 28 (DW_TAG_base_type)
    <afa1d>   DW_AT_byte_size   : 4
    <afa1e>   DW_AT_encoding    : 5	(signed)
    <afa1f>   DW_AT_name        : int
 <1><afa23>: Abbrev Number: 8 (DW_TAG_base_type)
    <afa24>   DW_AT_byte_size   : 8
    <afa25>   DW_AT_encoding    : 5	(signed)
    <afa26>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><afa2a>: Abbrev Number: 5 (DW_TAG_typedef)
