 <2><f1f8e>: Abbrev Number: 12 (DW_TAG_call_site)
    <f1f8f>   DW_AT_call_return_pc: 0x47b0d5
    <f1f97>   DW_AT_call_origin : <0xf1c44>
    <f1f9b>   DW_AT_sibling     : <0xf1fa5>
 <3><f1f9f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f1fa0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f1fa2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><f1fa4>: Abbrev Number: 0
 <2><f1fa5>: Abbrev Number: 9 (DW_TAG_call_site)
    <f1fa6>   DW_AT_call_return_pc: 0x47b195
    <f1fae>   DW_AT_call_origin : <0xf1c56>
 <2><f1fb2>: Abbrev Number: 9 (DW_TAG_call_site)
    <f1fb3>   DW_AT_call_return_pc: 0x47b216
    <f1fbb>   DW_AT_call_origin : <0xf215b>
 <2><f1fbf>: Abbrev Number: 0
 <1><f1fc0>: Abbrev Number: 53 (DW_TAG_subprogram)
    <f1fc1>   DW_AT_name        : (indirect string, offset: 0x1b8c9): mouse_update
    <f1fc5>   DW_AT_decl_file   : 1
    <f1fc6>   DW_AT_decl_line   : 36
    <f1fc7>   DW_AT_decl_column : 13
    <f1fc8>   DW_AT_prototyped  : 1
    <f1fc8>   DW_AT_inline      : 1	(inlined)
    <f1fc9>   DW_AT_sibling     : <0xf1fe9>
 <2><f1fcd>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <f1fce>   DW_AT_name        : cb
    <f1fd1>   DW_AT_decl_file   : 1
    <f1fd1>   DW_AT_decl_line   : 36
    <f1fd1>   DW_AT_decl_column : 30
    <f1fd2>   DW_AT_type        : <0xf12e8>
 <2><f1fd6>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <f1fd7>   DW_AT_name        : cx
    <f1fda>   DW_AT_decl_file   : 1
    <f1fda>   DW_AT_decl_line   : 36

 <1><f218f>: Abbrev Number: 6 (DW_TAG_base_type)
    <f2190>   DW_AT_byte_size   : 1
    <f2191>   DW_AT_encoding    : 8	(unsigned char)
    <f2192>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f2196>: Abbrev Number: 6 (DW_TAG_base_type)
    <f2197>   DW_AT_byte_size   : 2
    <f2198>   DW_AT_encoding    : 7	(unsigned)
    <f2199>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f219d>: Abbrev Number: 6 (DW_TAG_base_type)
    <f219e>   DW_AT_byte_size   : 4
    <f219f>   DW_AT_encoding    : 7	(unsigned)
    <f21a0>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f21a4>: Abbrev Number: 6 (DW_TAG_base_type)
    <f21a5>   DW_AT_byte_size   : 8
    <f21a6>   DW_AT_encoding    : 7	(unsigned)
    <f21a7>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f21ab>: Abbrev Number: 6 (DW_TAG_base_type)
    <f21ac>   DW_AT_byte_size   : 1
    <f21ad>   DW_AT_encoding    : 6	(signed char)
    <f21ae>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f21b2>: Abbrev Number: 6 (DW_TAG_base_type)
    <f21b3>   DW_AT_byte_size   : 2
    <f21b4>   DW_AT_encoding    : 5	(signed)
    <f21b5>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f21b9>: Abbrev Number: 30 (DW_TAG_base_type)
    <f21ba>   DW_AT_byte_size   : 4
    <f21bb>   DW_AT_encoding    : 5	(signed)
    <f21bc>   DW_AT_name        : int
 <1><f21c0>: Abbrev Number: 6 (DW_TAG_base_type)
    <f21c1>   DW_AT_byte_size   : 8
    <f21c2>   DW_AT_encoding    : 5	(signed)
    <f21c3>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f21c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <f21c8>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f21cc>   DW_AT_decl_file   : 3
    <f21cd>   DW_AT_decl_line   : 153
    <f21ce>   DW_AT_decl_column : 27
    <f21cf>   DW_AT_type        : <0xf21c0>
 <1><f21d3>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <f21d4>   DW_AT_byte_size   : 8
 <1><f21d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <f21d6>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <f21da>   DW_AT_decl_file   : 3
    <f21db>   DW_AT_decl_line   : 194
    <f21dc>   DW_AT_decl_column : 27
    <f21dd>   DW_AT_type        : <0xf21c0>
 <1><f21e1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f21e2>   DW_AT_byte_size   : 8
    <f21e2>   DW_AT_type        : <0xf21e6>
 <1><f21e6>: Abbrev Number: 6 (DW_TAG_base_type)
    <f21e7>   DW_AT_byte_size   : 1
    <f21e8>   DW_AT_encoding    : 6	(signed char)
    <f21e9>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f21ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <f21ee>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f21f2>   DW_AT_decl_file   : 4
    <f21f3>   DW_AT_decl_line   : 209
    <f21f4>   DW_AT_decl_column : 23
    <f21f5>   DW_AT_type        : <0xf21a4>
 <1><f21f9>: Abbrev Number: 19 (DW_TAG_typedef)
    <f21fa>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <f21fe>   DW_AT_decl_file   : 4
    <f21ff>   DW_AT_decl_line   : 321
    <f2201>   DW_AT_decl_column : 24
    <f2202>   DW_AT_type        : <0xf21b9>
 <1><f2206>: Abbrev Number: 32 (DW_TAG_const_type)
    <f2207>   DW_AT_type        : <0xf21f9>
 <1><f220b>: Abbrev Number: 6 (DW_TAG_base_type)
    <f220c>   DW_AT_byte_size   : 8
    <f220d>   DW_AT_encoding    : 5	(signed)
    <f220e>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f2212>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2213>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <f2217>   DW_AT_decl_file   : 5
    <f2218>   DW_AT_decl_line   : 87
    <f2219>   DW_AT_decl_column : 19
    <f221a>   DW_AT_type        : <0xf21c7>
 <1><f221e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f221f>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <f2223>   DW_AT_decl_file   : 5
    <f2224>   DW_AT_decl_line   : 108
    <f2225>   DW_AT_decl_column : 19
    <f2226>   DW_AT_type        : <0xf21d5>
 <1><f222a>: Abbrev Number: 6 (DW_TAG_base_type)
    <f222b>   DW_AT_byte_size   : 8
    <f222c>   DW_AT_encoding    : 7	(unsigned)
    <f222d>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f2231>: Abbrev Number: 18 (DW_TAG_array_type)
    <f2232>   DW_AT_type        : <0xf21e6>
    <f2236>   DW_AT_sibling     : <0xf2241>
 <2><f223a>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <f223b>   DW_AT_type        : <0xf21a4>
    <f223f>   DW_AT_upper_bound : 3
 <2><f2240>: Abbrev Number: 0
 <1><f2241>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2242>   DW_AT_byte_size   : 8
    <f2242>   DW_AT_type        : <0xf2246>
 <1><f2246>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><f2247>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2248>   DW_AT_byte_size   : 8
    <f2248>   DW_AT_type        : <0xf21e1>
 <1><f224c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f224d>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <f2251>   DW_AT_decl_file   : 6
    <f2252>   DW_AT_decl_line   : 22
    <f2253>   DW_AT_decl_column : 15
    <f2254>   DW_AT_type        : <0xf2212>
 <1><f2258>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2259>   DW_AT_byte_size   : 8
    <f2259>   DW_AT_type        : <0xf225d>
 <1><f225d>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <f225e>   DW_AT_prototyped  : 1
 <1><f225e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f225f>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <f2263>   DW_AT_byte_size   : 24
    <f2264>   DW_AT_decl_file   : 7
    <f2265>   DW_AT_decl_line   : 82
    <f2266>   DW_AT_decl_column : 16
    <f2267>   DW_AT_sibling     : <0xf2293>
 <2><f226b>: Abbrev Number: 2 (DW_TAG_member)
    <f226c>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <f2270>   DW_AT_decl_file   : 7
    <f2271>   DW_AT_decl_line   : 83
    <f2272>   DW_AT_decl_column : 21
    <f2273>   DW_AT_type        : <0xf21e1>
    <f2277>   DW_AT_data_member_location: 0
 <2><f2278>: Abbrev Number: 7 (DW_TAG_member)
    <f2279>   DW_AT_name        : len
    <f227d>   DW_AT_decl_file   : 7
    <f227e>   DW_AT_decl_line   : 84
    <f227f>   DW_AT_decl_column : 21
    <f2280>   DW_AT_type        : <0xf221e>
    <f2284>   DW_AT_data_member_location: 8
 <2><f2285>: Abbrev Number: 2 (DW_TAG_member)
    <f2286>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f228a>   DW_AT_decl_file   : 7
    <f228b>   DW_AT_decl_line   : 85
    <f228c>   DW_AT_decl_column : 21
    <f228d>   DW_AT_type        : <0xf221e>
    <f2291>   DW_AT_data_member_location: 16
 <2><f2292>: Abbrev Number: 0
 <1><f2293>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2294>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <f2298>   DW_AT_decl_file   : 7
    <f2299>   DW_AT_decl_line   : 86
    <f229a>   DW_AT_decl_column : 3
    <f229b>   DW_AT_type        : <0xf225e>
 <1><f229f>: Abbrev Number: 6 (DW_TAG_base_type)
    <f22a0>   DW_AT_byte_size   : 8
    <f22a1>   DW_AT_encoding    : 4	(float)
    <f22a2>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><f22a6>: Abbrev Number: 6 (DW_TAG_base_type)
    <f22a7>   DW_AT_byte_size   : 4
    <f22a8>   DW_AT_encoding    : 4	(float)
    <f22a9>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><f22ad>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f22ae>   DW_AT_byte_size   : 8
    <f22ae>   DW_AT_type        : <0xf21f9>
 <1><f22b2>: Abbrev Number: 35 (DW_TAG_enumeration_type)
    <f22b3>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <f22b7>   DW_AT_encoding    : 7	(unsigned)
    <f22b8>   DW_AT_byte_size   : 4
    <f22b9>   DW_AT_type        : <0xf219d>
    <f22bd>   DW_AT_decl_file   : 2
    <f22be>   DW_AT_decl_line   : 25
    <f22bf>   DW_AT_decl_column : 14
    <f22c0>   DW_AT_sibling     : <0xf22dd>
 <2><f22c4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f22c5>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <f22c9>   DW_AT_const_value : 0
 <2><f22ca>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f22cb>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <f22cf>   DW_AT_const_value : 1
 <2><f22d0>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f22d1>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <f22d5>   DW_AT_const_value : 2
 <2><f22d6>: Abbrev Number: 14 (DW_TAG_enumerator)
    <f22d7>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <f22db>   DW_AT_const_value : 3
 <2><f22dc>: Abbrev Number: 0
 <1><f22dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <f22de>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <f22e2>   DW_AT_decl_file   : 2
    <f22e3>   DW_AT_decl_line   : 30
    <f22e4>   DW_AT_decl_column : 3
    <f22e5>   DW_AT_type        : <0xf22b2>
 <1><f22e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <f22ea>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <f22ee>   DW_AT_decl_file   : 2
    <f22ef>   DW_AT_decl_line   : 54
    <f22f0>   DW_AT_decl_column : 15
    <f22f1>   DW_AT_type        : <0xf22f5>
 <1><f22f5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f22f6>   DW_AT_byte_size   : 8
    <f22f6>   DW_AT_type        : <0xf22fa>
 <1><f22fa>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f22fb>   DW_AT_prototyped  : 1
    <f22fb>   DW_AT_type        : <0xf21b9>
    <f22ff>   DW_AT_sibling     : <0xf230e>
 <2><f2303>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2304>   DW_AT_type        : <0xf230e>
 <2><f2308>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2309>   DW_AT_type        : <0xf21b9>
 <2><f230d>: Abbrev Number: 0
 <1><f230e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f230f>   DW_AT_byte_size   : 8
    <f230f>   DW_AT_type        : <0xf2313>
 <1><f2313>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f2314>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <f2318>   DW_AT_byte_size   : 80
    <f2319>   DW_AT_decl_file   : 2
    <f231a>   DW_AT_decl_line   : 97
    <f231b>   DW_AT_decl_column : 16
    <f231c>   DW_AT_sibling     : <0xf23d7>
 <2><f2320>: Abbrev Number: 2 (DW_TAG_member)
    <f2321>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <f2325>   DW_AT_decl_file   : 2
    <f2326>   DW_AT_decl_line   : 98
    <f2327>   DW_AT_decl_column : 21
    <f2328>   DW_AT_type        : <0xf21b9>
    <f232c>   DW_AT_data_member_location: 0
 <2><f232d>: Abbrev Number: 7 (DW_TAG_member)
    <f232e>   DW_AT_name        : len
    <f2332>   DW_AT_decl_file   : 2
    <f2333>   DW_AT_decl_line   : 99
    <f2334>   DW_AT_decl_column : 21
    <f2335>   DW_AT_type        : <0xf21b9>
    <f2339>   DW_AT_data_member_location: 4
 <2><f233a>: Abbrev Number: 2 (DW_TAG_member)
    <f233b>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <f233f>   DW_AT_decl_file   : 2
    <f2340>   DW_AT_decl_line   : 100
    <f2341>   DW_AT_decl_column : 21
    <f2342>   DW_AT_type        : <0xf22dd>
    <f2346>   DW_AT_data_member_location: 8
 <2><f2347>: Abbrev Number: 2 (DW_TAG_member)
    <f2348>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <f234c>   DW_AT_decl_file   : 2
    <f234d>   DW_AT_decl_line   : 101
    <f234e>   DW_AT_decl_column : 21
    <f234f>   DW_AT_type        : <0xf224c>
    <f2353>   DW_AT_data_member_location: 16
 <2><f2354>: Abbrev Number: 2 (DW_TAG_member)
    <f2355>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f2359>   DW_AT_decl_file   : 2
    <f235a>   DW_AT_decl_line   : 102
    <f235b>   DW_AT_decl_column : 21
    <f235c>   DW_AT_type        : <0xf21b9>
    <f2360>   DW_AT_data_member_location: 24
 <2><f2361>: Abbrev Number: 2 (DW_TAG_member)
    <f2362>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <f2366>   DW_AT_decl_file   : 2
    <f2367>   DW_AT_decl_line   : 103
    <f2368>   DW_AT_decl_column : 21
    <f2369>   DW_AT_type        : <0xf21b9>
    <f236d>   DW_AT_data_member_location: 28
 <2><f236e>: Abbrev Number: 2 (DW_TAG_member)
    <f236f>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <f2373>   DW_AT_decl_file   : 2
    <f2374>   DW_AT_decl_line   : 104
    <f2375>   DW_AT_decl_column : 21
    <f2376>   DW_AT_type        : <0xf21b9>
    <f237a>   DW_AT_data_member_location: 32
 <2><f237b>: Abbrev Number: 2 (DW_TAG_member)
    <f237c>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <f2380>   DW_AT_decl_file   : 2
    <f2381>   DW_AT_decl_line   : 105
    <f2382>   DW_AT_decl_column : 21
    <f2383>   DW_AT_type        : <0xf219d>
    <f2387>   DW_AT_data_member_location: 36
 <2><f2388>: Abbrev Number: 2 (DW_TAG_member)
    <f2389>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <f238d>   DW_AT_decl_file   : 2
    <f238e>   DW_AT_decl_line   : 106
    <f238f>   DW_AT_decl_column : 21
    <f2390>   DW_AT_type        : <0xf219d>
    <f2394>   DW_AT_data_member_location: 40
 <2><f2395>: Abbrev Number: 2 (DW_TAG_member)
    <f2396>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <f239a>   DW_AT_decl_file   : 2
    <f239b>   DW_AT_decl_line   : 109
    <f239c>   DW_AT_decl_column : 21
    <f239d>   DW_AT_type        : <0xf2231>
    <f23a1>   DW_AT_data_member_location: 44
 <2><f23a2>: Abbrev Number: 2 (DW_TAG_member)
    <f23a3>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <f23a7>   DW_AT_decl_file   : 2
    <f23a8>   DW_AT_decl_line   : 110
    <f23a9>   DW_AT_decl_column : 21
    <f23aa>   DW_AT_type        : <0xf21ed>
    <f23ae>   DW_AT_data_member_location: 48
 <2><f23af>: Abbrev Number: 2 (DW_TAG_member)
    <f23b0>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f23b4>   DW_AT_decl_file   : 2
    <f23b5>   DW_AT_decl_line   : 112
    <f23b6>   DW_AT_decl_column : 22
    <f23b7>   DW_AT_type        : <0xf266f>
    <f23bb>   DW_AT_data_member_location: 56
 <2><f23bc>: Abbrev Number: 2 (DW_TAG_member)
    <f23bd>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <f23c1>   DW_AT_decl_file   : 2
    <f23c2>   DW_AT_decl_line   : 114
    <f23c3>   DW_AT_decl_column : 14
    <f23c4>   DW_AT_type        : <0xf21d3>
    <f23c8>   DW_AT_data_member_location: 64
 <2><f23c9>: Abbrev Number: 2 (DW_TAG_member)
    <f23ca>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <f23ce>   DW_AT_decl_file   : 2
    <f23cf>   DW_AT_decl_line   : 116
    <f23d0>   DW_AT_decl_column : 22
    <f23d1>   DW_AT_type        : <0xf230e>
    <f23d5>   DW_AT_data_member_location: 72
 <2><f23d6>: Abbrev Number: 0
 <1><f23d7>: Abbrev Number: 3 (DW_TAG_typedef)
    <f23d8>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <f23dc>   DW_AT_decl_file   : 2
    <f23dd>   DW_AT_decl_line   : 59
    <f23de>   DW_AT_decl_column : 15
    <f23df>   DW_AT_type        : <0xf23e3>
 <1><f23e3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f23e4>   DW_AT_byte_size   : 8
    <f23e4>   DW_AT_type        : <0xf23e8>
 <1><f23e8>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f23e9>   DW_AT_prototyped  : 1
    <f23e9>   DW_AT_type        : <0xf21b9>
    <f23ed>   DW_AT_sibling     : <0xf23f7>
 <2><f23f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f23f2>   DW_AT_type        : <0xf230e>
 <2><f23f6>: Abbrev Number: 0
 <1><f23f7>: Abbrev Number: 3 (DW_TAG_typedef)
    <f23f8>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <f23fc>   DW_AT_decl_file   : 2
    <f23fd>   DW_AT_decl_line   : 60
    <f23fe>   DW_AT_decl_column : 15
    <f23ff>   DW_AT_type        : <0xf23e3>
 <1><f2403>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2404>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <f2408>   DW_AT_decl_file   : 2
    <f2409>   DW_AT_decl_line   : 61
    <f240a>   DW_AT_decl_column : 15
    <f240b>   DW_AT_type        : <0xf240f>
 <1><f240f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2410>   DW_AT_byte_size   : 8
    <f2410>   DW_AT_type        : <0xf2414>
 <1><f2414>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2415>   DW_AT_prototyped  : 1
    <f2415>   DW_AT_type        : <0xf21b9>
    <f2419>   DW_AT_sibling     : <0xf242d>
 <2><f241d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f241e>   DW_AT_type        : <0xf230e>
 <2><f2422>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2423>   DW_AT_type        : <0xf224c>
 <2><f2427>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2428>   DW_AT_type        : <0xf21b9>
 <2><f242c>: Abbrev Number: 0
 <1><f242d>: Abbrev Number: 3 (DW_TAG_typedef)
    <f242e>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <f2432>   DW_AT_decl_file   : 2
    <f2433>   DW_AT_decl_line   : 62
    <f2434>   DW_AT_decl_column : 15
    <f2435>   DW_AT_type        : <0xf2439>
 <1><f2439>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f243a>   DW_AT_byte_size   : 8
    <f243a>   DW_AT_type        : <0xf243e>
 <1><f243e>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f243f>   DW_AT_prototyped  : 1
    <f243f>   DW_AT_type        : <0xf21b9>
    <f2443>   DW_AT_sibling     : <0xf2452>
 <2><f2447>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2448>   DW_AT_type        : <0xf230e>
 <2><f244c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f244d>   DW_AT_type        : <0xf2452>
 <2><f2451>: Abbrev Number: 0
 <1><f2452>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2453>   DW_AT_byte_size   : 8
    <f2453>   DW_AT_type        : <0xf224c>
 <1><f2457>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2458>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <f245c>   DW_AT_decl_file   : 2
    <f245d>   DW_AT_decl_line   : 63
    <f245e>   DW_AT_decl_column : 15
    <f245f>   DW_AT_type        : <0xf2463>
 <1><f2463>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2464>   DW_AT_byte_size   : 8
    <f2464>   DW_AT_type        : <0xf2468>
 <1><f2468>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2469>   DW_AT_prototyped  : 1
    <f2469>   DW_AT_type        : <0xf21b9>
    <f246d>   DW_AT_sibling     : <0xf2481>
 <2><f2471>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2472>   DW_AT_type        : <0xf230e>
 <2><f2476>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2477>   DW_AT_type        : <0xf21d3>
 <2><f247b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f247c>   DW_AT_type        : <0xf2481>
 <2><f2480>: Abbrev Number: 0
 <1><f2481>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2482>   DW_AT_byte_size   : 8
    <f2482>   DW_AT_type        : <0xf21ed>
 <1><f2486>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2487>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <f248b>   DW_AT_decl_file   : 2
    <f248c>   DW_AT_decl_line   : 65
    <f248d>   DW_AT_decl_column : 15
    <f248e>   DW_AT_type        : <0xf2492>
 <1><f2492>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2493>   DW_AT_byte_size   : 8
    <f2493>   DW_AT_type        : <0xf2497>
 <1><f2497>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2498>   DW_AT_prototyped  : 1
    <f2498>   DW_AT_type        : <0xf21b9>
    <f249c>   DW_AT_sibling     : <0xf24b0>
 <2><f24a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24a1>   DW_AT_type        : <0xf230e>
 <2><f24a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24a6>   DW_AT_type        : <0xf22ad>
 <2><f24aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24ab>   DW_AT_type        : <0xf2481>
 <2><f24af>: Abbrev Number: 0
 <1><f24b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <f24b1>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <f24b5>   DW_AT_decl_file   : 2
    <f24b6>   DW_AT_decl_line   : 67
    <f24b7>   DW_AT_decl_column : 15
    <f24b8>   DW_AT_type        : <0xf24bc>
 <1><f24bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f24bd>   DW_AT_byte_size   : 8
    <f24bd>   DW_AT_type        : <0xf24c1>
 <1><f24c1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f24c2>   DW_AT_prototyped  : 1
    <f24c2>   DW_AT_type        : <0xf21b9>
    <f24c6>   DW_AT_sibling     : <0xf24da>
 <2><f24ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24cb>   DW_AT_type        : <0xf230e>
 <2><f24cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24d0>   DW_AT_type        : <0xf2241>
 <2><f24d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24d5>   DW_AT_type        : <0xf21ed>
 <2><f24d9>: Abbrev Number: 0
 <1><f24da>: Abbrev Number: 3 (DW_TAG_typedef)
    <f24db>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <f24df>   DW_AT_decl_file   : 2
    <f24e0>   DW_AT_decl_line   : 69
    <f24e1>   DW_AT_decl_column : 15
    <f24e2>   DW_AT_type        : <0xf24e6>
 <1><f24e6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f24e7>   DW_AT_byte_size   : 8
    <f24e7>   DW_AT_type        : <0xf24eb>
 <1><f24eb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f24ec>   DW_AT_prototyped  : 1
    <f24ec>   DW_AT_type        : <0xf21b9>
    <f24f0>   DW_AT_sibling     : <0xf2504>
 <2><f24f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24f5>   DW_AT_type        : <0xf230e>
 <2><f24f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24fa>   DW_AT_type        : <0xf2504>
 <2><f24fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f24ff>   DW_AT_type        : <0xf21ed>
 <2><f2503>: Abbrev Number: 0
 <1><f2504>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2505>   DW_AT_byte_size   : 8
    <f2505>   DW_AT_type        : <0xf2206>
 <1><f2509>: Abbrev Number: 3 (DW_TAG_typedef)
    <f250a>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <f250e>   DW_AT_decl_file   : 2
    <f250f>   DW_AT_decl_line   : 71
    <f2510>   DW_AT_decl_column : 15
    <f2511>   DW_AT_type        : <0xf2515>
 <1><f2515>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2516>   DW_AT_byte_size   : 8
    <f2516>   DW_AT_type        : <0xf251a>
 <1><f251a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f251b>   DW_AT_prototyped  : 1
    <f251b>   DW_AT_type        : <0xf21b9>
    <f251f>   DW_AT_sibling     : <0xf2533>
 <2><f2523>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2524>   DW_AT_type        : <0xf230e>
 <2><f2528>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2529>   DW_AT_type        : <0xf224c>
 <2><f252d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f252e>   DW_AT_type        : <0xf224c>
 <2><f2532>: Abbrev Number: 0
 <1><f2533>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2534>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <f2538>   DW_AT_decl_file   : 2
    <f2539>   DW_AT_decl_line   : 73
    <f253a>   DW_AT_decl_column : 15
    <f253b>   DW_AT_type        : <0xf2515>
 <1><f253f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2540>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <f2544>   DW_AT_decl_file   : 2
    <f2545>   DW_AT_decl_line   : 75
    <f2546>   DW_AT_decl_column : 15
    <f2547>   DW_AT_type        : <0xf254b>
 <1><f254b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f254c>   DW_AT_byte_size   : 8
    <f254c>   DW_AT_type        : <0xf2550>
 <1><f2550>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2551>   DW_AT_prototyped  : 1
    <f2551>   DW_AT_type        : <0xf21b9>
    <f2555>   DW_AT_sibling     : <0xf2564>
 <2><f2559>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f255a>   DW_AT_type        : <0xf230e>
 <2><f255e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f255f>   DW_AT_type        : <0xf2564>
 <2><f2563>: Abbrev Number: 0
 <1><f2564>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2565>   DW_AT_byte_size   : 8
    <f2565>   DW_AT_type        : <0xf2293>
 <1><f2569>: Abbrev Number: 3 (DW_TAG_typedef)
    <f256a>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <f256e>   DW_AT_decl_file   : 2
    <f256f>   DW_AT_decl_line   : 76
    <f2570>   DW_AT_decl_column : 15
    <f2571>   DW_AT_type        : <0xf2575>
 <1><f2575>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2576>   DW_AT_byte_size   : 8
    <f2576>   DW_AT_type        : <0xf257a>
 <1><f257a>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f257b>   DW_AT_prototyped  : 1
    <f257b>   DW_AT_type        : <0xf21b9>
    <f257f>   DW_AT_sibling     : <0xf2593>
 <2><f2583>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2584>   DW_AT_type        : <0xf230e>
 <2><f2588>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2589>   DW_AT_type        : <0xf22ad>
 <2><f258d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f258e>   DW_AT_type        : <0xf221e>
 <2><f2592>: Abbrev Number: 0
 <1><f2593>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2594>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <f2598>   DW_AT_decl_file   : 2
    <f2599>   DW_AT_decl_line   : 77
    <f259a>   DW_AT_decl_column : 15
    <f259b>   DW_AT_type        : <0xf23e3>
 <1><f259f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f25a0>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <f25a4>   DW_AT_byte_size   : 112
    <f25a5>   DW_AT_decl_file   : 2
    <f25a6>   DW_AT_decl_line   : 80
    <f25a7>   DW_AT_decl_column : 16
    <f25a8>   DW_AT_sibling     : <0xf2663>
 <2><f25ac>: Abbrev Number: 2 (DW_TAG_member)
    <f25ad>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <f25b1>   DW_AT_decl_file   : 2
    <f25b2>   DW_AT_decl_line   : 81
    <f25b3>   DW_AT_decl_column : 25
    <f25b4>   DW_AT_type        : <0xf23d7>
    <f25b8>   DW_AT_data_member_location: 0
 <2><f25b9>: Abbrev Number: 2 (DW_TAG_member)
    <f25ba>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <f25be>   DW_AT_decl_file   : 2
    <f25bf>   DW_AT_decl_line   : 82
    <f25c0>   DW_AT_decl_column : 25
    <f25c1>   DW_AT_type        : <0xf23f7>
    <f25c5>   DW_AT_data_member_location: 8
 <2><f25c6>: Abbrev Number: 2 (DW_TAG_member)
    <f25c7>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <f25cb>   DW_AT_decl_file   : 2
    <f25cc>   DW_AT_decl_line   : 83
    <f25cd>   DW_AT_decl_column : 25
    <f25ce>   DW_AT_type        : <0xf2403>
    <f25d2>   DW_AT_data_member_location: 16
 <2><f25d3>: Abbrev Number: 2 (DW_TAG_member)
    <f25d4>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <f25d8>   DW_AT_decl_file   : 2
    <f25d9>   DW_AT_decl_line   : 84
    <f25da>   DW_AT_decl_column : 25
    <f25db>   DW_AT_type        : <0xf242d>
    <f25df>   DW_AT_data_member_location: 24
 <2><f25e0>: Abbrev Number: 2 (DW_TAG_member)
    <f25e1>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <f25e5>   DW_AT_decl_file   : 2
    <f25e6>   DW_AT_decl_line   : 85
    <f25e7>   DW_AT_decl_column : 25
    <f25e8>   DW_AT_type        : <0xf2457>
    <f25ec>   DW_AT_data_member_location: 32
 <2><f25ed>: Abbrev Number: 2 (DW_TAG_member)
    <f25ee>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <f25f2>   DW_AT_decl_file   : 2
    <f25f3>   DW_AT_decl_line   : 86
    <f25f4>   DW_AT_decl_column : 25
    <f25f5>   DW_AT_type        : <0xf2486>
    <f25f9>   DW_AT_data_member_location: 40
 <2><f25fa>: Abbrev Number: 2 (DW_TAG_member)
    <f25fb>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <f25ff>   DW_AT_decl_file   : 2
    <f2600>   DW_AT_decl_line   : 87
    <f2601>   DW_AT_decl_column : 25
    <f2602>   DW_AT_type        : <0xf24b0>
    <f2606>   DW_AT_data_member_location: 48
 <2><f2607>: Abbrev Number: 2 (DW_TAG_member)
    <f2608>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <f260c>   DW_AT_decl_file   : 2
    <f260d>   DW_AT_decl_line   : 88
    <f260e>   DW_AT_decl_column : 25
    <f260f>   DW_AT_type        : <0xf24da>
    <f2613>   DW_AT_data_member_location: 56
 <2><f2614>: Abbrev Number: 2 (DW_TAG_member)
    <f2615>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <f2619>   DW_AT_decl_file   : 2
    <f261a>   DW_AT_decl_line   : 89
    <f261b>   DW_AT_decl_column : 25
    <f261c>   DW_AT_type        : <0xf2509>
    <f2620>   DW_AT_data_member_location: 64
 <2><f2621>: Abbrev Number: 2 (DW_TAG_member)
    <f2622>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <f2626>   DW_AT_decl_file   : 2
    <f2627>   DW_AT_decl_line   : 90
    <f2628>   DW_AT_decl_column : 25
    <f2629>   DW_AT_type        : <0xf2533>
    <f262d>   DW_AT_data_member_location: 72
 <2><f262e>: Abbrev Number: 2 (DW_TAG_member)
    <f262f>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <f2633>   DW_AT_decl_file   : 2
    <f2634>   DW_AT_decl_line   : 91
    <f2635>   DW_AT_decl_column : 25
    <f2636>   DW_AT_type        : <0xf253f>
    <f263a>   DW_AT_data_member_location: 80
 <2><f263b>: Abbrev Number: 2 (DW_TAG_member)
    <f263c>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <f2640>   DW_AT_decl_file   : 2
    <f2641>   DW_AT_decl_line   : 92
    <f2642>   DW_AT_decl_column : 25
    <f2643>   DW_AT_type        : <0xf2569>
    <f2647>   DW_AT_data_member_location: 88
 <2><f2648>: Abbrev Number: 2 (DW_TAG_member)
    <f2649>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <f264d>   DW_AT_decl_file   : 2
    <f264e>   DW_AT_decl_line   : 93
    <f264f>   DW_AT_decl_column : 25
    <f2650>   DW_AT_type        : <0xf22e9>
    <f2654>   DW_AT_data_member_location: 96
 <2><f2655>: Abbrev Number: 2 (DW_TAG_member)
    <f2656>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <f265a>   DW_AT_decl_file   : 2
    <f265b>   DW_AT_decl_line   : 94
    <f265c>   DW_AT_decl_column : 25
    <f265d>   DW_AT_type        : <0xf2593>
    <f2661>   DW_AT_data_member_location: 104
 <2><f2662>: Abbrev Number: 0
 <1><f2663>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2664>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <f2668>   DW_AT_decl_file   : 2
    <f2669>   DW_AT_decl_line   : 95
    <f266a>   DW_AT_decl_column : 3
    <f266b>   DW_AT_type        : <0xf259f>
 <1><f266f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2670>   DW_AT_byte_size   : 8
    <f2670>   DW_AT_type        : <0xf2663>
 <1><f2674>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2675>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <f2679>   DW_AT_decl_file   : 2
    <f267a>   DW_AT_decl_line   : 117
    <f267b>   DW_AT_decl_column : 3
    <f267c>   DW_AT_type        : <0xf2313>
 <1><f2680>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2681>   DW_AT_byte_size   : 8
    <f2681>   DW_AT_type        : <0xf2674>
 <1><f2685>: Abbrev Number: 21 (DW_TAG_structure_type)
    <f2686>   DW_AT_byte_size   : 8
    <f2687>   DW_AT_decl_file   : 8
    <f2687>   DW_AT_decl_line   : 4
    <f2688>   DW_AT_decl_column : 3
    <f2688>   DW_AT_sibling     : <0xf26a7>
 <2><f268c>: Abbrev Number: 2 (DW_TAG_member)
    <f268d>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <f2691>   DW_AT_decl_file   : 8
    <f2692>   DW_AT_decl_line   : 5
    <f2693>   DW_AT_decl_column : 8
    <f2694>   DW_AT_type        : <0xf21b9>
    <f2698>   DW_AT_data_member_location: 0
 <2><f2699>: Abbrev Number: 2 (DW_TAG_member)
    <f269a>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <f269e>   DW_AT_decl_file   : 8
    <f269f>   DW_AT_decl_line   : 6
    <f26a0>   DW_AT_decl_column : 8
    <f26a1>   DW_AT_type        : <0xf21b9>
    <f26a5>   DW_AT_data_member_location: 4
 <2><f26a6>: Abbrev Number: 0
 <1><f26a7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <f26a8>   DW_AT_byte_size   : 16
    <f26a9>   DW_AT_decl_file   : 8
    <f26a9>   DW_AT_decl_line   : 8
    <f26aa>   DW_AT_decl_column : 3
    <f26aa>   DW_AT_sibling     : <0xf26dd>
 <2><f26ae>: Abbrev Number: 7 (DW_TAG_member)
    <f26af>   DW_AT_name        : x
    <f26b1>   DW_AT_decl_file   : 8
    <f26b2>   DW_AT_decl_line   : 9
    <f26b3>   DW_AT_decl_column : 8
    <f26b4>   DW_AT_type        : <0xf21b9>
    <f26b8>   DW_AT_data_member_location: 0
 <2><f26b9>: Abbrev Number: 7 (DW_TAG_member)
    <f26ba>   DW_AT_name        : y
    <f26bc>   DW_AT_decl_file   : 8
    <f26bd>   DW_AT_decl_line   : 9
    <f26be>   DW_AT_decl_column : 11
    <f26bf>   DW_AT_type        : <0xf21b9>
    <f26c3>   DW_AT_data_member_location: 4
 <2><f26c4>: Abbrev Number: 7 (DW_TAG_member)
    <f26c5>   DW_AT_name        : dx
    <f26c8>   DW_AT_decl_file   : 8
    <f26c9>   DW_AT_decl_line   : 10
    <f26ca>   DW_AT_decl_column : 8
    <f26cb>   DW_AT_type        : <0xf21b9>
    <f26cf>   DW_AT_data_member_location: 8
 <2><f26d0>: Abbrev Number: 7 (DW_TAG_member)
    <f26d1>   DW_AT_name        : dy
    <f26d4>   DW_AT_decl_file   : 8
    <f26d5>   DW_AT_decl_line   : 10
    <f26d6>   DW_AT_decl_column : 12
    <f26d7>   DW_AT_type        : <0xf21b9>
    <f26db>   DW_AT_data_member_location: 12
 <2><f26dc>: Abbrev Number: 0
 <1><f26dd>: Abbrev Number: 36 (DW_TAG_union_type)
    <f26de>   DW_AT_byte_size   : 16
    <f26df>   DW_AT_decl_file   : 8
    <f26e0>   DW_AT_decl_line   : 3
    <f26e1>   DW_AT_decl_column : 2
    <f26e2>   DW_AT_sibling     : <0xf270d>
 <2><f26e6>: Abbrev Number: 22 (DW_TAG_member)
    <f26e7>   DW_AT_type        : <0xf2685>
 <2><f26eb>: Abbrev Number: 22 (DW_TAG_member)
    <f26ec>   DW_AT_type        : <0xf26a7>
 <2><f26f0>: Abbrev Number: 37 (DW_TAG_member)
    <f26f1>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <f26f5>   DW_AT_decl_file   : 8
    <f26f6>   DW_AT_decl_line   : 12
    <f26f7>   DW_AT_decl_column : 7
    <f26f8>   DW_AT_type        : <0xf21b9>
 <2><f26fc>: Abbrev Number: 23 (DW_TAG_member)
    <f26fd>   DW_AT_name        : z
    <f26ff>   DW_AT_decl_file   : 8
    <f26ff>   DW_AT_decl_line   : 13
    <f2700>   DW_AT_decl_column : 7
    <f2700>   DW_AT_type        : <0xf21b9>
 <2><f2704>: Abbrev Number: 23 (DW_TAG_member)
    <f2705>   DW_AT_name        : w
    <f2707>   DW_AT_decl_file   : 8
    <f2707>   DW_AT_decl_line   : 14
    <f2708>   DW_AT_decl_column : 7
    <f2708>   DW_AT_type        : <0xf21b9>
 <2><f270c>: Abbrev Number: 0
 <1><f270d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f270e>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <f2712>   DW_AT_byte_size   : 20
    <f2713>   DW_AT_decl_file   : 8
    <f2714>   DW_AT_decl_line   : 1
    <f2715>   DW_AT_decl_column : 8
    <f2716>   DW_AT_sibling     : <0xf272e>
 <2><f271a>: Abbrev Number: 2 (DW_TAG_member)
    <f271b>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <f271f>   DW_AT_decl_file   : 8
    <f2720>   DW_AT_decl_line   : 2
    <f2721>   DW_AT_decl_column : 6
    <f2722>   DW_AT_type        : <0xf21b9>
    <f2726>   DW_AT_data_member_location: 0
 <2><f2727>: Abbrev Number: 38 (DW_TAG_member)
    <f2728>   DW_AT_type        : <0xf26dd>
    <f272c>   DW_AT_data_member_location: 4
 <2><f272d>: Abbrev Number: 0
 <1><f272e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f272f>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <f2733>   DW_AT_decl_file   : 8
    <f2734>   DW_AT_decl_line   : 18
    <f2735>   DW_AT_decl_column : 23
    <f2736>   DW_AT_type        : <0xf270d>
 <1><f273a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f273b>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <f273f>   DW_AT_decl_file   : 9
    <f2740>   DW_AT_decl_line   : 1
    <f2741>   DW_AT_decl_column : 23
    <f2742>   DW_AT_type        : <0xf2746>
 <1><f2746>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2747>   DW_AT_byte_size   : 8
    <f2747>   DW_AT_type        : <0xf274b>
 <1><f274b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <f274c>   DW_AT_prototyped  : 1
    <f274c>   DW_AT_type        : <0xf2564>
 <1><f2750>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2751>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <f2755>   DW_AT_decl_file   : 9
    <f2756>   DW_AT_decl_line   : 2
    <f2757>   DW_AT_decl_column : 23
    <f2758>   DW_AT_type        : <0xf275c>
 <1><f275c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f275d>   DW_AT_byte_size   : 8
    <f275d>   DW_AT_type        : <0xf2761>
 <1><f2761>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <f2762>   DW_AT_prototyped  : 1
    <f2762>   DW_AT_type        : <0xf21b9>
 <1><f2766>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2767>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <f276b>   DW_AT_decl_file   : 9
    <f276c>   DW_AT_decl_line   : 3
    <f276d>   DW_AT_decl_column : 23
    <f276e>   DW_AT_type        : <0xf275c>
 <1><f2772>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2773>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <f2777>   DW_AT_decl_file   : 9
    <f2778>   DW_AT_decl_line   : 10
    <f2779>   DW_AT_decl_column : 23
    <f277a>   DW_AT_type        : <0xf277e>
 <1><f277e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f277f>   DW_AT_byte_size   : 8
    <f277f>   DW_AT_type        : <0xf2783>
 <1><f2783>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f2784>   DW_AT_prototyped  : 1
    <f2784>   DW_AT_sibling     : <0xf278e>
 <2><f2788>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2789>   DW_AT_type        : <0xf21b9>
 <2><f278d>: Abbrev Number: 0
 <1><f278e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f278f>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <f2793>   DW_AT_decl_file   : 9
    <f2794>   DW_AT_decl_line   : 14
    <f2795>   DW_AT_decl_column : 23
    <f2796>   DW_AT_type        : <0xf279a>
 <1><f279a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f279b>   DW_AT_byte_size   : 8
    <f279b>   DW_AT_type        : <0xf279f>
 <1><f279f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f27a0>   DW_AT_prototyped  : 1
    <f27a0>   DW_AT_type        : <0xf21b9>
    <f27a4>   DW_AT_sibling     : <0xf27b8>
 <2><f27a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f27a9>   DW_AT_type        : <0xf21b9>
 <2><f27ad>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f27ae>   DW_AT_type        : <0xf21b9>
 <2><f27b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f27b3>   DW_AT_type        : <0xf21b9>
 <2><f27b7>: Abbrev Number: 0
 <1><f27b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <f27b9>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <f27bd>   DW_AT_decl_file   : 9
    <f27be>   DW_AT_decl_line   : 18
    <f27bf>   DW_AT_decl_column : 23
    <f27c0>   DW_AT_type        : <0xf279a>
 <1><f27c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <f27c5>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <f27c9>   DW_AT_decl_file   : 9
    <f27ca>   DW_AT_decl_line   : 24
    <f27cb>   DW_AT_decl_column : 23
    <f27cc>   DW_AT_type        : <0xf2258>
 <1><f27d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <f27d1>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <f27d5>   DW_AT_decl_file   : 9
    <f27d6>   DW_AT_decl_line   : 28
    <f27d7>   DW_AT_decl_column : 23
    <f27d8>   DW_AT_type        : <0xf27dc>
 <1><f27dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f27dd>   DW_AT_byte_size   : 8
    <f27dd>   DW_AT_type        : <0xf27e1>
 <1><f27e1>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f27e2>   DW_AT_prototyped  : 1
    <f27e2>   DW_AT_type        : <0xf21b9>
    <f27e6>   DW_AT_sibling     : <0xf27f5>
 <2><f27ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f27eb>   DW_AT_type        : <0xf21b9>
 <2><f27ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f27f0>   DW_AT_type        : <0xf21b9>
 <2><f27f4>: Abbrev Number: 0
 <1><f27f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <f27f6>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <f27fa>   DW_AT_decl_file   : 9
    <f27fb>   DW_AT_decl_line   : 34
    <f27fc>   DW_AT_decl_column : 23
    <f27fd>   DW_AT_type        : <0xf275c>
 <1><f2801>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2802>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <f2806>   DW_AT_decl_file   : 9
    <f2807>   DW_AT_decl_line   : 35
    <f2808>   DW_AT_decl_column : 23
    <f2809>   DW_AT_type        : <0xf275c>
 <1><f280d>: Abbrev Number: 3 (DW_TAG_typedef)
    <f280e>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <f2812>   DW_AT_decl_file   : 9
    <f2813>   DW_AT_decl_line   : 36
    <f2814>   DW_AT_decl_column : 23
    <f2815>   DW_AT_type        : <0xf2819>
 <1><f2819>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f281a>   DW_AT_byte_size   : 8
    <f281a>   DW_AT_type        : <0xf281e>
 <1><f281e>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f281f>   DW_AT_prototyped  : 1
    <f281f>   DW_AT_sibling     : <0xf282e>
 <2><f2823>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2824>   DW_AT_type        : <0xf282e>
 <2><f2828>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2829>   DW_AT_type        : <0xf282e>
 <2><f282d>: Abbrev Number: 0
 <1><f282e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f282f>   DW_AT_byte_size   : 8
    <f282f>   DW_AT_type        : <0xf21b9>
 <1><f2833>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2834>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <f2838>   DW_AT_decl_file   : 9
    <f2839>   DW_AT_decl_line   : 37
    <f283a>   DW_AT_decl_column : 23
    <f283b>   DW_AT_type        : <0xf2819>
 <1><f283f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2840>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <f2844>   DW_AT_decl_file   : 9
    <f2845>   DW_AT_decl_line   : 45
    <f2846>   DW_AT_decl_column : 24
    <f2847>   DW_AT_type        : <0xf284b>
 <1><f284b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f284c>   DW_AT_byte_size   : 8
    <f284c>   DW_AT_type        : <0xf2850>
 <1><f2850>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2851>   DW_AT_prototyped  : 1
    <f2851>   DW_AT_type        : <0xf219d>
    <f2855>   DW_AT_sibling     : <0xf2869>
 <2><f2859>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f285a>   DW_AT_type        : <0xf21b9>
 <2><f285e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f285f>   DW_AT_type        : <0xf21b9>
 <2><f2863>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2864>   DW_AT_type        : <0xf21b9>
 <2><f2868>: Abbrev Number: 0
 <1><f2869>: Abbrev Number: 3 (DW_TAG_typedef)
    <f286a>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <f286e>   DW_AT_decl_file   : 9
    <f286f>   DW_AT_decl_line   : 48
    <f2870>   DW_AT_decl_column : 23
    <f2871>   DW_AT_type        : <0xf2875>
 <1><f2875>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2876>   DW_AT_byte_size   : 8
    <f2876>   DW_AT_type        : <0xf287a>
 <1><f287a>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f287b>   DW_AT_prototyped  : 1
    <f287b>   DW_AT_sibling     : <0xf288f>
 <2><f287f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2880>   DW_AT_type        : <0xf2241>
 <2><f2884>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2885>   DW_AT_type        : <0xf21ed>
 <2><f2889>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f288a>   DW_AT_type        : <0xf21b9>
 <2><f288e>: Abbrev Number: 0
 <1><f288f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2890>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <f2894>   DW_AT_decl_file   : 9
    <f2895>   DW_AT_decl_line   : 49
    <f2896>   DW_AT_decl_column : 23
    <f2897>   DW_AT_type        : <0xf289b>
 <1><f289b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f289c>   DW_AT_byte_size   : 8
    <f289c>   DW_AT_type        : <0xf28a0>
 <1><f28a0>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f28a1>   DW_AT_prototyped  : 1
    <f28a1>   DW_AT_sibling     : <0xf28b5>
 <2><f28a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28a6>   DW_AT_type        : <0xf2504>
 <2><f28aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28ab>   DW_AT_type        : <0xf21ed>
 <2><f28af>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28b0>   DW_AT_type        : <0xf21b9>
 <2><f28b4>: Abbrev Number: 0
 <1><f28b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <f28b6>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <f28ba>   DW_AT_decl_file   : 9
    <f28bb>   DW_AT_decl_line   : 51
    <f28bc>   DW_AT_decl_column : 24
    <f28bd>   DW_AT_type        : <0xf28c1>
 <1><f28c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f28c2>   DW_AT_byte_size   : 8
    <f28c2>   DW_AT_type        : <0xf28c6>
 <1><f28c6>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f28c7>   DW_AT_prototyped  : 1
    <f28c7>   DW_AT_type        : <0xf21e1>
    <f28cb>   DW_AT_sibling     : <0xf28da>
 <2><f28cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28d0>   DW_AT_type        : <0xf21e1>
 <2><f28d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28d5>   DW_AT_type        : <0xf221e>
 <2><f28d9>: Abbrev Number: 0
 <1><f28da>: Abbrev Number: 3 (DW_TAG_typedef)
    <f28db>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <f28df>   DW_AT_decl_file   : 9
    <f28e0>   DW_AT_decl_line   : 54
    <f28e1>   DW_AT_decl_column : 23
    <f28e2>   DW_AT_type        : <0xf28e6>
 <1><f28e6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f28e7>   DW_AT_byte_size   : 8
    <f28e7>   DW_AT_type        : <0xf28eb>
 <1><f28eb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f28ec>   DW_AT_prototyped  : 1
    <f28ec>   DW_AT_type        : <0xf21b9>
    <f28f0>   DW_AT_sibling     : <0xf2913>
 <2><f28f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28f5>   DW_AT_type        : <0xf2564>
 <2><f28f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28fa>   DW_AT_type        : <0xf21d3>
 <2><f28fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f28ff>   DW_AT_type        : <0xf221e>
 <2><f2903>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2904>   DW_AT_type        : <0xf21b9>
 <2><f2908>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2909>   DW_AT_type        : <0xf21b9>
 <2><f290d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f290e>   DW_AT_type        : <0xf21b9>
 <2><f2912>: Abbrev Number: 0
 <1><f2913>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2914>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <f2918>   DW_AT_decl_file   : 9
    <f2919>   DW_AT_decl_line   : 56
    <f291a>   DW_AT_decl_column : 23
    <f291b>   DW_AT_type        : <0xf291f>
 <1><f291f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2920>   DW_AT_byte_size   : 8
    <f2920>   DW_AT_type        : <0xf2924>
 <1><f2924>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2925>   DW_AT_prototyped  : 1
    <f2925>   DW_AT_type        : <0xf21b9>
    <f2929>   DW_AT_sibling     : <0xf2947>
 <2><f292d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f292e>   DW_AT_type        : <0xf2504>
 <2><f2932>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2933>   DW_AT_type        : <0xf22ad>
 <2><f2937>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2938>   DW_AT_type        : <0xf221e>
 <2><f293c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f293d>   DW_AT_type        : <0xf21b9>
 <2><f2941>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2942>   DW_AT_type        : <0xf21b9>
 <2><f2946>: Abbrev Number: 0
 <1><f2947>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2948>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <f294c>   DW_AT_decl_file   : 9
    <f294d>   DW_AT_decl_line   : 67
    <f294e>   DW_AT_decl_column : 23
    <f294f>   DW_AT_type        : <0xf2953>
 <1><f2953>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2954>   DW_AT_byte_size   : 8
    <f2954>   DW_AT_type        : <0xf2958>
 <1><f2958>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2959>   DW_AT_prototyped  : 1
    <f2959>   DW_AT_type        : <0xf21b9>
    <f295d>   DW_AT_sibling     : <0xf2967>
 <2><f2961>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2962>   DW_AT_type        : <0xf21b9>
 <2><f2966>: Abbrev Number: 0
 <1><f2967>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2968>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <f296c>   DW_AT_decl_file   : 9
    <f296d>   DW_AT_decl_line   : 68
    <f296e>   DW_AT_decl_column : 23
    <f296f>   DW_AT_type        : <0xf2973>
 <1><f2973>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2974>   DW_AT_byte_size   : 8
    <f2974>   DW_AT_type        : <0xf2978>
 <1><f2978>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f2979>   DW_AT_prototyped  : 1
    <f2979>   DW_AT_type        : <0xf21b9>
    <f297d>   DW_AT_sibling     : <0xf299b>
 <2><f2981>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2982>   DW_AT_type        : <0xf282e>
 <2><f2986>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2987>   DW_AT_type        : <0xf282e>
 <2><f298b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f298c>   DW_AT_type        : <0xf282e>
 <2><f2990>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2991>   DW_AT_type        : <0xf282e>
 <2><f2995>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2996>   DW_AT_type        : <0xf282e>
 <2><f299a>: Abbrev Number: 0
 <1><f299b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f299c>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <f29a0>   DW_AT_decl_file   : 9
    <f29a1>   DW_AT_decl_line   : 69
    <f29a2>   DW_AT_decl_column : 23
    <f29a3>   DW_AT_type        : <0xf29a7>
 <1><f29a7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f29a8>   DW_AT_byte_size   : 8
    <f29a8>   DW_AT_type        : <0xf29ac>
 <1><f29ac>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f29ad>   DW_AT_prototyped  : 1
    <f29ad>   DW_AT_type        : <0xf21b9>
    <f29b1>   DW_AT_sibling     : <0xf29ca>
 <2><f29b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f29b6>   DW_AT_type        : <0xf21b9>
 <2><f29ba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f29bb>   DW_AT_type        : <0xf21b9>
 <2><f29bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f29c0>   DW_AT_type        : <0xf21b9>
 <2><f29c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f29c5>   DW_AT_type        : <0xf21b9>
 <2><f29c9>: Abbrev Number: 0
 <1><f29ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <f29cb>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <f29cf>   DW_AT_decl_file   : 9
    <f29d0>   DW_AT_decl_line   : 73
    <f29d1>   DW_AT_decl_column : 23
    <f29d2>   DW_AT_type        : <0xf29d6>
 <1><f29d6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f29d7>   DW_AT_byte_size   : 8
    <f29d7>   DW_AT_type        : <0xf29db>
 <1><f29db>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f29dc>   DW_AT_prototyped  : 1
    <f29dc>   DW_AT_type        : <0xf21b9>
    <f29e0>   DW_AT_sibling     : <0xf29ea>
 <2><f29e4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f29e5>   DW_AT_type        : <0xf2196>
 <2><f29e9>: Abbrev Number: 0
 <1><f29ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <f29eb>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <f29ef>   DW_AT_decl_file   : 9
    <f29f0>   DW_AT_decl_line   : 74
    <f29f1>   DW_AT_decl_column : 23
    <f29f2>   DW_AT_type        : <0xf29f6>
 <1><f29f6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f29f7>   DW_AT_byte_size   : 8
    <f29f7>   DW_AT_type        : <0xf29fb>
 <1><f29fb>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <f29fc>   DW_AT_prototyped  : 1
    <f29fc>   DW_AT_type        : <0xf21b9>
    <f2a00>   DW_AT_sibling     : <0xf2a0f>
 <2><f2a04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2a05>   DW_AT_type        : <0xf2196>
 <2><f2a09>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2a0a>   DW_AT_type        : <0xf218f>
 <2><f2a0e>: Abbrev Number: 0
 <1><f2a0f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2a10>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <f2a14>   DW_AT_decl_file   : 9
    <f2a15>   DW_AT_decl_line   : 80
    <f2a16>   DW_AT_decl_column : 23
    <f2a17>   DW_AT_type        : <0xf277e>
 <1><f2a1b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2a1c>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <f2a20>   DW_AT_decl_file   : 9
    <f2a21>   DW_AT_decl_line   : 83
    <f2a22>   DW_AT_decl_column : 23
    <f2a23>   DW_AT_type        : <0xf2953>
 <1><f2a27>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2a28>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <f2a2c>   DW_AT_decl_file   : 9
    <f2a2d>   DW_AT_decl_line   : 86
    <f2a2e>   DW_AT_decl_column : 23
    <f2a2f>   DW_AT_type        : <0xf27dc>
 <1><f2a33>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2a34>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <f2a38>   DW_AT_decl_file   : 9
    <f2a39>   DW_AT_decl_line   : 89
    <f2a3a>   DW_AT_decl_column : 23
    <f2a3b>   DW_AT_type        : <0xf27dc>
 <1><f2a3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2a40>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <f2a44>   DW_AT_decl_file   : 9
    <f2a45>   DW_AT_decl_line   : 91
    <f2a46>   DW_AT_decl_column : 23
    <f2a47>   DW_AT_type        : <0xf2a4b>
 <1><f2a4b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2a4c>   DW_AT_byte_size   : 8
    <f2a4c>   DW_AT_type        : <0xf2a50>
 <1><f2a50>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <f2a51>   DW_AT_prototyped  : 1
    <f2a51>   DW_AT_sibling     : <0xf2a5b>
 <2><f2a55>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2a56>   DW_AT_type        : <0xf2a5b>
 <2><f2a5a>: Abbrev Number: 0
 <1><f2a5b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f2a5c>   DW_AT_byte_size   : 8
    <f2a5c>   DW_AT_type        : <0xf272e>
 <1><f2a60>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f2a61>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f2a65>   DW_AT_byte_size   : 224
    <f2a66>   DW_AT_decl_file   : 9
    <f2a67>   DW_AT_decl_line   : 93
    <f2a68>   DW_AT_decl_column : 16
    <f2a69>   DW_AT_sibling     : <0xf2bda>
 <2><f2a6d>: Abbrev Number: 2 (DW_TAG_member)
    <f2a6e>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <f2a72>   DW_AT_decl_file   : 9
    <f2a73>   DW_AT_decl_line   : 94
    <f2a74>   DW_AT_decl_column : 23
    <f2a75>   DW_AT_type        : <0xf273a>
    <f2a79>   DW_AT_data_member_location: 0
 <2><f2a7a>: Abbrev Number: 2 (DW_TAG_member)
    <f2a7b>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <f2a7f>   DW_AT_decl_file   : 9
    <f2a80>   DW_AT_decl_line   : 95
    <f2a81>   DW_AT_decl_column : 23
    <f2a82>   DW_AT_type        : <0xf2750>
    <f2a86>   DW_AT_data_member_location: 8
 <2><f2a87>: Abbrev Number: 2 (DW_TAG_member)
    <f2a88>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <f2a8c>   DW_AT_decl_file   : 9
    <f2a8d>   DW_AT_decl_line   : 96
    <f2a8e>   DW_AT_decl_column : 23
    <f2a8f>   DW_AT_type        : <0xf2766>
    <f2a93>   DW_AT_data_member_location: 16
 <2><f2a94>: Abbrev Number: 2 (DW_TAG_member)
    <f2a95>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <f2a99>   DW_AT_decl_file   : 9
    <f2a9a>   DW_AT_decl_line   : 97
    <f2a9b>   DW_AT_decl_column : 23
    <f2a9c>   DW_AT_type        : <0xf2772>
    <f2aa0>   DW_AT_data_member_location: 24
 <2><f2aa1>: Abbrev Number: 2 (DW_TAG_member)
    <f2aa2>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <f2aa6>   DW_AT_decl_file   : 9
    <f2aa7>   DW_AT_decl_line   : 98
    <f2aa8>   DW_AT_decl_column : 23
    <f2aa9>   DW_AT_type        : <0xf278e>
    <f2aad>   DW_AT_data_member_location: 32
 <2><f2aae>: Abbrev Number: 2 (DW_TAG_member)
    <f2aaf>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <f2ab3>   DW_AT_decl_file   : 9
    <f2ab4>   DW_AT_decl_line   : 99
    <f2ab5>   DW_AT_decl_column : 23
    <f2ab6>   DW_AT_type        : <0xf27b8>
    <f2aba>   DW_AT_data_member_location: 40
 <2><f2abb>: Abbrev Number: 2 (DW_TAG_member)
    <f2abc>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <f2ac0>   DW_AT_decl_file   : 9
    <f2ac1>   DW_AT_decl_line   : 100
    <f2ac2>   DW_AT_decl_column : 23
    <f2ac3>   DW_AT_type        : <0xf27d0>
    <f2ac7>   DW_AT_data_member_location: 48
 <2><f2ac8>: Abbrev Number: 2 (DW_TAG_member)
    <f2ac9>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <f2acd>   DW_AT_decl_file   : 9
    <f2ace>   DW_AT_decl_line   : 101
    <f2acf>   DW_AT_decl_column : 23
    <f2ad0>   DW_AT_type        : <0xf27f5>
    <f2ad4>   DW_AT_data_member_location: 56
 <2><f2ad5>: Abbrev Number: 2 (DW_TAG_member)
    <f2ad6>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <f2ada>   DW_AT_decl_file   : 9
    <f2adb>   DW_AT_decl_line   : 102
    <f2adc>   DW_AT_decl_column : 23
    <f2add>   DW_AT_type        : <0xf2801>
    <f2ae1>   DW_AT_data_member_location: 64
 <2><f2ae2>: Abbrev Number: 2 (DW_TAG_member)
    <f2ae3>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <f2ae7>   DW_AT_decl_file   : 9
    <f2ae8>   DW_AT_decl_line   : 103
    <f2ae9>   DW_AT_decl_column : 23
    <f2aea>   DW_AT_type        : <0xf280d>
    <f2aee>   DW_AT_data_member_location: 72
 <2><f2aef>: Abbrev Number: 2 (DW_TAG_member)
    <f2af0>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <f2af4>   DW_AT_decl_file   : 9
    <f2af5>   DW_AT_decl_line   : 104
    <f2af6>   DW_AT_decl_column : 23
    <f2af7>   DW_AT_type        : <0xf2833>
    <f2afb>   DW_AT_data_member_location: 80
 <2><f2afc>: Abbrev Number: 2 (DW_TAG_member)
    <f2afd>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <f2b01>   DW_AT_decl_file   : 9
    <f2b02>   DW_AT_decl_line   : 105
    <f2b03>   DW_AT_decl_column : 24
    <f2b04>   DW_AT_type        : <0xf2869>
    <f2b08>   DW_AT_data_member_location: 88
 <2><f2b09>: Abbrev Number: 2 (DW_TAG_member)
    <f2b0a>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <f2b0e>   DW_AT_decl_file   : 9
    <f2b0f>   DW_AT_decl_line   : 106
    <f2b10>   DW_AT_decl_column : 25
    <f2b11>   DW_AT_type        : <0xf288f>
    <f2b15>   DW_AT_data_member_location: 96
 <2><f2b16>: Abbrev Number: 2 (DW_TAG_member)
    <f2b17>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <f2b1b>   DW_AT_decl_file   : 9
    <f2b1c>   DW_AT_decl_line   : 107
    <f2b1d>   DW_AT_decl_column : 23
    <f2b1e>   DW_AT_type        : <0xf28b5>
    <f2b22>   DW_AT_data_member_location: 104
 <2><f2b23>: Abbrev Number: 2 (DW_TAG_member)
    <f2b24>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <f2b28>   DW_AT_decl_file   : 9
    <f2b29>   DW_AT_decl_line   : 108
    <f2b2a>   DW_AT_decl_column : 23
    <f2b2b>   DW_AT_type        : <0xf2947>
    <f2b2f>   DW_AT_data_member_location: 112
 <2><f2b30>: Abbrev Number: 2 (DW_TAG_member)
    <f2b31>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <f2b35>   DW_AT_decl_file   : 9
    <f2b36>   DW_AT_decl_line   : 109
    <f2b37>   DW_AT_decl_column : 23
    <f2b38>   DW_AT_type        : <0xf2967>
    <f2b3c>   DW_AT_data_member_location: 120
 <2><f2b3d>: Abbrev Number: 2 (DW_TAG_member)
    <f2b3e>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <f2b42>   DW_AT_decl_file   : 9
    <f2b43>   DW_AT_decl_line   : 110
    <f2b44>   DW_AT_decl_column : 23
    <f2b45>   DW_AT_type        : <0xf299b>
    <f2b49>   DW_AT_data_member_location: 128
 <2><f2b4a>: Abbrev Number: 2 (DW_TAG_member)
    <f2b4b>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <f2b4f>   DW_AT_decl_file   : 9
    <f2b50>   DW_AT_decl_line   : 111
    <f2b51>   DW_AT_decl_column : 23
    <f2b52>   DW_AT_type        : <0xf29ca>
    <f2b56>   DW_AT_data_member_location: 136
 <2><f2b57>: Abbrev Number: 2 (DW_TAG_member)
    <f2b58>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <f2b5c>   DW_AT_decl_file   : 9
    <f2b5d>   DW_AT_decl_line   : 112
    <f2b5e>   DW_AT_decl_column : 23
    <f2b5f>   DW_AT_type        : <0xf29ea>
    <f2b63>   DW_AT_data_member_location: 144
 <2><f2b64>: Abbrev Number: 2 (DW_TAG_member)
    <f2b65>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <f2b69>   DW_AT_decl_file   : 9
    <f2b6a>   DW_AT_decl_line   : 113
    <f2b6b>   DW_AT_decl_column : 25
    <f2b6c>   DW_AT_type        : <0xf27c4>
    <f2b70>   DW_AT_data_member_location: 152
 <2><f2b71>: Abbrev Number: 2 (DW_TAG_member)
    <f2b72>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <f2b76>   DW_AT_decl_file   : 9
    <f2b77>   DW_AT_decl_line   : 114
    <f2b78>   DW_AT_decl_column : 24
    <f2b79>   DW_AT_type        : <0xf28da>
    <f2b7d>   DW_AT_data_member_location: 160
 <2><f2b7e>: Abbrev Number: 2 (DW_TAG_member)
    <f2b7f>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <f2b83>   DW_AT_decl_file   : 9
    <f2b84>   DW_AT_decl_line   : 115
    <f2b85>   DW_AT_decl_column : 25
    <f2b86>   DW_AT_type        : <0xf2913>
    <f2b8a>   DW_AT_data_member_location: 168
 <2><f2b8b>: Abbrev Number: 2 (DW_TAG_member)
    <f2b8c>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <f2b90>   DW_AT_decl_file   : 9
    <f2b91>   DW_AT_decl_line   : 116
    <f2b92>   DW_AT_decl_column : 23
    <f2b93>   DW_AT_type        : <0xf283f>
    <f2b97>   DW_AT_data_member_location: 176
 <2><f2b98>: Abbrev Number: 2 (DW_TAG_member)
    <f2b99>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <f2b9d>   DW_AT_decl_file   : 9
    <f2b9e>   DW_AT_decl_line   : 117
    <f2b9f>   DW_AT_decl_column : 23
    <f2ba0>   DW_AT_type        : <0xf2a0f>
    <f2ba4>   DW_AT_data_member_location: 184
 <2><f2ba5>: Abbrev Number: 2 (DW_TAG_member)
    <f2ba6>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <f2baa>   DW_AT_decl_file   : 9
    <f2bab>   DW_AT_decl_line   : 118
    <f2bac>   DW_AT_decl_column : 22
    <f2bad>   DW_AT_type        : <0xf2a1b>
    <f2bb1>   DW_AT_data_member_location: 192
 <2><f2bb2>: Abbrev Number: 2 (DW_TAG_member)
    <f2bb3>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <f2bb7>   DW_AT_decl_file   : 9
    <f2bb8>   DW_AT_decl_line   : 119
    <f2bb9>   DW_AT_decl_column : 23
    <f2bba>   DW_AT_type        : <0xf2a27>
    <f2bbe>   DW_AT_data_member_location: 200
 <2><f2bbf>: Abbrev Number: 2 (DW_TAG_member)
    <f2bc0>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <f2bc4>   DW_AT_decl_file   : 9
    <f2bc5>   DW_AT_decl_line   : 120
    <f2bc6>   DW_AT_decl_column : 22
    <f2bc7>   DW_AT_type        : <0xf2a33>
    <f2bcb>   DW_AT_data_member_location: 208
 <2><f2bcc>: Abbrev Number: 2 (DW_TAG_member)
    <f2bcd>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <f2bd1>   DW_AT_decl_file   : 9
    <f2bd2>   DW_AT_decl_line   : 121
    <f2bd3>   DW_AT_decl_column : 23
    <f2bd4>   DW_AT_type        : <0xf2a3f>
    <f2bd8>   DW_AT_data_member_location: 216
 <2><f2bd9>: Abbrev Number: 0
 <1><f2bda>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2bdb>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <f2bdf>   DW_AT_decl_file   : 9
    <f2be0>   DW_AT_decl_line   : 122
    <f2be1>   DW_AT_decl_column : 3
    <f2be2>   DW_AT_type        : <0xf2a60>
 <1><f2be6>: Abbrev Number: 39 (DW_TAG_structure_type)
    <f2be7>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <f2beb>   DW_AT_byte_size   : 20848
    <f2bed>   DW_AT_decl_file   : 10
    <f2bee>   DW_AT_decl_line   : 349
    <f2bf0>   DW_AT_decl_column : 16
    <f2bf1>   DW_AT_sibling     : <0xf2c66>
 <2><f2bf5>: Abbrev Number: 10 (DW_TAG_member)
    <f2bf6>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <f2bfa>   DW_AT_decl_file   : 10
    <f2bfa>   DW_AT_decl_line   : 350
    <f2bfc>   DW_AT_decl_column : 18
    <f2bfc>   DW_AT_type        : <0xf21b9>
    <f2c00>   DW_AT_data_member_location: 0
 <2><f2c01>: Abbrev Number: 10 (DW_TAG_member)
    <f2c02>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <f2c06>   DW_AT_decl_file   : 10
    <f2c06>   DW_AT_decl_line   : 351
    <f2c08>   DW_AT_decl_column : 18
    <f2c08>   DW_AT_type        : <0xf2247>
    <f2c0c>   DW_AT_data_member_location: 8
 <2><f2c0d>: Abbrev Number: 10 (DW_TAG_member)
    <f2c0e>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <f2c12>   DW_AT_decl_file   : 10
    <f2c12>   DW_AT_decl_line   : 352
    <f2c14>   DW_AT_decl_column : 18
    <f2c14>   DW_AT_type        : <0xf2293>
    <f2c18>   DW_AT_data_member_location: 16
 <2><f2c19>: Abbrev Number: 10 (DW_TAG_member)
    <f2c1a>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <f2c1e>   DW_AT_decl_file   : 10
    <f2c1e>   DW_AT_decl_line   : 353
    <f2c20>   DW_AT_decl_column : 18
    <f2c20>   DW_AT_type        : <0xf21e1>
    <f2c24>   DW_AT_data_member_location: 40
 <2><f2c25>: Abbrev Number: 10 (DW_TAG_member)
    <f2c26>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <f2c2a>   DW_AT_decl_file   : 10
    <f2c2a>   DW_AT_decl_line   : 354
    <f2c2c>   DW_AT_decl_column : 18
    <f2c2c>   DW_AT_type        : <0xf2bda>
    <f2c30>   DW_AT_data_member_location: 48
 <2><f2c31>: Abbrev Number: 15 (DW_TAG_member)
    <f2c32>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <f2c36>   DW_AT_decl_file   : 10
    <f2c36>   DW_AT_decl_line   : 355
    <f2c38>   DW_AT_decl_column : 18
    <f2c38>   DW_AT_type        : <0xf2c66>
    <f2c3c>   DW_AT_data_member_location: 272
 <2><f2c3e>: Abbrev Number: 15 (DW_TAG_member)
    <f2c3f>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <f2c43>   DW_AT_decl_file   : 10
    <f2c43>   DW_AT_decl_line   : 356
    <f2c45>   DW_AT_decl_column : 18
    <f2c45>   DW_AT_type        : <0xf21b9>
    <f2c49>   DW_AT_data_member_location: 20832
 <2><f2c4b>: Abbrev Number: 15 (DW_TAG_member)
    <f2c4c>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <f2c50>   DW_AT_decl_file   : 10
    <f2c50>   DW_AT_decl_line   : 357
    <f2c52>   DW_AT_decl_column : 18
    <f2c52>   DW_AT_type        : <0xf21b9>
    <f2c56>   DW_AT_data_member_location: 20836
 <2><f2c58>: Abbrev Number: 15 (DW_TAG_member)
    <f2c59>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <f2c5d>   DW_AT_decl_file   : 10
    <f2c5d>   DW_AT_decl_line   : 358
    <f2c5f>   DW_AT_decl_column : 18
    <f2c5f>   DW_AT_type        : <0xf2258>
    <f2c63>   DW_AT_data_member_location: 20840
 <2><f2c65>: Abbrev Number: 0
 <1><f2c66>: Abbrev Number: 18 (DW_TAG_array_type)
    <f2c67>   DW_AT_type        : <0xf2674>
    <f2c6b>   DW_AT_sibling     : <0xf2c77>
 <2><f2c6f>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <f2c70>   DW_AT_type        : <0xf21a4>
    <f2c74>   DW_AT_upper_bound : 256
 <2><f2c76>: Abbrev Number: 0
 <1><f2c77>: Abbrev Number: 19 (DW_TAG_typedef)
    <f2c78>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <f2c7c>   DW_AT_decl_file   : 10
    <f2c7d>   DW_AT_decl_line   : 359
    <f2c7f>   DW_AT_decl_column : 3
    <f2c80>   DW_AT_type        : <0xf2be6>
 <1><f2c84>: Abbrev Number: 41 (DW_TAG_variable)
    <f2c85>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <f2c89>   DW_AT_decl_file   : 10
    <f2c8a>   DW_AT_decl_line   : 361
    <f2c8c>   DW_AT_decl_column : 21
    <f2c8d>   DW_AT_type        : <0xf2c77>
    <f2c91>   DW_AT_external    : 1
    <f2c91>   DW_AT_declaration : 1
 <1><f2c91>: Abbrev Number: 42 (DW_TAG_subprogram)
    <f2c92>   DW_AT_external    : 1
    <f2c92>   DW_AT_name        : (indirect string, offset: 0x1bc36): fb_hFilePrintBufferWstrEx
    <f2c96>   DW_AT_decl_file   : 2
    <f2c97>   DW_AT_decl_line   : 305
    <f2c99>   DW_AT_decl_column : 21
    <f2c9a>   DW_AT_prototyped  : 1
    <f2c9a>   DW_AT_type        : <0xf21b9>
    <f2c9e>   DW_AT_declaration : 1
    <f2c9e>   DW_AT_sibling     : <0xf2cb2>
 <2><f2ca2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2ca3>   DW_AT_type        : <0xf2680>
 <2><f2ca7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2ca8>   DW_AT_type        : <0xf2504>
 <2><f2cac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f2cad>   DW_AT_type        : <0xf21ed>
 <2><f2cb1>: Abbrev Number: 0
 <1><f2cb2>: Abbrev Number: 43 (DW_TAG_subprogram)
    <f2cb3>   DW_AT_external    : 1
    <f2cb3>   DW_AT_name        : (indirect string, offset: 0x1d777): fb_DevScrnInit_WriteWstr
    <f2cb7>   DW_AT_decl_file   : 11
    <f2cb8>   DW_AT_decl_line   : 57
    <f2cb9>   DW_AT_decl_column : 21
    <f2cba>   DW_AT_prototyped  : 1
    <f2cba>   DW_AT_declaration : 1
 <1><f2cba>: Abbrev Number: 44 (DW_TAG_subprogram)
    <f2cbb>   DW_AT_external    : 1
    <f2cbb>   DW_AT_name        : (indirect string, offset: 0x1dbe4): fb_PrintPadWstr
    <f2cbf>   DW_AT_decl_file   : 1
    <f2cc0>   DW_AT_decl_line   : 81
    <f2cc1>   DW_AT_decl_column : 13
    <f2cc2>   DW_AT_prototyped  : 1
    <f2cc2>   DW_AT_low_pc      : 0x47b720
    <f2cca>   DW_AT_high_pc     : 0x41
    <f2cd2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f2cd4>   DW_AT_call_all_calls: 1
    <f2cd4>   DW_AT_sibling     : <0xf2d0c>
 <2><f2cd8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <f2cd9>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <f2cdd>   DW_AT_decl_file   : 1
    <f2cdd>   DW_AT_decl_line   : 83
    <f2cde>   DW_AT_decl_column : 7
    <f2cdf>   DW_AT_type        : <0xf21b9>
    <f2ce3>   DW_AT_location    : 0x44b55 (location list)
    <f2ce7>   DW_AT_GNU_locviews: 0x44b4f
 <2><f2ceb>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <f2cec>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <f2cf0>   DW_AT_decl_file   : 1
    <f2cf0>   DW_AT_decl_line   : 84
    <f2cf1>   DW_AT_decl_column : 7
    <f2cf2>   DW_AT_type        : <0xf21b9>
    <f2cf6>   DW_AT_location    : 0x44b77 (location list)
    <f2cfa>   DW_AT_GNU_locviews: 0x44b73
 <2><f2cfe>: Abbrev Number: 45 (DW_TAG_call_site)
    <f2cff>   DW_AT_call_return_pc: 0x47b761
    <f2d07>   DW_AT_call_tail_call: 1
    <f2d07>   DW_AT_call_origin : <0xf2d0c>
 <2><f2d0b>: Abbrev Number: 0
 <1><f2d0c>: Abbrev Number: 46 (DW_TAG_subprogram)
    <f2d0d>   DW_AT_external    : 1
    <f2d0d>   DW_AT_name        : (indirect string, offset: 0x1bd19): fb_PrintPadWstrEx
    <f2d11>   DW_AT_decl_file   : 1
    <f2d12>   DW_AT_decl_line   : 45
    <f2d13>   DW_AT_decl_column : 6
    <f2d14>   DW_AT_prototyped  : 1
    <f2d14>   DW_AT_ranges      : 0x1895b
    <f2d18>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f2d1a>   DW_AT_call_all_calls: 1
    <f2d1a>   DW_AT_sibling     : <0xf2ead>
 <2><f2d1e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <f2d1f>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <f2d23>   DW_AT_decl_file   : 1
    <f2d23>   DW_AT_decl_line   : 47
    <f2d24>   DW_AT_decl_column : 12
    <f2d25>   DW_AT_type        : <0xf2680>
    <f2d29>   DW_AT_location    : 0x44b9e (location list)
    <f2d2d>   DW_AT_GNU_locviews: 0x44b8e
 <2><f2d31>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <f2d32>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <f2d36>   DW_AT_decl_file   : 1
    <f2d36>   DW_AT_decl_line   : 48
    <f2d37>   DW_AT_decl_column : 7
    <f2d38>   DW_AT_type        : <0xf21b9>
    <f2d3c>   DW_AT_location    : 0x44bee (location list)
    <f2d40>   DW_AT_GNU_locviews: 0x44be8
 <2><f2d44>: Abbrev Number: 17 (DW_TAG_variable)
    <f2d45>   DW_AT_name        : (indirect string, offset: 0x1bcf9): tmp_handle
    <f2d49>   DW_AT_decl_file   : 1
    <f2d49>   DW_AT_decl_line   : 55
    <f2d4a>   DW_AT_decl_column : 14
    <f2d4b>   DW_AT_type        : <0xf2680>
    <f2d4f>   DW_AT_location    : 0x44c1d (location list)
    <f2d53>   DW_AT_GNU_locviews: 0x44c15
 <2><f2d57>: Abbrev Number: 17 (DW_TAG_variable)
    <f2d58>   DW_AT_name        : (indirect string, offset: 0x1b002): old_x
    <f2d5c>   DW_AT_decl_file   : 1
    <f2d5c>   DW_AT_decl_line   : 56
    <f2d5d>   DW_AT_decl_column : 9
    <f2d5e>   DW_AT_type        : <0xf21b9>
    <f2d62>   DW_AT_location    : 0x44c50 (location list)
    <f2d66>   DW_AT_GNU_locviews: 0x44c48
 <2><f2d6a>: Abbrev Number: 17 (DW_TAG_variable)
    <f2d6b>   DW_AT_name        : (indirect string, offset: 0x19d05): new_x
    <f2d6f>   DW_AT_decl_file   : 1
    <f2d6f>   DW_AT_decl_line   : 57
    <f2d70>   DW_AT_decl_column : 9
    <f2d71>   DW_AT_type        : <0xf21b9>
    <f2d75>   DW_AT_location    : 0x44c83 (location list)
    <f2d79>   DW_AT_GNU_locviews: 0x44c7b
 <2><f2d7d>: Abbrev Number: 47 (DW_TAG_lexical_block)
    <f2d7e>   DW_AT_low_pc      : 0x47b6d0
    <f2d86>   DW_AT_high_pc     : 0xd
    <f2d8e>   DW_AT_sibling     : <0xf2da6>
 <3><f2d92>: Abbrev Number: 17 (DW_TAG_variable)
    <f2d93>   DW_AT_name        : (indirect string, offset: 0x1dbf4): dev_width
    <f2d97>   DW_AT_decl_file   : 1
    <f2d97>   DW_AT_decl_line   : 70
    <f2d98>   DW_AT_decl_column : 18
    <f2d99>   DW_AT_type        : <0xf219d>
    <f2d9d>   DW_AT_location    : 0x44cad (location list)
    <f2da1>   DW_AT_GNU_locviews: 0x44ca9
 <3><f2da5>: Abbrev Number: 0
 <2><f2da6>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <f2da7>   DW_AT_abstract_origin: <0xf2f1d>
    <f2dab>   DW_AT_entry_pc    : 0x47b5dd
    <f2db3>   DW_AT_GNU_entry_view: 1
    <f2db4>   DW_AT_ranges      : 0x18971
    <f2db8>   DW_AT_call_file   : 1
    <f2db8>   DW_AT_call_line   : 61
    <f2db9>   DW_AT_call_column : 18
    <f2dba>   DW_AT_sibling     : <0xf2dcc>
 <3><f2dbe>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f2dbf>   DW_AT_abstract_origin: <0xf2f2e>
    <f2dc3>   DW_AT_location    : 0x44cce (location list)
    <f2dc7>   DW_AT_GNU_locviews: 0x44cc2
 <3><f2dcb>: Abbrev Number: 0
 <2><f2dcc>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <f2dcd>   DW_AT_abstract_origin: <0xf2ead>
    <f2dd1>   DW_AT_entry_pc    : 0x47b62e
    <f2dd9>   DW_AT_GNU_entry_view: 1
    <f2dda>   DW_AT_ranges      : 0x18986
    <f2dde>   DW_AT_call_file   : 1
    <f2dde>   DW_AT_call_line   : 76
    <f2ddf>   DW_AT_call_column : 5
    <f2de0>   DW_AT_sibling     : <0xf2e92>
 <3><f2de4>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f2de5>   DW_AT_abstract_origin: <0xf2ec6>
    <f2de9>   DW_AT_location    : 0x44d0b (location list)
    <f2ded>   DW_AT_GNU_locviews: 0x44d07
 <3><f2df1>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f2df2>   DW_AT_abstract_origin: <0xf2ede>
    <f2df6>   DW_AT_location    : 0x44d2c (location list)
    <f2dfa>   DW_AT_GNU_locviews: 0x44d28
 <3><f2dfe>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f2dff>   DW_AT_abstract_origin: <0xf2ed2>
    <f2e03>   DW_AT_location    : 0x44d4a (location list)
    <f2e07>   DW_AT_GNU_locviews: 0x44d42
 <3><f2e0b>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f2e0c>   DW_AT_abstract_origin: <0xf2eba>
    <f2e10>   DW_AT_location    : 0x44d7f (location list)
    <f2e14>   DW_AT_GNU_locviews: 0x44d75
 <3><f2e18>: Abbrev Number: 48 (DW_TAG_lexical_block)
    <f2e19>   DW_AT_ranges      : 0x18986
 <4><f2e1d>: Abbrev Number: 49 (DW_TAG_variable)
    <f2e1e>   DW_AT_abstract_origin: <0xf2eea>
    <f2e22>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <4><f2e26>: Abbrev Number: 50 (DW_TAG_lexical_block)
    <f2e27>   DW_AT_abstract_origin: <0xf2ef5>
    <f2e2b>   DW_AT_ranges      : 0x189a3
    <f2e2f>   DW_AT_sibling     : <0xf2e69>
 <5><f2e33>: Abbrev Number: 26 (DW_TAG_variable)
    <f2e34>   DW_AT_abstract_origin: <0xf2ef6>
    <f2e38>   DW_AT_location    : 0x44db6 (location list)
    <f2e3c>   DW_AT_GNU_locviews: 0x44dae
 <5><f2e40>: Abbrev Number: 26 (DW_TAG_variable)
    <f2e41>   DW_AT_abstract_origin: <0xf2f00>
    <f2e45>   DW_AT_location    : 0x44ddc (location list)
    <f2e49>   DW_AT_GNU_locviews: 0x44dd8
 <5><f2e4d>: Abbrev Number: 51 (DW_TAG_call_site)
    <f2e4e>   DW_AT_call_return_pc: 0x47b6b7
    <f2e56>   DW_AT_call_origin : <0xf2c91>
 <6><f2e5a>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f2e5b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f2e5d>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <6><f2e60>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f2e61>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f2e63>   DW_AT_call_value  : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <6><f2e67>: Abbrev Number: 0
 <5><f2e68>: Abbrev Number: 0
 <4><f2e69>: Abbrev Number: 52 (DW_TAG_call_site)
    <f2e6a>   DW_AT_call_return_pc: 0x47b70e
    <f2e72>   DW_AT_call_tail_call: 1
    <f2e72>   DW_AT_call_origin : <0xf2c91>
 <5><f2e76>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f2e77>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f2e79>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <5><f2e7d>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f2e7e>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f2e80>   DW_AT_call_value  : 9 byte block: 3 c4 41 48 0 0 0 0 0 	(DW_OP_addr: 4841c4)
 <5><f2e8a>: Abbrev Number: 12 (DW_TAG_call_site_parameter)
    <f2e8b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f2e8d>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><f2e8f>: Abbrev Number: 0
 <4><f2e90>: Abbrev Number: 0
 <3><f2e91>: Abbrev Number: 0
 <2><f2e92>: Abbrev Number: 27 (DW_TAG_call_site)
    <f2e93>   DW_AT_call_return_pc: 0x47b5dd
    <f2e9b>   DW_AT_call_origin : <0xf2cb2>
 <2><f2e9f>: Abbrev Number: 27 (DW_TAG_call_site)
    <f2ea0>   DW_AT_call_return_pc: 0x47b71a
    <f2ea8>   DW_AT_call_origin : <0xf2f3b>
 <2><f2eac>: Abbrev Number: 0
 <1><f2ead>: Abbrev Number: 53 (DW_TAG_subprogram)
    <f2eae>   DW_AT_name        : (indirect string, offset: 0x1dbfe): fb_hPrintPadWstrEx
    <f2eb2>   DW_AT_decl_file   : 1
    <f2eb3>   DW_AT_decl_line   : 7
    <f2eb4>   DW_AT_decl_column : 13
    <f2eb5>   DW_AT_prototyped  : 1
    <f2eb5>   DW_AT_inline      : 1	(inlined)
    <f2eb6>   DW_AT_sibling     : <0xf2f0d>
 <2><f2eba>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <f2ebb>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <f2ebf>   DW_AT_decl_file   : 1
    <f2ec0>   DW_AT_decl_line   : 9
    <f2ec1>   DW_AT_decl_column : 12
    <f2ec2>   DW_AT_type        : <0xf2680>
 <2><f2ec6>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <f2ec7>   DW_AT_name        : (indirect string, offset: 0x18948): mask
    <f2ecb>   DW_AT_decl_file   : 1
    <f2ecc>   DW_AT_decl_line   : 10
    <f2ecd>   DW_AT_decl_column : 7
    <f2ece>   DW_AT_type        : <0xf21b9>
 <2><f2ed2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <f2ed3>   DW_AT_name        : (indirect string, offset: 0x1b097): current_x
    <f2ed7>   DW_AT_decl_file   : 1
    <f2ed8>   DW_AT_decl_line   : 11
    <f2ed9>   DW_AT_decl_column : 7
    <f2eda>   DW_AT_type        : <0xf21b9>
 <2><f2ede>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <f2edf>   DW_AT_name        : (indirect string, offset: 0x19d05): new_x
    <f2ee3>   DW_AT_decl_file   : 1
    <f2ee4>   DW_AT_decl_line   : 12
    <f2ee5>   DW_AT_decl_column : 7
    <f2ee6>   DW_AT_type        : <0xf21b9>
 <2><f2eea>: Abbrev Number: 28 (DW_TAG_variable)
    <f2eeb>   DW_AT_name        : (indirect string, offset: 0x1bcdd): tab_char_buffer
    <f2eef>   DW_AT_decl_file   : 1
    <f2eef>   DW_AT_decl_line   : 19
    <f2ef0>   DW_AT_decl_column : 14
    <f2ef1>   DW_AT_type        : <0xf2f0d>
 <2><f2ef5>: Abbrev Number: 54 (DW_TAG_lexical_block)
 <3><f2ef6>: Abbrev Number: 55 (DW_TAG_variable)
    <f2ef7>   DW_AT_name        : i
    <f2ef9>   DW_AT_decl_file   : 1
    <f2efa>   DW_AT_decl_line   : 30
    <f2efb>   DW_AT_decl_column : 16
    <f2efc>   DW_AT_type        : <0xf21ed>
 <3><f2f00>: Abbrev Number: 28 (DW_TAG_variable)
    <f2f01>   DW_AT_name        : (indirect string, offset: 0x18d05): count
    <f2f05>   DW_AT_decl_file   : 1
    <f2f05>   DW_AT_decl_line   : 30
    <f2f06>   DW_AT_decl_column : 19
    <f2f07>   DW_AT_type        : <0xf21ed>
 <3><f2f0b>: Abbrev Number: 0
 <2><f2f0c>: Abbrev Number: 0
 <1><f2f0d>: Abbrev Number: 18 (DW_TAG_array_type)
    <f2f0e>   DW_AT_type        : <0xf21f9>
    <f2f12>   DW_AT_sibling     : <0xf2f1d>
 <2><f2f16>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <f2f17>   DW_AT_type        : <0xf21a4>
    <f2f1b>   DW_AT_upper_bound : 14
 <2><f2f1c>: Abbrev Number: 0
 <1><f2f1d>: Abbrev Number: 56 (DW_TAG_subprogram)
    <f2f1e>   DW_AT_name        : (indirect string, offset: 0x1b241): FB_HANDLE_DEREF
    <f2f22>   DW_AT_decl_file   : 2
    <f2f23>   DW_AT_decl_line   : 144
    <f2f24>   DW_AT_decl_column : 28
    <f2f25>   DW_AT_prototyped  : 1
    <f2f25>   DW_AT_type        : <0xf2680>
    <f2f29>   DW_AT_inline      : 3	(declared as inline and inlined)
    <f2f2a>   DW_AT_sibling     : <0xf2f3b>
 <2><f2f2e>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <f2f2f>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <f2f33>   DW_AT_decl_file   : 2
    <f2f34>   DW_AT_decl_line   : 144
    <f2f35>   DW_AT_decl_column : 54
    <f2f36>   DW_AT_type        : <0xf2680>
 <2><f2f3a>: Abbrev Number: 0
 <1><f2f3b>: Abbrev Number: 57 (DW_TAG_subprogram)
    <f2f3c>   DW_AT_external    : 1
    <f2f3c>   DW_AT_declaration : 1
    <f2f3c>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <f2f40>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><f2f44>: Abbrev Number: 0
  Compilation Unit @ offset 0xf2f45:
   Length:        0x57b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1a80a
   Pointer Size:  8
 <0><f2f51>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <f2f52>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <f2f56>   DW_AT_language    : 29	(C11)
    <f2f57>   DW_AT_name        : (indirect line string, offset: 0x1a17): src/rtlib/unix/io_viewupdate.c
    <f2f5b>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <f2f5f>   DW_AT_low_pc      : 0x47b770
    <f2f67>   DW_AT_high_pc     : 0x3a
    <f2f6f>   DW_AT_stmt_list   : 0x7132e
 <1><f2f73>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f74>   DW_AT_byte_size   : 1
    <f2f75>   DW_AT_encoding    : 8	(unsigned char)
    <f2f76>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><f2f7a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f7b>   DW_AT_byte_size   : 2
    <f2f7c>   DW_AT_encoding    : 7	(unsigned)
    <f2f7d>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><f2f81>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f82>   DW_AT_byte_size   : 4
    <f2f83>   DW_AT_encoding    : 7	(unsigned)
    <f2f84>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><f2f88>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f89>   DW_AT_byte_size   : 8
    <f2f8a>   DW_AT_encoding    : 7	(unsigned)
    <f2f8b>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><f2f8f>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f90>   DW_AT_byte_size   : 1
    <f2f91>   DW_AT_encoding    : 6	(signed char)
    <f2f92>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><f2f96>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2f97>   DW_AT_byte_size   : 2
    <f2f98>   DW_AT_encoding    : 5	(signed)
    <f2f99>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><f2f9d>: Abbrev Number: 15 (DW_TAG_base_type)
    <f2f9e>   DW_AT_byte_size   : 4
    <f2f9f>   DW_AT_encoding    : 5	(signed)
    <f2fa0>   DW_AT_name        : int
 <1><f2fa4>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2fa5>   DW_AT_byte_size   : 8
    <f2fa6>   DW_AT_encoding    : 5	(signed)
    <f2fa7>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><f2fab>: Abbrev Number: 5 (DW_TAG_typedef)
    <f2fac>   DW_AT_name        : (indirect string, offset: 0x16c13): __off_t
    <f2fb0>   DW_AT_decl_file   : 2
    <f2fb1>   DW_AT_decl_line   : 152
    <f2fb2>   DW_AT_decl_column : 25
    <f2fb3>   DW_AT_type        : <0xf2fa4>
 <1><f2fb7>: Abbrev Number: 5 (DW_TAG_typedef)
    <f2fb8>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <f2fbc>   DW_AT_decl_file   : 2
    <f2fbd>   DW_AT_decl_line   : 153
    <f2fbe>   DW_AT_decl_column : 27
    <f2fbf>   DW_AT_type        : <0xf2fa4>
 <1><f2fc3>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f2fc4>   DW_AT_byte_size   : 8
 <1><f2fc5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f2fc6>   DW_AT_byte_size   : 8
    <f2fc6>   DW_AT_type        : <0xf2fca>
 <1><f2fca>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2fcb>   DW_AT_byte_size   : 1
    <f2fcc>   DW_AT_encoding    : 6	(signed char)
    <f2fcd>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><f2fd1>: Abbrev Number: 5 (DW_TAG_typedef)
    <f2fd2>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <f2fd6>   DW_AT_decl_file   : 3
    <f2fd7>   DW_AT_decl_line   : 209
    <f2fd8>   DW_AT_decl_column : 23
    <f2fd9>   DW_AT_type        : <0xf2f88>
 <1><f2fdd>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2fde>   DW_AT_byte_size   : 8
    <f2fdf>   DW_AT_encoding    : 5	(signed)
    <f2fe0>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><f2fe4>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2fe5>   DW_AT_byte_size   : 8
    <f2fe6>   DW_AT_encoding    : 7	(unsigned)
    <f2fe7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><f2feb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f2fec>   DW_AT_name        : (indirect string, offset: 0x16966): _IO_FILE
    <f2ff0>   DW_AT_byte_size   : 216
    <f2ff1>   DW_AT_decl_file   : 4
    <f2ff2>   DW_AT_decl_line   : 49
    <f2ff3>   DW_AT_decl_column : 8
    <f2ff3>   DW_AT_sibling     : <0xf3171>
 <2><f2ff7>: Abbrev Number: 1 (DW_TAG_member)
    <f2ff8>   DW_AT_name        : (indirect string, offset: 0x19ecd): _flags
    <f2ffc>   DW_AT_decl_file   : 4
    <f2ffd>   DW_AT_decl_line   : 51
    <f2ffe>   DW_AT_decl_column : 7
    <f2fff>   DW_AT_type        : <0xf2f9d>
    <f3003>   DW_AT_data_member_location: 0
 <2><f3004>: Abbrev Number: 1 (DW_TAG_member)
    <f3005>   DW_AT_name        : (indirect string, offset: 0x16a19): _IO_read_ptr
    <f3009>   DW_AT_decl_file   : 4
    <f300a>   DW_AT_decl_line   : 54
    <f300b>   DW_AT_decl_column : 9
    <f300c>   DW_AT_type        : <0xf2fc5>
    <f3010>   DW_AT_data_member_location: 8
 <2><f3011>: Abbrev Number: 1 (DW_TAG_member)
    <f3012>   DW_AT_name        : (indirect string, offset: 0x16d07): _IO_read_end
    <f3016>   DW_AT_decl_file   : 4
    <f3017>   DW_AT_decl_line   : 55
    <f3018>   DW_AT_decl_column : 9
    <f3019>   DW_AT_type        : <0xf2fc5>
    <f301d>   DW_AT_data_member_location: 16
 <2><f301e>: Abbrev Number: 1 (DW_TAG_member)
    <f301f>   DW_AT_name        : (indirect string, offset: 0x16aaf): _IO_read_base
    <f3023>   DW_AT_decl_file   : 4
    <f3024>   DW_AT_decl_line   : 56
    <f3025>   DW_AT_decl_column : 9
    <f3026>   DW_AT_type        : <0xf2fc5>
    <f302a>   DW_AT_data_member_location: 24
 <2><f302b>: Abbrev Number: 1 (DW_TAG_member)
    <f302c>   DW_AT_name        : (indirect string, offset: 0x16861): _IO_write_base
    <f3030>   DW_AT_decl_file   : 4
    <f3031>   DW_AT_decl_line   : 57
    <f3032>   DW_AT_decl_column : 9
    <f3033>   DW_AT_type        : <0xf2fc5>
    <f3037>   DW_AT_data_member_location: 32
 <2><f3038>: Abbrev Number: 1 (DW_TAG_member)
    <f3039>   DW_AT_name        : (indirect string, offset: 0x16d43): _IO_write_ptr
    <f303d>   DW_AT_decl_file   : 4
    <f303e>   DW_AT_decl_line   : 58
    <f303f>   DW_AT_decl_column : 9
    <f3040>   DW_AT_type        : <0xf2fc5>
    <f3044>   DW_AT_data_member_location: 40
 <2><f3045>: Abbrev Number: 1 (DW_TAG_member)
    <f3046>   DW_AT_name        : (indirect string, offset: 0x16b3f): _IO_write_end
    <f304a>   DW_AT_decl_file   : 4
    <f304b>   DW_AT_decl_line   : 59
    <f304c>   DW_AT_decl_column : 9
    <f304d>   DW_AT_type        : <0xf2fc5>
    <f3051>   DW_AT_data_member_location: 48
 <2><f3052>: Abbrev Number: 1 (DW_TAG_member)
    <f3053>   DW_AT_name        : (indirect string, offset: 0x16b55): _IO_buf_base
    <f3057>   DW_AT_decl_file   : 4
    <f3058>   DW_AT_decl_line   : 60
    <f3059>   DW_AT_decl_column : 9
    <f305a>   DW_AT_type        : <0xf2fc5>
    <f305e>   DW_AT_data_member_location: 56
 <2><f305f>: Abbrev Number: 1 (DW_TAG_member)
    <f3060>   DW_AT_name        : (indirect string, offset: 0x16cb6): _IO_buf_end
    <f3064>   DW_AT_decl_file   : 4
    <f3065>   DW_AT_decl_line   : 61
    <f3066>   DW_AT_decl_column : 9
    <f3067>   DW_AT_type        : <0xf2fc5>
    <f306b>   DW_AT_data_member_location: 64
 <2><f306c>: Abbrev Number: 1 (DW_TAG_member)
    <f306d>   DW_AT_name        : (indirect string, offset: 0x168b2): _IO_save_base
    <f3071>   DW_AT_decl_file   : 4
    <f3072>   DW_AT_decl_line   : 64
    <f3073>   DW_AT_decl_column : 9
    <f3074>   DW_AT_type        : <0xf2fc5>
    <f3078>   DW_AT_data_member_location: 72
 <2><f3079>: Abbrev Number: 1 (DW_TAG_member)
    <f307a>   DW_AT_name        : (indirect string, offset: 0x16c50): _IO_backup_base
    <f307e>   DW_AT_decl_file   : 4
    <f307f>   DW_AT_decl_line   : 65
    <f3080>   DW_AT_decl_column : 9
    <f3081>   DW_AT_type        : <0xf2fc5>
    <f3085>   DW_AT_data_member_location: 80
 <2><f3086>: Abbrev Number: 1 (DW_TAG_member)
    <f3087>   DW_AT_name        : (indirect string, offset: 0x16815): _IO_save_end
    <f308b>   DW_AT_decl_file   : 4
    <f308c>   DW_AT_decl_line   : 66
    <f308d>   DW_AT_decl_column : 9
    <f308e>   DW_AT_type        : <0xf2fc5>
    <f3092>   DW_AT_data_member_location: 88
 <2><f3093>: Abbrev Number: 1 (DW_TAG_member)
    <f3094>   DW_AT_name        : (indirect string, offset: 0x16a3d): _markers
    <f3098>   DW_AT_decl_file   : 4
    <f3099>   DW_AT_decl_line   : 68
    <f309a>   DW_AT_decl_column : 22
    <f309b>   DW_AT_type        : <0xf318a>
    <f309f>   DW_AT_data_member_location: 96
 <2><f30a0>: Abbrev Number: 1 (DW_TAG_member)
    <f30a1>   DW_AT_name        : (indirect string, offset: 0x16901): _chain
    <f30a5>   DW_AT_decl_file   : 4
    <f30a6>   DW_AT_decl_line   : 70
    <f30a7>   DW_AT_decl_column : 20
    <f30a8>   DW_AT_type        : <0xf318f>
    <f30ac>   DW_AT_data_member_location: 104
 <2><f30ad>: Abbrev Number: 1 (DW_TAG_member)
    <f30ae>   DW_AT_name        : (indirect string, offset: 0x16d1c): _fileno
    <f30b2>   DW_AT_decl_file   : 4
    <f30b3>   DW_AT_decl_line   : 72
    <f30b4>   DW_AT_decl_column : 7
    <f30b5>   DW_AT_type        : <0xf2f9d>
    <f30b9>   DW_AT_data_member_location: 112
 <2><f30ba>: Abbrev Number: 1 (DW_TAG_member)
    <f30bb>   DW_AT_name        : (indirect string, offset: 0x16aa7): _flags2
    <f30bf>   DW_AT_decl_file   : 4
    <f30c0>   DW_AT_decl_line   : 73
    <f30c1>   DW_AT_decl_column : 7
    <f30c2>   DW_AT_type        : <0xf2f9d>
    <f30c6>   DW_AT_data_member_location: 116
 <2><f30c7>: Abbrev Number: 1 (DW_TAG_member)
    <f30c8>   DW_AT_name        : (indirect string, offset: 0x16adf): _old_offset
    <f30cc>   DW_AT_decl_file   : 4
    <f30cd>   DW_AT_decl_line   : 74
    <f30ce>   DW_AT_decl_column : 11
    <f30cf>   DW_AT_type        : <0xf2fab>
    <f30d3>   DW_AT_data_member_location: 120
 <2><f30d4>: Abbrev Number: 1 (DW_TAG_member)
    <f30d5>   DW_AT_name        : (indirect string, offset: 0x16908): _cur_column
    <f30d9>   DW_AT_decl_file   : 4
    <f30da>   DW_AT_decl_line   : 77
    <f30db>   DW_AT_decl_column : 18
    <f30dc>   DW_AT_type        : <0xf2f7a>
    <f30e0>   DW_AT_data_member_location: 128
 <2><f30e1>: Abbrev Number: 1 (DW_TAG_member)
    <f30e2>   DW_AT_name        : (indirect string, offset: 0x16cdc): _vtable_offset
    <f30e6>   DW_AT_decl_file   : 4
    <f30e7>   DW_AT_decl_line   : 78
    <f30e8>   DW_AT_decl_column : 15
    <f30e9>   DW_AT_type        : <0xf2f8f>
    <f30ed>   DW_AT_data_member_location: 130
 <2><f30ee>: Abbrev Number: 1 (DW_TAG_member)
    <f30ef>   DW_AT_name        : (indirect string, offset: 0x16c60): _shortbuf
    <f30f3>   DW_AT_decl_file   : 4
    <f30f4>   DW_AT_decl_line   : 79
    <f30f5>   DW_AT_decl_column : 8
    <f30f6>   DW_AT_type        : <0xf3194>
    <f30fa>   DW_AT_data_member_location: 131
 <2><f30fb>: Abbrev Number: 1 (DW_TAG_member)
    <f30fc>   DW_AT_name        : (indirect string, offset: 0x188e2): _lock
    <f3100>   DW_AT_decl_file   : 4
    <f3101>   DW_AT_decl_line   : 81
    <f3102>   DW_AT_decl_column : 15
    <f3103>   DW_AT_type        : <0xf31a4>
    <f3107>   DW_AT_data_member_location: 136
 <2><f3108>: Abbrev Number: 1 (DW_TAG_member)
    <f3109>   DW_AT_name        : (indirect string, offset: 0x16ae3): _offset
    <f310d>   DW_AT_decl_file   : 4
    <f310e>   DW_AT_decl_line   : 89
    <f310f>   DW_AT_decl_column : 13
    <f3110>   DW_AT_type        : <0xf2fb7>
    <f3114>   DW_AT_data_member_location: 144
 <2><f3115>: Abbrev Number: 1 (DW_TAG_member)
    <f3116>   DW_AT_name        : (indirect string, offset: 0x16804): _codecvt
    <f311a>   DW_AT_decl_file   : 4
    <f311b>   DW_AT_decl_line   : 91
    <f311c>   DW_AT_decl_column : 23
    <f311d>   DW_AT_type        : <0xf31ae>
    <f3121>   DW_AT_data_member_location: 152
 <2><f3122>: Abbrev Number: 1 (DW_TAG_member)
    <f3123>   DW_AT_name        : (indirect string, offset: 0x16972): _wide_data
    <f3127>   DW_AT_decl_file   : 4
    <f3128>   DW_AT_decl_line   : 92
    <f3129>   DW_AT_decl_column : 25
    <f312a>   DW_AT_type        : <0xf31b8>
    <f312e>   DW_AT_data_member_location: 160
 <2><f312f>: Abbrev Number: 1 (DW_TAG_member)
    <f3130>   DW_AT_name        : (indirect string, offset: 0x169a4): _freeres_list
    <f3134>   DW_AT_decl_file   : 4
    <f3135>   DW_AT_decl_line   : 93
    <f3136>   DW_AT_decl_column : 20
    <f3137>   DW_AT_type        : <0xf318f>
    <f313b>   DW_AT_data_member_location: 168
 <2><f313c>: Abbrev Number: 1 (DW_TAG_member)
    <f313d>   DW_AT_name        : (indirect string, offset: 0x16c2a): _freeres_buf
    <f3141>   DW_AT_decl_file   : 4
    <f3142>   DW_AT_decl_line   : 94
    <f3143>   DW_AT_decl_column : 9
    <f3144>   DW_AT_type        : <0xf2fc3>
    <f3148>   DW_AT_data_member_location: 176
 <2><f3149>: Abbrev Number: 1 (DW_TAG_member)
    <f314a>   DW_AT_name        : (indirect string, offset: 0x16b68): __pad5
    <f314e>   DW_AT_decl_file   : 4
    <f314f>   DW_AT_decl_line   : 95
    <f3150>   DW_AT_decl_column : 10
    <f3151>   DW_AT_type        : <0xf2fd1>
    <f3155>   DW_AT_data_member_location: 184
 <2><f3156>: Abbrev Number: 1 (DW_TAG_member)
    <f3157>   DW_AT_name        : (indirect string, offset: 0x185cb): _mode
    <f315b>   DW_AT_decl_file   : 4
    <f315c>   DW_AT_decl_line   : 96
    <f315d>   DW_AT_decl_column : 7
    <f315e>   DW_AT_type        : <0xf2f9d>
    <f3162>   DW_AT_data_member_location: 192
 <2><f3163>: Abbrev Number: 1 (DW_TAG_member)
    <f3164>   DW_AT_name        : (indirect string, offset: 0x16abd): _unused2
    <f3168>   DW_AT_decl_file   : 4
    <f3169>   DW_AT_decl_line   : 98
    <f316a>   DW_AT_decl_column : 8
    <f316b>   DW_AT_type        : <0xf31bd>
    <f316f>   DW_AT_data_member_location: 196
 <2><f3170>: Abbrev Number: 0
 <1><f3171>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3172>   DW_AT_name        : (indirect string, offset: 0x169fe): FILE
    <f3176>   DW_AT_decl_file   : 5
    <f3177>   DW_AT_decl_line   : 7
    <f3178>   DW_AT_decl_column : 25
    <f3179>   DW_AT_type        : <0xf2feb>
 <1><f317d>: Abbrev Number: 17 (DW_TAG_typedef)
    <f317e>   DW_AT_name        : (indirect string, offset: 0x16a03): _IO_lock_t
    <f3182>   DW_AT_decl_file   : 4
    <f3183>   DW_AT_decl_line   : 43
    <f3184>   DW_AT_decl_column : 14
 <1><f3185>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f3186>   DW_AT_name        : (indirect string, offset: 0x16949): _IO_marker
    <f318a>   DW_AT_declaration : 1
 <1><f318a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f318b>   DW_AT_byte_size   : 8
    <f318b>   DW_AT_type        : <0xf3185>
 <1><f318f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f3190>   DW_AT_byte_size   : 8
    <f3190>   DW_AT_type        : <0xf2feb>
 <1><f3194>: Abbrev Number: 7 (DW_TAG_array_type)
    <f3195>   DW_AT_type        : <0xf2fca>
    <f3199>   DW_AT_sibling     : <0xf31a4>
 <2><f319d>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f319e>   DW_AT_type        : <0xf2f88>
    <f31a2>   DW_AT_upper_bound : 0
 <2><f31a3>: Abbrev Number: 0
 <1><f31a4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f31a5>   DW_AT_byte_size   : 8
    <f31a5>   DW_AT_type        : <0xf317d>
 <1><f31a9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f31aa>   DW_AT_name        : (indirect string, offset: 0x16801): _IO_codecvt
    <f31ae>   DW_AT_declaration : 1
 <1><f31ae>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f31af>   DW_AT_byte_size   : 8
    <f31af>   DW_AT_type        : <0xf31a9>
 <1><f31b3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f31b4>   DW_AT_name        : (indirect string, offset: 0x1696f): _IO_wide_data
    <f31b8>   DW_AT_declaration : 1
 <1><f31b8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f31b9>   DW_AT_byte_size   : 8
    <f31b9>   DW_AT_type        : <0xf31b3>
 <1><f31bd>: Abbrev Number: 7 (DW_TAG_array_type)
    <f31be>   DW_AT_type        : <0xf2fca>
    <f31c2>   DW_AT_sibling     : <0xf31cd>
 <2><f31c6>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f31c7>   DW_AT_type        : <0xf2f88>
    <f31cb>   DW_AT_upper_bound : 19
 <2><f31cc>: Abbrev Number: 0
 <1><f31cd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f31ce>   DW_AT_byte_size   : 8
    <f31ce>   DW_AT_type        : <0xf3171>
 <1><f31d2>: Abbrev Number: 5 (DW_TAG_typedef)
    <f31d3>   DW_AT_name        : (indirect string, offset: 0x1b8d6): cc_t
    <f31d7>   DW_AT_decl_file   : 6
    <f31d8>   DW_AT_decl_line   : 23
    <f31d9>   DW_AT_decl_column : 23
    <f31da>   DW_AT_type        : <0xf2f73>
