 <2><b0cd5>: Abbrev Number: 2 (DW_TAG_member)
    <b0cd6>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
    <b0cda>   DW_AT_decl_file   : 8
    <b0cdb>   DW_AT_decl_line   : 93
    <b0cdc>   DW_AT_decl_column : 25
    <b0cdd>   DW_AT_type        : <0xb0976>
    <b0ce1>   DW_AT_data_member_location: 96
 <2><b0ce2>: Abbrev Number: 2 (DW_TAG_member)
    <b0ce3>   DW_AT_name        : (indirect string, offset: 0x1738e): pfnFlush
    <b0ce7>   DW_AT_decl_file   : 8
    <b0ce8>   DW_AT_decl_line   : 94
    <b0ce9>   DW_AT_decl_column : 25
    <b0cea>   DW_AT_type        : <0xb0c20>
    <b0cee>   DW_AT_data_member_location: 104
 <2><b0cef>: Abbrev Number: 0
 <1><b0cf0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0cf1>   DW_AT_name        : (indirect string, offset: 0x177bb): FB_FILE_HOOKS
    <b0cf5>   DW_AT_decl_file   : 8
    <b0cf6>   DW_AT_decl_line   : 95
    <b0cf7>   DW_AT_decl_column : 3
    <b0cf8>   DW_AT_type        : <0xb0c2c>
 <1><b0cfc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0cfd>   DW_AT_byte_size   : 8
    <b0cfd>   DW_AT_type        : <0xb0cf0>
 <1><b0d01>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0d02>   DW_AT_name        : (indirect string, offset: 0x170c3): FB_FILE
    <b0d06>   DW_AT_decl_file   : 8
    <b0d07>   DW_AT_decl_line   : 117
    <b0d08>   DW_AT_decl_column : 3
    <b0d09>   DW_AT_type        : <0xb09a0>
 <1><b0d0d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0d0e>   DW_AT_byte_size   : 8
    <b0d0e>   DW_AT_type        : <0xb0d01>
 <1><b0d12>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b0d13>   DW_AT_byte_size   : 8
    <b0d14>   DW_AT_decl_file   : 9
    <b0d14>   DW_AT_decl_line   : 4
    <b0d15>   DW_AT_decl_column : 3
    <b0d15>   DW_AT_sibling     : <0xb0d34>
 <2><b0d19>: Abbrev Number: 2 (DW_TAG_member)
    <b0d1a>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <b0d1e>   DW_AT_decl_file   : 9
    <b0d1f>   DW_AT_decl_line   : 5
    <b0d20>   DW_AT_decl_column : 8
    <b0d21>   DW_AT_type        : <0xb07b6>
    <b0d25>   DW_AT_data_member_location: 0
 <2><b0d26>: Abbrev Number: 2 (DW_TAG_member)
    <b0d27>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <b0d2b>   DW_AT_decl_file   : 9
    <b0d2c>   DW_AT_decl_line   : 6
    <b0d2d>   DW_AT_decl_column : 8
    <b0d2e>   DW_AT_type        : <0xb07b6>
    <b0d32>   DW_AT_data_member_location: 4
 <2><b0d33>: Abbrev Number: 0
 <1><b0d34>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b0d35>   DW_AT_byte_size   : 16
    <b0d36>   DW_AT_decl_file   : 9
    <b0d36>   DW_AT_decl_line   : 8
    <b0d37>   DW_AT_decl_column : 3
    <b0d37>   DW_AT_sibling     : <0xb0d6a>
 <2><b0d3b>: Abbrev Number: 10 (DW_TAG_member)
    <b0d3c>   DW_AT_name        : x
    <b0d3e>   DW_AT_decl_file   : 9
    <b0d3f>   DW_AT_decl_line   : 9
    <b0d40>   DW_AT_decl_column : 8
    <b0d41>   DW_AT_type        : <0xb07b6>
    <b0d45>   DW_AT_data_member_location: 0
 <2><b0d46>: Abbrev Number: 10 (DW_TAG_member)
    <b0d47>   DW_AT_name        : y
    <b0d49>   DW_AT_decl_file   : 9
    <b0d4a>   DW_AT_decl_line   : 9
    <b0d4b>   DW_AT_decl_column : 11
    <b0d4c>   DW_AT_type        : <0xb07b6>
    <b0d50>   DW_AT_data_member_location: 4
 <2><b0d51>: Abbrev Number: 10 (DW_TAG_member)
    <b0d52>   DW_AT_name        : dx
    <b0d55>   DW_AT_decl_file   : 9
    <b0d56>   DW_AT_decl_line   : 10
    <b0d57>   DW_AT_decl_column : 8
    <b0d58>   DW_AT_type        : <0xb07b6>
    <b0d5c>   DW_AT_data_member_location: 8
 <2><b0d5d>: Abbrev Number: 10 (DW_TAG_member)
    <b0d5e>   DW_AT_name        : dy
    <b0d61>   DW_AT_decl_file   : 9
    <b0d62>   DW_AT_decl_line   : 10
    <b0d63>   DW_AT_decl_column : 12
    <b0d64>   DW_AT_type        : <0xb07b6>
    <b0d68>   DW_AT_data_member_location: 12
 <2><b0d69>: Abbrev Number: 0
 <1><b0d6a>: Abbrev Number: 40 (DW_TAG_union_type)
    <b0d6b>   DW_AT_byte_size   : 16
    <b0d6c>   DW_AT_decl_file   : 9
    <b0d6d>   DW_AT_decl_line   : 3
    <b0d6e>   DW_AT_decl_column : 2
    <b0d6f>   DW_AT_sibling     : <0xb0d9a>
 <2><b0d73>: Abbrev Number: 26 (DW_TAG_member)
    <b0d74>   DW_AT_type        : <0xb0d12>
 <2><b0d78>: Abbrev Number: 26 (DW_TAG_member)
    <b0d79>   DW_AT_type        : <0xb0d34>
 <2><b0d7d>: Abbrev Number: 41 (DW_TAG_member)
    <b0d7e>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <b0d82>   DW_AT_decl_file   : 9
    <b0d83>   DW_AT_decl_line   : 12
    <b0d84>   DW_AT_decl_column : 7
    <b0d85>   DW_AT_type        : <0xb07b6>
 <2><b0d89>: Abbrev Number: 27 (DW_TAG_member)
    <b0d8a>   DW_AT_name        : z
    <b0d8c>   DW_AT_decl_file   : 9
    <b0d8c>   DW_AT_decl_line   : 13
    <b0d8d>   DW_AT_decl_column : 7
    <b0d8d>   DW_AT_type        : <0xb07b6>
 <2><b0d91>: Abbrev Number: 27 (DW_TAG_member)
    <b0d92>   DW_AT_name        : w
    <b0d94>   DW_AT_decl_file   : 9
    <b0d94>   DW_AT_decl_line   : 14
    <b0d95>   DW_AT_decl_column : 7
    <b0d95>   DW_AT_type        : <0xb07b6>
 <2><b0d99>: Abbrev Number: 0
 <1><b0d9a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b0d9b>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <b0d9f>   DW_AT_byte_size   : 20
    <b0da0>   DW_AT_decl_file   : 9
    <b0da1>   DW_AT_decl_line   : 1
    <b0da2>   DW_AT_decl_column : 8
    <b0da3>   DW_AT_sibling     : <0xb0dbb>
 <2><b0da7>: Abbrev Number: 2 (DW_TAG_member)
    <b0da8>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b0dac>   DW_AT_decl_file   : 9
    <b0dad>   DW_AT_decl_line   : 2
    <b0dae>   DW_AT_decl_column : 6
    <b0daf>   DW_AT_type        : <0xb07b6>
    <b0db3>   DW_AT_data_member_location: 0
 <2><b0db4>: Abbrev Number: 42 (DW_TAG_member)
    <b0db5>   DW_AT_type        : <0xb0d6a>
    <b0db9>   DW_AT_data_member_location: 4
 <2><b0dba>: Abbrev Number: 0
 <1><b0dbb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0dbc>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <b0dc0>   DW_AT_decl_file   : 9
    <b0dc1>   DW_AT_decl_line   : 18
    <b0dc2>   DW_AT_decl_column : 23
    <b0dc3>   DW_AT_type        : <0xb0d9a>
 <1><b0dc7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0dc8>   DW_AT_name        : (indirect string, offset: 0x174e9): FB_INKEYPROC
    <b0dcc>   DW_AT_decl_file   : 10
    <b0dcd>   DW_AT_decl_line   : 1
    <b0dce>   DW_AT_decl_column : 23
    <b0dcf>   DW_AT_type        : <0xb0dd3>
 <1><b0dd3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0dd4>   DW_AT_byte_size   : 8
    <b0dd4>   DW_AT_type        : <0xb0dd8>
 <1><b0dd8>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <b0dd9>   DW_AT_prototyped  : 1
    <b0dd9>   DW_AT_type        : <0xb0bf1>
 <1><b0ddd>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0dde>   DW_AT_name        : (indirect string, offset: 0x17287): FB_GETKEYPROC
    <b0de2>   DW_AT_decl_file   : 10
    <b0de3>   DW_AT_decl_line   : 2
    <b0de4>   DW_AT_decl_column : 23
    <b0de5>   DW_AT_type        : <0xb0de9>
 <1><b0de9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0dea>   DW_AT_byte_size   : 8
    <b0dea>   DW_AT_type        : <0xb0dee>
 <1><b0dee>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <b0def>   DW_AT_prototyped  : 1
    <b0def>   DW_AT_type        : <0xb07b6>
 <1><b0df3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0df4>   DW_AT_name        : (indirect string, offset: 0x178bc): FB_KEYHITPROC
    <b0df8>   DW_AT_decl_file   : 10
    <b0df9>   DW_AT_decl_line   : 3
    <b0dfa>   DW_AT_decl_column : 23
    <b0dfb>   DW_AT_type        : <0xb0de9>
 <1><b0dff>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e00>   DW_AT_name        : (indirect string, offset: 0x175e0): FB_CLSPROC
    <b0e04>   DW_AT_decl_file   : 10
    <b0e05>   DW_AT_decl_line   : 10
    <b0e06>   DW_AT_decl_column : 23
    <b0e07>   DW_AT_type        : <0xb0e0b>
 <1><b0e0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0e0c>   DW_AT_byte_size   : 8
    <b0e0c>   DW_AT_type        : <0xb0e10>
 <1><b0e10>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b0e11>   DW_AT_prototyped  : 1
    <b0e11>   DW_AT_sibling     : <0xb0e1b>
 <2><b0e15>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e16>   DW_AT_type        : <0xb07b6>
 <2><b0e1a>: Abbrev Number: 0
 <1><b0e1b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e1c>   DW_AT_name        : (indirect string, offset: 0x171ea): FB_COLORPROC
    <b0e20>   DW_AT_decl_file   : 10
    <b0e21>   DW_AT_decl_line   : 14
    <b0e22>   DW_AT_decl_column : 23
    <b0e23>   DW_AT_type        : <0xb0e27>
 <1><b0e27>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0e28>   DW_AT_byte_size   : 8
    <b0e28>   DW_AT_type        : <0xb0e2c>
 <1><b0e2c>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0e2d>   DW_AT_prototyped  : 1
    <b0e2d>   DW_AT_type        : <0xb07b6>
    <b0e31>   DW_AT_sibling     : <0xb0e45>
 <2><b0e35>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e36>   DW_AT_type        : <0xb07b6>
 <2><b0e3a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e3b>   DW_AT_type        : <0xb07b6>
 <2><b0e3f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e40>   DW_AT_type        : <0xb07b6>
 <2><b0e44>: Abbrev Number: 0
 <1><b0e45>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e46>   DW_AT_name        : (indirect string, offset: 0x175fc): FB_LOCATEPROC
    <b0e4a>   DW_AT_decl_file   : 10
    <b0e4b>   DW_AT_decl_line   : 18
    <b0e4c>   DW_AT_decl_column : 23
    <b0e4d>   DW_AT_type        : <0xb0e27>
 <1><b0e51>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e52>   DW_AT_name        : (indirect string, offset: 0x175b0): FB_VIEWUPDATEPROC
    <b0e56>   DW_AT_decl_file   : 10
    <b0e57>   DW_AT_decl_line   : 24
    <b0e58>   DW_AT_decl_column : 23
    <b0e59>   DW_AT_type        : <0xb08d7>
 <1><b0e5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e5e>   DW_AT_name        : (indirect string, offset: 0x16ea8): FB_WIDTHPROC
    <b0e62>   DW_AT_decl_file   : 10
    <b0e63>   DW_AT_decl_line   : 28
    <b0e64>   DW_AT_decl_column : 23
    <b0e65>   DW_AT_type        : <0xb0e69>
 <1><b0e69>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0e6a>   DW_AT_byte_size   : 8
    <b0e6a>   DW_AT_type        : <0xb0e6e>
 <1><b0e6e>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0e6f>   DW_AT_prototyped  : 1
    <b0e6f>   DW_AT_type        : <0xb07b6>
    <b0e73>   DW_AT_sibling     : <0xb0e82>
 <2><b0e77>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e78>   DW_AT_type        : <0xb07b6>
 <2><b0e7c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0e7d>   DW_AT_type        : <0xb07b6>
 <2><b0e81>: Abbrev Number: 0
 <1><b0e82>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e83>   DW_AT_name        : (indirect string, offset: 0x16f88): FB_GETXPROC
    <b0e87>   DW_AT_decl_file   : 10
    <b0e88>   DW_AT_decl_line   : 34
    <b0e89>   DW_AT_decl_column : 23
    <b0e8a>   DW_AT_type        : <0xb0de9>
 <1><b0e8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e8f>   DW_AT_name        : (indirect string, offset: 0x17705): FB_GETYPROC
    <b0e93>   DW_AT_decl_file   : 10
    <b0e94>   DW_AT_decl_line   : 35
    <b0e95>   DW_AT_decl_column : 23
    <b0e96>   DW_AT_type        : <0xb0de9>
 <1><b0e9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0e9b>   DW_AT_name        : (indirect string, offset: 0x171ff): FB_GETXYPROC
    <b0e9f>   DW_AT_decl_file   : 10
    <b0ea0>   DW_AT_decl_line   : 36
    <b0ea1>   DW_AT_decl_column : 23
    <b0ea2>   DW_AT_type        : <0xb0ea6>
 <1><b0ea6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0ea7>   DW_AT_byte_size   : 8
    <b0ea7>   DW_AT_type        : <0xb0eab>
 <1><b0eab>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b0eac>   DW_AT_prototyped  : 1
    <b0eac>   DW_AT_sibling     : <0xb0ebb>
 <2><b0eb0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0eb1>   DW_AT_type        : <0xb0ebb>
 <2><b0eb5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0eb6>   DW_AT_type        : <0xb0ebb>
 <2><b0eba>: Abbrev Number: 0
 <1><b0ebb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0ebc>   DW_AT_byte_size   : 8
    <b0ebc>   DW_AT_type        : <0xb07b6>
 <1><b0ec0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0ec1>   DW_AT_name        : (indirect string, offset: 0x173df): FB_GETSIZEPROC
    <b0ec5>   DW_AT_decl_file   : 10
    <b0ec6>   DW_AT_decl_line   : 37
    <b0ec7>   DW_AT_decl_column : 23
    <b0ec8>   DW_AT_type        : <0xb0ea6>
 <1><b0ecc>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0ecd>   DW_AT_name        : (indirect string, offset: 0x17645): FB_READXYPROC
    <b0ed1>   DW_AT_decl_file   : 10
    <b0ed2>   DW_AT_decl_line   : 45
    <b0ed3>   DW_AT_decl_column : 24
    <b0ed4>   DW_AT_type        : <0xb0ed8>
 <1><b0ed8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0ed9>   DW_AT_byte_size   : 8
    <b0ed9>   DW_AT_type        : <0xb0edd>
 <1><b0edd>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0ede>   DW_AT_prototyped  : 1
    <b0ede>   DW_AT_type        : <0xb079a>
    <b0ee2>   DW_AT_sibling     : <0xb0ef6>
 <2><b0ee6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0ee7>   DW_AT_type        : <0xb07b6>
 <2><b0eeb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0eec>   DW_AT_type        : <0xb07b6>
 <2><b0ef0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0ef1>   DW_AT_type        : <0xb07b6>
 <2><b0ef5>: Abbrev Number: 0
 <1><b0ef6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0ef7>   DW_AT_name        : (indirect string, offset: 0x173af): FB_PRINTBUFFPROC
    <b0efb>   DW_AT_decl_file   : 10
    <b0efc>   DW_AT_decl_line   : 48
    <b0efd>   DW_AT_decl_column : 23
    <b0efe>   DW_AT_type        : <0xb0f02>
 <1><b0f02>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0f03>   DW_AT_byte_size   : 8
    <b0f03>   DW_AT_type        : <0xb0f07>
 <1><b0f07>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b0f08>   DW_AT_prototyped  : 1
    <b0f08>   DW_AT_sibling     : <0xb0f1c>
 <2><b0f0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f0d>   DW_AT_type        : <0xb083e>
 <2><b0f11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f12>   DW_AT_type        : <0xb07ea>
 <2><b0f16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f17>   DW_AT_type        : <0xb07b6>
 <2><b0f1b>: Abbrev Number: 0
 <1><b0f1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0f1d>   DW_AT_name        : (indirect string, offset: 0x17002): FB_PRINTBUFFWPROC
    <b0f21>   DW_AT_decl_file   : 10
    <b0f22>   DW_AT_decl_line   : 49
    <b0f23>   DW_AT_decl_column : 23
    <b0f24>   DW_AT_type        : <0xb0f28>
 <1><b0f28>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0f29>   DW_AT_byte_size   : 8
    <b0f29>   DW_AT_type        : <0xb0f2d>
 <1><b0f2d>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b0f2e>   DW_AT_prototyped  : 1
    <b0f2e>   DW_AT_sibling     : <0xb0f42>
 <2><b0f32>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f33>   DW_AT_type        : <0xb0b91>
 <2><b0f37>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f38>   DW_AT_type        : <0xb07ea>
 <2><b0f3c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f3d>   DW_AT_type        : <0xb07b6>
 <2><b0f41>: Abbrev Number: 0
 <1><b0f42>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0f43>   DW_AT_name        : (indirect string, offset: 0x16fa8): FB_READSTRPROC
    <b0f47>   DW_AT_decl_file   : 10
    <b0f48>   DW_AT_decl_line   : 51
    <b0f49>   DW_AT_decl_column : 24
    <b0f4a>   DW_AT_type        : <0xb0f4e>
 <1><b0f4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0f4f>   DW_AT_byte_size   : 8
    <b0f4f>   DW_AT_type        : <0xb0f53>
 <1><b0f53>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0f54>   DW_AT_prototyped  : 1
    <b0f54>   DW_AT_type        : <0xb07de>
    <b0f58>   DW_AT_sibling     : <0xb0f67>
 <2><b0f5c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f5d>   DW_AT_type        : <0xb07de>
 <2><b0f61>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f62>   DW_AT_type        : <0xb081b>
 <2><b0f66>: Abbrev Number: 0
 <1><b0f67>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0f68>   DW_AT_name        : (indirect string, offset: 0x178ab): FB_LINEINPUTPROC
    <b0f6c>   DW_AT_decl_file   : 10
    <b0f6d>   DW_AT_decl_line   : 54
    <b0f6e>   DW_AT_decl_column : 23
    <b0f6f>   DW_AT_type        : <0xb0f73>
 <1><b0f73>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0f74>   DW_AT_byte_size   : 8
    <b0f74>   DW_AT_type        : <0xb0f78>
 <1><b0f78>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0f79>   DW_AT_prototyped  : 1
    <b0f79>   DW_AT_type        : <0xb07b6>
    <b0f7d>   DW_AT_sibling     : <0xb0fa0>
 <2><b0f81>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f82>   DW_AT_type        : <0xb0bf1>
 <2><b0f86>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f87>   DW_AT_type        : <0xb07d0>
 <2><b0f8b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f8c>   DW_AT_type        : <0xb081b>
 <2><b0f90>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f91>   DW_AT_type        : <0xb07b6>
 <2><b0f95>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f96>   DW_AT_type        : <0xb07b6>
 <2><b0f9a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0f9b>   DW_AT_type        : <0xb07b6>
 <2><b0f9f>: Abbrev Number: 0
 <1><b0fa0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0fa1>   DW_AT_name        : (indirect string, offset: 0x172f4): FB_LINEINPUTWPROC
    <b0fa5>   DW_AT_decl_file   : 10
    <b0fa6>   DW_AT_decl_line   : 56
    <b0fa7>   DW_AT_decl_column : 23
    <b0fa8>   DW_AT_type        : <0xb0fac>
 <1><b0fac>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0fad>   DW_AT_byte_size   : 8
    <b0fad>   DW_AT_type        : <0xb0fb1>
 <1><b0fb1>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0fb2>   DW_AT_prototyped  : 1
    <b0fb2>   DW_AT_type        : <0xb07b6>
    <b0fb6>   DW_AT_sibling     : <0xb0fd4>
 <2><b0fba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fbb>   DW_AT_type        : <0xb0b91>
 <2><b0fbf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fc0>   DW_AT_type        : <0xb093d>
 <2><b0fc4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fc5>   DW_AT_type        : <0xb081b>
 <2><b0fc9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fca>   DW_AT_type        : <0xb07b6>
 <2><b0fce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fcf>   DW_AT_type        : <0xb07b6>
 <2><b0fd3>: Abbrev Number: 0
 <1><b0fd4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0fd5>   DW_AT_name        : (indirect string, offset: 0x17815): FB_MULTIKEYPROC
    <b0fd9>   DW_AT_decl_file   : 10
    <b0fda>   DW_AT_decl_line   : 67
    <b0fdb>   DW_AT_decl_column : 23
    <b0fdc>   DW_AT_type        : <0xb0fe0>
 <1><b0fe0>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b0fe1>   DW_AT_byte_size   : 8
    <b0fe1>   DW_AT_type        : <0xb0fe5>
 <1><b0fe5>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b0fe6>   DW_AT_prototyped  : 1
    <b0fe6>   DW_AT_type        : <0xb07b6>
    <b0fea>   DW_AT_sibling     : <0xb0ff4>
 <2><b0fee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0fef>   DW_AT_type        : <0xb07b6>
 <2><b0ff3>: Abbrev Number: 0
 <1><b0ff4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b0ff5>   DW_AT_name        : (indirect string, offset: 0x177f6): FB_GETMOUSEPROC
    <b0ff9>   DW_AT_decl_file   : 10
    <b0ffa>   DW_AT_decl_line   : 68
    <b0ffb>   DW_AT_decl_column : 23
    <b0ffc>   DW_AT_type        : <0xb1000>
 <1><b1000>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1001>   DW_AT_byte_size   : 8
    <b1001>   DW_AT_type        : <0xb1005>
 <1><b1005>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b1006>   DW_AT_prototyped  : 1
    <b1006>   DW_AT_type        : <0xb07b6>
    <b100a>   DW_AT_sibling     : <0xb1028>
 <2><b100e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b100f>   DW_AT_type        : <0xb0ebb>
 <2><b1013>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1014>   DW_AT_type        : <0xb0ebb>
 <2><b1018>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1019>   DW_AT_type        : <0xb0ebb>
 <2><b101d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b101e>   DW_AT_type        : <0xb0ebb>
 <2><b1022>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1023>   DW_AT_type        : <0xb0ebb>
 <2><b1027>: Abbrev Number: 0
 <1><b1028>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1029>   DW_AT_name        : (indirect string, offset: 0x17786): FB_SETMOUSEPROC
    <b102d>   DW_AT_decl_file   : 10
    <b102e>   DW_AT_decl_line   : 69
    <b102f>   DW_AT_decl_column : 23
    <b1030>   DW_AT_type        : <0xb1034>
 <1><b1034>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1035>   DW_AT_byte_size   : 8
    <b1035>   DW_AT_type        : <0xb1039>
 <1><b1039>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b103a>   DW_AT_prototyped  : 1
    <b103a>   DW_AT_type        : <0xb07b6>
    <b103e>   DW_AT_sibling     : <0xb1057>
 <2><b1042>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1043>   DW_AT_type        : <0xb07b6>
 <2><b1047>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1048>   DW_AT_type        : <0xb07b6>
 <2><b104c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b104d>   DW_AT_type        : <0xb07b6>
 <2><b1051>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1052>   DW_AT_type        : <0xb07b6>
 <2><b1056>: Abbrev Number: 0
 <1><b1057>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1058>   DW_AT_name        : (indirect string, offset: 0x1772c): FB_INPROC
    <b105c>   DW_AT_decl_file   : 10
    <b105d>   DW_AT_decl_line   : 73
    <b105e>   DW_AT_decl_column : 23
    <b105f>   DW_AT_type        : <0xb1063>
 <1><b1063>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1064>   DW_AT_byte_size   : 8
    <b1064>   DW_AT_type        : <0xb1068>
 <1><b1068>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b1069>   DW_AT_prototyped  : 1
    <b1069>   DW_AT_type        : <0xb07b6>
    <b106d>   DW_AT_sibling     : <0xb1077>
 <2><b1071>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1072>   DW_AT_type        : <0xb0793>
 <2><b1076>: Abbrev Number: 0
 <1><b1077>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1078>   DW_AT_name        : (indirect string, offset: 0x17460): FB_OUTPROC
    <b107c>   DW_AT_decl_file   : 10
    <b107d>   DW_AT_decl_line   : 74
    <b107e>   DW_AT_decl_column : 23
    <b107f>   DW_AT_type        : <0xb1083>
 <1><b1083>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1084>   DW_AT_byte_size   : 8
    <b1084>   DW_AT_type        : <0xb1088>
 <1><b1088>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <b1089>   DW_AT_prototyped  : 1
    <b1089>   DW_AT_type        : <0xb07b6>
    <b108d>   DW_AT_sibling     : <0xb109c>
 <2><b1091>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1092>   DW_AT_type        : <0xb0793>
 <2><b1096>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1097>   DW_AT_type        : <0xb078c>
 <2><b109b>: Abbrev Number: 0
 <1><b109c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b109d>   DW_AT_name        : (indirect string, offset: 0x174a7): FB_SLEEPPROC
    <b10a1>   DW_AT_decl_file   : 10
    <b10a2>   DW_AT_decl_line   : 80
    <b10a3>   DW_AT_decl_column : 23
    <b10a4>   DW_AT_type        : <0xb0e0b>
 <1><b10a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b10a9>   DW_AT_name        : (indirect string, offset: 0x17026): FB_ISREDIRPROC
    <b10ad>   DW_AT_decl_file   : 10
    <b10ae>   DW_AT_decl_line   : 83
    <b10af>   DW_AT_decl_column : 23
    <b10b0>   DW_AT_type        : <0xb0fe0>
 <1><b10b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b10b5>   DW_AT_name        : (indirect string, offset: 0x17635): FB_PAGECOPYPROC
    <b10b9>   DW_AT_decl_file   : 10
    <b10ba>   DW_AT_decl_line   : 86
    <b10bb>   DW_AT_decl_column : 23
    <b10bc>   DW_AT_type        : <0xb0e69>
 <1><b10c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b10c1>   DW_AT_name        : (indirect string, offset: 0x176db): FB_PAGESETPROC
    <b10c5>   DW_AT_decl_file   : 10
    <b10c6>   DW_AT_decl_line   : 89
    <b10c7>   DW_AT_decl_column : 23
    <b10c8>   DW_AT_type        : <0xb0e69>
 <1><b10cc>: Abbrev Number: 3 (DW_TAG_typedef)
    <b10cd>   DW_AT_name        : (indirect string, offset: 0x16f50): FB_POSTEVENTPROC
    <b10d1>   DW_AT_decl_file   : 10
    <b10d2>   DW_AT_decl_line   : 91
    <b10d3>   DW_AT_decl_column : 23
    <b10d4>   DW_AT_type        : <0xb10d8>
 <1><b10d8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b10d9>   DW_AT_byte_size   : 8
    <b10d9>   DW_AT_type        : <0xb10dd>
 <1><b10dd>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <b10de>   DW_AT_prototyped  : 1
    <b10de>   DW_AT_sibling     : <0xb10e8>
 <2><b10e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b10e3>   DW_AT_type        : <0xb10e8>
 <2><b10e7>: Abbrev Number: 0
 <1><b10e8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b10e9>   DW_AT_byte_size   : 8
    <b10e9>   DW_AT_type        : <0xb0dbb>
 <1><b10ed>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b10ee>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b10f2>   DW_AT_byte_size   : 224
    <b10f3>   DW_AT_decl_file   : 10
    <b10f4>   DW_AT_decl_line   : 93
    <b10f5>   DW_AT_decl_column : 16
    <b10f6>   DW_AT_sibling     : <0xb1267>
 <2><b10fa>: Abbrev Number: 2 (DW_TAG_member)
    <b10fb>   DW_AT_name        : (indirect string, offset: 0x170fb): inkeyproc
    <b10ff>   DW_AT_decl_file   : 10
    <b1100>   DW_AT_decl_line   : 94
    <b1101>   DW_AT_decl_column : 23
    <b1102>   DW_AT_type        : <0xb0dc7>
    <b1106>   DW_AT_data_member_location: 0
 <2><b1107>: Abbrev Number: 2 (DW_TAG_member)
    <b1108>   DW_AT_name        : (indirect string, offset: 0x17563): getkeyproc
    <b110c>   DW_AT_decl_file   : 10
    <b110d>   DW_AT_decl_line   : 95
    <b110e>   DW_AT_decl_column : 23
    <b110f>   DW_AT_type        : <0xb0ddd>
    <b1113>   DW_AT_data_member_location: 8
 <2><b1114>: Abbrev Number: 2 (DW_TAG_member)
    <b1115>   DW_AT_name        : (indirect string, offset: 0x17721): keyhitproc
    <b1119>   DW_AT_decl_file   : 10
    <b111a>   DW_AT_decl_line   : 96
    <b111b>   DW_AT_decl_column : 23
    <b111c>   DW_AT_type        : <0xb0df3>
    <b1120>   DW_AT_data_member_location: 16
 <2><b1121>: Abbrev Number: 2 (DW_TAG_member)
    <b1122>   DW_AT_name        : (indirect string, offset: 0x170a4): clsproc
    <b1126>   DW_AT_decl_file   : 10
    <b1127>   DW_AT_decl_line   : 97
    <b1128>   DW_AT_decl_column : 23
    <b1129>   DW_AT_type        : <0xb0dff>
    <b112d>   DW_AT_data_member_location: 24
 <2><b112e>: Abbrev Number: 2 (DW_TAG_member)
    <b112f>   DW_AT_name        : (indirect string, offset: 0x17520): colorproc
    <b1133>   DW_AT_decl_file   : 10
    <b1134>   DW_AT_decl_line   : 98
    <b1135>   DW_AT_decl_column : 23
    <b1136>   DW_AT_type        : <0xb0e1b>
    <b113a>   DW_AT_data_member_location: 32
 <2><b113b>: Abbrev Number: 2 (DW_TAG_member)
    <b113c>   DW_AT_name        : (indirect string, offset: 0x16e4a): locateproc
    <b1140>   DW_AT_decl_file   : 10
    <b1141>   DW_AT_decl_line   : 99
    <b1142>   DW_AT_decl_column : 23
    <b1143>   DW_AT_type        : <0xb0e45>
    <b1147>   DW_AT_data_member_location: 40
 <2><b1148>: Abbrev Number: 2 (DW_TAG_member)
    <b1149>   DW_AT_name        : (indirect string, offset: 0x170ac): widthproc
    <b114d>   DW_AT_decl_file   : 10
    <b114e>   DW_AT_decl_line   : 100
    <b114f>   DW_AT_decl_column : 23
    <b1150>   DW_AT_type        : <0xb0e5d>
    <b1154>   DW_AT_data_member_location: 48
 <2><b1155>: Abbrev Number: 2 (DW_TAG_member)
    <b1156>   DW_AT_name        : (indirect string, offset: 0x175c2): getxproc
    <b115a>   DW_AT_decl_file   : 10
    <b115b>   DW_AT_decl_line   : 101
    <b115c>   DW_AT_decl_column : 23
    <b115d>   DW_AT_type        : <0xb0e82>
    <b1161>   DW_AT_data_member_location: 56
 <2><b1162>: Abbrev Number: 2 (DW_TAG_member)
    <b1163>   DW_AT_name        : (indirect string, offset: 0x17211): getyproc
    <b1167>   DW_AT_decl_file   : 10
    <b1168>   DW_AT_decl_line   : 102
    <b1169>   DW_AT_decl_column : 23
    <b116a>   DW_AT_type        : <0xb0e8e>
    <b116e>   DW_AT_data_member_location: 64
 <2><b116f>: Abbrev Number: 2 (DW_TAG_member)
    <b1170>   DW_AT_name        : (indirect string, offset: 0x177c9): getxyproc
    <b1174>   DW_AT_decl_file   : 10
    <b1175>   DW_AT_decl_line   : 103
    <b1176>   DW_AT_decl_column : 23
    <b1177>   DW_AT_type        : <0xb0e9a>
    <b117b>   DW_AT_data_member_location: 72
 <2><b117c>: Abbrev Number: 2 (DW_TAG_member)
    <b117d>   DW_AT_name        : (indirect string, offset: 0x1721a): getsizeproc
    <b1181>   DW_AT_decl_file   : 10
    <b1182>   DW_AT_decl_line   : 104
    <b1183>   DW_AT_decl_column : 23
    <b1184>   DW_AT_type        : <0xb0ec0>
    <b1188>   DW_AT_data_member_location: 80
 <2><b1189>: Abbrev Number: 2 (DW_TAG_member)
    <b118a>   DW_AT_name        : (indirect string, offset: 0x16f42): printbuffproc
    <b118e>   DW_AT_decl_file   : 10
    <b118f>   DW_AT_decl_line   : 105
    <b1190>   DW_AT_decl_column : 24
    <b1191>   DW_AT_type        : <0xb0ef6>
    <b1195>   DW_AT_data_member_location: 88
 <2><b1196>: Abbrev Number: 2 (DW_TAG_member)
    <b1197>   DW_AT_name        : (indirect string, offset: 0x17295): printbuffwproc
    <b119b>   DW_AT_decl_file   : 10
    <b119c>   DW_AT_decl_line   : 106
    <b119d>   DW_AT_decl_column : 25
    <b119e>   DW_AT_type        : <0xb0f1c>
    <b11a2>   DW_AT_data_member_location: 96
 <2><b11a3>: Abbrev Number: 2 (DW_TAG_member)
    <b11a4>   DW_AT_name        : (indirect string, offset: 0x16ec0): readstrproc
    <b11a8>   DW_AT_decl_file   : 10
    <b11a9>   DW_AT_decl_line   : 107
    <b11aa>   DW_AT_decl_column : 23
    <b11ab>   DW_AT_type        : <0xb0f42>
    <b11af>   DW_AT_data_member_location: 104
 <2><b11b0>: Abbrev Number: 2 (DW_TAG_member)
    <b11b1>   DW_AT_name        : (indirect string, offset: 0x178e3): multikeyproc
    <b11b5>   DW_AT_decl_file   : 10
    <b11b6>   DW_AT_decl_line   : 108
    <b11b7>   DW_AT_decl_column : 23
    <b11b8>   DW_AT_type        : <0xb0fd4>
    <b11bc>   DW_AT_data_member_location: 112
 <2><b11bd>: Abbrev Number: 2 (DW_TAG_member)
    <b11be>   DW_AT_name        : (indirect string, offset: 0x17662): getmouseproc
    <b11c2>   DW_AT_decl_file   : 10
    <b11c3>   DW_AT_decl_line   : 109
    <b11c4>   DW_AT_decl_column : 23
    <b11c5>   DW_AT_type        : <0xb0ff4>
    <b11c9>   DW_AT_data_member_location: 120
 <2><b11ca>: Abbrev Number: 2 (DW_TAG_member)
    <b11cb>   DW_AT_name        : (indirect string, offset: 0x1783b): setmouseproc
    <b11cf>   DW_AT_decl_file   : 10
    <b11d0>   DW_AT_decl_line   : 110
    <b11d1>   DW_AT_decl_column : 23
    <b11d2>   DW_AT_type        : <0xb1028>
    <b11d6>   DW_AT_data_member_location: 128
 <2><b11d7>: Abbrev Number: 2 (DW_TAG_member)
    <b11d8>   DW_AT_name        : (indirect string, offset: 0x16ee2): inproc
    <b11dc>   DW_AT_decl_file   : 10
    <b11dd>   DW_AT_decl_line   : 111
    <b11de>   DW_AT_decl_column : 23
    <b11df>   DW_AT_type        : <0xb1057>
    <b11e3>   DW_AT_data_member_location: 136
 <2><b11e4>: Abbrev Number: 2 (DW_TAG_member)
    <b11e5>   DW_AT_name        : (indirect string, offset: 0x17321): outproc
    <b11e9>   DW_AT_decl_file   : 10
    <b11ea>   DW_AT_decl_line   : 112
    <b11eb>   DW_AT_decl_column : 23
    <b11ec>   DW_AT_type        : <0xb1077>
    <b11f0>   DW_AT_data_member_location: 144
 <2><b11f1>: Abbrev Number: 2 (DW_TAG_member)
    <b11f2>   DW_AT_name        : (indirect string, offset: 0x17306): viewupdateproc
    <b11f6>   DW_AT_decl_file   : 10
    <b11f7>   DW_AT_decl_line   : 113
    <b11f8>   DW_AT_decl_column : 25
    <b11f9>   DW_AT_type        : <0xb0e51>
    <b11fd>   DW_AT_data_member_location: 152
 <2><b11fe>: Abbrev Number: 2 (DW_TAG_member)
    <b11ff>   DW_AT_name        : (indirect string, offset: 0x1748f): lineinputproc
    <b1203>   DW_AT_decl_file   : 10
    <b1204>   DW_AT_decl_line   : 114
    <b1205>   DW_AT_decl_column : 24
    <b1206>   DW_AT_type        : <0xb0f67>
    <b120a>   DW_AT_data_member_location: 160
 <2><b120b>: Abbrev Number: 2 (DW_TAG_member)
    <b120c>   DW_AT_name        : (indirect string, offset: 0x17653): lineinputwproc
    <b1210>   DW_AT_decl_file   : 10
    <b1211>   DW_AT_decl_line   : 115
    <b1212>   DW_AT_decl_column : 25
    <b1213>   DW_AT_type        : <0xb0fa0>
    <b1217>   DW_AT_data_member_location: 168
 <2><b1218>: Abbrev Number: 2 (DW_TAG_member)
    <b1219>   DW_AT_name        : (indirect string, offset: 0x172c0): readxyproc
    <b121d>   DW_AT_decl_file   : 10
    <b121e>   DW_AT_decl_line   : 116
    <b121f>   DW_AT_decl_column : 23
    <b1220>   DW_AT_type        : <0xb0ecc>
    <b1224>   DW_AT_data_member_location: 176
 <2><b1225>: Abbrev Number: 2 (DW_TAG_member)
    <b1226>   DW_AT_name        : (indirect string, offset: 0x177ec): sleepproc
    <b122a>   DW_AT_decl_file   : 10
    <b122b>   DW_AT_decl_line   : 117
    <b122c>   DW_AT_decl_column : 23
    <b122d>   DW_AT_type        : <0xb109c>
    <b1231>   DW_AT_data_member_location: 184
 <2><b1232>: Abbrev Number: 2 (DW_TAG_member)
    <b1233>   DW_AT_name        : (indirect string, offset: 0x16f94): isredirproc
    <b1237>   DW_AT_decl_file   : 10
    <b1238>   DW_AT_decl_line   : 118
    <b1239>   DW_AT_decl_column : 22
    <b123a>   DW_AT_type        : <0xb10a8>
    <b123e>   DW_AT_data_member_location: 192
 <2><b123f>: Abbrev Number: 2 (DW_TAG_member)
    <b1240>   DW_AT_name        : (indirect string, offset: 0x1757a): pagecopyproc
    <b1244>   DW_AT_decl_file   : 10
    <b1245>   DW_AT_decl_line   : 119
    <b1246>   DW_AT_decl_column : 23
    <b1247>   DW_AT_type        : <0xb10b4>
    <b124b>   DW_AT_data_member_location: 200
 <2><b124c>: Abbrev Number: 2 (DW_TAG_member)
    <b124d>   DW_AT_name        : (indirect string, offset: 0x1760a): pagesetproc
    <b1251>   DW_AT_decl_file   : 10
    <b1252>   DW_AT_decl_line   : 120
    <b1253>   DW_AT_decl_column : 22
    <b1254>   DW_AT_type        : <0xb10c0>
    <b1258>   DW_AT_data_member_location: 208
 <2><b1259>: Abbrev Number: 2 (DW_TAG_member)
    <b125a>   DW_AT_name        : (indirect string, offset: 0x16f6c): posteventproc
    <b125e>   DW_AT_decl_file   : 10
    <b125f>   DW_AT_decl_line   : 121
    <b1260>   DW_AT_decl_column : 23
    <b1261>   DW_AT_type        : <0xb10cc>
    <b1265>   DW_AT_data_member_location: 216
 <2><b1266>: Abbrev Number: 0
 <1><b1267>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1268>   DW_AT_name        : (indirect string, offset: 0x16e62): FB_HOOKSTB
    <b126c>   DW_AT_decl_file   : 10
    <b126d>   DW_AT_decl_line   : 122
    <b126e>   DW_AT_decl_column : 3
    <b126f>   DW_AT_type        : <0xb10ed>
 <1><b1273>: Abbrev Number: 43 (DW_TAG_structure_type)
    <b1274>   DW_AT_name        : (indirect string, offset: 0x17329): FB_RTLIB_CTX_
    <b1278>   DW_AT_byte_size   : 20848
    <b127a>   DW_AT_decl_file   : 11
    <b127b>   DW_AT_decl_line   : 349
    <b127d>   DW_AT_decl_column : 16
    <b127e>   DW_AT_sibling     : <0xb12f3>
 <2><b1282>: Abbrev Number: 14 (DW_TAG_member)
    <b1283>   DW_AT_name        : (indirect string, offset: 0x17479): argc
    <b1287>   DW_AT_decl_file   : 11
    <b1287>   DW_AT_decl_line   : 350
    <b1289>   DW_AT_decl_column : 18
    <b1289>   DW_AT_type        : <0xb07b6>
    <b128d>   DW_AT_data_member_location: 0
 <2><b128e>: Abbrev Number: 14 (DW_TAG_member)
    <b128f>   DW_AT_name        : (indirect string, offset: 0x1720c): argv
    <b1293>   DW_AT_decl_file   : 11
    <b1293>   DW_AT_decl_line   : 351
    <b1295>   DW_AT_decl_column : 18
    <b1295>   DW_AT_type        : <0xb0844>
    <b1299>   DW_AT_data_member_location: 8
 <2><b129a>: Abbrev Number: 14 (DW_TAG_member)
    <b129b>   DW_AT_name        : (indirect string, offset: 0x17880): null_desc
    <b129f>   DW_AT_decl_file   : 11
    <b129f>   DW_AT_decl_line   : 352
    <b12a1>   DW_AT_decl_column : 18
    <b12a1>   DW_AT_type        : <0xb0923>
    <b12a5>   DW_AT_data_member_location: 16
 <2><b12a6>: Abbrev Number: 14 (DW_TAG_member)
    <b12a7>   DW_AT_name        : (indirect string, offset: 0x17378): errmsg
    <b12ab>   DW_AT_decl_file   : 11
    <b12ab>   DW_AT_decl_line   : 353
    <b12ad>   DW_AT_decl_column : 18
    <b12ad>   DW_AT_type        : <0xb07de>
    <b12b1>   DW_AT_data_member_location: 40
 <2><b12b2>: Abbrev Number: 14 (DW_TAG_member)
    <b12b3>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b12b7>   DW_AT_decl_file   : 11
    <b12b7>   DW_AT_decl_line   : 354
    <b12b9>   DW_AT_decl_column : 18
    <b12b9>   DW_AT_type        : <0xb1267>
    <b12bd>   DW_AT_data_member_location: 48
 <2><b12be>: Abbrev Number: 16 (DW_TAG_member)
    <b12bf>   DW_AT_name        : (indirect string, offset: 0x1746b): fileTB
    <b12c3>   DW_AT_decl_file   : 11
    <b12c3>   DW_AT_decl_line   : 355
    <b12c5>   DW_AT_decl_column : 18
    <b12c5>   DW_AT_type        : <0xb12f3>
    <b12c9>   DW_AT_data_member_location: 272
 <2><b12cb>: Abbrev Number: 16 (DW_TAG_member)
    <b12cc>   DW_AT_name        : (indirect string, offset: 0x174b4): do_file_reset
    <b12d0>   DW_AT_decl_file   : 11
    <b12d0>   DW_AT_decl_line   : 356
    <b12d2>   DW_AT_decl_column : 18
    <b12d2>   DW_AT_type        : <0xb07b6>
    <b12d6>   DW_AT_data_member_location: 20832
 <2><b12d8>: Abbrev Number: 16 (DW_TAG_member)
    <b12d9>   DW_AT_name        : (indirect string, offset: 0x1751b): lang
    <b12dd>   DW_AT_decl_file   : 11
    <b12dd>   DW_AT_decl_line   : 357
    <b12df>   DW_AT_decl_column : 18
    <b12df>   DW_AT_type        : <0xb07b6>
    <b12e3>   DW_AT_data_member_location: 20836
 <2><b12e5>: Abbrev Number: 16 (DW_TAG_member)
    <b12e6>   DW_AT_name        : (indirect string, offset: 0x170ee): exit_gfxlib2
    <b12ea>   DW_AT_decl_file   : 11
    <b12ea>   DW_AT_decl_line   : 358
    <b12ec>   DW_AT_decl_column : 18
    <b12ec>   DW_AT_type        : <0xb08d7>
    <b12f0>   DW_AT_data_member_location: 20840
 <2><b12f2>: Abbrev Number: 0
 <1><b12f3>: Abbrev Number: 18 (DW_TAG_array_type)
    <b12f4>   DW_AT_type        : <0xb0d01>
    <b12f8>   DW_AT_sibling     : <0xb1304>
 <2><b12fc>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <b12fd>   DW_AT_type        : <0xb07a1>
    <b1301>   DW_AT_upper_bound : 256
 <2><b1303>: Abbrev Number: 0
 <1><b1304>: Abbrev Number: 23 (DW_TAG_typedef)
    <b1305>   DW_AT_name        : (indirect string, offset: 0x16f35): FB_RTLIB_CTX
    <b1309>   DW_AT_decl_file   : 11
    <b130a>   DW_AT_decl_line   : 359
    <b130c>   DW_AT_decl_column : 3
    <b130d>   DW_AT_type        : <0xb1273>
 <1><b1311>: Abbrev Number: 44 (DW_TAG_variable)
    <b1312>   DW_AT_name        : (indirect string, offset: 0x17139): __fb_ctx
    <b1316>   DW_AT_decl_file   : 11
    <b1317>   DW_AT_decl_line   : 361
    <b1319>   DW_AT_decl_column : 21
    <b131a>   DW_AT_type        : <0xb1304>
    <b131e>   DW_AT_external    : 1
    <b131e>   DW_AT_declaration : 1
 <1><b131e>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <b131f>   DW_AT_name        : (indirect string, offset: 0x1b485): _eInputMode
    <b1323>   DW_AT_encoding    : 7	(void)
    <b1323>   DW_AT_byte_size   : 4
    <b1323>   DW_AT_type        : <0xb079a>
    <b1327>   DW_AT_decl_file   : 1
    <b1328>   DW_AT_decl_line   : 7
    <b1329>   DW_AT_decl_column : 14
    <b1329>   DW_AT_sibling     : <0xb1340>
 <2><b132d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b132e>   DW_AT_name        : (indirect string, offset: 0x1b491): eIM_Invalid
    <b1332>   DW_AT_const_value : 0
 <2><b1333>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b1334>   DW_AT_name        : (indirect string, offset: 0x1b4d4): eIM_ReadLine
    <b1338>   DW_AT_const_value : 1
 <2><b1339>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b133a>   DW_AT_name        : (indirect string, offset: 0x1b4e1): eIM_Read
    <b133e>   DW_AT_const_value : 2
 <2><b133f>: Abbrev Number: 0
 <1><b1340>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1341>   DW_AT_name        : (indirect string, offset: 0x1b486): eInputMode
    <b1345>   DW_AT_decl_file   : 1
    <b1346>   DW_AT_decl_line   : 11
    <b1347>   DW_AT_decl_column : 3
    <b1348>   DW_AT_type        : <0xb131e>
 <1><b134c>: Abbrev Number: 45 (DW_TAG_subprogram)
    <b134d>   DW_AT_external    : 1
    <b134d>   DW_AT_name        : (indirect string, offset: 0x129ce): fb_StrDelete
    <b1351>   DW_AT_decl_file   : 6
    <b1352>   DW_AT_decl_line   : 123
    <b1353>   DW_AT_decl_column : 21
    <b1354>   DW_AT_prototyped  : 1
    <b1354>   DW_AT_declaration : 1
    <b1354>   DW_AT_sibling     : <0xb135e>
 <2><b1358>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1359>   DW_AT_type        : <0xb0bf1>
 <2><b135d>: Abbrev Number: 0
 <1><b135e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b135f>   DW_AT_external    : 1
    <b135f>   DW_AT_name        : (indirect string, offset: 0x5646): fb_StrConcatAssign
    <b1363>   DW_AT_decl_file   : 6
    <b1364>   DW_AT_decl_line   : 125
    <b1365>   DW_AT_decl_column : 21
    <b1366>   DW_AT_prototyped  : 1
    <b1366>   DW_AT_type        : <0xb07d0>
    <b136a>   DW_AT_declaration : 1
    <b136a>   DW_AT_sibling     : <0xb1388>
 <2><b136e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b136f>   DW_AT_type        : <0xb07d0>
 <2><b1373>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1374>   DW_AT_type        : <0xb081b>
 <2><b1378>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1379>   DW_AT_type        : <0xb07d0>
 <2><b137d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b137e>   DW_AT_type        : <0xb081b>
 <2><b1382>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1383>   DW_AT_type        : <0xb07b6>
 <2><b1387>: Abbrev Number: 0
 <1><b1388>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b1389>   DW_AT_external    : 1
    <b1389>   DW_AT_name        : (indirect string, offset: 0x16360): fb_StrAssign
    <b138d>   DW_AT_decl_file   : 6
    <b138e>   DW_AT_decl_line   : 121
    <b138f>   DW_AT_decl_column : 21
    <b1390>   DW_AT_prototyped  : 1
    <b1390>   DW_AT_type        : <0xb07d0>
    <b1394>   DW_AT_declaration : 1
    <b1394>   DW_AT_sibling     : <0xb13b2>
 <2><b1398>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1399>   DW_AT_type        : <0xb07d0>
 <2><b139d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b139e>   DW_AT_type        : <0xb081b>
 <2><b13a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13a3>   DW_AT_type        : <0xb07d0>
 <2><b13a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13a8>   DW_AT_type        : <0xb081b>
 <2><b13ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13ad>   DW_AT_type        : <0xb07b6>
 <2><b13b1>: Abbrev Number: 0
 <1><b13b2>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b13b3>   DW_AT_external    : 1
    <b13b3>   DW_AT_name        : (indirect string, offset: 0x175cb): fb_StrAllocTempDescF
    <b13b7>   DW_AT_decl_file   : 6
    <b13b8>   DW_AT_decl_line   : 129
    <b13b9>   DW_AT_decl_column : 21
    <b13ba>   DW_AT_prototyped  : 1
    <b13ba>   DW_AT_type        : <0xb0bf1>
    <b13be>   DW_AT_declaration : 1
    <b13be>   DW_AT_sibling     : <0xb13cd>
 <2><b13c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13c3>   DW_AT_type        : <0xb07de>
 <2><b13c7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13c8>   DW_AT_type        : <0xb081b>
 <2><b13cc>: Abbrev Number: 0
 <1><b13cd>: Abbrev Number: 46 (DW_TAG_subprogram)
    <b13ce>   DW_AT_external    : 1
    <b13ce>   DW_AT_name        : (indirect string, offset: 0x1b474): fb_FilePutBackEx
    <b13d2>   DW_AT_decl_file   : 8
    <b13d3>   DW_AT_decl_line   : 274
    <b13d5>   DW_AT_decl_column : 21
    <b13d6>   DW_AT_prototyped  : 1
    <b13d6>   DW_AT_type        : <0xb07b6>
    <b13da>   DW_AT_declaration : 1
    <b13da>   DW_AT_sibling     : <0xb13ee>
 <2><b13de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13df>   DW_AT_type        : <0xb0d0d>
 <2><b13e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13e4>   DW_AT_type        : <0xb083e>
 <2><b13e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13e9>   DW_AT_type        : <0xb07ea>
 <2><b13ed>: Abbrev Number: 0
 <1><b13ee>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b13ef>   DW_AT_external    : 1
    <b13ef>   DW_AT_name        : (indirect string, offset: 0x1b3c7): fb_FileGetDataEx
    <b13f3>   DW_AT_decl_file   : 8
    <b13f4>   DW_AT_decl_line   : 164
    <b13f5>   DW_AT_decl_column : 21
    <b13f6>   DW_AT_prototyped  : 1
    <b13f6>   DW_AT_type        : <0xb07b6>
    <b13fa>   DW_AT_declaration : 1
    <b13fa>   DW_AT_sibling     : <0xb1422>
 <2><b13fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b13ff>   DW_AT_type        : <0xb0d0d>
 <2><b1403>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1404>   DW_AT_type        : <0xb0849>
 <2><b1408>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1409>   DW_AT_type        : <0xb07d0>
 <2><b140d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b140e>   DW_AT_type        : <0xb07ea>
 <2><b1412>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1413>   DW_AT_type        : <0xb0b0e>
 <2><b1417>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1418>   DW_AT_type        : <0xb07b6>
 <2><b141c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b141d>   DW_AT_type        : <0xb07b6>
 <2><b1421>: Abbrev Number: 0
 <1><b1422>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b1423>   DW_AT_external    : 1
    <b1423>   DW_AT_name        : (indirect string, offset: 0x16c1b): fb_ErrorSetNum
    <b1427>   DW_AT_decl_file   : 7
    <b1428>   DW_AT_decl_line   : 50
    <b1429>   DW_AT_decl_column : 22
    <b142a>   DW_AT_prototyped  : 1
    <b142a>   DW_AT_type        : <0xb07b6>
    <b142e>   DW_AT_declaration : 1
    <b142e>   DW_AT_sibling     : <0xb1438>
 <2><b1432>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1433>   DW_AT_type        : <0xb07b6>
 <2><b1437>: Abbrev Number: 0
 <1><b1438>: Abbrev Number: 47 (DW_TAG_subprogram)
    <b1439>   DW_AT_external    : 1
    <b1439>   DW_AT_name        : (indirect string, offset: 0x375): fb_FileLineInput
    <b143d>   DW_AT_decl_file   : 1
    <b143e>   DW_AT_decl_line   : 125
    <b143f>   DW_AT_decl_column : 12
    <b1440>   DW_AT_prototyped  : 1
    <b1440>   DW_AT_type        : <0xb07b6>
    <b1444>   DW_AT_low_pc      : 0x470860
    <b144c>   DW_AT_high_pc     : 0x41
    <b1454>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b1456>   DW_AT_call_all_calls: 1
    <b1456>   DW_AT_sibling     : <0xb14b4>
 <2><b145a>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b145b>   DW_AT_name        : (indirect string, offset: 0x1b347): fnum
    <b145f>   DW_AT_decl_file   : 1
    <b145f>   DW_AT_decl_line   : 125
    <b1460>   DW_AT_decl_column : 34
    <b1461>   DW_AT_type        : <0xb07b6>
    <b1465>   DW_AT_location    : 0x37d9d (location list)
    <b1469>   DW_AT_GNU_locviews: 0x37d97
 <2><b146d>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <b146e>   DW_AT_name        : dst
    <b1472>   DW_AT_decl_file   : 1
    <b1472>   DW_AT_decl_line   : 125
    <b1473>   DW_AT_decl_column : 46
    <b1474>   DW_AT_type        : <0xb07d0>
    <b1478>   DW_AT_location    : 0x37dbc (location list)
    <b147c>   DW_AT_GNU_locviews: 0x37db8
 <2><b1480>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b1481>   DW_AT_name        : (indirect string, offset: 0x1a77d): dst_len
    <b1485>   DW_AT_decl_file   : 1
    <b1485>   DW_AT_decl_line   : 125
    <b1486>   DW_AT_decl_column : 59
    <b1487>   DW_AT_type        : <0xb081b>
    <b148b>   DW_AT_location    : 0x37dd2 (location list)
    <b148f>   DW_AT_GNU_locviews: 0x37dce
 <2><b1493>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b1494>   DW_AT_name        : (indirect string, offset: 0x1a7b0): fillrem
    <b1498>   DW_AT_decl_file   : 1
    <b1498>   DW_AT_decl_line   : 125
    <b1499>   DW_AT_decl_column : 72
    <b149a>   DW_AT_type        : <0xb07b6>
    <b149e>   DW_AT_location    : 0x37de8 (location list)
    <b14a2>   DW_AT_GNU_locviews: 0x37de4
 <2><b14a6>: Abbrev Number: 48 (DW_TAG_call_site)
    <b14a7>   DW_AT_call_return_pc: 0x4708a1
    <b14af>   DW_AT_call_tail_call: 1
    <b14af>   DW_AT_call_origin : <0xb14b4>
 <2><b14b3>: Abbrev Number: 0
 <1><b14b4>: Abbrev Number: 49 (DW_TAG_subprogram)
    <b14b5>   DW_AT_name        : (indirect string, offset: 0x1b4b0): fb_hFileLineInputEx
    <b14b9>   DW_AT_decl_file   : 1
    <b14ba>   DW_AT_decl_line   : 13
    <b14bb>   DW_AT_decl_column : 12
    <b14bc>   DW_AT_prototyped  : 1
    <b14bc>   DW_AT_type        : <0xb07b6>
    <b14c0>   DW_AT_low_pc      : 0x470580
    <b14c8>   DW_AT_high_pc     : 0x2dc
    <b14d0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b14d2>   DW_AT_call_all_tail_calls: 1
    <b14d2>   DW_AT_sibling     : <0xb17dc>
 <2><b14d6>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b14d7>   DW_AT_name        : (indirect string, offset: 0x1bcfd): handle
    <b14db>   DW_AT_decl_file   : 1
    <b14db>   DW_AT_decl_line   : 15
    <b14dc>   DW_AT_decl_column : 12
    <b14dd>   DW_AT_type        : <0xb0d0d>
    <b14e1>   DW_AT_location    : 0x37e0e (location list)
    <b14e5>   DW_AT_GNU_locviews: 0x37dfa
 <2><b14e9>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <b14ea>   DW_AT_name        : dst
    <b14ee>   DW_AT_decl_file   : 1
    <b14ee>   DW_AT_decl_line   : 16
    <b14ef>   DW_AT_decl_column : 9
    <b14f0>   DW_AT_type        : <0xb07d0>
    <b14f4>   DW_AT_location    : 0x37e77 (location list)
    <b14f8>   DW_AT_GNU_locviews: 0x37e5b
 <2><b14fc>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b14fd>   DW_AT_name        : (indirect string, offset: 0x1a77d): dst_len
    <b1501>   DW_AT_decl_file   : 1
    <b1501>   DW_AT_decl_line   : 17
    <b1502>   DW_AT_decl_column : 11
    <b1503>   DW_AT_type        : <0xb081b>
    <b1507>   DW_AT_location    : 0x37ef6 (location list)
    <b150b>   DW_AT_GNU_locviews: 0x37ee0
 <2><b150f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b1510>   DW_AT_name        : (indirect string, offset: 0x1a7b0): fillrem
    <b1514>   DW_AT_decl_file   : 1
    <b1514>   DW_AT_decl_line   : 18
    <b1515>   DW_AT_decl_column : 7
    <b1516>   DW_AT_type        : <0xb07b6>
    <b151a>   DW_AT_location    : 0x37f5a (location list)
    <b151e>   DW_AT_GNU_locviews: 0x37f4a
 <2><b1522>: Abbrev Number: 20 (DW_TAG_variable)
    <b1523>   DW_AT_name        : len
    <b1527>   DW_AT_decl_file   : 1
    <b1527>   DW_AT_decl_line   : 21
    <b1528>   DW_AT_decl_column : 10
    <b1529>   DW_AT_type        : <0xb081b>
    <b152d>   DW_AT_location    : 0x37f9e (location list)
    <b1531>   DW_AT_GNU_locviews: 0x37f98
 <2><b1535>: Abbrev Number: 17 (DW_TAG_variable)
    <b1536>   DW_AT_name        : (indirect string, offset: 0x1b49d): readlen
    <b153a>   DW_AT_decl_file   : 1
    <b153a>   DW_AT_decl_line   : 21
    <b153b>   DW_AT_decl_column : 15
    <b153c>   DW_AT_type        : <0xb081b>
    <b1540>   DW_AT_location    : 0x37fc1 (location list)
    <b1544>   DW_AT_GNU_locviews: 0x37fb5
 <2><b1548>: Abbrev Number: 21 (DW_TAG_variable)
    <b1549>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <b154d>   DW_AT_decl_file   : 1
    <b154d>   DW_AT_decl_line   : 22
    <b154e>   DW_AT_decl_column : 8
    <b154f>   DW_AT_type        : <0xb08dd>
    <b1553>   DW_AT_location    : 3 byte block: 91 b0 77 	(DW_OP_fbreg: -1104)
 <2><b1557>: Abbrev Number: 17 (DW_TAG_variable)
    <b1558>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b155c>   DW_AT_decl_file   : 1
    <b155c>   DW_AT_decl_line   : 23
    <b155d>   DW_AT_decl_column : 17
    <b155e>   DW_AT_type        : <0xb1340>
    <b1562>   DW_AT_location    : 0x38000 (location list)
    <b1566>   DW_AT_GNU_locviews: 0x37ff6
 <2><b156a>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <b156b>   DW_AT_ranges      : 0x17dfa
    <b156f>   DW_AT_sibling     : <0xb16eb>
 <3><b1573>: Abbrev Number: 17 (DW_TAG_variable)
    <b1574>   DW_AT_name        : (indirect string, offset: 0x1b4c4): do_add
    <b1578>   DW_AT_decl_file   : 1
    <b1578>   DW_AT_decl_line   : 43
    <b1579>   DW_AT_decl_column : 17
    <b157a>   DW_AT_type        : <0xb07b6>
    <b157e>   DW_AT_location    : 0x38032 (location list)
    <b1582>   DW_AT_GNU_locviews: 0x38026
 <3><b1586>: Abbrev Number: 17 (DW_TAG_variable)
    <b1587>   DW_AT_name        : (indirect string, offset: 0x1b4ea): do_break
    <b158b>   DW_AT_decl_file   : 1
    <b158b>   DW_AT_decl_line   : 43
    <b158c>   DW_AT_decl_column : 33
    <b158d>   DW_AT_type        : <0xb07b6>
    <b1591>   DW_AT_location    : 0x3806e (location list)
    <b1595>   DW_AT_GNU_locviews: 0x38062
 <3><b1599>: Abbrev Number: 21 (DW_TAG_variable)
    <b159a>   DW_AT_name        : (indirect string, offset: 0x1b4cb): read_len
    <b159e>   DW_AT_decl_file   : 1
    <b159e>   DW_AT_decl_line   : 44
    <b159f>   DW_AT_decl_column : 20
    <b15a0>   DW_AT_type        : <0xb07ea>
    <b15a4>   DW_AT_location    : 3 byte block: 91 90 77 	(DW_OP_fbreg: -1136)
 <3><b15a8>: Abbrev Number: 20 (DW_TAG_variable)
    <b15a9>   DW_AT_name        : res
    <b15ad>   DW_AT_decl_file   : 1
    <b15ad>   DW_AT_decl_line   : 45
    <b15ae>   DW_AT_decl_column : 17
    <b15af>   DW_AT_type        : <0xb07b6>
    <b15b3>   DW_AT_location    : 0x380b7 (location list)
    <b15b7>   DW_AT_GNU_locviews: 0x3809f
 <3><b15bb>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <b15bc>   DW_AT_ranges      : 0x17e2e
    <b15c0>   DW_AT_sibling     : <0xb1629>
 <4><b15c4>: Abbrev Number: 50 (DW_TAG_variable)
    <b15c5>   DW_AT_name        : ch
    <b15c8>   DW_AT_decl_file   : 1
    <b15c9>   DW_AT_decl_line   : 47
    <b15ca>   DW_AT_decl_column : 22
    <b15cb>   DW_AT_type        : <0xb07e3>
    <b15cf>   DW_AT_location    : 3 byte block: 91 8f 77 	(DW_OP_fbreg: -1137)
 <4><b15d3>: Abbrev Number: 9 (DW_TAG_call_site)
    <b15d4>   DW_AT_call_return_pc: 0x470805
    <b15dc>   DW_AT_call_origin : <0xb13ee>
    <b15e0>   DW_AT_sibling     : <0xb1609>
 <5><b15e4>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b15e5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b15e7>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><b15ea>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b15eb>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b15ed>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><b15ef>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b15f0>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b15f2>   DW_AT_call_value  : 3 byte block: 91 8f 77 	(DW_OP_fbreg: -1137)
 <5><b15f6>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b15f7>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <b15f9>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><b15fb>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b15fc>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <b15fe>   DW_AT_call_value  : 4 byte block: 91 f0 76 6 	(DW_OP_fbreg: -1168; DW_OP_deref)
 <5><b1603>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1604>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <b1606>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><b1608>: Abbrev Number: 0
 <4><b1609>: Abbrev Number: 30 (DW_TAG_call_site)
    <b160a>   DW_AT_call_return_pc: 0x470851
    <b1612>   DW_AT_call_origin : <0xb13cd>
 <5><b1616>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1617>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b1619>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><b161c>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b161d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b161f>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <5><b1622>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1623>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b1625>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><b1627>: Abbrev Number: 0
 <4><b1628>: Abbrev Number: 0
 <3><b1629>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <b162a>   DW_AT_ranges      : 0x17e1e
    <b162e>   DW_AT_sibling     : <0xb169e>
 <4><b1632>: Abbrev Number: 20 (DW_TAG_variable)
    <b1633>   DW_AT_name        : src
    <b1637>   DW_AT_decl_file   : 1
    <b1637>   DW_AT_decl_line   : 67
    <b1638>   DW_AT_decl_column : 27
    <b1639>   DW_AT_type        : <0xb0bf1>
    <b163d>   DW_AT_location    : 0x38113 (location list)
    <b1641>   DW_AT_GNU_locviews: 0x3810f
 <4><b1645>: Abbrev Number: 9 (DW_TAG_call_site)
    <b1646>   DW_AT_call_return_pc: 0x470740
    <b164e>   DW_AT_call_origin : <0xb13b2>
    <b1652>   DW_AT_sibling     : <0xb1663>
 <5><b1656>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1657>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b1659>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><b165c>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b165d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b165f>   DW_AT_call_value  : 2 byte block: 73 1 	(DW_OP_breg3 (rbx): 1)
 <5><b1662>: Abbrev Number: 0
 <4><b1663>: Abbrev Number: 9 (DW_TAG_call_site)
    <b1664>   DW_AT_call_return_pc: 0x470762
    <b166c>   DW_AT_call_origin : <0xb1388>
    <b1670>   DW_AT_sibling     : <0xb1690>
 <5><b1674>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1675>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b1677>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <5><b167a>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b167b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b167d>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><b1680>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1681>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <b1683>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <5><b1686>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1687>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <b1689>   DW_AT_call_value  : 5 byte block: 91 f8 76 94 4 	(DW_OP_fbreg: -1160; DW_OP_deref_size: 4)
 <5><b168f>: Abbrev Number: 0
 <4><b1690>: Abbrev Number: 31 (DW_TAG_call_site)
    <b1691>   DW_AT_call_return_pc: 0x470785
    <b1699>   DW_AT_call_origin : <0xb135e>
 <4><b169d>: Abbrev Number: 0
 <3><b169e>: Abbrev Number: 9 (DW_TAG_call_site)
    <b169f>   DW_AT_call_return_pc: 0x470706
    <b16a7>   DW_AT_call_origin : <0xb13ee>
    <b16ab>   DW_AT_sibling     : <0xb16da>
 <4><b16af>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16b0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b16b2>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><b16b5>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16b6>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b16b8>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><b16ba>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16bb>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b16bd>   DW_AT_call_value  : 9 byte block: 91 0 73 0 22 a 50 4 1c 	(DW_OP_fbreg: 0; DW_OP_breg3 (rbx): 0; DW_OP_plus; DW_OP_const2u: 1104; DW_OP_minus)
 <4><b16c7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16c8>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <b16ca>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <4><b16cc>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16cd>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <b16cf>   DW_AT_call_value  : 4 byte block: 91 f0 76 6 	(DW_OP_fbreg: -1168; DW_OP_deref)
 <4><b16d4>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16d5>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <b16d7>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><b16d9>: Abbrev Number: 0
 <3><b16da>: Abbrev Number: 51 (DW_TAG_call_site)
    <b16db>   DW_AT_call_return_pc: 0x47072b
 <4><b16e3>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b16e4>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b16e6>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><b16e9>: Abbrev Number: 0
 <3><b16ea>: Abbrev Number: 0
 <2><b16eb>: Abbrev Number: 52 (DW_TAG_lexical_block)
    <b16ec>   DW_AT_low_pc      : 0x4705de
    <b16f4>   DW_AT_high_pc     : 0x3e
    <b16fc>   DW_AT_sibling     : <0xb1774>
 <3><b1700>: Abbrev Number: 21 (DW_TAG_variable)
    <b1701>   DW_AT_name        : (indirect string, offset: 0x1b4a5): str_result
    <b1705>   DW_AT_decl_file   : 1
    <b1705>   DW_AT_decl_line   : 101
    <b1706>   DW_AT_decl_column : 13
    <b1707>   DW_AT_type        : <0xb0923>
    <b170b>   DW_AT_location    : 3 byte block: 91 90 77 	(DW_OP_fbreg: -1136)
 <3><b170f>: Abbrev Number: 32 (DW_TAG_call_site)
    <b1710>   DW_AT_call_return_pc: 0x4705fa
    <b1718>   DW_AT_sibling     : <0xb172a>
 <4><b171c>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b171d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b171f>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <4><b1722>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1723>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b1725>   DW_AT_call_value  : 3 byte block: 91 90 77 	(DW_OP_fbreg: -1136)
 <4><b1729>: Abbrev Number: 0
 <3><b172a>: Abbrev Number: 9 (DW_TAG_call_site)
    <b172b>   DW_AT_call_return_pc: 0x470614
    <b1733>   DW_AT_call_origin : <0xb1388>
    <b1737>   DW_AT_sibling     : <0xb175e>
 <4><b173b>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b173c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b173e>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <4><b1741>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1742>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <b1744>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <4><b1747>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1748>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <b174a>   DW_AT_call_value  : 3 byte block: 91 90 77 	(DW_OP_fbreg: -1136)
 <4><b174e>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b174f>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <b1751>   DW_AT_call_value  : 2 byte block: 9 ff 	(DW_OP_const1s: -1)
 <4><b1754>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1755>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <b1757>   DW_AT_call_value  : 5 byte block: 91 f8 76 94 4 	(DW_OP_fbreg: -1160; DW_OP_deref_size: 4)
 <4><b175d>: Abbrev Number: 0
 <3><b175e>: Abbrev Number: 30 (DW_TAG_call_site)
    <b175f>   DW_AT_call_return_pc: 0x47061c
    <b1767>   DW_AT_call_origin : <0xb134c>
 <4><b176b>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b176c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b176e>   DW_AT_call_value  : 3 byte block: 91 90 77 	(DW_OP_fbreg: -1136)
 <4><b1772>: Abbrev Number: 0
 <3><b1773>: Abbrev Number: 0
 <2><b1774>: Abbrev Number: 9 (DW_TAG_call_site)
    <b1775>   DW_AT_call_return_pc: 0x470623
    <b177d>   DW_AT_call_origin : <0xb1422>
    <b1781>   DW_AT_sibling     : <0xb178b>
 <3><b1785>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b1786>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b1788>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><b178a>: Abbrev Number: 0
 <2><b178b>: Abbrev Number: 53 (DW_TAG_call_site)
    <b178c>   DW_AT_call_return_pc: 0x470692
    <b1794>   DW_AT_call_tail_call: 1
    <b1794>   DW_AT_call_origin : <0xb1422>
    <b1798>   DW_AT_sibling     : <0xb17a2>
 <3><b179c>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b179d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b179f>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><b17a1>: Abbrev Number: 0
 <2><b17a2>: Abbrev Number: 32 (DW_TAG_call_site)
    <b17a3>   DW_AT_call_return_pc: 0x4706d8
    <b17ab>   DW_AT_sibling     : <0xb17b6>
 <3><b17af>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b17b0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b17b2>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><b17b5>: Abbrev Number: 0
 <2><b17b6>: Abbrev Number: 9 (DW_TAG_call_site)
    <b17b7>   DW_AT_call_return_pc: 0x470838
    <b17bf>   DW_AT_call_origin : <0xb134c>
    <b17c3>   DW_AT_sibling     : <0xb17ce>
 <3><b17c7>: Abbrev Number: 5 (DW_TAG_call_site_parameter)
    <b17c8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <b17ca>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><b17cd>: Abbrev Number: 0
 <2><b17ce>: Abbrev Number: 31 (DW_TAG_call_site)
    <b17cf>   DW_AT_call_return_pc: 0x47085c
    <b17d7>   DW_AT_call_origin : <0xb17dc>
 <2><b17db>: Abbrev Number: 0
 <1><b17dc>: Abbrev Number: 54 (DW_TAG_subprogram)
    <b17dd>   DW_AT_external    : 1
    <b17dd>   DW_AT_declaration : 1
    <b17dd>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <b17e1>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><b17e5>: Abbrev Number: 0
  Compilation Unit @ offset 0xb17e6:
   Length:        0xe7a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xbf83
   Pointer Size:  8
 <0><b17f2>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <b17f3>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <b17f7>   DW_AT_language    : 29	(C11)
    <b17f8>   DW_AT_name        : (indirect line string, offset: 0xcdd): src/rtlib/file_open.c
    <b17fc>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <b1800>   DW_AT_low_pc      : 0x4708b0
    <b1808>   DW_AT_high_pc     : 0x72
    <b1810>   DW_AT_stmt_list   : 0x64a5e
 <1><b1814>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1815>   DW_AT_byte_size   : 1
    <b1816>   DW_AT_encoding    : 8	(unsigned char)
    <b1817>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><b181b>: Abbrev Number: 7 (DW_TAG_base_type)
    <b181c>   DW_AT_byte_size   : 2
    <b181d>   DW_AT_encoding    : 7	(unsigned)
    <b181e>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><b1822>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1823>   DW_AT_byte_size   : 4
    <b1824>   DW_AT_encoding    : 7	(unsigned)
    <b1825>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><b1829>: Abbrev Number: 7 (DW_TAG_base_type)
    <b182a>   DW_AT_byte_size   : 8
    <b182b>   DW_AT_encoding    : 7	(unsigned)
    <b182c>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><b1830>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1831>   DW_AT_byte_size   : 1
    <b1832>   DW_AT_encoding    : 6	(signed char)
    <b1833>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><b1837>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1838>   DW_AT_byte_size   : 2
    <b1839>   DW_AT_encoding    : 5	(signed)
    <b183a>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><b183e>: Abbrev Number: 30 (DW_TAG_base_type)
    <b183f>   DW_AT_byte_size   : 4
    <b1840>   DW_AT_encoding    : 5	(signed)
    <b1841>   DW_AT_name        : int
 <1><b1845>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1846>   DW_AT_byte_size   : 8
    <b1847>   DW_AT_encoding    : 5	(signed)
    <b1848>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><b184c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b184d>   DW_AT_name        : (indirect string, offset: 0x16c7a): __off64_t
    <b1851>   DW_AT_decl_file   : 2
    <b1852>   DW_AT_decl_line   : 153
    <b1853>   DW_AT_decl_column : 27
    <b1854>   DW_AT_type        : <0xb1845>
 <1><b1858>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <b1859>   DW_AT_byte_size   : 8
 <1><b185a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b185b>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <b185f>   DW_AT_decl_file   : 2
    <b1860>   DW_AT_decl_line   : 194
    <b1861>   DW_AT_decl_column : 27
    <b1862>   DW_AT_type        : <0xb1845>
 <1><b1866>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1867>   DW_AT_byte_size   : 8
    <b1867>   DW_AT_type        : <0xb186b>
 <1><b186b>: Abbrev Number: 7 (DW_TAG_base_type)
    <b186c>   DW_AT_byte_size   : 1
    <b186d>   DW_AT_encoding    : 6	(signed char)
    <b186e>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><b1872>: Abbrev Number: 18 (DW_TAG_const_type)
    <b1873>   DW_AT_type        : <0xb186b>
 <1><b1877>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1878>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <b187c>   DW_AT_decl_file   : 3
    <b187d>   DW_AT_decl_line   : 209
    <b187e>   DW_AT_decl_column : 23
    <b187f>   DW_AT_type        : <0xb1829>
 <1><b1883>: Abbrev Number: 19 (DW_TAG_typedef)
    <b1884>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <b1888>   DW_AT_decl_file   : 3
    <b1889>   DW_AT_decl_line   : 321
    <b188b>   DW_AT_decl_column : 24
    <b188c>   DW_AT_type        : <0xb183e>
 <1><b1890>: Abbrev Number: 18 (DW_TAG_const_type)
    <b1891>   DW_AT_type        : <0xb1883>
 <1><b1895>: Abbrev Number: 7 (DW_TAG_base_type)
    <b1896>   DW_AT_byte_size   : 8
    <b1897>   DW_AT_encoding    : 5	(signed)
    <b1898>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><b189c>: Abbrev Number: 3 (DW_TAG_typedef)
    <b189d>   DW_AT_name        : (indirect string, offset: 0x16c15): off_t
    <b18a1>   DW_AT_decl_file   : 4
    <b18a2>   DW_AT_decl_line   : 87
    <b18a3>   DW_AT_decl_column : 19
    <b18a4>   DW_AT_type        : <0xb184c>
 <1><b18a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b18a9>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <b18ad>   DW_AT_decl_file   : 4
    <b18ae>   DW_AT_decl_line   : 108
    <b18af>   DW_AT_decl_column : 19
    <b18b0>   DW_AT_type        : <0xb185a>
 <1><b18b4>: Abbrev Number: 7 (DW_TAG_base_type)
    <b18b5>   DW_AT_byte_size   : 8
    <b18b6>   DW_AT_encoding    : 7	(unsigned)
    <b18b7>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><b18bb>: Abbrev Number: 20 (DW_TAG_array_type)
    <b18bc>   DW_AT_type        : <0xb186b>
    <b18c0>   DW_AT_sibling     : <0xb18cb>
 <2><b18c4>: Abbrev Number: 32 (DW_TAG_subrange_type)
    <b18c5>   DW_AT_type        : <0xb1829>
    <b18c9>   DW_AT_upper_bound : 3
 <2><b18ca>: Abbrev Number: 0
 <1><b18cb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b18cc>   DW_AT_byte_size   : 8
    <b18cc>   DW_AT_type        : <0xb18d0>
 <1><b18d0>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><b18d1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b18d2>   DW_AT_byte_size   : 8
    <b18d2>   DW_AT_type        : <0xb1872>
 <1><b18d6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b18d7>   DW_AT_byte_size   : 8
    <b18d7>   DW_AT_type        : <0xb1866>
 <1><b18db>: Abbrev Number: 3 (DW_TAG_typedef)
    <b18dc>   DW_AT_name        : (indirect string, offset: 0x1740a): fb_off_t
    <b18e0>   DW_AT_decl_file   : 5
    <b18e1>   DW_AT_decl_line   : 22
    <b18e2>   DW_AT_decl_column : 15
    <b18e3>   DW_AT_type        : <0xb189c>
 <1><b18e7>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <b18e8>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <b18ec>   DW_AT_encoding    : 7	(void)
    <b18ec>   DW_AT_byte_size   : 4
    <b18ec>   DW_AT_type        : <0xb1822>
    <b18f0>   DW_AT_decl_file   : 7
    <b18f1>   DW_AT_decl_line   : 1
    <b18f2>   DW_AT_decl_column : 14
    <b18f2>   DW_AT_sibling     : <0xb1969>
 <2><b18f6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b18f7>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <b18fb>   DW_AT_const_value : 0
 <2><b18fc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b18fd>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <b1901>   DW_AT_const_value : 1
 <2><b1902>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1903>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <b1907>   DW_AT_const_value : 2
 <2><b1908>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1909>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <b190d>   DW_AT_const_value : 3
 <2><b190e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b190f>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <b1913>   DW_AT_const_value : 4
 <2><b1914>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1915>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <b1919>   DW_AT_const_value : 5
 <2><b191a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b191b>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <b191f>   DW_AT_const_value : 6
 <2><b1920>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1921>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <b1925>   DW_AT_const_value : 7
 <2><b1926>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1927>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <b192b>   DW_AT_const_value : 8
 <2><b192c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b192d>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <b1931>   DW_AT_const_value : 9
 <2><b1932>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1933>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <b1937>   DW_AT_const_value : 10
 <2><b1938>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1939>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <b193d>   DW_AT_const_value : 11
 <2><b193e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b193f>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <b1943>   DW_AT_const_value : 12
 <2><b1944>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1945>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <b1949>   DW_AT_const_value : 13
 <2><b194a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b194b>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <b194f>   DW_AT_const_value : 14
 <2><b1950>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1951>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <b1955>   DW_AT_const_value : 15
 <2><b1956>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1957>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <b195b>   DW_AT_const_value : 16
 <2><b195c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b195d>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <b1961>   DW_AT_const_value : 17
 <2><b1962>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b1963>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <b1967>   DW_AT_const_value : 18
 <2><b1968>: Abbrev Number: 0
 <1><b1969>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b196a>   DW_AT_byte_size   : 8
    <b196a>   DW_AT_type        : <0xb196e>
 <1><b196e>: Abbrev Number: 34 (DW_TAG_subroutine_type)
    <b196f>   DW_AT_prototyped  : 1
 <1><b196f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b1970>   DW_AT_name        : (indirect string, offset: 0x16bca): _FBSTRING
    <b1974>   DW_AT_byte_size   : 24
    <b1975>   DW_AT_decl_file   : 6
    <b1976>   DW_AT_decl_line   : 82
    <b1977>   DW_AT_decl_column : 16
    <b1978>   DW_AT_sibling     : <0xb19a4>
 <2><b197c>: Abbrev Number: 2 (DW_TAG_member)
    <b197d>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <b1981>   DW_AT_decl_file   : 6
    <b1982>   DW_AT_decl_line   : 83
    <b1983>   DW_AT_decl_column : 21
    <b1984>   DW_AT_type        : <0xb1866>
    <b1988>   DW_AT_data_member_location: 0
 <2><b1989>: Abbrev Number: 10 (DW_TAG_member)
    <b198a>   DW_AT_name        : len
    <b198e>   DW_AT_decl_file   : 6
    <b198f>   DW_AT_decl_line   : 84
    <b1990>   DW_AT_decl_column : 21
    <b1991>   DW_AT_type        : <0xb18a8>
    <b1995>   DW_AT_data_member_location: 8
 <2><b1996>: Abbrev Number: 2 (DW_TAG_member)
    <b1997>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b199b>   DW_AT_decl_file   : 6
    <b199c>   DW_AT_decl_line   : 85
    <b199d>   DW_AT_decl_column : 21
    <b199e>   DW_AT_type        : <0xb18a8>
    <b19a2>   DW_AT_data_member_location: 16
 <2><b19a3>: Abbrev Number: 0
 <1><b19a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b19a5>   DW_AT_name        : (indirect string, offset: 0xc736): FBSTRING
    <b19a9>   DW_AT_decl_file   : 6
    <b19aa>   DW_AT_decl_line   : 86
    <b19ab>   DW_AT_decl_column : 3
    <b19ac>   DW_AT_type        : <0xb196f>
 <1><b19b0>: Abbrev Number: 7 (DW_TAG_base_type)
    <b19b1>   DW_AT_byte_size   : 8
    <b19b2>   DW_AT_encoding    : 4	(float)
    <b19b3>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><b19b7>: Abbrev Number: 7 (DW_TAG_base_type)
    <b19b8>   DW_AT_byte_size   : 4
    <b19b9>   DW_AT_encoding    : 4	(float)
    <b19ba>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><b19be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b19bf>   DW_AT_byte_size   : 8
    <b19bf>   DW_AT_type        : <0xb1883>
 <1><b19c3>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <b19c4>   DW_AT_name        : (indirect string, offset: 0x17806): _FB_FILE_ENCOD
    <b19c8>   DW_AT_encoding    : 7	(void)
    <b19c8>   DW_AT_byte_size   : 4
    <b19c8>   DW_AT_type        : <0xb1822>
    <b19cc>   DW_AT_decl_file   : 8
    <b19cd>   DW_AT_decl_line   : 25
    <b19ce>   DW_AT_decl_column : 14
    <b19ce>   DW_AT_sibling     : <0xb19eb>
 <2><b19d2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b19d3>   DW_AT_name        : (indirect string, offset: 0x17679): FB_FILE_ENCOD_ASCII
    <b19d7>   DW_AT_const_value : 0
 <2><b19d8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b19d9>   DW_AT_name        : (indirect string, offset: 0x171b5): FB_FILE_ENCOD_UTF8
    <b19dd>   DW_AT_const_value : 1
 <2><b19de>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b19df>   DW_AT_name        : (indirect string, offset: 0x1768d): FB_FILE_ENCOD_UTF16
    <b19e3>   DW_AT_const_value : 2
 <2><b19e4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <b19e5>   DW_AT_name        : (indirect string, offset: 0x16f04): FB_FILE_ENCOD_UTF32
    <b19e9>   DW_AT_const_value : 3
 <2><b19ea>: Abbrev Number: 0
 <1><b19eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b19ec>   DW_AT_name        : (indirect string, offset: 0x17807): FB_FILE_ENCOD
    <b19f0>   DW_AT_decl_file   : 8
    <b19f1>   DW_AT_decl_line   : 30
    <b19f2>   DW_AT_decl_column : 3
    <b19f3>   DW_AT_type        : <0xb19c3>
 <1><b19f7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b19f8>   DW_AT_name        : (indirect string, offset: 0x17599): FnFileSetWidth
    <b19fc>   DW_AT_decl_file   : 8
    <b19fd>   DW_AT_decl_line   : 54
    <b19fe>   DW_AT_decl_column : 15
    <b19ff>   DW_AT_type        : <0xb1a03>
 <1><b1a03>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1a04>   DW_AT_byte_size   : 8
    <b1a04>   DW_AT_type        : <0xb1a08>
 <1><b1a08>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1a09>   DW_AT_prototyped  : 1
    <b1a09>   DW_AT_type        : <0xb183e>
    <b1a0d>   DW_AT_sibling     : <0xb1a1c>
 <2><b1a11>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1a12>   DW_AT_type        : <0xb1a1c>
 <2><b1a16>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1a17>   DW_AT_type        : <0xb183e>
 <2><b1a1b>: Abbrev Number: 0
 <1><b1a1c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1a1d>   DW_AT_byte_size   : 8
    <b1a1d>   DW_AT_type        : <0xb1a21>
 <1><b1a21>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b1a22>   DW_AT_name        : (indirect string, offset: 0x170c2): _FB_FILE
    <b1a26>   DW_AT_byte_size   : 80
    <b1a27>   DW_AT_decl_file   : 8
    <b1a28>   DW_AT_decl_line   : 97
    <b1a29>   DW_AT_decl_column : 16
    <b1a2a>   DW_AT_sibling     : <0xb1ae5>
 <2><b1a2e>: Abbrev Number: 2 (DW_TAG_member)
    <b1a2f>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <b1a33>   DW_AT_decl_file   : 8
    <b1a34>   DW_AT_decl_line   : 98
    <b1a35>   DW_AT_decl_column : 21
    <b1a36>   DW_AT_type        : <0xb183e>
    <b1a3a>   DW_AT_data_member_location: 0
 <2><b1a3b>: Abbrev Number: 10 (DW_TAG_member)
    <b1a3c>   DW_AT_name        : len
    <b1a40>   DW_AT_decl_file   : 8
    <b1a41>   DW_AT_decl_line   : 99
    <b1a42>   DW_AT_decl_column : 21
    <b1a43>   DW_AT_type        : <0xb183e>
    <b1a47>   DW_AT_data_member_location: 4
 <2><b1a48>: Abbrev Number: 2 (DW_TAG_member)
    <b1a49>   DW_AT_name        : (indirect string, offset: 0x17835): encod
    <b1a4d>   DW_AT_decl_file   : 8
    <b1a4e>   DW_AT_decl_line   : 100
    <b1a4f>   DW_AT_decl_column : 21
    <b1a50>   DW_AT_type        : <0xb19eb>
    <b1a54>   DW_AT_data_member_location: 8
 <2><b1a55>: Abbrev Number: 2 (DW_TAG_member)
    <b1a56>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <b1a5a>   DW_AT_decl_file   : 8
    <b1a5b>   DW_AT_decl_line   : 101
    <b1a5c>   DW_AT_decl_column : 21
    <b1a5d>   DW_AT_type        : <0xb18db>
    <b1a61>   DW_AT_data_member_location: 16
 <2><b1a62>: Abbrev Number: 2 (DW_TAG_member)
    <b1a63>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <b1a67>   DW_AT_decl_file   : 8
    <b1a68>   DW_AT_decl_line   : 102
    <b1a69>   DW_AT_decl_column : 21
    <b1a6a>   DW_AT_type        : <0xb183e>
    <b1a6e>   DW_AT_data_member_location: 24
 <2><b1a6f>: Abbrev Number: 2 (DW_TAG_member)
    <b1a70>   DW_AT_name        : (indirect string, offset: 0x17472): access
    <b1a74>   DW_AT_decl_file   : 8
    <b1a75>   DW_AT_decl_line   : 103
    <b1a76>   DW_AT_decl_column : 21
    <b1a77>   DW_AT_type        : <0xb183e>
    <b1a7b>   DW_AT_data_member_location: 28
 <2><b1a7c>: Abbrev Number: 2 (DW_TAG_member)
    <b1a7d>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <b1a81>   DW_AT_decl_file   : 8
    <b1a82>   DW_AT_decl_line   : 104
    <b1a83>   DW_AT_decl_column : 21
    <b1a84>   DW_AT_type        : <0xb183e>
    <b1a88>   DW_AT_data_member_location: 32
 <2><b1a89>: Abbrev Number: 2 (DW_TAG_member)
    <b1a8a>   DW_AT_name        : (indirect string, offset: 0x17315): line_length
    <b1a8e>   DW_AT_decl_file   : 8
    <b1a8f>   DW_AT_decl_line   : 105
    <b1a90>   DW_AT_decl_column : 21
    <b1a91>   DW_AT_type        : <0xb1822>
    <b1a95>   DW_AT_data_member_location: 36
 <2><b1a96>: Abbrev Number: 2 (DW_TAG_member)
    <b1a97>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <b1a9b>   DW_AT_decl_file   : 8
    <b1a9c>   DW_AT_decl_line   : 106
    <b1a9d>   DW_AT_decl_column : 21
    <b1a9e>   DW_AT_type        : <0xb1822>
    <b1aa2>   DW_AT_data_member_location: 40
 <2><b1aa3>: Abbrev Number: 2 (DW_TAG_member)
    <b1aa4>   DW_AT_name        : (indirect string, offset: 0x16e7a): putback_buffer
    <b1aa8>   DW_AT_decl_file   : 8
    <b1aa9>   DW_AT_decl_line   : 109
    <b1aaa>   DW_AT_decl_column : 21
    <b1aab>   DW_AT_type        : <0xb18bb>
    <b1aaf>   DW_AT_data_member_location: 44
 <2><b1ab0>: Abbrev Number: 2 (DW_TAG_member)
    <b1ab1>   DW_AT_name        : (indirect string, offset: 0x16e55): putback_size
    <b1ab5>   DW_AT_decl_file   : 8
    <b1ab6>   DW_AT_decl_line   : 110
    <b1ab7>   DW_AT_decl_column : 21
    <b1ab8>   DW_AT_type        : <0xb1877>
    <b1abc>   DW_AT_data_member_location: 48
 <2><b1abd>: Abbrev Number: 2 (DW_TAG_member)
    <b1abe>   DW_AT_name        : (indirect string, offset: 0x177a3): hooks
    <b1ac2>   DW_AT_decl_file   : 8
    <b1ac3>   DW_AT_decl_line   : 112
    <b1ac4>   DW_AT_decl_column : 22
    <b1ac5>   DW_AT_type        : <0xb1da7>
    <b1ac9>   DW_AT_data_member_location: 56
 <2><b1aca>: Abbrev Number: 2 (DW_TAG_member)
    <b1acb>   DW_AT_name        : (indirect string, offset: 0x1707d): opaque
    <b1acf>   DW_AT_decl_file   : 8
    <b1ad0>   DW_AT_decl_line   : 114
    <b1ad1>   DW_AT_decl_column : 14
    <b1ad2>   DW_AT_type        : <0xb1858>
    <b1ad6>   DW_AT_data_member_location: 64
 <2><b1ad7>: Abbrev Number: 2 (DW_TAG_member)
    <b1ad8>   DW_AT_name        : (indirect string, offset: 0x17397): redirection_to
    <b1adc>   DW_AT_decl_file   : 8
    <b1add>   DW_AT_decl_line   : 116
    <b1ade>   DW_AT_decl_column : 22
    <b1adf>   DW_AT_type        : <0xb1a1c>
    <b1ae3>   DW_AT_data_member_location: 72
 <2><b1ae4>: Abbrev Number: 0
 <1><b1ae5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1ae6>   DW_AT_byte_size   : 8
    <b1ae6>   DW_AT_type        : <0xb1aea>
 <1><b1aea>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1aeb>   DW_AT_prototyped  : 1
    <b1aeb>   DW_AT_type        : <0xb183e>
    <b1aef>   DW_AT_sibling     : <0xb1b03>
 <2><b1af3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1af4>   DW_AT_type        : <0xb1a1c>
 <2><b1af8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1af9>   DW_AT_type        : <0xb18d1>
 <2><b1afd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1afe>   DW_AT_type        : <0xb1877>
 <2><b1b02>: Abbrev Number: 0
 <1><b1b03>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b04>   DW_AT_name        : (indirect string, offset: 0x1b4f3): FnFileOpen
    <b1b08>   DW_AT_decl_file   : 8
    <b1b09>   DW_AT_decl_line   : 57
    <b1b0a>   DW_AT_decl_column : 15
    <b1b0b>   DW_AT_type        : <0xb1ae5>
 <1><b1b0f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b10>   DW_AT_name        : (indirect string, offset: 0x16e9e): FnFileEof
    <b1b14>   DW_AT_decl_file   : 8
    <b1b15>   DW_AT_decl_line   : 59
    <b1b16>   DW_AT_decl_column : 15
    <b1b17>   DW_AT_type        : <0xb1b1b>
 <1><b1b1b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1b1c>   DW_AT_byte_size   : 8
    <b1b1c>   DW_AT_type        : <0xb1b20>
 <1><b1b20>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1b21>   DW_AT_prototyped  : 1
    <b1b21>   DW_AT_type        : <0xb183e>
    <b1b25>   DW_AT_sibling     : <0xb1b2f>
 <2><b1b29>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b2a>   DW_AT_type        : <0xb1a1c>
 <2><b1b2e>: Abbrev Number: 0
 <1><b1b2f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b30>   DW_AT_name        : (indirect string, offset: 0x16ee9): FnFileClose
    <b1b34>   DW_AT_decl_file   : 8
    <b1b35>   DW_AT_decl_line   : 60
    <b1b36>   DW_AT_decl_column : 15
    <b1b37>   DW_AT_type        : <0xb1b1b>
 <1><b1b3b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b3c>   DW_AT_name        : (indirect string, offset: 0x17105): FnFileSeek
    <b1b40>   DW_AT_decl_file   : 8
    <b1b41>   DW_AT_decl_line   : 61
    <b1b42>   DW_AT_decl_column : 15
    <b1b43>   DW_AT_type        : <0xb1b47>
 <1><b1b47>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1b48>   DW_AT_byte_size   : 8
    <b1b48>   DW_AT_type        : <0xb1b4c>
 <1><b1b4c>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1b4d>   DW_AT_prototyped  : 1
    <b1b4d>   DW_AT_type        : <0xb183e>
    <b1b51>   DW_AT_sibling     : <0xb1b65>
 <2><b1b55>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b56>   DW_AT_type        : <0xb1a1c>
 <2><b1b5a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b5b>   DW_AT_type        : <0xb18db>
 <2><b1b5f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b60>   DW_AT_type        : <0xb183e>
 <2><b1b64>: Abbrev Number: 0
 <1><b1b65>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b66>   DW_AT_name        : (indirect string, offset: 0x1716a): FnFileTell
    <b1b6a>   DW_AT_decl_file   : 8
    <b1b6b>   DW_AT_decl_line   : 62
    <b1b6c>   DW_AT_decl_column : 15
    <b1b6d>   DW_AT_type        : <0xb1b71>
 <1><b1b71>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1b72>   DW_AT_byte_size   : 8
    <b1b72>   DW_AT_type        : <0xb1b76>
 <1><b1b76>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1b77>   DW_AT_prototyped  : 1
    <b1b77>   DW_AT_type        : <0xb183e>
    <b1b7b>   DW_AT_sibling     : <0xb1b8a>
 <2><b1b7f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b80>   DW_AT_type        : <0xb1a1c>
 <2><b1b84>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1b85>   DW_AT_type        : <0xb1b8a>
 <2><b1b89>: Abbrev Number: 0
 <1><b1b8a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1b8b>   DW_AT_byte_size   : 8
    <b1b8b>   DW_AT_type        : <0xb18db>
 <1><b1b8f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1b90>   DW_AT_name        : (indirect string, offset: 0x16fdd): FnFileRead
    <b1b94>   DW_AT_decl_file   : 8
    <b1b95>   DW_AT_decl_line   : 63
    <b1b96>   DW_AT_decl_column : 15
    <b1b97>   DW_AT_type        : <0xb1b9b>
 <1><b1b9b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1b9c>   DW_AT_byte_size   : 8
    <b1b9c>   DW_AT_type        : <0xb1ba0>
 <1><b1ba0>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1ba1>   DW_AT_prototyped  : 1
    <b1ba1>   DW_AT_type        : <0xb183e>
    <b1ba5>   DW_AT_sibling     : <0xb1bb9>
 <2><b1ba9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1baa>   DW_AT_type        : <0xb1a1c>
 <2><b1bae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1baf>   DW_AT_type        : <0xb1858>
 <2><b1bb3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1bb4>   DW_AT_type        : <0xb1bb9>
 <2><b1bb8>: Abbrev Number: 0
 <1><b1bb9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1bba>   DW_AT_byte_size   : 8
    <b1bba>   DW_AT_type        : <0xb1877>
 <1><b1bbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1bbf>   DW_AT_name        : (indirect string, offset: 0x17777): FnFileReadWstr
    <b1bc3>   DW_AT_decl_file   : 8
    <b1bc4>   DW_AT_decl_line   : 65
    <b1bc5>   DW_AT_decl_column : 15
    <b1bc6>   DW_AT_type        : <0xb1bca>
 <1><b1bca>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1bcb>   DW_AT_byte_size   : 8
    <b1bcb>   DW_AT_type        : <0xb1bcf>
 <1><b1bcf>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1bd0>   DW_AT_prototyped  : 1
    <b1bd0>   DW_AT_type        : <0xb183e>
    <b1bd4>   DW_AT_sibling     : <0xb1be8>
 <2><b1bd8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1bd9>   DW_AT_type        : <0xb1a1c>
 <2><b1bdd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1bde>   DW_AT_type        : <0xb19be>
 <2><b1be2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1be3>   DW_AT_type        : <0xb1bb9>
 <2><b1be7>: Abbrev Number: 0
 <1><b1be8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1be9>   DW_AT_name        : (indirect string, offset: 0x170b6): FnFileWrite
    <b1bed>   DW_AT_decl_file   : 8
    <b1bee>   DW_AT_decl_line   : 67
    <b1bef>   DW_AT_decl_column : 15
    <b1bf0>   DW_AT_type        : <0xb1bf4>
 <1><b1bf4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1bf5>   DW_AT_byte_size   : 8
    <b1bf5>   DW_AT_type        : <0xb1bf9>
 <1><b1bf9>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1bfa>   DW_AT_prototyped  : 1
    <b1bfa>   DW_AT_type        : <0xb183e>
    <b1bfe>   DW_AT_sibling     : <0xb1c12>
 <2><b1c02>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c03>   DW_AT_type        : <0xb1a1c>
 <2><b1c07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c08>   DW_AT_type        : <0xb18cb>
 <2><b1c0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c0d>   DW_AT_type        : <0xb1877>
 <2><b1c11>: Abbrev Number: 0
 <1><b1c12>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1c13>   DW_AT_name        : (indirect string, offset: 0x178ca): FnFileWriteWstr
    <b1c17>   DW_AT_decl_file   : 8
    <b1c18>   DW_AT_decl_line   : 69
    <b1c19>   DW_AT_decl_column : 15
    <b1c1a>   DW_AT_type        : <0xb1c1e>
 <1><b1c1e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1c1f>   DW_AT_byte_size   : 8
    <b1c1f>   DW_AT_type        : <0xb1c23>
 <1><b1c23>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1c24>   DW_AT_prototyped  : 1
    <b1c24>   DW_AT_type        : <0xb183e>
    <b1c28>   DW_AT_sibling     : <0xb1c3c>
 <2><b1c2c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c2d>   DW_AT_type        : <0xb1a1c>
 <2><b1c31>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c32>   DW_AT_type        : <0xb1c3c>
 <2><b1c36>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c37>   DW_AT_type        : <0xb1877>
 <2><b1c3b>: Abbrev Number: 0
 <1><b1c3c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1c3d>   DW_AT_byte_size   : 8
    <b1c3d>   DW_AT_type        : <0xb1890>
 <1><b1c41>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1c42>   DW_AT_name        : (indirect string, offset: 0x16f61): FnFileLock
    <b1c46>   DW_AT_decl_file   : 8
    <b1c47>   DW_AT_decl_line   : 71
    <b1c48>   DW_AT_decl_column : 15
    <b1c49>   DW_AT_type        : <0xb1c4d>
 <1><b1c4d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1c4e>   DW_AT_byte_size   : 8
    <b1c4e>   DW_AT_type        : <0xb1c52>
 <1><b1c52>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1c53>   DW_AT_prototyped  : 1
    <b1c53>   DW_AT_type        : <0xb183e>
    <b1c57>   DW_AT_sibling     : <0xb1c6b>
 <2><b1c5b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c5c>   DW_AT_type        : <0xb1a1c>
 <2><b1c60>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c61>   DW_AT_type        : <0xb18db>
 <2><b1c65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c66>   DW_AT_type        : <0xb18db>
 <2><b1c6a>: Abbrev Number: 0
 <1><b1c6b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1c6c>   DW_AT_name        : (indirect string, offset: 0x16e6d): FnFileUnlock
    <b1c70>   DW_AT_decl_file   : 8
    <b1c71>   DW_AT_decl_line   : 73
    <b1c72>   DW_AT_decl_column : 15
    <b1c73>   DW_AT_type        : <0xb1c4d>
 <1><b1c77>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1c78>   DW_AT_name        : (indirect string, offset: 0x1703d): FnFileReadLine
    <b1c7c>   DW_AT_decl_file   : 8
    <b1c7d>   DW_AT_decl_line   : 75
    <b1c7e>   DW_AT_decl_column : 15
    <b1c7f>   DW_AT_type        : <0xb1c83>
 <1><b1c83>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1c84>   DW_AT_byte_size   : 8
    <b1c84>   DW_AT_type        : <0xb1c88>
 <1><b1c88>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1c89>   DW_AT_prototyped  : 1
    <b1c89>   DW_AT_type        : <0xb183e>
    <b1c8d>   DW_AT_sibling     : <0xb1c9c>
 <2><b1c91>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c92>   DW_AT_type        : <0xb1a1c>
 <2><b1c96>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1c97>   DW_AT_type        : <0xb1c9c>
 <2><b1c9b>: Abbrev Number: 0
 <1><b1c9c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1c9d>   DW_AT_byte_size   : 8
    <b1c9d>   DW_AT_type        : <0xb19a4>
 <1><b1ca1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1ca2>   DW_AT_name        : (indirect string, offset: 0x17142): FnFileReadLineWstr
    <b1ca6>   DW_AT_decl_file   : 8
    <b1ca7>   DW_AT_decl_line   : 76
    <b1ca8>   DW_AT_decl_column : 15
    <b1ca9>   DW_AT_type        : <0xb1cad>
 <1><b1cad>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b1cae>   DW_AT_byte_size   : 8
    <b1cae>   DW_AT_type        : <0xb1cb2>
 <1><b1cb2>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <b1cb3>   DW_AT_prototyped  : 1
    <b1cb3>   DW_AT_type        : <0xb183e>
    <b1cb7>   DW_AT_sibling     : <0xb1ccb>
 <2><b1cbb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1cbc>   DW_AT_type        : <0xb1a1c>
 <2><b1cc0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1cc1>   DW_AT_type        : <0xb19be>
 <2><b1cc5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1cc6>   DW_AT_type        : <0xb18a8>
 <2><b1cca>: Abbrev Number: 0
 <1><b1ccb>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1ccc>   DW_AT_name        : (indirect string, offset: 0x17110): FnFileFlush
    <b1cd0>   DW_AT_decl_file   : 8
    <b1cd1>   DW_AT_decl_line   : 77
    <b1cd2>   DW_AT_decl_column : 15
    <b1cd3>   DW_AT_type        : <0xb1b1b>
 <1><b1cd7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b1cd8>   DW_AT_name        : (indirect string, offset: 0x177ba): _FB_FILE_HOOKS
    <b1cdc>   DW_AT_byte_size   : 112
    <b1cdd>   DW_AT_decl_file   : 8
    <b1cde>   DW_AT_decl_line   : 80
    <b1cdf>   DW_AT_decl_column : 16
    <b1ce0>   DW_AT_sibling     : <0xb1d9b>
 <2><b1ce4>: Abbrev Number: 2 (DW_TAG_member)
    <b1ce5>   DW_AT_name        : (indirect string, offset: 0x1788a): pfnEof
    <b1ce9>   DW_AT_decl_file   : 8
    <b1cea>   DW_AT_decl_line   : 81
    <b1ceb>   DW_AT_decl_column : 25
    <b1cec>   DW_AT_type        : <0xb1b0f>
    <b1cf0>   DW_AT_data_member_location: 0
 <2><b1cf1>: Abbrev Number: 2 (DW_TAG_member)
    <b1cf2>   DW_AT_name        : (indirect string, offset: 0x17074): pfnClose
    <b1cf6>   DW_AT_decl_file   : 8
    <b1cf7>   DW_AT_decl_line   : 82
    <b1cf8>   DW_AT_decl_column : 25
    <b1cf9>   DW_AT_type        : <0xb1b2f>
    <b1cfd>   DW_AT_data_member_location: 8
 <2><b1cfe>: Abbrev Number: 2 (DW_TAG_member)
    <b1cff>   DW_AT_name        : (indirect string, offset: 0x16e89): pfnSeek
    <b1d03>   DW_AT_decl_file   : 8
    <b1d04>   DW_AT_decl_line   : 83
    <b1d05>   DW_AT_decl_column : 25
    <b1d06>   DW_AT_type        : <0xb1b3b>
    <b1d0a>   DW_AT_data_member_location: 16
 <2><b1d0b>: Abbrev Number: 2 (DW_TAG_member)
    <b1d0c>   DW_AT_name        : (indirect string, offset: 0x16f2d): pfnTell
    <b1d10>   DW_AT_decl_file   : 8
    <b1d11>   DW_AT_decl_line   : 84
    <b1d12>   DW_AT_decl_column : 25
    <b1d13>   DW_AT_type        : <0xb1b65>
    <b1d17>   DW_AT_data_member_location: 24
 <2><b1d18>: Abbrev Number: 2 (DW_TAG_member)
    <b1d19>   DW_AT_name        : (indirect string, offset: 0x17035): pfnRead
    <b1d1d>   DW_AT_decl_file   : 8
    <b1d1e>   DW_AT_decl_line   : 85
    <b1d1f>   DW_AT_decl_column : 25
    <b1d20>   DW_AT_type        : <0xb1b8f>
    <b1d24>   DW_AT_data_member_location: 32
 <2><b1d25>: Abbrev Number: 2 (DW_TAG_member)
    <b1d26>   DW_AT_name        : (indirect string, offset: 0x174dd): pfnReadWstr
    <b1d2a>   DW_AT_decl_file   : 8
    <b1d2b>   DW_AT_decl_line   : 86
    <b1d2c>   DW_AT_decl_column : 25
    <b1d2d>   DW_AT_type        : <0xb1bbe>
    <b1d31>   DW_AT_data_member_location: 40
 <2><b1d32>: Abbrev Number: 2 (DW_TAG_member)
    <b1d33>   DW_AT_name        : (indirect string, offset: 0x171e1): pfnWrite
    <b1d37>   DW_AT_decl_file   : 8
    <b1d38>   DW_AT_decl_line   : 87
    <b1d39>   DW_AT_decl_column : 25
    <b1d3a>   DW_AT_type        : <0xb1be8>
    <b1d3e>   DW_AT_data_member_location: 48
 <2><b1d3f>: Abbrev Number: 2 (DW_TAG_member)
    <b1d40>   DW_AT_name        : (indirect string, offset: 0x171d4): pfnWriteWstr
    <b1d44>   DW_AT_decl_file   : 8
    <b1d45>   DW_AT_decl_line   : 88
    <b1d46>   DW_AT_decl_column : 25
    <b1d47>   DW_AT_type        : <0xb1c12>
    <b1d4b>   DW_AT_data_member_location: 56
 <2><b1d4c>: Abbrev Number: 2 (DW_TAG_member)
    <b1d4d>   DW_AT_name        : (indirect string, offset: 0x176c7): pfnLock
    <b1d51>   DW_AT_decl_file   : 8
    <b1d52>   DW_AT_decl_line   : 89
    <b1d53>   DW_AT_decl_column : 25
    <b1d54>   DW_AT_type        : <0xb1c41>
    <b1d58>   DW_AT_data_member_location: 64
 <2><b1d59>: Abbrev Number: 2 (DW_TAG_member)
    <b1d5a>   DW_AT_name        : (indirect string, offset: 0x1749d): pfnUnlock
    <b1d5e>   DW_AT_decl_file   : 8
    <b1d5f>   DW_AT_decl_line   : 90
    <b1d60>   DW_AT_decl_column : 25
    <b1d61>   DW_AT_type        : <0xb1c6b>
    <b1d65>   DW_AT_data_member_location: 72
 <2><b1d66>: Abbrev Number: 2 (DW_TAG_member)
    <b1d67>   DW_AT_name        : (indirect string, offset: 0x177e0): pfnReadLine
    <b1d6b>   DW_AT_decl_file   : 8
    <b1d6c>   DW_AT_decl_line   : 91
    <b1d6d>   DW_AT_decl_column : 25
    <b1d6e>   DW_AT_type        : <0xb1c77>
    <b1d72>   DW_AT_data_member_location: 80
 <2><b1d73>: Abbrev Number: 2 (DW_TAG_member)
    <b1d74>   DW_AT_name        : (indirect string, offset: 0x16ecc): pfnReadLineWstr
    <b1d78>   DW_AT_decl_file   : 8
    <b1d79>   DW_AT_decl_line   : 92
    <b1d7a>   DW_AT_decl_column : 25
    <b1d7b>   DW_AT_type        : <0xb1ca1>
    <b1d7f>   DW_AT_data_member_location: 88
 <2><b1d80>: Abbrev Number: 2 (DW_TAG_member)
    <b1d81>   DW_AT_name        : (indirect string, offset: 0x172dd): pfnSetWidth
