 <2><890e3>: Abbrev Number: 8 (DW_TAG_member)
    <890e4>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <890e8>   DW_AT_decl_file   : 8
    <890e8>   DW_AT_decl_line   : 314
    <890ea>   DW_AT_decl_column : 9
    <890eb>   DW_AT_type        : <0x89207>
    <890ef>   DW_AT_data_member_location: 88
 <2><890f0>: Abbrev Number: 8 (DW_TAG_member)
    <890f1>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <890f5>   DW_AT_decl_file   : 8
    <890f5>   DW_AT_decl_line   : 321
    <890f7>   DW_AT_decl_column : 9
    <890f8>   DW_AT_type        : <0x88ccc>
    <890fc>   DW_AT_data_member_location: 96
 <2><890fd>: Abbrev Number: 8 (DW_TAG_member)
    <890fe>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <89102>   DW_AT_decl_file   : 8
    <89102>   DW_AT_decl_line   : 328
    <89104>   DW_AT_decl_column : 9
    <89105>   DW_AT_type        : <0x88ccc>
    <89109>   DW_AT_data_member_location: 104
 <2><8910a>: Abbrev Number: 0
 <1><8910b>: Abbrev Number: 13 (DW_TAG_const_type)
    <8910c>   DW_AT_type        : <0x89047>
 <1><89110>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89111>   DW_AT_byte_size   : 8
    <89111>   DW_AT_type        : <0x8910b>
 <1><89115>: Abbrev Number: 25 (DW_TAG_structure_type)
    <89116>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <8911a>   DW_AT_byte_size   : 16
    <8911a>   DW_AT_decl_file   : 8
    <8911a>   DW_AT_decl_line   : 331
    <8911c>   DW_AT_decl_column : 16
    <8911c>   DW_AT_sibling     : <0x8913b>
 <2><89120>: Abbrev Number: 8 (DW_TAG_member)
    <89121>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <89125>   DW_AT_decl_file   : 8
    <89125>   DW_AT_decl_line   : 333
    <89127>   DW_AT_decl_column : 12
    <89128>   DW_AT_type        : <0x88c6b>
    <8912c>   DW_AT_data_member_location: 0
 <2><8912d>: Abbrev Number: 8 (DW_TAG_member)
    <8912e>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <89132>   DW_AT_decl_file   : 8
    <89132>   DW_AT_decl_line   : 334
    <89134>   DW_AT_decl_column : 23
    <89135>   DW_AT_type        : <0x8920c>
    <89139>   DW_AT_data_member_location: 8
 <2><8913a>: Abbrev Number: 0
 <1><8913b>: Abbrev Number: 13 (DW_TAG_const_type)
    <8913c>   DW_AT_type        : <0x89115>
 <1><89140>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89141>   DW_AT_byte_size   : 8
    <89141>   DW_AT_type        : <0x8913b>
 <1><89145>: Abbrev Number: 25 (DW_TAG_structure_type)
    <89146>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <8914a>   DW_AT_byte_size   : 16
    <8914a>   DW_AT_decl_file   : 8
    <8914a>   DW_AT_decl_line   : 337
    <8914c>   DW_AT_decl_column : 16
    <8914c>   DW_AT_sibling     : <0x89172>
 <2><89150>: Abbrev Number: 26 (DW_TAG_member)
    <89151>   DW_AT_name        : w
    <89153>   DW_AT_decl_file   : 8
    <89153>   DW_AT_decl_line   : 339
    <89155>   DW_AT_decl_column : 15
    <89155>   DW_AT_type        : <0x88c6b>
    <89159>   DW_AT_data_member_location: 0
 <2><8915a>: Abbrev Number: 26 (DW_TAG_member)
    <8915b>   DW_AT_name        : h
    <8915d>   DW_AT_decl_file   : 8
    <8915d>   DW_AT_decl_line   : 340
    <8915f>   DW_AT_decl_column : 15
    <8915f>   DW_AT_type        : <0x88c6b>
    <89163>   DW_AT_data_member_location: 4
 <2><89164>: Abbrev Number: 8 (DW_TAG_member)
    <89165>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <89169>   DW_AT_decl_file   : 8
    <89169>   DW_AT_decl_line   : 341
    <8916b>   DW_AT_decl_column : 23
    <8916c>   DW_AT_type        : <0x8920c>
    <89170>   DW_AT_data_member_location: 8
 <2><89171>: Abbrev Number: 0
 <1><89172>: Abbrev Number: 13 (DW_TAG_const_type)
    <89173>   DW_AT_type        : <0x89145>
 <1><89177>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89178>   DW_AT_byte_size   : 8
    <89178>   DW_AT_type        : <0x89172>
 <1><8917c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8917d>   DW_AT_byte_size   : 8
    <8917d>   DW_AT_type        : <0x89181>
 <1><89181>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89182>   DW_AT_byte_size   : 8
    <89182>   DW_AT_type        : <0x88e73>
 <1><89186>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89187>   DW_AT_byte_size   : 8
    <89187>   DW_AT_type        : <0x88d26>
 <1><8918b>: Abbrev Number: 11 (DW_TAG_typedef)
    <8918c>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <89190>   DW_AT_decl_file   : 8
    <89191>   DW_AT_decl_line   : 176
    <89192>   DW_AT_decl_column : 3
    <89193>   DW_AT_type        : <0x88e7f>
 <1><89197>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <89198>   DW_AT_prototyped  : 1
    <89198>   DW_AT_type        : <0x88c5f>
    <8919c>   DW_AT_sibling     : <0x891bf>
 <2><891a0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891a1>   DW_AT_type        : <0x88c83>
 <2><891a5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891a6>   DW_AT_type        : <0x88c5f>
 <2><891aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891ab>   DW_AT_type        : <0x88c5f>
 <2><891af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891b0>   DW_AT_type        : <0x88c5f>
 <2><891b4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891b5>   DW_AT_type        : <0x88c5f>
 <2><891b9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891ba>   DW_AT_type        : <0x88c5f>
 <2><891be>: Abbrev Number: 0
 <1><891bf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <891c0>   DW_AT_byte_size   : 8
    <891c0>   DW_AT_type        : <0x89197>
 <1><891c4>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <891c5>   DW_AT_prototyped  : 1
    <891c5>   DW_AT_sibling     : <0x891de>
 <2><891c9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891ca>   DW_AT_type        : <0x88c5f>
 <2><891ce>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891cf>   DW_AT_type        : <0x88c5f>
 <2><891d3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891d4>   DW_AT_type        : <0x88c5f>
 <2><891d8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891d9>   DW_AT_type        : <0x88c5f>
 <2><891dd>: Abbrev Number: 0
 <1><891de>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <891df>   DW_AT_byte_size   : 8
    <891df>   DW_AT_type        : <0x891c4>
 <1><891e3>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <891e4>   DW_AT_prototyped  : 1
    <891e4>   DW_AT_sibling     : <0x891ee>
 <2><891e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891e9>   DW_AT_type        : <0x88c83>
 <2><891ed>: Abbrev Number: 0
 <1><891ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <891ef>   DW_AT_byte_size   : 8
    <891ef>   DW_AT_type        : <0x891e3>
 <1><891f3>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <891f4>   DW_AT_prototyped  : 1
    <891f4>   DW_AT_type        : <0x88e05>
    <891f8>   DW_AT_sibling     : <0x89207>
 <2><891fc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <891fd>   DW_AT_type        : <0x88c5f>
 <2><89201>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89202>   DW_AT_type        : <0x88e05>
 <2><89206>: Abbrev Number: 0
 <1><89207>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89208>   DW_AT_byte_size   : 8
    <89208>   DW_AT_type        : <0x891f3>
 <1><8920c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8920d>   DW_AT_byte_size   : 8
    <8920d>   DW_AT_type        : <0x88c37>
 <1><89211>: Abbrev Number: 43 (DW_TAG_variable)
    <89212>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <89216>   DW_AT_decl_file   : 8
    <89217>   DW_AT_decl_line   : 364
    <89219>   DW_AT_decl_column : 15
    <8921a>   DW_AT_type        : <0x8921e>
    <8921e>   DW_AT_external    : 1
    <8921e>   DW_AT_declaration : 1
 <1><8921e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8921f>   DW_AT_byte_size   : 8
    <8921f>   DW_AT_type        : <0x8918b>
 <1><89223>: Abbrev Number: 19 (DW_TAG_subprogram)
    <89224>   DW_AT_external    : 1
    <89224>   DW_AT_name        : (indirect string, offset: 0x1843d): strcpy
    <89228>   DW_AT_decl_file   : 9
    <89229>   DW_AT_decl_line   : 125
    <8922a>   DW_AT_decl_column : 14
    <8922b>   DW_AT_prototyped  : 1
    <8922b>   DW_AT_type        : <0x88c83>
    <8922f>   DW_AT_declaration : 1
    <8922f>   DW_AT_sibling     : <0x8923e>
 <2><89233>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89234>   DW_AT_type        : <0x88c83>
 <2><89238>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89239>   DW_AT_type        : <0x88cc7>
 <2><8923d>: Abbrev Number: 0
 <1><8923e>: Abbrev Number: 19 (DW_TAG_subprogram)
    <8923f>   DW_AT_external    : 1
    <8923f>   DW_AT_name        : (indirect string, offset: 0x1842e): fb_hStrRealloc
    <89243>   DW_AT_decl_file   : 5
    <89244>   DW_AT_decl_line   : 108
    <89245>   DW_AT_decl_column : 21
    <89246>   DW_AT_prototyped  : 1
    <89246>   DW_AT_type        : <0x88d21>
    <8924a>   DW_AT_declaration : 1
    <8924a>   DW_AT_sibling     : <0x8925e>
 <2><8924e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8924f>   DW_AT_type        : <0x88d21>
 <2><89253>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89254>   DW_AT_type        : <0x88cb4>
 <2><89258>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89259>   DW_AT_type        : <0x88c5f>
 <2><8925d>: Abbrev Number: 0
 <1><8925e>: Abbrev Number: 44 (DW_TAG_subprogram)
    <8925f>   DW_AT_external    : 1
    <8925f>   DW_AT_name        : (indirect string, offset: 0x17063): strlen
    <89263>   DW_AT_decl_file   : 9
    <89264>   DW_AT_decl_line   : 391
    <89266>   DW_AT_decl_column : 15
    <89267>   DW_AT_prototyped  : 1
    <89267>   DW_AT_type        : <0x88c94>
    <8926b>   DW_AT_declaration : 1
    <8926b>   DW_AT_sibling     : <0x89275>
 <2><8926f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89270>   DW_AT_type        : <0x88cc7>
 <2><89274>: Abbrev Number: 0
 <1><89275>: Abbrev Number: 19 (DW_TAG_subprogram)
    <89276>   DW_AT_external    : 1
    <89276>   DW_AT_name        : (indirect string, offset: 0x16834): fb_hStrDelTemp
    <8927a>   DW_AT_decl_file   : 5
    <8927b>   DW_AT_decl_line   : 111
    <8927c>   DW_AT_decl_column : 21
    <8927d>   DW_AT_prototyped  : 1
    <8927d>   DW_AT_type        : <0x88c5f>
    <89281>   DW_AT_declaration : 1
    <89281>   DW_AT_sibling     : <0x8928b>
 <2><89285>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89286>   DW_AT_type        : <0x88d21>
 <2><8928a>: Abbrev Number: 0
 <1><8928b>: Abbrev Number: 45 (DW_TAG_subprogram)
    <8928c>   DW_AT_external    : 1
    <8928c>   DW_AT_name        : (indirect string, offset: 0x17337): fb_hScreenInfo
    <89290>   DW_AT_decl_file   : 8
    <89291>   DW_AT_decl_line   : 416
    <89293>   DW_AT_decl_column : 13
    <89294>   DW_AT_prototyped  : 1
    <89294>   DW_AT_declaration : 1
    <89294>   DW_AT_sibling     : <0x892ad>
 <2><89298>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89299>   DW_AT_type        : <0x892ad>
 <2><8929d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8929e>   DW_AT_type        : <0x892ad>
 <2><892a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <892a3>   DW_AT_type        : <0x892ad>
 <2><892a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <892a8>   DW_AT_type        : <0x892ad>
 <2><892ac>: Abbrev Number: 0
 <1><892ad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <892ae>   DW_AT_byte_size   : 8
    <892ae>   DW_AT_type        : <0x88cb4>
 <1><892b2>: Abbrev Number: 28 (DW_TAG_subprogram)
    <892b3>   DW_AT_external    : 1
    <892b3>   DW_AT_name        : (indirect string, offset: 0xcf85): fb_GfxScreenInfo64
    <892b7>   DW_AT_decl_file   : 1
    <892b7>   DW_AT_decl_line   : 63
    <892b8>   DW_AT_decl_column : 13
    <892b8>   DW_AT_prototyped  : 1
    <892b8>   DW_AT_low_pc      : 0x461120
    <892c0>   DW_AT_high_pc     : 0x154
    <892c8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <892ca>   DW_AT_call_all_calls: 1
    <892ca>   DW_AT_sibling     : <0x89485>
 <2><892ce>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <892cf>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <892d3>   DW_AT_decl_file   : 1
    <892d3>   DW_AT_decl_line   : 65
    <892d4>   DW_AT_decl_column : 14
    <892d5>   DW_AT_type        : <0x89485>
    <892d9>   DW_AT_location    : 0x2a121 (location list)
    <892dd>   DW_AT_GNU_locviews: 0x2a115
 <2><892e1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <892e2>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <892e6>   DW_AT_decl_file   : 1
    <892e6>   DW_AT_decl_line   : 66
    <892e7>   DW_AT_decl_column : 14
    <892e8>   DW_AT_type        : <0x89485>
    <892ec>   DW_AT_location    : 0x2a15b (location list)
    <892f0>   DW_AT_GNU_locviews: 0x2a14f
 <2><892f4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <892f5>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <892f9>   DW_AT_decl_file   : 1
    <892f9>   DW_AT_decl_line   : 67
    <892fa>   DW_AT_decl_column : 14
    <892fb>   DW_AT_type        : <0x89485>
    <892ff>   DW_AT_location    : 0x2a195 (location list)
    <89303>   DW_AT_GNU_locviews: 0x2a189
 <2><89307>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <89308>   DW_AT_name        : bpp
    <8930c>   DW_AT_decl_file   : 1
    <8930c>   DW_AT_decl_line   : 68
    <8930d>   DW_AT_decl_column : 14
    <8930e>   DW_AT_type        : <0x89485>
    <89312>   DW_AT_location    : 0x2a1d1 (location list)
    <89316>   DW_AT_GNU_locviews: 0x2a1c3
 <2><8931a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <8931b>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8931f>   DW_AT_decl_file   : 1
    <8931f>   DW_AT_decl_line   : 69
    <89320>   DW_AT_decl_column : 14
    <89321>   DW_AT_type        : <0x89485>
    <89325>   DW_AT_location    : 0x2a211 (location list)
    <89329>   DW_AT_GNU_locviews: 0x2a209
 <2><8932d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <8932e>   DW_AT_name        : (indirect string, offset: 0x16fa0): refresh
    <89332>   DW_AT_decl_file   : 1
    <89332>   DW_AT_decl_line   : 70
    <89333>   DW_AT_decl_column : 14
    <89334>   DW_AT_type        : <0x89485>
    <89338>   DW_AT_location    : 0x2a23a (location list)
    <8933c>   DW_AT_GNU_locviews: 0x2a232
 <2><89340>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <89341>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <89345>   DW_AT_decl_file   : 1
    <89345>   DW_AT_decl_line   : 71
    <89346>   DW_AT_decl_column : 13
    <89346>   DW_AT_type        : <0x88d21>
    <8934a>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><8934d>: Abbrev Number: 12 (DW_TAG_variable)
    <8934e>   DW_AT_name        : w
    <89350>   DW_AT_decl_file   : 1
    <89350>   DW_AT_decl_line   : 74
    <89351>   DW_AT_decl_column : 10
    <89352>   DW_AT_type        : <0x88cb4>
    <89356>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <2><8935a>: Abbrev Number: 12 (DW_TAG_variable)
    <8935b>   DW_AT_name        : h
    <8935d>   DW_AT_decl_file   : 1
    <8935d>   DW_AT_decl_line   : 74
    <8935e>   DW_AT_decl_column : 13
    <8935f>   DW_AT_type        : <0x88cb4>
    <89363>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><89367>: Abbrev Number: 12 (DW_TAG_variable)
    <89368>   DW_AT_name        : d
    <8936a>   DW_AT_decl_file   : 1
    <8936a>   DW_AT_decl_line   : 74
    <8936b>   DW_AT_decl_column : 16
    <8936c>   DW_AT_type        : <0x88cb4>
    <89370>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><89374>: Abbrev Number: 18 (DW_TAG_variable)
    <89375>   DW_AT_name        : b
    <89377>   DW_AT_decl_file   : 1
    <89377>   DW_AT_decl_line   : 74
    <89378>   DW_AT_decl_column : 19
    <89379>   DW_AT_type        : <0x88cb4>
    <8937d>   DW_AT_location    : 0x2a263 (location list)
    <89381>   DW_AT_GNU_locviews: 0x2a25b
 <2><89385>: Abbrev Number: 18 (DW_TAG_variable)
    <89386>   DW_AT_name        : p
    <89388>   DW_AT_decl_file   : 1
    <89388>   DW_AT_decl_line   : 74
    <89389>   DW_AT_decl_column : 22
    <8938a>   DW_AT_type        : <0x88cb4>
    <8938e>   DW_AT_location    : 0x2a28d (location list)
    <89392>   DW_AT_GNU_locviews: 0x2a285
 <2><89396>: Abbrev Number: 12 (DW_TAG_variable)
    <89397>   DW_AT_name        : r
    <89399>   DW_AT_decl_file   : 1
    <89399>   DW_AT_decl_line   : 74
    <8939a>   DW_AT_decl_column : 25
    <8939b>   DW_AT_type        : <0x88cb4>
    <8939f>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><893a3>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <893a4>   DW_AT_abstract_origin: <0x8965d>
    <893a8>   DW_AT_ranges      : 0x174c5
    <893ac>   DW_AT_call_file   : 1
    <893ac>   DW_AT_call_line   : 75
    <893ad>   DW_AT_call_column : 2
    <893ad>   DW_AT_sibling     : <0x89477>
 <3><893b1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893b2>   DW_AT_abstract_origin: <0x896ad>
 <3><893b6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893b7>   DW_AT_abstract_origin: <0x896a2>
 <3><893bb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893bc>   DW_AT_abstract_origin: <0x89697>
 <3><893c0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893c1>   DW_AT_abstract_origin: <0x8968b>
 <3><893c5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893c6>   DW_AT_abstract_origin: <0x89680>
 <3><893ca>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893cb>   DW_AT_abstract_origin: <0x89675>
 <3><893cf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <893d0>   DW_AT_abstract_origin: <0x8966a>
 <3><893d4>: Abbrev Number: 32 (DW_TAG_lexical_block)
    <893d5>   DW_AT_ranges      : 0x174c5
 <4><893d9>: Abbrev Number: 20 (DW_TAG_variable)
    <893da>   DW_AT_abstract_origin: <0x896b8>
    <893de>   DW_AT_location    : 0x2a2b5 (location list)
    <893e2>   DW_AT_GNU_locviews: 0x2a2af
 <4><893e6>: Abbrev Number: 9 (DW_TAG_call_site)
    <893e7>   DW_AT_call_return_pc: 0x4611b1
    <893ef>   DW_AT_call_origin : <0x89275>
    <893f3>   DW_AT_sibling     : <0x893fe>
 <5><893f7>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <893f8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <893fa>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><893fd>: Abbrev Number: 0
 <4><893fe>: Abbrev Number: 9 (DW_TAG_call_site)
    <893ff>   DW_AT_call_return_pc: 0x461218
    <89407>   DW_AT_call_origin : <0x8925e>
    <8940b>   DW_AT_sibling     : <0x89416>
 <5><8940f>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89410>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89412>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><89415>: Abbrev Number: 0
 <4><89416>: Abbrev Number: 9 (DW_TAG_call_site)
    <89417>   DW_AT_call_return_pc: 0x461225
    <8941f>   DW_AT_call_origin : <0x8923e>
    <89423>   DW_AT_sibling     : <0x89433>
 <5><89427>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89428>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8942a>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><8942d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8942e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <89430>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><89432>: Abbrev Number: 0
 <4><89433>: Abbrev Number: 9 (DW_TAG_call_site)
    <89434>   DW_AT_call_return_pc: 0x461230
    <8943c>   DW_AT_call_origin : <0x89223>
    <89440>   DW_AT_sibling     : <0x8944b>
 <5><89444>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89445>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <89447>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><8944a>: Abbrev Number: 0
 <4><8944b>: Abbrev Number: 21 (DW_TAG_call_site)
    <8944c>   DW_AT_call_return_pc: 0x461251
    <89454>   DW_AT_call_origin : <0x8928b>
 <5><89458>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89459>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8945b>   DW_AT_call_value  : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <5><8945f>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89460>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <89462>   DW_AT_call_value  : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <5><89466>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89467>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <89469>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <5><8946d>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8946e>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <89470>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <5><89474>: Abbrev Number: 0
 <4><89475>: Abbrev Number: 0
 <3><89476>: Abbrev Number: 0
 <2><89477>: Abbrev Number: 33 (DW_TAG_call_site)
    <89478>   DW_AT_call_return_pc: 0x461274
    <89480>   DW_AT_call_origin : <0x897b3>
 <2><89484>: Abbrev Number: 0
 <1><89485>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89486>   DW_AT_byte_size   : 8
    <89486>   DW_AT_type        : <0x88cad>
 <1><8948a>: Abbrev Number: 28 (DW_TAG_subprogram)
    <8948b>   DW_AT_external    : 1
    <8948b>   DW_AT_name        : (indirect string, offset: 0x1840a): fb_GfxScreenInfo32
    <8948f>   DW_AT_decl_file   : 1
    <8948f>   DW_AT_decl_line   : 42
    <89490>   DW_AT_decl_column : 13
    <89490>   DW_AT_prototyped  : 1
    <89490>   DW_AT_low_pc      : 0x460fc0
    <89498>   DW_AT_high_pc     : 0x152
    <894a0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <894a2>   DW_AT_call_all_calls: 1
    <894a2>   DW_AT_sibling     : <0x8965d>
 <2><894a6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <894a7>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <894ab>   DW_AT_decl_file   : 1
    <894ab>   DW_AT_decl_line   : 44
    <894ac>   DW_AT_decl_column : 8
    <894ad>   DW_AT_type        : <0x88e05>
    <894b1>   DW_AT_location    : 0x2a2e0 (location list)
    <894b5>   DW_AT_GNU_locviews: 0x2a2d4
 <2><894b9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <894ba>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <894be>   DW_AT_decl_file   : 1
    <894be>   DW_AT_decl_line   : 45
    <894bf>   DW_AT_decl_column : 8
    <894c0>   DW_AT_type        : <0x88e05>
    <894c4>   DW_AT_location    : 0x2a31a (location list)
    <894c8>   DW_AT_GNU_locviews: 0x2a30e
 <2><894cc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <894cd>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <894d1>   DW_AT_decl_file   : 1
    <894d1>   DW_AT_decl_line   : 46
    <894d2>   DW_AT_decl_column : 8
    <894d3>   DW_AT_type        : <0x88e05>
    <894d7>   DW_AT_location    : 0x2a354 (location list)
    <894db>   DW_AT_GNU_locviews: 0x2a348
 <2><894df>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <894e0>   DW_AT_name        : bpp
    <894e4>   DW_AT_decl_file   : 1
    <894e4>   DW_AT_decl_line   : 47
    <894e5>   DW_AT_decl_column : 8
    <894e6>   DW_AT_type        : <0x88e05>
    <894ea>   DW_AT_location    : 0x2a390 (location list)
    <894ee>   DW_AT_GNU_locviews: 0x2a382
 <2><894f2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <894f3>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <894f7>   DW_AT_decl_file   : 1
    <894f7>   DW_AT_decl_line   : 48
    <894f8>   DW_AT_decl_column : 8
    <894f9>   DW_AT_type        : <0x88e05>
    <894fd>   DW_AT_location    : 0x2a3d0 (location list)
    <89501>   DW_AT_GNU_locviews: 0x2a3c8
 <2><89505>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <89506>   DW_AT_name        : (indirect string, offset: 0x16fa0): refresh
    <8950a>   DW_AT_decl_file   : 1
    <8950a>   DW_AT_decl_line   : 49
    <8950b>   DW_AT_decl_column : 8
    <8950c>   DW_AT_type        : <0x88e05>
    <89510>   DW_AT_location    : 0x2a3f9 (location list)
    <89514>   DW_AT_GNU_locviews: 0x2a3f1
 <2><89518>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <89519>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <8951d>   DW_AT_decl_file   : 1
    <8951d>   DW_AT_decl_line   : 50
    <8951e>   DW_AT_decl_column : 13
    <8951e>   DW_AT_type        : <0x88d21>
    <89522>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><89525>: Abbrev Number: 12 (DW_TAG_variable)
    <89526>   DW_AT_name        : w
    <89528>   DW_AT_decl_file   : 1
    <89528>   DW_AT_decl_line   : 53
    <89529>   DW_AT_decl_column : 10
    <8952a>   DW_AT_type        : <0x88cb4>
    <8952e>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <2><89532>: Abbrev Number: 12 (DW_TAG_variable)
    <89533>   DW_AT_name        : h
    <89535>   DW_AT_decl_file   : 1
    <89535>   DW_AT_decl_line   : 53
    <89536>   DW_AT_decl_column : 13
    <89537>   DW_AT_type        : <0x88cb4>
    <8953b>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><8953f>: Abbrev Number: 12 (DW_TAG_variable)
    <89540>   DW_AT_name        : d
    <89542>   DW_AT_decl_file   : 1
    <89542>   DW_AT_decl_line   : 53
    <89543>   DW_AT_decl_column : 16
    <89544>   DW_AT_type        : <0x88cb4>
    <89548>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><8954c>: Abbrev Number: 18 (DW_TAG_variable)
    <8954d>   DW_AT_name        : b
    <8954f>   DW_AT_decl_file   : 1
    <8954f>   DW_AT_decl_line   : 53
    <89550>   DW_AT_decl_column : 19
    <89551>   DW_AT_type        : <0x88cb4>
    <89555>   DW_AT_location    : 0x2a41e (location list)
    <89559>   DW_AT_GNU_locviews: 0x2a41a
 <2><8955d>: Abbrev Number: 18 (DW_TAG_variable)
    <8955e>   DW_AT_name        : p
    <89560>   DW_AT_decl_file   : 1
    <89560>   DW_AT_decl_line   : 53
    <89561>   DW_AT_decl_column : 22
    <89562>   DW_AT_type        : <0x88cb4>
    <89566>   DW_AT_location    : 0x2a43a (location list)
    <8956a>   DW_AT_GNU_locviews: 0x2a436
 <2><8956e>: Abbrev Number: 12 (DW_TAG_variable)
    <8956f>   DW_AT_name        : r
    <89571>   DW_AT_decl_file   : 1
    <89571>   DW_AT_decl_line   : 53
    <89572>   DW_AT_decl_column : 25
    <89573>   DW_AT_type        : <0x88cb4>
    <89577>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><8957b>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <8957c>   DW_AT_abstract_origin: <0x8965d>
    <89580>   DW_AT_ranges      : 0x174ba
    <89584>   DW_AT_call_file   : 1
    <89584>   DW_AT_call_line   : 54
    <89585>   DW_AT_call_column : 2
    <89585>   DW_AT_sibling     : <0x8964f>
 <3><89589>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8958a>   DW_AT_abstract_origin: <0x896ad>
 <3><8958e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8958f>   DW_AT_abstract_origin: <0x896a2>
 <3><89593>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <89594>   DW_AT_abstract_origin: <0x89697>
 <3><89598>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <89599>   DW_AT_abstract_origin: <0x8968b>
 <3><8959d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8959e>   DW_AT_abstract_origin: <0x89680>
 <3><895a2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <895a3>   DW_AT_abstract_origin: <0x89675>
 <3><895a7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <895a8>   DW_AT_abstract_origin: <0x8966a>
 <3><895ac>: Abbrev Number: 32 (DW_TAG_lexical_block)
    <895ad>   DW_AT_ranges      : 0x174ba
 <4><895b1>: Abbrev Number: 20 (DW_TAG_variable)
    <895b2>   DW_AT_abstract_origin: <0x896b8>
    <895b6>   DW_AT_location    : 0x2a458 (location list)
    <895ba>   DW_AT_GNU_locviews: 0x2a452
 <4><895be>: Abbrev Number: 9 (DW_TAG_call_site)
    <895bf>   DW_AT_call_return_pc: 0x46104e
    <895c7>   DW_AT_call_origin : <0x89275>
    <895cb>   DW_AT_sibling     : <0x895d6>
 <5><895cf>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <895d0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <895d2>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><895d5>: Abbrev Number: 0
 <4><895d6>: Abbrev Number: 9 (DW_TAG_call_site)
    <895d7>   DW_AT_call_return_pc: 0x4610b8
    <895df>   DW_AT_call_origin : <0x8925e>
    <895e3>   DW_AT_sibling     : <0x895ee>
 <5><895e7>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <895e8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <895ea>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><895ed>: Abbrev Number: 0
 <4><895ee>: Abbrev Number: 9 (DW_TAG_call_site)
    <895ef>   DW_AT_call_return_pc: 0x4610c5
    <895f7>   DW_AT_call_origin : <0x8923e>
    <895fb>   DW_AT_sibling     : <0x8960b>
 <5><895ff>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89600>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89602>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <5><89605>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89606>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <89608>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <5><8960a>: Abbrev Number: 0
 <4><8960b>: Abbrev Number: 9 (DW_TAG_call_site)
    <8960c>   DW_AT_call_return_pc: 0x4610d0
    <89614>   DW_AT_call_origin : <0x89223>
    <89618>   DW_AT_sibling     : <0x89623>
 <5><8961c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8961d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8961f>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <5><89622>: Abbrev Number: 0
 <4><89623>: Abbrev Number: 21 (DW_TAG_call_site)
    <89624>   DW_AT_call_return_pc: 0x4610f1
    <8962c>   DW_AT_call_origin : <0x8928b>
 <5><89630>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89631>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89633>   DW_AT_call_value  : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <5><89637>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89638>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <8963a>   DW_AT_call_value  : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <5><8963e>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8963f>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <89641>   DW_AT_call_value  : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <5><89645>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89646>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <89648>   DW_AT_call_value  : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <5><8964c>: Abbrev Number: 0
 <4><8964d>: Abbrev Number: 0
 <3><8964e>: Abbrev Number: 0
 <2><8964f>: Abbrev Number: 33 (DW_TAG_call_site)
    <89650>   DW_AT_call_return_pc: 0x461112
    <89658>   DW_AT_call_origin : <0x897b3>
 <2><8965c>: Abbrev Number: 0
 <1><8965d>: Abbrev Number: 46 (DW_TAG_subprogram)
    <8965e>   DW_AT_external    : 1
    <8965e>   DW_AT_name        : (indirect string, offset: 0x1841d): fb_GfxScreenInfo
    <89662>   DW_AT_decl_file   : 1
    <89663>   DW_AT_decl_line   : 5
    <89664>   DW_AT_decl_column : 13
    <89665>   DW_AT_prototyped  : 1
    <89665>   DW_AT_inline      : 1	(inlined)
    <89666>   DW_AT_sibling     : <0x896c5>
 <2><8966a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8966b>   DW_AT_name        : (indirect string, offset: 0x1a89a): width
    <8966f>   DW_AT_decl_file   : 1
    <8966f>   DW_AT_decl_line   : 7
    <89670>   DW_AT_decl_column : 12
    <89671>   DW_AT_type        : <0x892ad>
 <2><89675>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <89676>   DW_AT_name        : (indirect string, offset: 0x198ab): height
    <8967a>   DW_AT_decl_file   : 1
    <8967a>   DW_AT_decl_line   : 8
    <8967b>   DW_AT_decl_column : 12
    <8967c>   DW_AT_type        : <0x892ad>
 <2><89680>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <89681>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <89685>   DW_AT_decl_file   : 1
    <89685>   DW_AT_decl_line   : 9
    <89686>   DW_AT_decl_column : 12
    <89687>   DW_AT_type        : <0x892ad>
 <2><8968b>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <8968c>   DW_AT_name        : bpp
    <89690>   DW_AT_decl_file   : 1
    <89691>   DW_AT_decl_line   : 10
    <89692>   DW_AT_decl_column : 12
    <89693>   DW_AT_type        : <0x892ad>
 <2><89697>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <89698>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8969c>   DW_AT_decl_file   : 1
    <8969c>   DW_AT_decl_line   : 11
    <8969d>   DW_AT_decl_column : 12
    <8969e>   DW_AT_type        : <0x892ad>
 <2><896a2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <896a3>   DW_AT_name        : (indirect string, offset: 0x16fa0): refresh
    <896a7>   DW_AT_decl_file   : 1
    <896a7>   DW_AT_decl_line   : 12
    <896a8>   DW_AT_decl_column : 12
    <896a9>   DW_AT_type        : <0x892ad>
 <2><896ad>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <896ae>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <896b2>   DW_AT_decl_file   : 1
    <896b2>   DW_AT_decl_line   : 13
    <896b3>   DW_AT_decl_column : 13
    <896b4>   DW_AT_type        : <0x88d21>
 <2><896b8>: Abbrev Number: 48 (DW_TAG_variable)
    <896b9>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <896bd>   DW_AT_decl_file   : 1
    <896be>   DW_AT_decl_line   : 16
    <896bf>   DW_AT_decl_column : 8
    <896c0>   DW_AT_type        : <0x88c83>
 <2><896c4>: Abbrev Number: 0
 <1><896c5>: Abbrev Number: 49 (DW_TAG_subprogram)
    <896c6>   DW_AT_abstract_origin: <0x8965d>
    <896ca>   DW_AT_low_pc      : 0x460f00
    <896d2>   DW_AT_high_pc     : 0xc0
    <896da>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <896dc>   DW_AT_call_all_calls: 1
    <896dc>   DW_AT_sibling     : <0x897b3>
 <2><896e0>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <896e1>   DW_AT_abstract_origin: <0x8966a>
    <896e5>   DW_AT_location    : 0x2a47f (location list)
    <896e9>   DW_AT_GNU_locviews: 0x2a477
 <2><896ed>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <896ee>   DW_AT_abstract_origin: <0x89675>
    <896f2>   DW_AT_location    : 0x2a4a7 (location list)
    <896f6>   DW_AT_GNU_locviews: 0x2a49f
 <2><896fa>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <896fb>   DW_AT_abstract_origin: <0x89680>
    <896ff>   DW_AT_location    : 0x2a4cf (location list)
    <89703>   DW_AT_GNU_locviews: 0x2a4c7
 <2><89707>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <89708>   DW_AT_abstract_origin: <0x8968b>
    <8970c>   DW_AT_location    : 0x2a4fd (location list)
    <89710>   DW_AT_GNU_locviews: 0x2a4ef
 <2><89714>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <89715>   DW_AT_abstract_origin: <0x89697>
    <89719>   DW_AT_location    : 0x2a53a (location list)
    <8971d>   DW_AT_GNU_locviews: 0x2a52e
 <2><89721>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <89722>   DW_AT_abstract_origin: <0x896a2>
    <89726>   DW_AT_location    : 0x2a56c (location list)
    <8972a>   DW_AT_GNU_locviews: 0x2a564
 <2><8972e>: Abbrev Number: 50 (DW_TAG_formal_parameter)
    <8972f>   DW_AT_abstract_origin: <0x896ad>
    <89733>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><89736>: Abbrev Number: 20 (DW_TAG_variable)
    <89737>   DW_AT_abstract_origin: <0x896b8>
    <8973b>   DW_AT_location    : 0x2a594 (location list)
    <8973f>   DW_AT_GNU_locviews: 0x2a58c
 <2><89743>: Abbrev Number: 9 (DW_TAG_call_site)
    <89744>   DW_AT_call_return_pc: 0x460f5e
    <8974c>   DW_AT_call_origin : <0x89275>
    <89750>   DW_AT_sibling     : <0x8975b>
 <3><89754>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89755>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89757>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><8975a>: Abbrev Number: 0
 <2><8975b>: Abbrev Number: 9 (DW_TAG_call_site)
    <8975c>   DW_AT_call_return_pc: 0x460f78
    <89764>   DW_AT_call_origin : <0x8925e>
    <89768>   DW_AT_sibling     : <0x89773>
 <3><8976c>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8976d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <8976f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><89772>: Abbrev Number: 0
 <2><89773>: Abbrev Number: 9 (DW_TAG_call_site)
    <89774>   DW_AT_call_return_pc: 0x460f85
    <8977c>   DW_AT_call_origin : <0x8923e>
    <89780>   DW_AT_sibling     : <0x89790>
 <3><89784>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <89785>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89787>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><8978a>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <8978b>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <8978d>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><8978f>: Abbrev Number: 0
 <2><89790>: Abbrev Number: 51 (DW_TAG_call_site)
    <89791>   DW_AT_call_return_pc: 0x460f9b
    <89799>   DW_AT_call_tail_call: 1
    <89799>   DW_AT_call_origin : <0x89223>
 <2><8979d>: Abbrev Number: 21 (DW_TAG_call_site)
    <8979e>   DW_AT_call_return_pc: 0x460faf
    <897a6>   DW_AT_call_origin : <0x8928b>
 <3><897aa>: Abbrev Number: 4 (DW_TAG_call_site_parameter)
    <897ab>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <897ad>   DW_AT_call_value  : 3 byte block: a3 1 59 	(DW_OP_entry_value: (DW_OP_reg9 (r9)))
 <3><897b1>: Abbrev Number: 0
 <2><897b2>: Abbrev Number: 0
 <1><897b3>: Abbrev Number: 52 (DW_TAG_subprogram)
    <897b4>   DW_AT_external    : 1
    <897b4>   DW_AT_declaration : 1
    <897b4>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <897b8>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><897bc>: Abbrev Number: 0
  Compilation Unit @ offset 0x897bd:
   Length:        0x56a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4a5c
   Pointer Size:  8
 <0><897c9>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <897ca>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <897ce>   DW_AT_language    : 29	(C11)
    <897cf>   DW_AT_name        : (indirect line string, offset: 0x4b7): src/gfxlib2/gfx_screenlist.c
    <897d3>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <897d7>   DW_AT_low_pc      : 0x461280
    <897df>   DW_AT_high_pc     : 0x276
    <897e7>   DW_AT_stmt_list   : 0x5783a
 <1><897eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <897ec>   DW_AT_byte_size   : 1
    <897ed>   DW_AT_encoding    : 8	(unsigned char)
    <897ee>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><897f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <897f3>   DW_AT_byte_size   : 2
    <897f4>   DW_AT_encoding    : 7	(unsigned)
    <897f5>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><897f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <897fa>   DW_AT_byte_size   : 4
    <897fb>   DW_AT_encoding    : 7	(unsigned)
    <897fc>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><89800>: Abbrev Number: 2 (DW_TAG_base_type)
    <89801>   DW_AT_byte_size   : 8
    <89802>   DW_AT_encoding    : 7	(unsigned)
    <89803>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><89807>: Abbrev Number: 2 (DW_TAG_base_type)
    <89808>   DW_AT_byte_size   : 1
    <89809>   DW_AT_encoding    : 6	(signed char)
    <8980a>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><8980e>: Abbrev Number: 2 (DW_TAG_base_type)
    <8980f>   DW_AT_byte_size   : 2
    <89810>   DW_AT_encoding    : 5	(signed)
    <89811>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><89815>: Abbrev Number: 21 (DW_TAG_base_type)
    <89816>   DW_AT_byte_size   : 4
    <89817>   DW_AT_encoding    : 5	(signed)
    <89818>   DW_AT_name        : int
 <1><8981c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8981d>   DW_AT_byte_size   : 8
    <8981e>   DW_AT_encoding    : 5	(signed)
    <8981f>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><89823>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <89824>   DW_AT_byte_size   : 8
 <1><89825>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89826>   DW_AT_byte_size   : 8
    <89826>   DW_AT_type        : <0x8982a>
 <1><8982a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8982b>   DW_AT_byte_size   : 1
    <8982c>   DW_AT_encoding    : 6	(signed char)
    <8982d>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><89831>: Abbrev Number: 23 (DW_TAG_typedef)
    <89832>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <89836>   DW_AT_decl_file   : 2
    <89837>   DW_AT_decl_line   : 209
    <89838>   DW_AT_decl_column : 23
    <89839>   DW_AT_type        : <0x89800>
 <1><8983d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8983e>   DW_AT_byte_size   : 8
    <8983f>   DW_AT_encoding    : 5	(signed)
    <89840>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><89844>: Abbrev Number: 2 (DW_TAG_base_type)
    <89845>   DW_AT_byte_size   : 8
    <89846>   DW_AT_encoding    : 7	(unsigned)
    <89847>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><8984b>: Abbrev Number: 12 (DW_TAG_typedef)
    <8984c>   DW_AT_name        : (indirect string, offset: 0x1846d): __compar_fn_t
    <89850>   DW_AT_decl_file   : 3
    <89851>   DW_AT_decl_line   : 808
    <89853>   DW_AT_decl_column : 15
    <89854>   DW_AT_type        : <0x89858>
 <1><89858>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89859>   DW_AT_byte_size   : 8
    <89859>   DW_AT_type        : <0x8985d>
 <1><8985d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <8985e>   DW_AT_prototyped  : 1
    <8985e>   DW_AT_type        : <0x89815>
    <89862>   DW_AT_sibling     : <0x89871>
 <2><89866>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89867>   DW_AT_type        : <0x89871>
 <2><8986b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8986c>   DW_AT_type        : <0x89871>
 <2><89870>: Abbrev Number: 0
 <1><89871>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89872>   DW_AT_byte_size   : 8
    <89872>   DW_AT_type        : <0x89876>
 <1><89876>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><89877>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89878>   DW_AT_byte_size   : 8
    <89878>   DW_AT_type        : <0x8987c>
 <1><8987c>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <8987d>   DW_AT_prototyped  : 1
 <1><8987d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8987e>   DW_AT_byte_size   : 8
    <8987f>   DW_AT_encoding    : 4	(float)
    <89880>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><89884>: Abbrev Number: 2 (DW_TAG_base_type)
    <89885>   DW_AT_byte_size   : 4
    <89886>   DW_AT_encoding    : 4	(float)
    <89887>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><8988b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8988c>   DW_AT_byte_size   : 8
    <8988c>   DW_AT_type        : <0x89890>
 <1><89890>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <89891>   DW_AT_prototyped  : 1
    <89891>   DW_AT_type        : <0x89815>
    <89895>   DW_AT_sibling     : <0x898a4>
 <2><89899>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8989a>   DW_AT_type        : <0x89815>
 <2><8989e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8989f>   DW_AT_type        : <0x89815>
 <2><898a3>: Abbrev Number: 0
 <1><898a4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <898a5>   DW_AT_byte_size   : 8
    <898a5>   DW_AT_type        : <0x89815>
 <1><898a9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <898aa>   DW_AT_byte_size   : 8
    <898aa>   DW_AT_type        : <0x898ae>
 <1><898ae>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <898af>   DW_AT_prototyped  : 1
    <898af>   DW_AT_type        : <0x89815>
    <898b3>   DW_AT_sibling     : <0x898d1>
 <2><898b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898b8>   DW_AT_type        : <0x898a4>
 <2><898bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898bd>   DW_AT_type        : <0x898a4>
 <2><898c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898c2>   DW_AT_type        : <0x898a4>
 <2><898c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898c7>   DW_AT_type        : <0x898a4>
 <2><898cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898cc>   DW_AT_type        : <0x898a4>
 <2><898d0>: Abbrev Number: 0
 <1><898d1>: Abbrev Number: 26 (DW_TAG_structure_type)
    <898d2>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <898d6>   DW_AT_byte_size   : 112
    <898d7>   DW_AT_decl_file   : 4
    <898d8>   DW_AT_decl_line   : 178
    <898d9>   DW_AT_decl_column : 16
    <898da>   DW_AT_sibling     : <0x8998f>
 <2><898de>: Abbrev Number: 7 (DW_TAG_member)
    <898df>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <898e3>   DW_AT_decl_file   : 4
    <898e3>   DW_AT_decl_line   : 188
    <898e4>   DW_AT_decl_column : 8
    <898e5>   DW_AT_type        : <0x89825>
    <898e9>   DW_AT_data_member_location: 0
 <2><898ea>: Abbrev Number: 7 (DW_TAG_member)
    <898eb>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <898ef>   DW_AT_decl_file   : 4
    <898ef>   DW_AT_decl_line   : 208
    <898f0>   DW_AT_decl_column : 8
    <898f1>   DW_AT_type        : <0x899b7>
    <898f5>   DW_AT_data_member_location: 8
 <2><898f6>: Abbrev Number: 7 (DW_TAG_member)
    <898f7>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <898fb>   DW_AT_decl_file   : 4
    <898fb>   DW_AT_decl_line   : 222
    <898fc>   DW_AT_decl_column : 9
    <898fd>   DW_AT_type        : <0x89877>
    <89901>   DW_AT_data_member_location: 16
 <2><89902>: Abbrev Number: 7 (DW_TAG_member)
    <89903>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <89907>   DW_AT_decl_file   : 4
    <89907>   DW_AT_decl_line   : 231
    <89908>   DW_AT_decl_column : 9
    <89909>   DW_AT_type        : <0x89877>
    <8990d>   DW_AT_data_member_location: 24
 <2><8990e>: Abbrev Number: 7 (DW_TAG_member)
    <8990f>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <89913>   DW_AT_decl_file   : 4
    <89913>   DW_AT_decl_line   : 239
    <89914>   DW_AT_decl_column : 9
    <89915>   DW_AT_type        : <0x89877>
    <89919>   DW_AT_data_member_location: 32
 <2><8991a>: Abbrev Number: 7 (DW_TAG_member)
    <8991b>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <8991f>   DW_AT_decl_file   : 4
    <8991f>   DW_AT_decl_line   : 248
    <89920>   DW_AT_decl_column : 9
    <89921>   DW_AT_type        : <0x899d6>
    <89925>   DW_AT_data_member_location: 40
 <2><89926>: Abbrev Number: 5 (DW_TAG_member)
    <89927>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <8992b>   DW_AT_decl_file   : 4
    <8992b>   DW_AT_decl_line   : 258
    <8992d>   DW_AT_decl_column : 9
    <8992e>   DW_AT_type        : <0x89877>
    <89932>   DW_AT_data_member_location: 48
 <2><89933>: Abbrev Number: 5 (DW_TAG_member)
    <89934>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <89938>   DW_AT_decl_file   : 4
    <89938>   DW_AT_decl_line   : 274
    <8993a>   DW_AT_decl_column : 8
    <8993b>   DW_AT_type        : <0x898a9>
    <8993f>   DW_AT_data_member_location: 56
 <2><89940>: Abbrev Number: 5 (DW_TAG_member)
    <89941>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <89945>   DW_AT_decl_file   : 4
    <89945>   DW_AT_decl_line   : 285
    <89947>   DW_AT_decl_column : 9
    <89948>   DW_AT_type        : <0x899d6>
    <8994c>   DW_AT_data_member_location: 64
 <2><8994d>: Abbrev Number: 5 (DW_TAG_member)
    <8994e>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <89952>   DW_AT_decl_file   : 4
    <89952>   DW_AT_decl_line   : 293
    <89954>   DW_AT_decl_column : 9
    <89955>   DW_AT_type        : <0x899e6>
    <89959>   DW_AT_data_member_location: 72
 <2><8995a>: Abbrev Number: 5 (DW_TAG_member)
    <8995b>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <8995f>   DW_AT_decl_file   : 4
    <8995f>   DW_AT_decl_line   : 301
    <89961>   DW_AT_decl_column : 8
    <89962>   DW_AT_type        : <0x8988b>
    <89966>   DW_AT_data_member_location: 80
 <2><89967>: Abbrev Number: 5 (DW_TAG_member)
    <89968>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <8996c>   DW_AT_decl_file   : 4
    <8996c>   DW_AT_decl_line   : 314
    <8996e>   DW_AT_decl_column : 9
    <8996f>   DW_AT_type        : <0x899ff>
    <89973>   DW_AT_data_member_location: 88
 <2><89974>: Abbrev Number: 5 (DW_TAG_member)
    <89975>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <89979>   DW_AT_decl_file   : 4
    <89979>   DW_AT_decl_line   : 321
    <8997b>   DW_AT_decl_column : 9
    <8997c>   DW_AT_type        : <0x89877>
    <89980>   DW_AT_data_member_location: 96
 <2><89981>: Abbrev Number: 5 (DW_TAG_member)
    <89982>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <89986>   DW_AT_decl_file   : 4
    <89986>   DW_AT_decl_line   : 328
    <89988>   DW_AT_decl_column : 9
    <89989>   DW_AT_type        : <0x89877>
    <8998d>   DW_AT_data_member_location: 104
 <2><8998e>: Abbrev Number: 0
 <1><8998f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <89990>   DW_AT_prototyped  : 1
    <89990>   DW_AT_type        : <0x89815>
    <89994>   DW_AT_sibling     : <0x899b7>
 <2><89998>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89999>   DW_AT_type        : <0x89825>
 <2><8999d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8999e>   DW_AT_type        : <0x89815>
 <2><899a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899a3>   DW_AT_type        : <0x89815>
 <2><899a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899a8>   DW_AT_type        : <0x89815>
 <2><899ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899ad>   DW_AT_type        : <0x89815>
 <2><899b1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899b2>   DW_AT_type        : <0x89815>
 <2><899b6>: Abbrev Number: 0
 <1><899b7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <899b8>   DW_AT_byte_size   : 8
    <899b8>   DW_AT_type        : <0x8998f>
 <1><899bc>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <899bd>   DW_AT_prototyped  : 1
    <899bd>   DW_AT_sibling     : <0x899d6>
 <2><899c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899c2>   DW_AT_type        : <0x89815>
 <2><899c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899c7>   DW_AT_type        : <0x89815>
 <2><899cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899cc>   DW_AT_type        : <0x89815>
 <2><899d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899d1>   DW_AT_type        : <0x89815>
 <2><899d5>: Abbrev Number: 0
 <1><899d6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <899d7>   DW_AT_byte_size   : 8
    <899d7>   DW_AT_type        : <0x899bc>
 <1><899db>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <899dc>   DW_AT_prototyped  : 1
    <899dc>   DW_AT_sibling     : <0x899e6>
 <2><899e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899e1>   DW_AT_type        : <0x89825>
 <2><899e5>: Abbrev Number: 0
 <1><899e6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <899e7>   DW_AT_byte_size   : 8
    <899e7>   DW_AT_type        : <0x899db>
 <1><899eb>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <899ec>   DW_AT_prototyped  : 1
    <899ec>   DW_AT_type        : <0x898a4>
    <899f0>   DW_AT_sibling     : <0x899ff>
 <2><899f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899f5>   DW_AT_type        : <0x89815>
 <2><899f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <899fa>   DW_AT_type        : <0x898a4>
 <2><899fe>: Abbrev Number: 0
 <1><899ff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89a00>   DW_AT_byte_size   : 8
    <89a00>   DW_AT_type        : <0x899eb>
 <1><89a04>: Abbrev Number: 12 (DW_TAG_typedef)
    <89a05>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <89a09>   DW_AT_decl_file   : 4
    <89a0a>   DW_AT_decl_line   : 329
    <89a0c>   DW_AT_decl_column : 3
    <89a0d>   DW_AT_type        : <0x898d1>
 <1><89a11>: Abbrev Number: 27 (DW_TAG_const_type)
    <89a12>   DW_AT_type        : <0x89a04>
 <1><89a16>: Abbrev Number: 28 (DW_TAG_array_type)
    <89a17>   DW_AT_type        : <0x89a21>
    <89a1b>   DW_AT_sibling     : <0x89a21>
 <2><89a1f>: Abbrev Number: 29 (DW_TAG_subrange_type)
 <2><89a20>: Abbrev Number: 0
 <1><89a21>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89a22>   DW_AT_byte_size   : 8
    <89a22>   DW_AT_type        : <0x89a11>
 <1><89a26>: Abbrev Number: 30 (DW_TAG_variable)
    <89a27>   DW_AT_name        : (indirect string, offset: 0x18204): __fb_gfx_drivers_list
    <89a2b>   DW_AT_decl_file   : 4
    <89a2c>   DW_AT_decl_line   : 366
    <89a2e>   DW_AT_decl_column : 25
    <89a2f>   DW_AT_type        : <0x89a16>
    <89a33>   DW_AT_external    : 1
    <89a33>   DW_AT_declaration : 1
 <1><89a33>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <89a34>   DW_AT_encoding    : 7	(void)
    <89a34>   DW_AT_byte_size   : 4
    <89a34>   DW_AT_type        : <0x897f9>
    <89a38>   DW_AT_decl_file   : 4
    <89a38>   DW_AT_decl_line   : 376
    <89a3a>   DW_AT_decl_column : 6
    <89a3a>   DW_AT_sibling     : <0x89a57>
 <2><89a3e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a3f>   DW_AT_name        : (indirect string, offset: 0x17964): FB_FONT_8
    <89a43>   DW_AT_const_value : 0
 <2><89a44>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a45>   DW_AT_name        : (indirect string, offset: 0x17a58): FB_FONT_14
    <89a49>   DW_AT_const_value : 1
 <2><89a4a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a4b>   DW_AT_name        : (indirect string, offset: 0x17a75): FB_FONT_16
    <89a4f>   DW_AT_const_value : 2
 <2><89a50>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a51>   DW_AT_name        : (indirect string, offset: 0x17a2c): FB_FONT_COUNT
    <89a55>   DW_AT_const_value : 3
 <2><89a56>: Abbrev Number: 0
 <1><89a57>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <89a58>   DW_AT_encoding    : 7	(void)
    <89a58>   DW_AT_byte_size   : 4
    <89a58>   DW_AT_type        : <0x897f9>
    <89a5c>   DW_AT_decl_file   : 4
    <89a5c>   DW_AT_decl_line   : 384
    <89a5e>   DW_AT_decl_column : 6
    <89a5e>   DW_AT_sibling     : <0x89a81>
 <2><89a62>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a63>   DW_AT_name        : (indirect string, offset: 0x17ab6): FB_PALETTE_2
    <89a67>   DW_AT_const_value : 0
 <2><89a68>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a69>   DW_AT_name        : (indirect string, offset: 0x17a9b): FB_PALETTE_16
    <89a6d>   DW_AT_const_value : 1
 <2><89a6e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a6f>   DW_AT_name        : (indirect string, offset: 0x179a7): FB_PALETTE_64
    <89a73>   DW_AT_const_value : 2
 <2><89a74>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a75>   DW_AT_name        : (indirect string, offset: 0x179c8): FB_PALETTE_256
    <89a79>   DW_AT_const_value : 3
 <2><89a7a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89a7b>   DW_AT_name        : (indirect string, offset: 0x17996): FB_PALETTE_COUNT
    <89a7f>   DW_AT_const_value : 4
 <2><89a80>: Abbrev Number: 0
 <1><89a81>: Abbrev Number: 9 (DW_TAG_variable)
    <89a82>   DW_AT_name        : (indirect string, offset: 0x19860): list
    <89a86>   DW_AT_decl_file   : 1
    <89a86>   DW_AT_decl_line   : 5
    <89a87>   DW_AT_decl_column : 13
    <89a88>   DW_AT_type        : <0x898a4>
    <89a8c>   DW_AT_location    : 9 byte block: 3 c8 5c 4b 0 0 0 0 0 	(DW_OP_addr: 4b5cc8)
 <1><89a96>: Abbrev Number: 9 (DW_TAG_variable)
    <89a97>   DW_AT_name        : (indirect string, offset: 0x1844f): list_size
    <89a9b>   DW_AT_decl_file   : 1
    <89a9b>   DW_AT_decl_line   : 5
    <89a9c>   DW_AT_decl_column : 26
    <89a9d>   DW_AT_type        : <0x89815>
    <89aa1>   DW_AT_location    : 9 byte block: 3 c4 5c 4b 0 0 0 0 0 	(DW_OP_addr: 4b5cc4)
 <1><89aab>: Abbrev Number: 9 (DW_TAG_variable)
    <89aac>   DW_AT_name        : (indirect string, offset: 0x18459): current
    <89ab0>   DW_AT_decl_file   : 1
    <89ab0>   DW_AT_decl_line   : 5
    <89ab1>   DW_AT_decl_column : 37
    <89ab2>   DW_AT_type        : <0x89815>
    <89ab6>   DW_AT_location    : 9 byte block: 3 c0 5c 4b 0 0 0 0 0 	(DW_OP_addr: 4b5cc0)
 <1><89ac0>: Abbrev Number: 15 (DW_TAG_subprogram)
    <89ac1>   DW_AT_external    : 1
    <89ac1>   DW_AT_name        : (indirect string, offset: 0x179c0): realloc
    <89ac5>   DW_AT_decl_file   : 3
    <89ac5>   DW_AT_decl_line   : 550
    <89ac7>   DW_AT_decl_column : 14
    <89ac7>   DW_AT_prototyped  : 1
    <89ac7>   DW_AT_type        : <0x89823>
    <89acb>   DW_AT_declaration : 1
    <89acb>   DW_AT_sibling     : <0x89ada>
 <2><89acf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89ad0>   DW_AT_type        : <0x89823>
 <2><89ad4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89ad5>   DW_AT_type        : <0x89831>
 <2><89ad9>: Abbrev Number: 0
 <1><89ada>: Abbrev Number: 15 (DW_TAG_subprogram)
    <89adb>   DW_AT_external    : 1
    <89adb>   DW_AT_name        : (indirect string, offset: 0xe63c): malloc
    <89adf>   DW_AT_decl_file   : 3
    <89adf>   DW_AT_decl_line   : 539
    <89ae1>   DW_AT_decl_column : 14
    <89ae1>   DW_AT_prototyped  : 1
    <89ae1>   DW_AT_type        : <0x89823>
    <89ae5>   DW_AT_declaration : 1
    <89ae5>   DW_AT_sibling     : <0x89aef>
 <2><89ae9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89aea>   DW_AT_type        : <0x89831>
 <2><89aee>: Abbrev Number: 0
 <1><89aef>: Abbrev Number: 16 (DW_TAG_subprogram)
    <89af0>   DW_AT_external    : 1
    <89af0>   DW_AT_name        : (indirect string, offset: 0x18444): qsort
    <89af4>   DW_AT_decl_file   : 3
    <89af4>   DW_AT_decl_line   : 830
    <89af6>   DW_AT_decl_column : 13
    <89af6>   DW_AT_prototyped  : 1
    <89af6>   DW_AT_declaration : 1
    <89af6>   DW_AT_sibling     : <0x89b0f>
 <2><89afa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89afb>   DW_AT_type        : <0x89823>
 <2><89aff>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89b00>   DW_AT_type        : <0x89831>
 <2><89b04>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89b05>   DW_AT_type        : <0x89831>
 <2><89b09>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89b0a>   DW_AT_type        : <0x8984b>
 <2><89b0e>: Abbrev Number: 0
 <1><89b0f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <89b10>   DW_AT_external    : 1
    <89b10>   DW_AT_name        : (indirect string, offset: 0x6200): free
    <89b14>   DW_AT_decl_file   : 3
    <89b14>   DW_AT_decl_line   : 565
    <89b16>   DW_AT_decl_column : 13
    <89b16>   DW_AT_prototyped  : 1
    <89b16>   DW_AT_declaration : 1
    <89b16>   DW_AT_sibling     : <0x89b20>
 <2><89b1a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89b1b>   DW_AT_type        : <0x89823>
 <2><89b1f>: Abbrev Number: 0
 <1><89b20>: Abbrev Number: 31 (DW_TAG_subprogram)
    <89b21>   DW_AT_external    : 1
    <89b21>   DW_AT_name        : (indirect string, offset: 0xc411): fb_GfxScreenList
    <89b25>   DW_AT_decl_file   : 1
    <89b26>   DW_AT_decl_line   : 42
    <89b27>   DW_AT_decl_column : 12
    <89b28>   DW_AT_prototyped  : 1
    <89b28>   DW_AT_type        : <0x89815>
    <89b2c>   DW_AT_low_pc      : 0x4612c0
    <89b34>   DW_AT_high_pc     : 0x236
    <89b3c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <89b3e>   DW_AT_call_all_calls: 1
    <89b3e>   DW_AT_sibling     : <0x89c94>
 <2><89b42>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <89b43>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <89b47>   DW_AT_decl_file   : 1
    <89b48>   DW_AT_decl_line   : 42
    <89b49>   DW_AT_decl_column : 33
    <89b4a>   DW_AT_type        : <0x89815>
    <89b4e>   DW_AT_location    : 0x2a5cd (location list)
    <89b52>   DW_AT_GNU_locviews: 0x2a5c3
 <2><89b56>: Abbrev Number: 17 (DW_TAG_variable)
    <89b57>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <89b5b>   DW_AT_decl_file   : 1
    <89b5b>   DW_AT_decl_line   : 44
    <89b5c>   DW_AT_decl_column : 19
    <89b5d>   DW_AT_type        : <0x89a21>
    <89b61>   DW_AT_location    : 0x2a5f2 (location list)
    <89b65>   DW_AT_GNU_locviews: 0x2a5f0
 <2><89b69>: Abbrev Number: 10 (DW_TAG_variable)
    <89b6a>   DW_AT_name        : i
    <89b6c>   DW_AT_decl_file   : 1
    <89b6c>   DW_AT_decl_line   : 45
    <89b6d>   DW_AT_decl_column : 6
    <89b6e>   DW_AT_type        : <0x89815>
    <89b72>   DW_AT_location    : 0x2a5fc (location list)
    <89b76>   DW_AT_GNU_locviews: 0x2a5fa
 <2><89b7a>: Abbrev Number: 10 (DW_TAG_variable)
    <89b7b>   DW_AT_name        : j
    <89b7d>   DW_AT_decl_file   : 1
    <89b7d>   DW_AT_decl_line   : 45
    <89b7e>   DW_AT_decl_column : 9
    <89b7f>   DW_AT_type        : <0x89815>
    <89b83>   DW_AT_location    : 0x2a60f (location list)
    <89b87>   DW_AT_GNU_locviews: 0x2a605
 <2><89b8b>: Abbrev Number: 17 (DW_TAG_variable)
    <89b8c>   DW_AT_name        : (indirect string, offset: 0x1844a): temp
    <89b90>   DW_AT_decl_file   : 1
    <89b90>   DW_AT_decl_line   : 45
    <89b91>   DW_AT_decl_column : 13
    <89b92>   DW_AT_type        : <0x898a4>
    <89b96>   DW_AT_location    : 0x2a63c (location list)
    <89b9a>   DW_AT_GNU_locviews: 0x2a636
 <2><89b9e>: Abbrev Number: 9 (DW_TAG_variable)
    <89b9f>   DW_AT_name        : (indirect string, offset: 0x1bf3c): size
    <89ba3>   DW_AT_decl_file   : 1
    <89ba3>   DW_AT_decl_line   : 45
    <89ba4>   DW_AT_decl_column : 19
    <89ba5>   DW_AT_type        : <0x89815>
    <89ba9>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><89bad>: Abbrev Number: 33 (DW_TAG_variable)
    <89bae>   DW_AT_name        : (indirect string, offset: 0x1a7da): result
    <89bb2>   DW_AT_decl_file   : 1
    <89bb3>   DW_AT_decl_line   : 45
    <89bb4>   DW_AT_decl_column : 25
    <89bb5>   DW_AT_type        : <0x89815>
 <2><89bb9>: Abbrev Number: 34 (DW_TAG_inlined_subroutine)
    <89bba>   DW_AT_abstract_origin: <0x89cfd>
    <89bbe>   DW_AT_entry_pc    : 0x46137d
    <89bc6>   DW_AT_GNU_entry_view: 0
    <89bc7>   DW_AT_ranges      : 0x174dc
    <89bcb>   DW_AT_call_file   : 1
    <89bcc>   DW_AT_call_line   : 59
    <89bcd>   DW_AT_call_column : 7
    <89bce>   DW_AT_sibling     : <0x89c1e>
 <3><89bd2>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <89bd3>   DW_AT_abstract_origin: <0x89d0a>
    <89bd7>   DW_AT_location    : 0x2a658 (location list)
    <89bdb>   DW_AT_GNU_locviews: 0x2a652
 <3><89bdf>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <89be0>   DW_AT_ranges      : 0x174dc
 <4><89be4>: Abbrev Number: 37 (DW_TAG_variable)
    <89be5>   DW_AT_abstract_origin: <0x89d16>
    <89be9>   DW_AT_location    : 0x2a678 (location list)
    <89bed>   DW_AT_GNU_locviews: 0x2a66e
 <4><89bf1>: Abbrev Number: 11 (DW_TAG_call_site)
    <89bf2>   DW_AT_call_return_pc: 0x46146b
    <89bfa>   DW_AT_call_origin : <0x89ac0>
    <89bfe>   DW_AT_sibling     : <0x89c09>
 <5><89c02>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c03>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <89c05>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <5><89c08>: Abbrev Number: 0
 <4><89c09>: Abbrev Number: 38 (DW_TAG_call_site)
    <89c0a>   DW_AT_call_return_pc: 0x4614a6
    <89c12>   DW_AT_call_origin : <0x89ada>
 <5><89c16>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c17>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89c19>   DW_AT_call_value  : 1 byte block: 38 	(DW_OP_lit8)
 <5><89c1b>: Abbrev Number: 0
 <4><89c1c>: Abbrev Number: 0
 <3><89c1d>: Abbrev Number: 0
 <2><89c1e>: Abbrev Number: 18 (DW_TAG_call_site)
    <89c1f>   DW_AT_call_return_pc: 0x4612fd
    <89c27>   DW_AT_call_origin : <0x89b0f>
 <2><89c2b>: Abbrev Number: 39 (DW_TAG_call_site)
    <89c2c>   DW_AT_call_return_pc: 0x461355
    <89c34>   DW_AT_sibling     : <0x89c4a>
 <3><89c38>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c39>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89c3b>   DW_AT_call_value  : 5 byte block: 91 a4 7f 94 4 	(DW_OP_fbreg: -92; DW_OP_deref_size: 4)
 <3><89c41>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c42>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <89c44>   DW_AT_call_value  : 4 byte block: 91 a8 7f 6 	(DW_OP_fbreg: -88; DW_OP_deref)
 <3><89c49>: Abbrev Number: 0
 <2><89c4a>: Abbrev Number: 11 (DW_TAG_call_site)
    <89c4b>   DW_AT_call_return_pc: 0x4613c6
    <89c53>   DW_AT_call_origin : <0x89b0f>
    <89c57>   DW_AT_sibling     : <0x89c62>
 <3><89c5b>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c5c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <89c5e>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><89c61>: Abbrev Number: 0
 <2><89c62>: Abbrev Number: 11 (DW_TAG_call_site)
    <89c63>   DW_AT_call_return_pc: 0x4613fb
    <89c6b>   DW_AT_call_origin : <0x89aef>
    <89c6f>   DW_AT_sibling     : <0x89c86>
 <3><89c73>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c74>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <89c76>   DW_AT_call_value  : 1 byte block: 34 	(DW_OP_lit4)
 <3><89c78>: Abbrev Number: 6 (DW_TAG_call_site_parameter)
    <89c79>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <89c7b>   DW_AT_call_value  : 9 byte block: 3 80 12 46 0 0 0 0 0 	(DW_OP_addr: 461280)
 <3><89c85>: Abbrev Number: 0
 <2><89c86>: Abbrev Number: 18 (DW_TAG_call_site)
    <89c87>   DW_AT_call_return_pc: 0x4614f6
    <89c8f>   DW_AT_call_origin : <0x89d21>
 <2><89c93>: Abbrev Number: 0
 <1><89c94>: Abbrev Number: 40 (DW_TAG_subprogram)
    <89c95>   DW_AT_name        : (indirect string, offset: 0x18461): mode_sorter
    <89c99>   DW_AT_decl_file   : 1
    <89c9a>   DW_AT_decl_line   : 27
    <89c9b>   DW_AT_decl_column : 12
    <89c9c>   DW_AT_prototyped  : 1
    <89c9c>   DW_AT_type        : <0x89815>
    <89ca0>   DW_AT_low_pc      : 0x461280
    <89ca8>   DW_AT_high_pc     : 0x38
    <89cb0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <89cb2>   DW_AT_call_all_calls: 1
    <89cb2>   DW_AT_sibling     : <0x89cfd>
 <2><89cb6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <89cb7>   DW_AT_name        : e1
    <89cba>   DW_AT_decl_file   : 1
    <89cba>   DW_AT_decl_line   : 27
    <89cba>   DW_AT_decl_column : 36
    <89cbb>   DW_AT_type        : <0x89871>
    <89cbf>   DW_AT_location    : 0x2a6c3 (location list)
    <89cc3>   DW_AT_GNU_locviews: 0x2a6bf
 <2><89cc7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <89cc8>   DW_AT_name        : e2
    <89ccb>   DW_AT_decl_file   : 1
    <89ccb>   DW_AT_decl_line   : 27
    <89ccb>   DW_AT_decl_column : 52
    <89ccc>   DW_AT_type        : <0x89871>
    <89cd0>   DW_AT_location    : 0x2a6d5 (location list)
    <89cd4>   DW_AT_GNU_locviews: 0x2a6d1
 <2><89cd8>: Abbrev Number: 10 (DW_TAG_variable)
    <89cd9>   DW_AT_name        : m1
    <89cdc>   DW_AT_decl_file   : 1
    <89cdc>   DW_AT_decl_line   : 29
    <89cdd>   DW_AT_decl_column : 6
    <89cde>   DW_AT_type        : <0x89815>
    <89ce2>   DW_AT_location    : 0x2a6e5 (location list)
    <89ce6>   DW_AT_GNU_locviews: 0x2a6e3
 <2><89cea>: Abbrev Number: 10 (DW_TAG_variable)
    <89ceb>   DW_AT_name        : m2
    <89cee>   DW_AT_decl_file   : 1
    <89cee>   DW_AT_decl_line   : 30
    <89cef>   DW_AT_decl_column : 6
    <89cf0>   DW_AT_type        : <0x89815>
    <89cf4>   DW_AT_location    : 0x2a6ed (location list)
    <89cf8>   DW_AT_GNU_locviews: 0x2a6eb
 <2><89cfc>: Abbrev Number: 0
 <1><89cfd>: Abbrev Number: 41 (DW_TAG_subprogram)
    <89cfe>   DW_AT_name        : (indirect string, offset: 0x1847b): add_mode
    <89d02>   DW_AT_decl_file   : 1
    <89d03>   DW_AT_decl_line   : 7
    <89d04>   DW_AT_decl_column : 13
    <89d05>   DW_AT_prototyped  : 1
    <89d05>   DW_AT_inline      : 1	(inlined)
    <89d06>   DW_AT_sibling     : <0x89d21>
 <2><89d0a>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <89d0b>   DW_AT_name        : (indirect string, offset: 0x185cc): mode
    <89d0f>   DW_AT_decl_file   : 1
    <89d10>   DW_AT_decl_line   : 7
    <89d11>   DW_AT_decl_column : 26
    <89d12>   DW_AT_type        : <0x89815>
 <2><89d16>: Abbrev Number: 43 (DW_TAG_variable)
    <89d17>   DW_AT_name        : i
    <89d19>   DW_AT_decl_file   : 1
    <89d1a>   DW_AT_decl_line   : 9
    <89d1b>   DW_AT_decl_column : 6
    <89d1c>   DW_AT_type        : <0x89815>
 <2><89d20>: Abbrev Number: 0
 <1><89d21>: Abbrev Number: 44 (DW_TAG_subprogram)
    <89d22>   DW_AT_external    : 1
    <89d22>   DW_AT_declaration : 1
    <89d22>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <89d26>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><89d2a>: Abbrev Number: 0
  Compilation Unit @ offset 0x89d2b:
   Length:        0x742 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4cd8
   Pointer Size:  8
 <0><89d37>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <89d38>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <89d3c>   DW_AT_language    : 29	(C11)
    <89d3d>   DW_AT_name        : (indirect line string, offset: 0x4d4): src/gfxlib2/gfx_setmouse.c
    <89d41>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <89d45>   DW_AT_low_pc      : 0x461500
    <89d4d>   DW_AT_high_pc     : 0x7a
    <89d55>   DW_AT_stmt_list   : 0x57ab5
 <1><89d59>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d5a>   DW_AT_byte_size   : 1
    <89d5b>   DW_AT_encoding    : 8	(unsigned char)
    <89d5c>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><89d60>: Abbrev Number: 9 (DW_TAG_const_type)
    <89d61>   DW_AT_type        : <0x89d59>
 <1><89d65>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d66>   DW_AT_byte_size   : 2
    <89d67>   DW_AT_encoding    : 7	(unsigned)
    <89d68>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><89d6c>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d6d>   DW_AT_byte_size   : 4
    <89d6e>   DW_AT_encoding    : 7	(unsigned)
    <89d6f>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><89d73>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d74>   DW_AT_byte_size   : 8
    <89d75>   DW_AT_encoding    : 7	(unsigned)
    <89d76>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><89d7a>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d7b>   DW_AT_byte_size   : 1
    <89d7c>   DW_AT_encoding    : 6	(signed char)
    <89d7d>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><89d81>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d82>   DW_AT_byte_size   : 2
    <89d83>   DW_AT_encoding    : 5	(signed)
    <89d84>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><89d88>: Abbrev Number: 22 (DW_TAG_base_type)
    <89d89>   DW_AT_byte_size   : 4
    <89d8a>   DW_AT_encoding    : 5	(signed)
    <89d8b>   DW_AT_name        : int
 <1><89d8f>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <89d90>   DW_AT_type        : <0x89d88>
 <1><89d94>: Abbrev Number: 9 (DW_TAG_const_type)
    <89d95>   DW_AT_type        : <0x89d88>
 <1><89d99>: Abbrev Number: 5 (DW_TAG_base_type)
    <89d9a>   DW_AT_byte_size   : 8
    <89d9b>   DW_AT_encoding    : 5	(signed)
    <89d9c>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><89da0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89da1>   DW_AT_byte_size   : 8
    <89da1>   DW_AT_type        : <0x89da5>
 <1><89da5>: Abbrev Number: 5 (DW_TAG_base_type)
    <89da6>   DW_AT_byte_size   : 1
    <89da7>   DW_AT_encoding    : 6	(signed char)
    <89da8>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><89dac>: Abbrev Number: 24 (DW_TAG_typedef)
    <89dad>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <89db1>   DW_AT_decl_file   : 2
    <89db2>   DW_AT_decl_line   : 321
    <89db4>   DW_AT_decl_column : 24
    <89db5>   DW_AT_type        : <0x89d88>
 <1><89db9>: Abbrev Number: 5 (DW_TAG_base_type)
    <89dba>   DW_AT_byte_size   : 8
    <89dbb>   DW_AT_encoding    : 5	(signed)
    <89dbc>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><89dc0>: Abbrev Number: 5 (DW_TAG_base_type)
    <89dc1>   DW_AT_byte_size   : 8
    <89dc2>   DW_AT_encoding    : 7	(unsigned)
    <89dc3>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><89dc7>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <89dc8>   DW_AT_name        : (indirect string, offset: 0x16af2): _FB_RTERROR
    <89dcc>   DW_AT_encoding    : 7	(unsigned)
    <89dcd>   DW_AT_byte_size   : 4
    <89dce>   DW_AT_type        : <0x89d6c>
    <89dd2>   DW_AT_decl_file   : 6
    <89dd3>   DW_AT_decl_line   : 1
    <89dd4>   DW_AT_decl_column : 14
    <89dd5>   DW_AT_sibling     : <0x89e4c>
 <2><89dd9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89dda>   DW_AT_name        : (indirect string, offset: 0x16843): FB_RTERROR_OK
    <89dde>   DW_AT_const_value : 0
 <2><89ddf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89de0>   DW_AT_name        : (indirect string, offset: 0x16d6e): FB_RTERROR_ILLEGALFUNCTIONCALL
    <89de4>   DW_AT_const_value : 1
 <2><89de5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89de6>   DW_AT_name        : (indirect string, offset: 0x16b99): FB_RTERROR_FILENOTFOUND
    <89dea>   DW_AT_const_value : 2
 <2><89deb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89dec>   DW_AT_name        : (indirect string, offset: 0x16a7f): FB_RTERROR_FILEIO
    <89df0>   DW_AT_const_value : 3
 <2><89df1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89df2>   DW_AT_name        : (indirect string, offset: 0x16990): FB_RTERROR_OUTOFMEM
    <89df6>   DW_AT_const_value : 4
 <2><89df7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89df8>   DW_AT_name        : (indirect string, offset: 0x16ac6): FB_RTERROR_ILLEGALRESUME
    <89dfc>   DW_AT_const_value : 5
 <2><89dfd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89dfe>   DW_AT_name        : (indirect string, offset: 0x1689b): FB_RTERROR_OUTOFBOUNDS
    <89e02>   DW_AT_const_value : 6
 <2><89e03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e04>   DW_AT_name        : (indirect string, offset: 0x16d5b): FB_RTERROR_NULLPTR
    <89e08>   DW_AT_const_value : 7
 <2><89e09>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e0a>   DW_AT_name        : (indirect string, offset: 0x168c8): FB_RTERROR_NOPRIVILEGES
    <89e0e>   DW_AT_const_value : 8
 <2><89e0f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e10>   DW_AT_name        : (indirect string, offset: 0x16b07): FB_RTERROR_SIGINT
    <89e14>   DW_AT_const_value : 9
 <2><89e15>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e16>   DW_AT_name        : (indirect string, offset: 0x16a6d): FB_RTERROR_SIGILL
    <89e1a>   DW_AT_const_value : 10
 <2><89e1b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e1c>   DW_AT_name        : (indirect string, offset: 0x16d2b): FB_RTERROR_SIGFPE
    <89e20>   DW_AT_const_value : 11
 <2><89e21>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e22>   DW_AT_name        : (indirect string, offset: 0x1697d): FB_RTERROR_SIGSEGV
    <89e26>   DW_AT_const_value : 12
 <2><89e27>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e28>   DW_AT_name        : (indirect string, offset: 0x16870): FB_RTERROR_SIGTERM
    <89e2c>   DW_AT_const_value : 13
 <2><89e2d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e2e>   DW_AT_name        : (indirect string, offset: 0x16cf4): FB_RTERROR_SIGABRT
    <89e32>   DW_AT_const_value : 14
 <2><89e33>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e34>   DW_AT_name        : (indirect string, offset: 0x16b2c): FB_RTERROR_SIGQUIT
    <89e38>   DW_AT_const_value : 15
 <2><89e39>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e3a>   DW_AT_name        : (indirect string, offset: 0x16b7b): FB_RTERROR_RETURNWITHOUTGOSUB
    <89e3e>   DW_AT_const_value : 16
 <2><89e3f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e40>   DW_AT_name        : (indirect string, offset: 0x169ee): FB_RTERROR_ENDOFFILE
    <89e44>   DW_AT_const_value : 17
 <2><89e45>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89e46>   DW_AT_name        : (indirect string, offset: 0x168f2): FB_RTERROR_MAX
    <89e4a>   DW_AT_const_value : 18
 <2><89e4b>: Abbrev Number: 0
 <1><89e4c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89e4d>   DW_AT_byte_size   : 8
    <89e4d>   DW_AT_type        : <0x89e51>
 <1><89e51>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <89e52>   DW_AT_prototyped  : 1
 <1><89e52>: Abbrev Number: 5 (DW_TAG_base_type)
    <89e53>   DW_AT_byte_size   : 8
    <89e54>   DW_AT_encoding    : 4	(float)
    <89e55>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><89e59>: Abbrev Number: 5 (DW_TAG_base_type)
    <89e5a>   DW_AT_byte_size   : 4
    <89e5b>   DW_AT_encoding    : 4	(float)
    <89e5c>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><89e60>: Abbrev Number: 10 (DW_TAG_typedef)
    <89e61>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <89e65>   DW_AT_decl_file   : 3
    <89e66>   DW_AT_decl_line   : 7
    <89e67>   DW_AT_decl_column : 25
    <89e68>   DW_AT_type        : <0x89e6c>
 <1><89e6c>: Abbrev Number: 27 (DW_TAG_structure_type)
    <89e6d>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <89e71>   DW_AT_declaration : 1
 <1><89e71>: Abbrev Number: 13 (DW_TAG_structure_type)
    <89e72>   DW_AT_byte_size   : 8
    <89e73>   DW_AT_decl_file   : 4
    <89e73>   DW_AT_decl_line   : 4
    <89e74>   DW_AT_decl_column : 3
    <89e74>   DW_AT_sibling     : <0x89e93>
 <2><89e78>: Abbrev Number: 1 (DW_TAG_member)
    <89e79>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <89e7d>   DW_AT_decl_file   : 4
    <89e7e>   DW_AT_decl_line   : 5
    <89e7f>   DW_AT_decl_column : 8
    <89e80>   DW_AT_type        : <0x89d88>
    <89e84>   DW_AT_data_member_location: 0
 <2><89e85>: Abbrev Number: 1 (DW_TAG_member)
    <89e86>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <89e8a>   DW_AT_decl_file   : 4
    <89e8b>   DW_AT_decl_line   : 6
    <89e8c>   DW_AT_decl_column : 8
    <89e8d>   DW_AT_type        : <0x89d88>
    <89e91>   DW_AT_data_member_location: 4
 <2><89e92>: Abbrev Number: 0
 <1><89e93>: Abbrev Number: 13 (DW_TAG_structure_type)
    <89e94>   DW_AT_byte_size   : 16
    <89e95>   DW_AT_decl_file   : 4
    <89e95>   DW_AT_decl_line   : 8
    <89e96>   DW_AT_decl_column : 3
    <89e96>   DW_AT_sibling     : <0x89ec9>
 <2><89e9a>: Abbrev Number: 6 (DW_TAG_member)
    <89e9b>   DW_AT_name        : x
    <89e9d>   DW_AT_decl_file   : 4
    <89e9e>   DW_AT_decl_line   : 9
    <89e9f>   DW_AT_decl_column : 8
    <89ea0>   DW_AT_type        : <0x89d88>
    <89ea4>   DW_AT_data_member_location: 0
 <2><89ea5>: Abbrev Number: 6 (DW_TAG_member)
    <89ea6>   DW_AT_name        : y
    <89ea8>   DW_AT_decl_file   : 4
    <89ea9>   DW_AT_decl_line   : 9
    <89eaa>   DW_AT_decl_column : 11
    <89eab>   DW_AT_type        : <0x89d88>
    <89eaf>   DW_AT_data_member_location: 4
 <2><89eb0>: Abbrev Number: 6 (DW_TAG_member)
    <89eb1>   DW_AT_name        : dx
    <89eb4>   DW_AT_decl_file   : 4
    <89eb5>   DW_AT_decl_line   : 10
    <89eb6>   DW_AT_decl_column : 8
    <89eb7>   DW_AT_type        : <0x89d88>
    <89ebb>   DW_AT_data_member_location: 8
 <2><89ebc>: Abbrev Number: 6 (DW_TAG_member)
    <89ebd>   DW_AT_name        : dy
    <89ec0>   DW_AT_decl_file   : 4
    <89ec1>   DW_AT_decl_line   : 10
    <89ec2>   DW_AT_decl_column : 12
    <89ec3>   DW_AT_type        : <0x89d88>
    <89ec7>   DW_AT_data_member_location: 12
 <2><89ec8>: Abbrev Number: 0
 <1><89ec9>: Abbrev Number: 28 (DW_TAG_union_type)
    <89eca>   DW_AT_byte_size   : 16
    <89ecb>   DW_AT_decl_file   : 4
    <89ecc>   DW_AT_decl_line   : 3
    <89ecd>   DW_AT_decl_column : 2
    <89ece>   DW_AT_sibling     : <0x89ef9>
 <2><89ed2>: Abbrev Number: 14 (DW_TAG_member)
    <89ed3>   DW_AT_type        : <0x89e71>
 <2><89ed7>: Abbrev Number: 14 (DW_TAG_member)
    <89ed8>   DW_AT_type        : <0x89e93>
 <2><89edc>: Abbrev Number: 29 (DW_TAG_member)
    <89edd>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <89ee1>   DW_AT_decl_file   : 4
    <89ee2>   DW_AT_decl_line   : 12
    <89ee3>   DW_AT_decl_column : 7
    <89ee4>   DW_AT_type        : <0x89d88>
 <2><89ee8>: Abbrev Number: 15 (DW_TAG_member)
    <89ee9>   DW_AT_name        : z
    <89eeb>   DW_AT_decl_file   : 4
    <89eeb>   DW_AT_decl_line   : 13
    <89eec>   DW_AT_decl_column : 7
    <89eec>   DW_AT_type        : <0x89d88>
 <2><89ef0>: Abbrev Number: 15 (DW_TAG_member)
    <89ef1>   DW_AT_name        : w
    <89ef3>   DW_AT_decl_file   : 4
    <89ef3>   DW_AT_decl_line   : 14
    <89ef4>   DW_AT_decl_column : 7
    <89ef4>   DW_AT_type        : <0x89d88>
 <2><89ef8>: Abbrev Number: 0
 <1><89ef9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <89efa>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <89efe>   DW_AT_byte_size   : 20
    <89eff>   DW_AT_decl_file   : 4
    <89f00>   DW_AT_decl_line   : 1
    <89f01>   DW_AT_decl_column : 8
    <89f02>   DW_AT_sibling     : <0x89f1a>
 <2><89f06>: Abbrev Number: 1 (DW_TAG_member)
    <89f07>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <89f0b>   DW_AT_decl_file   : 4
    <89f0c>   DW_AT_decl_line   : 2
    <89f0d>   DW_AT_decl_column : 6
    <89f0e>   DW_AT_type        : <0x89d88>
    <89f12>   DW_AT_data_member_location: 0
 <2><89f13>: Abbrev Number: 30 (DW_TAG_member)
    <89f14>   DW_AT_type        : <0x89ec9>
    <89f18>   DW_AT_data_member_location: 4
 <2><89f19>: Abbrev Number: 0
 <1><89f1a>: Abbrev Number: 10 (DW_TAG_typedef)
    <89f1b>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <89f1f>   DW_AT_decl_file   : 4
    <89f20>   DW_AT_decl_line   : 18
    <89f21>   DW_AT_decl_column : 23
    <89f22>   DW_AT_type        : <0x89ef9>
 <1><89f26>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f27>   DW_AT_byte_size   : 8
    <89f27>   DW_AT_type        : <0x89f2b>
 <1><89f2b>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <89f2c>   DW_AT_prototyped  : 1
    <89f2c>   DW_AT_type        : <0x89d88>
    <89f30>   DW_AT_sibling     : <0x89f3f>
 <2><89f34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f35>   DW_AT_type        : <0x89d88>
 <2><89f39>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f3a>   DW_AT_type        : <0x89d88>
 <2><89f3e>: Abbrev Number: 0
 <1><89f3f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f40>   DW_AT_byte_size   : 8
    <89f40>   DW_AT_type        : <0x89d88>
 <1><89f44>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f45>   DW_AT_byte_size   : 8
    <89f45>   DW_AT_type        : <0x89f49>
 <1><89f49>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <89f4a>   DW_AT_prototyped  : 1
    <89f4a>   DW_AT_type        : <0x89d88>
    <89f4e>   DW_AT_sibling     : <0x89f6c>
 <2><89f52>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f53>   DW_AT_type        : <0x89f3f>
 <2><89f57>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f58>   DW_AT_type        : <0x89f3f>
 <2><89f5c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f5d>   DW_AT_type        : <0x89f3f>
 <2><89f61>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f62>   DW_AT_type        : <0x89f3f>
 <2><89f66>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89f67>   DW_AT_type        : <0x89f3f>
 <2><89f6b>: Abbrev Number: 0
 <1><89f6c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f6d>   DW_AT_byte_size   : 8
    <89f6d>   DW_AT_type        : <0x89f1a>
 <1><89f71>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f72>   DW_AT_byte_size   : 8
    <89f72>   DW_AT_type        : <0x89d59>
 <1><89f76>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <89f77>   DW_AT_byte_size   : 8
    <89f77>   DW_AT_type        : <0x89f71>
 <1><89f7b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <89f7c>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <89f80>   DW_AT_byte_size   : 12
    <89f81>   DW_AT_decl_file   : 5
    <89f82>   DW_AT_decl_line   : 139
    <89f83>   DW_AT_decl_column : 16
    <89f84>   DW_AT_sibling     : <0x89fad>
 <2><89f88>: Abbrev Number: 6 (DW_TAG_member)
    <89f89>   DW_AT_name        : ch
    <89f8c>   DW_AT_decl_file   : 5
    <89f8d>   DW_AT_decl_line   : 140
    <89f8e>   DW_AT_decl_column : 14
    <89f8f>   DW_AT_type        : <0x89dac>
    <89f93>   DW_AT_data_member_location: 0
 <2><89f94>: Abbrev Number: 6 (DW_TAG_member)
    <89f95>   DW_AT_name        : fg
    <89f98>   DW_AT_decl_file   : 5
    <89f99>   DW_AT_decl_line   : 141
    <89f9a>   DW_AT_decl_column : 14
    <89f9b>   DW_AT_type        : <0x89d6c>
    <89f9f>   DW_AT_data_member_location: 4
 <2><89fa0>: Abbrev Number: 6 (DW_TAG_member)
    <89fa1>   DW_AT_name        : bg
    <89fa4>   DW_AT_decl_file   : 5
    <89fa5>   DW_AT_decl_line   : 141
    <89fa6>   DW_AT_decl_column : 18
    <89fa7>   DW_AT_type        : <0x89d6c>
    <89fab>   DW_AT_data_member_location: 8
 <2><89fac>: Abbrev Number: 0
 <1><89fad>: Abbrev Number: 10 (DW_TAG_typedef)
    <89fae>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <89fb2>   DW_AT_decl_file   : 5
    <89fb3>   DW_AT_decl_line   : 142
    <89fb4>   DW_AT_decl_column : 3
    <89fb5>   DW_AT_type        : <0x89f7b>
 <1><89fb9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <89fba>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <89fbe>   DW_AT_byte_size   : 208
    <89fbf>   DW_AT_decl_file   : 5
    <89fc0>   DW_AT_decl_line   : 144
    <89fc1>   DW_AT_decl_column : 16
    <89fc2>   DW_AT_sibling     : <0x8a17c>
 <2><89fc6>: Abbrev Number: 6 (DW_TAG_member)
    <89fc7>   DW_AT_name        : id
    <89fca>   DW_AT_decl_file   : 5
    <89fcb>   DW_AT_decl_line   : 146
    <89fcc>   DW_AT_decl_column : 6
    <89fcd>   DW_AT_type        : <0x89d88>
    <89fd1>   DW_AT_data_member_location: 0
 <2><89fd2>: Abbrev Number: 1 (DW_TAG_member)
    <89fd3>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <89fd7>   DW_AT_decl_file   : 5
    <89fd8>   DW_AT_decl_line   : 147
    <89fd9>   DW_AT_decl_column : 9
    <89fda>   DW_AT_type        : <0x89d88>
    <89fde>   DW_AT_data_member_location: 4
 <2><89fdf>: Abbrev Number: 1 (DW_TAG_member)
    <89fe0>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <89fe4>   DW_AT_decl_file   : 5
    <89fe5>   DW_AT_decl_line   : 148
    <89fe6>   DW_AT_decl_column : 21
    <89fe7>   DW_AT_type        : <0x89f76>
    <89feb>   DW_AT_data_member_location: 8
 <2><89fec>: Abbrev Number: 1 (DW_TAG_member)
    <89fed>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <89ff1>   DW_AT_decl_file   : 5
    <89ff2>   DW_AT_decl_line   : 149
    <89ff3>   DW_AT_decl_column : 9
    <89ff4>   DW_AT_type        : <0x89d88>
    <89ff8>   DW_AT_data_member_location: 16
 <2><89ff9>: Abbrev Number: 1 (DW_TAG_member)
    <89ffa>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <89ffe>   DW_AT_decl_file   : 5
    <89fff>   DW_AT_decl_line   : 150
    <8a000>   DW_AT_decl_column : 9
    <8a001>   DW_AT_type        : <0x89d88>
    <8a005>   DW_AT_data_member_location: 20
 <2><8a006>: Abbrev Number: 1 (DW_TAG_member)
    <8a007>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <8a00b>   DW_AT_decl_file   : 5
    <8a00c>   DW_AT_decl_line   : 151
    <8a00d>   DW_AT_decl_column : 20
    <8a00e>   DW_AT_type        : <0x89f71>
    <8a012>   DW_AT_data_member_location: 24
 <2><8a013>: Abbrev Number: 6 (DW_TAG_member)
    <8a014>   DW_AT_name        : w
    <8a016>   DW_AT_decl_file   : 5
    <8a017>   DW_AT_decl_line   : 152
    <8a018>   DW_AT_decl_column : 9
    <8a019>   DW_AT_type        : <0x89d88>
    <8a01d>   DW_AT_data_member_location: 32
 <2><8a01e>: Abbrev Number: 6 (DW_TAG_member)
    <8a01f>   DW_AT_name        : h
    <8a021>   DW_AT_decl_file   : 5
    <8a022>   DW_AT_decl_line   : 152
    <8a023>   DW_AT_decl_column : 12
    <8a024>   DW_AT_type        : <0x89d88>
    <8a028>   DW_AT_data_member_location: 36
 <2><8a029>: Abbrev Number: 1 (DW_TAG_member)
    <8a02a>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <8a02e>   DW_AT_decl_file   : 5
    <8a02f>   DW_AT_decl_line   : 153
    <8a030>   DW_AT_decl_column : 9
    <8a031>   DW_AT_type        : <0x89d88>
    <8a035>   DW_AT_data_member_location: 40
 <2><8a036>: Abbrev Number: 6 (DW_TAG_member)
    <8a037>   DW_AT_name        : bpp
    <8a03b>   DW_AT_decl_file   : 5
    <8a03c>   DW_AT_decl_line   : 154
    <8a03d>   DW_AT_decl_column : 9
    <8a03e>   DW_AT_type        : <0x89d88>
    <8a042>   DW_AT_data_member_location: 44
 <2><8a043>: Abbrev Number: 1 (DW_TAG_member)
    <8a044>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <8a048>   DW_AT_decl_file   : 5
    <8a049>   DW_AT_decl_line   : 155
    <8a04a>   DW_AT_decl_column : 9
    <8a04b>   DW_AT_type        : <0x89d88>
    <8a04f>   DW_AT_data_member_location: 48
 <2><8a050>: Abbrev Number: 1 (DW_TAG_member)
    <8a051>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <8a055>   DW_AT_decl_file   : 5
    <8a056>   DW_AT_decl_line   : 156
    <8a057>   DW_AT_decl_column : 19
    <8a058>   DW_AT_type        : <0x8a17c>
    <8a05c>   DW_AT_data_member_location: 56
 <2><8a05d>: Abbrev Number: 1 (DW_TAG_member)
    <8a05e>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <8a062>   DW_AT_decl_file   : 5
    <8a063>   DW_AT_decl_line   : 157
    <8a064>   DW_AT_decl_column : 19
    <8a065>   DW_AT_type        : <0x8a17c>
    <8a069>   DW_AT_data_member_location: 64
 <2><8a06a>: Abbrev Number: 1 (DW_TAG_member)
    <8a06b>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <8a06f>   DW_AT_decl_file   : 5
    <8a070>   DW_AT_decl_line   : 158
    <8a071>   DW_AT_decl_column : 20
    <8a072>   DW_AT_type        : <0x89f71>
    <8a076>   DW_AT_data_member_location: 72
 <2><8a077>: Abbrev Number: 1 (DW_TAG_member)
    <8a078>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <8a07c>   DW_AT_decl_file   : 5
    <8a07d>   DW_AT_decl_line   : 159
    <8a07e>   DW_AT_decl_column : 11
    <8a07f>   DW_AT_type        : <0x89da0>
    <8a083>   DW_AT_data_member_location: 80
 <2><8a084>: Abbrev Number: 1 (DW_TAG_member)
    <8a085>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <8a089>   DW_AT_decl_file   : 5
    <8a08a>   DW_AT_decl_line   : 160
    <8a08b>   DW_AT_decl_column : 29
    <8a08c>   DW_AT_type        : <0x8a24a>
    <8a090>   DW_AT_data_member_location: 88
 <2><8a091>: Abbrev Number: 1 (DW_TAG_member)
    <8a092>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <8a096>   DW_AT_decl_file   : 5
    <8a097>   DW_AT_decl_line   : 161
    <8a098>   DW_AT_decl_column : 9
    <8a099>   DW_AT_type        : <0x89d88>
    <8a09d>   DW_AT_data_member_location: 96
 <2><8a09e>: Abbrev Number: 1 (DW_TAG_member)
    <8a09f>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <8a0a3>   DW_AT_decl_file   : 5
    <8a0a4>   DW_AT_decl_line   : 162
    <8a0a5>   DW_AT_decl_column : 27
    <8a0a6>   DW_AT_type        : <0x8a27a>
    <8a0aa>   DW_AT_data_member_location: 104
 <2><8a0ab>: Abbrev Number: 1 (DW_TAG_member)
    <8a0ac>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <8a0b0>   DW_AT_decl_file   : 5
    <8a0b1>   DW_AT_decl_line   : 163
    <8a0b2>   DW_AT_decl_column : 9
    <8a0b3>   DW_AT_type        : <0x89d88>
    <8a0b7>   DW_AT_data_member_location: 112
 <2><8a0b8>: Abbrev Number: 1 (DW_TAG_member)
    <8a0b9>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <8a0bd>   DW_AT_decl_file   : 5
    <8a0be>   DW_AT_decl_line   : 164
    <8a0bf>   DW_AT_decl_column : 9
    <8a0c0>   DW_AT_type        : <0x89d88>
    <8a0c4>   DW_AT_data_member_location: 116
 <2><8a0c5>: Abbrev Number: 1 (DW_TAG_member)
    <8a0c6>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <8a0ca>   DW_AT_decl_file   : 5
    <8a0cb>   DW_AT_decl_line   : 164
    <8a0cc>   DW_AT_decl_column : 19
    <8a0cd>   DW_AT_type        : <0x89d88>
    <8a0d1>   DW_AT_data_member_location: 120
 <2><8a0d2>: Abbrev Number: 1 (DW_TAG_member)
    <8a0d3>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <8a0d7>   DW_AT_decl_file   : 5
    <8a0d8>   DW_AT_decl_line   : 165
    <8a0d9>   DW_AT_decl_column : 24
    <8a0da>   DW_AT_type        : <0x8a2b1>
    <8a0de>   DW_AT_data_member_location: 128
 <2><8a0df>: Abbrev Number: 1 (DW_TAG_member)
    <8a0e0>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <8a0e4>   DW_AT_decl_file   : 5
    <8a0e5>   DW_AT_decl_line   : 166
    <8a0e6>   DW_AT_decl_column : 9
    <8a0e7>   DW_AT_type        : <0x89d88>
    <8a0eb>   DW_AT_data_member_location: 136
 <2><8a0ec>: Abbrev Number: 1 (DW_TAG_member)
    <8a0ed>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <8a0f1>   DW_AT_decl_file   : 5
    <8a0f2>   DW_AT_decl_line   : 166
    <8a0f3>   DW_AT_decl_column : 17
    <8a0f4>   DW_AT_type        : <0x89d88>
    <8a0f8>   DW_AT_data_member_location: 140
 <2><8a0f9>: Abbrev Number: 1 (DW_TAG_member)
    <8a0fa>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <8a0fe>   DW_AT_decl_file   : 5
    <8a0ff>   DW_AT_decl_line   : 167
    <8a100>   DW_AT_decl_column : 11
    <8a101>   DW_AT_type        : <0x89e59>
    <8a105>   DW_AT_data_member_location: 144
 <2><8a106>: Abbrev Number: 6 (DW_TAG_member)
    <8a107>   DW_AT_name        : key
    <8a10b>   DW_AT_decl_file   : 5
    <8a10c>   DW_AT_decl_line   : 168
    <8a10d>   DW_AT_decl_column : 11
    <8a10e>   DW_AT_type        : <0x89da0>
    <8a112>   DW_AT_data_member_location: 152
 <2><8a113>: Abbrev Number: 1 (DW_TAG_member)
    <8a114>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <8a118>   DW_AT_decl_file   : 5
    <8a119>   DW_AT_decl_line   : 169
    <8a11a>   DW_AT_decl_column : 6
    <8a11b>   DW_AT_type        : <0x89d88>
    <8a11f>   DW_AT_data_member_location: 160
 <2><8a120>: Abbrev Number: 1 (DW_TAG_member)
    <8a121>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <8a125>   DW_AT_decl_file   : 5
    <8a126>   DW_AT_decl_line   : 170
    <8a127>   DW_AT_decl_column : 18
    <8a128>   DW_AT_type        : <0x8a2b6>
    <8a12c>   DW_AT_data_member_location: 168
 <2><8a12d>: Abbrev Number: 1 (DW_TAG_member)
    <8a12e>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <8a132>   DW_AT_decl_file   : 5
    <8a133>   DW_AT_decl_line   : 171
    <8a134>   DW_AT_decl_column : 12
    <8a135>   DW_AT_type        : <0x89f6c>
    <8a139>   DW_AT_data_member_location: 176
 <2><8a13a>: Abbrev Number: 1 (DW_TAG_member)
    <8a13b>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <8a13f>   DW_AT_decl_file   : 5
    <8a140>   DW_AT_decl_line   : 172
    <8a141>   DW_AT_decl_column : 9
    <8a142>   DW_AT_type        : <0x89d88>
    <8a146>   DW_AT_data_member_location: 184
 <2><8a147>: Abbrev Number: 1 (DW_TAG_member)
    <8a148>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <8a14c>   DW_AT_decl_file   : 5
    <8a14d>   DW_AT_decl_line   : 172
    <8a14e>   DW_AT_decl_column : 21
    <8a14f>   DW_AT_type        : <0x89d88>
    <8a153>   DW_AT_data_member_location: 188
 <2><8a154>: Abbrev Number: 1 (DW_TAG_member)
    <8a155>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <8a159>   DW_AT_decl_file   : 5
    <8a15a>   DW_AT_decl_line   : 173
    <8a15b>   DW_AT_decl_column : 11
    <8a15c>   DW_AT_type        : <0x8a2c0>
    <8a160>   DW_AT_data_member_location: 192
 <2><8a161>: Abbrev Number: 1 (DW_TAG_member)
    <8a162>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <8a166>   DW_AT_decl_file   : 5
    <8a167>   DW_AT_decl_line   : 174
    <8a168>   DW_AT_decl_column : 15
    <8a169>   DW_AT_type        : <0x89d8f>
    <8a16d>   DW_AT_data_member_location: 200
 <2><8a16e>: Abbrev Number: 1 (DW_TAG_member)
    <8a16f>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <8a173>   DW_AT_decl_file   : 5
    <8a174>   DW_AT_decl_line   : 175
    <8a175>   DW_AT_decl_column : 6
    <8a176>   DW_AT_type        : <0x89d88>
    <8a17a>   DW_AT_data_member_location: 204
 <2><8a17b>: Abbrev Number: 0
 <1><8a17c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8a17d>   DW_AT_byte_size   : 8
    <8a17d>   DW_AT_type        : <0x89d6c>
 <1><8a181>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8a182>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <8a186>   DW_AT_byte_size   : 112
    <8a187>   DW_AT_decl_file   : 5
    <8a188>   DW_AT_decl_line   : 178
    <8a189>   DW_AT_decl_column : 16
    <8a18a>   DW_AT_sibling     : <0x8a245>
 <2><8a18e>: Abbrev Number: 1 (DW_TAG_member)
    <8a18f>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <8a193>   DW_AT_decl_file   : 5
    <8a194>   DW_AT_decl_line   : 188
    <8a195>   DW_AT_decl_column : 8
    <8a196>   DW_AT_type        : <0x89da0>
    <8a19a>   DW_AT_data_member_location: 0
 <2><8a19b>: Abbrev Number: 1 (DW_TAG_member)
    <8a19c>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <8a1a0>   DW_AT_decl_file   : 5
    <8a1a1>   DW_AT_decl_line   : 208
    <8a1a2>   DW_AT_decl_column : 8
    <8a1a3>   DW_AT_type        : <0x8a2f9>
    <8a1a7>   DW_AT_data_member_location: 8
 <2><8a1a8>: Abbrev Number: 1 (DW_TAG_member)
    <8a1a9>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <8a1ad>   DW_AT_decl_file   : 5
    <8a1ae>   DW_AT_decl_line   : 222
    <8a1af>   DW_AT_decl_column : 9
    <8a1b0>   DW_AT_type        : <0x89e4c>
    <8a1b4>   DW_AT_data_member_location: 16
 <2><8a1b5>: Abbrev Number: 1 (DW_TAG_member)
    <8a1b6>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <8a1ba>   DW_AT_decl_file   : 5
    <8a1bb>   DW_AT_decl_line   : 231
    <8a1bc>   DW_AT_decl_column : 9
    <8a1bd>   DW_AT_type        : <0x89e4c>
    <8a1c1>   DW_AT_data_member_location: 24
 <2><8a1c2>: Abbrev Number: 1 (DW_TAG_member)
    <8a1c3>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <8a1c7>   DW_AT_decl_file   : 5
    <8a1c8>   DW_AT_decl_line   : 239
    <8a1c9>   DW_AT_decl_column : 9
    <8a1ca>   DW_AT_type        : <0x89e4c>
    <8a1ce>   DW_AT_data_member_location: 32
 <2><8a1cf>: Abbrev Number: 1 (DW_TAG_member)
    <8a1d0>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <8a1d4>   DW_AT_decl_file   : 5
    <8a1d5>   DW_AT_decl_line   : 248
    <8a1d6>   DW_AT_decl_column : 9
    <8a1d7>   DW_AT_type        : <0x8a318>
    <8a1db>   DW_AT_data_member_location: 40
 <2><8a1dc>: Abbrev Number: 7 (DW_TAG_member)
    <8a1dd>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <8a1e1>   DW_AT_decl_file   : 5
    <8a1e1>   DW_AT_decl_line   : 258
    <8a1e3>   DW_AT_decl_column : 9
    <8a1e4>   DW_AT_type        : <0x89e4c>
    <8a1e8>   DW_AT_data_member_location: 48
 <2><8a1e9>: Abbrev Number: 7 (DW_TAG_member)
    <8a1ea>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <8a1ee>   DW_AT_decl_file   : 5
    <8a1ee>   DW_AT_decl_line   : 274
    <8a1f0>   DW_AT_decl_column : 8
    <8a1f1>   DW_AT_type        : <0x89f44>
    <8a1f5>   DW_AT_data_member_location: 56
 <2><8a1f6>: Abbrev Number: 7 (DW_TAG_member)
    <8a1f7>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <8a1fb>   DW_AT_decl_file   : 5
    <8a1fb>   DW_AT_decl_line   : 285
    <8a1fd>   DW_AT_decl_column : 9
    <8a1fe>   DW_AT_type        : <0x8a318>
