    <a0bad>   DW_AT_type        : <0xa0086>
 <4><a0bb1>: Abbrev Number: 9 (DW_TAG_variable)
    <a0bb2>   DW_AT_name        : (indirect string, offset: 0x1aa19): char_y
    <a0bb6>   DW_AT_decl_file   : 1
    <a0bb7>   DW_AT_decl_line   : 140
    <a0bb8>   DW_AT_decl_column : 14
    <a0bb9>   DW_AT_type        : <0x9ed9d>
 <4><a0bbd>: Abbrev Number: 21 (DW_TAG_lexical_block)
 <5><a0bbe>: Abbrev Number: 9 (DW_TAG_variable)
    <a0bbf>   DW_AT_name        : (indirect string, offset: 0x1aa12): char_x
    <a0bc3>   DW_AT_decl_file   : 1
    <a0bc4>   DW_AT_decl_line   : 143
    <a0bc5>   DW_AT_decl_column : 18
    <a0bc6>   DW_AT_type        : <0x9ed9d>
 <5><a0bca>: Abbrev Number: 9 (DW_TAG_variable)
    <a0bcb>   DW_AT_name        : (indirect string, offset: 0x1a989): char_row_byte
    <a0bcf>   DW_AT_decl_file   : 1
    <a0bd0>   DW_AT_decl_line   : 143
    <a0bd1>   DW_AT_decl_column : 26
    <a0bd2>   DW_AT_type        : <0x9ed9d>
 <5><a0bd6>: Abbrev Number: 9 (DW_TAG_variable)
    <a0bd7>   DW_AT_name        : (indirect string, offset: 0x1a917): text_y
    <a0bdb>   DW_AT_decl_file   : 1
    <a0bdc>   DW_AT_decl_line   : 144
    <a0bdd>   DW_AT_decl_column : 18
    <a0bde>   DW_AT_type        : <0x9ed9d>
 <5><a0be2>: Abbrev Number: 9 (DW_TAG_variable)
    <a0be3>   DW_AT_name        : (indirect string, offset: 0x1a910): text_x
    <a0be7>   DW_AT_decl_file   : 1
    <a0be8>   DW_AT_decl_line   : 145
    <a0be9>   DW_AT_decl_column : 18

   Pointer Size:  8
 <0><a14c9>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <a14ca>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <a14ce>   DW_AT_language    : 29	(C11)
    <a14cf>   DW_AT_name        : (indirect line string, offset: 0xa13): src/gfxlib2/gfx_readstr.c
    <a14d3>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <a14d7>   DW_AT_low_pc      : 0x468c70
    <a14df>   DW_AT_high_pc     : 0x26f
    <a14e7>   DW_AT_stmt_list   : 0x5d632
 <1><a14eb>: Abbrev Number: 4 (DW_TAG_base_type)
    <a14ec>   DW_AT_byte_size   : 1
    <a14ed>   DW_AT_encoding    : 8	(unsigned char)
    <a14ee>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><a14f2>: Abbrev Number: 8 (DW_TAG_const_type)
    <a14f3>   DW_AT_type        : <0xa14eb>
 <1><a14f7>: Abbrev Number: 4 (DW_TAG_base_type)
    <a14f8>   DW_AT_byte_size   : 2
    <a14f9>   DW_AT_encoding    : 7	(unsigned)
    <a14fa>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><a14fe>: Abbrev Number: 4 (DW_TAG_base_type)
    <a14ff>   DW_AT_byte_size   : 4
    <a1500>   DW_AT_encoding    : 7	(unsigned)
    <a1501>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><a1505>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1506>   DW_AT_byte_size   : 8
    <a1507>   DW_AT_encoding    : 7	(unsigned)
    <a1508>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><a150c>: Abbrev Number: 4 (DW_TAG_base_type)
    <a150d>   DW_AT_byte_size   : 1
    <a150e>   DW_AT_encoding    : 6	(signed char)
    <a150f>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><a1513>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1514>   DW_AT_byte_size   : 2
    <a1515>   DW_AT_encoding    : 5	(signed)
    <a1516>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><a151a>: Abbrev Number: 27 (DW_TAG_base_type)
    <a151b>   DW_AT_byte_size   : 4
    <a151c>   DW_AT_encoding    : 5	(signed)
    <a151d>   DW_AT_name        : int
 <1><a1521>: Abbrev Number: 28 (DW_TAG_volatile_type)
    <a1522>   DW_AT_type        : <0xa151a>
 <1><a1526>: Abbrev Number: 8 (DW_TAG_const_type)
    <a1527>   DW_AT_type        : <0xa151a>
 <1><a152b>: Abbrev Number: 4 (DW_TAG_base_type)
    <a152c>   DW_AT_byte_size   : 8
    <a152d>   DW_AT_encoding    : 5	(signed)
    <a152e>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><a1532>: Abbrev Number: 9 (DW_TAG_typedef)
    <a1533>   DW_AT_name        : (indirect string, offset: 0x167f7): __ssize_t
    <a1537>   DW_AT_decl_file   : 2
    <a1538>   DW_AT_decl_line   : 194
    <a1539>   DW_AT_decl_column : 27
    <a153a>   DW_AT_type        : <0xa152b>
 <1><a153e>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a153f>   DW_AT_byte_size   : 8
    <a153f>   DW_AT_type        : <0xa1543>
 <1><a1543>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1544>   DW_AT_byte_size   : 1
    <a1545>   DW_AT_encoding    : 6	(signed char)
    <a1546>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><a154a>: Abbrev Number: 8 (DW_TAG_const_type)
    <a154b>   DW_AT_type        : <0xa1543>
 <1><a154f>: Abbrev Number: 29 (DW_TAG_typedef)
    <a1550>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <a1554>   DW_AT_decl_file   : 3
    <a1555>   DW_AT_decl_line   : 321
    <a1557>   DW_AT_decl_column : 24
    <a1558>   DW_AT_type        : <0xa151a>
 <1><a155c>: Abbrev Number: 4 (DW_TAG_base_type)
    <a155d>   DW_AT_byte_size   : 8
    <a155e>   DW_AT_encoding    : 5	(signed)
    <a155f>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><a1563>: Abbrev Number: 9 (DW_TAG_typedef)
    <a1564>   DW_AT_name        : (indirect string, offset: 0x167f9): ssize_t
    <a1568>   DW_AT_decl_file   : 4
    <a1569>   DW_AT_decl_line   : 108
    <a156a>   DW_AT_decl_column : 19
    <a156b>   DW_AT_type        : <0xa1532>
 <1><a156f>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1570>   DW_AT_byte_size   : 8
    <a1571>   DW_AT_encoding    : 7	(unsigned)
    <a1572>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><a1576>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1577>   DW_AT_byte_size   : 8
    <a1577>   DW_AT_type        : <0xa154a>
 <1><a157b>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a157c>   DW_AT_byte_size   : 8
    <a157c>   DW_AT_type        : <0xa1580>
 <1><a1580>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <a1581>   DW_AT_prototyped  : 1
 <1><a1581>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1582>   DW_AT_byte_size   : 8
    <a1583>   DW_AT_encoding    : 4	(float)
    <a1584>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><a1588>: Abbrev Number: 4 (DW_TAG_base_type)
    <a1589>   DW_AT_byte_size   : 4
    <a158a>   DW_AT_encoding    : 4	(float)
    <a158b>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><a158f>: Abbrev Number: 9 (DW_TAG_typedef)
    <a1590>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <a1594>   DW_AT_decl_file   : 5
    <a1595>   DW_AT_decl_line   : 7
    <a1596>   DW_AT_decl_column : 25
    <a1597>   DW_AT_type        : <0xa159b>
 <1><a159b>: Abbrev Number: 31 (DW_TAG_structure_type)
    <a159c>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <a15a0>   DW_AT_declaration : 1
 <1><a15a0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a15a1>   DW_AT_byte_size   : 8
    <a15a2>   DW_AT_decl_file   : 6
    <a15a2>   DW_AT_decl_line   : 4
    <a15a3>   DW_AT_decl_column : 3
    <a15a3>   DW_AT_sibling     : <0xa15c2>
 <2><a15a7>: Abbrev Number: 1 (DW_TAG_member)
    <a15a8>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <a15ac>   DW_AT_decl_file   : 6
    <a15ad>   DW_AT_decl_line   : 5
    <a15ae>   DW_AT_decl_column : 8
    <a15af>   DW_AT_type        : <0xa151a>
    <a15b3>   DW_AT_data_member_location: 0
 <2><a15b4>: Abbrev Number: 1 (DW_TAG_member)
    <a15b5>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <a15b9>   DW_AT_decl_file   : 6
    <a15ba>   DW_AT_decl_line   : 6
    <a15bb>   DW_AT_decl_column : 8
    <a15bc>   DW_AT_type        : <0xa151a>
    <a15c0>   DW_AT_data_member_location: 4
 <2><a15c1>: Abbrev Number: 0
 <1><a15c2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a15c3>   DW_AT_byte_size   : 16
    <a15c4>   DW_AT_decl_file   : 6
    <a15c4>   DW_AT_decl_line   : 8
    <a15c5>   DW_AT_decl_column : 3
    <a15c5>   DW_AT_sibling     : <0xa15f8>
 <2><a15c9>: Abbrev Number: 5 (DW_TAG_member)
    <a15ca>   DW_AT_name        : x
    <a15cc>   DW_AT_decl_file   : 6
    <a15cd>   DW_AT_decl_line   : 9
    <a15ce>   DW_AT_decl_column : 8
    <a15cf>   DW_AT_type        : <0xa151a>
    <a15d3>   DW_AT_data_member_location: 0
 <2><a15d4>: Abbrev Number: 5 (DW_TAG_member)
    <a15d5>   DW_AT_name        : y
    <a15d7>   DW_AT_decl_file   : 6
    <a15d8>   DW_AT_decl_line   : 9
    <a15d9>   DW_AT_decl_column : 11
    <a15da>   DW_AT_type        : <0xa151a>
    <a15de>   DW_AT_data_member_location: 4
 <2><a15df>: Abbrev Number: 5 (DW_TAG_member)
    <a15e0>   DW_AT_name        : dx
    <a15e3>   DW_AT_decl_file   : 6
    <a15e4>   DW_AT_decl_line   : 10
    <a15e5>   DW_AT_decl_column : 8
    <a15e6>   DW_AT_type        : <0xa151a>
    <a15ea>   DW_AT_data_member_location: 8
 <2><a15eb>: Abbrev Number: 5 (DW_TAG_member)
    <a15ec>   DW_AT_name        : dy
    <a15ef>   DW_AT_decl_file   : 6
    <a15f0>   DW_AT_decl_line   : 10
    <a15f1>   DW_AT_decl_column : 12
    <a15f2>   DW_AT_type        : <0xa151a>
    <a15f6>   DW_AT_data_member_location: 12
 <2><a15f7>: Abbrev Number: 0
 <1><a15f8>: Abbrev Number: 32 (DW_TAG_union_type)
    <a15f9>   DW_AT_byte_size   : 16
    <a15fa>   DW_AT_decl_file   : 6
    <a15fb>   DW_AT_decl_line   : 3
    <a15fc>   DW_AT_decl_column : 2
    <a15fd>   DW_AT_sibling     : <0xa1628>
 <2><a1601>: Abbrev Number: 17 (DW_TAG_member)
    <a1602>   DW_AT_type        : <0xa15a0>
 <2><a1606>: Abbrev Number: 17 (DW_TAG_member)
    <a1607>   DW_AT_type        : <0xa15c2>
 <2><a160b>: Abbrev Number: 33 (DW_TAG_member)
    <a160c>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <a1610>   DW_AT_decl_file   : 6
    <a1611>   DW_AT_decl_line   : 12
    <a1612>   DW_AT_decl_column : 7
    <a1613>   DW_AT_type        : <0xa151a>
 <2><a1617>: Abbrev Number: 18 (DW_TAG_member)
    <a1618>   DW_AT_name        : z
    <a161a>   DW_AT_decl_file   : 6
    <a161a>   DW_AT_decl_line   : 13
    <a161b>   DW_AT_decl_column : 7
    <a161b>   DW_AT_type        : <0xa151a>
 <2><a161f>: Abbrev Number: 18 (DW_TAG_member)
    <a1620>   DW_AT_name        : w
    <a1622>   DW_AT_decl_file   : 6
    <a1622>   DW_AT_decl_line   : 14
    <a1623>   DW_AT_decl_column : 7
    <a1623>   DW_AT_type        : <0xa151a>
 <2><a1627>: Abbrev Number: 0
 <1><a1628>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a1629>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <a162d>   DW_AT_byte_size   : 20
    <a162e>   DW_AT_decl_file   : 6
    <a162f>   DW_AT_decl_line   : 1
    <a1630>   DW_AT_decl_column : 8
    <a1631>   DW_AT_sibling     : <0xa1649>
 <2><a1635>: Abbrev Number: 1 (DW_TAG_member)
    <a1636>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <a163a>   DW_AT_decl_file   : 6
    <a163b>   DW_AT_decl_line   : 2
    <a163c>   DW_AT_decl_column : 6
    <a163d>   DW_AT_type        : <0xa151a>
    <a1641>   DW_AT_data_member_location: 0
 <2><a1642>: Abbrev Number: 34 (DW_TAG_member)
    <a1643>   DW_AT_type        : <0xa15f8>
    <a1647>   DW_AT_data_member_location: 4
 <2><a1648>: Abbrev Number: 0
 <1><a1649>: Abbrev Number: 9 (DW_TAG_typedef)
    <a164a>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <a164e>   DW_AT_decl_file   : 6
    <a164f>   DW_AT_decl_line   : 18
    <a1650>   DW_AT_decl_column : 23
    <a1651>   DW_AT_type        : <0xa1628>
 <1><a1655>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1656>   DW_AT_byte_size   : 8
    <a1656>   DW_AT_type        : <0xa165a>
 <1><a165a>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <a165b>   DW_AT_prototyped  : 1
    <a165b>   DW_AT_type        : <0xa151a>
    <a165f>   DW_AT_sibling     : <0xa166e>
 <2><a1663>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1664>   DW_AT_type        : <0xa151a>
 <2><a1668>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1669>   DW_AT_type        : <0xa151a>
 <2><a166d>: Abbrev Number: 0
 <1><a166e>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a166f>   DW_AT_byte_size   : 8
    <a166f>   DW_AT_type        : <0xa151a>
 <1><a1673>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1674>   DW_AT_byte_size   : 8
    <a1674>   DW_AT_type        : <0xa1678>
 <1><a1678>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <a1679>   DW_AT_prototyped  : 1
    <a1679>   DW_AT_type        : <0xa151a>
    <a167d>   DW_AT_sibling     : <0xa169b>
 <2><a1681>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1682>   DW_AT_type        : <0xa166e>
 <2><a1686>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1687>   DW_AT_type        : <0xa166e>
 <2><a168b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a168c>   DW_AT_type        : <0xa166e>
 <2><a1690>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1691>   DW_AT_type        : <0xa166e>
 <2><a1695>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1696>   DW_AT_type        : <0xa166e>
 <2><a169a>: Abbrev Number: 0
 <1><a169b>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a169c>   DW_AT_byte_size   : 8
    <a169c>   DW_AT_type        : <0xa1649>
 <1><a16a0>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a16a1>   DW_AT_byte_size   : 8
    <a16a1>   DW_AT_type        : <0xa14eb>
 <1><a16a5>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a16a6>   DW_AT_byte_size   : 8
    <a16a6>   DW_AT_type        : <0xa16a0>
 <1><a16aa>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a16ab>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <a16af>   DW_AT_byte_size   : 12
    <a16b0>   DW_AT_decl_file   : 7
    <a16b1>   DW_AT_decl_line   : 139
    <a16b2>   DW_AT_decl_column : 16
    <a16b3>   DW_AT_sibling     : <0xa16dc>
 <2><a16b7>: Abbrev Number: 5 (DW_TAG_member)
    <a16b8>   DW_AT_name        : ch
    <a16bb>   DW_AT_decl_file   : 7
    <a16bc>   DW_AT_decl_line   : 140
    <a16bd>   DW_AT_decl_column : 14
    <a16be>   DW_AT_type        : <0xa154f>
    <a16c2>   DW_AT_data_member_location: 0
 <2><a16c3>: Abbrev Number: 5 (DW_TAG_member)
    <a16c4>   DW_AT_name        : fg
    <a16c7>   DW_AT_decl_file   : 7
    <a16c8>   DW_AT_decl_line   : 141
    <a16c9>   DW_AT_decl_column : 14
    <a16ca>   DW_AT_type        : <0xa14fe>
    <a16ce>   DW_AT_data_member_location: 4
 <2><a16cf>: Abbrev Number: 5 (DW_TAG_member)
    <a16d0>   DW_AT_name        : bg
    <a16d3>   DW_AT_decl_file   : 7
    <a16d4>   DW_AT_decl_line   : 141
    <a16d5>   DW_AT_decl_column : 18
    <a16d6>   DW_AT_type        : <0xa14fe>
    <a16da>   DW_AT_data_member_location: 8
 <2><a16db>: Abbrev Number: 0
 <1><a16dc>: Abbrev Number: 9 (DW_TAG_typedef)
    <a16dd>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <a16e1>   DW_AT_decl_file   : 7
    <a16e2>   DW_AT_decl_line   : 142
    <a16e3>   DW_AT_decl_column : 3
    <a16e4>   DW_AT_type        : <0xa16aa>
 <1><a16e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a16e9>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a16ed>   DW_AT_byte_size   : 208
    <a16ee>   DW_AT_decl_file   : 7
    <a16ef>   DW_AT_decl_line   : 144
    <a16f0>   DW_AT_decl_column : 16
    <a16f1>   DW_AT_sibling     : <0xa18ab>
 <2><a16f5>: Abbrev Number: 5 (DW_TAG_member)
    <a16f6>   DW_AT_name        : id
    <a16f9>   DW_AT_decl_file   : 7
    <a16fa>   DW_AT_decl_line   : 146
    <a16fb>   DW_AT_decl_column : 6
    <a16fc>   DW_AT_type        : <0xa151a>
    <a1700>   DW_AT_data_member_location: 0
 <2><a1701>: Abbrev Number: 1 (DW_TAG_member)
    <a1702>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <a1706>   DW_AT_decl_file   : 7
    <a1707>   DW_AT_decl_line   : 147
    <a1708>   DW_AT_decl_column : 9
    <a1709>   DW_AT_type        : <0xa151a>
    <a170d>   DW_AT_data_member_location: 4
 <2><a170e>: Abbrev Number: 1 (DW_TAG_member)
    <a170f>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <a1713>   DW_AT_decl_file   : 7
    <a1714>   DW_AT_decl_line   : 148
    <a1715>   DW_AT_decl_column : 21
    <a1716>   DW_AT_type        : <0xa16a5>
    <a171a>   DW_AT_data_member_location: 8
 <2><a171b>: Abbrev Number: 1 (DW_TAG_member)
    <a171c>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <a1720>   DW_AT_decl_file   : 7
    <a1721>   DW_AT_decl_line   : 149
    <a1722>   DW_AT_decl_column : 9
    <a1723>   DW_AT_type        : <0xa151a>
    <a1727>   DW_AT_data_member_location: 16
 <2><a1728>: Abbrev Number: 1 (DW_TAG_member)
    <a1729>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <a172d>   DW_AT_decl_file   : 7
    <a172e>   DW_AT_decl_line   : 150
    <a172f>   DW_AT_decl_column : 9
    <a1730>   DW_AT_type        : <0xa151a>
    <a1734>   DW_AT_data_member_location: 20
 <2><a1735>: Abbrev Number: 1 (DW_TAG_member)
    <a1736>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <a173a>   DW_AT_decl_file   : 7
    <a173b>   DW_AT_decl_line   : 151
    <a173c>   DW_AT_decl_column : 20
    <a173d>   DW_AT_type        : <0xa16a0>
    <a1741>   DW_AT_data_member_location: 24
 <2><a1742>: Abbrev Number: 5 (DW_TAG_member)
    <a1743>   DW_AT_name        : w
    <a1745>   DW_AT_decl_file   : 7
    <a1746>   DW_AT_decl_line   : 152
    <a1747>   DW_AT_decl_column : 9
    <a1748>   DW_AT_type        : <0xa151a>
    <a174c>   DW_AT_data_member_location: 32
 <2><a174d>: Abbrev Number: 5 (DW_TAG_member)
    <a174e>   DW_AT_name        : h
    <a1750>   DW_AT_decl_file   : 7
    <a1751>   DW_AT_decl_line   : 152
    <a1752>   DW_AT_decl_column : 12
    <a1753>   DW_AT_type        : <0xa151a>
    <a1757>   DW_AT_data_member_location: 36
 <2><a1758>: Abbrev Number: 1 (DW_TAG_member)
    <a1759>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <a175d>   DW_AT_decl_file   : 7
    <a175e>   DW_AT_decl_line   : 153
    <a175f>   DW_AT_decl_column : 9
    <a1760>   DW_AT_type        : <0xa151a>
    <a1764>   DW_AT_data_member_location: 40
 <2><a1765>: Abbrev Number: 5 (DW_TAG_member)
    <a1766>   DW_AT_name        : bpp
    <a176a>   DW_AT_decl_file   : 7
    <a176b>   DW_AT_decl_line   : 154
    <a176c>   DW_AT_decl_column : 9
    <a176d>   DW_AT_type        : <0xa151a>
    <a1771>   DW_AT_data_member_location: 44
 <2><a1772>: Abbrev Number: 1 (DW_TAG_member)
    <a1773>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a1777>   DW_AT_decl_file   : 7
    <a1778>   DW_AT_decl_line   : 155
    <a1779>   DW_AT_decl_column : 9
    <a177a>   DW_AT_type        : <0xa151a>
    <a177e>   DW_AT_data_member_location: 48
 <2><a177f>: Abbrev Number: 1 (DW_TAG_member)
    <a1780>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <a1784>   DW_AT_decl_file   : 7
    <a1785>   DW_AT_decl_line   : 156
    <a1786>   DW_AT_decl_column : 19
    <a1787>   DW_AT_type        : <0xa18ab>
    <a178b>   DW_AT_data_member_location: 56
 <2><a178c>: Abbrev Number: 1 (DW_TAG_member)
    <a178d>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <a1791>   DW_AT_decl_file   : 7
    <a1792>   DW_AT_decl_line   : 157
    <a1793>   DW_AT_decl_column : 19
    <a1794>   DW_AT_type        : <0xa18ab>
    <a1798>   DW_AT_data_member_location: 64
 <2><a1799>: Abbrev Number: 1 (DW_TAG_member)
    <a179a>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <a179e>   DW_AT_decl_file   : 7
    <a179f>   DW_AT_decl_line   : 158
    <a17a0>   DW_AT_decl_column : 20
    <a17a1>   DW_AT_type        : <0xa16a0>
    <a17a5>   DW_AT_data_member_location: 72
 <2><a17a6>: Abbrev Number: 1 (DW_TAG_member)
    <a17a7>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a17ab>   DW_AT_decl_file   : 7
    <a17ac>   DW_AT_decl_line   : 159
    <a17ad>   DW_AT_decl_column : 11
    <a17ae>   DW_AT_type        : <0xa153e>
    <a17b2>   DW_AT_data_member_location: 80
 <2><a17b3>: Abbrev Number: 1 (DW_TAG_member)
    <a17b4>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <a17b8>   DW_AT_decl_file   : 7
    <a17b9>   DW_AT_decl_line   : 160
    <a17ba>   DW_AT_decl_column : 29
    <a17bb>   DW_AT_type        : <0xa1979>
    <a17bf>   DW_AT_data_member_location: 88
 <2><a17c0>: Abbrev Number: 1 (DW_TAG_member)
    <a17c1>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <a17c5>   DW_AT_decl_file   : 7
    <a17c6>   DW_AT_decl_line   : 161
    <a17c7>   DW_AT_decl_column : 9
    <a17c8>   DW_AT_type        : <0xa151a>
    <a17cc>   DW_AT_data_member_location: 96
 <2><a17cd>: Abbrev Number: 1 (DW_TAG_member)
    <a17ce>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <a17d2>   DW_AT_decl_file   : 7
    <a17d3>   DW_AT_decl_line   : 162
    <a17d4>   DW_AT_decl_column : 27
    <a17d5>   DW_AT_type        : <0xa19a9>
    <a17d9>   DW_AT_data_member_location: 104
 <2><a17da>: Abbrev Number: 1 (DW_TAG_member)
    <a17db>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <a17df>   DW_AT_decl_file   : 7
    <a17e0>   DW_AT_decl_line   : 163
    <a17e1>   DW_AT_decl_column : 9
    <a17e2>   DW_AT_type        : <0xa151a>
    <a17e6>   DW_AT_data_member_location: 112
 <2><a17e7>: Abbrev Number: 1 (DW_TAG_member)
    <a17e8>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <a17ec>   DW_AT_decl_file   : 7
    <a17ed>   DW_AT_decl_line   : 164
    <a17ee>   DW_AT_decl_column : 9
    <a17ef>   DW_AT_type        : <0xa151a>
    <a17f3>   DW_AT_data_member_location: 116
 <2><a17f4>: Abbrev Number: 1 (DW_TAG_member)
    <a17f5>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <a17f9>   DW_AT_decl_file   : 7
    <a17fa>   DW_AT_decl_line   : 164
    <a17fb>   DW_AT_decl_column : 19
    <a17fc>   DW_AT_type        : <0xa151a>
    <a1800>   DW_AT_data_member_location: 120
 <2><a1801>: Abbrev Number: 1 (DW_TAG_member)
    <a1802>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <a1806>   DW_AT_decl_file   : 7
    <a1807>   DW_AT_decl_line   : 165
    <a1808>   DW_AT_decl_column : 24
    <a1809>   DW_AT_type        : <0xa19e0>
    <a180d>   DW_AT_data_member_location: 128
 <2><a180e>: Abbrev Number: 1 (DW_TAG_member)
    <a180f>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <a1813>   DW_AT_decl_file   : 7
    <a1814>   DW_AT_decl_line   : 166
    <a1815>   DW_AT_decl_column : 9
    <a1816>   DW_AT_type        : <0xa151a>
    <a181a>   DW_AT_data_member_location: 136
 <2><a181b>: Abbrev Number: 1 (DW_TAG_member)
    <a181c>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <a1820>   DW_AT_decl_file   : 7
    <a1821>   DW_AT_decl_line   : 166
    <a1822>   DW_AT_decl_column : 17
    <a1823>   DW_AT_type        : <0xa151a>
    <a1827>   DW_AT_data_member_location: 140
 <2><a1828>: Abbrev Number: 1 (DW_TAG_member)
    <a1829>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <a182d>   DW_AT_decl_file   : 7
    <a182e>   DW_AT_decl_line   : 167
    <a182f>   DW_AT_decl_column : 11
    <a1830>   DW_AT_type        : <0xa1588>
    <a1834>   DW_AT_data_member_location: 144
 <2><a1835>: Abbrev Number: 5 (DW_TAG_member)
    <a1836>   DW_AT_name        : key
    <a183a>   DW_AT_decl_file   : 7
    <a183b>   DW_AT_decl_line   : 168
    <a183c>   DW_AT_decl_column : 11
    <a183d>   DW_AT_type        : <0xa153e>
    <a1841>   DW_AT_data_member_location: 152
 <2><a1842>: Abbrev Number: 1 (DW_TAG_member)
    <a1843>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <a1847>   DW_AT_decl_file   : 7
    <a1848>   DW_AT_decl_line   : 169
    <a1849>   DW_AT_decl_column : 6
    <a184a>   DW_AT_type        : <0xa151a>
    <a184e>   DW_AT_data_member_location: 160
 <2><a184f>: Abbrev Number: 1 (DW_TAG_member)
    <a1850>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <a1854>   DW_AT_decl_file   : 7
    <a1855>   DW_AT_decl_line   : 170
    <a1856>   DW_AT_decl_column : 18
    <a1857>   DW_AT_type        : <0xa19e5>
    <a185b>   DW_AT_data_member_location: 168
 <2><a185c>: Abbrev Number: 1 (DW_TAG_member)
    <a185d>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <a1861>   DW_AT_decl_file   : 7
    <a1862>   DW_AT_decl_line   : 171
    <a1863>   DW_AT_decl_column : 12
    <a1864>   DW_AT_type        : <0xa169b>
    <a1868>   DW_AT_data_member_location: 176
 <2><a1869>: Abbrev Number: 1 (DW_TAG_member)
    <a186a>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <a186e>   DW_AT_decl_file   : 7
    <a186f>   DW_AT_decl_line   : 172
    <a1870>   DW_AT_decl_column : 9
    <a1871>   DW_AT_type        : <0xa151a>
    <a1875>   DW_AT_data_member_location: 184
 <2><a1876>: Abbrev Number: 1 (DW_TAG_member)
    <a1877>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <a187b>   DW_AT_decl_file   : 7
    <a187c>   DW_AT_decl_line   : 172
    <a187d>   DW_AT_decl_column : 21
    <a187e>   DW_AT_type        : <0xa151a>
    <a1882>   DW_AT_data_member_location: 188
 <2><a1883>: Abbrev Number: 1 (DW_TAG_member)
    <a1884>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <a1888>   DW_AT_decl_file   : 7
    <a1889>   DW_AT_decl_line   : 173
    <a188a>   DW_AT_decl_column : 11
    <a188b>   DW_AT_type        : <0xa19ef>
    <a188f>   DW_AT_data_member_location: 192
 <2><a1890>: Abbrev Number: 1 (DW_TAG_member)
    <a1891>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a1895>   DW_AT_decl_file   : 7
    <a1896>   DW_AT_decl_line   : 174
    <a1897>   DW_AT_decl_column : 15
    <a1898>   DW_AT_type        : <0xa1521>
    <a189c>   DW_AT_data_member_location: 200
 <2><a189d>: Abbrev Number: 1 (DW_TAG_member)
    <a189e>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <a18a2>   DW_AT_decl_file   : 7
    <a18a3>   DW_AT_decl_line   : 175
    <a18a4>   DW_AT_decl_column : 6
    <a18a5>   DW_AT_type        : <0xa151a>
    <a18a9>   DW_AT_data_member_location: 204
 <2><a18aa>: Abbrev Number: 0
 <1><a18ab>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a18ac>   DW_AT_byte_size   : 8
    <a18ac>   DW_AT_type        : <0xa14fe>
 <1><a18b0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a18b1>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <a18b5>   DW_AT_byte_size   : 112
    <a18b6>   DW_AT_decl_file   : 7
    <a18b7>   DW_AT_decl_line   : 178
    <a18b8>   DW_AT_decl_column : 16
    <a18b9>   DW_AT_sibling     : <0xa1974>
 <2><a18bd>: Abbrev Number: 1 (DW_TAG_member)
    <a18be>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <a18c2>   DW_AT_decl_file   : 7
    <a18c3>   DW_AT_decl_line   : 188
    <a18c4>   DW_AT_decl_column : 8
    <a18c5>   DW_AT_type        : <0xa153e>
    <a18c9>   DW_AT_data_member_location: 0
 <2><a18ca>: Abbrev Number: 1 (DW_TAG_member)
    <a18cb>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <a18cf>   DW_AT_decl_file   : 7
    <a18d0>   DW_AT_decl_line   : 208
    <a18d1>   DW_AT_decl_column : 8
    <a18d2>   DW_AT_type        : <0xa1a28>
    <a18d6>   DW_AT_data_member_location: 8
 <2><a18d7>: Abbrev Number: 1 (DW_TAG_member)
    <a18d8>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <a18dc>   DW_AT_decl_file   : 7
    <a18dd>   DW_AT_decl_line   : 222
    <a18de>   DW_AT_decl_column : 9
    <a18df>   DW_AT_type        : <0xa157b>
    <a18e3>   DW_AT_data_member_location: 16
 <2><a18e4>: Abbrev Number: 1 (DW_TAG_member)
    <a18e5>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <a18e9>   DW_AT_decl_file   : 7
    <a18ea>   DW_AT_decl_line   : 231
    <a18eb>   DW_AT_decl_column : 9
    <a18ec>   DW_AT_type        : <0xa157b>
    <a18f0>   DW_AT_data_member_location: 24
 <2><a18f1>: Abbrev Number: 1 (DW_TAG_member)
    <a18f2>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <a18f6>   DW_AT_decl_file   : 7
    <a18f7>   DW_AT_decl_line   : 239
    <a18f8>   DW_AT_decl_column : 9
    <a18f9>   DW_AT_type        : <0xa157b>
    <a18fd>   DW_AT_data_member_location: 32
 <2><a18fe>: Abbrev Number: 1 (DW_TAG_member)
    <a18ff>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <a1903>   DW_AT_decl_file   : 7
    <a1904>   DW_AT_decl_line   : 248
    <a1905>   DW_AT_decl_column : 9
    <a1906>   DW_AT_type        : <0xa1a47>
    <a190a>   DW_AT_data_member_location: 40
 <2><a190b>: Abbrev Number: 6 (DW_TAG_member)
    <a190c>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <a1910>   DW_AT_decl_file   : 7
    <a1910>   DW_AT_decl_line   : 258
    <a1912>   DW_AT_decl_column : 9
    <a1913>   DW_AT_type        : <0xa157b>
    <a1917>   DW_AT_data_member_location: 48
 <2><a1918>: Abbrev Number: 6 (DW_TAG_member)
    <a1919>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <a191d>   DW_AT_decl_file   : 7
    <a191d>   DW_AT_decl_line   : 274
    <a191f>   DW_AT_decl_column : 8
    <a1920>   DW_AT_type        : <0xa1673>
    <a1924>   DW_AT_data_member_location: 56
 <2><a1925>: Abbrev Number: 6 (DW_TAG_member)
    <a1926>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <a192a>   DW_AT_decl_file   : 7
    <a192a>   DW_AT_decl_line   : 285
    <a192c>   DW_AT_decl_column : 9
    <a192d>   DW_AT_type        : <0xa1a47>
    <a1931>   DW_AT_data_member_location: 64
 <2><a1932>: Abbrev Number: 6 (DW_TAG_member)
    <a1933>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <a1937>   DW_AT_decl_file   : 7
    <a1937>   DW_AT_decl_line   : 293
    <a1939>   DW_AT_decl_column : 9
    <a193a>   DW_AT_type        : <0xa1a57>
    <a193e>   DW_AT_data_member_location: 72
 <2><a193f>: Abbrev Number: 6 (DW_TAG_member)
    <a1940>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <a1944>   DW_AT_decl_file   : 7
    <a1944>   DW_AT_decl_line   : 301
    <a1946>   DW_AT_decl_column : 8
    <a1947>   DW_AT_type        : <0xa1655>
    <a194b>   DW_AT_data_member_location: 80
 <2><a194c>: Abbrev Number: 6 (DW_TAG_member)
    <a194d>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <a1951>   DW_AT_decl_file   : 7
    <a1951>   DW_AT_decl_line   : 314
    <a1953>   DW_AT_decl_column : 9
    <a1954>   DW_AT_type        : <0xa1a70>
    <a1958>   DW_AT_data_member_location: 88
 <2><a1959>: Abbrev Number: 6 (DW_TAG_member)
    <a195a>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <a195e>   DW_AT_decl_file   : 7
    <a195e>   DW_AT_decl_line   : 321
    <a1960>   DW_AT_decl_column : 9
    <a1961>   DW_AT_type        : <0xa157b>
    <a1965>   DW_AT_data_member_location: 96
 <2><a1966>: Abbrev Number: 6 (DW_TAG_member)
    <a1967>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <a196b>   DW_AT_decl_file   : 7
    <a196b>   DW_AT_decl_line   : 328
    <a196d>   DW_AT_decl_column : 9
    <a196e>   DW_AT_type        : <0xa157b>
    <a1972>   DW_AT_data_member_location: 104
 <2><a1973>: Abbrev Number: 0
 <1><a1974>: Abbrev Number: 8 (DW_TAG_const_type)
    <a1975>   DW_AT_type        : <0xa18b0>
 <1><a1979>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a197a>   DW_AT_byte_size   : 8
    <a197a>   DW_AT_type        : <0xa1974>
 <1><a197e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a197f>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <a1983>   DW_AT_byte_size   : 16
    <a1983>   DW_AT_decl_file   : 7
    <a1983>   DW_AT_decl_line   : 331
    <a1985>   DW_AT_decl_column : 16
    <a1985>   DW_AT_sibling     : <0xa19a4>
 <2><a1989>: Abbrev Number: 6 (DW_TAG_member)
    <a198a>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <a198e>   DW_AT_decl_file   : 7
    <a198e>   DW_AT_decl_line   : 333
    <a1990>   DW_AT_decl_column : 12
    <a1991>   DW_AT_type        : <0xa1526>
    <a1995>   DW_AT_data_member_location: 0
 <2><a1996>: Abbrev Number: 6 (DW_TAG_member)
    <a1997>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a199b>   DW_AT_decl_file   : 7
    <a199b>   DW_AT_decl_line   : 334
    <a199d>   DW_AT_decl_column : 23
    <a199e>   DW_AT_type        : <0xa1a75>
    <a19a2>   DW_AT_data_member_location: 8
 <2><a19a3>: Abbrev Number: 0
 <1><a19a4>: Abbrev Number: 8 (DW_TAG_const_type)
    <a19a5>   DW_AT_type        : <0xa197e>
 <1><a19a9>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a19aa>   DW_AT_byte_size   : 8
    <a19aa>   DW_AT_type        : <0xa19a4>
 <1><a19ae>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a19af>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <a19b3>   DW_AT_byte_size   : 16
    <a19b3>   DW_AT_decl_file   : 7
    <a19b3>   DW_AT_decl_line   : 337
    <a19b5>   DW_AT_decl_column : 16
    <a19b5>   DW_AT_sibling     : <0xa19db>
 <2><a19b9>: Abbrev Number: 20 (DW_TAG_member)
    <a19ba>   DW_AT_name        : w
    <a19bc>   DW_AT_decl_file   : 7
    <a19bc>   DW_AT_decl_line   : 339
    <a19be>   DW_AT_decl_column : 15
    <a19be>   DW_AT_type        : <0xa1526>
    <a19c2>   DW_AT_data_member_location: 0
 <2><a19c3>: Abbrev Number: 20 (DW_TAG_member)
    <a19c4>   DW_AT_name        : h
    <a19c6>   DW_AT_decl_file   : 7
    <a19c6>   DW_AT_decl_line   : 340
    <a19c8>   DW_AT_decl_column : 15
    <a19c8>   DW_AT_type        : <0xa1526>
    <a19cc>   DW_AT_data_member_location: 4
 <2><a19cd>: Abbrev Number: 6 (DW_TAG_member)
    <a19ce>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a19d2>   DW_AT_decl_file   : 7
    <a19d2>   DW_AT_decl_line   : 341
    <a19d4>   DW_AT_decl_column : 23
    <a19d5>   DW_AT_type        : <0xa1a75>
    <a19d9>   DW_AT_data_member_location: 8
 <2><a19da>: Abbrev Number: 0
 <1><a19db>: Abbrev Number: 8 (DW_TAG_const_type)
    <a19dc>   DW_AT_type        : <0xa19ae>
 <1><a19e0>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a19e1>   DW_AT_byte_size   : 8
    <a19e1>   DW_AT_type        : <0xa19db>
 <1><a19e5>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a19e6>   DW_AT_byte_size   : 8
    <a19e6>   DW_AT_type        : <0xa19ea>
 <1><a19ea>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a19eb>   DW_AT_byte_size   : 8
    <a19eb>   DW_AT_type        : <0xa16dc>
 <1><a19ef>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a19f0>   DW_AT_byte_size   : 8
    <a19f0>   DW_AT_type        : <0xa158f>
 <1><a19f4>: Abbrev Number: 9 (DW_TAG_typedef)
    <a19f5>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a19f9>   DW_AT_decl_file   : 7
    <a19fa>   DW_AT_decl_line   : 176
    <a19fb>   DW_AT_decl_column : 3
    <a19fc>   DW_AT_type        : <0xa16e8>
 <1><a1a00>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <a1a01>   DW_AT_prototyped  : 1
    <a1a01>   DW_AT_type        : <0xa151a>
    <a1a05>   DW_AT_sibling     : <0xa1a28>
 <2><a1a09>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a0a>   DW_AT_type        : <0xa153e>
 <2><a1a0e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a0f>   DW_AT_type        : <0xa151a>
 <2><a1a13>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a14>   DW_AT_type        : <0xa151a>
 <2><a1a18>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a19>   DW_AT_type        : <0xa151a>
 <2><a1a1d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a1e>   DW_AT_type        : <0xa151a>
 <2><a1a22>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a23>   DW_AT_type        : <0xa151a>
 <2><a1a27>: Abbrev Number: 0
 <1><a1a28>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a29>   DW_AT_byte_size   : 8
    <a1a29>   DW_AT_type        : <0xa1a00>
 <1><a1a2d>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <a1a2e>   DW_AT_prototyped  : 1
    <a1a2e>   DW_AT_sibling     : <0xa1a47>
 <2><a1a32>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a33>   DW_AT_type        : <0xa151a>
 <2><a1a37>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a38>   DW_AT_type        : <0xa151a>
 <2><a1a3c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a3d>   DW_AT_type        : <0xa151a>
 <2><a1a41>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a42>   DW_AT_type        : <0xa151a>
 <2><a1a46>: Abbrev Number: 0
 <1><a1a47>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a48>   DW_AT_byte_size   : 8
    <a1a48>   DW_AT_type        : <0xa1a2d>
 <1><a1a4c>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <a1a4d>   DW_AT_prototyped  : 1
    <a1a4d>   DW_AT_sibling     : <0xa1a57>
 <2><a1a51>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a52>   DW_AT_type        : <0xa153e>
 <2><a1a56>: Abbrev Number: 0
 <1><a1a57>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a58>   DW_AT_byte_size   : 8
    <a1a58>   DW_AT_type        : <0xa1a4c>
 <1><a1a5c>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <a1a5d>   DW_AT_prototyped  : 1
    <a1a5d>   DW_AT_type        : <0xa166e>
    <a1a61>   DW_AT_sibling     : <0xa1a70>
 <2><a1a65>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a66>   DW_AT_type        : <0xa151a>
 <2><a1a6a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1a6b>   DW_AT_type        : <0xa166e>
 <2><a1a6f>: Abbrev Number: 0
 <1><a1a70>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a71>   DW_AT_byte_size   : 8
    <a1a71>   DW_AT_type        : <0xa1a5c>
 <1><a1a75>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a76>   DW_AT_byte_size   : 8
    <a1a76>   DW_AT_type        : <0xa14f2>
 <1><a1a7a>: Abbrev Number: 35 (DW_TAG_variable)
    <a1a7b>   DW_AT_name        : (indirect string, offset: 0x166bb): __fb_gfx
    <a1a7f>   DW_AT_decl_file   : 7
    <a1a80>   DW_AT_decl_line   : 364
    <a1a82>   DW_AT_decl_column : 15
    <a1a83>   DW_AT_type        : <0xa1a87>
    <a1a87>   DW_AT_external    : 1
    <a1a87>   DW_AT_declaration : 1
 <1><a1a87>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <a1a88>   DW_AT_byte_size   : 8
    <a1a88>   DW_AT_type        : <0xa19f4>
 <1><a1a8c>: Abbrev Number: 36 (DW_TAG_subprogram)
    <a1a8d>   DW_AT_external    : 1
    <a1a8d>   DW_AT_name        : (indirect string, offset: 0x1ab68): fb_Getkey
    <a1a91>   DW_AT_decl_file   : 8
    <a1a92>   DW_AT_decl_line   : 7
    <a1a93>   DW_AT_decl_column : 21
    <a1a94>   DW_AT_prototyped  : 1
    <a1a94>   DW_AT_type        : <0xa151a>
    <a1a98>   DW_AT_declaration : 1
 <1><a1a98>: Abbrev Number: 37 (DW_TAG_subprogram)
    <a1a99>   DW_AT_external    : 1
    <a1a99>   DW_AT_name        : (indirect string, offset: 0x1aa35): fb_GfxPrintBuffer
    <a1a9d>   DW_AT_decl_file   : 7
    <a1a9e>   DW_AT_decl_line   : 503
    <a1aa0>   DW_AT_decl_column : 6
    <a1aa1>   DW_AT_prototyped  : 1
    <a1aa1>   DW_AT_declaration : 1
    <a1aa1>   DW_AT_sibling     : <0xa1ab0>
 <2><a1aa5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1aa6>   DW_AT_type        : <0xa1576>
 <2><a1aaa>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <a1aab>   DW_AT_type        : <0xa151a>
 <2><a1aaf>: Abbrev Number: 0
 <1><a1ab0>: Abbrev Number: 38 (DW_TAG_subprogram)
    <a1ab1>   DW_AT_external    : 1
    <a1ab1>   DW_AT_name        : (indirect string, offset: 0x18235): fb_GfxReadStr
    <a1ab5>   DW_AT_decl_file   : 1
    <a1ab6>   DW_AT_decl_line   : 14
    <a1ab7>   DW_AT_decl_column : 7
    <a1ab8>   DW_AT_prototyped  : 1
    <a1ab8>   DW_AT_type        : <0xa153e>
    <a1abc>   DW_AT_low_pc      : 0x468c70
    <a1ac4>   DW_AT_high_pc     : 0x26f
    <a1acc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a1ace>   DW_AT_call_all_calls: 1
    <a1ace>   DW_AT_sibling     : <0xa1c70>
 <2><a1ad2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <a1ad3>   DW_AT_name        : (indirect string, offset: 0x16e82): buffer
    <a1ad7>   DW_AT_decl_file   : 1
    <a1ad7>   DW_AT_decl_line   : 14
    <a1ad7>   DW_AT_decl_column : 27
    <a1ad8>   DW_AT_type        : <0xa153e>
    <a1adc>   DW_AT_location    : 0x2f28a (location list)
    <a1ae0>   DW_AT_GNU_locviews: 0x2f280
 <2><a1ae4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <a1ae5>   DW_AT_name        : (indirect string, offset: 0x1ab72): maxlen
    <a1ae9>   DW_AT_decl_file   : 1
    <a1ae9>   DW_AT_decl_line   : 14
    <a1ae9>   DW_AT_decl_column : 43
    <a1aea>   DW_AT_type        : <0xa1563>
    <a1aee>   DW_AT_location    : 0x2f2b7 (location list)
    <a1af2>   DW_AT_GNU_locviews: 0x2f2b1
 <2><a1af6>: Abbrev Number: 23 (DW_TAG_variable)
    <a1af7>   DW_AT_name        : key
    <a1afb>   DW_AT_decl_file   : 1
    <a1afb>   DW_AT_decl_line   : 16
    <a1afc>   DW_AT_decl_column : 6
    <a1afd>   DW_AT_type        : <0xa151a>
    <a1b01>   DW_AT_location    : 0x2f2dd (location list)
    <a1b05>   DW_AT_GNU_locviews: 0x2f2d3
 <2><a1b09>: Abbrev Number: 23 (DW_TAG_variable)
    <a1b0a>   DW_AT_name        : len
    <a1b0e>   DW_AT_decl_file   : 1
    <a1b0e>   DW_AT_decl_line   : 17
    <a1b0f>   DW_AT_decl_column : 10
    <a1b10>   DW_AT_type        : <0xa1563>
    <a1b14>   DW_AT_location    : 0x2f311 (location list)
    <a1b18>   DW_AT_GNU_locviews: 0x2f303
 <2><a1b1c>: Abbrev Number: 12 (DW_TAG_variable)
    <a1b1d>   DW_AT_name        : (indirect string, offset: 0x1ab50): cursor_normal
    <a1b21>   DW_AT_decl_file   : 1
    <a1b21>   DW_AT_decl_line   : 18
    <a1b22>   DW_AT_decl_column : 7
    <a1b22>   DW_AT_type        : <0xa1c70>
    <a1b26>   DW_AT_location    : 3 byte block: 91 af 7f 	(DW_OP_fbreg: -81)
 <2><a1b2a>: Abbrev Number: 12 (DW_TAG_variable)
    <a1b2b>   DW_AT_name        : (indirect string, offset: 0x1ab3f): cursor_backspace
    <a1b2f>   DW_AT_decl_file   : 1
    <a1b2f>   DW_AT_decl_line   : 19
    <a1b30>   DW_AT_decl_column : 7
    <a1b30>   DW_AT_type        : <0xa1c80>
    <a1b34>   DW_AT_location    : 3 byte block: 91 b5 7f 	(DW_OP_fbreg: -75)
 <2><a1b38>: Abbrev Number: 12 (DW_TAG_variable)
    <a1b39>   DW_AT_name        : (indirect string, offset: 0x1c177): space
    <a1b3d>   DW_AT_decl_file   : 1
    <a1b3d>   DW_AT_decl_line   : 20
    <a1b3e>   DW_AT_decl_column : 7
    <a1b3e>   DW_AT_type        : <0xa1c70>
    <a1b42>   DW_AT_location    : 3 byte block: 91 b1 7f 	(DW_OP_fbreg: -79)
 <2><a1b46>: Abbrev Number: 12 (DW_TAG_variable)
    <a1b47>   DW_AT_name        : (indirect string, offset: 0x1ab5e): character
    <a1b4b>   DW_AT_decl_file   : 1
    <a1b4b>   DW_AT_decl_line   : 21
    <a1b4c>   DW_AT_decl_column : 7
    <a1b4c>   DW_AT_type        : <0xa1c70>
    <a1b50>   DW_AT_location    : 3 byte block: 91 b3 7f 	(DW_OP_fbreg: -77)
 <2><a1b54>: Abbrev Number: 39 (DW_TAG_variable)
    <a1b55>   DW_AT_name        : (indirect string, offset: 0x1948c): cursor
    <a1b59>   DW_AT_decl_file   : 1
    <a1b5a>   DW_AT_decl_line   : 22
    <a1b5b>   DW_AT_decl_column : 8
    <a1b5c>   DW_AT_type        : <0xa153e>
    <a1b60>   DW_AT_location    : 0x2f352 (location list)
    <a1b64>   DW_AT_GNU_locviews: 0x2f342
 <2><a1b68>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <a1b69>   DW_AT_abstract_origin: <0xa1c90>
    <a1b6d>   DW_AT_entry_pc    : 0x468d10
    <a1b75>   DW_AT_GNU_entry_view: 1
    <a1b76>   DW_AT_ranges      : 0x17762
    <a1b7a>   DW_AT_call_file   : 1
    <a1b7a>   DW_AT_call_line   : 38
    <a1b7b>   DW_AT_call_column : 3
 <2><a1b7c>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <a1b7d>   DW_AT_abstract_origin: <0xa1c90>
    <a1b81>   DW_AT_entry_pc    : 0x468e0a
    <a1b89>   DW_AT_GNU_entry_view: 2
    <a1b8a>   DW_AT_ranges      : 0x17772
    <a1b8e>   DW_AT_call_file   : 1
    <a1b8e>   DW_AT_call_line   : 45
    <a1b8f>   DW_AT_call_column : 6
 <2><a1b90>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <a1b91>   DW_AT_abstract_origin: <0xa1c90>
    <a1b95>   DW_AT_entry_pc    : 0x468e38
    <a1b9d>   DW_AT_GNU_entry_view: 1
    <a1b9e>   DW_AT_ranges      : 0x17782
    <a1ba2>   DW_AT_call_file   : 1
    <a1ba2>   DW_AT_call_line   : 35
    <a1ba3>   DW_AT_call_column : 4
 <2><a1ba4>: Abbrev Number: 40 (DW_TAG_inlined_subroutine)
    <a1ba5>   DW_AT_abstract_origin: <0xa1c90>
    <a1ba9>   DW_AT_entry_pc    : 0x468eb0
    <a1bb1>   DW_AT_GNU_entry_view: 1
    <a1bb2>   DW_AT_low_pc      : 0x468eb0
    <a1bba>   DW_AT_high_pc     : 0x2a
    <a1bc2>   DW_AT_call_file   : 1
    <a1bc3>   DW_AT_call_line   : 56
    <a1bc4>   DW_AT_call_column : 6
 <2><a1bc5>: Abbrev Number: 13 (DW_TAG_call_site)
    <a1bc6>   DW_AT_call_return_pc: 0x468d00
    <a1bce>   DW_AT_call_origin : <0xa1a98>
    <a1bd2>   DW_AT_sibling     : <0xa1be2>
 <3><a1bd6>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1bd7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a1bd9>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><a1bdc>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1bdd>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a1bdf>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a1be1>: Abbrev Number: 0
 <2><a1be2>: Abbrev Number: 14 (DW_TAG_call_site)
    <a1be3>   DW_AT_call_return_pc: 0x468d2b
    <a1beb>   DW_AT_call_origin : <0xa1a8c>
 <2><a1bef>: Abbrev Number: 13 (DW_TAG_call_site)
    <a1bf0>   DW_AT_call_return_pc: 0x468d41
    <a1bf8>   DW_AT_call_origin : <0xa1a98>
    <a1bfc>   DW_AT_sibling     : <0xa1c0c>
 <3><a1c00>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c01>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a1c03>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <3><a1c06>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c07>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a1c09>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a1c0b>: Abbrev Number: 0
 <2><a1c0c>: Abbrev Number: 14 (DW_TAG_call_site)
    <a1c0d>   DW_AT_call_return_pc: 0x468d57
    <a1c15>   DW_AT_call_origin : <0xa1a8c>
 <2><a1c19>: Abbrev Number: 13 (DW_TAG_call_site)
    <a1c1a>   DW_AT_call_return_pc: 0x468d9b
    <a1c22>   DW_AT_call_origin : <0xa1a98>
    <a1c26>   DW_AT_sibling     : <0xa1c37>
 <3><a1c2a>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c2b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a1c2d>   DW_AT_call_value  : 3 byte block: 91 b3 7f 	(DW_OP_fbreg: -77)
 <3><a1c31>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c32>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a1c34>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a1c36>: Abbrev Number: 0
 <2><a1c37>: Abbrev Number: 14 (DW_TAG_call_site)
    <a1c38>   DW_AT_call_return_pc: 0x468ded
    <a1c40>   DW_AT_call_origin : <0xa1a8c>
 <2><a1c44>: Abbrev Number: 13 (DW_TAG_call_site)
    <a1c45>   DW_AT_call_return_pc: 0x468eb0
    <a1c4d>   DW_AT_call_origin : <0xa1a98>
    <a1c51>   DW_AT_sibling     : <0xa1c62>
 <3><a1c55>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c56>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <a1c58>   DW_AT_call_value  : 3 byte block: 91 b1 7f 	(DW_OP_fbreg: -79)
 <3><a1c5c>: Abbrev Number: 7 (DW_TAG_call_site_parameter)
    <a1c5d>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <a1c5f>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><a1c61>: Abbrev Number: 0
 <2><a1c62>: Abbrev Number: 14 (DW_TAG_call_site)
    <a1c63>   DW_AT_call_return_pc: 0x468edf
    <a1c6b>   DW_AT_call_origin : <0xa1c99>
 <2><a1c6f>: Abbrev Number: 0
 <1><a1c70>: Abbrev Number: 24 (DW_TAG_array_type)
    <a1c71>   DW_AT_type        : <0xa1543>
    <a1c75>   DW_AT_sibling     : <0xa1c80>
 <2><a1c79>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <a1c7a>   DW_AT_type        : <0xa1505>
    <a1c7e>   DW_AT_upper_bound : 1
 <2><a1c7f>: Abbrev Number: 0
 <1><a1c80>: Abbrev Number: 24 (DW_TAG_array_type)
    <a1c81>   DW_AT_type        : <0xa1543>
    <a1c85>   DW_AT_sibling     : <0xa1c90>
 <2><a1c89>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <a1c8a>   DW_AT_type        : <0xa1505>
    <a1c8e>   DW_AT_upper_bound : 2
 <2><a1c8f>: Abbrev Number: 0
 <1><a1c90>: Abbrev Number: 41 (DW_TAG_subprogram)
    <a1c91>   DW_AT_name        : (indirect string, offset: 0x1ab79): move_back
    <a1c95>   DW_AT_decl_file   : 1
    <a1c96>   DW_AT_decl_line   : 5
    <a1c97>   DW_AT_decl_column : 13
    <a1c98>   DW_AT_prototyped  : 1
    <a1c98>   DW_AT_inline      : 1	(inlined)
 <1><a1c99>: Abbrev Number: 42 (DW_TAG_subprogram)
    <a1c9a>   DW_AT_external    : 1
    <a1c9a>   DW_AT_declaration : 1
    <a1c9a>   DW_AT_linkage_name: (indirect string, offset: 0xc48b): __stack_chk_fail
    <a1c9e>   DW_AT_name        : (indirect string, offset: 0xc48b): __stack_chk_fail
 <1><a1ca2>: Abbrev Number: 0
  Compilation Unit @ offset 0xa1ca3:
   Length:        0x954 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x8ae6
   Pointer Size:  8
 <0><a1caf>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <a1cb0>   DW_AT_producer    : (indirect string, offset: 0x9c): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O3 -fno-exceptions -fno-unwind-tables -fno-asynchronous-unwind-tables
    <a1cb4>   DW_AT_language    : 29	(C11)
    <a1cb5>   DW_AT_name        : (indirect line string, offset: 0xa2d): src/gfxlib2/gfx_readxy.c
    <a1cb9>   DW_AT_comp_dir    : (indirect line string, offset: 0x19): /home/main/fbc
    <a1cbd>   DW_AT_low_pc      : 0x468ee0
    <a1cc5>   DW_AT_high_pc     : 0x119
    <a1ccd>   DW_AT_stmt_list   : 0x5d90a
 <1><a1cd1>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1cd2>   DW_AT_byte_size   : 1
    <a1cd3>   DW_AT_encoding    : 8	(unsigned char)
    <a1cd4>   DW_AT_name        : (indirect string, offset: 0x56): unsigned char
 <1><a1cd8>: Abbrev Number: 9 (DW_TAG_const_type)
    <a1cd9>   DW_AT_type        : <0xa1cd1>
 <1><a1cdd>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1cde>   DW_AT_byte_size   : 2
    <a1cdf>   DW_AT_encoding    : 7	(unsigned)
    <a1ce0>   DW_AT_name        : (indirect string, offset: 0x6e): short unsigned int
 <1><a1ce4>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1ce5>   DW_AT_byte_size   : 4
    <a1ce6>   DW_AT_encoding    : 7	(unsigned)
    <a1ce7>   DW_AT_name        : (indirect string, offset: 0x49): unsigned int
 <1><a1ceb>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1cec>   DW_AT_byte_size   : 8
    <a1ced>   DW_AT_encoding    : 7	(unsigned)
    <a1cee>   DW_AT_name        : (indirect string, offset: 0x44): long unsigned int
 <1><a1cf2>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1cf3>   DW_AT_byte_size   : 1
    <a1cf4>   DW_AT_encoding    : 6	(signed char)
    <a1cf5>   DW_AT_name        : (indirect string, offset: 0x58): signed char
 <1><a1cf9>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1cfa>   DW_AT_byte_size   : 2
    <a1cfb>   DW_AT_encoding    : 5	(signed)
    <a1cfc>   DW_AT_name        : (indirect string, offset: 0x64): short int
 <1><a1d00>: Abbrev Number: 25 (DW_TAG_base_type)
    <a1d01>   DW_AT_byte_size   : 4
    <a1d02>   DW_AT_encoding    : 5	(signed)
    <a1d03>   DW_AT_name        : int
 <1><a1d07>: Abbrev Number: 26 (DW_TAG_volatile_type)
    <a1d08>   DW_AT_type        : <0xa1d00>
 <1><a1d0c>: Abbrev Number: 9 (DW_TAG_const_type)
    <a1d0d>   DW_AT_type        : <0xa1d00>
 <1><a1d11>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d12>   DW_AT_byte_size   : 8
    <a1d13>   DW_AT_encoding    : 5	(signed)
    <a1d14>   DW_AT_name        : (indirect string, offset: 0x5): long int
 <1><a1d18>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <a1d19>   DW_AT_byte_size   : 8
 <1><a1d1a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1d1b>   DW_AT_byte_size   : 8
    <a1d1b>   DW_AT_type        : <0xa1d1f>
 <1><a1d1f>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d20>   DW_AT_byte_size   : 1
    <a1d21>   DW_AT_encoding    : 6	(signed char)
    <a1d22>   DW_AT_name        : (indirect string, offset: 0x5f): char
 <1><a1d26>: Abbrev Number: 7 (DW_TAG_typedef)
    <a1d27>   DW_AT_name        : (indirect string, offset: 0x1d2f1): size_t
    <a1d2b>   DW_AT_decl_file   : 2
    <a1d2c>   DW_AT_decl_line   : 209
    <a1d2d>   DW_AT_decl_column : 23
    <a1d2e>   DW_AT_type        : <0xa1ceb>
 <1><a1d32>: Abbrev Number: 28 (DW_TAG_typedef)
    <a1d33>   DW_AT_name        : (indirect string, offset: 0x1663a): wchar_t
    <a1d37>   DW_AT_decl_file   : 2
    <a1d38>   DW_AT_decl_line   : 321
    <a1d3a>   DW_AT_decl_column : 24
    <a1d3b>   DW_AT_type        : <0xa1d00>
 <1><a1d3f>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d40>   DW_AT_byte_size   : 8
    <a1d41>   DW_AT_encoding    : 5	(signed)
    <a1d42>   DW_AT_name        : (indirect string, offset: 0x0): long long int
 <1><a1d46>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d47>   DW_AT_byte_size   : 8
    <a1d48>   DW_AT_encoding    : 7	(unsigned)
    <a1d49>   DW_AT_name        : (indirect string, offset: 0x3f): long long unsigned int
 <1><a1d4d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1d4e>   DW_AT_byte_size   : 8
    <a1d4e>   DW_AT_type        : <0xa1d52>
 <1><a1d52>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <a1d53>   DW_AT_prototyped  : 1
 <1><a1d53>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d54>   DW_AT_byte_size   : 8
    <a1d55>   DW_AT_encoding    : 4	(float)
    <a1d56>   DW_AT_name        : (indirect string, offset: 0x184f4): double
 <1><a1d5a>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d5b>   DW_AT_byte_size   : 4
    <a1d5c>   DW_AT_encoding    : 4	(float)
    <a1d5d>   DW_AT_name        : (indirect string, offset: 0x171f9): float
 <1><a1d61>: Abbrev Number: 7 (DW_TAG_typedef)
    <a1d62>   DW_AT_name        : (indirect string, offset: 0x16659): FBMUTEX
    <a1d66>   DW_AT_decl_file   : 3
    <a1d67>   DW_AT_decl_line   : 7
    <a1d68>   DW_AT_decl_column : 25
    <a1d69>   DW_AT_type        : <0xa1d6d>
 <1><a1d6d>: Abbrev Number: 30 (DW_TAG_structure_type)
    <a1d6e>   DW_AT_name        : (indirect string, offset: 0x16658): _FBMUTEX
    <a1d72>   DW_AT_declaration : 1
 <1><a1d72>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a1d73>   DW_AT_byte_size   : 8
    <a1d74>   DW_AT_decl_file   : 4
    <a1d75>   DW_AT_decl_line   : 4
    <a1d76>   DW_AT_decl_column : 3
    <a1d76>   DW_AT_sibling     : <0xa1d95>
 <2><a1d7a>: Abbrev Number: 1 (DW_TAG_member)
    <a1d7b>   DW_AT_name        : (indirect string, offset: 0x19824): scancode
    <a1d7f>   DW_AT_decl_file   : 4
    <a1d80>   DW_AT_decl_line   : 5
    <a1d81>   DW_AT_decl_column : 8
    <a1d82>   DW_AT_type        : <0xa1d00>
    <a1d86>   DW_AT_data_member_location: 0
 <2><a1d87>: Abbrev Number: 1 (DW_TAG_member)
    <a1d88>   DW_AT_name        : (indirect string, offset: 0x1baaa): ascii
    <a1d8c>   DW_AT_decl_file   : 4
    <a1d8d>   DW_AT_decl_line   : 6
    <a1d8e>   DW_AT_decl_column : 8
    <a1d8f>   DW_AT_type        : <0xa1d00>
    <a1d93>   DW_AT_data_member_location: 4
 <2><a1d94>: Abbrev Number: 0
 <1><a1d95>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a1d96>   DW_AT_byte_size   : 16
    <a1d97>   DW_AT_decl_file   : 4
    <a1d98>   DW_AT_decl_line   : 8
    <a1d99>   DW_AT_decl_column : 3
    <a1d99>   DW_AT_sibling     : <0xa1dcc>
 <2><a1d9d>: Abbrev Number: 4 (DW_TAG_member)
    <a1d9e>   DW_AT_name        : x
    <a1da0>   DW_AT_decl_file   : 4
    <a1da1>   DW_AT_decl_line   : 9
    <a1da2>   DW_AT_decl_column : 8
    <a1da3>   DW_AT_type        : <0xa1d00>
    <a1da7>   DW_AT_data_member_location: 0
 <2><a1da8>: Abbrev Number: 4 (DW_TAG_member)
    <a1da9>   DW_AT_name        : y
    <a1dab>   DW_AT_decl_file   : 4
    <a1dac>   DW_AT_decl_line   : 9
    <a1dad>   DW_AT_decl_column : 11
    <a1dae>   DW_AT_type        : <0xa1d00>
    <a1db2>   DW_AT_data_member_location: 4
 <2><a1db3>: Abbrev Number: 4 (DW_TAG_member)
    <a1db4>   DW_AT_name        : dx
    <a1db7>   DW_AT_decl_file   : 4
    <a1db8>   DW_AT_decl_line   : 10
    <a1db9>   DW_AT_decl_column : 8
    <a1dba>   DW_AT_type        : <0xa1d00>
    <a1dbe>   DW_AT_data_member_location: 8
 <2><a1dbf>: Abbrev Number: 4 (DW_TAG_member)
    <a1dc0>   DW_AT_name        : dy
    <a1dc3>   DW_AT_decl_file   : 4
    <a1dc4>   DW_AT_decl_line   : 10
    <a1dc5>   DW_AT_decl_column : 12
    <a1dc6>   DW_AT_type        : <0xa1d00>
    <a1dca>   DW_AT_data_member_location: 12
 <2><a1dcb>: Abbrev Number: 0
 <1><a1dcc>: Abbrev Number: 14 (DW_TAG_union_type)
    <a1dcd>   DW_AT_byte_size   : 16
    <a1dcd>   DW_AT_decl_file   : 4
    <a1dce>   DW_AT_decl_line   : 3
    <a1dcf>   DW_AT_decl_column : 2
    <a1dcf>   DW_AT_sibling     : <0xa1df9>
 <2><a1dd3>: Abbrev Number: 12 (DW_TAG_member)
    <a1dd4>   DW_AT_type        : <0xa1d72>
 <2><a1dd8>: Abbrev Number: 12 (DW_TAG_member)
    <a1dd9>   DW_AT_type        : <0xa1d95>
 <2><a1ddd>: Abbrev Number: 15 (DW_TAG_member)
    <a1dde>   DW_AT_name        : (indirect string, offset: 0x1902f): button
    <a1de2>   DW_AT_decl_file   : 4
    <a1de3>   DW_AT_decl_line   : 12
    <a1de4>   DW_AT_decl_column : 7
    <a1de4>   DW_AT_type        : <0xa1d00>
 <2><a1de8>: Abbrev Number: 18 (DW_TAG_member)
    <a1de9>   DW_AT_name        : z
    <a1deb>   DW_AT_decl_file   : 4
    <a1deb>   DW_AT_decl_line   : 13
    <a1dec>   DW_AT_decl_column : 7
    <a1dec>   DW_AT_type        : <0xa1d00>
 <2><a1df0>: Abbrev Number: 18 (DW_TAG_member)
    <a1df1>   DW_AT_name        : w
    <a1df3>   DW_AT_decl_file   : 4
    <a1df3>   DW_AT_decl_line   : 14
    <a1df4>   DW_AT_decl_column : 7
    <a1df4>   DW_AT_type        : <0xa1d00>
 <2><a1df8>: Abbrev Number: 0
 <1><a1df9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a1dfa>   DW_AT_name        : (indirect string, offset: 0x1667d): _EVENT
    <a1dfe>   DW_AT_byte_size   : 20
    <a1dff>   DW_AT_decl_file   : 4
    <a1e00>   DW_AT_decl_line   : 1
    <a1e01>   DW_AT_decl_column : 8
    <a1e02>   DW_AT_sibling     : <0xa1e1a>
 <2><a1e06>: Abbrev Number: 1 (DW_TAG_member)
    <a1e07>   DW_AT_name        : (indirect string, offset: 0x1db55): type
    <a1e0b>   DW_AT_decl_file   : 4
    <a1e0c>   DW_AT_decl_line   : 2
    <a1e0d>   DW_AT_decl_column : 6
    <a1e0e>   DW_AT_type        : <0xa1d00>
    <a1e12>   DW_AT_data_member_location: 0
 <2><a1e13>: Abbrev Number: 16 (DW_TAG_member)
    <a1e14>   DW_AT_type        : <0xa1dcc>
    <a1e18>   DW_AT_data_member_location: 4
 <2><a1e19>: Abbrev Number: 0
 <1><a1e1a>: Abbrev Number: 7 (DW_TAG_typedef)
    <a1e1b>   DW_AT_name        : (indirect string, offset: 0x1db11): EVENT
    <a1e1f>   DW_AT_decl_file   : 4
    <a1e20>   DW_AT_decl_line   : 18
    <a1e21>   DW_AT_decl_column : 23
    <a1e22>   DW_AT_type        : <0xa1df9>
 <1><a1e26>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1e27>   DW_AT_byte_size   : 8
    <a1e27>   DW_AT_type        : <0xa1e2b>
 <1><a1e2b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a1e2c>   DW_AT_prototyped  : 1
    <a1e2c>   DW_AT_type        : <0xa1d00>
    <a1e30>   DW_AT_sibling     : <0xa1e3f>
 <2><a1e34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e35>   DW_AT_type        : <0xa1d00>
 <2><a1e39>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e3a>   DW_AT_type        : <0xa1d00>
 <2><a1e3e>: Abbrev Number: 0
 <1><a1e3f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1e40>   DW_AT_byte_size   : 8
    <a1e40>   DW_AT_type        : <0xa1d00>
 <1><a1e44>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1e45>   DW_AT_byte_size   : 8
    <a1e45>   DW_AT_type        : <0xa1e49>
 <1><a1e49>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a1e4a>   DW_AT_prototyped  : 1
    <a1e4a>   DW_AT_type        : <0xa1d00>
    <a1e4e>   DW_AT_sibling     : <0xa1e6c>
 <2><a1e52>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e53>   DW_AT_type        : <0xa1e3f>
 <2><a1e57>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e58>   DW_AT_type        : <0xa1e3f>
 <2><a1e5c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e5d>   DW_AT_type        : <0xa1e3f>
 <2><a1e61>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e62>   DW_AT_type        : <0xa1e3f>
 <2><a1e66>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e67>   DW_AT_type        : <0xa1e3f>
 <2><a1e6b>: Abbrev Number: 0
 <1><a1e6c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1e6d>   DW_AT_byte_size   : 8
    <a1e6d>   DW_AT_type        : <0xa1e1a>
 <1><a1e71>: Abbrev Number: 7 (DW_TAG_typedef)
    <a1e72>   DW_AT_name        : (indirect string, offset: 0x165cd): BLENDER
    <a1e76>   DW_AT_decl_file   : 5
    <a1e77>   DW_AT_decl_line   : 13
    <a1e78>   DW_AT_decl_column : 30
    <a1e79>   DW_AT_type        : <0xa1e7d>
 <1><a1e7d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a1e7e>   DW_AT_prototyped  : 1
    <a1e7e>   DW_AT_type        : <0xa1ce4>
    <a1e82>   DW_AT_sibling     : <0xa1e96>
 <2><a1e86>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e87>   DW_AT_type        : <0xa1ce4>
 <2><a1e8b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e8c>   DW_AT_type        : <0xa1ce4>
 <2><a1e90>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1e91>   DW_AT_type        : <0xa1d18>
 <2><a1e95>: Abbrev Number: 0
 <1><a1e96>: Abbrev Number: 7 (DW_TAG_typedef)
    <a1e97>   DW_AT_name        : (indirect string, offset: 0x16692): PUTTER
    <a1e9b>   DW_AT_decl_file   : 5
    <a1e9c>   DW_AT_decl_line   : 14
    <a1e9d>   DW_AT_decl_column : 15
    <a1e9e>   DW_AT_type        : <0xa1ea2>
 <1><a1ea2>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <a1ea3>   DW_AT_prototyped  : 1
    <a1ea3>   DW_AT_sibling     : <0xa1ed5>
 <2><a1ea7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ea8>   DW_AT_type        : <0xa1ed5>
 <2><a1eac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ead>   DW_AT_type        : <0xa1ed5>
 <2><a1eb1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1eb2>   DW_AT_type        : <0xa1d00>
 <2><a1eb6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1eb7>   DW_AT_type        : <0xa1d00>
 <2><a1ebb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ebc>   DW_AT_type        : <0xa1d00>
 <2><a1ec0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ec1>   DW_AT_type        : <0xa1d00>
 <2><a1ec5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ec6>   DW_AT_type        : <0xa1d00>
 <2><a1eca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ecb>   DW_AT_type        : <0xa1eda>
 <2><a1ecf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a1ed0>   DW_AT_type        : <0xa1d18>
 <2><a1ed4>: Abbrev Number: 0
 <1><a1ed5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1ed6>   DW_AT_byte_size   : 8
    <a1ed6>   DW_AT_type        : <0xa1cd1>
 <1><a1eda>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a1edb>   DW_AT_byte_size   : 8
    <a1edb>   DW_AT_type        : <0xa1e71>
 <1><a1edf>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a1ee0>   DW_AT_byte_size   : 16
    <a1ee1>   DW_AT_decl_file   : 5
    <a1ee2>   DW_AT_decl_line   : 26
    <a1ee3>   DW_AT_decl_column : 3
    <a1ee3>   DW_AT_sibling     : <0xa1f1c>
 <2><a1ee7>: Abbrev Number: 1 (DW_TAG_member)
    <a1ee8>   DW_AT_name        : (indirect string, offset: 0x1656f): view_x
    <a1eec>   DW_AT_decl_file   : 5
    <a1eed>   DW_AT_decl_line   : 27
    <a1eee>   DW_AT_decl_column : 8
    <a1eef>   DW_AT_type        : <0xa1d00>
    <a1ef3>   DW_AT_data_member_location: 0
 <2><a1ef4>: Abbrev Number: 1 (DW_TAG_member)
    <a1ef5>   DW_AT_name        : (indirect string, offset: 0x1657a): view_y
    <a1ef9>   DW_AT_decl_file   : 5
    <a1efa>   DW_AT_decl_line   : 27
    <a1efb>   DW_AT_decl_column : 16
    <a1efc>   DW_AT_type        : <0xa1d00>
    <a1f00>   DW_AT_data_member_location: 4
 <2><a1f01>: Abbrev Number: 1 (DW_TAG_member)
    <a1f02>   DW_AT_name        : (indirect string, offset: 0x165f0): view_w
    <a1f06>   DW_AT_decl_file   : 5
    <a1f07>   DW_AT_decl_line   : 27
    <a1f08>   DW_AT_decl_column : 24
    <a1f09>   DW_AT_type        : <0xa1d00>
    <a1f0d>   DW_AT_data_member_location: 8
 <2><a1f0e>: Abbrev Number: 1 (DW_TAG_member)
    <a1f0f>   DW_AT_name        : (indirect string, offset: 0x1655e): view_h
    <a1f13>   DW_AT_decl_file   : 5
    <a1f14>   DW_AT_decl_line   : 27
    <a1f15>   DW_AT_decl_column : 32
    <a1f16>   DW_AT_type        : <0xa1d00>
    <a1f1a>   DW_AT_data_member_location: 12
 <2><a1f1b>: Abbrev Number: 0
 <1><a1f1c>: Abbrev Number: 14 (DW_TAG_union_type)
    <a1f1d>   DW_AT_byte_size   : 16
    <a1f1d>   DW_AT_decl_file   : 5
    <a1f1e>   DW_AT_decl_line   : 25
    <a1f1f>   DW_AT_decl_column : 2
    <a1f1f>   DW_AT_sibling     : <0xa1f34>
 <2><a1f23>: Abbrev Number: 12 (DW_TAG_member)
    <a1f24>   DW_AT_type        : <0xa1edf>
 <2><a1f28>: Abbrev Number: 15 (DW_TAG_member)
    <a1f29>   DW_AT_name        : (indirect string, offset: 0x16794): view
    <a1f2d>   DW_AT_decl_file   : 5
    <a1f2e>   DW_AT_decl_line   : 29
    <a1f2f>   DW_AT_decl_column : 7
    <a1f2f>   DW_AT_type        : <0xa1f34>
 <2><a1f33>: Abbrev Number: 0
 <1><a1f34>: Abbrev Number: 19 (DW_TAG_array_type)
    <a1f35>   DW_AT_type        : <0xa1d00>
    <a1f39>   DW_AT_sibling     : <0xa1f44>
 <2><a1f3d>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <a1f3e>   DW_AT_type        : <0xa1ceb>
    <a1f42>   DW_AT_upper_bound : 3
 <2><a1f43>: Abbrev Number: 0
 <1><a1f44>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a1f45>   DW_AT_byte_size   : 16
    <a1f46>   DW_AT_decl_file   : 5
    <a1f47>   DW_AT_decl_line   : 32
    <a1f48>   DW_AT_decl_column : 3
    <a1f48>   DW_AT_sibling     : <0xa1f81>
 <2><a1f4c>: Abbrev Number: 1 (DW_TAG_member)
    <a1f4d>   DW_AT_name        : (indirect string, offset: 0x1656b): old_view_x
    <a1f51>   DW_AT_decl_file   : 5
    <a1f52>   DW_AT_decl_line   : 33
    <a1f53>   DW_AT_decl_column : 8
    <a1f54>   DW_AT_type        : <0xa1d00>
    <a1f58>   DW_AT_data_member_location: 0
 <2><a1f59>: Abbrev Number: 1 (DW_TAG_member)
    <a1f5a>   DW_AT_name        : (indirect string, offset: 0x16576): old_view_y
    <a1f5e>   DW_AT_decl_file   : 5
    <a1f5f>   DW_AT_decl_line   : 33
    <a1f60>   DW_AT_decl_column : 20
    <a1f61>   DW_AT_type        : <0xa1d00>
    <a1f65>   DW_AT_data_member_location: 4
 <2><a1f66>: Abbrev Number: 1 (DW_TAG_member)
    <a1f67>   DW_AT_name        : (indirect string, offset: 0x165ec): old_view_w
    <a1f6b>   DW_AT_decl_file   : 5
    <a1f6c>   DW_AT_decl_line   : 33
    <a1f6d>   DW_AT_decl_column : 32
    <a1f6e>   DW_AT_type        : <0xa1d00>
    <a1f72>   DW_AT_data_member_location: 8
 <2><a1f73>: Abbrev Number: 1 (DW_TAG_member)
    <a1f74>   DW_AT_name        : (indirect string, offset: 0x1655a): old_view_h
    <a1f78>   DW_AT_decl_file   : 5
    <a1f79>   DW_AT_decl_line   : 33
    <a1f7a>   DW_AT_decl_column : 44
    <a1f7b>   DW_AT_type        : <0xa1d00>
    <a1f7f>   DW_AT_data_member_location: 12
 <2><a1f80>: Abbrev Number: 0
 <1><a1f81>: Abbrev Number: 14 (DW_TAG_union_type)
    <a1f82>   DW_AT_byte_size   : 16
    <a1f82>   DW_AT_decl_file   : 5
    <a1f83>   DW_AT_decl_line   : 31
    <a1f84>   DW_AT_decl_column : 2
    <a1f84>   DW_AT_sibling     : <0xa1f99>
 <2><a1f88>: Abbrev Number: 12 (DW_TAG_member)
    <a1f89>   DW_AT_type        : <0xa1f44>
 <2><a1f8d>: Abbrev Number: 15 (DW_TAG_member)
    <a1f8e>   DW_AT_name        : (indirect string, offset: 0x16790): old_view
    <a1f92>   DW_AT_decl_file   : 5
    <a1f93>   DW_AT_decl_line   : 35
    <a1f94>   DW_AT_decl_column : 7
    <a1f94>   DW_AT_type        : <0xa1f34>
 <2><a1f98>: Abbrev Number: 0
 <1><a1f99>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a1f9a>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <a1f9e>   DW_AT_byte_size   : 216
    <a1f9f>   DW_AT_decl_file   : 5
    <a1fa0>   DW_AT_decl_line   : 16
    <a1fa1>   DW_AT_decl_column : 16
    <a1fa2>   DW_AT_sibling     : <0xa20b6>
 <2><a1fa6>: Abbrev Number: 4 (DW_TAG_member)
    <a1fa7>   DW_AT_name        : id
    <a1faa>   DW_AT_decl_file   : 5
    <a1fab>   DW_AT_decl_line   : 17
    <a1fac>   DW_AT_decl_column : 6
    <a1fad>   DW_AT_type        : <0xa1d00>
    <a1fb1>   DW_AT_data_member_location: 0
 <2><a1fb2>: Abbrev Number: 1 (DW_TAG_member)
    <a1fb3>   DW_AT_name        : (indirect string, offset: 0x166e6): work_page
    <a1fb7>   DW_AT_decl_file   : 5
    <a1fb8>   DW_AT_decl_line   : 18
    <a1fb9>   DW_AT_decl_column : 6
    <a1fba>   DW_AT_type        : <0xa1d00>
    <a1fbe>   DW_AT_data_member_location: 4
 <2><a1fbf>: Abbrev Number: 1 (DW_TAG_member)
    <a1fc0>   DW_AT_name        : (indirect string, offset: 0x1b7bc): line
    <a1fc4>   DW_AT_decl_file   : 5
    <a1fc5>   DW_AT_decl_line   : 19
    <a1fc6>   DW_AT_decl_column : 18
    <a1fc7>   DW_AT_type        : <0xa20b6>
    <a1fcb>   DW_AT_data_member_location: 8
 <2><a1fcc>: Abbrev Number: 1 (DW_TAG_member)
    <a1fcd>   DW_AT_name        : (indirect string, offset: 0x165e6): max_h
    <a1fd1>   DW_AT_decl_file   : 5
    <a1fd2>   DW_AT_decl_line   : 20
    <a1fd3>   DW_AT_decl_column : 6
    <a1fd4>   DW_AT_type        : <0xa1d00>
    <a1fd8>   DW_AT_data_member_location: 16
 <2><a1fd9>: Abbrev Number: 1 (DW_TAG_member)
    <a1fda>   DW_AT_name        : (indirect string, offset: 0x166b0): target_bpp
    <a1fde>   DW_AT_decl_file   : 5
    <a1fdf>   DW_AT_decl_line   : 21
    <a1fe0>   DW_AT_decl_column : 6
    <a1fe1>   DW_AT_type        : <0xa1d00>
    <a1fe5>   DW_AT_data_member_location: 20
 <2><a1fe6>: Abbrev Number: 1 (DW_TAG_member)
    <a1fe7>   DW_AT_name        : (indirect string, offset: 0x1660e): target_pitch
    <a1feb>   DW_AT_decl_file   : 5
    <a1fec>   DW_AT_decl_line   : 22
    <a1fed>   DW_AT_decl_column : 6
    <a1fee>   DW_AT_type        : <0xa1d00>
    <a1ff2>   DW_AT_data_member_location: 24
 <2><a1ff3>: Abbrev Number: 1 (DW_TAG_member)
    <a1ff4>   DW_AT_name        : (indirect string, offset: 0x167a2): last_target
    <a1ff8>   DW_AT_decl_file   : 5
    <a1ff9>   DW_AT_decl_line   : 23
    <a1ffa>   DW_AT_decl_column : 8
    <a1ffb>   DW_AT_type        : <0xa1d18>
    <a1fff>   DW_AT_data_member_location: 32
 <2><a2000>: Abbrev Number: 1 (DW_TAG_member)
    <a2001>   DW_AT_name        : (indirect string, offset: 0x16684): last_x
    <a2005>   DW_AT_decl_file   : 5
    <a2006>   DW_AT_decl_line   : 24
    <a2007>   DW_AT_decl_column : 8
    <a2008>   DW_AT_type        : <0xa1d5a>
    <a200c>   DW_AT_data_member_location: 40
 <2><a200d>: Abbrev Number: 1 (DW_TAG_member)
    <a200e>   DW_AT_name        : (indirect string, offset: 0x1668b): last_y
    <a2012>   DW_AT_decl_file   : 5
    <a2013>   DW_AT_decl_line   : 24
    <a2014>   DW_AT_decl_column : 16
    <a2015>   DW_AT_type        : <0xa1d5a>
    <a2019>   DW_AT_data_member_location: 44
 <2><a201a>: Abbrev Number: 16 (DW_TAG_member)
    <a201b>   DW_AT_type        : <0xa1f1c>
    <a201f>   DW_AT_data_member_location: 48
 <2><a2020>: Abbrev Number: 16 (DW_TAG_member)
    <a2021>   DW_AT_type        : <0xa1f81>
    <a2025>   DW_AT_data_member_location: 64
 <2><a2026>: Abbrev Number: 1 (DW_TAG_member)
    <a2027>   DW_AT_name        : (indirect string, offset: 0x16752): win_x
    <a202b>   DW_AT_decl_file   : 5
    <a202c>   DW_AT_decl_line   : 37
    <a202d>   DW_AT_decl_column : 8
    <a202e>   DW_AT_type        : <0xa1d5a>
    <a2032>   DW_AT_data_member_location: 80
 <2><a2033>: Abbrev Number: 1 (DW_TAG_member)
    <a2034>   DW_AT_name        : (indirect string, offset: 0x165c7): win_y
    <a2038>   DW_AT_decl_file   : 5
    <a2039>   DW_AT_decl_line   : 37
    <a203a>   DW_AT_decl_column : 15
    <a203b>   DW_AT_type        : <0xa1d5a>
    <a203f>   DW_AT_data_member_location: 84
 <2><a2040>: Abbrev Number: 1 (DW_TAG_member)
    <a2041>   DW_AT_name        : (indirect string, offset: 0x16565): win_w
    <a2045>   DW_AT_decl_file   : 5
    <a2046>   DW_AT_decl_line   : 37
    <a2047>   DW_AT_decl_column : 22
    <a2048>   DW_AT_type        : <0xa1d5a>
    <a204c>   DW_AT_data_member_location: 88
 <2><a204d>: Abbrev Number: 1 (DW_TAG_member)
    <a204e>   DW_AT_name        : (indirect string, offset: 0x1672b): win_h
    <a2052>   DW_AT_decl_file   : 5
    <a2053>   DW_AT_decl_line   : 37
    <a2054>   DW_AT_decl_column : 29
    <a2055>   DW_AT_type        : <0xa1d5a>
    <a2059>   DW_AT_data_member_location: 92
 <2><a205a>: Abbrev Number: 1 (DW_TAG_member)
    <a205b>   DW_AT_name        : (indirect string, offset: 0x165dd): fg_color
    <a205f>   DW_AT_decl_file   : 5
    <a2060>   DW_AT_decl_line   : 38
    <a2061>   DW_AT_decl_column : 15
    <a2062>   DW_AT_type        : <0xa1ce4>
    <a2066>   DW_AT_data_member_location: 96
 <2><a2067>: Abbrev Number: 1 (DW_TAG_member)
    <a2068>   DW_AT_name        : (indirect string, offset: 0x1ac57): bg_color
    <a206c>   DW_AT_decl_file   : 5
    <a206d>   DW_AT_decl_line   : 38
    <a206e>   DW_AT_decl_column : 25
    <a206f>   DW_AT_type        : <0xa1ce4>
    <a2073>   DW_AT_data_member_location: 100
 <2><a2074>: Abbrev Number: 1 (DW_TAG_member)
    <a2075>   DW_AT_name        : (indirect string, offset: 0x1666a): put_pixel
    <a2079>   DW_AT_decl_file   : 5
    <a207a>   DW_AT_decl_line   : 39
    <a207b>   DW_AT_decl_column : 9
    <a207c>   DW_AT_type        : <0xa20da>
    <a2080>   DW_AT_data_member_location: 104
 <2><a2081>: Abbrev Number: 1 (DW_TAG_member)
    <a2082>   DW_AT_name        : (indirect string, offset: 0x166f9): get_pixel
    <a2086>   DW_AT_decl_file   : 5
    <a2087>   DW_AT_decl_line   : 40
    <a2088>   DW_AT_decl_column : 17
    <a2089>   DW_AT_type        : <0xa20f8>
    <a208d>   DW_AT_data_member_location: 112
 <2><a208e>: Abbrev Number: 1 (DW_TAG_member)
    <a208f>   DW_AT_name        : (indirect string, offset: 0x16721): pixel_set
    <a2093>   DW_AT_decl_file   : 5
    <a2094>   DW_AT_decl_line   : 41
    <a2095>   DW_AT_decl_column : 10
    <a2096>   DW_AT_type        : <0xa2116>
    <a209a>   DW_AT_data_member_location: 120
 <2><a209b>: Abbrev Number: 1 (DW_TAG_member)
    <a209c>   DW_AT_name        : (indirect string, offset: 0x166a9): putter
    <a20a0>   DW_AT_decl_file   : 5
    <a20a1>   DW_AT_decl_line   : 42
    <a20a2>   DW_AT_decl_column : 11
    <a20a3>   DW_AT_type        : <0xa211b>
    <a20a7>   DW_AT_data_member_location: 128
 <2><a20a8>: Abbrev Number: 1 (DW_TAG_member)
    <a20a9>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a20ad>   DW_AT_decl_file   : 5
    <a20ae>   DW_AT_decl_line   : 43
    <a20af>   DW_AT_decl_column : 6
    <a20b0>   DW_AT_type        : <0xa1d00>
    <a20b4>   DW_AT_data_member_location: 208
 <2><a20b5>: Abbrev Number: 0
 <1><a20b6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a20b7>   DW_AT_byte_size   : 8
    <a20b7>   DW_AT_type        : <0xa1ed5>
 <1><a20bb>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <a20bc>   DW_AT_prototyped  : 1
    <a20bc>   DW_AT_sibling     : <0xa20d5>
 <2><a20c0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20c1>   DW_AT_type        : <0xa20d5>
 <2><a20c5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20c6>   DW_AT_type        : <0xa1d00>
 <2><a20ca>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20cb>   DW_AT_type        : <0xa1d00>
 <2><a20cf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20d0>   DW_AT_type        : <0xa1ce4>
 <2><a20d4>: Abbrev Number: 0
 <1><a20d5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a20d6>   DW_AT_byte_size   : 8
    <a20d6>   DW_AT_type        : <0xa1f99>
 <1><a20da>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a20db>   DW_AT_byte_size   : 8
    <a20db>   DW_AT_type        : <0xa20bb>
 <1><a20df>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a20e0>   DW_AT_prototyped  : 1
    <a20e0>   DW_AT_type        : <0xa1ce4>
    <a20e4>   DW_AT_sibling     : <0xa20f8>
 <2><a20e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20e9>   DW_AT_type        : <0xa20d5>
 <2><a20ed>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20ee>   DW_AT_type        : <0xa1d00>
 <2><a20f2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a20f3>   DW_AT_type        : <0xa1d00>
 <2><a20f7>: Abbrev Number: 0
 <1><a20f8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a20f9>   DW_AT_byte_size   : 8
    <a20f9>   DW_AT_type        : <0xa20df>
 <1><a20fd>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a20fe>   DW_AT_prototyped  : 1
    <a20fe>   DW_AT_type        : <0xa1d18>
    <a2102>   DW_AT_sibling     : <0xa2116>
 <2><a2106>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a2107>   DW_AT_type        : <0xa1d18>
 <2><a210b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a210c>   DW_AT_type        : <0xa1d00>
 <2><a2110>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a2111>   DW_AT_type        : <0xa1d26>
 <2><a2115>: Abbrev Number: 0
 <1><a2116>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2117>   DW_AT_byte_size   : 8
    <a2117>   DW_AT_type        : <0xa20fd>
 <1><a211b>: Abbrev Number: 19 (DW_TAG_array_type)
    <a211c>   DW_AT_type        : <0xa212b>
    <a2120>   DW_AT_sibling     : <0xa212b>
 <2><a2124>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <a2125>   DW_AT_type        : <0xa1ceb>
    <a2129>   DW_AT_upper_bound : 9
 <2><a212a>: Abbrev Number: 0
 <1><a212b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a212c>   DW_AT_byte_size   : 8
    <a212c>   DW_AT_type        : <0xa2130>
 <1><a2130>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2131>   DW_AT_byte_size   : 8
    <a2131>   DW_AT_type        : <0xa1e96>
 <1><a2135>: Abbrev Number: 7 (DW_TAG_typedef)
    <a2136>   DW_AT_name        : (indirect string, offset: 0x1658e): FB_GFXCTX
    <a213a>   DW_AT_decl_file   : 5
    <a213b>   DW_AT_decl_line   : 44
    <a213c>   DW_AT_decl_column : 3
    <a213d>   DW_AT_type        : <0xa1f99>
 <1><a2141>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a2142>   DW_AT_name        : (indirect string, offset: 0x16712): _GFX_CHAR_CELL
    <a2146>   DW_AT_byte_size   : 12
    <a2147>   DW_AT_decl_file   : 6
    <a2148>   DW_AT_decl_line   : 139
    <a2149>   DW_AT_decl_column : 16
    <a214a>   DW_AT_sibling     : <0xa2173>
 <2><a214e>: Abbrev Number: 4 (DW_TAG_member)
    <a214f>   DW_AT_name        : ch
    <a2152>   DW_AT_decl_file   : 6
    <a2153>   DW_AT_decl_line   : 140
    <a2154>   DW_AT_decl_column : 14
    <a2155>   DW_AT_type        : <0xa1d32>
    <a2159>   DW_AT_data_member_location: 0
 <2><a215a>: Abbrev Number: 4 (DW_TAG_member)
    <a215b>   DW_AT_name        : fg
    <a215e>   DW_AT_decl_file   : 6
    <a215f>   DW_AT_decl_line   : 141
    <a2160>   DW_AT_decl_column : 14
    <a2161>   DW_AT_type        : <0xa1ce4>
    <a2165>   DW_AT_data_member_location: 4
 <2><a2166>: Abbrev Number: 4 (DW_TAG_member)
    <a2167>   DW_AT_name        : bg
    <a216a>   DW_AT_decl_file   : 6
    <a216b>   DW_AT_decl_line   : 141
    <a216c>   DW_AT_decl_column : 18
    <a216d>   DW_AT_type        : <0xa1ce4>
    <a2171>   DW_AT_data_member_location: 8
 <2><a2172>: Abbrev Number: 0
 <1><a2173>: Abbrev Number: 7 (DW_TAG_typedef)
    <a2174>   DW_AT_name        : (indirect string, offset: 0x16713): GFX_CHAR_CELL
    <a2178>   DW_AT_decl_file   : 6
    <a2179>   DW_AT_decl_line   : 142
    <a217a>   DW_AT_decl_column : 3
    <a217b>   DW_AT_type        : <0xa2141>
 <1><a217f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a2180>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a2184>   DW_AT_byte_size   : 208
    <a2185>   DW_AT_decl_file   : 6
    <a2186>   DW_AT_decl_line   : 144
    <a2187>   DW_AT_decl_column : 16
    <a2188>   DW_AT_sibling     : <0xa2342>
 <2><a218c>: Abbrev Number: 4 (DW_TAG_member)
    <a218d>   DW_AT_name        : id
    <a2190>   DW_AT_decl_file   : 6
    <a2191>   DW_AT_decl_line   : 146
    <a2192>   DW_AT_decl_column : 6
    <a2193>   DW_AT_type        : <0xa1d00>
    <a2197>   DW_AT_data_member_location: 0
 <2><a2198>: Abbrev Number: 1 (DW_TAG_member)
    <a2199>   DW_AT_name        : (indirect string, offset: 0x16674): mode_num
    <a219d>   DW_AT_decl_file   : 6
    <a219e>   DW_AT_decl_line   : 147
    <a219f>   DW_AT_decl_column : 9
    <a21a0>   DW_AT_type        : <0xa1d00>
    <a21a4>   DW_AT_data_member_location: 4
 <2><a21a5>: Abbrev Number: 1 (DW_TAG_member)
    <a21a6>   DW_AT_name        : (indirect string, offset: 0x17f94): page
    <a21aa>   DW_AT_decl_file   : 6
    <a21ab>   DW_AT_decl_line   : 148
    <a21ac>   DW_AT_decl_column : 21
    <a21ad>   DW_AT_type        : <0xa20b6>
    <a21b1>   DW_AT_data_member_location: 8
 <2><a21b2>: Abbrev Number: 1 (DW_TAG_member)
    <a21b3>   DW_AT_name        : (indirect string, offset: 0x1669f): num_pages
    <a21b7>   DW_AT_decl_file   : 6
    <a21b8>   DW_AT_decl_line   : 149
    <a21b9>   DW_AT_decl_column : 9
    <a21ba>   DW_AT_type        : <0xa1d00>
    <a21be>   DW_AT_data_member_location: 16
 <2><a21bf>: Abbrev Number: 1 (DW_TAG_member)
    <a21c0>   DW_AT_name        : (indirect string, offset: 0x1661b): visible_page
    <a21c4>   DW_AT_decl_file   : 6
    <a21c5>   DW_AT_decl_line   : 150
    <a21c6>   DW_AT_decl_column : 9
    <a21c7>   DW_AT_type        : <0xa1d00>
    <a21cb>   DW_AT_data_member_location: 20
 <2><a21cc>: Abbrev Number: 1 (DW_TAG_member)
    <a21cd>   DW_AT_name        : (indirect string, offset: 0x16542): framebuffer
    <a21d1>   DW_AT_decl_file   : 6
    <a21d2>   DW_AT_decl_line   : 151
    <a21d3>   DW_AT_decl_column : 20
    <a21d4>   DW_AT_type        : <0xa1ed5>
    <a21d8>   DW_AT_data_member_location: 24
 <2><a21d9>: Abbrev Number: 4 (DW_TAG_member)
    <a21da>   DW_AT_name        : w
    <a21dc>   DW_AT_decl_file   : 6
    <a21dd>   DW_AT_decl_line   : 152
    <a21de>   DW_AT_decl_column : 9
    <a21df>   DW_AT_type        : <0xa1d00>
    <a21e3>   DW_AT_data_member_location: 32
 <2><a21e4>: Abbrev Number: 4 (DW_TAG_member)
    <a21e5>   DW_AT_name        : h
    <a21e7>   DW_AT_decl_file   : 6
    <a21e8>   DW_AT_decl_line   : 152
    <a21e9>   DW_AT_decl_column : 12
    <a21ea>   DW_AT_type        : <0xa1d00>
    <a21ee>   DW_AT_data_member_location: 36
 <2><a21ef>: Abbrev Number: 1 (DW_TAG_member)
    <a21f0>   DW_AT_name        : (indirect string, offset: 0x1acd8): depth
    <a21f4>   DW_AT_decl_file   : 6
    <a21f5>   DW_AT_decl_line   : 153
    <a21f6>   DW_AT_decl_column : 9
    <a21f7>   DW_AT_type        : <0xa1d00>
    <a21fb>   DW_AT_data_member_location: 40
 <2><a21fc>: Abbrev Number: 4 (DW_TAG_member)
    <a21fd>   DW_AT_name        : bpp
    <a2201>   DW_AT_decl_file   : 6
    <a2202>   DW_AT_decl_line   : 154
    <a2203>   DW_AT_decl_column : 9
    <a2204>   DW_AT_type        : <0xa1d00>
    <a2208>   DW_AT_data_member_location: 44
 <2><a2209>: Abbrev Number: 1 (DW_TAG_member)
    <a220a>   DW_AT_name        : (indirect string, offset: 0x180b3): pitch
    <a220e>   DW_AT_decl_file   : 6
    <a220f>   DW_AT_decl_line   : 155
    <a2210>   DW_AT_decl_column : 9
    <a2211>   DW_AT_type        : <0xa1d00>
    <a2215>   DW_AT_data_member_location: 48
 <2><a2216>: Abbrev Number: 1 (DW_TAG_member)
    <a2217>   DW_AT_name        : (indirect string, offset: 0x18071): palette
    <a221b>   DW_AT_decl_file   : 6
    <a221c>   DW_AT_decl_line   : 156
    <a221d>   DW_AT_decl_column : 19
    <a221e>   DW_AT_type        : <0xa2342>
    <a2222>   DW_AT_data_member_location: 56
 <2><a2223>: Abbrev Number: 1 (DW_TAG_member)
    <a2224>   DW_AT_name        : (indirect string, offset: 0x16703): device_palette
    <a2228>   DW_AT_decl_file   : 6
    <a2229>   DW_AT_decl_line   : 157
    <a222a>   DW_AT_decl_column : 19
    <a222b>   DW_AT_type        : <0xa2342>
    <a222f>   DW_AT_data_member_location: 64
 <2><a2230>: Abbrev Number: 1 (DW_TAG_member)
    <a2231>   DW_AT_name        : (indirect string, offset: 0x16628): color_association
    <a2235>   DW_AT_decl_file   : 6
    <a2236>   DW_AT_decl_line   : 158
    <a2237>   DW_AT_decl_column : 20
    <a2238>   DW_AT_type        : <0xa1ed5>
    <a223c>   DW_AT_data_member_location: 72
 <2><a223d>: Abbrev Number: 1 (DW_TAG_member)
    <a223e>   DW_AT_name        : (indirect string, offset: 0x16699): dirty
    <a2242>   DW_AT_decl_file   : 6
    <a2243>   DW_AT_decl_line   : 159
    <a2244>   DW_AT_decl_column : 11
    <a2245>   DW_AT_type        : <0xa1d1a>
    <a2249>   DW_AT_data_member_location: 80
 <2><a224a>: Abbrev Number: 1 (DW_TAG_member)
    <a224b>   DW_AT_name        : (indirect string, offset: 0x16789): driver
    <a224f>   DW_AT_decl_file   : 6
    <a2250>   DW_AT_decl_line   : 160
    <a2251>   DW_AT_decl_column : 29
    <a2252>   DW_AT_type        : <0xa2410>
    <a2256>   DW_AT_data_member_location: 88
 <2><a2257>: Abbrev Number: 1 (DW_TAG_member)
    <a2258>   DW_AT_name        : (indirect string, offset: 0x16642): color_mask
    <a225c>   DW_AT_decl_file   : 6
    <a225d>   DW_AT_decl_line   : 161
    <a225e>   DW_AT_decl_column : 9
    <a225f>   DW_AT_type        : <0xa1d00>
    <a2263>   DW_AT_data_member_location: 96
 <2><a2264>: Abbrev Number: 1 (DW_TAG_member)
    <a2265>   DW_AT_name        : (indirect string, offset: 0x167c2): default_palette
    <a2269>   DW_AT_decl_file   : 6
    <a226a>   DW_AT_decl_line   : 162
    <a226b>   DW_AT_decl_column : 27
    <a226c>   DW_AT_type        : <0xa2440>
    <a2270>   DW_AT_data_member_location: 104
 <2><a2271>: Abbrev Number: 1 (DW_TAG_member)
    <a2272>   DW_AT_name        : (indirect string, offset: 0x16731): scanline_size
    <a2276>   DW_AT_decl_file   : 6
    <a2277>   DW_AT_decl_line   : 163
    <a2278>   DW_AT_decl_column : 9
    <a2279>   DW_AT_type        : <0xa1d00>
    <a227d>   DW_AT_data_member_location: 112
 <2><a227e>: Abbrev Number: 1 (DW_TAG_member)
    <a227f>   DW_AT_name        : (indirect string, offset: 0x166f0): cursor_x
    <a2283>   DW_AT_decl_file   : 6
    <a2284>   DW_AT_decl_line   : 164
    <a2285>   DW_AT_decl_column : 9
    <a2286>   DW_AT_type        : <0xa1d00>
    <a228a>   DW_AT_data_member_location: 116
 <2><a228b>: Abbrev Number: 1 (DW_TAG_member)
    <a228c>   DW_AT_name        : (indirect string, offset: 0x16661): cursor_y
    <a2290>   DW_AT_decl_file   : 6
    <a2291>   DW_AT_decl_line   : 164
    <a2292>   DW_AT_decl_column : 19
    <a2293>   DW_AT_type        : <0xa1d00>
    <a2297>   DW_AT_data_member_location: 120
 <2><a2298>: Abbrev Number: 1 (DW_TAG_member)
    <a2299>   DW_AT_name        : (indirect string, offset: 0x183d5): font
    <a229d>   DW_AT_decl_file   : 6
    <a229e>   DW_AT_decl_line   : 165
    <a229f>   DW_AT_decl_column : 24
    <a22a0>   DW_AT_type        : <0xa2477>
    <a22a4>   DW_AT_data_member_location: 128
 <2><a22a5>: Abbrev Number: 1 (DW_TAG_member)
    <a22a6>   DW_AT_name        : (indirect string, offset: 0x1659f): text_w
    <a22aa>   DW_AT_decl_file   : 6
    <a22ab>   DW_AT_decl_line   : 166
    <a22ac>   DW_AT_decl_column : 9
    <a22ad>   DW_AT_type        : <0xa1d00>
    <a22b1>   DW_AT_data_member_location: 136
 <2><a22b2>: Abbrev Number: 1 (DW_TAG_member)
    <a22b3>   DW_AT_name        : (indirect string, offset: 0x16598): text_h
    <a22b7>   DW_AT_decl_file   : 6
    <a22b8>   DW_AT_decl_line   : 166
    <a22b9>   DW_AT_decl_column : 17
    <a22ba>   DW_AT_type        : <0xa1d00>
    <a22be>   DW_AT_data_member_location: 140
 <2><a22bf>: Abbrev Number: 1 (DW_TAG_member)
    <a22c0>   DW_AT_name        : (indirect string, offset: 0x18833): aspect
    <a22c4>   DW_AT_decl_file   : 6
    <a22c5>   DW_AT_decl_line   : 167
    <a22c6>   DW_AT_decl_column : 11
    <a22c7>   DW_AT_type        : <0xa1d5a>
    <a22cb>   DW_AT_data_member_location: 144
 <2><a22cc>: Abbrev Number: 4 (DW_TAG_member)
    <a22cd>   DW_AT_name        : key
    <a22d1>   DW_AT_decl_file   : 6
    <a22d2>   DW_AT_decl_line   : 168
    <a22d3>   DW_AT_decl_column : 11
    <a22d4>   DW_AT_type        : <0xa1d1a>
    <a22d8>   DW_AT_data_member_location: 152
 <2><a22d9>: Abbrev Number: 1 (DW_TAG_member)
    <a22da>   DW_AT_name        : (indirect string, offset: 0x16581): refresh_rate
    <a22de>   DW_AT_decl_file   : 6
    <a22df>   DW_AT_decl_line   : 169
    <a22e0>   DW_AT_decl_column : 6
    <a22e1>   DW_AT_type        : <0xa1d00>
    <a22e5>   DW_AT_data_member_location: 160
 <2><a22e6>: Abbrev Number: 1 (DW_TAG_member)
    <a22e7>   DW_AT_name        : (indirect string, offset: 0x167ae): con_pages
    <a22eb>   DW_AT_decl_file   : 6
    <a22ec>   DW_AT_decl_line   : 170
    <a22ed>   DW_AT_decl_column : 18
    <a22ee>   DW_AT_type        : <0xa247c>
    <a22f2>   DW_AT_data_member_location: 168
 <2><a22f3>: Abbrev Number: 1 (DW_TAG_member)
    <a22f4>   DW_AT_name        : (indirect string, offset: 0x165f7): event_queue
    <a22f8>   DW_AT_decl_file   : 6
    <a22f9>   DW_AT_decl_line   : 171
    <a22fa>   DW_AT_decl_column : 12
    <a22fb>   DW_AT_type        : <0xa1e6c>
    <a22ff>   DW_AT_data_member_location: 176
 <2><a2300>: Abbrev Number: 1 (DW_TAG_member)
    <a2301>   DW_AT_name        : (indirect string, offset: 0x16767): event_head
    <a2305>   DW_AT_decl_file   : 6
    <a2306>   DW_AT_decl_line   : 172
    <a2307>   DW_AT_decl_column : 9
    <a2308>   DW_AT_type        : <0xa1d00>
    <a230c>   DW_AT_data_member_location: 184
 <2><a230d>: Abbrev Number: 1 (DW_TAG_member)
    <a230e>   DW_AT_name        : (indirect string, offset: 0x16603): event_tail
    <a2312>   DW_AT_decl_file   : 6
    <a2313>   DW_AT_decl_line   : 172
    <a2314>   DW_AT_decl_column : 21
    <a2315>   DW_AT_type        : <0xa1d00>
    <a2319>   DW_AT_data_member_location: 188
 <2><a231a>: Abbrev Number: 1 (DW_TAG_member)
    <a231b>   DW_AT_name        : (indirect string, offset: 0x1654e): event_mutex
    <a231f>   DW_AT_decl_file   : 6
    <a2320>   DW_AT_decl_line   : 173
    <a2321>   DW_AT_decl_column : 11
    <a2322>   DW_AT_type        : <0xa2486>
    <a2326>   DW_AT_data_member_location: 192
 <2><a2327>: Abbrev Number: 1 (DW_TAG_member)
    <a2328>   DW_AT_name        : (indirect string, offset: 0x19ece): flags
    <a232c>   DW_AT_decl_file   : 6
    <a232d>   DW_AT_decl_line   : 174
    <a232e>   DW_AT_decl_column : 15
    <a232f>   DW_AT_type        : <0xa1d07>
    <a2333>   DW_AT_data_member_location: 200
 <2><a2334>: Abbrev Number: 1 (DW_TAG_member)
    <a2335>   DW_AT_name        : (indirect string, offset: 0x1664d): lock_count
    <a2339>   DW_AT_decl_file   : 6
    <a233a>   DW_AT_decl_line   : 175
    <a233b>   DW_AT_decl_column : 6
    <a233c>   DW_AT_type        : <0xa1d00>
    <a2340>   DW_AT_data_member_location: 204
 <2><a2341>: Abbrev Number: 0
 <1><a2342>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2343>   DW_AT_byte_size   : 8
    <a2343>   DW_AT_type        : <0xa1ce4>
 <1><a2347>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a2348>   DW_AT_name        : (indirect string, offset: 0x167b8): GFXDRIVER
    <a234c>   DW_AT_byte_size   : 112
    <a234d>   DW_AT_decl_file   : 6
    <a234e>   DW_AT_decl_line   : 178
    <a234f>   DW_AT_decl_column : 16
    <a2350>   DW_AT_sibling     : <0xa240b>
 <2><a2354>: Abbrev Number: 1 (DW_TAG_member)
    <a2355>   DW_AT_name        : (indirect string, offset: 0x1b271): name
    <a2359>   DW_AT_decl_file   : 6
    <a235a>   DW_AT_decl_line   : 188
    <a235b>   DW_AT_decl_column : 8
    <a235c>   DW_AT_type        : <0xa1d1a>
    <a2360>   DW_AT_data_member_location: 0
 <2><a2361>: Abbrev Number: 1 (DW_TAG_member)
    <a2362>   DW_AT_name        : (indirect string, offset: 0x1a609): init
    <a2366>   DW_AT_decl_file   : 6
    <a2367>   DW_AT_decl_line   : 208
    <a2368>   DW_AT_decl_column : 8
    <a2369>   DW_AT_type        : <0xa24bf>
    <a236d>   DW_AT_data_member_location: 8
 <2><a236e>: Abbrev Number: 1 (DW_TAG_member)
    <a236f>   DW_AT_name        : (indirect string, offset: 0x1a6b6): exit
    <a2373>   DW_AT_decl_file   : 6
    <a2374>   DW_AT_decl_line   : 222
    <a2375>   DW_AT_decl_column : 9
    <a2376>   DW_AT_type        : <0xa1d4d>
    <a237a>   DW_AT_data_member_location: 16
 <2><a237b>: Abbrev Number: 1 (DW_TAG_member)
    <a237c>   DW_AT_name        : (indirect string, offset: 0x188e3): lock
    <a2380>   DW_AT_decl_file   : 6
    <a2381>   DW_AT_decl_line   : 231
    <a2382>   DW_AT_decl_column : 9
    <a2383>   DW_AT_type        : <0xa1d4d>
    <a2387>   DW_AT_data_member_location: 24
 <2><a2388>: Abbrev Number: 1 (DW_TAG_member)
    <a2389>   DW_AT_name        : (indirect string, offset: 0x1a129): unlock
    <a238d>   DW_AT_decl_file   : 6
    <a238e>   DW_AT_decl_line   : 239
    <a238f>   DW_AT_decl_column : 9
    <a2390>   DW_AT_type        : <0xa1d4d>
    <a2394>   DW_AT_data_member_location: 32
 <2><a2395>: Abbrev Number: 1 (DW_TAG_member)
    <a2396>   DW_AT_name        : (indirect string, offset: 0x1a1e3): set_palette
    <a239a>   DW_AT_decl_file   : 6
    <a239b>   DW_AT_decl_line   : 248
    <a239c>   DW_AT_decl_column : 9
    <a239d>   DW_AT_type        : <0xa24de>
    <a23a1>   DW_AT_data_member_location: 40
 <2><a23a2>: Abbrev Number: 6 (DW_TAG_member)
    <a23a3>   DW_AT_name        : (indirect string, offset: 0x1a143): wait_vsync
    <a23a7>   DW_AT_decl_file   : 6
    <a23a7>   DW_AT_decl_line   : 258
    <a23a9>   DW_AT_decl_column : 9
    <a23aa>   DW_AT_type        : <0xa1d4d>
    <a23ae>   DW_AT_data_member_location: 48
 <2><a23af>: Abbrev Number: 6 (DW_TAG_member)
    <a23b0>   DW_AT_name        : (indirect string, offset: 0x1a10b): get_mouse
    <a23b4>   DW_AT_decl_file   : 6
    <a23b4>   DW_AT_decl_line   : 274
    <a23b6>   DW_AT_decl_column : 8
    <a23b7>   DW_AT_type        : <0xa1e44>
    <a23bb>   DW_AT_data_member_location: 56
 <2><a23bc>: Abbrev Number: 6 (DW_TAG_member)
    <a23bd>   DW_AT_name        : (indirect string, offset: 0x19f5a): set_mouse
    <a23c1>   DW_AT_decl_file   : 6
    <a23c1>   DW_AT_decl_line   : 285
    <a23c3>   DW_AT_decl_column : 9
    <a23c4>   DW_AT_type        : <0xa24de>
    <a23c8>   DW_AT_data_member_location: 64
 <2><a23c9>: Abbrev Number: 6 (DW_TAG_member)
    <a23ca>   DW_AT_name        : (indirect string, offset: 0x166cf): set_window_title
    <a23ce>   DW_AT_decl_file   : 6
    <a23ce>   DW_AT_decl_line   : 293
    <a23d0>   DW_AT_decl_column : 9
    <a23d1>   DW_AT_type        : <0xa24ee>
    <a23d5>   DW_AT_data_member_location: 72
 <2><a23d6>: Abbrev Number: 6 (DW_TAG_member)
    <a23d7>   DW_AT_name        : (indirect string, offset: 0x167d2): set_window_pos
    <a23db>   DW_AT_decl_file   : 6
    <a23db>   DW_AT_decl_line   : 301
    <a23dd>   DW_AT_decl_column : 8
    <a23de>   DW_AT_type        : <0xa1e26>
    <a23e2>   DW_AT_data_member_location: 80
 <2><a23e3>: Abbrev Number: 6 (DW_TAG_member)
    <a23e4>   DW_AT_name        : (indirect string, offset: 0x19f08): fetch_modes
    <a23e8>   DW_AT_decl_file   : 6
    <a23e8>   DW_AT_decl_line   : 314
    <a23ea>   DW_AT_decl_column : 9
    <a23eb>   DW_AT_type        : <0xa2507>
    <a23ef>   DW_AT_data_member_location: 88
 <2><a23f0>: Abbrev Number: 6 (DW_TAG_member)
    <a23f1>   DW_AT_name        : (indirect string, offset: 0x1a333): flip
    <a23f5>   DW_AT_decl_file   : 6
    <a23f5>   DW_AT_decl_line   : 321
    <a23f7>   DW_AT_decl_column : 9
    <a23f8>   DW_AT_type        : <0xa1d4d>
    <a23fc>   DW_AT_data_member_location: 96
 <2><a23fd>: Abbrev Number: 6 (DW_TAG_member)
    <a23fe>   DW_AT_name        : (indirect string, offset: 0x165bb): poll_events
    <a2402>   DW_AT_decl_file   : 6
    <a2402>   DW_AT_decl_line   : 328
    <a2404>   DW_AT_decl_column : 9
    <a2405>   DW_AT_type        : <0xa1d4d>
    <a2409>   DW_AT_data_member_location: 104
 <2><a240a>: Abbrev Number: 0
 <1><a240b>: Abbrev Number: 9 (DW_TAG_const_type)
    <a240c>   DW_AT_type        : <0xa2347>
 <1><a2410>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2411>   DW_AT_byte_size   : 8
    <a2411>   DW_AT_type        : <0xa240b>
 <1><a2415>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a2416>   DW_AT_name        : (indirect string, offset: 0x165d5): PALETTE
    <a241a>   DW_AT_byte_size   : 16
    <a241a>   DW_AT_decl_file   : 6
    <a241a>   DW_AT_decl_line   : 331
    <a241c>   DW_AT_decl_column : 16
    <a241c>   DW_AT_sibling     : <0xa243b>
 <2><a2420>: Abbrev Number: 6 (DW_TAG_member)
    <a2421>   DW_AT_name        : (indirect string, offset: 0x18d3d): colors
    <a2425>   DW_AT_decl_file   : 6
    <a2425>   DW_AT_decl_line   : 333
    <a2427>   DW_AT_decl_column : 12
    <a2428>   DW_AT_type        : <0xa1d0c>
    <a242c>   DW_AT_data_member_location: 0
 <2><a242d>: Abbrev Number: 6 (DW_TAG_member)
    <a242e>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a2432>   DW_AT_decl_file   : 6
    <a2432>   DW_AT_decl_line   : 334
    <a2434>   DW_AT_decl_column : 23
    <a2435>   DW_AT_type        : <0xa250c>
    <a2439>   DW_AT_data_member_location: 8
 <2><a243a>: Abbrev Number: 0
 <1><a243b>: Abbrev Number: 9 (DW_TAG_const_type)
    <a243c>   DW_AT_type        : <0xa2415>
 <1><a2440>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2441>   DW_AT_byte_size   : 8
    <a2441>   DW_AT_type        : <0xa243b>
 <1><a2445>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a2446>   DW_AT_name        : (indirect string, offset: 0x16784): FONT
    <a244a>   DW_AT_byte_size   : 16
    <a244a>   DW_AT_decl_file   : 6
    <a244a>   DW_AT_decl_line   : 337
    <a244c>   DW_AT_decl_column : 16
    <a244c>   DW_AT_sibling     : <0xa2472>
 <2><a2450>: Abbrev Number: 22 (DW_TAG_member)
    <a2451>   DW_AT_name        : w
    <a2453>   DW_AT_decl_file   : 6
    <a2453>   DW_AT_decl_line   : 339
    <a2455>   DW_AT_decl_column : 15
    <a2455>   DW_AT_type        : <0xa1d0c>
    <a2459>   DW_AT_data_member_location: 0
 <2><a245a>: Abbrev Number: 22 (DW_TAG_member)
    <a245b>   DW_AT_name        : h
    <a245d>   DW_AT_decl_file   : 6
    <a245d>   DW_AT_decl_line   : 340
    <a245f>   DW_AT_decl_column : 15
    <a245f>   DW_AT_type        : <0xa1d0c>
    <a2463>   DW_AT_data_member_location: 4
 <2><a2464>: Abbrev Number: 6 (DW_TAG_member)
    <a2465>   DW_AT_name        : (indirect string, offset: 0x18a58): data
    <a2469>   DW_AT_decl_file   : 6
    <a2469>   DW_AT_decl_line   : 341
    <a246b>   DW_AT_decl_column : 23
    <a246c>   DW_AT_type        : <0xa250c>
    <a2470>   DW_AT_data_member_location: 8
 <2><a2471>: Abbrev Number: 0
 <1><a2472>: Abbrev Number: 9 (DW_TAG_const_type)
    <a2473>   DW_AT_type        : <0xa2445>
 <1><a2477>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2478>   DW_AT_byte_size   : 8
    <a2478>   DW_AT_type        : <0xa2472>
 <1><a247c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a247d>   DW_AT_byte_size   : 8
    <a247d>   DW_AT_type        : <0xa2481>
 <1><a2481>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2482>   DW_AT_byte_size   : 8
    <a2482>   DW_AT_type        : <0xa2173>
 <1><a2486>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a2487>   DW_AT_byte_size   : 8
    <a2487>   DW_AT_type        : <0xa1d61>
 <1><a248b>: Abbrev Number: 7 (DW_TAG_typedef)
    <a248c>   DW_AT_name        : (indirect string, offset: 0x166e0): FBGFX
    <a2490>   DW_AT_decl_file   : 6
    <a2491>   DW_AT_decl_line   : 176
    <a2492>   DW_AT_decl_column : 3
    <a2493>   DW_AT_type        : <0xa217f>
 <1><a2497>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a2498>   DW_AT_prototyped  : 1
    <a2498>   DW_AT_type        : <0xa1d00>
    <a249c>   DW_AT_sibling     : <0xa24bf>
 <2><a24a0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24a1>   DW_AT_type        : <0xa1d1a>
 <2><a24a5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24a6>   DW_AT_type        : <0xa1d00>
 <2><a24aa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24ab>   DW_AT_type        : <0xa1d00>
 <2><a24af>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24b0>   DW_AT_type        : <0xa1d00>
 <2><a24b4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24b5>   DW_AT_type        : <0xa1d00>
 <2><a24b9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24ba>   DW_AT_type        : <0xa1d00>
 <2><a24be>: Abbrev Number: 0
 <1><a24bf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a24c0>   DW_AT_byte_size   : 8
    <a24c0>   DW_AT_type        : <0xa2497>
 <1><a24c4>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <a24c5>   DW_AT_prototyped  : 1
    <a24c5>   DW_AT_sibling     : <0xa24de>
 <2><a24c9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24ca>   DW_AT_type        : <0xa1d00>
 <2><a24ce>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24cf>   DW_AT_type        : <0xa1d00>
 <2><a24d3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a24d4>   DW_AT_type        : <0xa1d00>
